{
  "sid": "gwkljw",
  "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/",
  "title:": "Tenure denial, and how early-career researchers can survive it: scientists with first-hand experience of rejection offer their advice",
  "text": "I wanted to share a \"Career Feature\" article on Nature that I thought other people here will find valuable: https://www.nature.com/articles/d41586-019-00219-5\n\nThe title of the post sums up the article's topic (scientists with experience of tenure denial share their experiences and advice).",
  "author": "randomusefulbits",
  "created": 1591287598,
  "updated": 1634080765,
  "over_18": false,
  "upvotes": 183,
  "upvote_ratio": 0.99,
  "comments": {
    "fsw8yiv": {
      "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsw8yiv/",
      "text": "I knew someone who was denied tenure at an Ivy in the 1970's. He was then hired at my alma mater to help kick start the program. Fast forward 40 years. His retiring h-index was >100, he was measurably one of the top 50 active scientists by research impact in the entire field, he won the top career award, and the program he helped found is now one of the top 15 in North America.  He passed away recently; maybe this story can be heartening to a few people.",
      "author": "DrParapraxis",
      "created": 1591300559,
      "upvotes": 82,
      "replies": {
        "fsx08qe": {
          "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsx08qe/",
          "text": "This is an amazing story, but let's be real, pre-2000s academia might as well be a different dimension of time and space.",
          "author": "pastaandpizza",
          "created": 1591313930,
          "upvotes": 72,
          "replies": {
            "fsyqvrt": {
              "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsyqvrt/",
              "text": "Very true. Someone who was hired in the 70s facetiously described it to me as, \"if you could make it onto campus with your PhD in hand they probably had a job for you.\"",
              "author": "DrParapraxis",
              "created": 1591358903,
              "upvotes": 2,
              "replies": {
                "fszx5d6": {
                  "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fszx5d6/",
                  "text": "One of my mentors told me the story of getting his first job- he was visiting family in the area and just decided on a whim to pop into a local university and let the department know he was a current PhD student and would be interested in working there after graduation.  He left town with an offer in hand the next day after meeting no one but the Department Chair.",
                  "author": null,
                  "created": 1591381027,
                  "upvotes": 4,
                  "replies": {
                    "ft4jlhg": {
                      "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/ft4jlhg/",
                      "text": "Oof. The major reason my current department is in good shape now is because they hired a chair in the early 80's who made them stop doing that. \"Yes, we actually need to advertise the position widely and not just call up your buddy \\[at middling nearby PhD program\\] to see which ABD he wants us to hire this year.\"",
                      "author": "DrParapraxis",
                      "created": 1591453273,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "fsysgji": {
                  "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsysgji/",
                  "text": "Right. Even in to the 90s you could be hired straight from your PhD depending on the field.",
                  "author": "pastaandpizza",
                  "created": 1591360041,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fsx6kvs": {
          "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsx6kvs/",
          "text": "My father was denied tenure at a state school and from that got a job at an ivy. He got tenure there shortly thereafter. Now he works in the White House unfortunately.",
          "author": "Bill_Nihilist",
          "created": 1591317432,
          "upvotes": 19,
          "replies": {
            "fsz52ih": {
              "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsz52ih/",
              "text": "Who is your father ? — I know you won’t say lol",
              "author": "FoCoCS",
              "created": 1591367427,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "fsxi9a4": {
          "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsxi9a4/",
          "text": "\"I know a guy who was denied tenure and now he's dead\"",
          "author": "guttata",
          "created": 1591324130,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "fswhfjn": {
      "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fswhfjn/",
      "text": "[deleted]",
      "author": null,
      "created": 1591304463,
      "upvotes": 57,
      "replies": {
        "fsx1i2x": {
          "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsx1i2x/",
          "text": "Thanks for highlighting how traumatic this can be. If you feel comfortable, I wonder if you would be willing to share lessons you learned and changes in your view of your career that you think might help (or be important data points for) those of us that haven’t yet faced this hurdle. \n\nI think of this as learning about relationships not only from people who have had “smooth” relationships but also from those who have had rocky moments too.",
          "author": "xmaester",
          "created": 1591314610,
          "upvotes": 18,
          "replies": {
            "fsx76c7": {
              "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsx76c7/",
              "text": "[deleted]",
              "author": null,
              "created": 1591317767,
              "upvotes": 28,
              "replies": {
                "fsx9noq": {
                  "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsx9noq/",
                  "text": "For what it’s worth, you have a lovely degree of beauty in your words, their honesty, and their clarity.",
                  "author": "BananasonThebrain",
                  "created": 1591319168,
                  "upvotes": 10,
                  "replies": {}
                },
                "fsy0j01": {
                  "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsy0j01/",
                  "text": "Thank you for sharing your experience. I appreciate your candor. I can imagine how hard that must have been. Sounds like you’ve also done a lot of reflecting on how and why things went the way they did. \n\nAs someone who struggles with imposter syndrome, it was helpful to hear about your experience. It feels like much of the process is a game of perception and self promotion. \n\nReally glad to hear that teaching is a more passionate affair for you. In my view, there are many different ways to measure the value of our work and different people have elements that are more energizing and meaningful to them -  regardless of the apparent prestige.\n\nThanks again for sharing your experience.",
                  "author": "xmaester",
                  "created": 1591335905,
                  "upvotes": 5,
                  "replies": {
                    "fsz96nf": {
                      "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsz96nf/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1591369517,
                      "upvotes": 3,
                      "replies": {
                        "ft4xy8w": {
                          "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/ft4xy8w/",
                          "text": "So true. I wish more schools valued teaching and research in teaching and higher education a little closer to the impact that it has on students and the university's mission as a whole.   \n\n\nOne of my role models at my university comes from a STEM background and now does a lot of research about student-centered learning and teaching postdocs and graduate students how to do student-centered learning. It's really challenged my thinking about what matters. I know she's applying for grants to support this type of work with varying degrees of success, and know she transitioned into this kind of work after getting tenure; nevertheless, it's heartening to know that there are people who care and are trying to move the needle forward on teaching however they can.",
                          "author": "xmaester",
                          "created": 1591458057,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fswpx0d": {
      "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fswpx0d/",
      "text": "The UK system works a little differently but essentially your contract is permanent (or ongoing as they now call) it after a period of review (usually 2-3 years).  I work in a top-tier University and recently I've seen a shift in my field (Computer Science) where we actually struggle to recruit permanent faculty in the first place. This wasn't the case \\~10 years ago when I started working as a faculty member but I think the job market is so strong in software now that academia just doesn't cut it anymore.",
      "author": "edinburghweather",
      "created": 1591308594,
      "upvotes": 12,
      "replies": {
        "fsy5wh7": {
          "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsy5wh7/",
          "text": "The difference between tenure and the UK's system is that it's only nominally permanent in the UK. A department can decide to \"restructure\" at any time.",
          "author": "dapt",
          "created": 1591340138,
          "upvotes": 5,
          "replies": {
            "ft0b3b8": {
              "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/ft0b3b8/",
              "text": "True. However, these “restructuring” exercises are fairly rare, so a permanent job in academia is still one of the most stable jobs you can find in the UK.",
              "author": "edinburghweather",
              "created": 1591387667,
              "upvotes": 2,
              "replies": {
                "ft2jre1": {
                  "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/ft2jre1/",
                  "text": "Watch out for REF2021 ;-)",
                  "author": "dapt",
                  "created": 1591425760,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fswrre3": {
      "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fswrre3/",
      "text": "Nature are half the problem",
      "author": "radionul",
      "created": 1591309513,
      "upvotes": 10,
      "replies": {}
    },
    "fsz5ggl": {
      "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsz5ggl/",
      "text": "I know a few people that have been denied tenure and their path has been different post denial. \n\nI know a few people that there was no way they would get tenure and they did. \n\nI also know this one person who was denied tenure, sue the university, provost overturned her denial into acceptance and the person dropped the legal case. \n\nSo many cases. All one can do is work hard towards tenure and hope for the best but be ready for the worst.",
      "author": "FoCoCS",
      "created": 1591367628,
      "upvotes": 1,
      "replies": {}
    },
    "fsyvrfx": {
      "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsyvrfx/",
      "text": "> for those who were denied tenure because of alleged sexism or racism, such advice might rankle. One scientist, who asked to remain anonymous, says that over a 20-year period before, during and after her time at a certain Ivy League university, her department hired about 20 tenure-track faculty members, including her; half were men, and half women. Nine of the men received tenure, she says, and none of the women did. At the time of her own denial of tenure, she says, she had two grants from the US National Institutes of Health and 11 published papers, one in a high-impact journal; she also had 20 letters of recommendation, including some from Nobel prizewinners. “I was just as good as other young faculty coming up for tenure; I just wasn’t as visible,” she says. “That’s the word they used, unofficially — ‘visible’, and what they meant was famous in my field, having stature, clout.”\nThe researcher adds that, because of her shyness, she didn’t attend many meetings in her discipline and was never invited to present as a speaker. \n\nI hate racism and sexism, but I also hate it when people allow themselves to overlook a major weakness like this \"shyness\" in favour of blaming racism/sexism.\n\nThis overlooking only undermines genuine efforts to overcome isms.",
      "author": "pressed",
      "created": 1591362207,
      "upvotes": 0,
      "replies": {
        "fsz951n": {
          "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/fsz951n/",
          "text": "It's incredibly difficult to figure out whether discrimination occurred when N=1 and I agree that skipping conferences is a very bad career move. But the department's overall record of 90% men tenured and 0% women suggests that, maybe, there was something else going on too. Some of the psychological research suggests that when judging superstar, exceptional candidates then women may have some advantage over men and receive higher evaluations. But make it a little more ambiguous--with borderline cases or candidates with one or two weaknesses--then women get treated much more harshly. So in this case, a lack of conferences is a weakness but would her department have similarly pounced on and rejected a male candidate like that? Given their track record I'm not confident.",
          "author": "DrParapraxis",
          "created": 1591369495,
          "upvotes": 6,
          "replies": {
            "ft029e1": {
              "link": "/r/AskAcademia/comments/gwkljw/tenure_denial_and_how_earlycareer_researchers_can/ft029e1/",
              "text": "The statistics do support your perspective. \n\nMy point was related to your quoted research. As a woman in STEM, I need to react to that fact by being exceptional. I can't afford to be average. That's exactly my point.",
              "author": "pressed",
              "created": 1591383475,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}