{
  "sid": "p0mnst",
  "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/",
  "title:": "Help! How do I survive a PhD with chronic fatigue??",
  "text": "So to give you some context: I've been living with anxiety and mild depression for more than 10ish years. While I've somewhat successfully learned to navigate it, some of the hardest parts of it are the periods of chronic fatigue that I've felt a lot more since 2017 (think spending hours in bed in absolute exhaustion, sleeping at random hours for long stretches, feeling tired from basic chores and even walking to school/supermarket and back. Sometimes it's so bad that I'm too tired to even  go grocery shopping and when I do manage to drag myself, I'm exhausted and need a 2-3 hour naps right after. I also take double the amount of time to do a task because I fade/burn out quite quickly.) I've been in therapy for years and it helps a great deal with panic attacks and other spells of dizziness and worry, but not much with my fatigue.\n\nI'm starting my PhD in Psychology in the US in a few weeks. I'm really worried about how I can manage doing this degree with my health. I managed my MA mostly because I had class only once a week, and a very supportive partner in the same city. I panic every time I think about managing classes, research, teaching, homework, chores, and socializing with this giant pain in the ass fatigue.\n\nI'm going to be an international student at my school, and on a very strict visa so there are a lot of concerns with taking it completely at my pace. I plan on talking to my PI about it once I'm actually at Uni.\n\nCoffee doesn't help and I've been taking vitamins haven't made much difference either. Cold weather aggravates it, and from what I hear, winters at where I'm going are quite harsh.\n\nIf anyone has any tips on how I can survive grad school on 50% less energy, I'd be so grateful.",
  "author": "casualtherapist",
  "created": 1628455706,
  "updated": 1634079952,
  "over_18": false,
  "upvotes": 134,
  "upvote_ratio": 0.94,
  "comments": {
    "h883vmx": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h883vmx/",
      "text": "I have chronic fatigue from depression, medicine has helped some…. but I completed an experimental engineering PhD and am now a TT faculty.  You can do it, just work at the times that work for you.  Don’t try to be a 9-5 kind of person.",
      "author": "PolarCredenza",
      "created": 1628464995,
      "upvotes": 81,
      "replies": {
        "h88qbsd": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h88qbsd/",
          "text": "This.\n\nMy classmates and I have auto immune diseases and we work strange hours. My motto has been to work consistently but not heavily. So I would recommend building a work rhythm (e.g  work schedule) that helps you know what to prioritize when you're having bad days but also to help you stay on top of things when you're feeling good. Don't leave things to the last minute in case you have a flare up close to deadlines",
          "author": "frankie_prince164",
          "created": 1628476669,
          "upvotes": 49,
          "replies": {
            "h88vlbk": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h88vlbk/",
              "text": "Along with this, a “routine” rather than a “schedule” is helpful for a lot of people! As in, we do A, B, C, in that order as we move through the day, but not tied to particular times. That’s nigh impossible with specific class times, of course, but maybe for life/chores/research/homework it would be a thought for keeping things moving while still allowing space - both physical and mental - for your body to catch up.",
              "author": "themathymaestro",
              "created": 1628479634,
              "upvotes": 19,
              "replies": {
                "h8aqpl9": {
                  "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8aqpl9/",
                  "text": "Oh yes, this sounds good - creating a routine for other activities around the rigid stuff (classes, meeting). Thank you!!",
                  "author": "casualtherapist",
                  "created": 1628524216,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h894x8o": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h894x8o/",
              "text": "It is good advice not to leave things to the last minutes. I am always working ahead to bank time in case I get really sick and need to rest.",
              "author": "lilyflower32",
              "created": 1628485597,
              "upvotes": 12,
              "replies": {
                "h8aqt4i": {
                  "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8aqt4i/",
                  "text": "Oh, I feel this - my anxiety needs to start work the minute the syllabus is assigned, so I'll definitely try to give myself as much of a head start as possible!",
                  "author": "casualtherapist",
                  "created": 1628524258,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h8aqm4l": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8aqm4l/",
              "text": "Oh, I like this! So much of the internet is about building rigid schedules, and this sounds like a good plan to create a rhythm instead.  Thank you <3",
              "author": "casualtherapist",
              "created": 1628524174,
              "upvotes": 2,
              "replies": {
                "h8b5t1o": {
                  "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8b5t1o/",
                  "text": "No problem! Rigid schedules just make me feel defeated when I'm not having a good day so I try to make my schedule as flexible as possible. But also keep me motivated to work as I can. \n\nIn terms of how I do this, i use a mix of creating schedules in Google calendars to section out my days (e.g. Thursday mornings are for publications, Thursday afternoons for communtiy volunteering) and bullet journals. It took me a few years to figure it out but I think I have the perfect (for me) system now.",
                  "author": "frankie_prince164",
                  "created": 1628530621,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "h894sf1": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h894sf1/",
          "text": "I have fibromyalgia and with that a ton of fatigue. I did my PhD and now I'm a professor. I can't work 9-5. I tend to work the morning and then at night. I also tend to work most days and spread out the work over those days. This isn't really healthly so I'm trying to at least take a day off a week. I think that a PhD can be done but I also know it has limited me in my success. Without my chronic illnesses I am sure I'd have more publications.",
          "author": "lilyflower32",
          "created": 1628485504,
          "upvotes": 21,
          "replies": {
            "h8aqvf1": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8aqvf1/",
              "text": "Comments like this give me the most hope, that this is going to be tough, but is doable. Thank you :)",
              "author": "casualtherapist",
              "created": 1628524287,
              "upvotes": 2,
              "replies": {
                "h8rcad4": {
                  "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8rcad4/",
                  "text": "Yes, it is possible! I feel like there is so much I could say on this topic so I will just say if you have questions or want to discuss anything further feel free to message me.",
                  "author": "lilyflower32",
                  "created": 1628840782,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h8aqfrs": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8aqfrs/",
          "text": "This gives me so much hope - thank you so much!!!",
          "author": "casualtherapist",
          "created": 1628524100,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h87xlyy": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h87xlyy/",
      "text": "Oof this is a hard one. I have ongoing chronic medical issues, maybe fibromyalgia, maybe something autoimmune but it definitely comes with its fair share of fatigue, but it sounds like it's not as extreme as what you're dealing with. A lot of it is just trying to be really disciplined with good schedule that includes time to maintain my health (sleep, exercise) and getting as far ahead as possible when I feel good. I tried some medications that have helped some too. Ultimately though this is a really individual thing. What works for anyone else isn't necessarily going to work for you.",
      "author": "mediocre-spice",
      "created": 1628461888,
      "upvotes": 12,
      "replies": {
        "h87xyiu": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h87xyiu/",
          "text": "This is so helpful - the doctors in my country aren't the nicest and completely ignored me and not even checking for anything autoimmune/FM. Would you be comfortable what medications you tried?",
          "author": "casualtherapist",
          "created": 1628462057,
          "upvotes": 7,
          "replies": {
            "h88053o": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h88053o/",
              "text": "I've tried lyrica and amitriptyline, though neither ultimately ended up working for me. Cymbalta is another common option. My doctor explained the goal with drugs is less as a fix as much as something that might temporarily make things more manageable so you can get exercise, other habits in place that will reduce symptoms long term. You could also look into cognitive behavioral therapy specifically for chronic fatigue if that's not the therapy you've already done, not something I've tried but there seems to be evidence for it.  \n\nI would definitely try to get second opinions to see what specifically makes sense for your situation, like I said it's a really individual thing.",
              "author": "mediocre-spice",
              "created": 1628463121,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "h8878fh": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8878fh/",
      "text": "Don’t listen to the random medical advice you got from Reddit. Get actual medical advice from experts.\n\nMake these issues very clear to your advisor, committee, and any other relevant supervisors, if you haven’t already. Despite accommodations it may be a deal breaker in some cases depending on what is required of you in your program as far as teaching or research.\n\nI think you’re in for a rough ride but best of luck.",
      "author": null,
      "created": 1628466672,
      "upvotes": 27,
      "replies": {}
    },
    "h898sw7": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h898sw7/",
      "text": "A PhD is hard work! But, I’ve found there are ways to do your PhD smarter, and when you already have little energy it’s important to learn to avoid extra stressors and make sure some basic skills for your PhD (writing, presenting, analysis, networking etc) are relatively well developed so they won’t give you extra stress. Stress about your PhD is a huge part of what takes energy, sometimes even more than the PhD work itself, so try to get support in learning coping mechanisms in your daily work that give you the skill and confidence to work productively when you have your good moments. Invest in time management, planning, task management, building in moments for success and rewarding yourself in between, and know to be kind to yourself :). \n\nI realize your PhD program in the US is different from the EU system, but I just share my experience hoping it’s any help. \nWhat helped me a lot in my EU university was the realization that getting a PhD is not necessarily about your final product, but about you becoming an integer, independent and resourceful researcher. That said: the product you write can perhaps be negotiated with your supervisor, so you can work the way that suits your qualities best. For me, writing my PhD in articles gives me a much needed flexibility to adapt to my own health, but also to for example the covid crisis and issues visiting labs internationally. It also tracks your progress and productivity in a different way that building a single, all-meaning manuscript. That way writing in articles is more motivating, and in comparison saves me spells of panic and insecurity, lack of progress, not being able to see clear results, while instead it makes separating your work into smaller tasks easier, and makes me work smarter rather than harder.",
      "author": "Shadow_Deer",
      "created": 1628488490,
      "upvotes": 7,
      "replies": {
        "h8asfu8": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8asfu8/",
          "text": "I like this - \"becoming an integer, independent and resourceful researcher.\" Helps me keep my focus on the larger picture. Thank you!!",
          "author": "casualtherapist",
          "created": 1628524957,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h87ojlg": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h87ojlg/",
      "text": "Did you engage with the disability/accommodations services at your uni when you did your MA? Or your degree before this? Because you are going to have to work with them a lot at your new institution.\n\nThis isn't a fun thing to say, but you're facing a hell of a challenge. And I wonder why after your struggle with your MA, and the recognition that you got through it \"mostly because I had class only once a week, and a very supportive partner in the same city\", why you would choose to move countries to do a PhD? What were your expectations of a PhD? Clearly you recognise there is a difference between a PhD and your MA experience, so I'm wondering if that is a new realisation or if you just didn't consider it before.\n\nThe key thing here, to circle back to the start of my comment, is *you* realising what adjustments you require in order to manage *your* PhD. Because you're the one that is going to have to tell the accommodations people what accommodations you require. And keep in mind these have to be reasonable adjustments.\n\nPeople can give you vague and general tips, but I would hope that you already have some coping mechanisms to deal with your fatigue, because these are what you're going to have to apply to this situation.\n\nI'm not trying to be overly negative; if you were a home student I'd suggest flexible working with the option to explore going part time, or making use of leaves of absence, whichever fits for you. But as an international student on a visa you have very little wiggle room in this area.",
      "author": "foibleShmoible",
      "created": 1628457575,
      "upvotes": 46,
      "replies": {
        "h87r6se": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h87r6se/",
          "text": "I didn't use the disability services at all actually - mostly because I had the advantage of time and my friends' help. It was also a non-conventional MA, with no exams at all, just assignments, most of which I could do at my pace.\n\nI unfortunately had to move countries because I wanted a specific advisor and more importantly funding. I did consider the exhaustion of a PhD, but tbh I didn't expect to actually get in to the program. It's becoming a much more serious consideration now that I'm actually going to do it. I know I've wanted to do a PhD since I was 19 (nearly 25 now), and have also very strategically worked towards it - very laser-focused and genuinely grabbing every opportunity I could. \n\nKnowing what accommodations I need is important - thank you for highlighting this for me!!",
          "author": "casualtherapist",
          "created": 1628458808,
          "upvotes": 21,
          "replies": {
            "h89qyxm": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h89qyxm/",
              "text": "Contact the disability services and ask about getting an ADHD screening. I was in a similar state to you when I got diagnosed my third year. They were able to get me screened and reimburse the cost. Inattentive ADHD is EXHAUSTING. I can't tell you how many times I've googled chronic fatigue in the last thirty years.\n\nI sent you resources via pm.",
              "author": "nnomadic",
              "created": 1628504364,
              "upvotes": 6,
              "replies": {
                "h8ariim": {
                  "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8ariim/",
                  "text": "My Uni's Health Centre has already said they don't do ADHD screenings or reimburse ADHD medication. But this said, I will reach out. Thank you!",
                  "author": "casualtherapist",
                  "created": 1628524561,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "h8aoh85": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8aoh85/",
              "text": "I would suggest speaking to disability services regardless. They can let you know whats available, make some kind of support plan and even if you never end up using it, at least its there! For me (ADHD) I feel some relief someone knows, just in case. But that's just me! Didn't use it for my MA but think I should have (also unconventional, no exams) rather than struggling along on my own.",
              "author": "_Shug",
              "created": 1628523254,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h88q9zk": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h88q9zk/",
      "text": "I would encourage you to see a psychiatrist. I was diagnosed with ADHD. Post tenure. Id been in therapy for years and it went completely undetected.",
      "author": "yourmomdotbiz",
      "created": 1628476643,
      "upvotes": 17,
      "replies": {
        "h8a6871": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8a6871/",
          "text": "Chronic fatigue syndrome is not a psychiatric illness. I invite you to read more about this illness. It is linked to an immune dysfunction and chronic inflammation in the nervous system. This illness is unfairly psychiatrized in particular by the medical community. Encouraging people to see psychiatrists due to debilitating organic symptoms is perpetuating these harmful and stigma-laden ways to think about people who have to deal with this exhaustion.",
          "author": "Scientism101",
          "created": 1628514654,
          "upvotes": 3,
          "replies": {
            "h8ahfbu": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8ahfbu/",
              "text": "Your points about the psychiatrization of CFS are fair, but /u/yourmomdotbiz isn't dismissing CFS or suggesting OP see a psychiatrist for CFS. Rather, they're mentioning that ADHD shares a lot of symptoms of CFS and is regularly misdiagnosed as CFS in adults -- which isn't common knowledge because of how ADHD is typically depicted in our culture. If OP has CFS, then they have CFS and shouldn't be treated by a psychiatrist. But ruling out an alternate possibility which has standard treatments available is valuable.",
              "author": "LeopoldTheLlama",
              "created": 1628520115,
              "upvotes": 9,
              "replies": {}
            },
            "h8ao0cz": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8ao0cz/",
              "text": "OP didn't say they have chronic fatigue syndrome. They said they have chronic fatigue and struggle with depression and anxiety. There's no harm for OP to have a conversation with a medical professional about what's going on. I'm not diagnosing by any stretch - what I'm saying is there are lots of things that can go missed due to co-morbidities. OP has had bloodwork checking for medical issues, but didn't say CFS is their actual diagnosis.",
              "author": "yourmomdotbiz",
              "created": 1628523051,
              "upvotes": 5,
              "replies": {
                "h8asy2v": {
                  "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8asy2v/",
                  "text": "As a person living with CFS for more than five years, I could relate to what OP said. The hallmark symptom of CFS is post-exertional malaise which was evidenced in their testimonial. Medical professionnals and in particular psychiatrists don't have all of the answers either. At best, they tend to medicalize psychic suffering or psychiatrize organic illness. I'm pretty sure that OP has seen a doctor since the onset of their symptoms but has not found satisfying support on that side.",
                  "author": "Scientism101",
                  "created": 1628525175,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h87leha": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h87leha/",
      "text": "I know it isn't what you're asking but if you haven't already please consider having a blood test done for thyroid issues and iron, among other things. Not for cold weather per se but for the lack of light, those lamps that imitate daylight and vitamin D help me.",
      "author": "ndrsng",
      "created": 1628456124,
      "upvotes": 27,
      "replies": {
        "h87llt6": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h87llt6/",
          "text": "My thyroid levels came up normal, and my iron isn't great but is basically a hair over the minimum amount.\n\nLamps and Vit D sound good - thank you for this!",
          "author": "casualtherapist",
          "created": 1628456220,
          "upvotes": 7,
          "replies": {
            "h883ilq": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h883ilq/",
              "text": "Have you got tested for Vitamin B12? That is another common culprit of fatigue, especially for vegetarians and vegans (although lots of meat eaters get it as well.",
              "author": "fireguyV2",
              "created": 1628464813,
              "upvotes": 12,
              "replies": {
                "h8bjaud": {
                  "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8bjaud/",
                  "text": "Vitamin D and Magnesium I’ve heard does a lot too - ofcourse speak to a medical professional about it!",
                  "author": "cm0011",
                  "created": 1628536306,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h87m68c": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h87m68c/",
              "text": "You probably know this too, but just in case: there is some controversy about what counts as low TSH (if I've got that right -- I mean what is typicially measured when checking thyroid function). I don't really know more about it than that. Good luck!",
              "author": "ndrsng",
              "created": 1628456475,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "h8a5sjl": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8a5sjl/",
      "text": "Hey! I have chronic fatigue syndrome and I suffer from other post-illness syndromes. I cannot walk a lot because I get exhausted. I have been mostly homebound for five years but I left my place to attend classes and weekly meetings. I fell sick just before starting my Master's and now I'm three years into my PhD. You probably know this, but the therapy will probably not solve the fatigue because it's really an organic illness. Many people tend to psychiatrize the condition when in reality, it's linked to constant inflammation of the nervous system. So understandably, you'll have some pretty awful days, but remember that this is not your fault at all. I remind myself this when I feel awful and I try to sleep more to feel better. Winters are very terrible for me as well, I have neuropathy in my feet and it gets much worse with the cold. \n\nOn the \"tough love\" side - make sure you ask yourself the question of whether you are able to do this PhD. It would be awful if you had to drop out due to your health declining due to stress, for example. Do you have funding? If you have funding, I'd say \"go ahead\" because you won't have to pay debt afterwards (and having financial hardship on top of this difficult illness is something to avoid). On my part, I decided to do a PhD because of the funding. I wasn't planning on doing my PhD. Of course, I love it and I'm happier than what I expected when I signed up. I was just so sick three years ago and the funding for me was a way to get money without having to go on the job market because I thought I was unemployable at the time.\n\nMy tips for you to succeed would be to:\n\n* Prioritize your health whenever you can. If you feel tired, sleep. It'll pay off ultimately.\n* Learn to say no to opportunities which do not benefit you career-wise. There's a lot of people where I study that are involved in the student association and other side projects, but this only takes away time and energy away from their PhD. I've been very strict with **saying no** even if that was painful and I'm so thankful for my past self. \n* Your supervisor may understandably want you to do a very ambitious project. Learn to be strict by developing a realistic research proposal. I've had some cases where my supervisor wanted me to do more than what I intended. I stood up to him and this was extremely difficult, but now I don't have to worry about doing way more than what I can realistically manage. \n* Work from home whenever you can and be strict with that.\n* Try to have a strict work schedule and in the evenings, try to get some chores done even if it's very difficult. I realize it's better to push myself during the week so that I can relax and not feel overwhelmed on the weekend. Before, I would do most of my chores on the weekend and it was even more exhausting.\n* Try to find the adequate \"exercise\" balance that suits you. I can only walk a little bit, so I make sure to walk a little bit each day, preferably in the morning, so that I can be slighly more focused during the day. If you're too tired to walk, don't do it.\n* Make sure to be adequately dressed in the winter. Invest in a super warm coat. I bought a second-hand Canada Goose coat but there's plenty of cheaper options. I always get out with my snow pants lol. It looks ridiculous, but I'd rather deal with snowpants than perpetually numb legs and feet.\n* You can try to get an official chronic fatigue diagnosis and reach out to your university's services for people living with disabilities. Due to this service, I was able to ask for extensions even for my candidacy exam and this helped me incredibly. I was also able to apply to scholarships. In the two last years I have been receiving $5000 per year due to my disabilities. It has helped me a lot. \n* Don't feel obliged to maintain contact with exhausting people. You have your own health and problems to manage.\n\nOn a lighter note, what I like the most about the PhD is the flexible schedule. I find that it's super accommodating for people like us. The work rythmn in research is more slow and this is helpful stress-wise.\n\nGood luck and do not hesitate to reach out to me if you want to talk <3",
      "author": "Scientism101",
      "created": 1628514416,
      "upvotes": 6,
      "replies": {
        "h8at13s": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8at13s/",
          "text": "This is one of the most helpful answers, and I'm so grateful that you took the time to type this out for me. Thank you so so much :)",
          "author": "casualtherapist",
          "created": 1628525212,
          "upvotes": 2,
          "replies": {
            "h8atddn": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8atddn/",
              "text": "No problem <3 please do not hesitate to reach out to me anytime. You are not alone in this, and way to go for pursuing your dreams despite your illness. You are an inspiration for others!",
              "author": "Scientism101",
              "created": 1628525360,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h88uajx": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h88uajx/",
      "text": "I'm now over 2 years 2 months into my 3 year psychology PhD, and as I was beginning it I was going through some strange unexplained medical stuff, which included autoimmune issues and a diagnosis of chronic fatigue. It turned out to be caused by a major mould problem we didn't know we had (brand new apartment, hidden leaks and mould in the walls and under floors etc). I delayed starting by 1 month, but I needed the scholarship money to live, so had to dive in and get started. It took until 18 months into my PhD that I started to feel even remotely like myself again, and a few months later made the decision to get pregnant which has come with it's own fatigue amongst other things (hey I like a challenge lol). I'm in New Zealand so a PhD is different here, we don't have classes to attend instead it's entirely focused around a research project and thesis. So it sounds a little different, but here to say it can be done! I've managed to almost complete the research component (a couple months off now), publish several papers, and am talking at my first conference in September, as well as do a little casual paid work along the way.\n\nLots of good advice here already, my thoughts:\n\n\\- The way you work may look different, in the worst part some days I had to choose between showering/getting dressed and getting some work done. So some days I would just work on my laptop from bed. Other days I would make an appearance in the department, but accept those days weren't going to involve much work.\n\n\\- Totally agree with people saying they do less than peers and achieve the same amount, it's about being organised and time management. To do lists, working on things asap incase you hit a bad patch close to due dates\n\n\\- I have a 'daily done list' in google keep, every day is a new note and I keep a list of everything I do, all those tiny little bits of admin, emails etc are actually all part of the workload, and some days I would feel like I had achieved nothing big but over time realised every single day that I did something was another brick in the PhD wall. \n\n\\- On the worst days, when you can, do actually rest rather than trying to do work. Obviously this has to be an honesty system and balanced but sometimes taking a day for netflix and naps meant I could come back strong the following days, whereas the days I tried to push through I wouldn't get anything meaningful done, and ruined myself for days to come. \n\n\\- Hopefully you have a supportive supervisor. I was too scared to tell mine actually how bad it was, as I was worried I would be told to take a break and as mentioned, I badly needed the money to live, but I did mention I was having some health issues so she could be aware\n\n\\- Trust that you are doing enough unless told otherwise. I felt like I was operating at about 30% of what I could have been, but then at every review meeting I was told I was tracking well, so eventually I started to believe it!\n\n\\- Experiment with supplements where funds permit, iherb is reasonably priced. Look into coq10, pqq, reishi mushroom and l-theanine for sleep (restful sleep was sometimes hard for me even when I was exhausted), nadh, rhodiola, even just good old b vitamins. Definitely address any vitamin deficiencies, but look into proper supplements over a bog standard multivitamin that has minimal levels in it anyway. Also as someone mentioned, a light box for winter.\n\n\\- Look into support networks, I found really helpful resources on instagram, and people who were going through similar things.\n\n\\- Consider underlying issues, e.g. thyroid, mould problems, diet (this sounds boring but can have a huge impact), autoimmune illnesses\n\n&#x200B;\n\nGood luck! And feel free to reach out with any questions :)",
      "author": "PrizeBiscotti1",
      "created": 1628478876,
      "upvotes": 17,
      "replies": {
        "h8as0sj": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8as0sj/",
          "text": "Saving this comment - I can't thank you enough for all the very practical tips on how to account not just for my work, but also for my health and progress. Thank you :)",
          "author": "casualtherapist",
          "created": 1628524776,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h894o89": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h894o89/",
      "text": "I managed to finish my PhD despite having POTS. \n\nReally the only way I finished was after getting on Pyridostigamine.  I tried Modafinil -- fell asleep within 2 hours of taking this 'miracle drug which keeps you alert'.  I also tried Ritalin which gave me migraines.  Pytidostigamine allows me to have my brain back for several hours a day. \n\nIf you haven't tried Pytidostigamine, I definitely recommend reading up on the clinical trials and talking to your doc. It's prescribed off-label for CFS/ME It helps some of us some of us, it doesn't for others, but you won't know until you try.",
      "author": "MercutiaShiva",
      "created": 1628485423,
      "upvotes": 4,
      "replies": {
        "h8atgvp": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8atgvp/",
          "text": "This sounds interesting - I'll follow up on this. Thank you!!!",
          "author": "casualtherapist",
          "created": 1628525402,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h8971cf": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8971cf/",
      "text": "Depending on your PhD, you might be able to schedule your own hours. I have to take mid day naps/breaks or if one day is long, I have to take the next day off. So I work on and off throughout the week. Classes are better than undergrad (can't compare to masters) so between talking to the department and rearranging, its more manageable.",
      "author": "SaltyPlans",
      "created": 1628487150,
      "upvotes": 5,
      "replies": {
        "h8as9bl": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8as9bl/",
          "text": "That's exactly how I'm managing right now actually: 2-3 hours in the morning, crash in the afternoon, 2-3 hours in the evening, a nap, and then a few hours again. It's starting to feel less sustainable simply because my body feels like it's not getting that kind of 'solid' rest.",
          "author": "casualtherapist",
          "created": 1628524877,
          "upvotes": 2,
          "replies": {
            "h8c61u8": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8c61u8/",
              "text": "I found fatigue to be very variable and sometimes my mood and the weather affects it as well (don't come find me when it's raining). \nI would make sure to sleep properly at night, but I take breaks during the day (go for a walk, enjoy the sun etc). I always come home after to sleep for a bit before dinner but it can sometimes give me \"brain fog\" if I sleep for too long. So I am careful with it",
              "author": "SaltyPlans",
              "created": 1628546092,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h8ahqfa": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8ahqfa/",
      "text": "From my experience, graduate school allows for a lot more flexibility than your typical 9-5 job. When I still did coursework, I'd basically just go home right after class and rest a bit, since I didn't have the energy to stick around and chat with people after a 3 hour class, or if I had a statistics lab that was optional, I'd only go for the intro to the assignment, and complete the assignment on my own at home (luckily I was good enough at my stats courses to be able to do this and do well). I was extremely lucky to have an external fellowship that freed me up from any TA/RA/teaching duties for a few years, because I did have to take a brief (as in, not a full year) medical leave during that time, and still got paid and kept my insurance. Now that I'm working on my dissertation research, I've learned that on really intense weeks, to take a day off - taking a day to rest means that I'm more productive and have more energy when I do work! But overall, I've found grad school to be quite accommodating of my needs, especially now that I'm just trying to finish my PhD and have always been very self-directed and self-motivated. The only thing is that I do feel like it has made me more disconnected from my department, as attending all department events and social gatherings is just something I could not always get myself to do (and now I'm temporarily in another state for my research, so now, that's just due to distance). \n\nThe medical leave was due to severe bipolar disorder, but that has been under control for a couple years or more now, thankfully, but I'm currently dealing with POTS and a weird sort of syndrome called inappropriate sinus tachycardia (and other weird heart/autonomic dysfunction issues I'm trying to figure out, despite being an otherwise, on paper and bloodwork, excluding EKGs and such, totally healthy 30 year old) and that has made me have to learn to be strategic about how and when I can work. I detest Zoom, but the one upside to the pandemic is that is has made working from home so much more normalized, so on days I can't really muster up much, I can work from my bed and still feel good about my day having been decently productive. I suppose I've learned how my body and mind operate and know when it is best to rest, though that's often hard because I have a tendency to push myself too far! Adderall (prescribed of course) has helped me a lot, and I am not a big fan of medications - I don't know if I necessarily have ADHD per se, but the overall autonomic dysfunction stuff I have creates the same sort of symptoms (including extreme inattentiveness) and has helped me be able to function so much better since I started it maybe 3 years ago? I'm curious if you've ever looked into some sort of dysautonomia as a cause of your fatigue, given your description - worth a bit of research, I'd say! I also tried Nuvigil for fatigue but it gave me headaches every single day, though I'm predisposed to getting a ton of headaches, as a disclaimer!",
      "author": null,
      "created": 1628520253,
      "upvotes": 4,
      "replies": {
        "h8au0mx": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8au0mx/",
          "text": "Ah, I'm sorry to hear that you also struggled with an illness whilst doing a degree. I feel it really takes away so much from a person's capabilities and capacities. Thank you so much for the tips!!",
          "author": "casualtherapist",
          "created": 1628525639,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h8ao2k7": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8ao2k7/",
      "text": "I would go against some of the advice in this thread;  I would *not* mention the issue(s) to your advisor or other faculty...  or if you did (or feel you really need to) then I would downplay the issue by emphasizing how you've successfully tackled it in the past. \n\n(especially the depression/anxiety issues--many/most grads have some version of that, no need to call attention to it.) \n\nBecause professors--even psychology professors!--tend to 'box' grad students very quickly.  (unfair?  probably/certainly. But inexorably, inescapably human.) \n\nYou want to be the \"new, driven, laser-focused (but who might need a break now and then)\" grad, \n\n*not* the \"serious physical/mental issues (probably won't stick out the program)\" grad.",
      "author": "DerProfessor",
      "created": 1628523078,
      "upvotes": 4,
      "replies": {
        "h8aulnj": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8aulnj/",
          "text": "I agree with you - I don't want to mention this unless I'm starting to see really debilitating symptoms. I don't want to be *that* person even before my semester begins, and I'm glad I'm not totally wrong for feeling this way. \n\n&#x200B;\n\nI think psych professors in particular 'box' students even more quickly, and if I can find a way to avoid that, i'd pick that option any day.\n\n&#x200B;\n\nThank you for this!!!!",
          "author": "casualtherapist",
          "created": 1628525888,
          "upvotes": 2,
          "replies": {
            "h8aw7gh": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8aw7gh/",
              "text": "You're welcome. \n\nAnd good luck!    Wishing you the best.  \n\nRemember that if it does get to be too much, don't be ashamed to leave the program.  A PhD is a long tough haul... but you also learn a LOT in the process itself, which makes the journey itself incredibly useful *even if* the final goal remains elusive. \n\nSome of my grad-school friends stuck out the PhD more out of a sense of stubbornness more than love-for-the-subject... and that only made their problems much worse. \n\nVery best.",
              "author": "DerProfessor",
              "created": 1628526575,
              "upvotes": 2,
              "replies": {
                "h8awlah": {
                  "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8awlah/",
                  "text": "Holding your wishes close, stranger <3\n\nIncase I do need to leave, you'll probably see another post :P\n\nHopefully the excitement and passion I'm entering this degree with don't fade in the quest to get a piece of paper. :)",
                  "author": "casualtherapist",
                  "created": 1628526736,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h8rd1xp": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8rd1xp/",
          "text": "I agree with your post. I didn't tell my PhD supervisor about my chronic health issues until I fell behind on my dissertation during a bad patch several years into my PhD. I think it can also depend on your relationship with the supervisor. I tend to not disclose my health issues at all unless I had to. I know this may not be the best approach but it's what Ive done.",
          "author": "lilyflower32",
          "created": 1628841413,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h88mv7n": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h88mv7n/",
      "text": "You’ve gotten a lot of negativity about your decision here, which is funny because a 9-to-5 job is a much worse fit for your condition than a PhD where at least you can leverage institutional support and work your own hours. (I’m not a PhD student, but I’m applying to programs this year or next year because I just got chronic fatigue and it’s comically obvious that my industry job is a bad fit even though I work for an amazing company.) \n\nYou need to get all your ducks in a row to get accommodations ASAP, and that means getting detailed documentation of your conditions ideally from your doctors and specialists. I know it’s really shitty because you said your doctors aren’t the nicest, but their testimony will be critical for getting the support of your disability office at your new school. \n\nALSO — this flavour of chronic fatigue seems unusual for anxiety and depression? Please please look into autoimmune disorders and at least see an immunologist and maybe an endocrinologist. I have a history of anxiety and depression, and depression tiredness is qualitatively different from my current fatigue, which sounds exactly like yours. If you can walk into your PhD program with a diagnosis, that would be ENORMOUSLY helpful in terms of getting accommodations.",
      "author": "idislikekittens",
      "created": 1628474790,
      "upvotes": 12,
      "replies": {
        "h8at8qz": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8at8qz/",
          "text": "Yes - desperately trying to get that diagnosis, but the Uni wants it to be a diagnosis from their country, not my home country and it's such a mess :( Thank you for this though - I'm going to try to get them their damn diagnosis. :)",
          "author": "casualtherapist",
          "created": 1628525304,
          "upvotes": 1,
          "replies": {
            "h8bf5el": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8bf5el/",
              "text": "Hmm, that is super weird! Here’s what I suggest: have a copy of your comprehensive blood work (thyroid, vitamin levels, EBV antibodies, the works) and share it with your new doctor as soon as you get into the country, which will give them a starting point. If you do get a diagnosis from your home country, that’s even better because you can give the supporting evidence to your new doctor. If not, explain to your doctor that you have been checked out for xyz conditions, along with a detailed, specific set of description for your symptoms. That should get you through the first couple of months as your doctor in your new country runs all the tests and refers you to specialists. \n\nGood luck, what you’re going through is awful but you’re being so brave in pursuing your dreams! Hoping to do the same here soon :)",
              "author": "idislikekittens",
              "created": 1628534560,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h893esu": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h893esu/",
      "text": "I am currently working on my second year as a PhD in a psychology program and I struggle with fatigue often. Vitamin D has helped after my medical doctor ran some bloodwork from me. That has helped me out quite a bit. I also recognize that I have days where I don’t get much or anything at all done but I’ve done well to compensate. :) I believe in you. Message me if you need to chat!",
      "author": "ElvenMagicArcher",
      "created": 1628484524,
      "upvotes": 3,
      "replies": {
        "h8ateq5": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8ateq5/",
          "text": "Oooh, I'll try this! I live in a tropical country and was fine, and only felt the fatigue really kick in when I moved to the UK (notorious for the lack of sun...) Thank you so much!!!",
          "author": "casualtherapist",
          "created": 1628525375,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h89c4w9": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h89c4w9/",
      "text": "You can definitely request accommodation through disability services at your school if it's documented you have those problems. I think they ask for a therapist or physician to sign a form confirming but it can also depend on the school.\n\nOthers have suggested there might be an underlying medical problem. If that's true, I hope they are able to figure out what it is, and that might point to the correct medical intervention for your fatigue. That said, there are medications for fatigue. In addition to medications that are used for ADHD like different kinds of amphetamines and the drug methylphenidate, there's also the drugs modafinil and armodafinil. I like modafinil off-label for depression, but it's on label use is for sleep disorders that cause fatigue. I don't want to push medication because I'm a). not a doctor b). this isn't a medical sub-reddit c). not something you asked for. But, I just wanted you to know that there *are* medical options if you want to go down that route.",
      "author": "JapanOfGreenGables",
      "created": 1628491211,
      "upvotes": 3,
      "replies": {
        "h8atkww": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8atkww/",
          "text": "Yes, I was considering just trying some over the counter energy pills, but no idea if they'll actually work or not...\n\n&#x200B;\n\nThank you so much!",
          "author": "casualtherapist",
          "created": 1628525450,
          "upvotes": 1,
          "replies": {
            "h8ci9hw": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8ci9hw/",
              "text": "Over the counter energy pills contain caffeine, which you've already noted doesn't help.",
              "author": "JapanOfGreenGables",
              "created": 1628551795,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h8apjti": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8apjti/",
      "text": "Wow there are a lot of us with chronic fatigue!!\n\nMine just started and I haven’t figured out exactly what’s causing it, it’s very frustrating. I think it could be vitamin deficiency. I’m just taking many many breaks and being patient with myself. Good luck.",
      "author": "sweetypantz",
      "created": 1628523719,
      "upvotes": 3,
      "replies": {
        "h8aurr2": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8aurr2/",
          "text": "Right?! I used to feel so ashamed and angry at myself for being this way (and chalking it up to 'laziness' for many years.) I'm so glad I posted here, because there's so many of us struggling and surviving. Good luck to you as well <3",
          "author": "casualtherapist",
          "created": 1628525958,
          "upvotes": 3,
          "replies": {
            "h8b5tk4": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8b5tk4/",
              "text": "I’m VERY glad you posted. It’s such an invisible illness, I keep explaining it to my labmates vaguely and they don’t get it. I think I’ll have to have a sit down conversation with my advisor and explain to him what’s happening, see if he can work with my because it’s my last year. \n\nI’d say a PhD is a lot of work but I also think it’s the best place to be if you have something like this happening. Honestly the first 3-4 years of my PhD I worked 4-6 hours most days, never more than that. And I took days off whenever I wanted, I’m in the US. My last year is very different though…\n\nBut if you do so, you have to stay focused during those 4 hours. Explain to people, hey I have this illness and it really only affords me 4 hours a day so I can’t chat while I’m here. (This is what I do and people understand)",
              "author": "sweetypantz",
              "created": 1628530627,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h88p4eo": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h88p4eo/",
      "text": "I don't have chronic fatigue, but I do work a lot less hours than many of my PhD classmates, and get just as much as them done. \n\nMany grad students are very inefficient with their time. If you plan your time carefully and only focus on doing things that directly help you meet your goals, you can get a lot done in very little time. I often work less than 40 hour weeks.",
      "author": "setholopolus",
      "created": 1628476011,
      "upvotes": 5,
      "replies": {
        "h8au9w6": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8au9w6/",
          "text": "I've been hearing a bunch of people say this - can you tell me a bit more about how you manage this? Fatigue is a terrible combination with anxiety and imposter syndrome, both of which convince me that I need more time to study and learn because I'm generally slower than most.",
          "author": "casualtherapist",
          "created": 1628525749,
          "upvotes": 1,
          "replies": {
            "h8bvjss": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8bvjss/",
              "text": "I think it all starts with prioritization. First, you need to realize that you do not have the time to do your very best job on everything that you do. This is very hard for many of us who choose to do PhDs, because we have always been driven to do our best.\n\nLet me give some concrete examples. Many professors say that getting all B's in your classes as a PhD student is totally fine, because when you finish your PhD, people will only look at your research, not your courses. You should double check this with your advisor. If this is the case, then \\*do not\\* do any more work than you have to with your courses. Look at your course syllabus, figure out exactly what you need to do in order to get at least a B. Then write down a plan for how to do that \\*and no more\\*. This may be really difficult for you, but you have to learn to do it in order to manage time well. If you can save \\~5 hours a week by getting B's rather than A's in your classes, you just freed up 5 hours a week you can do something else with--whether it be research, sleep, self-care, etc.\n\nAnother example might be research projects that are not directly contributing to your thesis. Its fun to work on a bunch of projects with a bunch of people, but you have to figure out how to say \"No\" or \"I don't have time for that.\" I have said \"I don't time\" as an excuse to not do things, even if I know I've only been working 35 hour weeks, because I know that I need the time to take care of myself and to take care of my family so that my family and I can be healthy and happy. You have to put your own health over pleasing other people.\n\nOnce you have figured out what your priorities are, keep a TODO list of concrete tasks you need to do, and what date they are due by (I like using Microsoft Todo because it has a sort-by-due-date feature). Constantly update your list based on your updated priorities, etc. This will help you focus the time you \\*are\\* working on doing the most important thing for your career, whether its planning your next experiment, prepping to preseent at a top conference in your field, etc.",
              "author": "setholopolus",
              "created": 1628541507,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h8bbqyq": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8bbqyq/",
      "text": "I feel strange recommending this because it can lead down a pretty bad rabbit hole, and yes I expect downvotes incoming, but have you ever looked into nootropics?\n\nI also struggle with fatigue from chronic illness combined with probably other stuff. I drink lots of coffee and take COQ-10 on work days, which is pretty tame, but really helps. Another pretty tame beginner nootropic is theanine combined with caffeine, which might help you if caffeine doesn't normally help. There's a whole pharmaceutical road that I would recommend caution with unless you have an actual doctor's supervision, but one of your doctors might be willing to prescribe you something like modafinil if you are napping all the time. There are some forums here on Reddit for nootropics that you could start browsing if you were curious.",
      "author": "trying_to_be_amelia",
      "created": 1628533125,
      "upvotes": 2,
      "replies": {
        "hbphq6z": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/hbphq6z/",
          "text": "The ADHD and nootropics forums were keys that opened doors for me: I’m not lazy, crazy or stupid.",
          "author": "Striking-Knee",
          "created": 1630862305,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h8bimao": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8bimao/",
      "text": "This is exactly me right now. It’s difficult. I honestly just accept that my schedule may be different than a normal person (COVID helps since I can work from home), so I allow myself naps when I need them, and use my bursts of energy to work. Pushing myself when I am in a fatigued state just ends up giving me massive headaches that knock me out entirely. Honestly, I often can’t do proper work before 3-4 PM. Medication wherever possible or needed can help too - I’m working on my anti depressant dosage to see if I can find something that helps my anxiety and depression but also helps with my fatigue. Sometimes you just have a deadline and the freak out makes you get your ass to work. \n\nThe way I try and mitigate deadline freak outs is to do whatever tiny amount I can manage in a day. If I can write one paragraph, I’ll do it. Sometimes I’ll carry my computer around with me in the house, with my document open, so if I feel a bit less tired I can do something for 20 minutes before I feel like crashing again. I usually find the tiny pieces of work pile up until I have a decent amount done without realizing it. And I don’t take my small periods of focus for granted.\n\nIt’s a hard road my friend, but just have confidence and try to see if you can get some medical help wherever you can.\n\nIt is also encouraging for me to read the other comments here and see other people struggle with this and still lead great academic lives while mitigating mental health circumstances and fatigue!",
      "author": "cm0011",
      "created": 1628536016,
      "upvotes": 2,
      "replies": {}
    },
    "h8bjl9x": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8bjl9x/",
      "text": "I’m not sure what it’s like in the humanities honestly? But I’m in a biomedical research lab and my PI is super chill as long as I’m reaching deadlines. We have students that come in at 7:00am and leave at 2pm, we have students that come at noon, and we have students that show up twice a week and do the rest of their work from home. While my supervisor is extremely lax, I think that in general as a masters/PhD student you are trusted to be able to manage your own schedule. \n\nWhat that means for me is that I have two intense days a week where I am in the lab all day on my feet and get home in pain and exhausted—I learned that’s as much as I can tolerate. The other days are shorter and more relaxed days where I do data analysis, paper readings and logistical tasks. I communicate with my lab mates and I’m not afraid to ask for help. I ended up being hospitalized a bit this year and a fellow student kept up some of my lab duties while I was out. \n\nBasically this was all a very long way for me to say that as long as you find a schedule that works for you and you communicate effectively with your colleagues you should be golden.",
      "author": "_happytobehere_",
      "created": 1628536427,
      "upvotes": 2,
      "replies": {
        "h8bjw2h": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8bjw2h/",
          "text": "Phew, I'm just slowly letting out a sigh of relief with this :) Thank you :)",
          "author": "casualtherapist",
          "created": 1628536553,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h88mfj8": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h88mfj8/",
      "text": "Have you had a sleep study? Maybe your sleep is crappy, and you never get rested.",
      "author": "hopelesspostdoc",
      "created": 1628474559,
      "upvotes": 4,
      "replies": {}
    },
    "h87m0yh": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h87m0yh/",
      "text": "Doesn’t sound like a good idea to begin a PhD with the illness you’ve got",
      "author": "grandpassacaglia",
      "created": 1628456411,
      "upvotes": -13,
      "replies": {
        "h88r9id": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h88r9id/",
          "text": "TT race is not going to be possible unless you are a rising superstar.",
          "author": "phdyle",
          "created": 1628477187,
          "upvotes": -5,
          "replies": {
            "h89a395": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h89a395/",
              "text": "Don’t trust the downvoters. They want you in the race because you are easier to beat.",
              "author": "phdyle",
              "created": 1628489532,
              "upvotes": -4,
              "replies": {}
            }
          }
        }
      }
    },
    "h89ld8m": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h89ld8m/",
      "text": "I think you have to be very realistic. Usually the advice would be to do the PhD part-time, get support from your institution and supervisor so you can take things at your own pace and things like that.\n\nBut people do struggle to complete on strict visas when they don't have to deal with the issues you do. And people can find it tough doing a phd as an international student.\n\nI would contact the university and find out about the support they offer in advance, have a very honest conversation with your PI now, before you get there, as to what is realistic to expect from you and whether that will allow you to submit on time.  \n\nThey might say the work schedule can be made very flexible so you can work when you have the energy - that would be good to know and reassure you a bit. They might say there is room to take on little to no extra teaching - great. They might say 'my students usually work 40+ hours a week flat out'. I would't wait until you are there to find all this out.\n\nI am not saying people with all sorts of conditions can't complete a PhD - they totally can - but you need to be upfront with yourself about the circumstances rather than setting yourself up for four years of stress and exhaustion. You do have to live for those years as well as completing the phd.",
      "author": "Fleur-duMal",
      "created": 1628499378,
      "upvotes": 1,
      "replies": {
        "h8av1a7": {
          "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8av1a7/",
          "text": "The bonus (?) of my anxiety is that I'm realistic bordering on pessimistic - I prepare for the worst and work backwards to the best case scenario. I'll definitely try seeing what support and help I can get from the Uni. Thank you so much for this - the last line really stayed with me, that I do actually have to live for the next 5 years as I do my PhD!",
          "author": "casualtherapist",
          "created": 1628526070,
          "upvotes": 1,
          "replies": {
            "h8ea9uy": {
              "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8ea9uy/",
              "text": "In terms of preparing for the worst - do you know if your visa allows you to take a break/s in studies? It might be worth finding out, as break in studies stops the clock on your PhD time but there is nothing to stop you working independently during that time.",
              "author": "Fleur-duMal",
              "created": 1628593123,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h8fzzl9": {
      "link": "/r/AskAcademia/comments/p0mnst/help_how_do_i_survive_a_phd_with_chronic_fatigue/h8fzzl9/",
      "text": "Adderal script",
      "author": "DrBroRogan",
      "created": 1628622347,
      "upvotes": 1,
      "replies": {}
    }
  }
}