{
  "sid": "ot3vej",
  "link": "/r/AskAcademia/comments/ot3vej/failed_my_phd_first_year_upgrade_what_now/",
  "title:": "Failed my PhD first year upgrade. What now?",
  "text": "The university is probably going to offer an MPhil. Pros and cons of taking it?",
  "author": "Throwaway13KA",
  "created": 1627451418,
  "updated": 1634082408,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "h6stib3": {
      "link": "/r/AskAcademia/comments/ot3vej/failed_my_phd_first_year_upgrade_what_now/h6stib3/",
      "text": "Not really many cons, unless you a) really still want to do the PhD and b) have a path forward to doing it at your current institution despite failing. The pros are that you avoid the black mark on your resume of having spent several years in grad school with nothing to show for it.",
      "author": "wetbogman2",
      "created": 1627452045,
      "upvotes": 5,
      "replies": {
        "h6strkm": {
          "link": "/r/AskAcademia/comments/ot3vej/failed_my_phd_first_year_upgrade_what_now/h6strkm/",
          "text": "How does getting an MPhil affect my ability to continuing doing a PhD?",
          "author": "Throwaway13KA",
          "created": 1627452237,
          "upvotes": 2,
          "replies": {
            "h6sty48": {
              "link": "/r/AskAcademia/comments/ot3vej/failed_my_phd_first_year_upgrade_what_now/h6sty48/",
              "text": "Taking the MPhil is an offramp; it means leaving your institution. You could apply to do a PhD elsewhere after that, but tbh failing out of one program is going to be a pretty major hindrance to your application to another. What I mean is, if there's some way to un-fail and continue at your current institution, and you think you want to, then you should go for that. There may well not be, I don't know. If your options are limited to \"leave without an MPhil\" or \"leave with an MPhil,\" you should take the MPhil, so that at least you have something to show for your time.",
              "author": "wetbogman2",
              "created": 1627452372,
              "upvotes": 11,
              "replies": {
                "h6xynyc": {
                  "link": "/r/AskAcademia/comments/ot3vej/failed_my_phd_first_year_upgrade_what_now/h6xynyc/",
                  "text": "Thanks, that's helpful",
                  "author": "Throwaway13KA",
                  "created": 1627557235,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h6tjs4v": {
      "link": "/r/AskAcademia/comments/ot3vej/failed_my_phd_first_year_upgrade_what_now/h6tjs4v/",
      "text": "This happened to me too, after my first attempt at a PhD fell apart for various reasons. It seems a better option than just leaving with nothing. I've applied for a number of PhDs since then. I've not had any luck so far (because of funding), but as yet no one has commented negatively about my MPhil degree.",
      "author": "maybe_not_a_penguin",
      "created": 1627473523,
      "upvotes": 3,
      "replies": {}
    }
  }
}