{
  "sid": "opxe0j",
  "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/",
  "title:": "Why some people get offended when you ask about their contribution in a published study?",
  "text": "We normally see multiple authors in published papers. Does everyone actually contribute equally while writing the paper?",
  "author": "adventurous_soul19",
  "created": 1627025458,
  "updated": 1634082456,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "h685yfr": {
      "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h685yfr/",
      "text": "> Does everyone actually contribute equally while writing the paper?\n\nNo, of course not.  This is a really inefficient way to write papers.  It's quite typical that one person does the vast majority of the writing, with the other authors providing advice, contributing text related to their own expertise, or editing/proofreading.  The other authors are usually there because they've been involved in the research work that is being described in the paper.  You can find examples of authorship requirements by searching online.  \n\n\nAs to your title question: \n\nAsking someone to explain their \"contribution\" comes across a bit hostile - it has overtones of forcing them to defend their contribution, so you can judge whether it was valuable.  This kind of language is typical when people are being evaluated, and if you're inexperienced enough in this area that you're asking this question on reddit, you're probably not in a position to evaluate people.  If you want to ask this question in a more appropriate way, I'd recommend asking how they got involved in the work, and which parts of the project they worked on most.",
      "author": "polyphonal",
      "created": 1627028016,
      "upvotes": 20,
      "replies": {
        "h688h7m": {
          "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h688h7m/",
          "text": "Thanks for the clarification. But to be honest, I have seen examples, where people used their PR skills to have their name on the paper. How about that ?",
          "author": "adventurous_soul19",
          "created": 1627030340,
          "upvotes": -13,
          "replies": {
            "h68f6xn": {
              "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h68f6xn/",
              "text": "So I get the strong feeling that you’re asking people the question with the belief that *someone* didn’t pull their weight and got their name on it with no contribution. People can pick up on that and they’re going to be offended that you’re insinuating they did no work and got listed for “PR” reasons. If I can tell just from your comments here then it must be a flashing red flag to everyone you talk to. \n\nYou’re not asking the question in good faith. You’ve made a conclusion and are going out trying to trap people to fulfil that conclusion. It’s very rude and antagonistic.",
              "author": "officially_anxious",
              "created": 1627036332,
              "upvotes": 28,
              "replies": {}
            },
            "h6b41ov": {
              "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h6b41ov/",
              "text": "If that was the case (or even if not), why would they want to tell you?",
              "author": "bernease",
              "created": 1627083391,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h68cdot": {
      "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h68cdot/",
      "text": "It depends on how and why you are asking. I specified this for all my coauthored papers in my tenure file. Normal. If you’re interviewing people for a job, you can ask. If you’re just asking to needle someone about the fact that they weren’t the primary writer, then don’t.",
      "author": "raspberry-squirrel",
      "created": 1627033885,
      "upvotes": 7,
      "replies": {
        "h68cluj": {
          "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h68cluj/",
          "text": "I am asking this out of curiosity when I see people with heaps of research papers on their profile, and have no idea about them at all. It is like decoration pieces.\n\nAnd when you inquire about the contribution, it leads to inconvenience and they get offended.\n\nI am not implying that it is the general behaviour, but was curious to know what others have experienced.",
          "author": "adventurous_soul19",
          "created": 1627034089,
          "upvotes": -8,
          "replies": {
            "h68jheu": {
              "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h68jheu/",
              "text": ">I am asking this out of curiosity when I see people with heaps of research papers on their profile, and have no idea about them at all. It is like decoration pieces.\n\nOften that will be because they did not actually contribute to the paper significantly. It can also be that they contributed a specific part and then did not pay much attention to the rest. Sometimes they just forget.\n\nI am on papers that I contributed something very important to early on, like a set of model runs or something, and then ignored for the rest of the project. I could not tell you much about the papers. I also have first-author papers that I have almost entirely forgotten the contents of. I also have papers that I was added as co-author to for no good reason at all. All sorts of things happen.",
              "author": "CaptainCornerCamper",
              "created": 1627039664,
              "upvotes": 8,
              "replies": {
                "h68no3z": {
                  "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h68no3z/",
                  "text": "The \"specific part\" can be very important. I've done cross-disciplinary collaboration (digital humanities), and I was the humanities person, so there was a reason for me to write up absolutely all of it. The other authors wrote code and did data analysis. Arguably, their contribution was more important, but I was the one who came up with the idea for the project, figured out what corpus to work on, and did the writing. I felt bad about being first author on those papers and would never want people to assume my coauthors weren't important--without them, we would have had nothing.",
                  "author": "raspberry-squirrel",
                  "created": 1627042485,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "h68dp4e": {
              "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h68dp4e/",
              "text": "It’s rude in this context. You should understand that multiple collaborators are a thing in academia. First author wrote the paper. Everyone else did the experiments/crunched numbers/wrote the grant/advised the dissertation. There aren’t people on the list who didn’t contribute. Unless you’re interviewing these people for jobs or evaluating them for promotion, spare them your nosy questions.",
              "author": "raspberry-squirrel",
              "created": 1627035052,
              "upvotes": 22,
              "replies": {
                "h68j2bh": {
                  "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h68j2bh/",
                  "text": ">You should understand that multiple collaborators are a thing in academia. First author wrote the paper. Everyone else did the experiments/crunched numbers/wrote the grant/advised the dissertation. There aren’t people on the list who didn’t contribute.\n\nIf only this were true. People get added to papers all the time without any contribution. I have worked on so many projects where I know for a fact that most people did almost nothing for the final paper coming out. I know people who are not even capable of doing basic research tasks, either because they just are not talented enough or because they are too busy with teaching and admin work, who are co-authors on huge numbers of papers.",
                  "author": "CaptainCornerCamper",
                  "created": 1627039363,
                  "upvotes": 1,
                  "replies": {
                    "h69zs5p": {
                      "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h69zs5p/",
                      "text": ">without any contribution\n\nThere's a difference between \"without any contribution\" and \"without any obvious contribution in the final paper\". People who contributed some part that was critical to the process, even if that doesn't appear in the final version of the paper, may merit authorship depending on the discipline and journal.",
                      "author": "aggressive-teaspoon",
                      "created": 1627064540,
                      "upvotes": 1,
                      "replies": {
                        "h6auwm5": {
                          "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h6auwm5/",
                          "text": "That is why I specified projects that I have worked on where I know people did not contribute. I have also worked on and witnessed many more projects where I think people did not contribute but cannot really know for sure.",
                          "author": "CaptainCornerCamper",
                          "created": 1627078752,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h685nco": {
      "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h685nco/",
      "text": "What are you asking? You've put two questions. \n\nWhy do people get offended - why does anyone get offended about something? \n\nIs everyone's contribution equal - no. In my discipline last author Will be the senior person on the paper, who takes responsibility for the contents of the paper. Typically, they will have secured the funding and supervised the work. First author did most of the work and then everyone else did varying levels of contribution from intellectual input, editing, writing, analysis etc.",
      "author": "ACatGod",
      "created": 1627027733,
      "upvotes": 15,
      "replies": {}
    },
    "h695juu": {
      "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h695juu/",
      "text": "You're implying that they didn't contribute sufficiently to the manuscript to be an author. It's pretty rude. It's also irrelevant unless you're interviewing them for a job. If they didn't contribute enough, it's an issue for their coauthors, not you. Every author is responsible for everything in the paper. If you have a question, just ask the corresponding or first author and they'll refer you to a coauthor if needed.",
      "author": "mediocre-spice",
      "created": 1627051533,
      "upvotes": 5,
      "replies": {}
    },
    "h6cqott": {
      "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h6cqott/",
      "text": "In academia we are regularly asked to define or clarify our role in a publication, but this is always in the context of a formal evaluation (hiring, promoting etc).  \n\nA random stranger coming and asking me that would very likely be seen as rude, and/or hostile.   I was trying to think of how someone could politely ask \"what is your role in this publication\", and frankly have failed to be able to do so.\n\nAs a side note, there is a move towards being open on contributions, through the CRediT taxonomy, which would answer your question.  But in person?  With no good reason?  Nah.",
      "author": "Life_time_learner",
      "created": 1627124201,
      "upvotes": 3,
      "replies": {}
    },
    "h6bdu8d": {
      "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h6bdu8d/",
      "text": "I certainly had to explain my contribution on a couple of co-authored papers for my promotion file.  It makes sense if you are using those papers to demonstrate your qualifications.",
      "author": "Grace_Alcock",
      "created": 1627088628,
      "upvotes": 2,
      "replies": {}
    },
    "h6gbv14": {
      "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h6gbv14/",
      "text": "The fact that so many people are offended by this comment is the nature of academic science, otherwise they could just state their roles. How is \"what is your contribution\" any different than \"what part in the project did you work on\". The meaning is the same, and the difference in wording is to just smooth one's ego. Papers literally use the word \"contribution\" when stating cofirst authors, so are they being aggressive and should I be offended by them? \n\nIt's always the people who knows that they don't deserve to be in a certain position that then get offended when they are being asked or challenged. If anyone ask why I deserve to be first author, you bet I can talk for hours about why. Do I get defensive about it? No. Not at all. Because I don't have anything to hide. When I asked why my cofirst author is sharing the title with me despite me doing majority of the work, and they get defensive about it rather than stating their position, then that's honestly their own insecurity. If they are happy going around taking credit for the work of other people, then that's on them. \n\nThat being said, most people have enough self awareness to answer that question honestly. Most of my experiences, including myself, have been \"I did this one assay/service/item and I'm happy that they put me on\". It's the ones who don't that then make it a huge problem, like you have just doubted their entire existence or something.",
      "author": "chillzxzx",
      "created": 1627199356,
      "upvotes": 2,
      "replies": {
        "h6gd67s": {
          "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h6gd67s/",
          "text": "Thanks. You have summed it up nicely.",
          "author": "adventurous_soul19",
          "created": 1627200533,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h68z1et": {
      "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h68z1et/",
      "text": "“Rudeness” is a subjective interpretation of someone’s intent. I am a patient and published author in an international medical journal. There were seven authors listed. I was first, my physician was last. I never met or communicated with three others. I conceived of the research, purchased the equipment, collected the data and gave all data to my Dr. We wrote it up together. To this day have I no clue what the other authors did or how they contributed. The second author asked me if she could change the author order to first as she was presenting it at a conference. I am not an academic so I don’t play this game but a game is being played.",
      "author": "adagio1369",
      "created": 1627048586,
      "upvotes": 2,
      "replies": {
        "h6aeodi": {
          "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h6aeodi/",
          "text": "You put it up with more clarity.",
          "author": "adventurous_soul19",
          "created": 1627071190,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6afnjn": {
      "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h6afnjn/",
      "text": "Well, Going through the responses and I can clearly see that some people did get offended just by asking these type of questions in academia.\n\nI asked this in a general context, things I have observed and then I thought to ask it here. If you are happy to play this game then play by all means.\n\nCheers",
      "author": "adventurous_soul19",
      "created": 1627071627,
      "upvotes": 2,
      "replies": {}
    },
    "h688n33": {
      "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h688n33/",
      "text": "I think the only people getting offended about that are those that barely contributed, and in that case, they get offended because they realized they are profiting from someone else's work",
      "author": "CBornes",
      "created": 1627030494,
      "upvotes": -1,
      "replies": {
        "h689ljr": {
          "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h689ljr/",
          "text": "I disagree. Questions of contribution outside of a clear evaluation setting are rarely asked politely (though they absolutely can be). It's completely normal to be momentarily taken aback or even offended by rude implications, even when they are wrong.",
          "author": "aggressive-teaspoon",
          "created": 1627031388,
          "upvotes": 8,
          "replies": {
            "h68avjh": {
              "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h68avjh/",
              "text": "Those that actually contributed should feel well with themself and don't care about what others think.",
              "author": "CBornes",
              "created": 1627032568,
              "upvotes": -5,
              "replies": {
                "h68bg2t": {
                  "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h68bg2t/",
                  "text": "I did specify \"momentarily\". Just because one is resilient and can brush off a comment in the long run doesn't mean that one is necessarily well-equipped (or should be expected) to roll with every unexpected rude question or comment. \n\nMore broadly, it's a problem if those questions/comments drive away budding scientists who haven't yet built up their confidence, *especially* if it's weaponized in an unequal way. It wouldn't surprise me if this kind of thing contributed substantially to academia's diversity issues.\n\nAlso, the \"don't care what others think\" quality is vastly overrated in academia. Academic research has an important collaborative and social component; valuing others' opinions is not, itself, a weakness. It's important to know how to critically evaluate both praise and criticism to find the signal in the noise, which is very much a learned skill.",
                  "author": "aggressive-teaspoon",
                  "created": 1627033067,
                  "upvotes": 8,
                  "replies": {
                    "h68jmkj": {
                      "link": "/r/AskAcademia/comments/opxe0j/why_some_people_get_offended_when_you_ask_about/h68jmkj/",
                      "text": "Even if you don't value other people's opinions, you are going to need to care what others think if you want glamour journal papers, funding, and a job.",
                      "author": "CaptainCornerCamper",
                      "created": 1627039768,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}