{
  "sid": "qm8pf1",
  "link": "/r/AskAcademia/comments/qm8pf1/who_is_a_good_supervisor/",
  "title:": "Who is a good supervisor?",
  "text": "&#x200B;\n\nI  mean how do you define such a person? Like what traits and behaviors you see that you go \"yeah, this person is a good supervisor\" and vice versa, what are the red flags?\n\nI'm  in the midst of applying to PhD in Psych and it's not like I'm sure that I'll be admitted, but I'm really impressed with one potential supervisor, who's really kind, takes time to answer, provides papers, answers really quickly, and absolutely knowledgeable as one of the best in the field.  But what do I know!",
  "author": "MJORH",
  "created": 1635986510,
  "updated": 1636136910,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hj8bv2r": {
      "link": "/r/AskAcademia/comments/qm8pf1/who_is_a_good_supervisor/hj8bv2r/",
      "text": "I have an amazing supervisor right now. The general pattern is that he has high EQ/empathy and a lot of funding but here are some more specific details that come to mind:\n\n- Takes into account what I'm interested in working on and not just what the lab needs at the moment\n\n- Is supportive of me doing training modules and will even pay in the hundreds to purchase softwares for analyses, send me and labmates to conferences, etc. (This is where having a PI with a lot of funding makes a difference. He hasn't told me this directly but my impression is that he's killing it in his career right now and as such isn't stressed about maximizing his students' productivity\n\n- Flexibility/adaptability. My lab transitioned online last year and my supervisor was ok witn me staying in my home city for work where rent is much cheaper. Also, I'm in a master's right now and considering fast-tracking to PhD and he's told me I can make my decision as late as the department will let me. \n\n- Trusts and believes in his students: this might be the biggest thing I appreciate about working in his lab, he doesn't micromanage and while he isn't shy about correcting and making suggestions when you show him your work, he's supportive and most of the time genuinely thinks your work is interesting and cool.",
      "author": "maoiwaui",
      "created": 1635990838,
      "upvotes": 11,
      "replies": {
        "hj8ht3k": {
          "link": "/r/AskAcademia/comments/qm8pf1/who_is_a_good_supervisor/hj8ht3k/",
          "text": "Such good points, I hope I end up lucky and have a similar supervisor! Is there a way to know the status of your supervisor in terms of funding?",
          "author": "MJORH",
          "created": 1635993632,
          "upvotes": 1,
          "replies": {
            "hj9zmau": {
              "link": "/r/AskAcademia/comments/qm8pf1/who_is_a_good_supervisor/hj9zmau/",
              "text": "Tough to say, I guess you can ask them about their sources of funding and whether they normally send students to conferences.",
              "author": "maoiwaui",
              "created": 1636031181,
              "upvotes": 2,
              "replies": {
                "hjacn0y": {
                  "link": "/r/AskAcademia/comments/qm8pf1/who_is_a_good_supervisor/hjacn0y/",
                  "text": "What's the benefit of conferences?",
                  "author": "MJORH",
                  "created": 1636036963,
                  "upvotes": 1,
                  "replies": {
                    "hjbeg0u": {
                      "link": "/r/AskAcademia/comments/qm8pf1/who_is_a_good_supervisor/hjbeg0u/",
                      "text": "Networking, sharing ideas that could lead to new hypotheses or even collaboration, also it looks good on your CV if you've presented your research at one.",
                      "author": "maoiwaui",
                      "created": 1636051674,
                      "upvotes": 5,
                      "replies": {
                        "hjbfmdy": {
                          "link": "/r/AskAcademia/comments/qm8pf1/who_is_a_good_supervisor/hjbfmdy/",
                          "text": "I see, thanks!",
                          "author": "MJORH",
                          "created": 1636052138,
                          "upvotes": 2,
                          "replies": {
                            "hjd3u9b": {
                              "link": "/r/AskAcademia/comments/qm8pf1/who_is_a_good_supervisor/hjd3u9b/",
                              "text": "My pleasure! Seeing the good and the bad in a few different PI's has really shown me how much a difference it makes and taught me not to tolerate certain things if I have the option.",
                              "author": "maoiwaui",
                              "created": 1636077097,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hja6nu4": {
      "link": "/r/AskAcademia/comments/qm8pf1/who_is_a_good_supervisor/hja6nu4/",
      "text": "It depends somewhat on who you are and what you need.  I've seen people flourish under supervisors that would have seen me crash and burn (and vice versa).\n\nWell there are some generalities, some self-awareness ie needed too.",
      "author": "Spambot0",
      "created": 1636034446,
      "upvotes": 6,
      "replies": {
        "hjacpw8": {
          "link": "/r/AskAcademia/comments/qm8pf1/who_is_a_good_supervisor/hjacpw8/",
          "text": "I see, yeah that makes sense.",
          "author": "MJORH",
          "created": 1636036995,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}