{
  "sid": "onygvt",
  "link": "/r/AskAcademia/comments/onygvt/depression_near_graduation/",
  "title:": "Depression near graduation",
  "text": "I'm 99.99% sure I have depression. My PI told me to ask my DAC to graduate, but I just can't seem to find the motivation to do anything even though I REALLY want to leave. A lot of things are happening at my work (lab drama) and life (breakup with bff, LDR with BF), plus the fear of a job search when I'm close to graduation. On top of everything, I don't even know if I want to continue in this field!!! I just feel so empty inside. I know I will feel much better once I leave my lab, and despite that, I still cannot find the motivation to do any work, and find myself searching the web or playing games. \n\nIm going to schedule an appointment with my therapist. Other people had told me that they felt similarly in the last year of their PhD. Is this normal?? I still find enjoyment when I play with my hobbies, chat with my friends/bf/family, chill in the afternoon sun, etc, but my daily work days all merge together into nothingness. I don't know what to do anymore (correction: I do, which is to graduate, but I can't get my body to physically do it) \n\nIs this normal towards graduation???",
  "author": "chillzxzx",
  "created": 1626772240,
  "updated": 1634082488,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "h5uunrx": {
      "link": "/r/AskAcademia/comments/onygvt/depression_near_graduation/h5uunrx/",
      "text": "My theory is that, since this is your last year, you are overwhelmed by your dissertation. All of those life and work instances can occur at any point during the graduate school process. However, if my undergraduate thesis was any indication, the work required for a doctoral thesis can be a severe stressor.\n\nEveryone reacts to stress differently. You seem to have a crippling anxiety, brought on by the work required to graduate conflated with personal and professional stressors.\n\nIn sum, you’re overwhelmed. It’s perfectly fine. However, your dissertation is never going away. If you really want this, don’t become an ABD statistic. Kick yourself in the butt, take a week or two off. When you come back, take ownership of your project.\n\nRemember, the finish line is right there.",
      "author": null,
      "created": 1626773429,
      "upvotes": 5,
      "replies": {}
    },
    "h5vbxzp": {
      "link": "/r/AskAcademia/comments/onygvt/depression_near_graduation/h5vbxzp/",
      "text": " It only is this normal, but a lot of people also feel some pretty intense depression in the time after. You spend 4-ish years of your life working towards this tremendous goal, and then you defend, and then it’s just over with pretty little fanfare. If you’re lucky enough to get a job soon after, the depression fades more quickly for some, but a lot of folks take a while to find a job (6 months to a year), which makes it feel much worse that you strove for this thing that seems to come with no reward. \n\nYou sound like you’re experiencing symptoms of depression. I’m no clinician, but have had severe bouts, and while you may still get enjoyment out of some things, it’s almost like the depression sits on the sidelines waiting for you to get back. Definitely schedule an appointment with your therapist. The bounce back can almost be worse (anxiety is common). Try to remember that it will end. \n\nBest of luck.",
      "author": "insanityensues",
      "created": 1626785951,
      "upvotes": 3,
      "replies": {}
    },
    "h5uunj9": {
      "link": "/r/AskAcademia/comments/onygvt/depression_near_graduation/h5uunj9/",
      "text": "It's normal all throughout the program. I'm going into final year work and everything as you said right now feels like nothingness. I'm going to talk to a therapist as well before the semester starts just to see if I can get my brain together.  My uni frequently sends out notifications asking persons if they need help so it's very common. \n\nMy suggestion is to find what makes you happy and this may be planning a 3 month vacation after your graduation. This could give you the motivation to graduate quickly and the trip gives you time to recoup and reevaluate your life. \n\nBest wishes!",
      "author": "MAE2021JM",
      "created": 1626773422,
      "upvotes": 2,
      "replies": {}
    },
    "h5w106x": {
      "link": "/r/AskAcademia/comments/onygvt/depression_near_graduation/h5w106x/",
      "text": "I'm in my last year of my PhD. I think disillusionment is more common than depression, specifically regarding the last year of the PhD thing, but it sounds like you're dealing with a lot of significant life stressors right now, which would explain a lack of motivation and feeling sort of empty inside. Plus, being unmotivated to work is a pretty common thing in grad school, generally speaking! I can relate a lot to what you wrote, and can honestly tell you I am not depressed, but just stressed over my own life/health stuff, disillusioned with academia, and easily distracted by anything that is NOT work lately (though I have moments when I surprise myself and do get shit done!). \n\nDefinitely talk to your therapist about it though - especially about the stress you're under and the uncertainty of the future. It's normal to feel this way near the end IMO, and therapists can be super helpful with \"normal\" stuff too (note, normal does not mean it doesn't feel shitty!). \n\nI'd avoid pathologizing the way you feel right now unless your therapist is truly concerned it is depression (but if she is, I question her judgment). Basically, do not quickly jump aboard the medication train, because that could potentially worsen things. FWIW, I have bipolar disorder, so I've learned how to differentiate between truly concerning mood issues and whatnot and things explained best by contextual factors, and it seems like your situation falls into the latter category. You're near the finish line (and so am I, haha) - you can and will finish, get the degree in hand, and remember that there are probably more paths for your future than you may realize right now (something that I recently and finally realized, which was actually incredibly helpful and gave me a lot more hope about the future).",
      "author": null,
      "created": 1626797296,
      "upvotes": 2,
      "replies": {}
    }
  }
}