{
  "sid": "bv6o0s",
  "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/",
  "title:": "Every time I publish with Elsevier a small part of me dies",
  "text": "I now have three papers in various Elsevier journals. Through publication of each of these I have grown to dispise Elsevier more and more. \n\nI hate they way that they are providing less and less at each stage of the publication process. For example I wrote the paper, my colleagues peer-reviewed it, and then now I even have to do the type setting myself. It makes me question what exactly Elsevier are providing besides a shell to conduct peer review and a hosting platform afterwards?\n\nAlthough there are many issues generally with the publication process, it is the authors doing type setting that actually bugs me the most. For those of you that have not used the Elsevier type setting online tool, this is an interactive document editor where you generate your own proofs. All content is editable and therefore undermining the peer review process. For example, at this stage for key points could be changed or countless self citations added. After this you hit submit and it's done. Now they will claim that this process has some editorial oversight but in my experience it does not. It's a joke. \n\nAlso I hate the way they refer to us as customers. Working with a publisher should be a collaborative process. I am planning to avoid Elsevier journals in the future when I have a say in where a paper goes.",
  "author": "Drcrocodile764678235",
  "created": 1559304174,
  "updated": 1634080538,
  "over_18": false,
  "upvotes": 260,
  "upvote_ratio": 0.99,
  "comments": {
    "epm1jrd": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm1jrd/",
      "text": "[deleted]",
      "author": null,
      "created": 1559306867,
      "upvotes": 92,
      "replies": {
        "epm33jf": {
          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm33jf/",
          "text": "I like the idea, but it needs some thought. \n\nWould you get paid per review? That would incentivize you to do as many reviews as possible, which means you’re just trying to crank them out which could jeopardize scientific integrity.  \n\nUniversities would also not be happy because, while professors should be working on this outside of their university time as “service,” they’d work on them during normal hours and essentially have two jobs at once. It could also present a unique conflict of interest for professors as well as government employees or industry employees who are reviewers. \n\nWhat if (and this is just a spitball) they were “paid” with credits towards publishing in that journal? It would incentivize reviewing for that journal as well as publishing in it. \n\nEdit: By credits I mean credits towards publishing fees. Some others (below) have suggested expedited publishing wish is an interesting thought, but I’d have to see what that looks like first.",
          "author": "duhrake5",
          "created": 1559307495,
          "upvotes": 45,
          "replies": {
            "epm62or": {
              "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm62or/",
              "text": "> which means you’re just trying to crank them out which could jeopardize scientific integrity.\n\nAs opposed to now, where nobody who crank them out as quick as possible because it's just something they have to do? ;-)\n\n> professors should be working on this outside of their university time as “service,”\n\nAt my institution \"service\" does not (necessarily) mean outside volunteer work, it's part of my job. For instance, sitting on department or college committee is part of service. Hence, the university is ostensibly paying you to do peer review.\n\nI agree though that there could be some issues with the mechanics of paying reviewers, particularly for government employees.\n\n> What if (and this is just a spitball) they were “paid” with credits towards publishing in that journal? It would incentivize reviewing for that journal as long as publishing in it.\n\nYour last line is an interesting idea. Credits toward publication or open access fees? I like the concept. Maybe have the AE give a rating of some sort to the review so that low-effort reviews earn less credit, or particularly high-effort reviews earn a bit more credit.",
              "author": "Statman12",
              "created": 1559308626,
              "upvotes": 32,
              "replies": {}
            },
            "epm4y3l": {
              "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm4y3l/",
              "text": "[deleted]",
              "author": null,
              "created": 1559308202,
              "upvotes": 14,
              "replies": {
                "epn616t": {
                  "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn616t/",
                  "text": "It's got \\*slightly\\* more value when it's transparent review and you can cite it.\n\n  \nI for example just applied to MRC and it was good to be able to literally cite my peer reviewings, because they have a thing about your commitment to open practices. So there is a selfish aspect to it.",
                  "author": "dl064",
                  "created": 1559322040,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "epm5phx": {
              "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm5phx/",
              "text": "There are all legitimate concerns and also manageable ones.  \n\nI've been paid to do proposal reviews by various private or government funders.  Not a lot, mind you, but it's better than nothing.  Review coordinators can tell when someone isn't doing a careful job, and having reviewers not anonymized to each other also helps maintain a certain standard of quality.  \n\nManuscript reviewing is part of professional service and doesn't present a conflict of interest any more than accepting an honorarium for giving a seminar, or receiving royalties on patents or books.",
              "author": "parrotlunaire",
              "created": 1559308491,
              "upvotes": 9,
              "replies": {}
            },
            "epm52fs": {
              "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm52fs/",
              "text": ">What if (and this is just a spitball) they were “paid” with credits towards publishing in that journal? \n\nWhat specifically is meant here? Would somebody who reviews a lot for the journal get an easier peer-review process?",
              "author": "CaptainCornerCamper",
              "created": 1559308248,
              "upvotes": 3,
              "replies": {
                "epm6dg3": {
                  "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm6dg3/",
                  "text": "I took it as something like \"in-store credit\" that could be applied to publication fees (if any) or open-access fees.",
                  "author": "Statman12",
                  "created": 1559308735,
                  "upvotes": 8,
                  "replies": {
                    "epm7hd5": {
                      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm7hd5/",
                      "text": "Mdpi give reviewers credits to offset publication fees",
                      "author": "Drcrocodile764678235",
                      "created": 1559309134,
                      "upvotes": 5,
                      "replies": {
                        "epmlzt0": {
                          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmlzt0/",
                          "text": "True. And the discount is not negligible. I have other various issues with MDPI, but this part is nice.",
                          "author": "joibest",
                          "created": 1559314736,
                          "upvotes": 4,
                          "replies": {
                            "epmn6rm": {
                              "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmn6rm/",
                              "text": "Agreed. It's not perfect. Their peer review is not exactly rigorous in favour of rapid publication in my opinion.",
                              "author": "Drcrocodile764678235",
                              "created": 1559315156,
                              "upvotes": 3,
                              "replies": {
                                "epmohjq": {
                                  "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmohjq/",
                                  "text": "Agreed again. On the other hand, I have also gotten some quite meticulous reviews on some papers. It's a bit inconsistent with them. \n\nWhat mainly irritates me personally is that some of my reviews, when negative, where acknowledged, but then the manuscripts got published after being resubmitted (without improvements) as new submissions. Not sure if this was intentional or not, but it's irritating to see a final paper that did not take into consideration obvious points to get it a bit improved. Anyhow...",
                                  "author": "joibest",
                                  "created": 1559315599,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "epm6wan": {
                  "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm6wan/",
                  "text": "I meant they wouldn’t need to pay the publishing fee (if there is one)",
                  "author": "duhrake5",
                  "created": 1559308918,
                  "upvotes": 6,
                  "replies": {
                    "epm7irq": {
                      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm7irq/",
                      "text": "Makes sense.",
                      "author": "CaptainCornerCamper",
                      "created": 1559309150,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "epm62x5": {
                  "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm62x5/",
                  "text": "Maybe not easier but they could get priority for their work to be reviewed? Just an idea.",
                  "author": "ThisIsSpata",
                  "created": 1559308629,
                  "upvotes": 5,
                  "replies": {
                    "epm6ntc": {
                      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm6ntc/",
                      "text": "Some sort of speed-up for the process for them could be good. They still get the same referee process as everybody else, but the other stuff happens a bit faster. I have published several 'letters' in journals and it is amazing how rapidly stuff can happen in such cases.",
                      "author": "CaptainCornerCamper",
                      "created": 1559308841,
                      "upvotes": 4,
                      "replies": {}
                    },
                    "epn6alo": {
                      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn6alo/",
                      "text": "You actually can email an editor before you submit saying 'we reckon XYZ is important and needs to be speedy, can you guarantee us quick review if we submit to you'. \n\n&#x200B;\n\nYou have to be well regarded already though.",
                      "author": "dl064",
                      "created": 1559322180,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "epn62wv": {
                  "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn62wv/",
                  "text": "PubPeer, you get a discount to publish there in future.\n\n&#x200B;\n\n\\>  Would somebody who reviews a lot for the journal get an easier peer-review process?\n\n&#x200B;\n\nRe this, there was a brilliant one on here a while ago where someone said they did loads of reviews for precisely this reason, and someone who worked at Nature or something went 'literally: no. Zero question: no. Not how it works at all'. Very lol.",
                  "author": "dl064",
                  "created": 1559322066,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "epnudtp": {
          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epnudtp/",
          "text": "I thought it would be nice for reviewers to earn credits on what their institution pays for journal access. For example, let's say your uni pays Elsevier $800,000 per year for full access to their journal collection. Each review you do earns a $25 credit. You do 8 reviews for Elsevier in a year, and so do the 1,000 other faculty and researchers at your large institution. As a whole, the faculty review labor saved the university $200,000, or a quarter of their Elsevier journal fees. Aside from saving the university money, review work now becomes something more worthwhile to show off in your evaluations/tenure reviews - there is a real value for the university associated with the work.",
          "author": "actionrat",
          "created": 1559333509,
          "upvotes": 10,
          "replies": {}
        },
        "epn59ki": {
          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn59ki/",
          "text": ">I know there's some mild ethical argument, but I'm also guessing that argument was pushed by elsevier\n\nI enjoy that people who claim the ethical argument, have no idea how absolutely brainwashed they are.",
          "author": "dl064",
          "created": 1559321628,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "epm8i1h": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm8i1h/",
      "text": "I feel similarly, but boycotts are a full professor's game. So I keep doing it, begrudgingly.\n\nWhen there's a choice of a journal of equal prestige at, say, Sage, I'll send it there. But that's not always possible.",
      "author": "ph0rk",
      "created": 1559309658,
      "upvotes": 38,
      "replies": {
        "epm8l9m": {
          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm8l9m/",
          "text": "Totally agree. For an early career person in a competitive world its just not an option.",
          "author": "Drcrocodile764678235",
          "created": 1559309716,
          "upvotes": 17,
          "replies": {
            "epmsyiv": {
              "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmsyiv/",
              "text": "It would be great if the world was actually competitive. As it stands, the few big publishers hold an oligopoly on 'high-impact' journals.",
              "author": "Matterials",
              "created": 1559317093,
              "upvotes": 8,
              "replies": {
                "epn6p43": {
                  "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn6p43/",
                  "text": "PLOS Medicine/genetics are quite respected. I'd take a PLOS Medicine, thanks. I believe they're quite legit and actually interested in the science.",
                  "author": "dl064",
                  "created": 1559322400,
                  "upvotes": 7,
                  "replies": {
                    "epo7973": {
                      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epo7973/",
                      "text": "eLife as well. Also while not huge impact factors, society journals are generally well respected",
                      "author": "TurkeyNimbloya",
                      "created": 1559339547,
                      "upvotes": 2,
                      "replies": {
                        "eptzw92": {
                          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/eptzw92/",
                          "text": "I like Michael Eisen on Twitter, to boot.",
                          "author": "dl064",
                          "created": 1559500974,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "epqi1a3": {
                      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epqi1a3/",
                      "text": "Sure, probably the best larger publisher out there. But they only have a few journals (and not more niche ones), and the supply of available publishing space is still very constrained.",
                      "author": "Matterials",
                      "created": 1559406172,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "epn5dib": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn5dib/",
      "text": "I love it. They've absolutely cracked it. We make the produce; pay them to take it; they don't pay us to review it; they sell it back to us. Fucking brilliant, genuinely hilarious.\n\nThey've even managed to make us think they're doing us a favour by offering Gold open access at about 5 grand. I love that they push that we're paying for quality copywriting, then you see articles published with notes from the author in the paper. I saw one a month or two ago where the title of the paper was 'Dr. \\[...\\] has no conflicts of interest to declare'. The title! How the hell did that get past anyone with a pair of eyes. Hilarious and awful in equal measure.\n\nThere was a good talk by an ex-editor of the BMJ who was saying that the profits \\*there\\* were fuckin' eye-watering, so God only knows what [NEJM etc. make](http://bjoern.brembs.net/2019/03/new-england-journal-of-medicine-and-you-thought-nature-was-expensive/), or at least that they disclose.\n\nIt is the swindle of the century. I read a piece recently that academic publishing is second to \\*tobacco\\* in terms of profits. Bravo to them.",
      "author": "dl064",
      "created": 1559321689,
      "upvotes": 29,
      "replies": {
        "epn6ehe": {
          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn6ehe/",
          "text": "Agree with everything in this comment!",
          "author": "Drcrocodile764678235",
          "created": 1559322239,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "eplzqxw": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/eplzqxw/",
      "text": "Wait, do they at least oversee the peer review process? You said your colleagues did it. You don’t mean the colleagues in your department do you?",
      "author": "TakeOffYourMask",
      "created": 1559306122,
      "upvotes": 15,
      "replies": {
        "epm0b77": {
          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm0b77/",
          "text": "Sorry, when I say 'colleagues' I mean anonymous members of the community I work in, but the point is its still free labour that Elsevier receives!",
          "author": "Drcrocodile764678235",
          "created": 1559306354,
          "upvotes": 28,
          "replies": {
            "epm1nea": {
              "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm1nea/",
              "text": "SO WHAT THE HECK DOES ELSEVIER DO?!",
              "author": "TakeOffYourMask",
              "created": 1559306910,
              "upvotes": 33,
              "replies": {
                "epm24ta": {
                  "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm24ta/",
                  "text": "Takes your money, apparently",
                  "author": "apolotary",
                  "created": 1559307110,
                  "upvotes": 34,
                  "replies": {
                    "eppem4y": {
                      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/eppem4y/",
                      "text": "RelX, RelX, RelX all teh way.",
                      "author": "grey_contrarian",
                      "created": 1559376484,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "epm2isr": {
                  "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm2isr/",
                  "text": "100% agree. Nothing. It's a scam.",
                  "author": "Drcrocodile764678235",
                  "created": 1559307266,
                  "upvotes": 23,
                  "replies": {}
                },
                "epmj3gg": {
                  "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmj3gg/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1559313743,
                  "upvotes": 12,
                  "replies": {
                    "epn6f3b": {
                      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn6f3b/",
                      "text": "Or biorxiv. Wellcome Open is a nice thing, and apparently comes from the fact they have also spotted that they're funding millions and millions in research funds which goes straight into publishers pockets, who do not give two shits about science/healthcare/the betterment of mankind.\n\nSo that's apparently Wellcome's big vision: fuck journals.",
                      "author": "dl064",
                      "created": 1559322248,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                },
                "epmh4jl": {
                  "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmh4jl/",
                  "text": "Not defending Elsevier, but if you're serious: [102 Things Journals Publishers Do](https://scholarlykitchen.sspnet.org/2018/02/06/focusing-value-102-things-journal-publishers-2018-update/)",
                  "author": "maenad-bish",
                  "created": 1559313107,
                  "upvotes": 0,
                  "replies": {
                    "epmkzdx": {
                      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmkzdx/",
                      "text": "This is not a good list. First of all it includes things like: \"Training of peer reviewers.\" Bullshit. \" Plagiarism detection.\" Bullshit. It's run through a program like turnitin and an editor considers what to do with that. \"Acceptance of submissions.\" Except they don't. Editors and reviewers do this. Unpaid of course. And many more like this. \n\nEverything is broken down way too much. The ones that are true boil down to handling dissagreements or mess ups of various kinds, basic administrative stuff like registering with ISSN, DOI, Science Citation Index, Scopus, and PubMed, and marketing. But the marketing is close to useless. I learn about journals becuase my advisors or colleuges told me about them or they popped up in Google scholar, PubMed, SciFinder, or somtehing like that. \n\nThis article did not convince me one bit. Honestly, universities or public institutions like NSF or something should host them. it's not something that should make a lot of money.",
                      "author": "Average650",
                      "created": 1559314390,
                      "upvotes": 26,
                      "replies": {
                        "epn6l5x": {
                          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn6l5x/",
                          "text": "The system is fucked. It's in my annual appraisal how much 'collegiate activity' I do, including peer reviewing/journal editing. I'm an editor for one (it's alright, actually) purely because, basically, I got told to by my boss. I do take it seriously, but the system is mental and totally perpetuates the publishers at the top making money for dick all activity.",
                          "author": "dl064",
                          "created": 1559322342,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "epmvdqn": {
                          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmvdqn/",
                          "text": "It sounds like you've already made up your mind about this topic, but I'll respond to some of your concerns--though many of them will reiterate some of the points on the list. (The list breaks things down because it's meant to be comprehensive and overkill, especially for newbies entering the industry). Again, I have no dog in the fight with Elsevier, and I'm still amazed that the U California System just walked away, and I applaud that sort of behavior by libraries.\n\nMost journals publishers do not use TurnItIn, but they do use other *commercial* products that provide a similar service. Peer reviewers aren't paid (and *that* isn't solely an issue with publishing, but rather the devolving state of academia all together), but they are wrangled and managed and have to feel confident that their time is being respected and that the journal they're reviewing for is reputable. \n\nEditors, of course, do the scholarly heavy lifting, but publishers provide infrastructure to help them do that job more efficiently. This is especially important being an editor is position of service. In a competitive environment, publishers do all they can to lure journals in with services for the editorial team. This includes submission management systems and copyeditors. Editors never have to worry about making their journal discoverable or durable. Copyright, DOI, metadata, archiving, deals with databases and librarires, specifics of financial arrangements with sponsoring academic societies--these are time consuming activities. \n\nThe scholarly journal ecosystem is much larger than individual students and their advisors. When journals choose a publisher, part of the service they're looking for revolves around \"does this publisher's strategy align with this journal's goals? What's this publisher's relationship with libraries? Does the publisher offer libraries attractive and cost effective packages of journals? Are they working primarily with R1s and can we get this publication into SLACs too? Does this publisher make content available for free in developing countries? Marketing is important because librarians can only track usage of journals they already subscribe to. Study after study shows that students and researchers alike will simply (1) abandon pursuit of a journal or article their library doesn't provide access to or (2) pirate it. Having a publisher market your journal is especially important in new and emerging fields or during a launch of a new journal. With limited funds (and universities choosing to squeeze library budgets), librarians have to make difficult choices about what their institutions' researchers and students have access to, and publishers can help them make those decisions. I can't stress enough how important librarians are in the journals business. I recommend looking at the work done by [Ithaka S+R](https://sr.ithaka.org/) for more insight on the complex relationships among researchers' thoughts and behaviors (often they don't align!), librarian choices, and publisher business models.\n\nAnd then, finally, there's the end-user. Developing technologies for interactive publications, transitioning from one platform to another while avoiding degradation, hosting, etc. are all expensive and require trained expertise.\n\nThere's certainly other models for journal publication. Some universities already host their own journals. If that's something you haven't seen before, it's might be worth exploring why and getting an editor's perspective. I suggest much of it has to do with some of the things I mentioned above. In whatever case, running a journal is both time and money-consuming, and that time and money *has* to come from somewhere.\n\nIf you're in the sciences, I think you'll start to see a real change in how scholarly publishing works once Plan S is implemented, and you may be happy with some of the outcomes. The goal is simple (making content OA), but it'll force some major changes within the STEM publishing process.",
                          "author": "maenad-bish",
                          "created": 1559317906,
                          "upvotes": 2,
                          "replies": {
                            "epn3lsk": {
                              "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn3lsk/",
                              "text": "Thank you for the thorough response!\n\nI think you did point out something I had not fully thought through, like the need for libraries to actually purchase subscriptions, and so marketing to libraries is important. \n\nBut let me make a few points:\n\n> In a competitive environment, publishers do all they can to lure journals in with services for the editorial team. This includes submission management systems and copyeditors.\n\nSubmission management systems, in my experience, and really pretty limited. Yes, they are important for journals with large numbers of submission, but they aren't complex, don't offer a ton of features, and could easily just be licensed (in fact I'm sure they are since so many are nearly identical). I agree about copyeditors; that is something of value that they offer. But the main point of this post is actually Elsevier cheaping out on that aspect and making it an automated system. If that trend continues, then it's one of the few valuable things done by publishers gone. \n\n> Copyright, DOI, metadata, archiving, deals with databases and librarires, specifics of financial arrangements with sponsoring academic societies--these are time consuming activities.\n\nThere is an administrative aspect that is valuable. Some of this is the financial aspect, which honestly need to go away. We are paying money so that money can be dealt with. That's not of value to anyone but the publisher. The other aspects, DOI, Copyright, archiving, are all there and need some administration to deal with it. But they also just aren't that complicated. It could be done with minimal, but not zero admittedly, admin. arXiv does hosting and archiving wonderfully. DOI and copyright is paperwork, but again, it's just not that complicated. \n\nYour 4th paragraph, as I said was something I had not thought through, and given how things must now work, I can see it is important. But it's all to solve an issue that should not be. They should be open access. All those problems vanish for open access articles managed by public funds. Open access would reduce the total spending on publishing because it would get rid of so much crap. \n\n>And then, finally, there's the end-user. Developing technologies for interactive publications, transitioning from one platform to another while avoiding degradation, hosting, etc. are all expensive and require trained expertise.\n\nI don't want publishers involved with \"Developing technologies for interactive publications\". When a pdf is not enough, then let the researchers make their own methods. They are good at it. \n\n>transitioning from one platform to another while avoiding degradation, hosting\n\nMinimal hosting is not hard. Transition platforms can be a pain, but with what I really want out of hosting, which is really very little (literally just an organized format of hosted pdfs), I don't think this is something that will happen that often. \n\n>There's certainly other models for journal publication. Some universities already host their own journals.\n\nIndeed they do. Most don't though, I would assume because they aren't funded.  \n\n>In whatever case, running a journal is both time and money-consuming, and that time and money has to come from somewhere.\n\nIt certainly does take some time and some money. But half of the things you mentioned only exist because the publishers have to make money. And most of the rest is not that hard. \n\nI don't blame all publishers (though I do blame some) because they do in fact have to make money. That's not their fault. But it's not a system that should make a lot of money. The very nature of academic research means it shouldn't directly make a lot of money. It benefits all of society which will in turn make more money, but that does not go directly to the academic process. \n\n>If you're in the sciences, I think you'll start to see a real change in how scholarly publishing works once Plan S is implemented, and you may be happy with some of the outcomes. The goal is simple (making content OA), but it'll force some major changes within the STEM publishing process.\n\nI hope this happens, but I am worried that the US will be worse off since we have no such movement. I try to publish with better publishers, more open access, etc. But there's only so much I can do.",
                              "author": "Average650",
                              "created": 1559320760,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "epmo86v": {
                      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmo86v/",
                      "text": "This list is ridiculous -- the question \"what does Elsevier do?\" is not meant literally. Writing 102 items where maybe 7 items are variants of \"have internal meetings\", 4 are variants of \"be indexed on search engines\", and a huge amount are \"do marketing and protect your trademark\" reeks of artificial inflation for the sake of trying to impress. Item #4 is \"Make money\" -- this is not a service the publisher does for anyone, and it certainly does not benefit scientists at large.\n\nThe mere fact that the paper allows researchers to submit manuscripts, even before peer review, is 4 items!  \n\n1. Solicitation of materials\n2. Rejection of submissions\n3. Acceptance of submissions\n4. Tracking of submissions throughout\n\nI am surprised this list does not cover the fact that occasionally someone has to clean the offices, which requires advertising a recruitment call for a janitor, interviewing the janitor, hiring the janitor, paying the janitor, inspecting the work of the janitor, managing the janitor, having a system to review the performance of the janitor, and finally performing the janitorial duty.  \n\nThere is no way I can take this list even remotely seriously.",
                      "author": "falafel_eater",
                      "created": 1559315509,
                      "upvotes": 9,
                      "replies": {}
                    },
                    "epmmnxt": {
                      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmmnxt/",
                      "text": "I *am* serious, and thanks.  I shall peruse.",
                      "author": "TakeOffYourMask",
                      "created": 1559314975,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "epm7x1m": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm7x1m/",
      "text": "This is what bugs me the most about the whole peer review process- there's little to no incentive to be a *good* reviewer. I haven't heard of anyone being paid to be a reviewer, they are all volunteer positions afaik. Not that they can directly pay them because of conflict of interest reasons. But journals expect academics to volunteer their time to review. Many of them will because being a reviewer is a nice CV booster. But you don't need to be a good reviewer to be able to put it on your CV. And since there aren't a ton of incentives to be a good reviewer a lot of academics will put minimal effort in their reviews-that's one of the reason why there are so many reviewers who don't even read the paper or pass it off to a barely qualified student for example. Then people wonder why there is a reproducibility crisis. Meanwhile, journals are rolling in money. I remember reading that Elsiver's profit margin last year was something close to 40%",
      "author": "stathicus",
      "created": 1559309294,
      "upvotes": 15,
      "replies": {}
    },
    "epm802d": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm802d/",
      "text": "Join the boycott! thecostofknowledge.com",
      "author": "nqqw",
      "created": 1559309336,
      "upvotes": 7,
      "replies": {}
    },
    "epnb2yz": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epnb2yz/",
      "text": "Every time I find an article only to discover I have to look at Elsevier’s website, a small part of me dies",
      "author": "misterkawhat",
      "created": 1559324536,
      "upvotes": 9,
      "replies": {
        "epnc1j2": {
          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epnc1j2/",
          "text": "The only thing that's direct about sciencedirect is that we the scholars directly support the whole enterprise!",
          "author": "Drcrocodile764678235",
          "created": 1559324997,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "epm7w64": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm7w64/",
      "text": "Pre-print its the future, i basically only read pre-prints these days. By the time it gets published its a year old anyway.",
      "author": "CytotoxicCD8",
      "created": 1559309285,
      "upvotes": 12,
      "replies": {
        "epn6tpo": {
          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn6tpo/",
          "text": "I had one recently that was biorxiv in december 2017, published online April 2019. I don't think it's in print yet, either. \n\n&#x200B;\n\nBiorxiv everything.",
          "author": "dl064",
          "created": 1559322468,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "epmg90e": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmg90e/",
      "text": "I don't understand why every discipline just doesn't have something like https://arxiv.org/. \n\nThat would cut the legs out from under these parasites.",
      "author": "dali-llama",
      "created": 1559312715,
      "upvotes": 5,
      "replies": {
        "epod7xw": {
          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epod7xw/",
          "text": "Note that that doesn't happen.  Some fields (for instance, astronomy) have ~100% of papers on the arXiv, but we still use journals for organising peer review and hosting.\nhttps://xkcd.com/2085/\n\nAnd our journals are all community owned, but still either charge significant page charges or significant subscription fees.  Publishers make high profits, but most of the fees are still going to their costs.",
          "author": "WilyDoppelganger",
          "created": 1559342364,
          "upvotes": 5,
          "replies": {}
        },
        "epn6y5i": {
          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn6y5i/",
          "text": "Couple of minor downsides:\n\n&#x200B;\n\n1. REF in the UK measures your quality of research and funds you accordingly. It's worth a lot. There are some fields that measure your research purely by journal. (Wrongly, obviously).\n2. They don't take meta analyses, lit reviews or commentaries.",
          "author": "dl064",
          "created": 1559322536,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "epmbm80": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmbm80/",
      "text": "Agreed. I thought they where one of the best out there, and instead they are just old and famous. So many younger publishers are more competitive, offering better services and a better smoother experience for everyone. \nElsevier truly only cares about profits. \nThere are many other publishers, and we as \"costumers\" can do a lot. For instance push your libraries to boicott elsevier, include other publishers that use different models, just spread the word!",
      "author": "BlueEmpathy",
      "created": 1559311020,
      "upvotes": 5,
      "replies": {}
    },
    "epmly91": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmly91/",
      "text": "I just published with them for the first time and it was a mess. Lots of things I couldn't fix anyway because the math editor was pretty weak, as was the reference editor. \n\nI'd think just adding stuff randomly would be caught, but it certainly would be easier since it would have to be caught and not explicitly added by the editor or someone else at the publisher.",
      "author": "Average650",
      "created": 1559314720,
      "upvotes": 3,
      "replies": {}
    },
    "epobnap": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epobnap/",
      "text": "> It makes me question what exactly Elsevier are providing besides a shell to conduct peer review and a hosting platform afterwards?\n\nAbsolutely nothing! That's why there's been a low-scale OA war in several disciplines.",
      "author": "Milespecies",
      "created": 1559341609,
      "upvotes": 2,
      "replies": {}
    },
    "epmd7gm": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmd7gm/",
      "text": "Journals *are* just a shell to conduct peer review and provide permanent hosting.",
      "author": "WilyDoppelganger",
      "created": 1559311610,
      "upvotes": 4,
      "replies": {}
    },
    "epm42hu": {
      "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm42hu/",
      "text": "> All content is editable and therefore undermining the peer review process. For example, at this stage for key points could be changed or countless self citations added.\n\nYeah, Taylor and Francis had a similar thing for an article I published recently. If you really think that you could slide substantial changes under the rug, please do it and document that process. Until then, I call bullshit.\n \n> Now they will claim that this process has some editorial oversight but in my experience it does not. It's a joke.\n\nAre you an editor for an Elsevier journal? Or did you actually make substantial changes to your paper and have them get published? If neither of those is the case, then on what basis are you making this claim?\n\nI don't like the big publishers' business model either, but this complaint about them seems a bit silly.",
      "author": "Statman12",
      "created": 1559307887,
      "upvotes": -4,
      "replies": {
        "epm7syo": {
          "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epm7syo/",
          "text": "I don't want to test them like you say because I want my articles to have integrity. However, I've seen errors go through that wouldn't happen if an editor was actually checking it properly.",
          "author": "Drcrocodile764678235",
          "created": 1559309253,
          "upvotes": 5,
          "replies": {
            "epn70k5": {
              "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epn70k5/",
              "text": "We had one a month or two ago where the journal *added* millions of errors, e.g. changing 'sex' to 'gender'.",
              "author": "dl064",
              "created": 1559322573,
              "upvotes": 5,
              "replies": {}
            },
            "epmcrh7": {
              "link": "/r/AskAcademia/comments/bv6o0s/every_time_i_publish_with_elsevier_a_small_part/epmcrh7/",
              "text": "I'm curious how you're able to tell, from the results, a difference between a lack of editorial oversight vs the editor just missing something.",
              "author": "Statman12",
              "created": 1559311451,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}