{
  "sid": "ozpcj0",
  "link": "/r/AskAcademia/comments/ozpcj0/do_i_lack_the_experience_to_finish_my_phd/",
  "title:": "Do i lack the experience to finish my PhD ?",
  "text": "I have published my first [Paper](https://t.co/WGuptVejXk?amp=1) in robotics in IROS2021 and i have been receiving feedback that my writing style is a bit unclear. What can I do to improve my style. I am a 22 year old PhD student, and just trying to gain more experience and i feel like everyone around me has more experience than me, does this feeling ever go away ?",
  "author": "Hopeful_Nature_4542",
  "created": 1628323712,
  "updated": 1634079988,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "h8365fu": {
      "link": "/r/AskAcademia/comments/ozpcj0/do_i_lack_the_experience_to_finish_my_phd/h8365fu/",
      "text": "Gently, this post might be an example of how your writing is unclear. You ask if you lack experience to get a PhD, then instead of outlining why you feel you might be lacking experience you talk about some specific feedback from a paper that you got and ask how you can improve your writing. But you don't stop the there, in the same paragraph you jump back to experience and wanting to gain experience but without explaining what experience you think you lack and from there you start talking about other people's experience and how you feel. \n\nYou've got a muddle of thoughts and ideas here that aren't structured and don't seem to relate to each other particularly. \n\nSo to try and give you some thoughts on all of this\n\n\n- you don't need experience to do a PhD. A PhD is a training position and the thesis is the culmination of your training years where you've developed research skills and some novel intellectual outputs.\n\n- talk to your PI and colleagues about your writing and get feedback on it. Try to view it as telling a story in which you take your reader one step at a time through the story. However, it's not a murder mystery don't leave the big reveal to the end. Read what you write out loud, you hear it totally differently.\n\n- find out if your university offers writing classes\n\n- don't compare yourself to everyone else. Every PhD is unique and your journey is your journey and their journey is their journey. Everyone has bumps in the road and they come when they come. Everyone else has their own doubts and insecurities. You do eventually get over it, usually about a month before graduation just before you start the cycle again with a postdoc (joke)!\n\n- you have a paper. You're winning.",
      "author": "ACatGod",
      "created": 1628364157,
      "upvotes": 7,
      "replies": {}
    },
    "h8864kd": {
      "link": "/r/AskAcademia/comments/ozpcj0/do_i_lack_the_experience_to_finish_my_phd/h8864kd/",
      "text": "I agree with the other commenter, but I also wanted to add that learning how to write papers is something almost every PhD student goes through. I have all of my students read *Eloquent Science* by David Schultz. It’s an excellent book and I read it during my PhD. I just replaced the atmospheric science talk with examples from my field.",
      "author": "keeganskateszero",
      "created": 1628466116,
      "upvotes": 5,
      "replies": {}
    }
  }
}