{
  "sid": "pbvq4m",
  "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/",
  "title:": "What are your best tips for PhD dissertations?",
  "text": "I am looking for good tips on giving a dissertation as I proceed with the next steps in my thesis. Any sugggestions are appreciated!",
  "author": "CulturalChapter",
  "created": 1629968795,
  "updated": 1634079484,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.7,
  "comments": {
    "haem8ri": {
      "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/haem8ri/",
      "text": "Stay organized early on; use a citation manager; find out your school's formatting requirements and adhere to them from the get go. It will save you so much time and stress at the last mile. \n\nAfter you send a chapter to your advisor, don't wait for comments before starting the next chapter. Start right away. \n\nGive yourself a few days to sit with comments (especially if they're harsh), then make a to-do list organized by easy fixes and difficult/time-consuming ones. Address them methodically, starting with the easy ones to make you feel like you're making quick progress.\n\nWhen researching, take the time to make an outline of the important papers/books you will be drawing on. Write a short abstract at the top and some keywords/connections to other research you're using. This will be an invaluable resource to draw on when you need to reference the material as you're writing; you won't have to waste time poring through the original source trying to find that one line or idea. \n\nGood luck!",
      "author": "philosorugger",
      "created": 1629971707,
      "upvotes": 19,
      "replies": {
        "haerq65": {
          "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/haerq65/",
          "text": "All of this a thousand times over. Only thing I'd add is start with the easy bits and don't think you have to write it in order. Getting something on the page makes so much difference. If you have figures make them first because it's time consuming but easy and will give you a structure for each chapter.",
          "author": "ACatGod",
          "created": 1629975954,
          "upvotes": 8,
          "replies": {
            "hagtvj1": {
              "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/hagtvj1/",
              "text": "Absolutely, that's a good point. I used to be intent of writing in order, but with my dissertation it made sense to start on ch 2, because that's what I was reading about at the time and I needed to be clear about my methodology for the rest of the project to take shape. Then I went to chapter 3, then back to 1, and so on.",
              "author": "philosorugger",
              "created": 1630008326,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "haft159": {
          "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/haft159/",
          "text": "> find out your school's formatting requirements and adhere to them from the get go\n\nLearn to use Word's document styles features off the bat too. It can save so much time.",
          "author": "giraffesaurus",
          "created": 1629993707,
          "upvotes": 6,
          "replies": {}
        },
        "hajewv4": {
          "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/hajewv4/",
          "text": "Thank you for this advice!",
          "author": "CulturalChapter",
          "created": 1630059630,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "haejyr2": {
      "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/haejyr2/",
      "text": "It will never be perfect, aim for 'good enough'",
      "author": "DeepSeaDarkness",
      "created": 1629969742,
      "upvotes": 11,
      "replies": {}
    },
    "haf5986": {
      "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/haf5986/",
      "text": "Keep separate chapters in separate word documents. The bigger the document the harder it gets to manage. \n\nKeep online backups of your work in case your computer crashes. \n\nWrite the methodology first. It’s the easiest thing to do since you’re only explaining what you did/ what you’re going to do. \n\nSet small manageable deadlines to help you progress. \n\nUse the comments function in word to help you remember things.",
      "author": "idontdigdinosaurs",
      "created": 1629983650,
      "upvotes": 8,
      "replies": {}
    },
    "haeyel9": {
      "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/haeyel9/",
      "text": "“The best dissertation is a finished dissertation.”",
      "author": "mlocklam",
      "created": 1629980120,
      "upvotes": 9,
      "replies": {}
    },
    "haesb0p": {
      "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/haesb0p/",
      "text": "As always, YMMV, all that, but 2 things that worked for me:\n\n* Recursive outlining. Outline main chapters, sanity check with advisor. Then outline sub-chapters, check with colleagues and advisor. Keep breaking it down and re-arranging until you have something that flows naturally. \n\n* Writing badly. Learned that from listening to a podcast with Dan Harmon, TV show writer behind Community and Rick & Morty. When I get stuck looking at the blank page it's difficult to lower my standards enough that I start writing, because I want to be a good writer. But I can't become one if I don't write, so what I need to do is the opposite: try to write as badly as possible (while still being intelligible). It's a lot easier to write badly so this let me put a lot more words on paper in a short period of time, and simply revise them later, which actually led to my writing improving.",
      "author": "needlzor",
      "created": 1629976369,
      "upvotes": 6,
      "replies": {}
    },
    "haflyzd": {
      "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/haflyzd/",
      "text": "No one is gonna read it. Just finish it. Make the papers you get out of it good, but the dissertation itself, meh.",
      "author": "CptS2T",
      "created": 1629990869,
      "upvotes": 5,
      "replies": {}
    },
    "hag673m": {
      "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/hag673m/",
      "text": "Make a schedule for your days that includes significant research/writing time, and try to follow that schedule five days a week.\n\nAlso make a timeline for each chapter (for example, research and take notes for one month, write the chapter draft for one month). Get a draft of a chapter finished, send it to your committee, and move to the next chapter. \n\nThis will allow you to make a tentative schedule for completing your first draft. Once you have a completed draft in decent shape, revisions are a lesser task. \n\nGood luck!",
      "author": "gggggggggggfff",
      "created": 1629998850,
      "upvotes": 5,
      "replies": {}
    },
    "hakyyft": {
      "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/hakyyft/",
      "text": "I know a lot of people use word, particularly if they’re not in stem, but can I just shout out LaTeX… it takes a second to set up the first time, particularly if you haven’t used it before and don’t have templates you can adapt (just download one and make it work), but 50 pages in its very nice to not be thinking about formatting, citations, bibiliographies, referencing tables and figures etc all over the place. \n\nI personally use LaTeX for mine and it’s been a absolute time saver for formatting and referencing. It’s backed up automatically if you use overleaf, GitHub integrated for pulling to a offline machine if you happen to be writing off grid, and built in zotero/mendeley integration makes citations easy Peasy. Just \\cite[author] in the text and it’s done. No need to format, no need to place, no need to figure out what number the citation should be. Same for figures and tables, just \\ref[nameoftable] and like magic. No need to worry about changing table numbers, figure numbers etc. \n\nIt seems like a little thing and the learning curve is there, but damn if those little things don’t add up to a lot less on your mind.",
      "author": "whenwillthisphdend",
      "created": 1630085801,
      "upvotes": 3,
      "replies": {}
    },
    "hbe3j8p": {
      "link": "/r/AskAcademia/comments/pbvq4m/what_are_your_best_tips_for_phd_dissertations/hbe3j8p/",
      "text": "Lots of great tips already. The one that worked best for me was to force myself to write something every single day. Sometimes all I managed was a single sentence or a citation. Other days the writing came easy, and I’d get 5-6 pages out. Then there were the days where I would lose 2 pages due to trimming/editing. \n\nThis strategy is what got me finished when I was in my first faculty position at an R1 (instructor level, teaching 5:4) while ABD.",
      "author": "GoldenBrahms",
      "created": 1630632288,
      "upvotes": 2,
      "replies": {}
    }
  }
}