{
  "sid": "qlr09x",
  "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/",
  "title:": "A PhD at Oxbridge vs at Ivy",
  "text": "Canadian masters student here, thinking about a PhD in English literature. The goal is to teach in Canada, especially in English and the digital humanities. I also will have a LIS (librarianship) certification.\n\nCould you highlight for me the pros/cons of studying at Oxbridge vs. Ivy (esp. Stanford, Yale, and Harvard, which all have great digital literary labs or projects)? \n\nI would love to hear from people generally in humanities, not just English.",
  "author": "funkykookaburra",
  "created": 1635932743,
  "updated": 1636136918,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.63,
  "comments": {
    "hj4y08g": {
      "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj4y08g/",
      "text": "I'm a last year Canadian PhD student at Cambridge and have visited some American schools. Will try to provide insight.\n\nOxbridge will take you 3 years and they are quite strict about graduating in time. American schools will take double that. I actually wish I had a bit more time, like maybe six months, but the length of an American PhD does seem excessive. You don't take classes here, but in most American phds you do. You don't have to teach at Oxbridge but it is extra money. The teaching is in little groups of a few people at once, called \"supervisions\", rather than big classes. The college system is a big thing - you get assigned to a house (think Harry potter), can live there if you want, and a lot of people's main social groups are their colleges. \n\nDo you like hiking? Mountains? Forests? You're not gonna get it in England. On the other hand, maybe you like beautiful old architecture and tradition and sitting around big tables with chandeliers dressed up in formal wear - we've got loads of that!\n\nOther thoughts: Brexit is a pain in the ass. British people can be really lovely but it's often hard to get to know them in the first place. The NHS feels like a conservative government took Canadian healthcare and gutted it over the course of a decade (which is essentially what happened). It functions and it's probably still a lot better than America(?), but I go back to Canada for a lot of health related things.\n\nOverall I would 100% make this choice again.",
      "author": "Monsteriah",
      "created": 1635940486,
      "upvotes": 13,
      "replies": {
        "hj6oriw": {
          "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj6oriw/",
          "text": "Just a note that the length of an American PhD (5-6 years) is not excessive because you have to **earn the MA/MS en route**. (This is true even if you earned a Master's from another institution in the U.S. or abroad.) As far as I understand, you can't pursue a UK PhD unless you earned a Master's beforehand.\n\nSo, all told, both options take roughly the same amount of time.\n\nEdited to add: healthcare in the U.S. is a dystopian nightmare.",
          "author": "synthesis-synthesis",
          "created": 1635966378,
          "upvotes": 10,
          "replies": {
            "hj6pr3q": {
              "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj6pr3q/",
              "text": ">As far as I understand, you can't pursue a UK PhD unless you earned a Master's beforehand.\n\nYou can, but it's not common. It can be offered to very good students who gained lots of research experience during their bachelor and have very good references and academic record. So in the end they get a PhD 3 years after their bachelor if they go to the UK compared to staying in the US as they truly skip any master requirements",
              "author": "methomz",
              "created": 1635966757,
              "upvotes": 4,
              "replies": {
                "hj6t1py": {
                  "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj6t1py/",
                  "text": "Thanks, that's helpful to know. However, the poster specifically mentioned Oxbridge, and as far as I can tell, their programs do require a Master's to apply? I would imagine that even if they make exceptions, they would be pretty rare since the chances of getting in at all are slim. Having a Master's becomes an easy way to winnow the pile. (To be fair, I guess it's all moot in this specific case since the poster is currently a Master's student.)",
                  "author": "synthesis-synthesis",
                  "created": 1635968032,
                  "upvotes": 3,
                  "replies": {
                    "hj6yxjk": {
                      "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj6yxjk/",
                      "text": "All programs require masters in the UK, but exceptions will be made for good students. That's also the case in canada and other EU countries. You simply said it's not possible in the uk, I clarified that it is regardless of what OP asked just so that anyone reading with intentions of doing a PhD in the uk knows and get the correct info if they think they are to that level. But you are right that it is not common as I said and there's no direct route on how to make it happen. Even in oxbridge you can go from bachelor to PhD. They will consider it but you have to take the chance to apply for PhD positions even without a master. Sometimes they will suggest master applicants to apply for a PhD instead too if they think they qualify even if they don't have a master. Of course it's unusual, we are talking here about bachelor students with publications already and sometimes work experience as well and near perfect academic records, it's really not the norm.  I often see it happen because someone worked under the suggested PhD supervisor during their bachelor and the supervisor wants them to continue the research as a funded (PhD) student",
                      "author": "methomz",
                      "created": 1635970308,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hj7gzif": {
              "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj7gzif/",
              "text": "In the UK, undergrad takes 3 years, a master's takes 1 year, and a PhD takes 3 years. So while I see your point, 4 years for a master's plus PhD in the UK is still less than the average American PhD.",
              "author": "Monsteriah",
              "created": 1635977350,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hj587kh": {
          "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj587kh/",
          "text": "I wouldn't say there's no hiking in England! The peak district, lake district, Yorkshire dales etc. are pretty great, and snowdonia in Wales. They are just not very near to Cambridge or Oxford. Oxford does have the Chilterns nearby, and the Cotswolds not far out.\n\nI do agree though that Brexit is a pain in the arse and the NHS is a bit of a shambles, but at least it's there unlike America.",
          "author": "UsernamesAreHard2684",
          "created": 1635945873,
          "upvotes": 8,
          "replies": {
            "hj5oqmh": {
              "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj5oqmh/",
              "text": "So people always say this to me lol. And don't get me wrong, I like this country for a lot of reasons. But I've been here over four years now, I have been everywhere you listed, and I wouldn't call any of it \"hiking\" to a fellow Canadian (even if it technically is) without a disclaimer: It's long, windy walks on unforested, pretty bare, and almost entirely flat land. If you're into that, cool! But it's a compeletely different vibe than what comes to mind when you say \"hiking\" to a Canadian, and I wanted to be upfront with OP about that, because nobody was with me before I got here and I ended up disappointed because of it.",
              "author": "Monsteriah",
              "created": 1635952735,
              "upvotes": 10,
              "replies": {
                "hj7tx7c": {
                  "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj7tx7c/",
                  "text": ">wouldn't call any of it \"hiking\" to a fellow Canadian \n\nHonestly, hiking should be the second Canadian official sport.",
                  "author": "funkykookaburra",
                  "created": 1635982913,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hj55fai": {
          "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj55fai/",
          "text": "Wow, thank you for the details! Yeah, I do like a bit of hiking, but I've heard lovely things about Wales :) Nothing compares to Canada, though. Will you be staying in academia? Teaching during my PhD is fairly important to me, because I want to stay in academia - but I have no idea how Cambridge's PhD students get those supervision positions. Do you have any insights there?\n\nTotally agree with you re:health care. We got it good at home.",
          "author": "funkykookaburra",
          "created": 1635944521,
          "upvotes": 2,
          "replies": {
            "hj5pcdk": {
              "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj5pcdk/",
              "text": "No worries. Yep I'm trying to stay in academia, and already have some good postdoc offers. I'm not in your field, but in mine, becoming a supervisor is easy and anyone can supervise generally as much as they want. There is high demand and often professors fill in if they can't find enough grad students to supervise. I do think it is similar across fields. It's good pay too,  30+ pounds per hour of teaching, but that doesn't include marking or prep. See my other reply re: wales haha, no it does not compare but maybe you will like it anyway :)",
              "author": "Monsteriah",
              "created": 1635952969,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hj6jvoa": {
      "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj6jvoa/",
      "text": "My opinion is that you shouldn’t choose a programme based on the university but the professor with whom you want to study. Though it is true that a large number of professors who are incredibly established in the fields happen to be at good universities, that’s not always the case. In short, find who you want to study with, how they can help you in your career, and go there — regardless of where there might be.",
      "author": "PhDinFineArts",
      "created": 1635964508,
      "upvotes": 8,
      "replies": {
        "hj7gy3w": {
          "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj7gy3w/",
          "text": "Oh, I know! There are a smattering of professors that I would equally like to work with at each school. Thank you for reminding me!",
          "author": "funkykookaburra",
          "created": 1635977334,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hj96kx6": {
      "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj96kx6/",
      "text": "I just want to add to the discussion on time-to-degree. If your plan is to stay in academia, a longer (funded) program can be advantageous because it gives you more time to publish in preparation for the hyper-competitive job market. Due to covid, the publication process is slower than ever and the job market is at its most competitive. So you really need those publications, and on average they'll take at least 2 years. Unless you come in with an article or two ready to submit, a 3 year PhD doesn't give you much time to build your CV.\n\nI did my phd in 5 years at an ivy. I would have stayed for a sixth, but I landed a post-doc. It was an opportunity I couldn't pass up, as these are quite rare in the humanities, but as someone who started grad school straight out of undergrad (not your situation, I know) I would have appreciated more uninterrupted time to get a few additional articles in the pipeline.",
      "author": "jmgbam21",
      "created": 1636009676,
      "upvotes": 4,
      "replies": {
        "hjar94w": {
          "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hjar94w/",
          "text": "Seconding this and adding that this is (part of the reason) why two years of coursework can be really helpful. When I graduated, all the publications I had out at that time started off life as seminar papers written during coursework. They were enough research to get me my TT job. Only one of them really had anything to do with my dissertation, and it was more a prelude to it than a constitutive part of it.\n\nThey also showed breadth. Even if you end up getting an R1 job, you won't just be teaching your specialized area. Coursework, especially coursework that generates publications (or, at least, conference talks) is a way of showing that while you dissertated on the appearance of pets in 18th century portraiture, you also have something to say about 16th century vases, can employ queer theory to analyze tik tok, *and* can draw on your expertise to put together a really interesting survey class for first-year undergrads that meets various gen ed requirements and attracts them to study art history. (Not a class you'd have helped to teach at a UK institution, as they don't have gen ed in the same way, and don't try to recruit current students to their major / honour school, as they've already applied to a specific department as part of their admission to the university).",
          "author": "CruxAveSpesUnica",
          "created": 1636042669,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj4owai": {
      "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj4owai/",
      "text": "I'm afraid I'm only a Masters student but I have studied at Oxbridge and know a fair bit about how their research degrees. I trust you're aware of the most basic distinction between a US degree and one in the UK, in that the former takes 6-8 years or so, and requires a heavy teaching load, whereas in the UK, you get just 3 years, and teaching is entirely optional. If you're funded, you are literally paid just to research, that's it, with no obligations beyond that - although there are plenty of teaching opportunities if wanted. Regarding libraries, I can't speak for Ivies, but I can say that Oxbridge have some of the most amazing libraries in the world. There are tonnes of special collections e.g. copies of medieval lyrics that you literally cannot access anywhere else, all sorts of famous manuscripts and the Oxford and Cambridge libraries are Bodleian (sp) libraries, which means they can request a copy of any book ever printed in the UK, I believe, so you're never going to be short of paper to shift. There's also a number of awesome faculty libraries which are just as well stocked and often advertise for jobs and work experience. So, if you're searching within the UK, I say that you'll find it tough to do better. Hope that helps!",
      "author": "FlexMissile99",
      "created": 1635934257,
      "upvotes": 6,
      "replies": {
        "hj55pa6": {
          "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj55pa6/",
          "text": "Thank you! Half of the resources I need for my research is in the Bod (very niche), and I would love to be at Oxford for that reason - but the lack of funding for international students, and lack of teaching positions, is making me hesistate.",
          "author": "funkykookaburra",
          "created": 1635944661,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hj4s2ye": {
      "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj4s2ye/",
      "text": "I imagine any of these choices would look amazing on a CV and provide the same level of networking opportunities. The real decider is probably going to be where do you want to live? \n\nAs a UK resident I would put in a good word for the free NHS, and you don't even have pay tax as a student.",
      "author": "UsernamesAreHard2684",
      "created": 1635936644,
      "upvotes": 5,
      "replies": {
        "hj6q8wc": {
          "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj6q8wc/",
          "text": ">As a UK resident I would put in a good word for the free NHS\n\nOp, it is not free for foreigners. You have to pay a health surcharge  when you apply for your visa. It's around 500£ per year and you pay the total upfront for the duration of your studies. Some universities will apply for a 3 + 1 years visa in case you need an extension, so it can cost up to around 2000£ (2700USD). There's an online calculator to approximate how much you would be paying. It's better than the health insurance you would usually be given with a US  studentship tho, so still worth it. It was just to let you know it's not technically free for us.",
          "author": "methomz",
          "created": 1635966947,
          "upvotes": 4,
          "replies": {}
        },
        "hj5623h": {
          "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj5623h/",
          "text": "Ahaha, as r/Monsteriah said above, we have the equivalent to the NHS here too. I'm doxxing myself slightly (as if my post history doesn't), but I'm researching a niche field of fantasy and natural language processing. American schools are great for labs and funding for the latter, but Oxford has the primary text sources I need in the Bod. \n\nFunding and teaching ops are important to me too!",
          "author": "funkykookaburra",
          "created": 1635944837,
          "upvotes": 2,
          "replies": {
            "hj579z6": {
              "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj579z6/",
              "text": "Yeah I know Canada has it too, yours is even better than ours! I just can't imagine living in the US without it. I've never even used the NHS other than for birth control, but the thought of drowning in debt forever if I got hit by a car, or caught in a mass shooting or something, was enough to put me off studying in America. \n\nOxford is also great for labs and funding btw! Oxford and Cambridge are big science hubs in the UK. But yeah Oxford is just so old, it has almost any book held in a library or storage vault somewhere.",
              "author": "UsernamesAreHard2684",
              "created": 1635945437,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hj8qivn": {
      "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj8qivn/",
      "text": "Just apply everywhere and make this decision if you get offers",
      "author": "doornroosje",
      "created": 1635998187,
      "upvotes": 2,
      "replies": {
        "hj9q1pz": {
          "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj9q1pz/",
          "text": "Thank you for your answer. I would if I could! :) Financially, this isn't a possibility for most people, and it isn't for me, either. Picking and choosing will have to do.",
          "author": "funkykookaburra",
          "created": 1636025826,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj6rmuu": {
      "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj6rmuu/",
      "text": "Scrolling down, I realize a couple of people have made the same inaccurate comments about time to degree in the U.S., so I wanted to re-post this comment separately: \n\nThe length of an American PhD (5-6 years) is not excessive because you have to **earn the MA/MS en route** doing coursework and exams in the first two years. (This is true even if you earned a Master's from another institution in the U.S. or abroad, though they may allow you to take fewer courses.) As far as I understand, you can't pursue a UK PhD unless you earned a Master's beforehand. (*Someone informed me that UK DPhils don't always require a Master's. My guess is that Oxbridge, which both state it as a requirement, would regularly use it as an easy way to narrow down the pool, since they're so selective.)\n\nSo, all told, both options (can) take roughly the same amount of time.\n\nTeaching loads vary widely by U.S. institution. I was at an Ivy and only TA'd two courses. The goal was to gain pedagogical experience, not to financially support ourselves (although we were paid). At public institutions with less funding, students teach *a lot* more (i.e. almost every semester, sometimes beginning as early as their second year while they're still in coursework, often multiple sections) because those grad students do actually depend on teaching for tuition remission and a living wage. Hope this all helps!\n\n(Obviously, there are PhD students in the U.S. who stay on as 7th and 8th years, but they're moved into a different administrative \"unenrolled\" status, are no longer eligible for funding, and are likely to have their degree candidacy terminated.)",
      "author": "synthesis-synthesis",
      "created": 1635967483,
      "upvotes": 1,
      "replies": {
        "hj7hdnw": {
          "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj7hdnw/",
          "text": "I responded to your comment above but maybe since you reiterated, I will too. In the UK, a master's degree typically only takes one year. So the masters plus PhD is typically 4 years, which is still shorter than the average American PhD program. There are also 4 year master's + PhD programs in the UK that you can pursue directly after undergrad (I'm in one).",
          "author": "Monsteriah",
          "created": 1635977512,
          "upvotes": 2,
          "replies": {
            "hj85ff7": {
              "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj85ff7/",
              "text": "I appreciate the response!",
              "author": "synthesis-synthesis",
              "created": 1635987973,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hj7gu4j": {
          "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj7gu4j/",
          "text": "Thank you for clarifying about the time length.",
          "author": "funkykookaburra",
          "created": 1635977289,
          "upvotes": 1,
          "replies": {
            "hj86k7k": {
              "link": "/r/AskAcademia/comments/qlr09x/a_phd_at_oxbridge_vs_at_ivy/hj86k7k/",
              "text": "You're welcome! And /u/Monsteriah pointed out the UK route is still generally a year shorter (assuming a 5-year U.S. degree). Another thought: in the U.S. lack of teaching experience puts many people out of the running (even at top R1s, we expect to see something). Maybe consider asking Canadian faculty how much they weigh teaching experience when choosing new hires? That might help you with your decision. Good luck.",
              "author": "synthesis-synthesis",
              "created": 1635988478,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}