{
  "sid": "prvfde",
  "link": "/r/AskAcademia/comments/prvfde/advice_on_theoretical_frameworks_in_qualitative/",
  "title:": "Advice on theoretical frameworks in qualitative health research",
  "text": "I am writing up a paper on my recent interview studies. I am exploring palliative care for patients who are homeless. I conducted interviews with palliative nurses and consultants  street outreach teams, homeless hostel staff as well as service users. My data was analysed using the glaser and Strauss grounded theory approach of letting themes emerge from the data. \n\nI'm used to being a research assistant in the past so less experienced in the theory than the practical side of research. My personal views are the best way to explore a problem is by exploring the views and experiences of the experts - ie. The participants in the problem.\n\nMy supervisors have advised that I include a section on the theoretical framework early in the paper/chapter but I honestly aren't sure what to say.",
  "author": "denimbastard",
  "created": 1632146225,
  "updated": 1634078918,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hdp8hjb": {
      "link": "/r/AskAcademia/comments/prvfde/advice_on_theoretical_frameworks_in_qualitative/hdp8hjb/",
      "text": "Grounded theory had a slight split between those who took a constructivist/interpretivist approach, and those who took a critical realist approach. Reflect on your own beliefs on ontology and epistemology and you can usually pin yourself down to one of the above.\n\nUsually being explicit about your theoretical framework shows your research approach, design and methods are congruent and not contradictory. It's similar to research design being a holistic \"thing\" which makes your claims correctly bounded and warranted. I.e. you can have an appropriate method but if your trying to make causal claims with a low sample size then your overall research design is a bit bunk.",
      "author": "MFA_Nay",
      "created": 1632218706,
      "upvotes": 1,
      "replies": {}
    }
  }
}