{
  "sid": "pbqh1a",
  "link": "/r/AskAcademia/comments/pbqh1a/going_back_after_dropping_out/",
  "title:": "Going Back after Dropping Out",
  "text": "Hello Academics! I haven’t been able to find any real answers to this question and I’m hopeful the people here can shed some light on a difficult topic. \n\nFor context; I left my university (McMaster, CAD) after two extremely difficult years. The first came with awful family issues, and I prioritized the care and well being of my folks above my schooling. I failed too many classes and they recommended I start again with a different end goal for my second year. My second year was started with three major life events immediately following each other and I barely made it a month in before I was too depressed to carry on and simply stopped going. \n\nI’ve been focusing on work, seeking help for my mental health, and in classic finding-yourself fashion have caved in and admitted art school is where I should have been all along. But going back isn’t just reapplying somewhere else. I don’t have any idea where to begin or how to fix what happened. My gpa is definitely warped and I don’t have many credits. I am very motivated to go back to school, and I wish I’d had better luck the first time around, but I like to think it had to happen so I’d be open to the encouragement of others to follow an art career. If anyone has any idea on what to do next and where to go from here, I am desperate to get back to school and miss academics deeply. \n\nThank you to anyone and everyone who reads through, whether or not you know what to do here. I hope everyone has absolutely awesome start of term, and a great semester :) \n\nTake Care!",
  "author": "aspiringboy",
  "created": 1629945535,
  "updated": 1634079492,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hadmqz1": {
      "link": "/r/AskAcademia/comments/pbqh1a/going_back_after_dropping_out/hadmqz1/",
      "text": "I'm about to do the same thing as you as well. I also had some pretty serious life events that screwed over my junior and senior years and I ended up with three straight semesters of Fs and incompletes, very rough. Shouldn't have happened in the first place but it did. After about a year and a half break I'm giving it another shot in an entirely different field now. I hope that you have gained strength and learned more about yourself through your failures and troubles. Trying again with experience I call it. I'm unsure what you mean by \"what to do next\" because as far as I can tell it's just go to class! Best of luck.",
      "author": "palladists",
      "created": 1629946638,
      "upvotes": 2,
      "replies": {
        "haestsq": {
          "link": "/r/AskAcademia/comments/pbqh1a/going_back_after_dropping_out/haestsq/",
          "text": "When I mentioned not knowing what to do next, I’m just not able to find any resources on reapplying to other schools after leaving one on bad terms! As far as I know you can’t just put in a new application somewhere else and have it turn over a new leaf, and I genuinely feel so silly for not knowing what to do to restart!",
          "author": "aspiringboy",
          "created": 1629976726,
          "upvotes": 1,
          "replies": {
            "hafrzdo": {
              "link": "/r/AskAcademia/comments/pbqh1a/going_back_after_dropping_out/hafrzdo/",
              "text": "Look at the catalogs of the colleges you are thinking of attending. They should have information on transfer students and how they deal with previous grades. If a given college looks likely, then contact the Enrollment Office for specific information about applying to that college.\n\nAlso, in our university system we have something called Academic Renewal (that faculty call academic bankruptcy) that basically doesn't consider any of your previous work and you start over with a new GPA. In our system you have to be out of college for 3 years to do it and start over. It doesn't sound like you've been out that long, but you might look for that type of thing at your new college. Maybe it exists in a shorter time frame that would allow you to use it.\n\nBy the way, some people might tell you to simply not tell the new college about your previous grades and apply as a new student and start over again. I'd suggest that you not do that; colleges will want to see your transcripts of all previous college work and it's remotely possible that you could land in some academic trouble if you don't submit previous transcripts and the college somehow learns about them later.",
              "author": "rockyfaceprof",
              "created": 1629993295,
              "upvotes": 2,
              "replies": {
                "hagelkb": {
                  "link": "/r/AskAcademia/comments/pbqh1a/going_back_after_dropping_out/hagelkb/",
                  "text": "This is very insightful, thank you! I appreciate the advice a lot!",
                  "author": "aspiringboy",
                  "created": 1630002172,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hadtanj": {
      "link": "/r/AskAcademia/comments/pbqh1a/going_back_after_dropping_out/hadtanj/",
      "text": "I had a similar situation. I flunked out of engineering school due to life issues. I found an employer that would pay for my schooling and attempted to return. Unfortunately there is only one college in my city for me to attend so when I returned the academic advisor told me I was too stupid to get an engineering degree and that I should switch to an easier major. Because of that gatekeeping and my poor GPA I was not allowed back into the college of engineering. Instead I switched to the college of LAS(letters, arts, and sciences) to pursue a physics degree. I'm a year away from finishing. Although my cumulative GPA is low, my GPA since returning is above 3.8. There's definitely always a way to get what you want, though there may be hurdles. I say just stay driven and use your new wisdom to help guide you through it. I have found quite a lot of individuals that are accepting of the fact that people make mistakes and need second chances. Just vocalize your story and find the people that will advocate for you in the school.",
      "author": "joshuamunson",
      "created": 1629950074,
      "upvotes": 2,
      "replies": {
        "haet0sf": {
          "link": "/r/AskAcademia/comments/pbqh1a/going_back_after_dropping_out/haet0sf/",
          "text": "I’m so sorry to hear about that sort of aggressive gatekeeping; I know a lot about stuff like that unfortunately. Do you know about the reapplication process? Did you struggle to get into the LAS based on your previous post secondary schooling?",
          "author": "aspiringboy",
          "created": 1629976852,
          "upvotes": 2,
          "replies": {
            "hafhvy5": {
              "link": "/r/AskAcademia/comments/pbqh1a/going_back_after_dropping_out/hafhvy5/",
              "text": "It happens I will suppose\nAnd no I had no issues re-entering in the college of LAS",
              "author": "joshuamunson",
              "created": 1629989184,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}