{
  "sid": "p2c039",
  "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/",
  "title:": "Going back to industry...already feel the stress",
  "text": "So, im finishing off my PhD. I'm leaving towards going back to industry simply because I hate the toxic side of academia/ felt extremely unappreciated by my new PI.\n\nI've been sending out my CV/ portfolio and was getting some pretty awesome replies. An add came up for a company that looked really interesting to me, so I sent my portfolio on Sunday. \n\nOn Monday I spent the entire day at the lab -finishing off so I didn't check my mail all day. The company I applied to replied saying they really liked my work and asked if I was available for an interview the next morning. I replied in the late afternoon (4pm), first apologizing for taking so long to reply - I had not checked my mail all day, and that if they were still available I'd love an interview.\n\nThey replied the next day, with quite a rude attitude , saying that I was wrong and should have replied faster. Now they're not sure when they will fit me in. Maybe I'm over thinking this but I already got the feeling of being stressed out , just not replying to an email ASAP because I was genuinely busy doing other work / without access to my laptop. Other companies I applied to were way more familiar and friendly - though the work/ location wasn't as nice as this place \n\n\nI'm tempted to just cross this place off my potential places to work - is it wrong if I take the interview simply for an ego-boost/ try get a feel for how useful I am in the industry  , I don't think I would want to work there if it already feels stressful",
  "author": "whatwhatindbutt",
  "created": 1628684627,
  "updated": 1634079843,
  "over_18": false,
  "upvotes": 98,
  "upvote_ratio": 0.95,
  "comments": {
    "h8j4778": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8j4778/",
      "text": "Absolutely makes sense to use them as interview practice. However they sound very toxic to work for. What kind of place requires you to reply within the same day without telling you in advance? What if you were out of town for the whole week? Geez.",
      "author": "PumpkinCrumpet",
      "created": 1628687817,
      "upvotes": 85,
      "replies": {}
    },
    "h8iywj8": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8iywj8/",
      "text": "Getting the interview sounds like the ego boost.\n\nDoing the interview sounds like self flagellation. Why interview with an organization that sets up interview within 24h window and expects an immediate reply? Take what you learned from working in a toxic work environment and remember being in that space talking to those types of people is no ego boost.",
      "author": "spaceforcepotato",
      "created": 1628684917,
      "upvotes": 192,
      "replies": {
        "h8iz50c": {
          "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8iz50c/",
          "text": "True - I would not use the word ego boost for the interview itself - like you self.\n\nMore that, it's a good opportunity to see what Companies offer in terms of salary/hours and to get an idea how high/low/where  I could fit inside of these types of companies.\n\nI've had interviews where I was offered half my current pay and others where it was on bar, with longer hours but a higher position etc etc so it's another Datapoint I guess (I have to say i haven't applied for interviews for around 8 years...all my jobs were from people i had worked with already.so it's all a bit alien to me, especially being a 30 year old)",
          "author": "whatwhatindbutt",
          "created": 1628685055,
          "upvotes": 22,
          "replies": {
            "h8izg81": {
              "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8izg81/",
              "text": "You can get that information online and from career services. Neither of those venues are going to create stress, rather they will alleviate it.\n\nBy taking this interview you are welcoming stress into your life.\n\nIf it were me I would avoid this company. Even considering taking it as a practice interview may backfire cause they’ve already established they are awful with over the top expectations of their workers.",
              "author": "spaceforcepotato",
              "created": 1628685235,
              "upvotes": 29,
              "replies": {}
            }
          }
        }
      }
    },
    "h8j6pc5": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8j6pc5/",
      "text": "Nothing wrong with it in principle but a place that runs recruitment like this is probably going to run a shitty interview. I'm not sure how much benefit you're going to get from an interview run by organisation that thinks the best candidates are the ones who respond to an email quickly. I think you may just find yourself wishing the next 55 mins passes quickly after the first 5mins.",
      "author": "ACatGod",
      "created": 1628689082,
      "upvotes": 49,
      "replies": {
        "h8kxplk": {
          "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8kxplk/",
          "text": "> Nothing wrong with it in principle but a place that runs recruitment like this is probably going to run a shitty interview\n\nAnd also probably treat their employees like shit",
          "author": "ProbabilisticWorld",
          "created": 1628715733,
          "upvotes": 4,
          "replies": {}
        },
        "h8j7jec": {
          "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8j7jec/",
          "text": "To be honest it's also a networking thing - the negatives are yes, it may turn out to be a frustrating interview, but at the end of the day I guess it's also putting my name out there too (granted, with a company that does amazing work but perhaps not the best hiring manager )",
          "author": "whatwhatindbutt",
          "created": 1628689491,
          "upvotes": 10,
          "replies": {
            "h8j8tsa": {
              "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8j8tsa/",
              "text": "Interviews aren't really a great networking opportunity in my opinion. They're gonna blitz through the candidates and probably forget everyone else. I've interviewed probably around 50 people in the last 12mo for a variety of jobs and it sounds awful, but the only ones I remember were the real car crash interviews and the people we hired. \n\nYes occasionally there is someone who interesting but doesn't fit the role and I do remember those candidates over the years but the point of the interview is to find someone who you can hire. If you're not hired then you're not interesting, in that particular context.",
              "author": "ACatGod",
              "created": 1628690098,
              "upvotes": 14,
              "replies": {}
            },
            "h8jqgcy": {
              "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8jqgcy/",
              "text": "Why would you want to network with a company that treats people this way?\n\nYou’re at the point where you’ll leave an abusive boss, and either break free of the cycle, or go right into being abused by your next boss. Who are you gonna be?",
              "author": "Greenmantle22",
              "created": 1628697699,
              "upvotes": 10,
              "replies": {
                "h8jqvdq": {
                  "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8jqvdq/",
                  "text": "I guess it's more of a self-worth thing . I've been in academia for the last 8 years, if I manage to get an offer then at least I would know I don't really have to settle (though I wouldn't take the job if it came to it).",
                  "author": "whatwhatindbutt",
                  "created": 1628697874,
                  "upvotes": 2,
                  "replies": {
                    "h8jrqhi": {
                      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8jrqhi/",
                      "text": "Speaking of self-worth, don’t you think you’re worth enough not to be talked to this way? If you’re a stranger and they act this way, how toxic will they be if you ever work for them? Don’t even waste your time interviewing. Don’t go near them.\n\nAbusive bosses and abusive companies are predators. They can smell weakness. And unfortunately, your weakness (eagerness to please and desperation to get a job so you don’t feel like a failure) smells like a goddamn steak dinner to a predator. You’re the workplace equivalent of the sexy teen runaway who tells the shady pimp her life story and admits she’ll do ANYTHING to avoid going back home. A predator knows what that means, and it gives them quite an advantage over their prey.\n\nYou don’t need this job. You merely need “A” job. And you never need to be mistreated or shamed by a potential employer.",
                      "author": "Greenmantle22",
                      "created": 1628698240,
                      "upvotes": 13,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h8j6rmc": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8j6rmc/",
      "text": "I would absolutely not take a job if it were offered to me after interviewing at this place. Major red flags for a toxic workplace. If you want to use it as interview practice, then go for it. I definitely did my rounds and turned down multiple jobs while trying to figure out the negotiation process.",
      "author": "biglybiglytremendous",
      "created": 1628689114,
      "upvotes": 18,
      "replies": {}
    },
    "h8jul1k": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8jul1k/",
      "text": "I don't recommend interviewing.\n\nPeople who act like this are very likely to use the interview to 'punish' you for not replying to their schedule, and to put you down. They likely have no intention of hiring you, but want you to beg them for an interview date and then have the satisfaction of rejecting you.\n\nI know that sounds extreme, but there are a surprising number of toxic people like that.",
      "author": "sirophiuchus",
      "created": 1628699451,
      "upvotes": 8,
      "replies": {
        "h8kh3z6": {
          "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8kh3z6/",
          "text": "I guess I won't - in the original email I asked for an alternative date and they still haven't replied 😂😬 I guess I fucked up",
          "author": "whatwhatindbutt",
          "created": 1628708838,
          "upvotes": 6,
          "replies": {
            "h8kjf9h": {
              "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8kjf9h/",
              "text": "You _really_ didn't. Replying on the same day is perfectly reasonable. So would replying the next day.\n\nThese people are crazy and guilt tripping you (and you seem easy to guilt trip, possibly due to advisor trauma).\n\nWrite it off! They would never have been good employers.",
              "author": "sirophiuchus",
              "created": 1628709791,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "h8j2wun": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8j2wun/",
      "text": "It’s not wrong. It’s good to practice your interviews and negotiating at a place where you now know you don’t care if they reject you before you do interviews someplace you really like",
      "author": "doubtful_blue_box",
      "created": 1628687141,
      "upvotes": 7,
      "replies": {}
    },
    "h8jbvce": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8jbvce/",
      "text": "Use them as interview practice for petty revenge, but getting sass from a recruiter is a big red flag. I would not plan on working there. However, you can see what kind of offer they cut you and use that to get a sense of what your lower end salary target should be.",
      "author": "Radiant-Tax",
      "created": 1628691496,
      "upvotes": 7,
      "replies": {}
    },
    "h8jdp3z": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8jdp3z/",
      "text": "Hiring managers at popular companies are quite often a$$holes as they think they are special. They are not the true face of the company. Go for the interview regardless of the snarky email. Good luck!",
      "author": "Whtzmyname",
      "created": 1628692305,
      "upvotes": 6,
      "replies": {}
    },
    "h8jmqte": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8jmqte/",
      "text": "My first inclination is to say, Fuck em! and that this is a sign of sign of things to come if you join this org. However, I'm thinking you might want to see where it goes. Maybe your contact person was having a bad day. They may not even be someone you'd have to work with once onboarded. Meet others in the organization to better assess if this might be a toxic environment. In the meantime, keep applying to other stuff, and don't stop until you have a firm *written* offer in hand.\n\nThis is a lesson though that when job searching you must frequently check your email. I have a friend who missed opportunities because they didn't check their emails. This is a must!",
      "author": "Hot-Pretzel",
      "created": 1628696157,
      "upvotes": 5,
      "replies": {}
    },
    "h8k6cul": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8k6cul/",
      "text": "I wouldn't do it. This is the number one thing I hate about working in industry and why I plan to get into academia as soon as I am financially ready in 2-3 years. \nPeople expect responses to emails immediately. When you get 100 emails a day, there isn't time to answer them all immediately. Then they pile up and you end up working late or on the weekend just to answer dumb emails. I hate it.",
      "author": "vw68MINI06",
      "created": 1628704496,
      "upvotes": 4,
      "replies": {
        "h8kgroa": {
          "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8kgroa/",
          "text": "One question - why financially ready? I got quite a generous pay doing my PhD.",
          "author": "whatwhatindbutt",
          "created": 1628708697,
          "upvotes": 2,
          "replies": {
            "h8onhcx": {
              "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8onhcx/",
              "text": "What did you do your PhD in? How much did you get paid? Most people I talk to have said that their spouse had to support them otherwise their families wouldn't make ends meet. Programs I have looked into are around $20k/year stipends. I am looking to do mechanical engineering. Also, I have heard it is can be tough to find well paying work after you finish. I have an exceptionally high paying job as a sales engineer right now and I figure in about 2-3 years, I won't require a job in order to survive ever again (aside from unforseen circumstances.)",
              "author": "vw68MINI06",
              "created": 1628792318,
              "upvotes": 1,
              "replies": {
                "h8oqusg": {
                  "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8oqusg/",
                  "text": "I started with 50K and ended with 56K  - this was pay, if I needed stuff for my research the department paid, doing really exciting research so I honestly can't complain (apart from the toxicity that had a huge impact on my mental health )\n. Infact, today I got an offer for an amazing place in industry, but it's around 8K less  in a way more expensive city ... Both cases are in engineering.\n\nHey your job looks interesting, if you're looking for a PhD graduate that also wants an early retirement dm me 😂 (kidding )",
                  "author": "whatwhatindbutt",
                  "created": 1628793841,
                  "upvotes": 1,
                  "replies": {
                    "h8pbpl7": {
                      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8pbpl7/",
                      "text": "Haha my job feels pretty toxic to me and it is soooo boring. \n\nWhat was so toxic about academia for you?",
                      "author": "vw68MINI06",
                      "created": 1628802413,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h8jxpkk": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8jxpkk/",
      "text": "Not at all! You’re right to be alarmed by their response—that is definitely not normal. And it certainly COULD be an indication of the company’s environment and expectations. It could also just be the hiring manager or whoever you corresponded with is just shit at their job, and you may never see or interact with them were you to work there. I’d still take the interview, as practice, and as a means to judge the company. Hopefully whoever would be your direct supervisor would also be in on the interview, and how you feel with that person is much more important to consider were you to actually work there.",
      "author": "peacelovesquirrels",
      "created": 1628700766,
      "upvotes": 4,
      "replies": {}
    },
    "h8k316i": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8k316i/",
      "text": "Obviously that's a terrible first impression, however are you sure that the person worked for the company? Sometimes companies will hire a recruitment agency to find candidates for them and recruiters can be real jerks.",
      "author": "carpecaffeum",
      "created": 1628703045,
      "upvotes": 3,
      "replies": {}
    },
    "h8kjle7": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8kjle7/",
      "text": "Consider yourself lucky they already showed their true colors! Less time wasted on your side. A good future employer would never have this kind of attitude.",
      "author": "tryatriassic",
      "created": 1628709863,
      "upvotes": 3,
      "replies": {}
    },
    "h8klw7z": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8klw7z/",
      "text": "Don't go for the interview! It sounds very toxic already.",
      "author": "kevinbsmith006",
      "created": 1628710810,
      "upvotes": 3,
      "replies": {}
    },
    "h8l7ho6": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8l7ho6/",
      "text": "Cross it off. Why work somewhere who is troubled by your interest to work there. \n\nIn the US? Go fed. High probability if keeping s remote job with great flexibility.",
      "author": "BTownPhD",
      "created": 1628719844,
      "upvotes": 3,
      "replies": {}
    },
    "h8lci1e": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8lci1e/",
      "text": "Everyone else in this thread seems to have it right. Sounds like a bad place to work. Also, you're essentially letting random strangers control your mental state if you're allowing one rude email to get you stressed out. You don't owe them anything! Good luck with your job hunt!",
      "author": "iliveinsalt",
      "created": 1628722050,
      "upvotes": 3,
      "replies": {}
    },
    "h8m3dym": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8m3dym/",
      "text": "Sounds not great, but industry isn’t magically better than academia in every way. Quite the contratry, you are sometimes expected to produce results on a much shorter timeline, like Dr. Stantz said.",
      "author": "ph0rk",
      "created": 1628739736,
      "upvotes": 3,
      "replies": {}
    },
    "h8jyi6h": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8jyi6h/",
      "text": "Fuck them. Don't even bother. If this is the energy they are showing you, its not worth this job.",
      "author": "CptSmarty",
      "created": 1628701100,
      "upvotes": 2,
      "replies": {}
    },
    "h8k63s0": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8k63s0/",
      "text": "It's not wrong at all, by all means take advantage of the interview they're offering.  For you it represents practice and field research in this regard.  Their HR people will need to demonstrate that they've interviewed X number of qualified candidates to satisfy corporate policy anyway.\n\nShould they fail to sway you during the proceedings, that's on them.  If they can't work out that their poor communications etiquette made that an uphill climb for them from the start, that's likewise on them.  You aren't their employee, you absolutely did not owe them an immediate reply.  They're presuming an obligation and leverage, and demanding that you tacitly accede to it before any offer has even been made.\n\nWhich brings up an important point about the corporate world - while academia can be toxic, the corporate world...well, it tends to frame surviving routinized passive toxicity as its pinnacle virtue.\n\nOne element of that is the level of entitlement employers like this have.  They're not entering into a business arrangement with another party providing a needed skillset they lack.  They've nothing to prove to the likes of *you*.  They're benevolently granting you the exceptional - and undeserved - gift of some of *their* money.  A gift they will rescind should you displease them.  A 'gift' which in reality is a fraction of the wealth you would generate for them, otherwise they wouldn't bother.  And had you not been the most appealing (ie. likely to produce) candidate on the market, that's who they would have hired in the first place.\n\nI don't mean to say anyone should walk in with a sense of entitlement, or inflate their self worth before they've learned an industry by working in it, or maintain a defiant attitude towards structure.\n\nIt's just that if you can't tell, I was deeply soured by my experience in the corporate world.  I found the principles it operates by utterly dehumanizing, and some of the characters I encountered exceeded any stereotypes I'd absorbed from media.  It made me work like crazy to get into grad school.",
      "author": "S_Belmont",
      "created": 1628704391,
      "upvotes": 2,
      "replies": {}
    },
    "h8le6sy": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8le6sy/",
      "text": "You deserve enough respect to email them back and respectfully let them know that they just lost an outstanding candidate.",
      "author": "samg76",
      "created": 1628722800,
      "upvotes": 2,
      "replies": {}
    },
    "h8ltaj0": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8ltaj0/",
      "text": "Sounds like a shitty place to work at I'll be honest. \n\nA reasonable company would try to set up a date and time where both parties agree to interview. That place sounds like they are super desperate to get literally anyone  who slightly meets their requirements. \n\nMy guess is at the interview you'll be hit with lines like:\n\n\"We're a big family here\"\n\n\"Everyone here gives 100% and more\"\n\n\"Here at our company, we are always for our employees and give everything to them\"",
      "author": "Malpraxiss",
      "created": 1628729836,
      "upvotes": 2,
      "replies": {}
    },
    "h8lxghy": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8lxghy/",
      "text": "When I was interviewing teenagers to work part time at a video game store I recognized that they had commitments and may take a day or two to respond to my phone call. \n\nI would walk away from any company that tells you, from the beginning, that they expect immediate responses. Or run away, actually. Their demands of you would only get worse as time goes on.",
      "author": "frankie_prince164",
      "created": 1628731804,
      "upvotes": 2,
      "replies": {}
    },
    "h8lxms7": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8lxms7/",
      "text": "Yeah don’t bother with that, you shouldn’t be expected to answer within an hour of an email. Fuck em’",
      "author": "eggplant_wizard12",
      "created": 1628731886,
      "upvotes": 2,
      "replies": {}
    },
    "h8ms8cp": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8ms8cp/",
      "text": "Wow thanks all for the input - I guess I'll take your advice - I'll take the job! (Kidding )\n\nActually, I just got an email from a company I've been interviewing with for a while ... I have the final interview tonight :) (i.e after speaking about salary etc etc). I'm quite excited. And it's my bday tomorrow so fingers crossed ! It's in R+D",
      "author": "whatwhatindbutt",
      "created": 1628757545,
      "upvotes": 2,
      "replies": {}
    },
    "h8lrkb5": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8lrkb5/",
      "text": "This is more appropriate for a jobseekers subreddit, no? I don't see how this post has anything meaningfully to do with academia.",
      "author": "yakiguriumai",
      "created": 1628729020,
      "upvotes": 1,
      "replies": {}
    },
    "h8mv6ws": {
      "link": "/r/AskAcademia/comments/p2c039/going_back_to_industryalready_feel_the_stress/h8mv6ws/",
      "text": "uhh screw them, I wouldn't interview with them if they are already acting unprofessional. be picky!",
      "author": "notjennyschecter",
      "created": 1628760114,
      "upvotes": 1,
      "replies": {}
    }
  }
}