{
  "sid": "pxk027",
  "link": "/r/AskAcademia/comments/pxk027/would_a_masters_of_law_and_economics_have_career/",
  "title:": "Would a Masters of Law and Economics have career prospects in academia?",
  "text": "I am a Finance major and have been increasingly leaning towards a career in academia. This was not in my plans when I started my bachelors and is not a common path to take in my field. I am now considering masters programs but I am concerned that some that interest me do not lead to competitive PhD programs and are aimed towards professional careers. I would be open to this, but do not want to cross out a career in academia. \nOne program that keeps coming up is a masters in law and economics. If anyone has ran this course, any advice/insight would be appreciated.",
  "author": "Historical-Passion54",
  "created": 1632876164,
  "updated": 1634078819,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "heox6cb": {
      "link": "/r/AskAcademia/comments/pxk027/would_a_masters_of_law_and_economics_have_career/heox6cb/",
      "text": "Yes, there are many lawyers/economists in my field of criminology. If you have a good research idea there will be interested supervisors. Do a search on the experts page of the universities you are considering and see how their work might cross over with your interests.",
      "author": "Corrie_W",
      "created": 1632895157,
      "upvotes": 1,
      "replies": {}
    },
    "hep78su": {
      "link": "/r/AskAcademia/comments/pxk027/would_a_masters_of_law_and_economics_have_career/hep78su/",
      "text": "This question is hard to answer without 1) knowing what your proposed trajectory is in academia, 2) knowing what you'd actually be doing in the masters in question. Generally, if you want to do academia, you have to get a PhD. PhD adcoms care about the coursework and research you did that relates directly to their PhD. So for example, if you want to do a PhD in finance and have a strong profile for that already, you can get whatever masters you like - it's gonna be useless but hey, I won't tell you how to have fun. If you don't have a strong profile or want to do a PhD in say biology, that's a different story. \n\nPersonally, to me it sounds like you're not super sure of your career goals, in which case I'm not sure any kind of graduate school is right for you. I would recommend taking 2-3 years off to work and think/discover where you want to go next. The masters will always be there.",
      "author": "thegreenaquarium",
      "created": 1632903509,
      "upvotes": 1,
      "replies": {}
    }
  }
}