{
  "sid": "hmq57i",
  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/",
  "title:": "Do you think that life would be easier if there was just one universally accepted citation style?",
  "text": "I know it sounds a rhetorical question. But as a TA, I have noticed that students in my institution often have a very difficult time with correct citation style. My class follows APA. Somehow, even with widely available internet sources (and even citation generators) many still do not seem to get it. Sometimes I wonder if a universally accepted, standardized citation style, across disciplines would make more sense. \n\nPerhaps this is more of a rant out of frustration. But I figured I would extend this question to the crowd to see what others think.",
  "author": "International-Drive9",
  "created": 1594107751,
  "updated": 1634080105,
  "over_18": false,
  "upvotes": 388,
  "upvote_ratio": 0.98,
  "comments": {
    "fx6oq4b": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx6oq4b/",
      "text": "I think it makes sense that for example philosophy and mathematics or physics follow different citation styles. In philosophy, one often addresses arguments of the author so naming them via something like Harvard citation style makes sense. On the other hand, in mathematics and physics papers references are often made to results only and a lot of papers often have a lot more authors than in other fields, making numbered referencing more useful as we otherwise would cite a whole slew of names even if we used et al. (e.g. \"previous experiments \\[1,2,3,4,5\\] have shown...\" would be atrocious with names). I don't see any way to devise something standardised that fits both of these needs.",
      "author": "ImAlsoAHooman",
      "created": 1594108380,
      "upvotes": 165,
      "replies": {
        "fx6po9c": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx6po9c/",
          "text": "Great answer that clears it up for me. I must admit, I have never really read much in to citation style despite being at the PhD level. It is something that has never really come up. I have always just used the citation style expected. I have noticed that many of the students in the class I TA just cannot seem to \"get\" APA citation. It seems that many are simply confused due to the different styles used in other classes. But your answer clears it up very well for me. Thank you.",
          "author": "International-Drive9",
          "created": 1594109327,
          "upvotes": 59,
          "replies": {
            "fx76i8o": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx76i8o/",
              "text": "I'm just gonna add here that a lot of students don't *care* enough to bother. They think \"eh, what does it matter?\"\n\n I find it very frustrating as a student that some professors want APA, some MLA, some Chicago and some don't gaf. And here I'm only talking about within my department, not even across multiple disciplines. As an undergrad, I often had multiple papers due all at the same time, with a combination of citation styles requested. \n\n\nI had a professor once who took off points for every citation mistake. That made me triple check my citations. But it also made me think *WHY*. As long as the information is all there at the end, and you can find my original source, does it *really* matter if I accidentally put a period instead of a comma somewhere?",
              "author": "FunInTheShade",
              "created": 1594125214,
              "upvotes": 65,
              "replies": {
                "fx7yo8q": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7yo8q/",
                  "text": ">I'm just gonna add here that a lot of students don't care  \n>  \n> enough to bother. They think \"eh, what does it matter?\"\n\nI think it's incumbent on faculty to *teach* students why it matters. My department starts with first-year students and explains why our discipline uses a specific format (Chicago) while we're teaching it. Sure, they have to learn APA in psych and MLA in English, etc. but when they are in our classes they are learning the conventions of *our* discipline, reading articles in *our* journals, raiding bibliographies in *our* monographs, etc. So part of doing the disciplinary work includes learning the citation conventions of the discipline.\n\nMany still don't care, so we assign points to citations to up the stakes. We also teach them how to cite and how to use tools like Refworks and Endnote and Zotero. It's all so damned *easy* now there's no excuse to do it in a half-assed manner, but quite a few students still want to use some made-up format they invented in high school.",
                  "author": "SnowblindAlbino",
                  "created": 1594140703,
                  "upvotes": 9,
                  "replies": {}
                },
                "fx774rn": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx774rn/",
                  "text": "This is kind of what I am talking about. It seems as though students are mostly confused due to having to learn different citation methods in different classes. It seems rather burdensome and germane. Most professors and TAs do not care all that much. However, you do occasionally encounter one who does, and I think this tends to scare students a little bit. \n\nPersonally I just dock a few marks out of 100, and point them towards a citation generator for future work. But I often think that it would just be easier to just amalgamate APA, MLA and Chicago to just put this minor issue to bed.",
                  "author": "International-Drive9",
                  "created": 1594125665,
                  "upvotes": 9,
                  "replies": {
                    "fx79ze6": {
                      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx79ze6/",
                      "text": "I will fucking bow down and grovel at the feet of whoever created Zotero.",
                      "author": "MoonlightsHand",
                      "created": 1594127580,
                      "upvotes": 24,
                      "replies": {
                        "fx7pr8t": {
                          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7pr8t/",
                          "text": "I studied for years before I discovered Zotero, what a profound difference it made not just to citation but to how I read and organised my thinking. I love that I can think ‘I’m sure I read something about this in my Masters’ and find it in a few clicks.",
                          "author": "Kateskayt",
                          "created": 1594136324,
                          "upvotes": 8,
                          "replies": {
                            "fxb1sf4": {
                              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxb1sf4/",
                              "text": "How does Zotero do that for you?\n\n- BiBTeX user transitioning to Mendeley",
                              "author": "pressed",
                              "created": 1594211529,
                              "upvotes": 1,
                              "replies": {
                                "fxb2tup": {
                                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxb2tup/",
                                  "text": "Tags! Mendeley and Zotero are very similar but I think Zoteros group capabilities are a lot better. I set up private groups to share literature when I work with other people. I’ve got lots of them. It’s been a while since I used Mendeley but last look it didn’t do that part as well.",
                                  "author": "Kateskayt",
                                  "created": 1594212235,
                                  "upvotes": 1,
                                  "replies": {
                                    "fxbku2s": {
                                      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxbku2s/",
                                      "text": "Ah, so you are organized enough to manually tag every reference you import :)\n\nI have the lazy way of backing up my library every time I have a major change, which let's me see a snapshot of history if I need to. \n\nBut for side projects I do sometimes use tags. \n\nMendeley does have online groups now by the way. It's okay. The reference importation is stupidly difficult to work with as it's based on scraping PDF files instead of pasting doi links..",
                                      "author": "pressed",
                                      "created": 1594222195,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fx8pc7b": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8pc7b/",
                  "text": "It's very weird to be asked to cite in multiple styles in the same discipline.\n\nBased on my experience working in publishing at university presses, professors suck at writing citations, so the idea that they're being so pedantic in grading their students' citations is hilarious.",
                  "author": "kyclef",
                  "created": 1594153281,
                  "upvotes": 4,
                  "replies": {}
                },
                "fx9mnxo": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9mnxo/",
                  "text": "I feel like students don’t get it because they can just google something. To me, citations make a lot of sense if I think about using paper copies of journals(like when I did my undergrad). I have a hard time conveying to students that the reference has to help me find the source, because they want to just give a link and a lot of t just doesn’t work or have enough info. That said, I teach intro level and the higher level course profs always think we just skipped it because the students don’t know how to use APA.... I think this has to do with what you say above!",
                  "author": "flyingkittens123",
                  "created": 1594170993,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "fx7zjq6": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7zjq6/",
              "text": "I think a lot of it has to do with students generally not being taught how to even do APA citations, MLA, Chicago etc.\n\nI go off what I see on Purdue and I’m like ??\nI’ve noticed that it depends on the professors, some are more lenient and some are stricter.",
              "author": "goldenaml",
              "created": 1594141122,
              "upvotes": 2,
              "replies": {}
            },
            "fx9g5tj": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9g5tj/",
              "text": "I will also point out that both MLA and APA have areas which are loosely defined (for example, font size and font face). These are often *specifically* defined by a certain teacher or professor. For example, some demand Times New Roman at 12pt. However, I've had some professors not only demand that, but then also state that this is what MLA or APA demands, when actually APA or MLA (at least way back in version 4 or 5 when I still owned those manuals) stated that a serif font of between 11-12 pts should be used. \n\nPlus, it really does get confusing going back and forth between two similar styles like MLA and APA, when it is difficult enough to learn one.",
              "author": "doublekross",
              "created": 1594167165,
              "upvotes": 1,
              "replies": {
                "fx9gkso": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9gkso/",
                  "text": "I think you're touching on a very valid frustration for students. I tend to think most errors are the result of the confusion of switching back and forth between classes. Learning the material is generally difficult enough, and excessive attention paid to citation style can take away focus from the material (which is the entire reason students are there). This exact concern is what provoked me to ask this question.",
                  "author": "International-Drive9",
                  "created": 1594167403,
                  "upvotes": 1,
                  "replies": {
                    "fx9h24p": {
                      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9h24p/",
                      "text": "I teach high school, and when I teach my students MLA, I teach them from the manual and do not add in my \"preferences\", which I think also clouds the issue. I think it's important to learn to follow a style so that you'll be able to put together a paper which will be acceptable to a publication, and for high-schoolers, I think it's important for them to be able to pay attention to detail. Too many students (both high school and college) think it's \"good enough\" that someone can muddle out what they're saying, instead of putting in the effort to be clear.",
                      "author": "doublekross",
                      "created": 1594167684,
                      "upvotes": 1,
                      "replies": {
                        "fx9h9tx": {
                          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9h9tx/",
                          "text": "Agreed.",
                          "author": "International-Drive9",
                          "created": 1594167807,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fx74eta": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx74eta/",
          "text": "There are stylistic clashes even within fields! Most astronomy and astrophysics journals use Harvard style for instance while the physics journals mostly stick with numbered styles. Both communities will passionately defend the styles they're used to (me included). This is a hill people are willing to die on haha",
          "author": "CosmonautCanary",
          "created": 1594123634,
          "upvotes": 13,
          "replies": {
            "fx79mfw": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx79mfw/",
              "text": "I'm with you in this fight. It makes much more sense to cite names. It makes you more familiar with the work in the field and if you see the same reference and have read the paper before, you can recall the arguments in that paper by yourself, thereby allowing one to critically analyse the paper if need be. It makes reading much more enjoyable. Contrast that to dull numbers and you need to scroll down everytime to see which papers are being referred to. All this just to save some space. Sigh.",
              "author": "etal_etal",
              "created": 1594127348,
              "upvotes": 7,
              "replies": {
                "fx8otf8": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8otf8/",
                  "text": "But you don't need to leave out the name? You could write something like \"X and Y developed this technique over a series of papers. [1][2][3]\" imo numbered citations have the benefit of making it much more compact and less tedious when you have to cite the same 2-3 authors dozens of times.",
                  "author": "dogdiarrhea",
                  "created": 1594153028,
                  "upvotes": 1,
                  "replies": {
                    "fx8pipe": {
                      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8pipe/",
                      "text": "There's just this particular advantage for numbered citations and that's it. It doesn't help the reader get familiar with the work of other authors in the field and it has the massive inconvenience of scrolling down everytime to see which papers were cited everytime you need to check some cited paper out. For example, I know of papers and about the work of other authors just by reading a paper that cites them. I can then remember the famous papers and look them up anytime to check something out or verify something.",
                      "author": "etal_etal",
                      "created": 1594153369,
                      "upvotes": 2,
                      "replies": {
                        "fx8py5l": {
                          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8py5l/",
                          "text": "But the context is provided in the text? Idk, I've never been confused about what the famous papers in the field are, they're thoroughly discussed. I do prefer the hybrid style of author initials+year, but I don't think not providing context is a flaw inherent to the citation style. That's on the author for not communicating the information.",
                          "author": "dogdiarrhea",
                          "created": 1594153580,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fx939oo": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx939oo/",
          "text": "As someone in linguistics I find APL and MLA style authoryear citations mess up reading flow, especially when multiple names are cited. Probably the initials-year style `[GO1984]` or just plain old numeric citation would just be better. Where names are relevant just mention them in text. Compare:\n\n> The ever-increasing complexity of G&B [1, 2] lead Chomsky and some of his followers to come up with the Minimalist Program [2, 5, 7]. In [3], Howard Lasnik provides a good overview of Chomskyan tradition from before Syntactic Structures (1957) [6] to the beginnings of this new 'not-a-theory' [1, 7].\n\nwith\n\n> The ever-increasing complexity of G&B (Totti 2005; Pirlo 2008) lead Chomsky and some of his followers to come up with the Minimalist Program (Pirlo 2008; Chomsky 1995; Maldini 1996). Howard Lasnik (2000) provides a good overview of Chomskyan tradition from before Syntactic Structures (Chomsky 1957) to the beginnings of this new 'not-a-theory' (Totti 2005; Maldini 1996).\n\nI'd much prefer the first example. (Most of the references are obviously made up, btw.)",
          "author": null,
          "created": 1594160160,
          "upvotes": 5,
          "replies": {
            "fxb8dci": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxb8dci/",
              "text": "It must just be personal preference and what you're used to. I find the first example significantly more disruptive to read.",
              "author": "PurrPrinThom",
              "created": 1594215639,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fx768ht": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx768ht/",
          "text": "If I want to address someone's argument, I can just say 'Johnson et al. [1]' even in the numbered style though.",
          "author": "n23_",
          "created": 1594125016,
          "upvotes": 4,
          "replies": {}
        },
        "fx77lp7": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx77lp7/",
          "text": "[deleted]",
          "author": null,
          "created": 1594125996,
          "upvotes": 5,
          "replies": {
            "fx7alsz": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7alsz/",
              "text": "> Otherwise, ask yourself what is the point (and limitations) of providing so many references.\n\nI've seen papers on vaccinations that have _hundreds_ of citations, precisely because they're heading off the idiots who see it as \"unscientific and corrupt\" by providing endless proof that no, everyone agrees that vaccines are good and not some kind of conspiracy plot. \n\nIt's a niche use, but there are times where you want stupidly large numbers of citations and don't have the ability to reference to other documents because it would draw your own document into question (from morons).",
              "author": "MoonlightsHand",
              "created": 1594127985,
              "upvotes": 9,
              "replies": {}
            },
            "fx7a8q8": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7a8q8/",
              "text": "Thanks for saying this. Author year style makes for better readability and should be the standard. The only thing in favour of numbering is that in some fields, the first author is just the person whose names is higher in the alphabetical order. In high energy physics for example, the main author can be nth author. A solution to this is just to let go of alphabetical ordering of authors and rank them contribution wise.",
              "author": "etal_etal",
              "created": 1594127749,
              "upvotes": 1,
              "replies": {
                "fx7cu7n": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7cu7n/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1594129360,
                  "upvotes": 2,
                  "replies": {
                    "fx7dsw1": {
                      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7dsw1/",
                      "text": "You can just as well say \n\nIt's perfectly fine to refer to, for instance, the important work by teams led by Newton, Leibniz, and Gauss at CERN (see e.g. Newton (2040), Planck et al. (2050), Leibniz (2028), Gauss & Reimann (2090)).\n\nIt just takes up more space. You don't have to explain all the references. This is the convention followed in most of astronomy and astrophysics and most astro papers will have a line or two in the intro and then a spitting out of references. The introduction is most just a lit review recap or so and lots of spitting out references. And it doesn't slow anyone one bit.",
                      "author": "etal_etal",
                      "created": 1594129923,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fx7xfnc": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7xfnc/",
          "text": "There are far more garbage guides on the internet for students to wrongly learn from than reliable guides. My advice: link [Purdue's Online Writing Lab's APA Style guide](https://owl.purdue.edu/owl/research_and_citation/apa_style/apa_style_introduction.html) on every writing assignment you give to students. It's got everything, and it stays updated.",
          "author": "zifmer",
          "created": 1594140096,
          "upvotes": 1,
          "replies": {}
        },
        "fx86wf6": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx86wf6/",
          "text": "I'm studying biomedical science and we have to do harvard referencing, yet any paper I've come across uses numbers. Which makes sense, because I literally have to write entire sentences made up of references.\nHowever, I use mendeley which makes citing extremely easy",
          "author": "idk7643",
          "created": 1594144572,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fx6spnx": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx6spnx/",
      "text": "Relevant XKCD: https://xkcd.com/927/",
      "author": "RA10201",
      "created": 1594112433,
      "upvotes": 57,
      "replies": {
        "fx7rdgl": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7rdgl/",
          "text": "The best reason to read the comments is to see the relevant XKCD.",
          "author": "kd4444",
          "created": 1594137129,
          "upvotes": 6,
          "replies": {
            "fx8k6v2": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8k6v2/",
              "text": "there is _always_ a relevant xkcd.",
              "author": "mechnight",
              "created": 1594150799,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "fx8t7tv": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8t7tv/",
          "text": "HAH!",
          "author": "rrerjhkawefhwk",
          "created": 1594155181,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fx7302m": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7302m/",
      "text": "If I thought people could behave themselves and not keep making their own versions of styles, I'd be delighted if we could settle on two styles: one numbered and one author-date. I think those both have their place. Sometimes author-date is very reader-friendly because it's easy to keep track of who the author is talking about, and at other times it's totally reader-hostile because the flow of reading is broken up by massive strings of names and dates.",
      "author": "EmileDorkheim",
      "created": 1594122497,
      "upvotes": 22,
      "replies": {
        "fx75xqq": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx75xqq/",
          "text": "All authors, or only first author?  Order of appearance for numbers or according to alphabetically sorted ref list?\n\nThere are reasons one might serve the purpose (that a reader could find the reference) better than another depending on what you are reading and the field.",
          "author": "PersephoneIsNotHome",
          "created": 1594124797,
          "upvotes": 7,
          "replies": {
            "fx872i4": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx872i4/",
              "text": "Usally it depends on how many authors. It's up to three written down. If it's more than 3 it's first author et.al.",
              "author": "idk7643",
              "created": 1594144650,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fx6z54g": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx6z54g/",
      "text": "Not really.  Honestly with reference managers I barely even think about citation style any more.",
      "author": "parrotlunaire",
      "created": 1594119024,
      "upvotes": 26,
      "replies": {}
    },
    "fx7jw5j": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7jw5j/",
      "text": "Depending on the level of the course I try not to be too strict on citation. As long as the name/author/date are in there somewhere I don’t really care. I’ve noticed that my students focus on little things like citations and waste time that could’ve been spent writing a better argument.",
      "author": "crimbuscarol",
      "created": 1594133304,
      "upvotes": 9,
      "replies": {
        "fx7lgei": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7lgei/",
          "text": "I should reiterate that this is not something I personally grade with significance. My typical approach to this is to take a few marks off of a score of 100 that I use in my grading rubric, and point the student towards citation sources. I suppose I ask the question after analyzing an almost universal confusion among students over the years, that I estimate is likely the cause of using several citation styles in different classes. The substance of the student's work is what is important here, not a perfect instance of citation.",
          "author": "International-Drive9",
          "created": 1594134123,
          "upvotes": 3,
          "replies": {
            "fx7q2bs": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7q2bs/",
              "text": "Agreed. There must be some profs out there who grade citation really strictly though because my students are always panicking about it. And they are shocked when I say I don’t really care",
              "author": "crimbuscarol",
              "created": 1594136481,
              "upvotes": 2,
              "replies": {
                "fx7qkx9": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7qkx9/",
                  "text": "There certainly are. I remember during my undergrad there was one prof I encountered who would dock marks for every instance of a citation error. There were actually instances of students receiving a failing grade for this. I found that almost offensively excessive. Especially for undergraduates who are just learning the ropes. He was certainly the most extreme example though, and I can only imagine he received numerous complaints over this. The vast majority of professors and TA's I have worked with place little value in citation style.",
                  "author": "International-Drive9",
                  "created": 1594136738,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "fx8qpi7": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8qpi7/",
          "text": "I don't care if every comma and period is right. I give feedback on that stuff sometimes, but it's only a tiny part of the grade on an assignment. I just want the source information to be there, and I want it to be right. Some formatting errors aren't a big deal.",
          "author": "kyclef",
          "created": 1594153954,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fx7oqle": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7oqle/",
      "text": "The answer is Chicago. 🤷🏼‍♀️",
      "author": "vivaldi1206",
      "created": 1594135811,
      "upvotes": 15,
      "replies": {
        "fx8cbrf": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8cbrf/",
          "text": "Archival, MS, and odd sources don't play very nice with MLA and other author-date systems. Chicago is the way. I had an article accepted and they insistently asked me to put all the references in MLA author-date as part of their new 'simpler' policy. So I did, while preserving the original--it ballooned the article massively. They quickly changed their tune and said \"OK, author-date for secondary sources, footnotes for archival ones.\" so I had to go back in and hybridize. So much work, if they'd only just listened to my reasoning for archival footnotes before...and they themselves used to do it that way! I think they had not thought the new policy through.",
          "author": "khosikulu",
          "created": 1594147127,
          "upvotes": 8,
          "replies": {
            "fx8dwha": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8dwha/",
              "text": "Totally! I work primarily in the medieval to Baroque period and music is also particularly hard to deal with. Music history and history are very overlapping of course ;)",
              "author": "vivaldi1206",
              "created": 1594147862,
              "upvotes": 3,
              "replies": {
                "fx8rsp5": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8rsp5/",
                  "text": "Like Art History, though, it's a very specialized set of methods and analytical discourses with sources that require very particular kinds of notation.  Chicago's good at that (and they often answer emails) so we use them, when we're not using Oxford, which is an approximation of the same in many ways anyhow.  The one annoyance I have for Chicago is with the abdication of legal referencing to the *Blue Book* and the reliance on precedent for other non-US, non-UK, non-Canadian (etc) government pubs.  I get the reasoning, but it's still annoying to have to make decisions for the histories I work on (which are adjacent to history of science and literary subjects) and then fight with editors as often as I do.   We could probably swap some gobsmacking horror stories from our respective corners.",
                  "author": "khosikulu",
                  "created": 1594154495,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "fx8f65p": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8f65p/",
          "text": "Yep. The answer is always footnotes.",
          "author": "SaintRidley",
          "created": 1594148442,
          "upvotes": 5,
          "replies": {}
        },
        "fx7oxy8": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7oxy8/",
          "text": "Thus, the stirring of the pot begins!",
          "author": "International-Drive9",
          "created": 1594135915,
          "upvotes": 2,
          "replies": {
            "fx7p6g6": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7p6g6/",
              "text": "Ha I mean I am biased. I went to Uchicago and my discipline only uses Chicago style.",
              "author": "vivaldi1206",
              "created": 1594136034,
              "upvotes": 4,
              "replies": {
                "fx7puoi": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7puoi/",
                  "text": "Unrelated, but it is always a pleasure to read and analyze the work published by UChicago academics in my field. I may hate the Blackhawks, but I certainly like that school.",
                  "author": "International-Drive9",
                  "created": 1594136373,
                  "upvotes": 5,
                  "replies": {
                    "fx7u33d": {
                      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7u33d/",
                      "text": "Happy to hear that :) it’a got a very special place in my heart. \nTo be fair, Uchicago is not a sporty place haha. Our motto is “where fun goes to die” for a reason ;) we’re all just earnest nerds.",
                      "author": "vivaldi1206",
                      "created": 1594138471,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fx79lgk": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx79lgk/",
      "text": "[deleted]",
      "author": null,
      "created": 1594127330,
      "upvotes": 6,
      "replies": {
        "fx79wj4": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx79wj4/",
          "text": "I won't lie, I could use a good street fight!",
          "author": "International-Drive9",
          "created": 1594127528,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fx76r33": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx76r33/",
      "text": "Different citation styles emphasize different information, which is important, as different information is important in different disciplines.  (for instance, some styles emphasize Authors, others the Year, others Publishers... depends on what's most important.)   So the differences can be useful. \n\nBut here's a different thought:\n\nit's a test.  And a VERY important one for students to master. \n\nThere are two reasons that students DON'T use the right style:  laziness, and lateness.   \n\nWaaaay back when, when I was in college, I hated trying to suss out and use the \"correct\" style, because I was always skating close to the deadline... and in those rare moments when I *wasn't*,  I still felt like it was a \"waste of (my important) time.\"   My students today have the same problem. \n\nBut here's the thing:  there are a LOT of incredibly important things in life that have to be done PRECISELY, in the correct format. \n\nNot just your 1040 Form 6251-AMT... but also any scholarship or grant application, most serious job applications, paperwork for your Residency Permit, etc. etc. \n\nIn high school, and in many college classes, students are cut a lot of slack.  (\"She's a smart kid;  this is a good paper;  yes, the citations are wrong, but the paper has great ideas--I'll still give it an A.\") \n\nBut then, a decade later, they find themselves applying for something really important--a major Federal grant, for example, or for naturalized citizenship.  And very suddenly, with the stakes incredibly high, formatting perfection is make-or-break:   if you make ONE mistake, and you're done.  \n\nStudents who have been cut a lot of slack can't make this adjustment. \n\nActually, I think one of the real determinants for whether a smart undergrad gets into a grad program or not is exactly this minutia--attention to detail.  (I say this as a former grad director, who's read a lot of application files.)\n\nSo, yes:  students don't \"get\" citation styles.  (and really--how important *is* the correct style, in the cosmic scheme of things...???)\n But if they are forced to do it anyway--forced to look up the appropriate style, interpret it, apply it perfectly--then this will prepare them for a whole range of really important application-processes.   But *only* if they are forced to do it, and held to it. \n\nOne underappreciated reason, I would argue, that students with college degrees do so much better, career-wise, is that some of the 'administrative bullshit' of college--applying correct citation styles, running afoul of add/drop dates, pleading your piteous case to a hard-nosed professor, dealing with a difficult roommate, finding someone to explain a problem-set you just don't *understand*--prepares you for the \"real world.\"  Prepares you for *life itself.*  In a way that high school never could. \n\nTLDR:  it's for their own good.",
      "author": "DerProfessor",
      "created": 1594125392,
      "upvotes": 16,
      "replies": {
        "fx77vxu": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx77vxu/",
          "text": "I have never thought about it from this perspective before, but you are quite right. That has me pondering this, over my morning coffee, in a very different way.",
          "author": "International-Drive9",
          "created": 1594126191,
          "upvotes": 5,
          "replies": {
            "fx7a892": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7a892/",
              "text": "Yes, this hit me about 5 years ago, when a close friend (who was also an academic) was applying for a Green Card (American permanent residency permit). \n\nShe said she'd never seen a more complicated form, requiring such a massive array of information...hundreds of pages of supporting documentation... and *everything* had to be perfect. ONE mistake, and the whole packet was summarily rejected.  (and you had to wait some time--a year, maybe?--before reapplying.)\n\n\"Thank god I have a PhD,\" she told me;  \"the dissertation was the perfect dry run for this.\"  \n\n(!!)\n\n...which then made me think about all of those recent immigrants to the United States, who did not have a college education, and are expected to navigate this byzantine system.   I can't fathom the pressure they must be under. \n\nanyway--college is good preparation for this kind of crap!",
              "author": "DerProfessor",
              "created": 1594127740,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "fx7h1qo": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7h1qo/",
          "text": "> it's a test. And a VERY important one for students to master.\n\nOf all the arguments against a universal citation style, I don't think this makes a lot of sense. Firstly, citing exists because it's an integral part of research, not to teach students life skills. Citation style should be chosen for clarity and usefulness, not as a teaching aid. There are many ways to encourage students to be precise that would not involve mildly inconveniencing the entire research establishment.\n\nSecondly, with the existence of Mendeley, Zotero and Overleaf, citing is trivial these days. I do not think I have ever had to manually write out references.",
          "author": "Chlorophilia",
          "created": 1594131780,
          "upvotes": 10,
          "replies": {
            "fx8cec3": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8cec3/",
              "text": ">  Citation style should be chosen for clarity and usefulness, not as a teaching aid. \n\nWhy not both? \n\n>There are many ways to encourage students to be precise that would not involve mildly inconveniencing the entire research establishment.\n\nReally?  like what?   (academics themselves cannot agree on which style would be \"best\"...  just like bureaucracies themselves can never agree on which system would be \"best\".  We're all part of the same, messy, human experiment.) \n\nOn another level:  citing is NOT trivial these days.  (!)\n\nFirst, I've used Endnotes for 15 years... but I have learned (the hard way) it's best to cut-and-paste formatted citations than to rely on these programs to autoformat, because autoformat inherently fuck things up.  \n\nSecondly, as a mentor/teacher of grad students:   you can see instantly whether the student-author has done a \"zotero-dump\" (i.e. just schlocked in a bunch of cites they just pulled from the web), or actually are mindfully citing significant, important sources.  I recognize that's not what you were suggesting... but I think it's important that grads realize that in many disciplines, the footnotes are at *least* as important as the text. (!)  Hand-formatting (i've found, in a successful publishing career) is actually a *good* thing, in that it forces you to focus on what you're actually putting in your footnotes... which people (experts) pay attention to. \n\n... which was my larger point. \n\nThere is no \"short cut\", no \"easy fix\" for the vast majority of detail-oriented work.  You can't script it, you can't farm it out.   Ultimately you just gotta *do* it.  Or not do it, and then not make progress in your career/life. \n\nTHAT's the important lesson, I think:\n\n There are, in the end, no shortcuts.  (this is an especially important lesson for Americans, I think, who have been nursed on stories of shortcuts to success--from Barnum to Zuckerberg--which are largely bullshit.) \n\nTo paraphrase Yoda:\n\n\"Do.  Or not Do.  There is no 'But The *Ideas* Were Good'.\"",
              "author": "DerProfessor",
              "created": 1594147161,
              "upvotes": 1,
              "replies": {
                "fx8mijw": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8mijw/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1594151903,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fx7nnnf": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7nnnf/",
          "text": "This is such a great way to look at it! The next time my students groan about having to learn MLA I will tell them this. :)",
          "author": "theoptimisticotter",
          "created": 1594135264,
          "upvotes": 3,
          "replies": {}
        },
        "fx7ynjf": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7ynjf/",
          "text": "I’d push back, too, against this dichotomy. Putting aside that some students are lazy or working last minute, many students don’t understand the “why” of citation and instead are taught to focus on the rules they have to learn. So they hear: learn MLA. Now learn something else. And repeat. On top of that, many students know or Intuit that they’ll rarely use those styles once they graduate.\n\nIf we want students to learn to use citation styles, we have to do more in our curricula than teach rules or reference pages in dense style books. Many faculty and TAs can take for granted that they’re already practiced readers and writers in a discipline, and we cannot expect that same degree of competence from writers new to a field who are frequently under-read in a discipline.\n\nTl;dr: if we want students to be more accurate and precise in their citations, we have to get them to value the reasons why we cite and show them how we and our colleagues do it.",
          "author": "dvjax",
          "created": 1594140693,
          "upvotes": 3,
          "replies": {
            "fx8ac0u": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8ac0u/",
              "text": "I'm *entirely* with you philosophically... and pedagogically. \n\n...but not practically. \n\nBecause I think that  (vis-a-vis the point I was trying to make about low-stakes versus high-stakes detail-work) there are no \"whys\" offered in the real world.  \n\n'Submit x by y date.  Or not.  and lose.\"  I've had to follow the most ridiculous instructions (that were complex and require real attention to detail) on a bewildering array of things... and never was it explained. \n\nBut I hear you, and I see the reason to teach meanings/importance instead of \"rules.\"  (I have sometimes--in my history classes--given a 30-minute lecture on the 2,000 year old history of the citation/footnote.  !  Fascinating stuff... and students have been riveted.)\n\nBut sometimes, it's not about explaining.. it's just about getting students used to the idea that they *have* to do it... or fail. \n\n(because that's just like life...)",
              "author": "DerProfessor",
              "created": 1594146184,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fx73btd": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx73btd/",
      "text": "Does anyone really care?  I'm amazed when I see someone finding out that some ref isn't formatted as they expect. What's the process that someone goes through to be able to notice?\n\nTo me it feels like like some purely aesthetic residual from another century. To find and download the ref I need a doi or a title exact enough to be googled.  Why do people actually care? Then it's up to Mendeley/latex to format everything like editors pretend to like.",
      "author": "lucaxx85",
      "created": 1594122760,
      "upvotes": 16,
      "replies": {
        "fx7asv6": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7asv6/",
          "text": "> Does anyone really care?\n\nI see you've never had a paper rejected because one (1) citation was incorrectly italicised.",
          "author": "MoonlightsHand",
          "created": 1594128106,
          "upvotes": 5,
          "replies": {
            "fx8ihd5": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8ihd5/",
              "text": "Do people really reject papers for that? In my experience, you'll get an email from the editor, and then you'll change it while you sulk on the idiocy of it all, and then the paper will be accepted.",
              "author": "fuckwatergivemewine",
              "created": 1594149995,
              "upvotes": 4,
              "replies": {
                "fx94yfo": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx94yfo/",
                  "text": "I don't know if people do, all I know is it happened one time. Usually, yeah, you just get told to change it by the editor. Can't tell you anything more than that, I'm not psychic. Maybe the editor found a worm in his sandwich or something.",
                  "author": "MoonlightsHand",
                  "created": 1594161039,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fx765ap": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx765ap/",
          "text": "Google something with a Beta or dash or special character in the title.\n\nFind something that is old, or not in English that way.\n\nFind primary sources that aren't in pubmed.\n\nSources dont have a \"best-by\" date.",
          "author": "PersephoneIsNotHome",
          "created": 1594124951,
          "upvotes": 2,
          "replies": {
            "fx76wwp": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx76wwp/",
              "text": "All these issues are solved by making sure that the ref contains all necessary entries for allowing retrieval of that specific non-standard document. Not by standardizing how many authors you write down before saying \"et al\" and so on.\n\nI cited a book once and I had the editor asking me to write out the town of the publisher... Fuck that, I had downloaded the pdf from the own author website and the cover page listed 10 cities (being the online version....). After asking on this very sub what on earth I was supposed to do... I picked one randomly.",
              "author": "lucaxx85",
              "created": 1594125509,
              "upvotes": 2,
              "replies": {
                "fx7hs6j": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7hs6j/",
                  "text": "Absolutely, because the citation recommendations were inconvenient and did not apply to you, there should be none.  And you shouldn't ever have students learn issues related to citations because, they do shitty job on assignments.  Totally makes sense",
                  "author": "PersephoneIsNotHome",
                  "created": 1594132180,
                  "upvotes": 1,
                  "replies": {
                    "fx7jctn": {
                      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7jctn/",
                      "text": "It depends on which recommendation you're talking about. Commas vs stops? Seriously? I can't even tell which is which unless I zoom in a lot. Number of authors before writing \"et al\"? Why would anyone count, honestly? Town of the editor? Where do I even find this information?\n\nJournal name abbreviation instead, that's important to be standardized. As the doi/page number etc... assuming the journal communicates them correctly..",
                      "author": "lucaxx85",
                      "created": 1594133021,
                      "upvotes": 3,
                      "replies": {
                        "fx7kwvv": {
                          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7kwvv/",
                          "text": "Because not all things are published digitally and by huge corporations.  So if I want to trace something by a small local publisher, I need the city and country of publication.\n\nIf you are only working with science/med stuff in the recent years, some of this is redundant.  If you ever do anything else, the citations matter.\n\nNumber of authors?  Why is the speed limit 50 and not 49 or 51?   Why is the cutoff for p 0.05 and not 0.04 ?  Because criteria need to exist, even if they are somewhat arbitrary.\n\n Because some papers have some many authors it would get unmanageable and will not help your find or credit that work.  What is the limit?  There is a guideline so that there is some consistency and some people don't cite 30 while other people use et al for 2.\n\nIf you are only dealing with journal articles most of this stuff is fairly automatic (or can be ) anyway so the point is moot.",
                          "author": "PersephoneIsNotHome",
                          "created": 1594133838,
                          "upvotes": 3,
                          "replies": {
                            "fx8isk7": {
                              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8isk7/",
                              "text": "Is it so local that google scholar can't find it? Like where did you publish it, your town's news paper?",
                              "author": "fuckwatergivemewine",
                              "created": 1594150142,
                              "upvotes": -1,
                              "replies": {
                                "fx97txt": {
                                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx97txt/",
                                  "text": "Off the top of my head I can think of a half dozen major journals in my field that just aren't digitized, to say nothing of monographs from fairly prestigious publishers.\n\nThat's just for stuff in English; material in other languages can be quite difficult to find on resources like Google Scholar.",
                                  "author": "truagh_mo_thuras",
                                  "created": 1594162584,
                                  "upvotes": 2,
                                  "replies": {
                                    "fxaeazi": {
                                      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxaeazi/",
                                      "text": "Point taken, sorry for being cocky! My experience in my field was so opposite to this that I couldn't even imagine journals not being digital.",
                                      "author": "fuckwatergivemewine",
                                      "created": 1594189828,
                                      "upvotes": 1,
                                      "replies": {
                                        "fxamshv": {
                                          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxamshv/",
                                          "text": "I definitely envy you, it's been really frustrating trying to do research now.",
                                          "author": "truagh_mo_thuras",
                                          "created": 1594197965,
                                          "upvotes": 3,
                                          "replies": {
                                            "fxasf4c": {
                                              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxasf4c/",
                                              "text": "Yeah I feel you, how does one go about getting hands on a paper there? Like if your university doesn't have a subscription, do you call and ask for the paper to be mailed?",
                                              "author": "fuckwatergivemewine",
                                              "created": 1594203614,
                                              "upvotes": 1,
                                              "replies": {
                                                "fxb8lyk": {
                                                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxb8lyk/",
                                                  "text": "You use another library's system, or you reach out to your professional contacts and ask if they can scan it for you, mainly.\n\nIf the author is still alive you can email and ask them directly, but not everyone is willing to share that way.",
                                                  "author": "PurrPrinThom",
                                                  "created": 1594215777,
                                                  "upvotes": 2,
                                                  "replies": {
                                                    "fxbcwbo": {
                                                      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxbcwbo/",
                                                      "text": "Existence is pain :/",
                                                      "author": "fuckwatergivemewine",
                                                      "created": 1594218155,
                                                      "upvotes": 1,
                                                      "replies": {}
                                                    }
                                                  }
                                                },
                                                "fxc5ki6": {
                                                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxc5ki6/",
                                                  "text": "A lot of senior academics in my field have physical subscriptions to all the major journals that are relevant to their work.\n\nOtherwise, as PurrPrinThom says, you try another library, or hope you know someone with physical access or a scanned version of the article.",
                                                  "author": "truagh_mo_thuras",
                                                  "created": 1594231908,
                                                  "upvotes": 2,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fx75gqn": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx75gqn/",
      "text": "oh yeah, 100% - but it would have to be my citation style because at this point I'm not investing in learning anyone else's.",
      "author": "thegreenaquarium",
      "created": 1594124445,
      "upvotes": 6,
      "replies": {}
    },
    "fx7fyl4": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7fyl4/",
      "text": "In computer science, we have a rather lax view on citation styles. I think that's good so, because I don't want to have anything to do with the anal pedantry of strictly following citation style guidelines. In my view, such issues detract from the actually important issues of doing proper science.",
      "author": "ColourlessGreenIdeas",
      "created": 1594131167,
      "upvotes": 6,
      "replies": {
        "fx7g6ai": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7g6ai/",
          "text": "I find STEM disciplines tend to be far less critical of these sorts of things. Which is a good thing for simplicity's sake.",
          "author": "International-Drive9",
          "created": 1594131288,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fx8d3p2": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8d3p2/",
      "text": "All I need is a doi, baby.",
      "author": "johnnydaggers",
      "created": 1594147491,
      "upvotes": 3,
      "replies": {}
    },
    "fx72ndj": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx72ndj/",
      "text": "I think things like Mendeley and Zotero make it manageable for one-off assignments. \n\nWhat I hate is when a journal article gets rejected and you need to convert it to another citation style. If you made some changes after removing Mendeley fields, it sucks to either go back to an old version or fix citations manually. \n\nThis happened twice and I don't seem to learn my lesson.",
      "author": "sollinatri",
      "created": 1594122204,
      "upvotes": 5,
      "replies": {
        "fx74gbw": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx74gbw/",
          "text": "Use endnote. You can change journal citation style in the whole paper with the click of a button.",
          "author": "ourannual",
          "created": 1594123667,
          "upvotes": 3,
          "replies": {
            "fx758z3": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx758z3/",
              "text": "Mendeley etc does that too. My mistake is, I add footnotes via mendeley but then remove the mendeley fields and turn it into a plain Word doc right before submitting an article to a journal (\"export without mendeley fields\") \nThen I make so many revisions on the plain Word doc version and later remember Mendeley won't recognize these footnotes anymore to change their style automatically. So then I lose time.",
              "author": "sollinatri",
              "created": 1594124280,
              "upvotes": 6,
              "replies": {}
            },
            "fx74opp": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx74opp/",
              "text": "I've shown students this, and some still don't really seem to get it. Given how easy it is these days to automate this system, I'm amazed at how many people don't.",
              "author": "International-Drive9",
              "created": 1594123850,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fx8at5v": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8at5v/",
      "text": "I dealt with this as a TA myself (history, so Chicago).  What I've come to realize about it is, we're invested in it because we're striving to make a place in our respective fields.  We care about the subject and want it to be right.  However, most college students just couldn't care less.  They're never going to have to put something into proper citation format again, and it's the equivalent of high school students complaining about why they have to learn matrices in algebra.  In other words, I learned to just stop caring if they got it.  I know I've got it right for me, I'll grade them accordingly because that's part of the class, but I'll only care if they learn it if they show they want to.  Otherwise, let them go be accountants or middle managers, and hopefully you've at least imparted the more important knowledge of the subject and its relevance to them.",
      "author": "jryu611",
      "created": 1594146409,
      "upvotes": 2,
      "replies": {}
    },
    "fx8gnw2": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8gnw2/",
      "text": "Yes. IEEE",
      "author": "pmabz",
      "created": 1594149133,
      "upvotes": 2,
      "replies": {
        "fx9afas": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9afas/",
          "text": "A supervisor I worked with \"corrected\" my paper saying \"it's not clear, please put the author's name next to this number\".",
          "author": "runnersgo",
          "created": 1594163979,
          "upvotes": 2,
          "replies": {
            "fxaq8ed": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxaq8ed/",
              "text": "I was trawling for a catch. But now I realise that you and she are right - author's name is actually more informative than number. Now you've thrown me!\n\n&#x200B;\n\nEdited - assumed supervisor was a male",
              "author": "pmabz",
              "created": 1594201421,
              "upvotes": 1,
              "replies": {
                "fxdj9ka": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxdj9ka/",
                  "text": "Nope, female.",
                  "author": "runnersgo",
                  "created": 1594256956,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fx7bpa3": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7bpa3/",
      "text": "Why are y'all so frustrated about citation? Use Bibtex (and Latex) for god sake... a switch of citation is just a switch of \\bibliographystyle{x}\n\n\\LaTeX should not be confined in the natural science community. For e.g., I see business field people struggling with their propriety thesis.docx and I cringed so hard.",
      "author": "advanced-DnD",
      "created": 1594128664,
      "upvotes": 3,
      "replies": {}
    },
    "fx7f1ot": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7f1ot/",
      "text": "I use APA. There are so many resources available for free, including the huge worksheet drop APA itself did on Twitter earlier, that I don't really get how people screw it up. Once you've familiarized yourself with the template and written one correctly formatted paper you can just copy and paste things in. Seventh edition is even less complicated, too.",
      "author": null,
      "created": 1594130644,
      "upvotes": 1,
      "replies": {}
    },
    "fx7h6jy": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7h6jy/",
      "text": "YES. 1000 times YES.",
      "author": null,
      "created": 1594131853,
      "upvotes": 1,
      "replies": {}
    },
    "fx7k15a": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7k15a/",
      "text": "YES. The school where I did my undergrad used a completely different citation style than my grad school, even though I'm studying the exact same thing. It's the same field. The classes are almost identical. The universities are only 2 hours away from each other, in the same province. Its mind-boggling. I used a clear and easy citation style for 5 years, then all of a sudden I had to switch to a totally different one.",
      "author": "aafreeda",
      "created": 1594133377,
      "upvotes": 1,
      "replies": {}
    },
    "fx7o88d": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7o88d/",
      "text": "Honestly that the least of my problem, especially because there are very good technological solutions.",
      "author": "Elendol",
      "created": 1594135554,
      "upvotes": 1,
      "replies": {}
    },
    "fx7rmui": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7rmui/",
      "text": "Without a doubt. In my country, every uni and each faculty basically uses different citation style and it even changes from year to year. At the end of the day we all just argue in a group chat about the right way to reference publications.",
      "author": "Lady_of_Ironrath",
      "created": 1594137256,
      "upvotes": 1,
      "replies": {}
    },
    "fx81cmy": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx81cmy/",
      "text": "[Deleted]",
      "author": null,
      "created": 1594141983,
      "upvotes": 1,
      "replies": {}
    },
    "fx87in1": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx87in1/",
      "text": "YES I've been thinking this for years! I really don't see the point, even between fields, of having different formats. It's a complete waste of time for everyone.",
      "author": "yourmomdotbiz",
      "created": 1594144861,
      "upvotes": 1,
      "replies": {}
    },
    "fx8c7zb": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8c7zb/",
      "text": "Thanks for the thoughtful response. I agree there’s a bit of gap between the philosophical and the practical—a tenuous divide that every institution has to find its own way to skirt. And for what it’s worth, that lecture does sound fascinating.",
      "author": "dvjax",
      "created": 1594147078,
      "upvotes": 1,
      "replies": {}
    },
    "fx8hwtc": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8hwtc/",
      "text": "Why would it matter, use bibtex and let it format shit for you!",
      "author": "fuckwatergivemewine",
      "created": 1594149724,
      "upvotes": 1,
      "replies": {}
    },
    "fx8o60z": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8o60z/",
      "text": "No, I use zotero to format it for me, and students still wouldn't cite things. FWIW I accept any citation format from students, they just don't do it.",
      "author": "ph0rk",
      "created": 1594152708,
      "upvotes": 1,
      "replies": {}
    },
    "fx8up0f": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8up0f/",
      "text": "In scientific journals each journal has their own style. It’s a bit of a pain. With students I usually tell them MLA or APA bc they have used it for other classes. Honestly I don’t know either of those styles. As long as they have some reasonable citation with the usual details like author and date then I don’t take off points.",
      "author": "Maddprofessor",
      "created": 1594155896,
      "upvotes": 1,
      "replies": {}
    },
    "fx9dx5j": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9dx5j/",
      "text": "In my Department (engineering), we push either IEEE or APA. In the end, we leave it up to instructors (\"academic freedom\" and all that). But that doesn't stop students from finding fascinating ways to mess it up.\n\nMy personal favourite is the bibtex \"alpha\" style cuz it helps me remember which paper the citation is, but doesn't take up as much line-space and doesn't break the flow of reading as the full name formats do.\n\nBTW, does anyone know what the bibtex \"alpha\" format actually is called? I can't seem to find it formally described/specified anywhere.",
      "author": "salustri",
      "created": 1594165903,
      "upvotes": 1,
      "replies": {
        "fx9e39m": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9e39m/",
          "text": "> But that doesn't stop students from finding fascinating ways to mess it up.\n\nI have certainly seen some very interesting examples of APA, Chicago and MLA citation styles.",
          "author": "International-Drive9",
          "created": 1594165997,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fx9kshg": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9kshg/",
      "text": "[deleted]",
      "author": null,
      "created": 1594169880,
      "upvotes": 1,
      "replies": {
        "fx9q6sl": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9q6sl/",
          "text": "Life was never meant to be easy.",
          "author": "International-Drive9",
          "created": 1594173090,
          "upvotes": 1,
          "replies": {
            "fx9qatp": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9qatp/",
              "text": "It is though. Mine is 🤷🏻‍♀️",
              "author": "niksirree",
              "created": 1594173156,
              "upvotes": 1,
              "replies": {
                "fx9qmy6": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9qmy6/",
                  "text": "By all means, share the secret!",
                  "author": "International-Drive9",
                  "created": 1594173355,
                  "upvotes": 2,
                  "replies": {
                    "fxgszm2": {
                      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxgszm2/",
                      "text": "Just live. Be happy, and enjoy what you have. Life will give you what you need in abundance if you expect nothing/don't try. You dont need to keep 'achieving academically' to 'eventually be happy/achieve the dream you want' because you are already living the dream. You already have enough. 😊 look up imposter syndrome",
                      "author": "niksirree",
                      "created": 1594330543,
                      "upvotes": 1,
                      "replies": {
                        "fxgtgzg": {
                          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fxgtgzg/",
                          "text": "I very much agree! I try my best, although at times it is hard. I find happiness to be fleeting, but contentedness a far more important goal. I appreciate the words kind person!",
                          "author": "International-Drive9",
                          "created": 1594330784,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fx9rszl": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx9rszl/",
      "text": "This could be totally remedied by using Latex or a Word processor that could take a .bib document, and then no one ever has a reason to care, ever.",
      "author": "ZombieRickyB",
      "created": 1594174052,
      "upvotes": 1,
      "replies": {}
    },
    "fx730wz": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx730wz/",
      "text": "So, so much! \n\nAnd not even for ourselves. I teach at a sixth form as well and seventeen year olds can't seem to cope with multiple citation styles.",
      "author": "pennylaine713",
      "created": 1594122516,
      "upvotes": 1,
      "replies": {}
    },
    "fx75qhf": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx75qhf/",
      "text": "If we changed sensible things because students didn't do them and couldn't follow directions we would have no more sensible things.\n\nOne thing I do that helps my classes (I hope) see the value of this, is to actually find a citation that their classmates have used.\n\nThe point of citations is not only correct attribution to give credit, but also to fact check and evaluate the source.  Different styles sort of cater to different fields with different typical needs.",
      "author": "PersephoneIsNotHome",
      "created": 1594124647,
      "upvotes": 1,
      "replies": {}
    },
    "fx7pb8v": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7pb8v/",
      "text": "Can’t believe no one has posted the [relevant XKCD](https://xkcd.com/927/). Each time a group attempts to do this without the authority to force a HUGE swath of the community to adopt their standard, it further complicates the problem.\n\nEdit: someone did post it. Oops.",
      "author": "shaja2431",
      "created": 1594136101,
      "upvotes": 1,
      "replies": {}
    },
    "fx74w9c": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx74w9c/",
      "text": "I've never once had a journal, prof., ethics committee or grant agency complain about such trivial details as citation style. I'd never really judge students for having it wrong either as long as I can tell which article they are citing for what statement.\n\nIt's a non-issue IMO, who cares",
      "author": "n23_",
      "created": 1594124010,
      "upvotes": 0,
      "replies": {
        "fx76810": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx76810/",
          "text": "Grant agencies usually don't care, but journals in my field absolutely have their own style and won't be accepted if not in that journal style",
          "author": "PersephoneIsNotHome",
          "created": 1594125005,
          "upvotes": 5,
          "replies": {}
        },
        "fx7oykf": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx7oykf/",
          "text": "In my grad school bibliography class I was given a B on a project because I had two spaces after the period...which is how I was taught to type and it’s really hard to change how you touch type after decades. It’s absurd.",
          "author": "vivaldi1206",
          "created": 1594135924,
          "upvotes": 2,
          "replies": {}
        },
        "fx75ebh": {
          "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx75ebh/",
          "text": "Conversely, If it is a non issue, then why not just standardize it across similar disciplines? Instead of having MLA, APA, Chicago, etc. ?",
          "author": "International-Drive9",
          "created": 1594124394,
          "upvotes": 1,
          "replies": {
            "fx763fu": {
              "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx763fu/",
              "text": "sorry if I'm unclear, I don't think your idea of just using the same style everywhere is wrong, I'd support that. I just think anyone who makes a big deal out of someone using style A instead of B is being somewhat of an idiot.",
              "author": "n23_",
              "created": 1594124912,
              "upvotes": 1,
              "replies": {
                "fx76tt8": {
                  "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx76tt8/",
                  "text": "I certainly cannot disagree that it is a rather mundane attribute of most papers. I can only speak anecdotally, but when I grade, if the citation style if wrong, I dock a few marks out of 100 and point them towards a source to help. I know some professors who make a big deal out of it. Personally I have observed they tend towards disciplines in the Liberal Arts - again, just my personal observation.",
                  "author": "International-Drive9",
                  "created": 1594125448,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fx8pik9": {
      "link": "/r/AskAcademia/comments/hmq57i/do_you_think_that_life_would_be_easier_if_there/fx8pik9/",
      "text": "There already is a citation style to rule them all. It's called the hyperlink.",
      "author": "MrFordization",
      "created": 1594153367,
      "upvotes": -1,
      "replies": {}
    }
  }
}