{
  "sid": "kk0jou",
  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/",
  "title:": "Professors who agree to write letters of recommendation and then don't, why do you do so?",
  "text": "Applied to 10 schools for a PhD (15 Dec deadline) and asked a professor for a letter of recommendation at the end of September. This was a prof who's class I had taken, who's same class I had TAd, and whose lab I had done research in for a year, including full time over the summer where they paid me. They said they'd be \"glad\" to write me one, and asked for a draft (was this a red flag?).\n\nI sent them email reminders at one month before the deadline, two weeks, one week, one day before. And no response. Did everything according to other posts  here, including thanking them in each email for agreeing to write the letter. Maybe my emails suddenly stopped going through? But after sending reminders from the universities portals, I even texted them on their personal phone a couple days before the deadline when the grad students in the lab suggested I do so. No response. Maybe they became too busy or realized they didn't want to write me a letter for whatever reason? But I asked them after the deadline if they were too busy, I could ask someone else? No response till now, 10 days after the deadline. Maybe they had a personal emergency/accident? All this was while they were in contact with their grad students about their upcoming paper.\n\nProfessors who may have done something similar, why would you do so? I really just want to understand. Because to me, agreeing to take on a responsibility and then flaking out completely is horrible professional behavior. And since universities discard applications without 3 letters, messing with someone's career like this should be grounds for termination in my opinion. I understand departments accept late letters, but I've had no contact for the last 45 days and there's no reason to believe they're ever going to submit that letter.\n\nAdditionally, is there something I should have done differently here? I'm presumably going to have to ask for letters again at some point, and I'd like to know how to do it properly.\n\nIn this particular case, I was fortunate enough to have another prof who could write me a letter, and they did so after the deadline with only 48 hours of notice. My other letters have come from professors who not only submitted on time, but helped me immensely with the application process. So this is not meant to criticize professors as a whole.\n\n\nEdit: sorry for not being clear, I gave them the draft letter over a month before the deadline. In spite of some of my applications explicitly stating that students are not allowed to contribute to writing their own letter in any way, including a draft letter.\n\nEdit2: Thank you for all the responses. I think I better understand what might have been going through my professor's mind and the stress they might be under. Still upset, but lesson learned. I'll make sure to include an extra letter in the future. Merry Christmas y'all!",
  "author": "lstimrdj",
  "created": 1608909413,
  "updated": 1634080368,
  "over_18": false,
  "upvotes": 277,
  "upvote_ratio": 0.96,
  "comments": {
    "ggzt8dn": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzt8dn/",
      "text": "I think it's close to professorial \"malpractice\" for the reasons you state. While I've never done this myself, I've experienced it in many forms (for example, late/never referee reports, or a coauthor flaking out), and have a bit of sense from the other side.\n\nWhile there is no one answer, my best universal reason is that a faculty member is first overwhelmed, and then embarrassed to the point of denial. The task requires a bit of effort, and doesn't come naturally to them. They put it off, as there are more pressing issues, or maybe even something very serious that came up. They see your emails, but are ashamed, and do a kind of \"curling up into a ball\" (no response at least gives plausible deniability).",
      "author": null,
      "created": 1608911579,
      "upvotes": 276,
      "replies": {
        "ggzun3t": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzun3t/",
          "text": "Thank you for that insight, this makes a lot of sense to me. If this is the case, I just wish they would have let me know at any point and I could have simply asked someone else.",
          "author": "lstimrdj",
          "created": 1608912588,
          "upvotes": 55,
          "replies": {
            "gh0tuc1": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0tuc1/",
              "text": "For what it's worth, grad programs know that profs are notoriously last-minute, so often the unofficial deadline for reference letters is not the same as the application deadline. Usually all that matters is that they get there before the program goes to review your application.",
              "author": "VortexLine",
              "created": 1608935093,
              "upvotes": 18,
              "replies": {}
            },
            "ggzv3uq": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzv3uq/",
              "text": "You won't get any disagreement from me. Also, it's not that common. I would guess they just figure you'll \"get the idea\" after a while and give up (as there is probably some alternate you can use).",
              "author": null,
              "created": 1608912922,
              "upvotes": 34,
              "replies": {}
            }
          }
        },
        "ggzxb4b": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzxb4b/",
          "text": "I would also assume the professor was overwhelmed. Going forward in this climate, if they ask for two letters get 3.",
          "author": "CaptainObvious1313",
          "created": 1608914479,
          "upvotes": 33,
          "replies": {
            "gh0zsdl": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0zsdl/",
              "text": "[deleted]",
              "author": null,
              "created": 1608938974,
              "upvotes": -9,
              "replies": {
                "gh14giq": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh14giq/",
                  "text": "I said as a DIFFERENT professor as a back up. That's just good planning. I find it frustrating to write a ton of last minute recs, but if I know the kid, I do. \nThat being said, professors sometimes drop the ball as well. Let's not pretend that doesn't happen, ok?\nTelling a young adult to have a back up is good advice, regardless or your or my workload. We can also say no. That's something I've done also.",
                  "author": "CaptainObvious1313",
                  "created": 1608942046,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "gh043lb": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh043lb/",
          "text": "Rather than judging the overworked faculty, just write the letter and ask them to sign it. I’ve done this for 3 Masters and a PhD and none have ever objected when I offered to write my own letter. Most were thrilled by my offer. I got the idea when one professor told me, you write it, I’ll sign it. I always send a draft to them so that they can print out on university department letterhead.",
          "author": "Merlinostregone",
          "created": 1608919029,
          "upvotes": 20,
          "replies": {
            "gh0xxdl": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0xxdl/",
              "text": "FYI I think (as do others) that this is weird and shouldn't have to be done, but in these circumstances I think it's definitely not a bad idea and solves the problem.",
              "author": "imhereforthevotes",
              "created": 1608937762,
              "upvotes": 23,
              "replies": {
                "gh19a22": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh19a22/",
                  "text": "In Europe it’s very common, people are too busy, and FFS, why ask for three letters? Also, programs and employers should rely on their own methods of assessing candidates rather than shifting the task to people who have nothing to do with it.",
                  "author": "Anteros94500",
                  "created": 1608945235,
                  "upvotes": 15,
                  "replies": {}
                },
                "gh19lhy": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh19lhy/",
                  "text": "Yep. I've had a few professors who quite literally, on their website or else in their syllabus or somewhere easily found, they had a \"recommendation letter request form and questionnaire\" which basically asks for the things you've accomplished, anything that stands out about you, why you think you matter, why (insert why you need recommendation letter here) is important to you, how long you've known the professor, when the first class you had with them was, all sorts of things. I believe it was something one of the faculty members in the department came up with, and others in that department saw it and made a few changes and adopted it themselves, as they all looked iterative.\n\nI'm not sure, honestly, which is better, a letter you wrote wholesale and they signed (hopefully at least after reading, perhaps adding a few changes), or a letter where they basically asked for your answers to questions and they filled in a sort of form letter Mad Libs style. I realize that *most* professors barely know the majority of their students, and can't, off the top of their head, write a good letter for them, but the absolute best letters you can get are from professors (or mentors) that *do* know you well enough to do that for you, for instance, if you worked in a lab for a professor for several years, perhaps you've been to their home, you know their spouse and kids, they know who you are, why you're worth spending time on, what's good for you and what isn't, they know your writing style, your strengths and weaknesses, that kind of thing. That's rare, but if you can get *one* of those while in undergrad, I would hope that it's worth several random form letters.",
                  "author": "htbdt",
                  "created": 1608945459,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            },
            "gh1uks1": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh1uks1/",
              "text": "> just write the letter and ask them to sign it\n\nDoesn't help when they say \"write up the letter and send me the submission link\" and then they forget to submit it and don't respond to follow up emails.",
              "author": "alexa-488",
              "created": 1608961066,
              "upvotes": 2,
              "replies": {
                "gh2h0qf": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh2h0qf/",
                  "text": "You’re right. In fact, professors get old, sick die and move away, too, especially once they retire. My solution is to have an ever-expanding network of past professors and colleagues who are willing to sign letters as needed. 20 years into my teaching career and schools still ask me for references from people who are retired or dead. My only option is to ask folks for signed, undated letters with their permission to tweak and use as needed.",
                  "author": "Merlinostregone",
                  "created": 1608987091,
                  "upvotes": -1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ggzv5gv": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzv5gv/",
      "text": "Yes, this really sucks. There is no reason they shouldn’t have written it. If you’re asking for why - remember this is very very very important to you and not-at-all-important to them. And this happens more commonly than you’d think. Again - this totally sucks and they should have written it. You did everything you could’ve.",
      "author": "clemson_throwaway2",
      "created": 1608912955,
      "upvotes": 49,
      "replies": {}
    },
    "gh07d92": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh07d92/",
      "text": "I had a supervisor agree to write one but she didn't send it in by the deadline despite numerous attempts to contact her. Apparently she a had a stroke and never returned to work D:",
      "author": "Onion-Fart",
      "created": 1608921195,
      "upvotes": 25,
      "replies": {
        "gh09mx7": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh09mx7/",
          "text": "Oh wow that's really unfortunate. I honestly thought something similar might have happened in my case until the one of the grad students mentioned they were in contact with the prof just last weekend.",
          "author": "lstimrdj",
          "created": 1608922690,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ggzw8e8": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzw8e8/",
      "text": "I'm sorry this happened to you. My guess is that the person had every intention of doing it, forgot, and then was embarrassed. There is really no excuse.\n\nI have had really bad experiences with letters of recommendation, too. Once I was in nearly the same situation as you, except the writer finally did submit about an hour before the deadline. \n\nAnother time, the letter writer asked me for a draft, so I wrote the basic facts: \"I am a Professor of X at University Y. Zinfandelightful was my student, and we worked together on A, B, and C.\" I thought she would fill it in with, you know, some kind of praise? But she just put my words on her letterhead and signed it. It read like she had intentionally been damning with faint praise. I was mortified and had to get someone else to write one at the last minute.\n\nI learned my lesson. From then on, whenever I was asked to \"draft\" a letter about myself, I became one of the most outstanding young scientists this person had encountered in their career. For a career development award, I needed TEN separate letters. I had to \"draft\" nine of them myself. Again, all of the \"writers\" stuck my words on their letterhead and made almost no adjustments.\n\nSo now that I am in a mentoring role, I take letter writing very seriously -- maybe too seriously. If I have a student working in my lab who I can't write a good letter for (after multiple attempts at feedback and coaching), I let them know so they can move on.\n\nAll of that is to say, the situation you are describing is incredibly disrespectful and unfair, but not altogether uncommon. Being \"too busy\" is no excuse to sink someone else's career -- I guarantee those same people are not \"too busy\" to advance their own career. I am sorry this happened to you and wish you lots of luck on your applications. May you remember this vividly and always be the helpful letter writer when you have your own lab!",
      "author": "zinfandelightful",
      "created": 1608913723,
      "upvotes": 90,
      "replies": {
        "gh06bva": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh06bva/",
          "text": "Thank you for everything you're doing! I'm sure your students appreciate it. You bet I'm going to remember this if I ever have to write a letter myself.",
          "author": "lstimrdj",
          "created": 1608920503,
          "upvotes": 15,
          "replies": {}
        },
        "gjxy7l3": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gjxy7l3/",
          "text": "Ten letters! This is why academia so regularly pisses me off. It is never enough. You earned a Master’s degree? Well what organizations did you chair? What did you publish? What research did you do? What grants did you receive? Why is the work of completing the advanced degree with excellent grades not enough of an accomplishment? You must cultivate at least one mentoring relationship, be involved in student organizations, depending on your field contribute to original research, maintain a web presence, network constantly, apply for and receive grants and scholarships, or fellowships. If you want a career in academics you must go through an interview process that is grueling and puts you under a microscope, literally lasting two full work days. Make sure you have letters of recommendation from professors, and you best have done an internship or worked in a lab, in the department, or somehow contributed in/ worked (unpaid or not) in your field before graduation or you are a slouch.",
          "author": "tropical_librarian",
          "created": 1611150018,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh04wgz": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh04wgz/",
      "text": "I had a prof say they would write me a letter of rec mid November. They still haven't submitted for my December 15th apps yet. I'm frustrated as hell.",
      "author": "Task876",
      "created": 1608919561,
      "upvotes": 13,
      "replies": {
        "gh09h15": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh09h15/",
          "text": "Good luck to you dude. Though maybe you should consider asking someone else as a backup? Either way, hope everything works out.",
          "author": "lstimrdj",
          "created": 1608922584,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh0ime0": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0ime0/",
      "text": "I don’t completely buy the overwhelm excuse above\n\nLike, yes, the professor is probably overwhelmed. But OP already mentioned this in the email so the professor can just say they unfortunately are not able to do this now and let OP find another professor. \n\nYou know, making a broken promise is way worse than unwilling to do something \n\nBut, yep, some thing similar happen to my classmates. Most professors are nice and supportive but there are always bad apples — a few of them have awful personality\n\nMy suggestion is always having a plan B. You’d better prepare 4 letter providers if 3 is required, and so on\n\nEdit: also, no matter how busy is this professor, OP’s experience is kinda sad. OP did the research for 6 months and TAed in the class, but ended up no letter. I can understand the professor regretted to provide a letter for some students but consider how close the relationship here, it’s just not the same case. I know lots of professors can provide letters for the students who just attended one of their classes (aka DWIC - do well in class)",
      "author": "academic_and_job",
      "created": 1608928131,
      "upvotes": 13,
      "replies": {}
    },
    "ggzs557": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzs557/",
      "text": "Did you ever write th draft of the letter?",
      "author": "perceptionactionprof",
      "created": 1608910779,
      "upvotes": 30,
      "replies": {
        "ggzu60m": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzu60m/",
          "text": "Yes I did, sorry for not clarifying (edit)",
          "author": "lstimrdj",
          "created": 1608912248,
          "upvotes": 13,
          "replies": {}
        },
        "ggzsh38": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzsh38/",
          "text": "[deleted]",
          "author": null,
          "created": 1608911023,
          "upvotes": 36,
          "replies": {
            "gh01h5p": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh01h5p/",
              "text": "Some universities ask applicants to sign and certify that the applicant did not participate in the writing of the letter in any way. Waiving right to review is a different thing.",
              "author": "Kingarvan",
              "created": 1608917285,
              "upvotes": 17,
              "replies": {
                "gh02cmw": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh02cmw/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1608917861,
                  "upvotes": 5,
                  "replies": {
                    "gh072kv": {
                      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh072kv/",
                      "text": "If your field is math, I'm decently confident some of your students would have to sign that same statement when they're applying, as my field falls in the same department at a lot of places. And the universities I'm mentioning here even includes top US universities (I think Caltech made me sign one of those). \n\nA word of advice, feel free to ignore me if you think I'm not qualified to speak on this: These statements are only visible to students during their application and aren't typically seen on the department website. I would suggest asking your students in the future if their applications have that requirement because I would reckon some of them may have had to sign such statements in the past.",
                      "author": "lstimrdj",
                      "created": 1608920999,
                      "upvotes": 9,
                      "replies": {}
                    },
                    "gh09lxt": {
                      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh09lxt/",
                      "text": "This is really field dependent. I know in mine some people do drafts but others will consider that unethical.",
                      "author": "Andromeda321",
                      "created": 1608922673,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "gh0yobr": {
                      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0yobr/",
                      "text": "I know this first hand. Several universities require applicants to check a box and sign their name attesting that they did not participate in the writing of the letter.",
                      "author": "Kingarvan",
                      "created": 1608938253,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "ghos1db": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ghos1db/",
                  "text": "That's interesting, I've been having an argument on Reddit chat with a colleague in a different department who is a lecturer with a MS degree that teaches one of the lab classes claiming that there is nothing unethical about his practice of having students write a draft letter, and him signing it if he agrees with what is said in it.\n\nI'm of the opinion that such a practice is professional misconduct and unethical, if only because students simply lack the experience and context to write a strong and compelling recommendation letter for graduate school.",
                  "author": "mleok",
                  "created": 1609489354,
                  "upvotes": 1,
                  "replies": {
                    "ghqp7fl": {
                      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ghqp7fl/",
                      "text": "There are points in favor of both sides. I think the judgment matters on the context. If the letter writer cannot accurately recall a certain student, especially if they were an undergrad in a large class, then a summary draft of the student description could assist the writer. Then the writer could jot together points and provide a narrative.\n\nOTOH, if the draft is simply a formality and the letter writer forwards the draft wholesale without significant changes, then that could constitute a letter that was not really written by the intended writer. Again, opinions could vary. I see the reasons why certain schools might have students certify that they didn't assist in the writing process. Perhaps they have seen many malafide cases.",
                      "author": "Kingarvan",
                      "created": 1609525177,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ggzudn5": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzudn5/",
              "text": "Yes, I’d sent the draft letter over a month before the deadline. \n\nSeems to me like a double standard to have to write the draft letter, given that some universities explicitly state that writing a draft letter is not permitted, and doing so is grounds for them to rescind their offer (don’t think this is a field dependent thing as my field is very close to yours)",
              "author": "lstimrdj",
              "created": 1608912398,
              "upvotes": 37,
              "replies": {
                "ggzvjzp": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzvjzp/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1608913244,
                  "upvotes": 28,
                  "replies": {
                    "gh02yza": {
                      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh02yza/",
                      "text": "Agreed. And tagging /u/lstimrdj so you see it: to add on, the draft letter works to specifically ensure that items that you would want  and think of particular importance in the letter get in there. It's not necessarily just a letter hyping yourself that your advisor will simply sign and send on\n\nFor example, my PhD advisor knew I had spent a good bit of time doing teaching and outreach work but, as that was out of her purview, she didn't really have any specifics. So when I wrote draft letters of recommendation, I would just create paragraphs with lists of certain accomplishments that would be relevant to the position/grant/award/etc. She was happy to share the final drafts at times and they looked nothing like my draft except that they included those specific accomplishments without her having to specifically pick them out of my CV and know that those in particular would be the best for a given position (for example, not understanding that for a SLAC job she shouldn't write the same letter as for an R1 job, which she honestly would be wont to do)",
                      "author": "BangarangRufio",
                      "created": 1608918275,
                      "upvotes": 13,
                      "replies": {
                        "gh0njwv": {
                          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0njwv/",
                          "text": "I don't ever ask for a draft. Instead I just ask students to write up a page or two telling me what they're applying for, why they want to do it, why they're qualified to do it, and what I specifically can say about them that will help their chances. I only pay attention to the last part. The first parts are for them to self-examine before making a life altering decision.",
                          "author": "AerosolHubris",
                          "created": 1608931203,
                          "upvotes": 5,
                          "replies": {
                            "gjxz6f9": {
                              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gjxz6f9/",
                              "text": "That is what recommenders have asked me to do and appreciate it greatly. It allows them to remember specifics for their rec.letter and helps me with my cover letter. I don’t think there is anything professionally unethical about reminding a professor about your academic history so she or he can write an accurate and effective account of your time in school.",
                              "author": "tropical_librarian",
                              "created": 1611150572,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh00qce": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh00qce/",
      "text": "Even though there is a deadline, doesn't the program usually allow the LOR at a later date? I mean I don't think you would be penalized in anyway as long as you explain your situation",
      "author": "ProjectCereal",
      "created": 1608916782,
      "upvotes": 6,
      "replies": {
        "gh09310": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh09310/",
          "text": "Some say they do, some don't. They point is, since I haven't had any contact with the prof in a month and a half, I've no reason to believe they are currently writing a letter and will have it uploaded soon, no? That reasoning is what led me to seek a letter from another reference after the deadline.",
          "author": "lstimrdj",
          "created": 1608922329,
          "upvotes": 5,
          "replies": {}
        },
        "gh0wekl": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0wekl/",
          "text": "Yes almost all do.",
          "author": "invisible760",
          "created": 1608936760,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh016sw": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh016sw/",
      "text": "Unacceptable abdication of professional responsibility and courtesy. From what has been described here, this could constitute grounds for serious academic misconduct. At the very least, they could have informed you of a reason. Wondering if this is a normal habit for this professor. \n \nTo another point. Universities do not generally throw out applications if they are missing some references. The application can still be forwarded with two references. The higher ranked programs will make efforts to review the application even if it is missing some components. Particularly in these difficult times, the application process is not normal.",
      "author": "Kingarvan",
      "created": 1608917093,
      "upvotes": 21,
      "replies": {
        "gh07h8b": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh07h8b/",
          "text": "Thanks for your insight, it's comforting to know my application could still have been considered with only two letters. There were a couple though that explicitly stated they only considered applicants with all letters/documents/essays in by the time they read the application which made me very worried while applying.",
          "author": "lstimrdj",
          "created": 1608921270,
          "upvotes": 5,
          "replies": {
            "gh0y3oz": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0y3oz/",
              "text": "They do tend to state that but actual practice can be different. The practice varies between schools. Schools don't want to disenfranchise applicants who paid fees and have the majority of the materials in. A single missing reference may not be a dealbreaker. Schools understand referees can be late.",
              "author": "Kingarvan",
              "created": 1608937876,
              "upvotes": 1,
              "replies": {}
            },
            "gjy0zqj": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gjy0zqj/",
              "text": "Contact the department manager or someone from admissions. Tell them the situation. Get them on your side. \nI had a letter writer (a former boss) that couldn’t figure out how to submit his letter online. After “reminding” him twice via emails once over text, I felt I had gotten to the point of harassing him, but the department manager/admin was telling me they hadn’t received it. \n\nEventually, I went to visit the former boss at his office with a small gift and apologies, explaining that a week after the deadline they still hadn’t received his letter. I thanked him profusely for writing the letter and for all the hassle he was going through (damn technology). He printed it in front of me and sealed it in an envelope. He faxed a copy to the number I gave him (I had emailed him this fax number before and he had told me repeatedly that he had faxed it, but the department manager kept telling me they hadn’t received anything, so it was very frustrating to keep telling my boss that they didn’t get it...was he not sending it, was the fax malfunctioning?) he also handed me the sealed, addressed envelope and I left from his office to personally deliver it to the department.\nStrangely, when I arrived the department manager told me that he had received the fax from my former boss. I was left to wonder, was my boss lying the entire time? Did it take me standing in front of him watching him do it to send a simple fax? Why? I’ll never know, and it almost cost me my admission. \nIf I hadn’t worked with the department manager I would not have gotten in. Thank you Christian. \nJust FYI for those wondering, it was against regulations for my boss to email the letter. It had to be submitted via the online secure forum, mailed, or faxed.",
              "author": "tropical_librarian",
              "created": 1611151605,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gh0r1zk": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0r1zk/",
          "text": "> To another point. Universities do not generally throw out applications if they are missing some references.\n\nWait, so does that mean that 'Incomplete applications will NOT be considered' on grad schools' websites is just a bluff?",
          "author": "JustSkipThatQuestion",
          "created": 1608933363,
          "upvotes": 3,
          "replies": {
            "gh0yd87": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0yd87/",
              "text": "An application can be incomplete for many reasons. A single missing reference letter may not be a dealbreaker, but an application missing transcripts, statement of purpose etc. could be considered to be so incomplete that a review would not be helpful.",
              "author": "Kingarvan",
              "created": 1608938051,
              "upvotes": 2,
              "replies": {
                "gh11a6i": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh11a6i/",
                  "text": "Yeah, we are aware that references are a little beyond the applicants' control. Those other things are not.",
                  "author": "AgoRelative",
                  "created": 1608939963,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gh0wayp": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0wayp/",
          "text": "I think you have a poor understanding of “serious academic misconduct “.  Seriously.  I don’t think this would even rise to the level of “slap on the wrist”.  It’s shitty behavior, and nobody would support it, but it happens.  People can be irresponsible dicks.",
          "author": "invisible760",
          "created": 1608936694,
          "upvotes": 2,
          "replies": {
            "gh0y7f8": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0y7f8/",
              "text": "I know what is \"serious academic misconduct\". Thanks for chiming in though.",
              "author": "Kingarvan",
              "created": 1608937943,
              "upvotes": 1,
              "replies": {
                "gh4nu32": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh4nu32/",
                  "text": "I’m sorry, but you’re wrong.  I wish you were right, but you’re not.  Snarky comments won’t change that either",
                  "author": "invisible760",
                  "created": 1609036371,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gh0ht37": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0ht37/",
      "text": "This happened to me as well - and I actually ended up having a three month \"extension\" for the letter because my application was accepted before it was submitted, so the deadline got pushed to the end of August instead of the beginning of May... which was lucky because the prof totally missed the May deadline. \n\nGot an email in September asking me if I still needed the letter. No sir, I was not giving up my place at grad school for this! Asked another prof about a month before the August deadline and it was sorted in a few days.",
      "author": "Quiinton",
      "created": 1608927626,
      "upvotes": 4,
      "replies": {}
    },
    "ggzzxlt": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzzxlt/",
      "text": "Did anything happen that might impact the professor's ability to give you a strong recommendation?  This would in no way excuse the lack of communication.  I have agreed to write letters and then had something happen that would make me a less than ideal choice.",
      "author": "Adultarescence",
      "created": 1608916248,
      "upvotes": 5,
      "replies": {
        "gh08u7u": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh08u7u/",
          "text": "Nothing major (good or bad) happened in either of our careers. I didn't have any disciplinary action or falling out if that's what you mean. Last I heard, he said he'd be happy to write me a letter.",
          "author": "lstimrdj",
          "created": 1608922165,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gh06v2r": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh06v2r/",
      "text": "This is unjustifiable, on the borderline of reportable malpractice, and *extremely* uncommon.\n\nI don't think anyone here could get any closer than absolutely raw speculation re: why this might have happened.\n\nSorry it happened to you.",
      "author": "lucianbelew",
      "created": 1608920861,
      "upvotes": 6,
      "replies": {
        "gh0wh8i": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0wh8i/",
          "text": "Extremely uncommon?  I wish you were correct, but you’re not.",
          "author": "invisible760",
          "created": 1608936808,
          "upvotes": 3,
          "replies": {
            "gh13nj1": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh13nj1/",
              "text": "Of all the faculty who agreed to write a letter for you, how many ghosted you in this egregious manner?",
              "author": "lucianbelew",
              "created": 1608941519,
              "upvotes": 2,
              "replies": {
                "gh1jtg4": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh1jtg4/",
                  "text": "My graduate advisor (MS) wrote my letter of recommendation for PhD programs 1 month past the deadline. I saw him everyday, reminded him once a week for months. Meanwhile my committee members submitted a LOR within 1 week. I was rejected from my top program before his letter was received due to an incomplete application. \n\nThat's not to say it's common, but it happens, and it's sad undergrads even have to pull the teeth of faculty for these letters. I was a graduate student who literally produced high quality publishable work and my advisor couldn't be bothered. \n\nIt's frankly disgusting to me and I have never relied on him for anything else. But what a weird system. As an undergraduate or graduate student (or even a post doc...) you are literally not in a position of power and if someone wants to keep you hostage as a worker, why wouldn't they by tanking your chances at a successful future? You can't force an advisor to be as invested in your future as you are. \n\nYeah, in an ideal world, they realize they need to write a great letter about you because it's the right thing to do. But in the real world, they are losing their best worker to \"competing\" PhD programs... Why would they write that great letter?\n\nIt's really just a broken system, with a broken power structure, and my lazy (I really don't think he was purposefully obstructive, just lazy) advisor is a symptom of that disease.",
                  "author": "GACGCCGTGATCGAC",
                  "created": 1608952741,
                  "upvotes": 6,
                  "replies": {
                    "gh1rubv": {
                      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh1rubv/",
                      "text": "> That's not to say it's common\n\nOh, so in the context of my prior comment, that this is extremely uncommon, what's the point of your comment here?",
                      "author": "lucianbelew",
                      "created": 1608958809,
                      "upvotes": -3,
                      "replies": {
                        "gh1uqhb": {
                          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh1uqhb/",
                          "text": "Yikes, take it down a notch. It's anecdotal evidence, which I added simply to relate to OP since I've dealt with similar situations. I was simply building on an informal discussion, since this is in fact an informal discussion forum. Do you expect someone to pool the database of \"annoyed and/or disgusted undergraduate and/or graduate students who are promised a LOR of recommendation and not given it (in the aforementioned time)\" and answer you accurately? \n\nI mean, if schools generally require 3 LORs, and 1 of those are unreliable, that would make 33%~ reliability. Is that always true? No, but sometimes the student asks an unreliable person to be their LOR. Is that their fault?",
                          "author": "GACGCCGTGATCGAC",
                          "created": 1608961200,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh0v7n0": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0v7n0/",
      "text": "I applied this cycle. My undergrad prof always does this. He doesn’t submit and I keep messaging him. Eventually he responded on December 15, last day, and he submitted after calling me and asking for all the links and draft of letter again. \n\nI had a postdoc as backup but I would have been embarrassed to ask someone on last day. Feel for you!",
      "author": "docdany",
      "created": 1608935991,
      "upvotes": 2,
      "replies": {}
    },
    "ggzyrdt": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzyrdt/",
      "text": "It’s not his priority , he is probably lazy to do stuff he isn’t forced to. It’s sad, but painful reality. Someone is just lazy, yet you come out as someone not worthy of a letter. Finding right people to work with is crucial",
      "author": "NorseSaga",
      "created": 1608915466,
      "upvotes": 3,
      "replies": {
        "gh098mv": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh098mv/",
          "text": "Could you please clarify? How could I have made myself more worthy of a letter of recommendation or how can I do so in the future?",
          "author": "lstimrdj",
          "created": 1608922430,
          "upvotes": 2,
          "replies": {
            "gh0lb3i": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0lb3i/",
              "text": "It’s not about you, it’s about him being lazy/irresponsible, as I said.",
              "author": "NorseSaga",
              "created": 1608929782,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gh0grr6": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0grr6/",
      "text": "If I agreed to write a LoR and then the student told me they needed me to send it to TEN schools, I'd regret saying yes. They take a lot more time than you might realize -- every school wants you to fill out its own special form in a different way.",
      "author": "AgoRelative",
      "created": 1608926993,
      "upvotes": 3,
      "replies": {
        "gh0jwsv": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0jwsv/",
          "text": "I had mentioned the number and names of the schools in my initial email, before they said they'd be happy to write the LoR. \n\nIn my field, most of my fellow applicants (that I know) apply to 8-16 programs. Each subdepartment in my field accepts 1-5 students each year, even the large universities, so diversifying is common.",
          "author": "lstimrdj",
          "created": 1608928924,
          "upvotes": 4,
          "replies": {}
        },
        "gh0jbe7": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0jbe7/",
          "text": "Don’t know phd but some students apply 15+ master programs (but may use 4+ providers)\n\nThe most exaggerated one I know applied ~25",
          "author": "academic_and_job",
          "created": 1608928558,
          "upvotes": 1,
          "replies": {
            "gh11fh2": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh11fh2/",
              "text": "Yeah, I realize this is field-dependent, I just don't think students realize it's more work than writing a single letter and shooting it off to ten places. I always get them done, but it's tedious stuff.",
              "author": "AgoRelative",
              "created": 1608940063,
              "upvotes": 1,
              "replies": {
                "gh1s93n": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh1s93n/",
                  "text": "Yes they probably also ask you to evaluate the student in form etc. The “stupid” system works that way. My professor wastes 1-5 minutes for each program",
                  "author": "academic_and_job",
                  "created": 1608959139,
                  "upvotes": 1,
                  "replies": {
                    "gh2srsb": {
                      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh2srsb/",
                      "text": "Some of them actually make me create a login, which is annoying, and of course, if I've logged into that school before, I HAVE a login but don't remember what it is, etc.",
                      "author": "AgoRelative",
                      "created": 1608996838,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh0wjlp": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0wjlp/",
      "text": "Well this is a typical American situation I suppose. In Europe, most universities that hire for PhD positions only ask for contact details of referees from the applicants.\n\nYour application is evaluated based on your credentials first and if all goes well (interviews etc.), then they may choose to contact one of your referees and it is typically done via call.\n\nGot my master's thesis position and the PhD position that I will be joining soon in this manner. My referee was contacted only after I was pre finalized as among the best candidate.\n\nI suppose this is much easier solution for everyone involved. Students sometimes have to send maybe over 50 applications to land 1 good position. So it is quite awkward to ask 50 reference letters from your referee to upload/send every time you send one application.\n\nI suppose American system could perhaps consider this method too.",
      "author": "__jaykay__",
      "created": 1608936852,
      "upvotes": 2,
      "replies": {
        "gh2u73s": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh2u73s/",
          "text": "Some of them just do both. They first ask for letters and if accept they will do due diligence via phone, which is very unnecessary",
          "author": "academic_and_job",
          "created": 1608997771,
          "upvotes": 1,
          "replies": {
            "gh3curx": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh3curx/",
              "text": "Both is probably overkill. Not a great idea.",
              "author": "__jaykay__",
              "created": 1609008747,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh0txh2": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0txh2/",
      "text": "Had this happen, that’s why you always go for more than 3 if three are required, that’s what I ended up doing, when one of my old PIs was running about a month into the deadline",
      "author": "El_Tlacuachin",
      "created": 1608935148,
      "upvotes": 1,
      "replies": {}
    },
    "gh1iprs": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh1iprs/",
      "text": "When I ask for a letter of recommendation, I plan on writing it myself. I’ll even offer to write a draft, sometimes. It feels a bit odd to do this, but it works, and rarely do the people I ask change the content very much. Usually minor edits. And I have always gotten what I need.",
      "author": "Wuzzupdoc42",
      "created": 1608951945,
      "upvotes": 1,
      "replies": {}
    },
    "gh1jegm": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh1jegm/",
      "text": "I’ve had this happen to me during two of my three application cycles with all different professors writing letters. It has always been because a certain professor was overworked and couldn’t find time to write it. One emailed me 48 hours before the deadline to tell me that she wasn’t going to be able to do it. I was never ghosted the way you were, though. Thankfully, after experiencing this the first time, I always asked for more letters than I needed. I don’t think there is anything you can do differently to avoid this. I would just expect that it will happen and plan accordingly.",
      "author": "Paloma_91",
      "created": 1608952442,
      "upvotes": 1,
      "replies": {}
    },
    "gh1ufcv": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh1ufcv/",
      "text": "I've got to jump on this beef train because I've had profs submit their LoRs at the last fucking minute and it's so fucking stressful and just ***WHY ARE YOU DOING THIS WHEN THE LETTER IS ALREADY WRITTEN?!***\n\nWhen I had just started my second postdoc, I needed a LoR from my first postdoc mentor for two fellowships that were due about a month apart. He submitted the first one on time, but the second one he submitted **50 minutes** before the deadline. WTF. The two fellowships had literally the same LoR content requirements. It was such a stressful 3 days trying to get in touch with him and trying to arrange for a backup letter.\n\nI've twice had people ask me to write letters for them only for them to sit on the letter for 3-4 weeks and submit it within 3-4 hours of the deadline. WHY ARE YOU LIKE THIS???",
      "author": "alexa-488",
      "created": 1608960937,
      "upvotes": 1,
      "replies": {}
    },
    "gh2a5o6": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh2a5o6/",
      "text": "I once had a professor agree to do my letter and then fly 5,000 miles to Mexico for two weeks. Since I couldn’t get in touch with him I had no idea if he still intended on writing it or even remembered. He submitted it about 20 minutes before the deadline but it was still so stressful because there was no communication on his side at all.",
      "author": "c21h30o2--",
      "created": 1608978598,
      "upvotes": 1,
      "replies": {}
    },
    "gh8gfw6": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh8gfw6/",
      "text": "Deadlines don't tend to mean much. Some do, but your prof might not think it's a serious deadline. I'm assuming you had a December deadline. If they think that people will only review applications in January (which is a thing that happens in some fields), they could reasonably put it off if they know the school will accept it late. But, they should still have told you what was going on, if that was the case, and it's unacceptable that they didn't reply at all after all this time.",
      "author": "uniadminthrowaway",
      "created": 1609112570,
      "upvotes": 1,
      "replies": {}
    },
    "gj3dlm4": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gj3dlm4/",
      "text": "Always - always - always ask as many people as you can for letters of rec. I only need two for my profession, but I aim for getting six at least. Then I can pick the best ones and sometimes dish over extra letters if they are all really good/ well-written.",
      "author": "Seanzietron",
      "created": 1610524978,
      "upvotes": 1,
      "replies": {}
    },
    "gmn9lfa": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gmn9lfa/",
      "text": "There are so many answers giving leeway to \"overwhelmed\" and \"busy\" professors and a notion that students should cut some slack. Ridiculous. Should I be late on a paper because I'm \"overwhelmed\"? Should I promise to show up to class and just plain don't because \"I don't have time\"? The excuses are just really unconscionable. Do what you say you're going to do, especially if you are an academic yourself. No excuses. Period.",
      "author": "kopkhunkrub",
      "created": 1612832327,
      "upvotes": 1,
      "replies": {}
    },
    "ggzv2w1": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzv2w1/",
      "text": "I agree with Happy/.  I sure don't support agreeing to write a reference and then crapping out.  I see it as a breach of professional ethics.  Parts of the UK see reference letters as a duty, nearly a form of contract.  I encourage students to remind once, and if no response to find someone else. I know profs are busy, we work 60 hour weeks, but still.  But to the point of your note OP, it is not a red flag for a prof to ask for a draft. They teach hundreds of students and you're just one of them. Between the hundreds of emails, meetings, followup, grading, course prep etc, remembering exactly who you are is generally low on the list.  I now that may be a surprise but it's true. The draft helps a prof to know what courses you took, what your qualities and interests are, etc. It helps the prof to draft a personalized letter. If you didn't send a draft, it looks like you didn't pick up your end.  And, if you were asked to send one and didn't, it's not fair to go on a rant over the prof, this was your fault.",
      "author": "gutfounderedgal",
      "created": 1608912904,
      "upvotes": 1,
      "replies": {}
    },
    "ggzy19p": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzy19p/",
      "text": "So, here’s the thing. Professors are asked by dozens to hundreds of students a year for letters. If you don’t have a close, personal, working relationship with a professor then you can’t expect a letter. I mean you need to work in their lab or on research with them for a minimum of 6 months. If you do this, then you’ll get your letter. If they forget, which my own PI did for the program to be in his lab, then you can walk to their office or call them and just say “you forgot this”. The other thing is, universities know profs don’t do these on time and will reach out personally if it’s past the due date. That’s because the PhD selection committee is also made of professors that do this exact thing.",
      "author": "krazyk1661",
      "created": 1608914973,
      "upvotes": -15,
      "replies": {
        "ggzy98z": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzy98z/",
          "text": ">This was a prof who's class I had taken, who's same class I had TAd, and whose lab I had done research in for a year, including full time over the summer where they paid me.\n\nBuddy, did you read the post?",
          "author": "zinfandelightful",
          "created": 1608915124,
          "upvotes": 23,
          "replies": {
            "gh05unc": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh05unc/",
              "text": "Did you see my comment? You gotta call them  or walk into the office. My advisor did the same thing while I was his employee. They all do it and the schools you apply to will harass them. Don’t be too worried about it. \n\nFor other people reading the post I outlined the other things.",
              "author": "krazyk1661",
              "created": 1608920190,
              "upvotes": -9,
              "replies": {
                "gh09tnn": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh09tnn/",
                  "text": "Called their office phone multiple times -> no response.\n\nWent to their office and lab and grad students office. Twice. -> they're not there, and apparently don't come to office anymore (covid).\n\nCalled their personal cell phone -> straight to voice-mail. No response since.\n\nTexted their personal phone -> no response.\n\nI don't know what more I could have done other then find their home address and knock on their door (not being serious).",
                  "author": "lstimrdj",
                  "created": 1608922813,
                  "upvotes": 5,
                  "replies": {
                    "gh0wkpx": {
                      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0wkpx/",
                      "text": "Guarantee the schools you applied to will do the work for you",
                      "author": "krazyk1661",
                      "created": 1608936874,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                },
                "gh06m7w": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh06m7w/",
                  "text": "What if they are not answering calls and it’s COVID, so no in person meetings allowed?",
                  "author": "a100192",
                  "created": 1608920695,
                  "upvotes": 8,
                  "replies": {
                    "gh09umv": {
                      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh09umv/",
                      "text": "Exactly what happened in my case",
                      "author": "lstimrdj",
                      "created": 1608922831,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ggztbyj": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggztbyj/",
      "text": "Shit happens. Life is hard and professors are busy. My advice to you when asking busy people to do you a favor is to do everything you can to make that favor as easy as possible. In this case, that means providing copies of your transcript and resume and a draft of the letter that you have written yourself. They asked for the draft. Did you provide it? If not, it’s your fault that they didn’t do what you asked.\n\nEdit: I’m not sure who is down-voting this, but I can only assume it is people who have a hard time dealing with reality. Anyone who uses a draft from the applicant change it to make it their own, but it just makes sense to have the person who knows their background the best fill in the highlights.",
      "author": "bigrottentuna",
      "created": 1608911651,
      "upvotes": -40,
      "replies": {
        "ggztwz3": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggztwz3/",
          "text": "I provided my resume, transcript and list of schools I shortlisted at the end of September in my initial email. I gave them the draft letter over a month before the application deadline. \n\nIt’s interesting to hear your opinions on writing a draft letter. Some of the departments I applied to make you check a box stating that you in no way contributed to the letter, and that you did not write any sort of draft, as the departments consider that unethical. Without checking that box, there is no way to submit a letter. \n\nI felt horrible lying on my application, and it seems wrong to me that this a part of the process: undergrads are expected to write a draft letter, and if the admissions committee finds out, they can withdraw their offer.",
          "author": "lstimrdj",
          "created": 1608912068,
          "upvotes": 22,
          "replies": {
            "ggzw2u8": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzw2u8/",
              "text": "Huh. In that case, he has no good excuse, unless he has a good excuse. Lots of people do right now, unfortunately. \n\nRegarding the check box, it’s a no-win for you. You just have to trust that he didn’t use your input for those, since it is outside of your control.",
              "author": "bigrottentuna",
              "created": 1608913615,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "ggzyha3": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzyha3/",
          "text": "You're being downvoted because you're being rude to someone who was treated very badly. Even if OP hadn't provided the draft, the letter writer had an obligation to say at some point well in advance of the deadline, \"I'm sorry but I can't write your letter because you haven't provided the draft in a timely manner.\" The person who ghosted this kid while responding to emails to his other students is 100% in the wrong, and would be even if OP hadn't provided a draft -- which he did!",
          "author": "zinfandelightful",
          "created": 1608915277,
          "upvotes": 25,
          "replies": {
            "ggzzb6l": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzzb6l/",
              "text": "In his post, OP only said that the professor requested a draft and that it might have been inappropriate. He didn’t say he provided one. \n\nAnd we don’t know what happened. Maybe the professor got COVID. Or maybe he’s an asshole. Complaining here won’t provide any insight.",
              "author": "bigrottentuna",
              "created": 1608915824,
              "upvotes": -10,
              "replies": {
                "ggzzmav": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/ggzzmav/",
                  "text": "If the professor got COVID, he somehow was still managing to send emails to other people. And it really is not that hard to type out, \"I am so sorry but I cannot write your letter.\" There, I just did it!\n\nIt is Christmas. You do not need to be nasty to this poor kid. Bah humbug.",
                  "author": "zinfandelightful",
                  "created": 1608916033,
                  "upvotes": 16,
                  "replies": {}
                },
                "gh0ahsb": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0ahsb/",
                  "text": "Despite the down votes on your comment, I appreciate your perspective on this. I just wanted to understand whether some professors think this is normal and why they might think so. Based on the responses to this post, I think I better understand what might have caused my professor to do this.\n\nMerry Christmas!",
                  "author": "lstimrdj",
                  "created": 1608923261,
                  "upvotes": 4,
                  "replies": {
                    "gh0bly7": {
                      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0bly7/",
                      "text": "You’re welcome. I think it’s shitty to promise a letter and then not deliver, but things happen to the best of us occasionally and these are not normal times. I would assume that something happened that prevented him from doing it.\n\nAnd I don’t care about the downvotes. People don’t like hearing difficult truths sometimes. It is what it is.\n\nI’m glad you found someone else to write the letter. Merry Christmas and Happy Chanukah to you.",
                      "author": "bigrottentuna",
                      "created": 1608923999,
                      "upvotes": -4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gh0fe2c": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0fe2c/",
          "text": "It is not a favor, it is part of the job. If for whatever reason they don’t want to write a LoR, they can just say no or opt out.",
          "author": "eveleanon",
          "created": 1608926234,
          "upvotes": 3,
          "replies": {
            "gh0lrgt": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0lrgt/",
              "text": "Nope. Sorry to burst your bubble, but this is completely discretionary. It’s a professional favor, but still a favor. Nowhere does it ever say in anyone’s job description, “Write letters of recommendation.”",
              "author": "bigrottentuna",
              "created": 1608930067,
              "upvotes": 1,
              "replies": {
                "gh0pz3b": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0pz3b/",
                  "text": "I’m sure there are many things that aren’t stated in one’s job description, but still part of the job. If you engage with serious students who are at the brink of going into grad school, post docs, or other academic positions, things like letters are to be expected.\n\nThat said, I don’t see them as something students can demand. If a professor is too busy or not convinced by the quality of the student then the student should look for someone else. But clear communication is the key in this situation. Just say no.",
                  "author": "eveleanon",
                  "created": 1608932698,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "gmnasai": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gmnasai/",
          "text": "You're part of the problem; if that's not clear enough. My guess is that you yourself are guilty of this, unfortunately for others.",
          "author": "kopkhunkrub",
          "created": 1612832956,
          "upvotes": 0,
          "replies": {
            "gmp1i9l": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gmp1i9l/",
              "text": "Lol. You had to guess? I don't think I could have been clearer. \n\nYou \\*are\\* the problem. I write \\*great\\* letters, but what I'm not going to do is waste my time researching the background of (or trying to remember details about) entitled fools like you just so I can write a better letter than you deserve. Sure, I can write, \"kopkhunkrub showed up regularly to class and earned a B+,\" but a letter like that is worth less than nothing, because the transcript already shows that and it takes the place of a genuinely good letter that says something more. If you want a good letter, it's on you to put in the small amount of time and effort to give me what I need to produce one. If you aren't willing to do that, then I'm sure as hell not going to put my time and effort into doing the work that you did not.",
              "author": "bigrottentuna",
              "created": 1612877671,
              "upvotes": 1,
              "replies": {
                "gnfpakp": {
                  "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gnfpakp/",
                  "text": "LOL Thanks for proving my point. Anything else, Professor Wonderful? If you even are a teacher, that is. Doubtful. If so, you should seek the mental health/career guidance most likely available on your campus, because what is clear is that you need a shift in life. Good luck with that.",
                  "author": "kopkhunkrub",
                  "created": 1613321888,
                  "upvotes": 1,
                  "replies": {
                    "gng93eh": {
                      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gng93eh/",
                      "text": "No, thank you for continuing to prove *my* point. Your outrageous display of entitlement just gets better and better. I’m enjoying it. You are showing all of the traits of the worst students. Now talk about how your parents (or their taxes) pay my salary and how your mother will contact my Dean.\n\nJust out of curiosity, why are you so opposed to providing information in the form of an initial draft to allow your professors to more easily write you a better letter? Is it because you are afraid it will reveal how bad you really are? Or that it will force you to face your own weak academic record? Or are you truly so narcissistic as to believe that the world and everyone in it owes you everything for the asking?",
                      "author": "bigrottentuna",
                      "created": 1613327116,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gh0x005": {
          "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0x005/",
          "text": "Sorry you’re getting downvoted.  The truth is hard for some people to swallow",
          "author": "invisible760",
          "created": 1608937154,
          "upvotes": -3,
          "replies": {
            "gh1klij": {
              "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh1klij/",
              "text": "Did you read the post? :D",
              "author": "Existenceisfutile1",
              "created": 1608953306,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh0nj8e": {
      "link": "/r/AskAcademia/comments/kk0jou/professors_who_agree_to_write_letters_of/gh0nj8e/",
      "text": "I recall being asked to write the letter for them, send it over, they review it, add anything and add their signature. \"If you want someone to do something, make it easy for them to succeed.\" It goes for back to 'professors' too.",
      "author": "ColdEvenKeeled",
      "created": 1608931191,
      "upvotes": -1,
      "replies": {}
    }
  }
}