{
  "sid": "pjoucv",
  "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/",
  "title:": "Uncertain postdoc prospects, need some perspective?",
  "text": "I’m hoping someone can advise on my situation. I started an unfunded PhD in the UK 3.5 years ago and have submitted my thesis yesterday. I was told multiple times to not accept an unfunded PhD, but I did not heed that advice. Instead, I took on multiple jobs in addition to TAing throughout the three years, before finally securing funding from a few sources during my final year.\n\nI was also offered two jobs a month ago at my University. Both are research assistant positions for two funded projects. However, the PI’s have been vague about how long they plan on employing me for. Everything seems up in the air and work deadlines keep changing. \n\nI realise how lucky I am to have received these opportunities, but I am in a very awkward position. I am completely burnt out and exhausted. For nearly three years I haven’t been able to get more than 5 hours of sleep, juggling both my PhD work and any employment to keep me afloat. This also made it very hard to apply for postdoc positions before submitting my thesis (i have read you should start applying at least 6 months before submitting your thesis), but I was not motivated, I just wanted to make it to the end of the day alive. I’ve developed some medical issues due to stress over the same period, which hasn’t made it easy. \n\nI feel lost. I enjoy research but my exhaustion has left me unable to apply for jobs. I can’t even bear to look for postdoc opportunities or reach out to potential PIs. I also feel like I have let myself down by not applying for postdocs at the beginning of this year and waiting till after I had submitted to start thinking about my future. I feel like a failure who, unlike other PhD graduates, was unable to secure an academic job and is no longer passionate about anything. \n\nI don’t really know what my question is… maybe a little perspective will help?",
  "author": "Abrocoma_1",
  "created": 1631027113,
  "updated": 1634079360,
  "over_18": false,
  "upvotes": 28,
  "upvote_ratio": 0.95,
  "comments": {
    "hbxuhzq": {
      "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hbxuhzq/",
      "text": "OK, breathe.\n\nI too ended up self funding my PhD, and paid my way through by picking up visiting lecturer status at the department (I had a lot of existing experience and a teaching qualification - this isn't a route I've seen anyone else succesfully navigate, so if you're a drive-by reader don't get your hopes up).\n\nI too burnt out a bit, and in the race to finish botched the postdoc application window. You are not a failure - it is a simple result of trying to push through without the structured support of a funded DTP etc.\n\nSome things you need to know:\n\n1. This situation is recoverable\n2. This situation is difficult. Academic momentum is real.\n\nIt seems to me like the solution to your situation is actually sat right in front of you though. You don't ned to be in love with either of the projects you've been offered, but working on another PIs project will be a nice change of suject area (that in itself is quite refreshing), provides an opportunity for more future collaboration and breadth in your expertise, and also gives you a window of time where you can step back a little and start to think about seriously applying for postdocs. You don't need to do that right away - these jobs will fill that gap for you. The added bonus is that if they haven't got a strict timeline in view, no-one is going to be upset if you turn around in 3 or 6 months with a sudden offer in hand to go elsewhere.\n\nSome things to consider when talking to these 2 PI's - have they got a firm idea of what it is you would be doing? What are they like to work with? Find the project with the PI that you think is most understanding of your situation, and who hasn't got tons of other demands on their time.",
      "author": "OrbitalPete",
      "created": 1631027759,
      "upvotes": 22,
      "replies": {
        "hby3xw6": {
          "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hby3xw6/",
          "text": "It's worth adding that, all RA jobs have a fixed contract. This is because they are paid for by a funder as part a fixed term project. HR won't let the position exist without a fixed contract. Find out how long the contracts are for. If the PI is vague it's probably because he or she thinks that they might be able to get follow on funding to extend the position. However the PI is only placing a bet on that happening. They can't guarantee it. You need to know how long the basic contract will be. This is your worst case scenario. If the PI still won't tell you, then HR will, but that in itself might be a red flag.",
          "author": "sbw2012",
          "created": 1631031625,
          "upvotes": 14,
          "replies": {
            "hbzbyfn": {
              "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hbzbyfn/",
              "text": "This isn't totally correct. RA positions at universities are generally fixed contract, although not even then because once the contract has been renewed a number of times it becomes permanent I believe, or at least you have to be made redundant when the funding runs out. However, RA positions at research institutes can be permanent jobs. We have hundreds of RAs where I work and the majority are permanent. But they're also junior roles and the majority don't hold PhDs. There are good career prospects for RAs with ambition but not in the academic track and for most middle management type level is really the ceiling. \n\nPersonally I don't think OP should take an RA role. I think it will be harder to get a postdoc from there and they'll struggle to recover from the burnout. If they really want an academic career they might just be better taking time out and recovering. I took a job working in a school office for 6 months and landed a good postdoc when I was ready.",
              "author": "ACatGod",
              "created": 1631049747,
              "upvotes": 0,
              "replies": {}
            },
            "hc18xfp": {
              "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc18xfp/",
              "text": "Does this specifically apply in the UK or does it come from your experience in the US?",
              "author": "officially_anxious",
              "created": 1631087140,
              "upvotes": 1,
              "replies": {
                "hc1e9uk": {
                  "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc1e9uk/",
                  "text": "Yes, I'm a UK PI.",
                  "author": "sbw2012",
                  "created": 1631092100,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hby33e6": {
          "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hby33e6/",
          "text": "> It seems to me like the solution to your situation is actually sat right in front of you though.\n\nTotally agree with this. Take one of those positions, work but also take a little breather and regroup while getting paid. Look for the next step during this time that's been given to you.",
          "author": "IamRick_Deckard",
          "created": 1631031273,
          "upvotes": 8,
          "replies": {}
        },
        "hc1isim": {
          "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc1isim/",
          "text": "Thank you for sharing your experience. I am the only unfunded PhD in my department and so I struggled to find any “success” stories from unfunded PhDs who managed to make it out alright and secure work in academia – or even anyone that could empathise with my situation. \r  \n\r  \nThe reason why I was so panicked is because I always felt that taking a month or a few weeks off could make it extremely hard to make your way back into an academic or research-based career. I wasn’t sure how future employers might interpret a gap of two/three weeks in my CV. \r  \n\r  \nYes, they have suggested that there will be the opportunity to publish and collaborate with other scholars. I will also be involved in some data analysis. Both PIs are well-established in their field and seem understanding, generally nice folks. I think I just needed to hear that I haven’t completely sabotaged my chances of landing a postdoc. I am going to try and relax a bit.",
          "author": "Abrocoma_1",
          "created": 1631096181,
          "upvotes": 1,
          "replies": {
            "hc1khn5": {
              "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc1khn5/",
              "text": "I have several unemployment gaps in my career history that stretch to ~ 1 year each. EVeryone knows what the current academic environment is like. No one is judging those gaps in my experience. However, what they *do* mean is that if you're not careful your publication record ends up a bit thin on the ground, and that *is* something which will hurt your employability. A gap of weeks in the CV is literally nothing.",
              "author": "OrbitalPete",
              "created": 1631097590,
              "upvotes": 3,
              "replies": {
                "hc1mw0j": {
                  "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc1mw0j/",
                  "text": "Ok, well that puts things in perspective and makes sense in terms of publications. Thank you.",
                  "author": "Abrocoma_1",
                  "created": 1631099409,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hby7c8c": {
      "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hby7c8c/",
      "text": "Make a cold-blooded rational analysis of your success chances (both for getting a post-doc and eventually a faculty position).\n\nRelevant questions are:\n\n1. How \"in demand\" is your field? Are student numbers rising or at least constant over the years?\n\n2. Where do you stand in comparison to your peers? Strengths, weaknesses, track record, and potential to build a strong track record in the future? Be aware that it's usually just a fraction of PhD graduates that eventually ends up in academia.\n\nYou might want to talk to senior colleagues to ask them for a neutral assessment (ideally not your supervisor, they're biased).",
      "author": "ColourlessGreenIdeas",
      "created": 1631033016,
      "upvotes": 10,
      "replies": {
        "hc1isxu": {
          "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc1isxu/",
          "text": "Thank you, this has given me some important points to consider.",
          "author": "Abrocoma_1",
          "created": 1631096191,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hbyonnw": {
      "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hbyonnw/",
      "text": "*\"I realise how lucky I am to have received these opportunities ... I am completely burnt out and exhausted.\"*  \nIf that's the outcome, it doesn't sound very lucky to me?",
      "author": "tryatriassic",
      "created": 1631040173,
      "upvotes": 8,
      "replies": {}
    },
    "hby4lw4": {
      "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hby4lw4/",
      "text": "I would highly consider going into industry. At the very least, you can have a breather for a few years. In the UK, it isn't unheard of to go into industry then jump back into a postdoc position, especially since it is expected for UK grads to do 2-3 postdocs. The funding situation in your field is entirely outside of your control, if it is so bad that you can't get a funded PhD, let alone contracted, full time, secure RA position afterwards, why do you want to stay in that environment and constantly stress about where your money will come from? I would accept a position as an RA just to have something lined up, but be actively looking for an industry job or more certain research job while doing so.",
      "author": "rosealyd",
      "created": 1631031897,
      "upvotes": 7,
      "replies": {
        "hc1itze": {
          "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc1itze/",
          "text": "That's what I had in mind. I need these RA positions for the money, at least it will keep me going for a few weeks until I am able to start applying for postdocs or potentially some industry jobs.\r  \n\r  \nI wasn’t aware It was common to go into industry and then transition back into academia, that is reassuring. I think having read most of the replies here its seems sensible to apply to both, I haven’t worked in industry before so might end up enjoying it, especially if there’s more job security.",
          "author": "Abrocoma_1",
          "created": 1631096215,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hbyrbrg": {
      "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hbyrbrg/",
      "text": "What's your endgame? Is your goal to stay in academia? Do you have a realistic chance of doing so based on how productive you were during your PhD? The vast majority of PhDs will not stay in academia, that's not a failure on your part, it's just that the odds are stacked against you.\n\nI recommend looking for positions outside academia, even if you wish to stay in academia, doing a postdoc where you are unproductive due to a lack of motivation is going to kill your prospects more than a short stint outside academia.",
      "author": "mleok",
      "created": 1631041284,
      "upvotes": 7,
      "replies": {
        "hc1iw3a": {
          "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc1iw3a/",
          "text": "My aim was to stay in academia and that’s how I approached my PhD. I was able to get two first authored publications during the first two years and I am trying to push a third paper out based on some work I did during my final year. But as you say, the odds are stacked against you, because the competition is so intense. \r  \n\r  \nI think I need to cast a wider net and start seriously considering industry. I don’t think I’ll be very useful to anyone if I’m this unmotivated. Thank you for the advice.",
          "author": "Abrocoma_1",
          "created": 1631096265,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hby3tul": {
      "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hby3tul/",
      "text": "Only in academia is it considered not only acceptable, but an honor to work for free for years as a highly skilled and educated worker.  \nVoluntary slavery is what it is.",
      "author": "tryatriassic",
      "created": 1631031579,
      "upvotes": 16,
      "replies": {}
    },
    "hbxzkf5": {
      "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hbxzkf5/",
      "text": "And now speak after me:\n\n \" **You are not a failure because you did not secure an academic position\"**   \n\n\nthat is the BS that they keep telling you because without underpaid and overworked PhD/Postdocs in their labs there would be no research at all. So they will do anything to make you feel bad if you want to leave or have to leave. In the end there is so many more PhD students than positions there is a discrepancy they like to not tell you about.  \n\n\n**I tell you what : its fine!** I did it many many others did it and now have a happy industry life with great jobs better pay and much more security.   \nIf you are to make this decision I would absolutely include opportunities outside of academia. Its not about being academic or not ,its about you finding a job you like or at least you can live with that provides you with the financial basis of what you want to have",
      "author": "CreepyBumblebee31",
      "created": 1631029822,
      "upvotes": 12,
      "replies": {
        "hc1iuyo": {
          "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc1iuyo/",
          "text": "Thank you for this. When you’ve been in the academic bubble for so long, I think the self-doubt and constant pressure can affect one’s ability to reason.  I am going to consider industry jobs at this point, I don’t want to continue feeling like I don’t know where my next paycheck will be coming from.  \n\n&#x200B;\n\nI needed to hear all this!",
          "author": "Abrocoma_1",
          "created": 1631096238,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hbz3ek3": {
      "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hbz3ek3/",
      "text": "I'm confused as to what your dilemma is.  You were offered two RA positions at an academic institution.  If these positions only last a year, it will give you experience, income, and the space you need to figure out what you want to do.\n\nI did not go the postdoc route.  To me, it feels like acadmeic slavery.  I chose industry and a position that would give me experience.  I then started the process of looking for funded research institute positions.  For me, that will build some publishing credits and allow me to pursue a position in academia.\n\nAll fields are different.  My field pays a lot more in industry, so I decided to only puraue academic jobs that fit what I want to do.  Worst case, I stayed in industry. Best case, I get tenure somewhere.",
      "author": "boredpanda858",
      "created": 1631046219,
      "upvotes": 4,
      "replies": {
        "hc1ix2t": {
          "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc1ix2t/",
          "text": "I should have taken a day or two to clear my head after submitting my work before posting on reddit. I was just under immense stress, I couldn’t think rationally. Taking a step back, the RA positions will give me some breathing room to apply for jobs, and to also think about what it is I really want to do. \r  \n\r  \nIf I may ask, what is your field? I am in the social sciences and I am just not aware of my industry options and so always gravitated towards academia. Were you able to successfully find a position at a funded institute?",
          "author": "Abrocoma_1",
          "created": 1631096289,
          "upvotes": 3,
          "replies": {
            "hc2hdbk": {
              "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc2hdbk/",
              "text": "You are doing great.  The RA positions are a great opportunity for you. \n\nI did mathematics and went to work for a defense contractor.  Defense is a field that has traditionally hired mathematicians.  When the pandemic started, I was in the process for a position with DRDC.  That got disrupted.  \n\nI will be starting a new position with an institute next month. I am relieved, since my current position doesn't allow publishing.",
              "author": "boredpanda858",
              "created": 1631114731,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hbzkrnl": {
      "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hbzkrnl/",
      "text": "Burn out is really and needs to be acknowledged. I didn’t realize it was happening until I developed physical manifestations of it. \n\nIt’s hard to think of the future when you’re barely surviving the present. So be kind to yourself. \n\nFor some context, when I was 3.5 years into my PhD I barely had a project and had no direction. It’s insane to me you guys in Europe finish in 4 years. Im on year 6 and I finally feel like I have a grip on things.\n\nYou need to go inward and figure out what’s important to you right now.",
      "author": "sweetypantz",
      "created": 1631053765,
      "upvotes": 2,
      "replies": {
        "hbzz9my": {
          "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hbzz9my/",
          "text": "They do it in 3/4 years because they apply with a project already outlined. The degree is just doing the project.",
          "author": "IamRick_Deckard",
          "created": 1631060451,
          "upvotes": 3,
          "replies": {
            "hc192va": {
              "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc192va/",
              "text": "Not necessarily. I had to propose my own project, which is obviously a bit tricky for a fresh-faced undergrad and doesn’t result in a fully planned project. My work has changed a bit in the 2 years since then, but I still have to aim for 3-4 years submission.\n\nI think a lot of people in the US also go into a PhD with only a general idea of the topic they want to work on, but it takes longer because they have classes to do and are expected to teach more and do more non-research work.",
              "author": "officially_anxious",
              "created": 1631087278,
              "upvotes": 4,
              "replies": {
                "hc1vfg3": {
                  "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc1vfg3/",
                  "text": "I agree with your comment but imo, it’s a bullshit norm. \n\nYes it does take longer but I and many people I know went in with well defined projects. People I know had plenty of publication by year 4, which is our main requirement… but they won’t let us leave at least until 5.5 years in. Most of us will be done in 6 years.\n\nI honestly think the system here just uses us as cheap labor. I absolutely could have left in 4.4 years when I got my shit together but am now aiming for 6 with pubs and my PI is coaxing me to stay til year 7. It’s fffcked.\n\nIf we all aimed for 4 years we could absolutely do it. I honestly have felt like a postdoc in terms of my skill level for the last 1.5 years but without the salary.",
                  "author": "sweetypantz",
                  "created": 1631104718,
                  "upvotes": 3,
                  "replies": {
                    "hc2l5vf": {
                      "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc2l5vf/",
                      "text": "Academic slavery is real in the US.  I am glad I did my degree in the UK.  The expectation that someone has to do someone elses work is ridiculous.  It takes 6 years in the US because you are doing 3-4 years of someone elses work.",
                      "author": "boredpanda858",
                      "created": 1631116327,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hc1ixj0": {
          "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc1ixj0/",
          "text": "\r  \nThat is true. It just feels like your brains all foggy, and I think that’s when you’re at most risk of making terrible, terrible decisions.\r  \n\r  \nBut yes, as others have said, it is different in the UK because you do come in with a (more or less) defined project and are expected to jump straight into it. The downside is you don’t get the same amount of time to develop your CV, publication record, etc.",
          "author": "Abrocoma_1",
          "created": 1631096299,
          "upvotes": 1,
          "replies": {
            "hc1vvhe": {
              "link": "/r/AskAcademia/comments/pjoucv/uncertain_postdoc_prospects_need_some_perspective/hc1vvhe/",
              "text": "I say go for one of those positions offered to you, take that time to build your CV and figure out your next steps.",
              "author": "sweetypantz",
              "created": 1631104958,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}