{
  "sid": "q2zl3u",
  "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/",
  "title:": "Is there a place like this sub for people who work in humanities?",
  "text": "I came here a few years ago because I wanted to read about people's experiences in academia and talk about my own too, specifically in humanities. But I feel 90% of what gets posted here doesn't concern me at all because it's STEM-related. As a matter of fact that's primarily why I don't even go on /r/gradschool (also because most of people's experiences are clearly unrelatable to what academia is like in Canada).\n\nSo where else can I go? Is there another discussion board somewhere that is more used by people in humanities? \n\n\nThanks!",
  "author": "PM_MOI_TA_PHILO",
  "created": 1633574763,
  "updated": 1634078645,
  "over_18": false,
  "upvotes": 113,
  "upvote_ratio": 0.91,
  "comments": {
    "hfoupr4": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfoupr4/",
      "text": "I'm a recently resigned TT professor of Anthropology and Sociology. Although my expertise was interdisciplinary -- so I have some STEM overlap, I recently left academia for industry because it pays a whole helluvalot more. I'm able to answer any questions you might have.",
      "author": "honestblackman",
      "created": 1633578918,
      "upvotes": 40,
      "replies": {
        "hfoye8a": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfoye8a/",
          "text": "What do you do in the industry for such fields? Honest question, I mean no disrespect.",
          "author": "ambystom4",
          "created": 1633581052,
          "upvotes": 17,
          "replies": {
            "hfoyiie": {
              "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfoyiie/",
              "text": "Well, because I have coding, statistical, and analytical experience -- from grad school and beyond, I'm leveraging that experience to interview for research scientist positions. I'm currently waiting to hear back from one that I have strong reason to believe I got...still waiting for the official word though.",
              "author": "honestblackman",
              "created": 1633581122,
              "upvotes": 22,
              "replies": {
                "hfozikf": {
                  "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfozikf/",
                  "text": "Is there any particular reason you resigned before securing another position?",
                  "author": "WrestlingStuffGuy",
                  "created": 1633581637,
                  "upvotes": 5,
                  "replies": {
                    "hfp0nxp": {
                      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfp0nxp/",
                      "text": " See [link](https://www.reddit.com/r/AskAcademia/comments/q1b4g4/is_it_true_that_there_is_no_job_where_you_are_as/hfex4zc/?context=3)\n\nThe university that hired me cut my salary by 40% for 6 months leading into the pandemic where my wife lost her job, and I could no longer afford to live in the city I was hired to work in. All throughout the pandemic, those who I sought support and advocacy from told me that I was dealing with a personal problem. Additionally, a lot of my financial woes came from being forced to be poor from receiving the NSFGRFP. Meaning that I could never afford to save money throughout the academic pipeline, found myself in insurmountable debt to the point that at the start of my TT job, I was looking to file Bankruptcy. The pandemic hit, my university spit in my face and told me to go fuck myself, so I left -- moved all the way to the other side of the country after selling off most of my property, to begin life anew. The university only tried to get me back after they'd realized I left and moved to the other side of the country. Now, on this end, my wife has a job that pays more than she's ever made, and I'm only one step away from making nearly triple what I was earning in academia, plus sign on bonus and stocks.",
                      "author": "honestblackman",
                      "created": 1633582366,
                      "upvotes": 38,
                      "replies": {
                        "hfp4vrn": {
                          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfp4vrn/",
                          "text": "Can you say a bit about how the NSF GRFP left you poor? Usually it's a decent bump up in stipend, and I remember living on 1/2 of the GRFP amount and socked away the other half (but I wasn't supporting a family).",
                          "author": "dr-dead-inside",
                          "created": 1633585373,
                          "upvotes": 11,
                          "replies": {
                            "hfp6i1c": {
                              "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfp6i1c/",
                              "text": "Because you're required to agree that if you take the GRF you cannot earn any income from any other source through employment, and that you must be committed to the advancement of your PhD full-time. Most people, I would come to find out, either had a spouse making a decent living that could afford to support them, or they were borrowing money from their parents. For me, not coming from deep pockets and being an underrepresented minority....it just kept me poor. Then came the time I needed to leave my university to take on a post-doc on the other side of the country. Except no post-doc provide relocation assistance, so one would have to move their 6-8 year graduate school life to wherever their next stop is -- and mine happened to be on the opposite side of the country I was originally in. How did I fund that? I took my advisors advice that I would be able to afford to pay off my loans when I got the TT position, so I took out a loan. Got to my post-doc and other post-docs of color, with similar accolades and histories were going homeless. Instead of going homeless, myself, I opted to skip meals where I could and skim them off of campus events. I ended up losing 35 lbs that year. I aggressively applied for faculty positions in the hopes that my life would get better, because I was close to homelessness in my postdoc, landed a TT job, but didn't have the money to relocate. Even though relocation assistance is an institutional norm in academia, the university that hired me refused to provide it, and instead offered a two month salary advance that I had to pay back over 6 months. When I was trying to file bankruptcy, I called my former advisor to ask him why things were turning out the way they were because I was overwhelmingly successful and did everything right. His response: \"I remember when I was living out of my car, but when I finally got tenure, I knew I made it\"\n\nI was baited into a broken system that took me for every dollar I was worth, and spit me out when I didn't have any more money to give. The income I earned never afforded me the ability to pay off any of the loans I took out, so my credit score tanked, I was no longer eligible to find financial assistance elsewhere; and then the pandemic hit, and my wife lost her job.",
                              "author": "honestblackman",
                              "created": 1633586626,
                              "upvotes": 29,
                              "replies": {
                                "hfqeqov": {
                                  "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqeqov/",
                                  "text": "I luckily did not pass through the same hardships as you but your experience is common for academia. You are exploited until you are not longer useful and you leave and you get replaced by the next hopeful recent PgD graduate. And so i continues. Good for you you got out and turned your life around. I hope one day I will be able to make that transition as well.",
                                  "author": "frugalacademic",
                                  "created": 1633617530,
                                  "upvotes": 6,
                                  "replies": {}
                                },
                                "hfp6iki": {
                                  "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfp6iki/",
                                  "text": "[removed]",
                                  "author": null,
                                  "created": 1633586638,
                                  "upvotes": -20,
                                  "replies": {
                                    "hfpmc7b": {
                                      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfpmc7b/",
                                      "text": "bad bot  \n\n\nRead the damn room.",
                                      "author": "Altorode",
                                      "created": 1633601065,
                                      "upvotes": 10,
                                      "replies": {
                                        "hfpmc9r": {
                                          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfpmc9r/",
                                          "text": "Rude! just kidding, if you want to opt out, reply 'opt out'. Thanks",
                                          "author": "useles-converter-bot",
                                          "created": 1633601066,
                                          "upvotes": -11,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "hftj27b": {
                              "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hftj27b/",
                              "text": "You lived on $17,000 a year? I mean I suppose there are some cities where that's a livable wage - I had a GRFP and although I was able to save a little, it certainly wasn't anywhere near half.",
                              "author": "roseofjuly",
                              "created": 1633668960,
                              "upvotes": 1,
                              "replies": {
                                "hg2kf1e": {
                                  "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hg2kf1e/",
                                  "text": "Yup, it was one of the more expensive cities, but not *the* most expensive 3 cities. The $34,000 was tax free after deductions, and even free of FICA taxes for some reason. I have been meticulous about tracking my spending through my bank's monthly summaries.\n\nSo it was roughly $1500 a month: $850 for rent, $30 utilities, $15 phone (cheap prepaid plan and I used very little mobile data), $15 internet ($20 regular minus some employee discount code from my credit union for some reason), $100 household consumables + gifts + entertainment, $20 clothes on average, $150 groceries, $200 restaurant and bars, and $100 miscellaneous (probably a combination of taxis and extra conference vacation days at airbnbs).\n\nThe school covered a bus pass and health insurance and my computers. I used air miles to travel home on breaks by applying for credit cards with mile bonus, so I never paid a cent. It felt like plenty to live on, and I never declined going out or having fun because of finances.",
                                  "author": "dr-dead-inside",
                                  "created": 1633843110,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "hfp214x": {
                          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfp214x/",
                          "text": "Wow, what a story. Congratulation on turning those lemons into lemonade, and just an absolutely incredible example of how heartless these universities are....",
                          "author": "Mighty_Specialist88",
                          "created": 1633583329,
                          "upvotes": 16,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hfqumat": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqumat/",
          "text": "I read all of your replies - your story is absolutely horrific. I'm thinking of bailing out of academia (halfway thru a phd right now) and it's super helpful to hear these kinds of experiences, especially from people who got a TT job (since in academic culture those are the people who \"made it\"). No pressure at all but I'd love to read a full post with a more detailed account of what happened. I really haven't heard a lot from ex-academics in the humanities and I imagine this would be helpful for a lot of people!",
          "author": "leila0",
          "created": 1633624142,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfpp9lt": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfpp9lt/",
      "text": "r/Professors skews more toward humanities",
      "author": "tamelotus",
      "created": 1633603532,
      "upvotes": 26,
      "replies": {}
    },
    "hfopc6d": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfopc6d/",
      "text": "Be the change you seek.",
      "author": "CerebralBypass",
      "created": 1633575853,
      "upvotes": 49,
      "replies": {
        "hfpau5n": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfpau5n/",
          "text": "For real is great to get to see into how other fields function",
          "author": "Supercontented",
          "created": 1633590239,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hfq31xv": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfq31xv/",
      "text": "There are humanists here, but obviously they are grossly outnumbered by STEM faculty. The best place was probably the old Chronicle of Higher Education fora (assuming OP is in the US) but they nuked those about three years ago.  Many thousands of posters lost, but it was somewhat [reconstituted here](https://thefora.org/).\n\nIn the bygone days the [H-Net set of mailing lists](https://www.h-net.org/) offered very robust fora on a remarkable range of humanities specialties, but those have eroded away to almost nothing. Speaking personally I am still on some very active subfield mailing lists (like tens of posts per day) that are useful. But there's nothing like humanists had in the 90s or early 2Ks when everyone *had* to be on a given list to keep up professionally.",
      "author": "SnowblindAlbino",
      "created": 1633612018,
      "upvotes": 10,
      "replies": {
        "hfrjflk": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfrjflk/",
          "text": "Blast from the H-Net past! VU.",
          "author": "molobodd",
          "created": 1633634316,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfovt19": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfovt19/",
      "text": "I think it might just be the US-Reddit demographic to be honest",
      "author": "Prime255",
      "created": 1633579555,
      "upvotes": 26,
      "replies": {
        "hfp3w2l": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfp3w2l/",
          "text": "Surely the no stem people are somewhere lol",
          "author": "PM_MOI_TA_PHILO",
          "created": 1633584627,
          "upvotes": 7,
          "replies": {
            "hfp4gl2": {
              "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfp4gl2/",
              "text": "Honestly, I think they're all on Twitter instead.",
              "author": "Ummerruhhno",
              "created": 1633585053,
              "upvotes": 35,
              "replies": {
                "hfp6vgu": {
                  "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfp6vgu/",
                  "text": "As a mesoamerican archeology/history hobbyist, I can confirm there are a ton of archeology, anthropology, etc academics and researchers on twitter.",
                  "author": "jabberwockxeno",
                  "created": 1633586918,
                  "upvotes": 22,
                  "replies": {
                    "hfqxkqr": {
                      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqxkqr/",
                      "text": "I think there’s a ton of any field over there, when I signed up for Twitter my approach was just follow everyone in my field, and woah there’s a ton.",
                      "author": "OrbitRock_",
                      "created": 1633625329,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "hfpnd7b": {
                  "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfpnd7b/",
                  "text": "Humanities UK based. Was on twitter but found it so depressing.",
                  "author": "AntDogFan",
                  "created": 1633601976,
                  "upvotes": 13,
                  "replies": {
                    "hfpyas3": {
                      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfpyas3/",
                      "text": "Twitter sucks. I’m a humanities PhD candidate and I can’t get myself to “eNgAgE iN tHe DiScOuRsE”, it feels so fake and performative, yet somehow I feel that I should",
                      "author": "obinaut",
                      "created": 1633609477,
                      "upvotes": 19,
                      "replies": {
                        "hfqxgeh": {
                          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqxgeh/",
                          "text": "Totally agree with you, and I have enough addiction to social media as it is.",
                          "author": "PM_MOI_TA_PHILO",
                          "created": 1633625280,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfpzun2": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfpzun2/",
      "text": "If you post about the humanities people will probably interact with it! I've always wanted to get to know people in humanities PhD programs and academia. Something about it seems so cool and exciting, as opposed to my life which involves staying in the lab all day gathering data and then sitting at a computer all day doing math. Always been in awe of the \"romance\" of humanities academia (like history, lit, art, etc.). I think we skew stem but people are not anti-humanities by any means",
      "author": "Winesday_addams",
      "created": 1633610331,
      "upvotes": 9,
      "replies": {
        "hfqxkuz": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqxkuz/",
          "text": "For sure, but the topics don't get as much traction and there's always someone from STEM giving you advice from their perspective despite the flairs we use.",
          "author": "PM_MOI_TA_PHILO",
          "created": 1633625330,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfpu1o9": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfpu1o9/",
      "text": "I just want to continue my futile push back against the STEM designation. I'm in math and my experiences are much closer to those in humanities than those in science or engineering. I got my PhD over a decade ago and I never heard the term \"P.I.\" until I joined this sub, I rarely write grants (and when I do they're usually under $2k -- coffee, chalk, and travel to other mathematicians), and I don't use a lab. \n\nWhen people lump STEM together it makes math look bad against the sciences because we don't bring in money, and against the humanities because we are assumed to be only quantitative and empirical (\"Without soul\"). But math (again, my own experience) is closer to philosophy than to chemistry in almost every way. But I do acknowledge the benefit of being known as necessary by the people who pay the bills, compared to the fight humanitarians (humanities folks? humans?) have to deal with.",
      "author": "AerosolHubris",
      "created": 1633606923,
      "upvotes": 34,
      "replies": {
        "hfq189k": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfq189k/",
          "text": "Yeah, there's a reason they stuck the Math and English departments in the same building at my school: lots of service courses, lots of adjunct faculty, not particularly \"profitable\"--but central to the institution's mission.",
          "author": "headlessparrot",
          "created": 1633611067,
          "upvotes": 13,
          "replies": {
            "hfq4jk3": {
              "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfq4jk3/",
              "text": "Definitely. And don't forget the dearth of majors! Math and English are often in the exact same position of covering lots of 100 level courses and being in danger of never getting to teach a fun class again as we're often on the chopping block for programs.\n\nThe English faculty I talked to even get to propose fun new courses that meet their learning outcomes and students will take them, whereas in math the curriculum is really prescribed and specific courses need to be offered so we get to design fewer cool classes.",
              "author": "AerosolHubris",
              "created": 1633612782,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "hfq7q23": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfq7q23/",
          "text": "Yes! As a mathematician now in an engineering department, but trained in a math department that belonged to the university’s arts & letters college — I can confirm that the cultural differences between STE and M are vast and sometimes infuriating.",
          "author": "yakiguriumai",
          "created": 1633614327,
          "upvotes": 8,
          "replies": {
            "hfquov1": {
              "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfquov1/",
              "text": "I feel like this is at least as hard to convince the humanities folks of as convincing the STE people.",
              "author": "AerosolHubris",
              "created": 1633624170,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hftjzwl": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hftjzwl/",
          "text": "This. On the flip side, I'm in psychology and my experiences were closer to lab-based sciences like biology and chemistry than they are to other social sciences like anthropology or sociology.",
          "author": "roseofjuly",
          "created": 1633669592,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfprthb": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfprthb/",
      "text": "I'm a (former) Canadian humanities academic. Did my Masters and pulled the ripcord after reading the writing on the wall. I dont know everything, but I know some.",
      "author": "ranger24",
      "created": 1633605426,
      "upvotes": 3,
      "replies": {}
    },
    "hfr8bev": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfr8bev/",
      "text": "It is inactive now, but I made r/Humanities_Scholars for you ;). If you choose to accept this mission, please add a pertinent discussion post to see if others are interested in joining the conversation",
      "author": "biglybiglytremendous",
      "created": 1633629703,
      "upvotes": 3,
      "replies": {}
    },
    "hfpd68x": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfpd68x/",
      "text": "I second twitter, I don't think there are enough of us on here to warrant it askacademiauk is hardly a lively place, I think the demographics of reddit skew towards American and STEM, tbh if I hadn't joined way back in high school I probably wouldn't be here now",
      "author": "IntLawprof",
      "created": 1633592320,
      "upvotes": 4,
      "replies": {}
    },
    "hfpf32c": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfpf32c/",
      "text": "I mean, if you're basically looking for a tightly-focused information feed that you can passively follow, I don't think reddit is the social medium for you. Follow some humanities academia accounts on instagram or twitter. \n\nI don't think that this sub is 90% STEM (I am also not in STEM, but I find more than 10% of topics relevant to me on basically any day that I look). I also think the strength of this platform is that it facilitates engagement. So if you want to engage on a topic of interest to you, post one.",
      "author": "thegreenaquarium",
      "created": 1633594130,
      "upvotes": 7,
      "replies": {
        "hfqbc86": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqbc86/",
          "text": "> I mean, if you're basically looking for a tightly-focused information feed that you can passively follow, I don't think reddit is the social medium for you.\n\nReddit is exactly the medium for this. You can create and join subreddits about the most niche interests imaginable and find other users with similar tastes. That point aside, I don't even think having an online community geared towards literally all humanities professionals is \"a tightly-focused information feed.\"",
          "author": "Durendal_et_Joyeuse",
          "created": 1633616017,
          "upvotes": 8,
          "replies": {
            "hfqhzay": {
              "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqhzay/",
              "text": "niche tags on insta/twitter are way more active than niche subs on reddit. \n\n> having an online community geared towards literally all humanities professionals is \"a tightly-focused information feed.\"\n\nif there were people on reddit up for this, it would've already happened tho",
              "author": "thegreenaquarium",
              "created": 1633618924,
              "upvotes": 1,
              "replies": {
                "hfqj1mr": {
                  "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqj1mr/",
                  "text": "> niche tags on insta/twitter are way more active than niche subs on reddit.\n\nGuess it depends? But still, why not have both? (Though, personally, I don’t see how one could engage with others in an academic field over Instagram.)\n\n> if there were people on reddit up for this, it would've already happened tho\n\nThis complaint (“Is everyone here STEM?!”) comes up constantly in academia subs: /r/gradschool, /r/academia, /r/askacademia, etc. I think people would join if a sub like that were created. Whether it’s a bustling community is another matter. Fortunately, the cost of clicking a few buttons to create a new community is infinitesimal, having done it myself (/r/LatinLanguage).",
                  "author": "Durendal_et_Joyeuse",
                  "created": 1633619376,
                  "upvotes": 1,
                  "replies": {
                    "hfqs4y6": {
                      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqs4y6/",
                      "text": "Promoting the community constantly for months, tho...\n\n> (Though, personally, I don’t see how one could engage with others in an academic field over Instagram.)\n\nThat's the point: OP seems to not want to engage (otherwise they'd just... post an OP here with whatever question they have?), but to passively follow other people's posts. Insta/twitter are ideal for that.",
                      "author": "thegreenaquarium",
                      "created": 1633623140,
                      "upvotes": 0,
                      "replies": {
                        "hfqtser": {
                          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqtser/",
                          "text": "> Promoting the community constantly for months, tho…\n\nYeah, it can be tricky to get users to join. “Promoting constantly” might be overstating how much effort is involved, though.\n\n> Insta/twitter are ideal for that\n\nI meant that I don’t know how one would find content to related to a humanities field on Instagram, unless you specialize in a visual subject, like art history or archeology or something. Even then, academics aren’t really discussing things on Instagram tags. You’ll mostly find junk shared by “laypeople.” \n\nI still don’t quite understand this distinction between social media sites based on how “passive” or “active” the user experience is. You can get on reddit and “passively” consume all the posts you see without commenting on anything. Millions of users do that. People on this website like to describe it as “lurking.”\n\nOne could ask, do you only follow subreddits that you *actively* post and comment in? I am subbed to tons of communities that I never participate in but interest me enough to follow them and see the discussions there.",
                          "author": "Durendal_et_Joyeuse",
                          "created": 1633623809,
                          "upvotes": 1,
                          "replies": {
                            "hfr3s2k": {
                              "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfr3s2k/",
                              "text": "> \nI meant that I don’t know how one would find content to related to a humanities field on Instagram,\n\nAre you at all familiar with Instagram? Because I follow tons of academia and humanities academia accounts that have nothing to do with visual art. They make text posts about a variety of subjects as pictures, or accompanied by pictures.\n\n> Even then, academics aren’t really discussing things on Instagram tags.\n\n...yes they are. I mean, not to be rude, but do you know what you're talking about or are these layman musings?\n\n> I still don’t quite understand this distinction between social media sites based on how “passive” or “active” the user experience is.\n\nThe distinction is that you can personalize your instagram or twitter by user or tag, which is much more precise than by subreddit. If OP wants to consume very specific content, that's the more efficient way.\n\n> \nOne could ask, do you only follow subreddits that you actively post and comment in?\n\npretty much",
                              "author": "thegreenaquarium",
                              "created": 1633627855,
                              "upvotes": 0,
                              "replies": {
                                "hfr4h7n": {
                                  "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfr4h7n/",
                                  "text": "> Are you at all familiar with Instagram? Because I follow tons of academia and humanities academia accounts that have nothing to do with visual art. They make text posts about a variety of subjects as pictures, or accompanied by pictures.\n\nWould you mind sharing some of those accounts? I’m not familiar with any, to be frank, especially related to my field (medieval studies), though I am very familiar with Instagram itself. I would be very happy to follow academic humanities accounts that you can recommend.\n\n> not to be rude, but do you know what you're talking about or are these layman musings?\n\nIt is a bit rude, but I don’t mind. I am an academic who is unfamiliar with what you’re referring to.\n\n> The distinction is that you can personalize your instagram or twitter by user or tag, which is much more precise than by subreddit. If OP wants to consume very specific content, that's the more efficient way.\n\nA general community geared towards literally all humanities professionals is not “very specific content.” I think you’re reaching even more than you originally were to find something wrong with OP’s point.\n\n> One could ask, do you only follow subreddits that you actively post and comment in?\n\n> pretty much\n\nThen you are not very typical as a reddit user, I think.",
                                  "author": "Durendal_et_Joyeuse",
                                  "created": 1633628143,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfqaf9f": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqaf9f/",
      "text": "Yeah, almost every post is about lab this PI that…",
      "author": "toru_okada_4ever",
      "created": 1633615591,
      "upvotes": 2,
      "replies": {}
    },
    "hfqaw87": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqaw87/",
      "text": "TIL this sub lacks humanity",
      "author": "UnusedSheep",
      "created": 1633615810,
      "upvotes": 2,
      "replies": {
        "hfqwjgd": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqwjgd/",
          "text": "it really does though",
          "author": "coquelicot-brise",
          "created": 1633624908,
          "upvotes": 2,
          "replies": {}
        },
        "hfu60cw": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfu60cw/",
          "text": "Have you tried reformatting it in LaTeX?",
          "author": "Gulbasaur",
          "created": 1633688085,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfqpsq5": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqpsq5/",
      "text": "Humanities PhD here. I engage a bit on Twitter, but it's almost all traditional social networking/career building and clearly not anonymous. \n\nWhile their are fewer Humanities posts here, they do exist, and if you search through old threads you will find a lot of information.",
      "author": "gggggggggggfff",
      "created": 1633622193,
      "upvotes": 1,
      "replies": {}
    },
    "hfqtanp": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqtanp/",
      "text": "ITA.  I find this to be the case is most discussions, chronicle included.",
      "author": "Unfair_Finger5531",
      "created": 1633623609,
      "upvotes": 1,
      "replies": {}
    },
    "hfqwg55": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqwg55/",
      "text": "https://i.imgur.com/R1fdEt3.gifv\n\n5th year PhD student in Med Anth here, we exist.",
      "author": "Brojangles1234",
      "created": 1633624870,
      "upvotes": 1,
      "replies": {}
    },
    "hfopfi5": {
      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfopfi5/",
      "text": "Join stem",
      "author": "grandpassacaglia",
      "created": 1633575915,
      "upvotes": -83,
      "replies": {
        "hfopvoi": {
          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfopvoi/",
          "text": "God that sounds hideously unappealing. Sorry, didn’t mean for that to come out so harshly.",
          "author": "astute_canary",
          "created": 1633576179,
          "upvotes": 50,
          "replies": {
            "hfox96g": {
              "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfox96g/",
              "text": "same can be said about humanities. Humans are yucky. Their biological machinery however...fascinating!",
              "author": "ale890",
              "created": 1633580400,
              "upvotes": -39,
              "replies": {
                "hfp0yhj": {
                  "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfp0yhj/",
                  "text": "I think your comment is part of why the prospect of joining STEM is unappealing.",
                  "author": "astute_canary",
                  "created": 1633582550,
                  "upvotes": 36,
                  "replies": {}
                },
                "hfplcxd": {
                  "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfplcxd/",
                  "text": "I find the opposite. Glorified applied maths with neither soul nor subjectivity? Nah thanks, I'll go dig around in wonderfully complex social structures instead, much more interesting to me.",
                  "author": "Omnicide103",
                  "created": 1633600154,
                  "upvotes": 11,
                  "replies": {
                    "hfqybyz": {
                      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfqybyz/",
                      "text": "Come be an ecologist, wander around gloriously complex structures of a different kind 🙃",
                      "author": "OrbitRock_",
                      "created": 1633625631,
                      "upvotes": 2,
                      "replies": {
                        "hfug0ym": {
                          "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfug0ym/",
                          "text": "yeah but i can't talk with ants about their perspective on social structures and marvel at the staggering amount of  intersubjective viewpoints you feel",
                          "author": "Omnicide103",
                          "created": 1633695270,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "hfpxg7e": {
                      "link": "/r/AskAcademia/comments/q2zl3u/is_there_a_place_like_this_sub_for_people_who/hfpxg7e/",
                      "text": "Glad I don't have to do any math in my science!",
                      "author": "ale890",
                      "created": 1633608991,
                      "upvotes": -8,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}