{
  "sid": "pfbefi",
  "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/",
  "title:": "Another leaving academia post: how to deal with guilt?",
  "text": "I've been in academia for most of my working life. I did my bachelors, took a year off to volunteer in field ecology studies, went back for my masters in evolution, and then took a few years off to work as a bioinformatics help, and then went back for my phD. I feel like all along, I kind of knew academia wasn't for me? But not just academia, doing research wasn't really for me. I didn't have the burning drive or the vision, I didn't want to know the answer so badly, and my mental health throughout the whole time hasn't been great. But honestly  it's been so long, I kind of don't know how to feel about not doing research. It's basically what I've been training for my entire life. I know mentally that people do other jobs, and I'd never look down on people doing other jobs, but doing other jobs just feels like a step down. It feels like I'm not trying hard enough when I'm not doing research, and it's literally what every single person I know around me is doing (ok, not everyone, but everyone at work is). I feel like kind of a failure for not wanting to be a scientist, something that I genuninely wanted to do when I first started graduate school about a decade ago. But I think I tried, hard, to be that. I've been thinking about applying for FAS positions, and I think I could be good at it. I think I'm interested in the commercial and sales aspects of biotech, and I'm still interested in science in general, just not necessarily in the actual day to day making it work kind of way. I know it's not bad per se, but I feel so bad, like I've failed all my mentors throughout grad school who wouldn't want this path for me. I also worry that people would look down on me? Like again, I think it's in my head, but even though I could possibly attempt to rebrand myself as a data scientist or something, I feel like I just don't have the drive, and for some reason that really gets at my identity as a smart problem solver. did anyone else face a crisis in identity as they contemplate leaving academia? How did you resolve it? It's like a big scary chasm outside of academia and I feel like I'll possibly be very bad at it, but it's also exciting and I could also be really good right?",
  "author": "yenraelmao",
  "created": 1630433404,
  "updated": 1634079437,
  "over_18": false,
  "upvotes": 131,
  "upvote_ratio": 0.98,
  "comments": {
    "hb37qve": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb37qve/",
      "text": "I got into biology because I was good at it at school. No magical moment no exceptional drive to uncover the mystery of nature blah blah. I did my Bachelors and masters and did a PhD kind of because “ everyone did it” after PhD I stumbled across a posting for a postdoc with a quite interesting topic and did that and now work in industry. What I want to say with that it’s totally ok to treat research like an ordinary job. There is nothing special about it if you do not feel special about it and that is totally fine. Academia conditions you to believe that you “sacrifice for humanity” and that “basis research is the only true calling”.\nDo what you enjoy in the best way you like it. F*** everything else. It’s fair to change what you want to do in life and real friends will support you in that",
      "author": "CreepyBumblebee31",
      "created": 1630434753,
      "upvotes": 90,
      "replies": {
        "hb3nplg": {
          "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb3nplg/",
          "text": "Sounds like my career!\nDid a BSc in biology because I was good at it and genuinely enjoyed it. Followed it up with an MSc because it was funded and didn’t know what else to do, this led to a PhD and subsequent PostDoc in the same field (Applied Plant Molecular Biology) but enthusiasm waned throughout. Looked for other industry jobs and found a Tech Support job at a nearby BioTech unicorn and haven’t looked back since. Money is infinitely better and nothing beats the feeling of shutting down the laptop at 5:30 on Friday and forgetting all about work till Monday at 9:00. \nAcademia is for a select few and the sooner you work out if that is or isn’t you the better. Wish I’d moved before the Postdoc, not PhD, I met my wife there.",
          "author": "DocGoodall",
          "created": 1630441548,
          "upvotes": 20,
          "replies": {}
        },
        "hb391tp": {
          "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb391tp/",
          "text": "> conditions you to believe that you “sacrifice for humanity” and that “basis research is the only true calling”. Do what you enjoy in the best way you like it. F*** everything else.\n\nPreach!  I just started my PhD and have a professor spouting the whole, \"this program is your life now\" story.  I'm treating it like a 40-50 hour work week and no more than that.  I fell for the toxic work culture in law school before and refuse to do it again.",
          "author": "92taurusj",
          "created": 1630435287,
          "upvotes": 36,
          "replies": {}
        },
        "hb6jmga": {
          "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb6jmga/",
          "text": "Came here to say this. \n\nI owe no loyalty to the institution of academe. I am just grateful it allowed me to sleep in whenever I wanted while getting a paycheck that’s mostly livable.",
          "author": "sweetypantz",
          "created": 1630500825,
          "upvotes": 3,
          "replies": {}
        },
        "hb6mhr3": {
          "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb6mhr3/",
          "text": "That's what I am doing these days. I used to stress a lot at the beginning of my phd but now I treat it like a job and don't take undue stress. I often feel like academia isn't for me, but I don't feel like something else is for me either. I plan to do a post doc after this to explore more.",
          "author": "awkwardkg",
          "created": 1630502241,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hb385bz": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb385bz/",
      "text": "I have a sort-of similar dilemma. I'm in permanent postdoc mode at the moment (\"research associate\", aka postdoc with retirement benefits but still soft-money dependent). I get my work done, I rather enjoy some parts of it, but am relatively unhappy. Much of it, I think, is my lab. There have been some personnel shifts in the last few years and now the lab (get ready for my ageism) is full of gen Z-ers who never take their headphones off. \n\n*in my day* (to be read crustily), the lab was a place for banter and silliness and joking around. It was great. Maybe our experiments would fail, but at least we could all laugh about it together, and then troubleshoot as well. \n\nThese days I may as well be the only person in the lab, even when there are 5-6 people there. If I try to start a conversation, the recipient has to take 10s to take off their headphones, which often also means de-gloving, and it just ends up not being worth it. I get it, I suppose, who wants to have banter with the 40yo dad when you're some 25yo schmuk? \n\nBut man, it makes work life depressing. \n\nSo I work from home most days, because I'm the main coder. Some days thats nice, others depressing. \n\nI think a change of pace would be a good thing for me. A very good thing. \n\nBUT BUT BUT.  I have such flexibility in my job right now. Many days I am taking off early to cart kids around; I can take time to just learn; etc. What other job has that sort of flexibility? Not corporate industry. So what to do? I keep my head down, do my work, and try to shake off the work depression when I \"go home\" at 430 or 5.",
      "author": "forever_erratic",
      "created": 1630434916,
      "upvotes": 30,
      "replies": {
        "hb5wszf": {
          "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb5wszf/",
          "text": "> What other job has that sort of flexibility\n\nmany/most white collar jobs that require an advanced degree, tbh. Especially if you're an in-demand professional, like a coder. Especially if you're not completely entry-level. In the private sector, the workload is usually pretty high, but there are fewer and fewer expectations now about office hours, how you manage your work-life balance, etc. In government, nobody does any fucking work. \n\nI see a lot of K-PhD people who have been sold a total bill of goods about \"job flexibility\" by boomer-generation parents and professors who are coming from 1950s job market priors. And they very much love their job flexibility while they're sprinting to the lab at 9 PM on a Saturday to check on their mold samples. What kind of bullshit Stockholm Syndrome is that??",
          "author": "thegreenaquarium",
          "created": 1630484494,
          "upvotes": 7,
          "replies": {
            "hbcdnpr": {
              "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hbcdnpr/",
              "text": "They're also imagining some mythical Cubicle World drawn from 1970s and 1980s movies about work and nothing that actually approximates the modern \"industry,\" which is a catch-all term that encompasses hundreds of fields and thousands of workplaces. What level of flexibility you have depends far much on where you work and what you do than working in \"industry.\"",
              "author": "roseofjuly",
              "created": 1630605322,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hbcdh08": {
          "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hbcdh08/",
          "text": ">any days I am taking off early to cart kids around; I can take time to just learn; etc. What other job has that sort of flexibility? Not corporate industry.\n\nYeah, I feel like this is a common myth amongst academics - I heard it a lot when I was in academia - but it's not really true. I work in the tech industry, where most of the companies and jobs have this kind of flexibility, and most of my friends in white-collar professional jobs have some degree of this level of flexibility. Many jobs will pay for you to learn even things that are tangentially related to your job.",
          "author": "roseofjuly",
          "created": 1630605241,
          "upvotes": 3,
          "replies": {
            "hbcfod6": {
              "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hbcfod6/",
              "text": "I appreciate the view from the other side!",
              "author": "forever_erratic",
              "created": 1630606151,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hb5qb64": {
          "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb5qb64/",
          "text": "Maybe you should establish a bit of a coffee room culture, with pre-announced cake events an such things? I'm in my mid-30s, and I do consider it impolite to start a conversation with someone who's wearing headphones.",
          "author": "ColourlessGreenIdeas",
          "created": 1630478949,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hb38h6p": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb38h6p/",
      "text": "I've seen a lot of people express similar feelings, for what it's worth. If it's helpful to hear from some rando: your brain has been *royally* fucked with to make you feel this way. It's your life we're talking about, how utterly mad is it to feel that guilt and shame for not spending it on one particular, and deeply criticizable, field like academia? It's a job. It's organizations with pointy-haired bosses making way-too-much money. The romantic ideal of it isn't the reality for most people. If you want to identify as smart, be smart enough to choose to do what you think will suit you best!",
      "author": "waterless2",
      "created": 1630435049,
      "upvotes": 33,
      "replies": {}
    },
    "hb3sk6d": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb3sk6d/",
      "text": "I feel like an academic career track takes so much commitment that it becomes part of our identity, and that can make things feel really personal. The longer I am out of academia, the more I realize how pervasive that mindset is. I also keep peeling away layers of how problematic it is. This is one of those layers.\n\nRemember, this is a job. You are not your job. Nothing you’re doing is shameful and you haven’t failed your mentors. This isn’t because you’re not not good enough or whatever, it’s simply pursuing a career you find more fulfilling. And it can be more fulfilling for any reason that’s important to you. Better pay or work/life balance are legitimate reasons to be satisfied with a job. Day-to-day work is a legitimate reason. Location is a legitimate reason. \n\nPeople change fields all the time without guilt or feelings of failure, and the same should apply here. If you find a job that sounds good to you and you think you’ll enjoy it, you deserve nothing but hearty and sincere congratulations for your success.",
      "author": "StringOfLights",
      "created": 1630443480,
      "upvotes": 22,
      "replies": {
        "hb4j9ih": {
          "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb4j9ih/",
          "text": "You're not your fucking khakis,",
          "author": "kevinbsmith006",
          "created": 1630455263,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hb37j2e": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb37j2e/",
      "text": "There is a Facebook group called The Professor is Out that you might find helpful",
      "author": "spicyginger",
      "created": 1630434666,
      "upvotes": 14,
      "replies": {}
    },
    "hb49vpr": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb49vpr/",
      "text": "I’m an assistant prof who just started a 2nd tt position after leaving the first halfway through the contract. I love research, always did, but I don’t think academia allows (some of) us to do the research we truly care about because of time, politics, indexes, making tenure, etc and I’ve felt miserable. In my first job, I was unhappy about pretty much everything. Politics, the new provost who denied everyone tenure, the bean counting metrics, and academics sitting around and only discussing things like citation counts and impact factors rather than anything of actual substance. Everyone looked down on everyone else and everyone was miserable. So I changed my job/field to a professional school field and believed things will get better. Turns out my new school has even more rigid dynamics. Bean counting to the max, nobody getting tenure, and even worse, nobody talks to anyone else except for the handful of full professors with power who tell you you are crap in your face. At least I had other assistant professors to occasionally grab a beer with in my first job…here it’s pure apathy…(which I guess is still better than some other nightmare departments). We just had a face-to-face meeting first time in more than a year last week and nobody even bothered to ask how each other is doing. I mean, I seriously don’t think I want to be surrounded by people like this for another 30 years. We sacrifice so much to be academics but don’t even get the basic respect as human beings. After trying all this time, I think I’m finally out…",
      "author": "Overall_Designer7502",
      "created": 1630450929,
      "upvotes": 15,
      "replies": {
        "hb5k1uf": {
          "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb5k1uf/",
          "text": "Holly sh**, that is a really toxic environment.",
          "author": "focksfirst",
          "created": 1630474248,
          "upvotes": 3,
          "replies": {
            "hb5m4ct": {
              "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb5m4ct/",
              "text": "But then I’ve heard of/ witnessed departments that are literally falling apart because of infighting.. My grad department was one of them where different faculty/grad factions were out trying to kill each other. Theoretical fights, fights over professors sleeping with grads, fights over some professors screwing careers of their enemies’ students, fights over tenure. I buried my head in my books and worked my ass off to get out asap. I’ve been in more civilized departments since but the basic contours aren’t too different. Honestly if the job market was a bit more flexible, I won’t mind it as much, but job hopping is almost impossible as my field is basically dead.",
              "author": "Overall_Designer7502",
              "created": 1630475731,
              "upvotes": 4,
              "replies": {
                "hb6a6fv": {
                  "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb6a6fv/",
                  "text": "yeah similar at all four departments/unis i have worked at, nobody cares about new science. it's all about hiring similar people to increase the number of people in some group vs somebody else's group\n\nnever been on a hiring committee (i'm not faculty), but i'd probably be the only one there saying, \"hey, let's hire the candidate that does something none of us already do\"",
                  "author": "radionul",
                  "created": 1630495362,
                  "upvotes": 2,
                  "replies": {}
                },
                "hb5tm3k": {
                  "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb5tm3k/",
                  "text": "What field is it if you don’t mind me asking?",
                  "author": "ruechan",
                  "created": 1630481681,
                  "upvotes": 1,
                  "replies": {
                    "hb6arl0": {
                      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb6arl0/",
                      "text": "I’m in the social sciences",
                      "author": "Overall_Designer7502",
                      "created": 1630495751,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hb3hz6r": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb3hz6r/",
      "text": "Are you currently in a TT position? If not, then now is the time to get out. The absolute worst part of academia is job landing process, and then the first six years of a TT position. Until that 6 year mark, everything you have done in school is just ramping up for the hardest period of your career. While I personally am super happy with my current life (assoc. prof), I can honestly say that I missed about a decade of life that all my friends enjoyed. That 10 years took a serious toll, and I am behind on all the normal life stuff, i.e. I only just had a kid and all my friends' youngest kids are like 7-10 years old. One additional thought: it really seems like we are entering a time when academia is being rapidly eroded. Raises are meager, living standard is declining, and I will not be in the least bit surprised if tenure doesnt last my whole career.",
      "author": "titosphone",
      "created": 1630439202,
      "upvotes": 13,
      "replies": {}
    },
    "hb3sspw": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb3sspw/",
      "text": "I'm a  prof in n ecology, I've got a permanent position in a very good university. And honestly, every other day I think about leaving academia but I'm not sure what I would work on.  Maybe work in a NGO or government?  I honestly don't know. I find it unlikely that I have skills for industry. Do you know what I really wish - to have a job that you can go on holidays and not be under a f..ing pile of work on the way back.  I sometimes also wish I wasn't in a job that I'm so poorly trained for. I've trained as a scientist but what I do is people management (undergrads, msc, phd, postdocs), budgeting and filling in forms.  Sure, what my students see are the flashy papers,  the grants,  the trips to the field.  What I see is forms, forms, forms... if you don't love it, leave it and don't look back.",
      "author": "WhoMeNoMe",
      "created": 1630443577,
      "upvotes": 12,
      "replies": {
        "hb8e0mb": {
          "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb8e0mb/",
          "text": "Thanks for the advice. So far I am much much happier in a new job and don't expect to look back at academia with any favour.",
          "author": "ColdEvenKeeled",
          "created": 1630528551,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hb4hm95": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb4hm95/",
      "text": "I spent over a decade wanting to be a professor. I tried industry and threw that professor dream in the trash within a few months.\n\n70(?) years from now you're gonna be dead, and you'll have never felt you lived long enough to do everything you ever wanted. Life is just too short to worry about what your mentors want you to do; do what you want to do.",
      "author": "SoupaSoka",
      "created": 1630454505,
      "upvotes": 10,
      "replies": {}
    },
    "hb45a8p": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb45a8p/",
      "text": "The \"guilt\" will resolve as soon as you have new context, in the form of people around you who are not academics and who have completely different (from academics) interests and priorities.\n\n> I feel so bad, like I've failed all my mentors throughout grad school\n\nIt's your life, not theirs.",
      "author": "mohishunder",
      "created": 1630448877,
      "upvotes": 9,
      "replies": {}
    },
    "hb58p1h": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb58p1h/",
      "text": "A friend of mine said academia was kind of a cult. That’s why there is so much felt guilt leaving it. It was meant to be a joke but I think it has def some truth to it. \nMaybe start hanging out with people outside of academia, that might help you realize how priorities and professional identities vary. And your experience in academia is part of you but cannot be your whole identity.\nAlso forget about failing your mentors, there are not enough tenure track jobs for even 10% of PhDs. What are people suppose to do? If any mentor looks down on you, it means they are either pretentious or has no idea about current reality.",
      "author": "Master-Movie9270",
      "created": 1630467420,
      "upvotes": 6,
      "replies": {}
    },
    "hb6daeo": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb6daeo/",
      "text": "I made the switch to Industry and would never go back if I have the choice. I’m at a startup which has its own learning curve and there have been hard times for sure and I still think it’s better for me. It’s faster paced, results focused and there are opportunities beyond the bench in operations, project management and more that will use the skills and knowledge you already have. I personally am interested in moving away from science altogether because I’ve always been equally split between art and science. Since financially I can’t do anything drastic, a company pays more and has more opportunities while I figure out what’s next. There’s much less of the martyr complex that’s expected in academia, at least in my experience so you hav time and energy to pursue other things besides work. Best wishes to you in your journey! I hope this might help",
      "author": "Lizzi53",
      "created": 1630497342,
      "upvotes": 4,
      "replies": {}
    },
    "hb4zniq": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb4zniq/",
      "text": "You have built a narrative for yourself and want to transgress that narrative. The good news is that the narrative is made up. By you. The bad news is you've been telling it to yourself for a long time. The only one who can convince you that you can lead a fulfilling life without having a particular job is you.",
      "author": "aworldwithoutshrimp",
      "created": 1630462846,
      "upvotes": 9,
      "replies": {}
    },
    "hb4r6hk": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb4r6hk/",
      "text": "Its your life dude, don't feel like you need to live it for anyone but YOU. Life is short and typically cruel. Wring as much joy and contentment as you can out of it and don't for a second feel guilty about it.",
      "author": "k1llfasheverywhere",
      "created": 1630458953,
      "upvotes": 3,
      "replies": {}
    },
    "hb5tzyr": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb5tzyr/",
      "text": "Are you me? I'm feeling the same things.",
      "author": "asstprofthrowaway",
      "created": 1630482009,
      "upvotes": 3,
      "replies": {}
    },
    "hb3fsht": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb3fsht/",
      "text": "You say you wouldn't look down on anyone doing a different job but I think from what you've written here, it's clear you do. You are quite prejudiced about other jobs and you see them as lesser than academia. I don't say this to be mean but because I think you're unhappy with the current situation but aren't going to be able to constructively move on before you make peace with the move. \n\nIf you can afford to I suggest getting some professional coaching. You can work through what kind of job might appeal to you and start setting yourself some goals about what success in a new career might look like (pay, vacation, linked to academia, linked to STEM, city you like etc). If you can't afford it, I suggest you try a decide what a good job would look like and work towards it. You need to switch out of the mindset that anything outside academia is a step down. \n\nSomething you might want to look at in terms of careers is tech transfer. It's a common sideways step for scientists and it's a job that combines a need for good scientific expertise with intellectual property and commercialisation strategies. It ultimately can pay quite well, while also being a job you can get into with relatively little experience and gives you a bunch of career opportunities. FWIW I think once you find a job you enjoy you'll wonder what the hell you were ever thinking.",
      "author": "ACatGod",
      "created": 1630438272,
      "upvotes": 9,
      "replies": {
        "hb3ir9g": {
          "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb3ir9g/",
          "text": "thanks for your honesty. I think tech transfer is an interesting area I will look into.",
          "author": "yenraelmao",
          "created": 1630439538,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hb5y1kb": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb5y1kb/",
      "text": "Ex-ecologist who quit in Year 5 of PhD. One of the hardest things about leaving was disentangling my identity from academia and research. The next was guilt about not seeing my dissertation research through (fieldwork was done, but lots of lab processing left). Luckily my PI was very clear that figuring out how to get the leftover work done was HIS job, not mine. You don't owe anyone anything, except maaaybe a \"thanks for all the fish.\" Just think of all the cheap/free labor you've provided universities over the years 😉😬\n\nFor what it's worth, every professor I told said something along the lines of \"good for you\" and a number of them said they'd known people who were too scared to quit and spent some miserable couple of years trying to finish their PhD, or even got TT jobs, only to quit later. \n\nThere are PLENTY of careers out there that need smart problem solvers, and you don't have to have it all figured out tomorrow. Chances are if you've stuck it out this long, you've got some major skills that will help you anywhere- including resume-type skills (helllooo project management!), but also just plain effective working skills, like initiative and independent learning.\n\nAlso strong recommendation to find a therapist if you haven't already. The thing about guilt is it only works if you let it in.",
      "author": "icebugs",
      "created": 1630485607,
      "upvotes": 2,
      "replies": {}
    },
    "hb64d8s": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb64d8s/",
      "text": "Yeah, I have that feeling: I could work harder of course but at a certain point, you want a reward. I have been on temporary contracts since finishing my PhD and it burns you out. You cannot become part of a community because you change Uni every year, you do not get the benefits of being at one place, and 3 months in the job, you already need to be on the lookout for the next job. \n\nIf you see then people get cushy jobs without too much effort, and your applications go unanswered, you get depressed. At the moment (with an arts degree), I am trying to get into the arts residency circuit itself, like doing residencies the whole year round. It also takes a lot of effort but at least I feel I am doing it for myself rather than some PI with the permanent contract. I have done residencies before but never saw it as a full-time job. If I am going to be precarious, I'd rather do it on my own terms.",
      "author": "frugalacademic",
      "created": 1630491139,
      "upvotes": 2,
      "replies": {}
    },
    "hb6cjld": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb6cjld/",
      "text": "Academia is not right for everyone, and not everyone is right for academia. There is no shame in not wanting to work in academia.\n\nIn fact, one of my doctoral students the other day said to me that they aren't really interested in being a professor - they also had a clear plan for what they want to do after finishing. Honestly, it was really refreshing to not have to give the \"Job market sucks, have a back up plan\" speech.",
      "author": "GoldenBrahms",
      "created": 1630496886,
      "upvotes": 2,
      "replies": {}
    },
    "hbdmfbp": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hbdmfbp/",
      "text": "I feel you, you are not wrong or a bad scientist. It is ok to treat this job as a job. \nMy story is the same:\nI accepted to do the PhD because I saw the opportunity to have a 3 years contract without worrying about to find a job. The PhD in STEM was brutal, with no training, no support, and a ridiculous amount of work. I was exhausted, I am exhausted. I gave to myself the opportunity to try a one-year postdoc. The story did not change: no training, no support, and a lot of mistakes. I failed it for them (PIs) because I was not interested in publishing papers or my priority was to enjoy my life during the weekend. I also consider my research very poor ( don't really like reading papers), and honestly, I am not so interested in discovering something special. I saw PI with retracted papers still applying for a professorship, and I worked with a well-known PI who just tried to submit a paper only based on western blot ( which I consider a very unreliable technique) on an IF: 30 journal because he put his editors \" friends\" on it as corresponding authors. I don't believe that academia produces good science. I enjoy doing experiments, and I am very good at working with animals, but not for the sake of science, probably because I like to \" play with things\". I was changing job at the end of the one year postdoc when my PI offered me a very well paid other 2 years postdoc. It was a matter of luck because he got a huge grant. Honestly, I just looked at the money. I started to avoid this toxic and workaholic environment. Once they asked me to work for free in a gap month between the two contracts for the \"sake of the project\", I told them that I was happy to delegate to someone else because I had personal things to do in that month. They were very disappointed, but it is a job for me. I need to take care of my mental health ( totally fucked up during the PhD).\nIn my big picture I will move to industry. \nDon't feel guilty.",
      "author": "Visual-Snow4057",
      "created": 1630624215,
      "upvotes": 2,
      "replies": {}
    },
    "hb6as61": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb6as61/",
      "text": "Most people don't stay in academia. I grew up wanting to be a mathematician since I was a kid - it was hard coded into all my life decisions from a very early age. What helped me was knowing other people who left academia and are much happier. Now that I'm not an academic anymore I get it; I'm much, much, much happier now too. Academia doesn't hold a monopoly on smart people or meaningful work :)",
      "author": "Pentagonal_Plankton",
      "created": 1630495761,
      "upvotes": 1,
      "replies": {}
    },
    "hb6c1kq": {
      "link": "/r/AskAcademia/comments/pfbefi/another_leaving_academia_post_how_to_deal_with/hb6c1kq/",
      "text": "Do you have a masters in evolution? A masters in a theory? I don’t understand…",
      "author": "Necessary-Employer23",
      "created": 1630496569,
      "upvotes": 1,
      "replies": {}
    }
  }
}