{
  "sid": "qwv533",
  "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/",
  "title:": "I was forced to quit my PhD. How can I approach to reapply?",
  "text": "Hi all, \n\nFirst off thanks in advanced for responding/reading my post. Like the title suggest, I recently quit my PhD and I am now applying for new PhD programs. And I am worried that I will not get into any and I am posting my story to see if anybody else experienced a similar situation/what you did also to seek advise. \n\nSo I joined this person's lab (I'm going to call this person (PI) X). X's lab had history a couple of students left X's lab before. I joined with another student and I was very exited about the research and everything sound great. Soon after covid happened and everything was online. The first couple of months were great. I was learning and I was enjoying my time as a grad student. \n\nThen I noticed that X started giving a hard time to this other student during our meetings. I felt uncomfortable even seeing this. X has a history of being mean to students but it was the first time I experienced it. Often X was badmouthing the other student with me saying that he/she don't have the aptitude to finish the PhD. I absolutely hated listening to this but at this time I didn't say anything because I was worried that our relationship will fail (X and me) because it was pretty good. Then the other student decided he/she no more wants to continue with X and he/she left the lab. For a bit X was calm because another student left. \n\nAfter a while I felt like I was now getting the same treatment as the previous student who left. All started when X started shouting at me for not doing a good job in a lab presentation. X was talking more about him/herself rather than my presentation. X was talking about how it is bad for X's reputation. Not about how I should improve. I was very upset and I almost was planning to leave but X convinced that I should stay because I don't think he could afford to lose another student. Since then everything was going downsouth for me. Now all the blame, criticism and anger was on me. Once i was talking about a specific phenomena in our lab meeting and I remember X ridiculing that I was wrong. In fact X called me later and was shouting at me for not being curious to learn. The funny thing was I was correct about what I was talking and X was wrong and then later X tried to blame that on me too. Anyways, my point is everything started being very unpleasant for me and I was very discouraged. And our relationship got worse and worse. No other student wanted to join X's lab and X only had a bunch of volunteering undergrads and me. \n\nAfter a while X asked me to leave with a master's. I felt like X was pushing me to graduate with a masters because X didn't want another student leave X's lab and be successful. Anyway I graduated with a masters because I was very frustrated at that time and didn't know what to do. \n\nAll of this being said, I do have to give X credit for the things I learnt while I was there. Because of that I am able to independently study and do research on my own. In fact I now have a job in a field that is not related to what I was doing ( partially related but not fully) because I was able to completely do indpendent work in the area and be a competitive applicant for the job. But it was so hard mentally now I am thinking why I went through all that. Covid was hard enough but with all this i was struggling. I recently met the other student (Who seems to be doing really well in the other lab) and he/she said that they are visiting a therapist because they felt so unmotivated after the incident with X. i felt the same thing. I felt so dissapointed about myself (X made sure of that). And I was a grown young man crying at home sometimes. It was mentally so hard. Although I really hate to play this mental issues card (Which seems to be pretty common these days) I was really depressed and it was really a hard time.\n\nMy new boss has been great (at work). And after working with him I have regained the confidence I lost. He even introduced me to a couple of professors in some universities. So I am planning to reapply as a PhD student to continue. (I really believe that I can complete this and i do believe I am capable of doing this). But I am worried that as soon as the admissions committee sees that I left with a master's that I am going to be in a disadvantage. \n\nOf course, I understand that nobody is going to take my side on this. Obviously I also had a lot of issues according to X. So you'd have to listen to X's story to get a full picture. \n\nSo my question, is how can I approach a new program. I have applied to a few programs and I am not confident that I will get in. I am really stressed out about this. \n\nAny advise? \n\nP.S- \n\nI am not here to get sympathy from anybody or just get validation. I just want to hear any stories if same happened to you and if so how did you overcome oall this. \n\nThank you so much!!",
  "author": "Mundane-Option3999",
  "created": 1637257343,
  "updated": 1637353656,
  "over_18": false,
  "upvotes": 63,
  "upvote_ratio": 0.91,
  "comments": {
    "hl6f4ze": {
      "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl6f4ze/",
      "text": "You got a master's degree and now you are applying to PhD programs.  This is totally normal.  It might look a little weird that you don't have a letter from X, but you were able to get into the original PhD program without X's letters.  I wouldn't be too worried.  Also, X's behavior is not normal and next time you encounter someone treating you like this, you should tell them to go fuck themselves.",
      "author": "ndstatistician",
      "created": 1637273947,
      "upvotes": 35,
      "replies": {
        "hl6mwsq": {
          "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl6mwsq/",
          "text": "Thank you for your response. I also don't want to sound like X was a total asshole. I learnt a lot and X has helped me to grow too. But the it was like mental torture for almost 5 months in the end and it wasn't worth it.  \n\nI wish you well with your work!!",
          "author": "Mundane-Option3999",
          "created": 1637277253,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hl5cuaf": {
      "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl5cuaf/",
      "text": "These things happen - schools will still consider your application, but they are going to want a little insight as to why you left and why you are returning. My advice is to not talk about any of the stuff in your post. Don't give them any reason to think you are a difficult person or that you are the type of person that will frequently gripe about your PI. Give it a more positive spin. Tell them you learned a lot while getting your masters degree and, at the time, felt that a move to industry was right for you. You've really enjoyed your time in industry and its been a wonderful experience. However, as you've gotten a little older and gained more experience, your career goals have changed and you'd like to get a Ph.D. degree. Tell them that the PhD will give you better training, improve your ability to develop projects independently, and provide better opportunities for leadership roles in the future. Be sure to sell your experience as a good thing (it is) - explain that your time in industry has given you broader experience in your field, improved your time management and organizational skills, and given you a unique perspective about how education and training can be applied in industry.",
      "author": "Carb-ivore",
      "created": 1637258730,
      "upvotes": 79,
      "replies": {
        "hl6mfb6": {
          "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl6mfb6/",
          "text": "Thank you for your response. It's glad to hear that. I had an interview recently with a professor and it went really well. Also I have some interviews coming up with professors soon. So I will just talk to them and won't talk about it. I don't want to badmouth anybody or say anything that's gonna be bad for my application.   \n\n\nThank you for your response. I wish you all the best with your work!!",
          "author": "Mundane-Option3999",
          "created": 1637277038,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hl6zja5": {
      "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl6zja5/",
      "text": "I'm sorry you had such a terrible experience. Nobody should go through that.\n\nIt's not uncommon for someone to get a Master's degree at one school and a PhD at another. I did that. It's not a disadvantage. You don't even have to go tell them that you were originally pursuing a PhD. Or tell them that you left for personal reasons. It's really not that big of a deal.\n\nGood luck moving forward. If you got in once, you can get in again.",
      "author": "bigrottentuna",
      "created": 1637282943,
      "upvotes": 9,
      "replies": {}
    },
    "hl7hvgw": {
      "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl7hvgw/",
      "text": "Dude did we have the same advisor? I left for exactly the same reasons and of course I won’t give names but my “X” was in california and tbh ever since I left (Dec of last year) I’ve been so much happier and felt like I wasn’t so worthless. I also felt like I could finish a PhD especially since I published a paper with hardly any revisions so it gave me that confidence I needed to know I could do the research. Even though ours PIs taught us a lot and supported us in some ways does not take away from the fact that we should have been treated with respect and that using a power dynamic against you to then belittle you is bullying. Simple as that. I decided to go into industry and stay there for now because the money is better anyway but I FEEL you like I want to go finish but it’s not monetarily worth it at the moment (like in the end I would probably end up making less even with a higher degree). A masters is a great accomplishment and a phd does not guarantee any prestigious job plus I’ve met so many idiotic phds that even now having the title doesn’t automatically make you look intelligent (which as a lady I was hoping to be respected by my title since that respect is not often given so easily to women). Depending on your specialty I would just tell you that you are good enough and that experience can make you the best. You have already learned all of the skills a PhD program gives you (writing, researching, lit review, careful construction of experiments, understanding confounds…) anything more is just a piece of paper…you’ve got the skills you don’t need the paper.  Just my opinion though!",
      "author": "birchesbcrazy",
      "created": 1637291370,
      "upvotes": 3,
      "replies": {}
    },
    "hl99pr9": {
      "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl99pr9/",
      "text": "The first year or two a PhD student still has to learn how to conduct lab experiments, how to write papers, do coursework, etc. which makes them less productive in the eyes of their PIs. You already got all that stuff done. That's a huge plus to any lab you apply to. If you have a paper or two published or written and you think they are good send them as well and I'm sure you won't have too much trouble getting accepted.",
      "author": "Tofu_tony",
      "created": 1637331729,
      "upvotes": 2,
      "replies": {}
    },
    "hl6nxxl": {
      "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl6nxxl/",
      "text": "First they came for the socialists,",
      "author": "xayde94",
      "created": 1637277702,
      "upvotes": 4,
      "replies": {
        "hl6ry7v": {
          "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl6ry7v/",
          "text": "Niemoller, relevant as always.",
          "author": "teacherofderp",
          "created": 1637279479,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl60a0b": {
      "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl60a0b/",
      "text": "what country? state?  what kind of school (state/private?)?",
      "author": "lalochezia1",
      "created": 1637267958,
      "upvotes": 1,
      "replies": {
        "hl6nqym": {
          "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl6nqym/",
          "text": "Thanks for your response. It's USA. I don't want to give any other information. \n\nBut seeing your title, it seems like you are a professor in USA. I'd like to hear your opinion about this. \n\nAlso I don't want to sound like I was the perfect graduate student. Obviously I had a lot to learn too and i learnt a lot from the professor. I really appreciated that. But getting criticized for almost anything, aggressive behavior and all of a sudden is something I couldn't tolerate. Maybe once or twice but not for a continued period of time. It's unacceptable. Also talking bad about other professors and students with me is unacceptable which this person did for a while. I almost felt like I was trying to satisfy the professor rather than trying to do research.\n\nAs a professor what is your opinion on this. What's your relationship with students.",
          "author": "Mundane-Option3999",
          "created": 1637277617,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hl8mw8c": {
      "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl8mw8c/",
      "text": "Sounds like my PI. Now you have a Master's and can apply somewhere else. Now you also know how to look for red flags. I wish you the best of luck, and a sane PI for your next PhD.",
      "author": "Normal_Kaleidoscope",
      "created": 1637318067,
      "upvotes": 1,
      "replies": {}
    },
    "hl8rkzt": {
      "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl8rkzt/",
      "text": "I’m in the same boat. Our PI’s sound like they were cut from the same cloth, some of your details are scary close to my own experience. I decided I had to get out, but they made switching labs impossible so I just left after a year. Luckily I made good connections with other faculty and have their LoRs to back up my competency and field Q’s about why I left. Sounds like you’ve already applied - but from discussions I’ve had with grad faculty the LoRs from the institution you’re leaving can lift a lot of weight off from leaving a program or nastering out. Other advice on leaving a bad lab and looking elsewhere, be optimistic. When I discussed switching labs before I left, the person I was trying to switch to said he didn’t take a post doc of his when they applied for a PhD because of how they came off in the interview. They were coming from a bad lab experience, jaded, stressed etc and it was off putting. I was so stressed, pessimistic, depressed, and mentally burnt out etc - so I get that it could be difficult. I’m trying to be confident, optimistic, and enthusiastic like I was the first time around.\n\nOddly comforting to know others have dealt with the same B.S. as I have, hope this helps & best of luck with apps",
      "author": "whitlicious",
      "created": 1637321590,
      "upvotes": 1,
      "replies": {}
    },
    "hl84ss8": {
      "link": "/r/AskAcademia/comments/qwv533/i_was_forced_to_quit_my_phd_how_can_i_approach_to/hl84ss8/",
      "text": "To other students, X's behavior is harassment and is illegal (at least in the US). Yelling, shouting, and intimidating other employee's is not legal and should be reported to HR. Take plenty of notes of what was said and when and get hard evidence if possible.\nYou can also file a complaint through your state's EEOC (if you were considered an employee) and through the Department of Education.\n\nAfter you file a complaint, you will be protected from retaliation like being pushed out of the program. The school will also likely assign a new advisor as part of the process.",
      "author": "Matterials",
      "created": 1637303830,
      "upvotes": 0,
      "replies": {}
    }
  }
}