{
  "sid": "hoyyv8",
  "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/",
  "title:": "What's it like to work in Physics research in a U.S government National Lab compared to at a University or elsewhere in Academia?",
  "text": "I've heard many say that research is very slow at National Labs, is this true? What about work environments?",
  "author": "WoodHeadPhones",
  "created": 1594421255,
  "updated": 1634081904,
  "over_18": false,
  "upvotes": 106,
  "upvote_ratio": 0.97,
  "comments": {
    "fxlcnav": {
      "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxlcnav/",
      "text": "I’m a postdoc at a national lab. I wouldn’t say that the research is “slow”. There’s definitely more bureaucracy/paperwork. There is also more work-life balance (I work 9/80s so I get every other Friday off) and I get paid more than postdocs at universities (closed to a starting assistant professor salary than a typical postdoc, for sure). I also get actual vacation and sick time, and a retirement account. \n\nIn terms of culture it feels a lot more like a real job - I mostly work standard office hours with little to no nights and weekends.",
      "author": "magnetic-nebula",
      "created": 1594431310,
      "upvotes": 90,
      "replies": {}
    },
    "fxlczvv": {
      "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxlczvv/",
      "text": "I've worked at a few national labs.  It depends on the lab.  \n\nSome labs have user facilities, where people go to do research and the research staff is there to help users and also get to do their own research.  That's definitely not slow because users usually want to get in and out and get nice data.  It's also nice because you get to collaborate with a lot of people and work on lots of cool projects.\n\nIn others you might get to do your own research, like Los Alamos is known for being one of the birth places of nuclear weapons but now they do a lot of other research on all sorts of topics.\n\nOne issue is that staff members at national labs typically can't get their own grad students (but you can get postdocs), so research groups at national labs tend to be smaller and staff members actually have to spend time doing real research (as opposed to professors at universities who might never go into the lab).\n\nAnother issue is, where does the funding come from?  There's no teaching at a National Lab, so researchers' salaries aren't guaranteed by the department.  It can be harder to compete for grants because lab research is often more expensive than a university because the overhead and salaries are usually higher.  And you're often not allowed to apply for NSF grants.  So scientists may frequently struggle for funding.  When that happens, they often need to find small pieces of a large number of grants, which means they're sometimes working on six different projects.  And it's not spread out across their research group (they don't have grad students; they may have one postdoc) -- they need to personally be working on six different projects.  They also have internal grants (LDRDs), which can be nice but can also cause a lot of politics.\n\nOverall, I really liked the national lab environment as long as funding was taken care of.  They usually have a lot of great facilities and equipment, great colleagues, and you can really just go to work and get stuff done.  But they're not always so great if you need to constantly worry about getting a fraction of someone's grant to pay your salary.\n\nThe people I've worked with have always been great.  That may be due to my own self-selection.  I have heard stories about people who just don't get stuff done but manage to stick around, but I've never needed to work with them.",
      "author": "dampew",
      "created": 1594431526,
      "upvotes": 46,
      "replies": {
        "fxnxj6q": {
          "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxnxj6q/",
          "text": "> And you're often not allowed to apply for NSF grants.\n\nAs a non-American, it seems asinine that the main federal science funding body cannot fund government labs - why is this?",
          "author": "notadoctor123",
          "created": 1594473060,
          "upvotes": 5,
          "replies": {
            "fxo0ade": {
              "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxo0ade/",
              "text": "National labs are funded by Dept. of Energy. They want researchers to get funding from DoE programs and not compete for academic/non-profit researchers seeking money from NSF.\n\nA typical workaround is get to get a research affiliation at a local university. Then you can apply for NSF grants through the university and DOE money through the lab.",
              "author": "wtfe_1",
              "created": 1594474061,
              "upvotes": 10,
              "replies": {
                "fxo4hno": {
                  "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxo4hno/",
                  "text": "Interesting. I can see why people are saying it is a lot more bureaucratic...",
                  "author": "notadoctor123",
                  "created": 1594475220,
                  "upvotes": 3,
                  "replies": {
                    "fxq1x5x": {
                      "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxq1x5x/",
                      "text": "I think it's just as bad in academia.  If not worse.  There are too many funding agencies and it's too difficult to secure funding from them.  One of the primary tasks of professors is to write proposals for research.  It just seems insane to me that so many of the top researchers in the world spend so much of their time trying to get more money to do research instead of actually doing/overseeing research.  National labs do have similar issues, but the nature of the mission of the lab usually means that people don't have to spend quite as much time writing proposals.",
                      "author": "dampew",
                      "created": 1594493046,
                      "upvotes": 4,
                      "replies": {
                        "fxqh4nc": {
                          "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxqh4nc/",
                          "text": "Yeah, I can see that. My PhD advisor was a prolific grant-writer - the thing with him was that he told me it was actually his favourite part of academia, he just really got a kick out of writing a wish-list of results he wanted to produce and then convincing someone that it was worth funding. He had good relationships with project managers, and even got me to present to them and get feedback on my work.That was the most positive take on the system I've ever seen.",
                          "author": "notadoctor123",
                          "created": 1594496798,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fxq022e": {
              "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxq022e/",
              "text": "Is the NSF the main federal science funding body?  Check out this Wikipedia article: https://en.wikipedia.org/wiki/Science_policy_of_the_United_States#Research_and_development_in_the_federal_budget\n\nThe DOE provides a comparable amount of basic research funding and an equal amount of applied research; the NIH actually provides more funding than either.  According to the NSF wikipedia article, it provides 25% of all basic research funding provided to colleges and universities -- which is a fraction of all basic research.\n\nGraduate students can be funded by any of the above agencies; I know grad students doing basic science whose salaries are paid in part by the NSF, DOE, NIH, or DOD.",
              "author": "dampew",
              "created": 1594492570,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "fxnynxv": {
          "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxnynxv/",
          "text": "Wait what? I thought national lab positions were government jobs, is your salary not guaranteed?",
          "author": "clearlyasloth",
          "created": 1594473522,
          "upvotes": 5,
          "replies": {
            "fxo4mq0": {
              "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxo4mq0/",
              "text": "It’s guaranteed but you still need to be funded by a specific project. If you can’t find your own, you will be given other programmatic work to do.  Personally I have the opposite problem, too many people asking me to work on their projects that I just don’t have time for.",
              "author": "demerdar",
              "created": 1594475277,
              "upvotes": 9,
              "replies": {
                "fxpw4a7": {
                  "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxpw4a7/",
                  "text": "Yeah the issue isn't whether you'll get paid, but where the money will have to come from.\n\nIt's nice to be in demand :)",
                  "author": "dampew",
                  "created": 1594491669,
                  "upvotes": 3,
                  "replies": {
                    "fxpzyit": {
                      "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxpzyit/",
                      "text": "Definitely feeling lucky I get to work at a national lab.  Dream job. Academia without the bullshit.",
                      "author": "demerdar",
                      "created": 1594492537,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fxofhj9": {
              "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxofhj9/",
              "text": "Many national labs are actually run through intermediate contractor companies (e.g. [Batelle](https://www.battelle.org/)), so only a subset of government job rules apply.\n\nYou need to either bring in external funding to pay for your salary, or be contributing sufficiently to the lab's programmatic goals to keep your position.",
              "author": "MasterPatricko",
              "created": 1594478304,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "fxlb6zy": {
      "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxlb6zy/",
      "text": "Aren't national lab postdocs considered more competitive and better funded than university postdocs? \nAFAIK national labs have lesser bureaucracy too. (Although I could be wrong)",
      "author": "halfimperial",
      "created": 1594430428,
      "upvotes": 18,
      "replies": {
        "fxlcemi": {
          "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxlcemi/",
          "text": "I’m a national lab postdoc. I’m not sure about competitiveness but I make $30k more than my friends in academic postdocs. Way more bureaucracy though",
          "author": "magnetic-nebula",
          "created": 1594431164,
          "upvotes": 31,
          "replies": {
            "fxlprbr": {
              "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxlprbr/",
              "text": "Can you elaborate on the bureaucracy?",
              "author": "TakeOffYourMask",
              "created": 1594439858,
              "upvotes": 6,
              "replies": {
                "fxlttmn": {
                  "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxlttmn/",
                  "text": "Lots of required trainings and paperwork or you lose building access, computer access, lab access, etc. Way more than I saw at a university. For example, I had to take ladder safety training before traveling to visit my experiment.",
                  "author": "magnetic-nebula",
                  "created": 1594441978,
                  "upvotes": 15,
                  "replies": {
                    "fxmcoxj": {
                      "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxmcoxj/",
                      "text": "Did they tell you about not pinching your fingers in the hinge?",
                      "author": "TakeOffYourMask",
                      "created": 1594450300,
                      "upvotes": 3,
                      "replies": {
                        "fxouqt3": {
                          "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxouqt3/",
                          "text": "No, they told us that climbing a latter is the most dangerous thing we could possibly do at work and to not use one unless absolutely necessary. We then learned how to set up a ladder but weren’t allowed to climb it because it wasn’t “necessary”",
                          "author": "magnetic-nebula",
                          "created": 1594482450,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    },
                    "fxq2ia4": {
                      "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxq2ia4/",
                      "text": "And that's before you even get a security clearance",
                      "author": "dampew",
                      "created": 1594493166,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "fxr50cg": {
                  "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxr50cg/",
                  "text": "This reminds me...  I published a celebrated paper in a top journal (nature/cell/science) while I was at a national lab.  I got taken out to drinks with the head of our division, as well as all of the managers in between.  So it was me, my boss, boss's boss, boss's boss's boss, and boss's boss's boss's boss.  I honestly don't know what they all did all day but they seemed to have constant paperwork and worked incredibly hard.  The top two were women and I was kind of terrified of them; at least one of them had been a fantastic scientist before she became a manager.",
                  "author": "dampew",
                  "created": 1594502481,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "fxldog0": {
          "link": "/r/AskAcademia/comments/hoyyv8/whats_it_like_to_work_in_physics_research_in_a_us/fxldog0/",
          "text": "There are some competitive postdocs (like some awards that will give you higher salaries), but like any other postdoc it's usually up to the individual PI to hire someone.  It might be someone they know because of a previous collaboration as a grad student, or it might just be a nice resume that comes across their desk.",
          "author": "dampew",
          "created": 1594431946,
          "upvotes": 10,
          "replies": {}
        }
      }
    }
  }
}