{
  "sid": "dpkj5i",
  "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/",
  "title:": "Anyone Else Sick of Shitty Online Applications?",
  "text": "So many of these are either poorly designed, mildly abusive, or flat out broken. \n\nWhy do you need me to tell you everything that is in my CV that I just uploaded on your site? Why can’t I put international phone numbers in my application without triggering errors? Why do you want my high school address, gpa, and number of credits?\n\nNo you may not have my social security number to check my background and credit before I’m selected to interview. \n\nThese things are designed by sociopaths.",
  "author": "GeneralReposti_Bot",
  "created": 1572510207,
  "updated": 1634080547,
  "over_18": false,
  "upvotes": 253,
  "upvote_ratio": 0.96,
  "comments": {
    "f5wcseg": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wcseg/",
      "text": "I applied to a job at Princeton (which I won't get, but hey). The application website is one page. No login or account. Just put in name and email info; upload the cover letter, CV, and work sample; write down the names and emails of references; and check the various demographic boxes. Couldn't have taken more than five minutes. \n\nIt really made me appreciate just how bad every other one of these is. Particularly CUNY's. CUNY's is terrible.",
      "author": "MaceWumpus",
      "created": 1572520757,
      "upvotes": 155,
      "replies": {
        "f5wznh4": {
          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wznh4/",
          "text": "Princeton and a small handful of others have it right. Most of the information requested by \"shitty\" application processes probably isn't even needed until the later stages of interviews and hiring, and they can just ask for it from the pool of finalists then. I'm sure this varies state to state, country to country, and public to private institutions, but OP is right that most of them are like a kafkaesque maze of forms, requests, and errors.",
          "author": "a_large_plant",
          "created": 1572533140,
          "upvotes": 23,
          "replies": {
            "f6q9r6f": {
              "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f6q9r6f/",
              "text": "I didn’t appreciate Princeton’s since it didn’t allow me to save progress (as far as I know).",
              "author": "KierkeBored",
              "created": 1573073377,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f5weanz": {
          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5weanz/",
          "text": "[deleted]",
          "author": null,
          "created": 1572521880,
          "upvotes": 24,
          "replies": {
            "f5wgggp": {
              "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wgggp/",
              "text": "I don't think I agree, because it isn't really \"outsourcing\": creating and running an electronic hiring portal is exactly the sort of reason you have HR and IT departments. (The schools that actually outsource---i.e., that host job searches on interfolio---often have the applications with the best user experience.)\n\nThe real problems are \n\n* HR/IT designs the application process (or decides what the application will look like) without input from departments (whether that HR's fault or the fact that professors can't be bothered I'll leave up in the air).\n\n* The people involved in designing these things come from the business world and have no idea how hiring works in higher education.\n\n* HR, departments, and applicants represent three different sets of needs, and so something well-designed from the perspective of HR (i.e. an application form that minimizes the additional work that they have to do) is likely not going to be well-designed from the perspective of applicants or even departments.",
              "author": "MaceWumpus",
              "created": 1572523407,
              "upvotes": 39,
              "replies": {}
            }
          }
        },
        "f5x3oec": {
          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5x3oec/",
          "text": "Sounds like a \"we already have a short list of people for all of our jobs anyway so why even bother with a legit application process\" to me.",
          "author": "pastaandpizza",
          "created": 1572534898,
          "upvotes": 1,
          "replies": {
            "f5xlcn7": {
              "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xlcn7/",
              "text": "I strongly disagree with this sentiment. While some schools might definitely want more information from their applicants (information about teaching experience, for instance), the point is that the *system* for inputting such information is vastly superior to basically all the other systems out there. \n\nEven another school that asks for much more information (Duke, for instance, which wanted a dissertation abstract, research plan, and teaching dossier) could have had essentially the same system as Princeton but with more upload slots. That would have been a better system than they actually had (though Duke's system wasn't bad in the grand scheme of things). *Any* school could have a system as good as Princeton's, regardless of how much information they want to see in the first round of applications. The (main) problem is not that schools ask for too much information (though that is often true too); it's that they ask for the information in ways that are pain in the ass for the applicant.",
              "author": "MaceWumpus",
              "created": 1572542545,
              "upvotes": 18,
              "replies": {
                "f5xnin8": {
                  "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xnin8/",
                  "text": "I understand what you're saying, but I don't think anything you've said disagrees with my sentiment, that they don't need the first round of applications to be highly detailed because they already have people in mind and don't need the additional information to search. You say Princeton's is \"good\" without any evidence that Princeton's system is accurately decoding CVs to auto-populate a database that allows departments to quickly query through their thousands of applications to find the qualifications they're looking for. If they are doing that, then I 100% agree with you, but I don't think either of us knows that to be the case.\n\nPrinceton's is \"good\" in that it is easy for you to fill out, there is no evidence that it is \"good\" for them to actually use to find their most qualified candidates.  I'm suggesting they're not actually using it to find candidates, and that most of their interviewees are already on someone on the departments radar and they just go in and pull those submissions when the time comes. Hell this is how most departments do it at my state uni and we have a full-on annoying application system.  Maybe 1 in 4 interviewees we bring in would have been someone who \"cold\" applied and was found in the system, the other three were already on people's own recruiting list and was narrowed down by faculty discussion.",
                  "author": "pastaandpizza",
                  "created": 1572543471,
                  "upvotes": 0,
                  "replies": {
                    "f5xphfe": {
                      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xphfe/",
                      "text": "> You say Princeton's is \"good\" without any evidence that Princeton's system is accurately decoding CVs \n\nI'm not sure why you've changed the subject here. Obviously, there could very well be backend systems that make it so that the overall process is shitty. That doesn't change the user experience, which is what we were talking about. \n\n>  I'm suggesting they're not actually using it to find candidates, and that most of their interviewees are already on someone on the departments radar and they just go in and pull those submissions when the time comes.\n\nAll the more reason to make the application process painless for everyone who is applying but has no chance of getting the job.",
                      "author": "MaceWumpus",
                      "created": 1572544312,
                      "upvotes": 7,
                      "replies": {
                        "f5xr0rr": {
                          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xr0rr/",
                          "text": "My original comment: \n\n> Sounds like a \"we already have a short list of people for all of our jobs anyway so why even bother with a legit application process\" to me.\n\nYour response: \n\n> I strongly disagree with this sentiment. \n\nThen everything you said after that doesn't support why you disagree with my sentiment. In your last comment you said \"That doesn't change the user experience, which is what we were talking about.\" Frankly, that's what *you're* talking about, I'm just trying to figure out what that has to do with my original statement/sentiment you replied to lol.",
                          "author": "pastaandpizza",
                          "created": 1572544969,
                          "upvotes": 0,
                          "replies": {
                            "f5y6u0e": {
                              "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5y6u0e/",
                              "text": "You're making an assumption about the connection between two unrelated things: the user experience of the application system and whether a specific university mostly interviews internal candidates. You can't really draw conclusions about one from the other. I believe that's what the linchpin of the response you got was about.",
                              "author": "roseofjuly",
                              "created": 1572551679,
                              "upvotes": 4,
                              "replies": {
                                "f5y93ta": {
                                  "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5y93ta/",
                                  "text": "It's an informed assumption though. The reason why applications make you type everything in is so that there is an easy query-able database to search for appropriate candidates.  Without one, the search committee is hand searching through a thousand CVs (or more reasonably since its Princeton), which is just unlikely, and CV scanning tech is notoriously shitty, which again is why you have to fill out a lot of information yourself. Also informed that I have first hand experience with how interviewees are chosen at a different institution, I don't feel like I'm that far off base to suggest another institution does the same, they've just realized they should be nice and stop making everyone go through a laborious application process.\n\nAlso the person who responded to me ended up agreeing that the application style and my sentiment are reasonably connected (they said \"All the more reason to make the application process painless for everyone who is applying but has no chance of getting the job\"). Which is the entire premise of my comment pretty much.\n\n>You're making an assumption about the connection between two unrelated things: the user experience of the application system and whether a specific university mostly interviews internal candidates. \n\nI'm saying based on what the application actual is (not the user experience, good or bad, but what it actually, physically is) it doesn't seem like they're actually using it to select their top qualified applicants.",
                                  "author": "pastaandpizza",
                                  "created": 1572552644,
                                  "upvotes": 2,
                                  "replies": {
                                    "f5yd9c2": {
                                      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5yd9c2/",
                                      "text": "> Also the person who responded to me ended up agreeing that the application style and my sentiment are reasonably connected (they said \"All the more reason to make the application process painless for everyone who is applying but has no chance of getting the job\").\n\nJust to be clear, I wasn't intending to agree with that assumption, and don't agree with it. My experience has been the opposite: departments that want to hire specific people use more detailed ads and forms to ensure that the person they want fits the ad perfectly. But I suspect this differs dramatically by field and that there probably aren't particularly safe generalizations to be made even within a field.",
                                      "author": "MaceWumpus",
                                      "created": 1572554411,
                                      "upvotes": 2,
                                      "replies": {}
                                    },
                                    "f5zgycl": {
                                      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5zgycl/",
                                      "text": "I am submitting one of these applications right now and I just saw your comment 😭",
                                      "author": "apolotary",
                                      "created": 1572576707,
                                      "upvotes": 1,
                                      "replies": {
                                        "f60mhn7": {
                                          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f60mhn7/",
                                          "text": "Ha well it looks like no one agrees with me so no worries!",
                                          "author": "pastaandpizza",
                                          "created": 1572620918,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "f5ycnyz": {
                              "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5ycnyz/",
                              "text": "Your original comment was in response to my comment on user experience, in a thread about user experience. I disagreed with your comment because---in the context of the discussion user experience---you were indicating that there was something wrong with having an application with a nice user experience. You then changed the discussion to postulating that the behind the scenes stuff was nefarious.",
                              "author": "MaceWumpus",
                              "created": 1572554160,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f5wpfyo": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wpfyo/",
      "text": "This will get buried but I am more tired of having to write 10+ pages of documents tailored for that specific place / position, only to have my application completely ignored. I might as well start printing my docs straight into trash :(",
      "author": "apolotary",
      "created": 1572528327,
      "upvotes": 83,
      "replies": {
        "f5wyf9k": {
          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wyf9k/",
          "text": "I want AAUP to push for standardized application materials. It wouldn't be hard to do. For example, one option could be that institutions could pick one of three different application packages: research oriented, teaching oriented, or balanced. Within that, there shouldn't be anything so amazingly unique about your institution that it can't be addressed in the cover letter, so nothing additional should be requested unless mandated by state/federal law.\n\nI doubt it will happen, but I still want it.",
          "author": "starship-unicorn",
          "created": 1572532588,
          "upvotes": 35,
          "replies": {
            "f5x89w4": {
              "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5x89w4/",
              "text": "I wish it was more formalized like regular job applications. For example what I see nowadays in eligibility criteria:\n\n* Have a PhD\n* Speak English\n* Be passionate about research\n\nWhile the real eligibility criteria seems to be:\n\n* Have a degree from R1 school\n* Have X papers published in Y places with IF > Z\n* Have experience teaching A and B for C hours \n* Be visible (as in comparison with what, being a ghost?)\n* Know or be friends with faculty and pray to god that dean likes you or doesn’t have his own relative/friend/whatever to push through\n* Don’t give us a visa headache\n* Be of a certain nationality and/or be able to speak the language that we don’t list as required, but we damn well know that our students, faculty, and HR speak 0 English so you have to speak that other language to survive\n\n\nAnd then we maaaaybe invite you for a quick skype interview\n\nOf course it’s not always like that, and some schools DO get out of their way to explain their expectations. But when they don’t, I honestly wish the search committees explained their expectations more clearly instead of making people waste their time with applications. I talked to people who were on these committees and they do mention some of the points above, and every time I’m questioning why they couldn't make it obvious to applicants in the first place",
              "author": "apolotary",
              "created": 1572536917,
              "upvotes": 18,
              "replies": {
                "f5xcbwx": {
                  "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xcbwx/",
                  "text": "I wish it was as easy as the real eligibility criteria that you posted. The last two jobs I applied for, the only people who got interviews were those who already held national or international funding.",
                  "author": "SheWentThatWay",
                  "created": 1572538678,
                  "upvotes": 5,
                  "replies": {}
                },
                "f5xvlgl": {
                  "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xvlgl/",
                  "text": ">I wish it was more formalized like regular job applications. For example what I see nowadays in eligibility criteria:  \n>  \n>Have a PhDSpeak EnglishBe passionate about research  \n>  \n>While the real eligibility criteria seems to be:\n\nThis is the HR industry at work: they often force departments to advertise *minimum* qualifications and won't allow them to be more specific. It's crazy, but I've seen it happen often across higher ed. Jobs that will clearly be awarded to people with Ph.D.s, for example, are sometimes listed as \"BA/BS degree required\" (such as institutional research).",
                  "author": "SnowblindAlbino",
                  "created": 1572546897,
                  "upvotes": 5,
                  "replies": {
                    "f5y76f7": {
                      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5y76f7/",
                      "text": "That's because HR is there to prevent is from getting sued, and some of what people want to put in job ads is illegal or not well aligned with the industry. It's also good practice to list *minimum* qualifications and have a separate section for preferred. I mean if you know you'd 100% not hire someone with a BA that makes no sense, but if there's a chance then that should be the min bar.",
                      "author": "roseofjuly",
                      "created": 1572551826,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f5xkown": {
              "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xkown/",
              "text": "This would be amazing. I have been on the market almost every year since 2014. I’m always prepared with the standard documents that just need a bit of tailoring for the specific place but recently submitted one where they had some unusual requests for how documents should be. It’s so unfair and takes so much time, I really wish hiring committees saw that. Especially when I probably won’t even get so much as an email rejection.",
              "author": "ProfessorHomeBrew",
              "created": 1572542267,
              "upvotes": 3,
              "replies": {}
            },
            "f5xvdp7": {
              "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xvdp7/",
              "text": ">Within that, there shouldn't be anything so amazingly unique about your institution that it can't be addressed in the cover letter, so nothing additional should be requested unless mandated by state/federal law.\n\nAs a longtime veteran of hiring committees I disagree. I hate generic applications and generally find the information in a tailored application is exactly what I want to move a candidate forward in the process. Obviously everyone wants the job, has research and teaching experience, and has a c.v..  But I want to know *why* they are interested in teaching at a school like mine, and why this position in particular. It's a buyers' market after all, and when we have 250+ applications for a position I'm going to favor the ones who have a clear motivation for wanting to join my department, vs. a generic candidate who is clearly just submitting a file to every open position.",
              "author": "SnowblindAlbino",
              "created": 1572546806,
              "upvotes": 3,
              "replies": {
                "f5ybpa3": {
                  "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5ybpa3/",
                  "text": "> But I want to know *why* they are interested in teaching at a school like mine, and why this position in particular.\n\nThen request that the cover letter address these items. There is no reason to require additional tailored documents beyond a cover letter for something like that.",
                  "author": "starship-unicorn",
                  "created": 1572553755,
                  "upvotes": 15,
                  "replies": {}
                },
                "f5y7hx5": {
                  "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5y7hx5/",
                  "text": "They want to teach there because they need to eat and live inside. Also, finding that out IMO is what interviews are for.\n\nI'm a hiring manager and while I do like to hear people talk about their motivations and passions, there are other ways to find it besides requiring them to write 10+ pages of content. I hire researchers to do pretty specialized research and we manage to succeed with a cover letter and resume.",
                  "author": "roseofjuly",
                  "created": 1572551961,
                  "upvotes": 7,
                  "replies": {
                    "f5ywhdi": {
                      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5ywhdi/",
                      "text": "It doesn't take ten pages, it takes a good cover letter. We are not going to waste time interviewing people-- who we fly in from around the world --to find out they are set on teaching at an R1 or aren't serious about moving to our part of the country. That should be evident from their applications, and if it's not we aren't going to advance them in the process.",
                      "author": "SnowblindAlbino",
                      "created": 1572562647,
                      "upvotes": 1,
                      "replies": {
                        "f5ztbre": {
                          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5ztbre/",
                          "text": "Perhaps it's different now, but when I was applying for academic jobs it was indeed 10+ pages - letter of interest, teaching statement, and research statement, each of which were about 3 pages, plus s diversity statement in some cases. One of the commenters made reference to 10+ pages and so I assumed that's what we're talking about, not a simple cover letter.\n\nThat said...there's a such thing as phone screens? We also fly people in from around the world to interview in person (our model is actually kind of similar to academic hiring, with a job talk and then a series of interviews) but before we get there we read resumes and cover letters, then do phone interviews with a subset. The first question in the phone interview is \"Why are you interested in this job?\"",
                          "author": "roseofjuly",
                          "created": 1572586904,
                          "upvotes": 6,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "f5xxrgt": {
                  "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xxrgt/",
                  "text": "All you're asking for here is for candidates to demonstrate their bullshitting abilities.\n\nThe motivation is obvious -- people want jobs.",
                  "author": "a_large_plant",
                  "created": 1572547829,
                  "upvotes": 6,
                  "replies": {
                    "f5yx1jr": {
                      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5yx1jr/",
                      "text": "I don't want candidates who \"want jobs,\" I want those who specifically want to invest in a career with my department. There are hundreds of people who \"want jobs\" in every pool. The purpose of the search process and role of the committee is to select those that best fit the institutional mission and are most likely to be successful in and remain at that institution for the long term. More info is better for that, and in my experience search committees are pretty good at reading through bullshit in applications.",
                      "author": "SnowblindAlbino",
                      "created": 1572562919,
                      "upvotes": 1,
                      "replies": {
                        "f6195ar": {
                          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f6195ar/",
                          "text": "I honestly think you're being naive or just out of touch with the job market. Everything you're asking for can be bullshitted, and will be bullshitted very competently by competitive applicants. People are literally trying to get jobs out here -- pay the bills, live reasonable lives -- and will write whatever garbage necessary to make you happy.\n\n>in my experience search committees are pretty good at reading through bullshit in applications.\n\nCommittees think they are. Does not mean they can actually tell the difference.",
                          "author": "a_large_plant",
                          "created": 1572635857,
                          "upvotes": 3,
                          "replies": {
                            "f620a6c": {
                              "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f620a6c/",
                              "text": "> Committees think they are. Does not mean they can actually tell the difference.\n\nI've got a 20+ year record of successful hires behind me, so from my perspective it's worked quite well. But YMMV.",
                              "author": "SnowblindAlbino",
                              "created": 1572650891,
                              "upvotes": 1,
                              "replies": {
                                "f62h5n3": {
                                  "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f62h5n3/",
                                  "text": "I mean, yeah. Bullshitters will likely still be successful hires lol. They still *want* the job and are qualified. Doesn't have anything to do with whether they poured their authentic heart out and spoke to you on some sort of ideal intellectual level, or just wrote a really great bullshit application to please you and rest of the committee. You'd never know the difference.",
                                  "author": "a_large_plant",
                                  "created": 1572659503,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "f5xxibb": {
          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xxibb/",
          "text": "I don't think it's worth tailoring letters and statements beyond having different ones for research- or teaching-oriented programs, and having like 3 or 4 sentences that you edit to be more appropriate. I can't bring myself to spend more than 15-30 minutes tailoring my packet anymore. I've seen virtually no difference in my success rate compared to when I'd go all out tailoring things. I guess ymmv but I feel like places get so many applications they can barely even tell what is authentically tailored or not.",
          "author": "a_large_plant",
          "created": 1572547718,
          "upvotes": 6,
          "replies": {}
        },
        "f5x76vm": {
          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5x76vm/",
          "text": "https://www.youtube.com/watch?v=0yZzmH7ksYE",
          "author": "Mezmorizor",
          "created": 1572536448,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f5wjv4q": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wjv4q/",
      "text": "Oh god yes. \n\nLike why do you need EVERY JOB I HAVE EVER HAD. The supervisor for my first tutoring job is deceased. No you can't talk to her.",
      "author": "jessamina",
      "created": 1572525419,
      "upvotes": 26,
      "replies": {}
    },
    "f5wemcy": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wemcy/",
      "text": "Yes! I once had an application for a job ask me to type in every single university module I had done and the grade. Could’ve just uploaded the transcript and saved so much time.",
      "author": "RainbowsOnMyMind",
      "created": 1572522116,
      "upvotes": 40,
      "replies": {
        "f5wv1ko": {
          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wv1ko/",
          "text": "o god y",
          "author": "psi_0lym47h",
          "created": 1572531029,
          "upvotes": 16,
          "replies": {}
        },
        "f5xegur": {
          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xegur/",
          "text": "Yeah sorry no.\n\nOn the flip side, I very consciously decided not to apply to the job that requested the entire thing be printed and sent in. All 12 copies of it. Yeah, I'm not paying for your printing. Or rushing it through snail mail. Jesus.",
          "author": "imhereforthevotes",
          "created": 1572539640,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "f5wuwym": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wuwym/",
      "text": "In math, we have a website (mathjobs.org) specifically for making it easy to find and apply for lots of academic jobs. It's great because most schools ask for the exact same documents, so you only have to upload them once.\n\nAs of a few years ago, the vast majority of research departments used only mathjobs. (More teaching-oriented schools tended not to use it because they don't want an applicant pile full of people who are just casting a wide net and wouldn't really want to work there.) But for some insane reason, the last couple of years, more and more schools are making applicants upload their documents to mathjobs AND their university's dreadful online system. Which defeats the entire purpose...",
      "author": null,
      "created": 1572530969,
      "upvotes": 15,
      "replies": {}
    },
    "f5wgt6a": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wgt6a/",
      "text": "There's no frustration quite like having to faff around with a log-in to do a journal a *favour*.",
      "author": "dl064",
      "created": 1572523651,
      "upvotes": 26,
      "replies": {}
    },
    "f5xua3z": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xua3z/",
      "text": "> These things are designed by sociopaths. \n\nOr more accurately, by HR departments. I've been deeply involved in faculty hiring for well over two decades now and have chaired many search committees. We hate the forms and the BS from HR as much as applicants. We don't want your high school (or even undergraduate) grades, or really any of that other material either. At my school faculty are even split on mandatory background checks for finalists, fearing that HR or administrators might kill an application due to some misdemeanor charge for civil disobedience or possession or something that has no bearing at all on their ability to do the job. But every year HR directors go to expensive national conferences where the companies who make the systems that support this sort of information dredging are paying for meals, giving them swag, and marketing their products through \"seminars\" that are really sales pitches. Then they come back and force said systems/requirements on their institutions under the banner of risk management, with zero thought as to how well they work, how they might violate the norms of academic hiring (some of which, granted, are bad and should be violated), or how much additional work they will create for hiring committees.\n\nFor example: my school used to simply accept paper applications, which were scanned and uploaded for committee members to read/download as .PDFs. Once we paid for a $$$ hiring system HR stopped taking physical applications...now everything goes into The Monster and if I want to read 75 cover letters from a pool I have to download each one individually. There is no way to batch download even complete files (which are now full of crap like high school grades and undergraduate transcripts I don't want anyway).\n\nMy HR colleagues are good people, but a significant portion of the industry exists only to provide legal protection for employers, not to advance our institutional missions and certainly not to help use do our jobs. I do not trust the HR industry a bit, nor the lawyers who advise them or the corporations who see them as a profit center.",
      "author": "SnowblindAlbino",
      "created": 1572546344,
      "upvotes": 10,
      "replies": {}
    },
    "f5wxbtz": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wxbtz/",
      "text": "What’s worse is that at my institution, faculty hiring committees ignore literally all that shit and just read the CV & cover letter.",
      "author": "dr_police",
      "created": 1572532097,
      "upvotes": 11,
      "replies": {
        "f5xw23p": {
          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xw23p/",
          "text": "> just read the CV & cover letter.\n\nYep. That's always what drives the first cut in my experience. But then you have to start digging, and nobody wants to wait weeks for materials to be submitted at that point. We usually move from the full pool of hundreds down to 20 candidates within a week after the search closes.",
          "author": "SnowblindAlbino",
          "created": 1572547092,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "f5xovnk": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xovnk/",
      "text": "Old Days: Send all materials by snail mail. Sucked moderately.\n\nTransitional Days: Send all materials as email attachments. Wonderful\n\nToday: Figure out and use a different site to submit each application. Sucks big time.",
      "author": "trailmix_pprof",
      "created": 1572544046,
      "upvotes": 10,
      "replies": {}
    },
    "f5w9c58": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5w9c58/",
      "text": "I assume you are talking about academic job applications where you end up having to fill out the university’s internal job application. I think most folks just skip as much of that as possible. It wastes so much time when all you are trying to do is upload the actual application.",
      "author": "ProfessorHomeBrew",
      "created": 1572518023,
      "upvotes": 16,
      "replies": {
        "f5xah94": {
          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xah94/",
          "text": "The majority of applications I've done in the past two years very specifically tell you that if you don't fill everything out, even if all the info is on the CV, that your application will not be considered at all. The implication is that the system won't take it unless you fill out everything, or it won't make it past the first HR person. Whether any of that is true or not, I don't know, but as an applicant, I can't take that chance.",
          "author": "Jurgioslakiv",
          "created": 1572537872,
          "upvotes": 13,
          "replies": {
            "f5xq38f": {
              "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xq38f/",
              "text": "This is absolutely true at my institution. HR has to approve each application as \"complete\" before we can review any of them.\n\nAlso, even if things can slip past HR, it doesn't always look good to the search committee. We're not going to delete an excellent candidate because you failed to fill in a box, but for a marginal candidate it could make a difference. And it's not about filling in boxes, but if they ARE filled in, we can quickly see that info, which is helpful when first eyeballing applications and also later when you're going back and trying to find \"that one\" candidate, who you can't remember their name, but you do remember what university they went to. It's nice not to have to open dozens of attachments to find that one person.\n\nThe online systems suck for everyone involved, both candidates and reviewers.",
              "author": "trailmix_pprof",
              "created": 1572544567,
              "upvotes": 5,
              "replies": {
                "f5xvsw3": {
                  "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xvsw3/",
                  "text": ">HR has to approve each application as \"complete\" before we can review any of them.\n\nLuckily at mine faculty won a battle over that-- we get access in real time, so each element of a file is visible to search committee members as soon as it's uploaded.",
                  "author": "SnowblindAlbino",
                  "created": 1572546985,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f5wzwd1": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wzwd1/",
      "text": "Half the time I just refuse to put an answer in a lot of the forms, especially if they are redundant to my CV. I'm sure this disqualifies me at some places, but I've noticed no change in call-backs from before and after I started doing this.",
      "author": "a_large_plant",
      "created": 1572533246,
      "upvotes": 6,
      "replies": {}
    },
    "f5xmw85": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xmw85/",
      "text": "I get the gammet of questions they all ask, it is annoying to fill them out repeatedly (I have applied for 35 jobs over the past 3 years).  \n\nWhat I've noticed this year is that there are a lot of broken online forms.  I don't remember this happening the last 2 rounds of applications I have sent in.  I have emailed the help desk/service center for 3 different universities this round alone because something was broken or wrong with their online forms, typically Oracle or Peoplesoft.  \n\nI dislike applications that ask for your reference letters upfront. I just feel bad asking for them when I know that my letter writers are super busy, and I haven't even made the first cut of applications yet.  I get why hiring committees do it, but I can't help but feel like it's a bit inconsiderate of everyone else's time.",
      "author": "TourmalineTart",
      "created": 1572543204,
      "upvotes": 6,
      "replies": {
        "f5ygqk5": {
          "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5ygqk5/",
          "text": "> I can't help but feel like it's a bit inconsiderate of everyone else's time.\n\nIt absolutely is. Academia needs a huge shift in how and when we require letters.",
          "author": "SnittingNexttoBorpo",
          "created": 1572555917,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "f5xhv10": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5xhv10/",
      "text": "It is exhausting to type out every detail over and over. THIS IS WHERE I WENT TO COLLEGE AND THE ADDRESS FOR THE 10TH TIME! I applied for one recently that just wanted you to email the usual documents (CV, teaching philosophy, cover letter) and it was a huge relief.",
      "author": "Maddprofessor",
      "created": 1572541079,
      "upvotes": 7,
      "replies": {}
    },
    "f5wfi64": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5wfi64/",
      "text": "Most of these systems are old and they're expensive to upgrade is why.",
      "author": "griwulf",
      "created": 1572522740,
      "upvotes": 5,
      "replies": {}
    },
    "f5x4ega": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5x4ega/",
      "text": "I never know who I hate more, HR or IT, and online applications are the unholy demon spawn of both.",
      "author": "pastaandpizza",
      "created": 1572535213,
      "upvotes": 4,
      "replies": {}
    },
    "f5x7r8q": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5x7r8q/",
      "text": "I didnt get a job at target due to their system being bugged and me not being able to apply.",
      "author": "Angry-MiddleAgedMan",
      "created": 1572536696,
      "upvotes": 2,
      "replies": {}
    },
    "f5zhn84": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f5zhn84/",
      "text": "One tip I heard was to have a separate CV with no or simple formatting for copy and pasting into online applications.",
      "author": "WhoRipped",
      "created": 1572577173,
      "upvotes": 1,
      "replies": {}
    },
    "f6q9u4g": {
      "link": "/r/AskAcademia/comments/dpkj5i/anyone_else_sick_of_shitty_online_applications/f6q9u4g/",
      "text": "Just don’t submit that information. Many times, if it’s not a required field, I just skip.",
      "author": "KierkeBored",
      "created": 1573073420,
      "upvotes": 1,
      "replies": {}
    }
  }
}