{
  "sid": "prrrug",
  "link": "/r/AskAcademia/comments/prrrug/how_ambitious_should_a_fellowship_proposal_be/",
  "title:": "How ambitious should a fellowship proposal be?",
  "text": "I am looking into applying for a Marie Curie fellowship (a postdoc fellowship in EU). If awarded, it would provide funding for two years. How ambitious should the proposal be in terms of deliverables? Would they expect me to output something like 3 first-author publications? Or less? Or more? I am in astronomy.\n\nIf you have a personal stance against measuring research output in number of publications, or that is not particularly important in your field of study, that's cool, good for you. For better or worse, that is the main measurement of progress in many academic circles, and I have no reason to expect that experts reviewing proposals for this fellowship will think otherwise.",
  "author": "aspiringmsca",
  "created": 1632132425,
  "updated": 1634078916,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hdkoxhi": {
      "link": "/r/AskAcademia/comments/prrrug/how_ambitious_should_a_fellowship_proposal_be/hdkoxhi/",
      "text": "You should just write a proposal that seems interesting (yet realistic) to the reviewer, and have a good publication record. But you have to keep in mind that you must check the appropriate checkboxes for the Kafkaesque parts of the proposal; even if the reviewer likes your proposal, they cannot justify giving you a high score to the pencil-pushers if some mandatory parts of the proposal are missing or incomplete.",
      "author": "Hapankaali",
      "created": 1632133444,
      "upvotes": 2,
      "replies": {
        "hdmai6h": {
          "link": "/r/AskAcademia/comments/prrrug/how_ambitious_should_a_fellowship_proposal_be/hdmai6h/",
          "text": "Many thanks, do you maybe know if for this fellowship I should use \"I will...\" or the language that the proposal template uses, \"Candidate will...\"?",
          "author": "aspiringmsca",
          "created": 1632161206,
          "upvotes": 1,
          "replies": {
            "hdmkze5": {
              "link": "/r/AskAcademia/comments/prrrug/how_ambitious_should_a_fellowship_proposal_be/hdmkze5/",
              "text": "As I recall, there was some other canned phrase for it. You should find someone who successfully received this grant and look through their proposal.",
              "author": "Hapankaali",
              "created": 1632165520,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hdljbjk": {
      "link": "/r/AskAcademia/comments/prrrug/how_ambitious_should_a_fellowship_proposal_be/hdljbjk/",
      "text": "Output in terms of publication is so field-specific that its difficult to put a number on for those of us outside your area. To get a baseline, look around at the people in your field that you'd consider to have had successful postdocs. If you know others that have gotten postdoc fellowships, ask them for their proposal documents.\n\nI think in terms of ambition, a proposal should be realistic but a stretch. It should be something that feels like a substantial contribution to the research in a field, but if a reviewer looks at it they'll think that you can realistically do it if everything goes right (and even if it doesn't go right, you've thought through contingencies and you'd still end up doing something interesting).",
      "author": "LeopoldTheLlama",
      "created": 1632150074,
      "upvotes": 2,
      "replies": {
        "hdmaca5": {
          "link": "/r/AskAcademia/comments/prrrug/how_ambitious_should_a_fellowship_proposal_be/hdmaca5/",
          "text": "Many thanks, do you maybe also know if for this fellowship I should use \"I will...\" or \"Candidate will...\"?",
          "author": "aspiringmsca",
          "created": 1632161138,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdmysqd": {
      "link": "/r/AskAcademia/comments/prrrug/how_ambitious_should_a_fellowship_proposal_be/hdmysqd/",
      "text": "Finding another successful grant in the same field is a good help. I was awarded a Mare Curie IIF but don’t remember specifically numbering papers in deliverables (in science but this was the old FP7). Having an interesting project and a reputable lab/advisor is very important. Unfortunately a lot of those grants are awarded to top professors (part of the reason they reduced the individual funding after FP7 because the wage was double and research resources huge for established labs), but maybe that’s changing. I applied for a slightly easier grant before the MC with a kind of dry, procedural, proposal and it was canned. I changed it to being a broader material comparison that was slightly more vague but more interesting and really combined some of my previous experience (PhD and a postdoc) and that went down a treat while allowing more freedom (even though you probably won’t end up doing exactly what you planned).",
      "author": "deltaQdeltaV",
      "created": 1632171182,
      "upvotes": 1,
      "replies": {}
    }
  }
}