{
  "sid": "ovx0mf",
  "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/",
  "title:": "If I leave my postdoc for a non-academic position, would I be able to re-join academia later on?",
  "text": "I have a job offer for a science communication- outreach position. I am thinking of taking it because I want to see if that career path would make me happier. The position involves grant writing and fieldwork, but no opportunities for publishing. I am on my first postdoc. If I leave my postdoc for this position and then decide that I miss research, would I be able to get another postdoc and get back in the game? Or am I really shutting the door on the academic career track? I do have some trailing papers from my PhD so I will probably still have publications coming out for the next year or two.",
  "author": "foundingflounders",
  "created": 1627841032,
  "updated": 1634080035,
  "over_18": false,
  "upvotes": 116,
  "upvote_ratio": 0.93,
  "comments": {
    "h7cck9s": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7cck9s/",
      "text": "The vast majority of postdocs in most fields have no realistic academic career prospects, so likely you can't actually decrease your chances very much. But yes, it will be difficult to get back into the game. When applying for jobs, you will likely be judged by people who have never known anything but the very linear career paths that academics are meant to follow and will look down on any deviation from that path. Many will think that you went into a non-academic position because you were not good enough to get a tenure track position, though many will think that if you do more than one or two postdocs anyway. Academia is very social status oriented and non-academic jobs are for many academics low-status. It is not impossible though. Ones chances are never zero.",
      "author": "CaptainCornerCamper",
      "created": 1627843982,
      "upvotes": 128,
      "replies": {
        "h7ctzjk": {
          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7ctzjk/",
          "text": "This rings very true. I went to do a Masters more than 10 years after finishing undergrad (Mechanical Engineering).\n\nI was looked down by professors, PhD students and even peers (incoming master students), all of which had, in most cases, not a iota of industry experience.\n\nI took it in stride, aware of why that was happening, but it annoyed me and greatly deflated my desire - as well as showed how harder than I  expected it would be - to pursue an academic career.",
          "author": "rgdnetto",
          "created": 1627852302,
          "upvotes": 41,
          "replies": {}
        },
        "h7d340m": {
          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7d340m/",
          "text": "Yes you’re undoubtedly right. But it is so hard to know if you’re one of the people who could make it. All my mentors/supervisors say I have a competitive CV and they think I’d make a great PI. But they’re biased because they like me and are just trying to be supportive. I wish someone I don’t know could look at my CV and tell me if I have a snowball’s chance in hell. So much of it is also being in the right place at the right time. I guess the only way is to apply to a few faculty jobs and find out.",
          "author": "foundingflounders",
          "created": 1627856796,
          "upvotes": 21,
          "replies": {
            "h7d6atz": {
              "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7d6atz/",
              "text": "Probably they are biased, but your mentors are also probably right. You probably would make a great PI and you probably do have an impressive CV and that does make you competitive. The problem is the same is true for dozens of the people you are competing for jobs with and there will only be jobs for a very small fraction of you. \n\nI think applying for a few faculty jobs and seeing what happens is a good idea. There is no reason you can’t do that even if you take this non academic job.",
              "author": "CaptainCornerCamper",
              "created": 1627858407,
              "upvotes": 22,
              "replies": {}
            },
            "h7donf5": {
              "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7donf5/",
              "text": "> I wish someone I don’t know could look at my CV and tell me if I have a snowball’s chance in hell. \n\nAs you note: apply for faculty positions, and a committee of people you don't know will look at your CV for you and let you know. Apply early is almost always useful, but it can be hard to overcome the mental and ego barriers.\n\nIt can also be helpful (although not always great for mental health) to look at the CVs of recent hires in your field and of other postdocs who you think are good but don't have a job yet. How does your CV compare?",
              "author": "DevFRus",
              "created": 1627868153,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "h7c8ri0": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7c8ri0/",
      "text": "It depends on whether or not you keep doing research and publishing. If not, then you lose momentum and it is hard to regain it. In the position you describe, it would be tough.",
      "author": "bigrottentuna",
      "created": 1627842173,
      "upvotes": 56,
      "replies": {
        "h7cvydh": {
          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7cvydh/",
          "text": "[deleted]",
          "author": null,
          "created": 1627853261,
          "upvotes": 11,
          "replies": {
            "h7czrtz": {
              "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7czrtz/",
              "text": "Congrats on making it this far. First-gen students definitely face extra hurdles. There’s a steep learning curve in academia in general and most professors are first-gen professors, so it really helps to have some mentors who can guide you. \n\nProbably the best advice any early career faculty member can get is to focus on your research, while making sure that your teaching is good enough. While teaching is important and must always be strong, in general no amount of great teaching (and service) can make up for inadequate research.",
              "author": "bigrottentuna",
              "created": 1627855145,
              "upvotes": 12,
              "replies": {
                "h7ewp6k": {
                  "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7ewp6k/",
                  "text": "What is a first-gen student/professor? Generations family-wise, new-program-wise or something else entirely?",
                  "author": "maratonininkas",
                  "created": 1627899551,
                  "upvotes": 2,
                  "replies": {
                    "h7fb315": {
                      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7fb315/",
                      "text": "First-gen student = first generation in the family to go to college. First-gen students often face significant financial, cultural, and other barriers.",
                      "author": "bigrottentuna",
                      "created": 1627909597,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "h7g0gs4": {
                      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7g0gs4/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1627921473,
                      "upvotes": 3,
                      "replies": {
                        "h7g3qwv": {
                          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7g3qwv/",
                          "text": "I see, thanks. Coming from a post-soviet union country, most younger people even in the largest cities are first-gen then, since studying in a university was never as common as it is today and there are very few that get any perks from being second gen. Hence the confusion with the term, but I understand how can that be a problem in US and the likes.",
                          "author": "maratonininkas",
                          "created": 1627922868,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h7cjgqq": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7cjgqq/",
      "text": "It depends on your field. I know for engineering and I think accounting, there's a bit more demand for professors since PhDs in those fields can usually make buttloads more money in industry. I know that in my engineering dept, many profs had a lot of industry experience before becoming one.\n\nBut for the vast majority of fields, I think yes, it locks your out of TT jobs from what I hear. But also on the flipside, I think the fear of this is also what keeps people in the \"academia cult\" and keeps them strung along for *years* in essential poverty while in perma-postdoc life. As others in this thread have mentioned, many people who have left academia have gone on to be extremely satisfied and haven't really looked back.",
      "author": "valryuu",
      "created": 1627847289,
      "upvotes": 17,
      "replies": {}
    },
    "h7du81v": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7du81v/",
      "text": "If you stop publishing, you're probably not going to be able to rejoin academia. I worked a corporate job for about two years after my PhD and then landed an academic job, but I kept a relationship with my university and continued to publish, had a job that let me attend conferences, etc. If you can keep a publication train rolling, then it's doable.",
      "author": "deong",
      "created": 1627871088,
      "upvotes": 8,
      "replies": {}
    },
    "h7d72u1": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7d72u1/",
      "text": "It depends on your field. The AAAS has a sci comm type science and technology fellowship on Capitol Hill and I have the sense some alums go to academia, and other professional organizations have this too.",
      "author": "OcelotAccomplished99",
      "created": 1627858805,
      "upvotes": 6,
      "replies": {
        "h7da811": {
          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7da811/",
          "text": "Oh yes. AAAS fellowship is really prestigious. This wouldn’t be that. It would be more like a community extension agent role. So research- but focusing on citizen/community science",
          "author": "foundingflounders",
          "created": 1627860438,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h7d78xl": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7d78xl/",
      "text": "I left academia for a K-12 STEM nonprofit, told myself I never wanted to deal with college students, and wound up with a part-time lecturer position 5 years later. There are also people who do research related to STEM education/outreach so you could potentially transition to that.\n\nWhen you say \"leave your postdoc\" though, do you mean leave EARLY? Are you unnecessarily burning a bridge instead of finishing it before taking the job?",
      "author": "bengineering103",
      "created": 1627858894,
      "upvotes": 7,
      "replies": {
        "h7da289": {
          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7da289/",
          "text": "Thanks for the perspective. Yes - sort of. They told me the would renew me for another year of funding and I would be leaving after the first year.",
          "author": "foundingflounders",
          "created": 1627860353,
          "upvotes": 3,
          "replies": {
            "h7dazhl": {
              "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7dazhl/",
              "text": "Ok - if you're leaving after a complete year because you have a job offer I don't think there's anything wrong with that. More of an issue if you were leaving in the middle of the year.",
              "author": "bengineering103",
              "created": 1627860841,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "h7ce8ik": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7ce8ik/",
      "text": "Since you have remaining work to publish, I don't really see the downside of trying something new. As others have said, it's important to keep publications coming out. I worked as a consultant after my PhD for about a year and still published research, and have ended up in a research-oriented postdoc. Good luck!",
      "author": "robertnye",
      "created": 1627844780,
      "upvotes": 17,
      "replies": {
        "h7d3pw1": {
          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7d3pw1/",
          "text": "Thanks! This is helpful. Yes I’m thinking of trying it for a year or two.",
          "author": "foundingflounders",
          "created": 1627857103,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h7d29eo": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7d29eo/",
      "text": "Thanks all for the advice! It’s a tough decision.",
      "author": "foundingflounders",
      "created": 1627856370,
      "upvotes": 4,
      "replies": {}
    },
    "h7cf643": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7cf643/",
      "text": "You most likely will not want to go back if you want to leave now. Academics like to make it sounds like it is hard to go back. It is true that once people are out, they do not go back but it is because they do not want to. I never heard anyone wanting to go back to academia after having a real life job.",
      "author": "Master-Movie9270",
      "created": 1627845228,
      "upvotes": 42,
      "replies": {
        "h7cm2gm": {
          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7cm2gm/",
          "text": "I’m currently a student but I have a friend who went into industry after academia. He said he’s much happier, making more money, and working less hours.",
          "author": "AlexanderTox",
          "created": 1627848531,
          "upvotes": 15,
          "replies": {
            "h7d9ta6": {
              "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7d9ta6/",
              "text": "This is me. Left my academic postdoc. I now work 35-40 hours a week, never worry about work at home, almost doubled my salary, and have a pretty fun/chill job.",
              "author": "SoupaSoka",
              "created": 1627860225,
              "upvotes": 12,
              "replies": {
                "h7dbokd": {
                  "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7dbokd/",
                  "text": "I’m honestly considering that route after graduation anyway, looks like it’s the way to go.",
                  "author": "AlexanderTox",
                  "created": 1627861212,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "h7dozk8": {
          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7dozk8/",
          "text": "> It is true that once people are out, they do not go back but it is because they do not want to. I never heard anyone wanting to go back to academia after having a real life job.\n\nThis is very important to remember. If you are able to clear yourself of the academic brainwashing then I think you quickly realize how bad academic jobs are and how little anybody except academics cares about them. \n\nBut when I am still sipping the kool-aid, it's hard to believe.",
          "author": "DevFRus",
          "created": 1627868330,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h7cmjr5": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7cmjr5/",
      "text": "You can always come back to teach at a community college. We really value real life experience and a commitment to teaching and learning",
      "author": "MyiDEANtity",
      "created": 1627848761,
      "upvotes": 10,
      "replies": {}
    },
    "h7ckr5b": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7ckr5b/",
      "text": "I’m not in academia; indeed, I’m trying to return to academia with a PhD education starting from this fall, after 7-year industrial experience just after my graduation. So, I don’t agree with other people saying that if you go now, you won’t want to return. You can definitely return, even with higher motivation and valuable experiences. There are so many people who have non-traditional academic paths. So, it can be tough, but it can be done.",
      "author": "osedao",
      "created": 1627847905,
      "upvotes": 12,
      "replies": {
        "h7clntu": {
          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7clntu/",
          "text": "> I don’t agree with other people saying that if you go now, you won’t want to return.\n\nGood, it's absurd advice. Outside of the academy is better for some people, inside it is better for others. I know many that have gone both ways and even more that have contemplated or desired to move in both directions, but not done so. It's about finding what's right **for you** and that will be different for different people with different goals and life situations.\n\nPersonally, my spouse took three years off after their PhD and is now tenured. I took a couple and am as well. We are, just now, making as much as we did when we left industry, but are much happier with our lives as well. *That's us*, doesn't mean it's right for others.\n\nIt can be hard and it can take time to rebuild your momentum, but the idea that no one would *want* to possibly move back or forth is just absurd.",
          "author": "WrestlingStuffGuy",
          "created": 1627848334,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "h7d84g5": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7d84g5/",
      "text": "I left for about two years and returned, so it totally is doable. Don't let people scare you into leaving to try something. I don't regret leaving because I would have always wondered. Now I'm back with new appreciation of the things I do like about academia.",
      "author": "Condimentary",
      "created": 1627859344,
      "upvotes": 7,
      "replies": {}
    },
    "h7crxtg": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7crxtg/",
      "text": "If you have any interested in a faculty position at a PUI (teaching-intensive), the science communication work might actually improve your chances.  At least at my college, administration loves it when faculty engage the community and build a bridge.",
      "author": "ibgeek",
      "created": 1627851311,
      "upvotes": 5,
      "replies": {}
    },
    "h7curtj": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7curtj/",
      "text": "I had a friend who did it.  It's not common, but it can be done.  The longer you're out, though, the less likely reentry will be, partially because people wont want you as much, but more because you wont want to go back once you get real money.",
      "author": "bjos144",
      "created": 1627852686,
      "upvotes": 4,
      "replies": {}
    },
    "h7dhdfk": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7dhdfk/",
      "text": "I joined consulting after my PhD and after 10 years came back to academia. I become financially independent and came back just to teach which I love. I’m semi retired and don’t need the money but love teaching. I’m in finance/fin tech field so there is a big demand for my skills/expertise which allowed me to negotiate my hours.\n\nEdit: on mobile app, so edited my spelling!",
      "author": "algebragoddess",
      "created": 1627864280,
      "upvotes": 4,
      "replies": {
        "h7f50pu": {
          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7f50pu/",
          "text": "What fin tech field exactly, I am wondering because I am contemplating on wether I should walk a path like yours. \n\nI am in the proces of becoming a fulltime daytrader and it’s going well. I’d love to get more knowledge of quantitative finance or getting a degree in maths or something and become a professor",
          "author": "Deadly-Spartan",
          "created": 1627905937,
          "upvotes": 1,
          "replies": {
            "h7fxdcy": {
              "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7fxdcy/",
              "text": "I teach empirical finance and algorithmic trading. I love it! Math and mathematical statistics is important to understand what you are doing, especially if you interested in working on forecasting and predictability with financial data. Good luck!",
              "author": "algebragoddess",
              "created": 1627920153,
              "upvotes": 2,
              "replies": {
                "h7h0ing": {
                  "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7h0ing/",
                  "text": "Yeah I am trying to learn more maths that will help me make better decisions in the markets.\n\nI want to use probability and statistics and stuff in order to trade, and even write my own code to automate my strategies\n\nWhat more maths subjects do I need?",
                  "author": "Deadly-Spartan",
                  "created": 1627937116,
                  "upvotes": 1,
                  "replies": {
                    "h7hanvw": {
                      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7hanvw/",
                      "text": "Probability and statistics should be your foundation. I would also recommend linear algebra, differential calculus, familiarity with advanced time series models such as Arima etc. If you want to get into trading options and derivations, stochastic calculus will be key.",
                      "author": "algebragoddess",
                      "created": 1627941655,
                      "upvotes": 1,
                      "replies": {
                        "h7ivbqf": {
                          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7ivbqf/",
                          "text": "And what about crypto trading, is that more or less the same maths that I need to get an edge in the crypto currency markets",
                          "author": "Deadly-Spartan",
                          "created": 1627971605,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h7dj9f8": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7dj9f8/",
      "text": "Maybe. As a post doc. Follow by a huge pay cut.  Why though?\n\nWhat field!\n\nI finally landed a job very similar to what i wanted as an academic in the government. Pays better too. \n\nMaybe you can get what you want somewhere outside of academia?",
      "author": "BTownPhD",
      "created": 1627865294,
      "upvotes": 2,
      "replies": {
        "h7fnl1o": {
          "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7fnl1o/",
          "text": "Congrats on your government job! Those sound like a good gig.  My field is fisheries science. I’d love to work for government but (I’m in the US) I get the sense that government jobs are just as competitive as faculty jobs. I wonder if the grant writing and supervisory experience I would get in this new job would help or hurt me. I think it might help?",
          "author": "foundingflounders",
          "created": 1627915793,
          "upvotes": 2,
          "replies": {
            "h7gqvvq": {
              "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7gqvvq/",
              "text": "Thanks!  As i experience it, it is Competitive by numbers but not always by experience and specialty. \n\nPlus. There are a lot of smaller agencies people don’t know or think to apply for. \n\nMaybe fisheries science is competitive but i see postings all the time for usda and wildlife.   \n\nJobs are literally posted every week.",
              "author": "BTownPhD",
              "created": 1627932885,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h7gd0uc": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7gd0uc/",
      "text": "As someone who left the academic world shortly after getting my PhD, I would say it is worth the shot. You’ve already identified that there are more candidates than positions for tenure track roles and competition is intense. There are quite a few resources on how to transition out of academia available and once you get started I think you’ll understand it is less risky than you might currently think. Here’s one to get you started. https://www.findaphd.com/advice/doing/phd-non-academic-careers.aspx",
      "author": "micropterus_dolomieu",
      "created": 1627926849,
      "upvotes": 2,
      "replies": {}
    },
    "h7dajay": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7dajay/",
      "text": "I know many people who have left to have kids and then came back after the kid started school at 3-5. They are not working, just looking after their kids, then rejoin academia. You'll be ok if you are the best candidate, this 3-5 year gap doing nothing did make them less \"perfect\" for the position, but if you're the best still, you'll be ok I think.",
      "author": "PersonalZebra8993",
      "created": 1627860604,
      "upvotes": 3,
      "replies": {}
    },
    "h7eea8r": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7eea8r/",
      "text": "I left academia escaping a toxic postdoc supervisor. Spent a year training for, and then two years teaching highschool. Luckily a few papers trickled out from collaborations through that time, including a high impact one, and after the 3 years out I managed to secure another research position - in a less prominent institution, in a lower wage country. The first couple of years back in research were tough as my backlog of publishable work needed to build again, but I'm on my feet again now 4 years into the position. I do feel 'behind' and my publication record / h-index shows it too. I would say I was lucky to manage it (and I'm extremely happy that I did because although the pay is less, the facilities in the department I work in are an order of magnitude better than I've had before, despite the prominence downgrade). Anyone thinking to do such a thing, I would warn away from assuming you'll walk back into an another research position without a lot of luck and possibly some sacrifices.",
      "author": "PlayfulChemist",
      "created": 1627883551,
      "upvotes": 4,
      "replies": {}
    },
    "h7d6it7": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7d6it7/",
      "text": "Yea. Happens all the time.  It will be good for you.  No dead wood in private, but also fewer shining stars.",
      "author": "DesertAlpine",
      "created": 1627858520,
      "upvotes": 1,
      "replies": {}
    },
    "h7g3ktn": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7g3ktn/",
      "text": "Yes",
      "author": "DebilGob",
      "created": 1627922797,
      "upvotes": 1,
      "replies": {}
    },
    "h7dvee4": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7dvee4/",
      "text": "You might be able to, but it will be harder. Make sure you have strong supporters.",
      "author": "uniadminthrowaway",
      "created": 1627871708,
      "upvotes": 0,
      "replies": {}
    },
    "h7f9tde": {
      "link": "/r/AskAcademia/comments/ovx0mf/if_i_leave_my_postdoc_for_a_nonacademic_position/h7f9tde/",
      "text": "There’s a professor in my department who briefly left academia to work for a pharmaceutical company before returning. She’s incredibly successful now too so it can be done.",
      "author": "apathetic_girl_43",
      "created": 1627908888,
      "upvotes": 0,
      "replies": {}
    }
  }
}