{
  "sid": "osnhm2",
  "link": "/r/AskAcademia/comments/osnhm2/phd_part_time_work_full_time/",
  "title:": "PhD Part Time; Work Full Time?",
  "text": "Hi all, \n\nI've seen a few posts about working full time while pursuing a part-time Ph.D., but none hit the nail on the head for my situation. \n\nHere are a few fast facts about me and the Ph.D. I want to pursue:\n\n**Ph.D**.: In the Social Sciences \n\n**Location**: Enrolled at a mid-tier school in the UK. However, I'll be living, working, researching, and writing in a developing country.\n\n**Mode of Study**: External Ph.D. student, part-time\n\n**Year:** 2022-2028 or '29.\n\n&#x200B;\n\n**Full-Time Work**\n\n\\-I'm a librarian. I have a MLIS. The Ph.D. is not related to library science. but may tie in broadly. I don't need a Ph.D. to continue my career, but research libraries often take on Heads with doctorates. That's the end goal. \n\n\\- My job is flexible enough to carve out some time in the week to do some work during my workday. \n\n&#x200B;\n\n**Research**\n\n\\-My topic will relate to the country I'm living in, so I can do my field research here. \n\n\\-I do not require a lab.\n\n&#x200B;\n\n**Tuition and funding**\n\n\\- Funding my studies is not a barrier. \n\n&#x200B;\n\n**Why I want a Ph.D.** \n\n\\- Personal satisfaction, first and foremost. \n\n\\- Padding to take my career to the next level, though it's not strictly necessary in my field. \n\n\\- I'm passionate about the industry and want to be more involved.\n\n&#x200B;\n\n**Considerations**\n\n\\- I do not plan on pivoting into a role in research academia or professorships. \n\n\\- There are no first-year Ph.D. courses like North America. You jump straight into the dissertation.\n\n\\- The full-time program is three years. Part-time is six, but there's flexibility to extend.\n\n\\- I have very few personal or familial obligations. More time to dedicate to my program. \n\n\\- I have another master's by part-time distance education, and I know I can handle that level of study while working full-time. I understand that Ph.D. is a higher level - that's why I'm here. \n\n&#x200B;\n\n**Concerns**\n\n\\- Burn-out\n\n\\- Academic isolation?\n\n\\- Any others? \n\n&#x200B;\n\nI'm looking for insights from anyone who has a soc. sci. or humanities Ph.D., primarily if you've pursued it part-time while working full-time\n\n\\- What expectations did you make for yourself in a given week? Were there X numbers of articles to read, X numbers of words to write/ideas to commit to paper? \n\n\\- Am I remiss by not caring if I miss out on regular conference posters/presentations, networking, and opportunities to collaborate with new colleagues, given that I don't plan on pursuing a research/teaching position? I have a terrific network of colleagues in my professional field.\n\n&#x200B;\n\n**Thanks everyone**\n\nIf I forgot anything, please include it in the comments below. Please be kind. I'm just gathering as much information as I can to make an informed decision.",
  "author": "OcelotHistorical2885",
  "created": 1627394726,
  "updated": 1634082417,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "h6qsto7": {
      "link": "/r/AskAcademia/comments/osnhm2/phd_part_time_work_full_time/h6qsto7/",
      "text": "[removed]",
      "author": null,
      "created": 1627415163,
      "upvotes": -2,
      "replies": {}
    }
  }
}