{
  "sid": "8q1t9u",
  "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/",
  "title:": "I got a job! After a hellish year.",
  "text": "This is a long story, but I've wanted to tell it. I'm a regular lurker and commenter on this sub but creating an alt account to maintain my anonymity. The story has a happy ending, but it took a long time to get there. \n\nI finished my PhD in 2016 in Geography. I came out of one of the top graduate Geography programs in the US, but from a university that doesn't rank as 'elite'. Not all colleges and universities have Geography departments in the US and so people with Geography PhDs are often hired in departments that are interdisciplinary (such as environmental studies or international studies). I started applying for jobs in 2014-2015 while ABD and had a few phone and Skype interviews but nothing beyond that. I applied to all types of institution, in lots of different kinds of departments. I really didn't care about rank or anything like that, I just wanted a job. In 2015-2016, still ABD, I kept applying with no luck, and began to despair. I imagined a different life for myself outside of academia and began to mobilize some alternative options for myself. At the end of the Spring that year, I defended my dissertation, a few days later I half heartedly applied for one more job and got it! It was an NTT Instructor position at a large well-known research university in the US. I moved myself to a new place where I didn't know anyone in the summer of 2016 and started my first faculty position in an R1 Geography department that fall semester. \n\nSoon after I got to the new place, I met with my new colleagues and was told that they intended to hire a tenure track position for exactly the type of research that I do. Of course, I was immediately very excited about this. I really liked these people, loved my new students, and could envision a future for myself at this new university. From the time I got there in fall, 2016, I worked to distinguish myself. I published all of my dissertation that first year, and was able to submit some other publications as well. I consistently had stellar teaching evaluations. I began developing my next research project. My colleagues seemed supportive and I received very encouraging feedback about everything I was doing. Multiple people told me they wanted me to have the tenure track position when it came up. I tried to take this with a grain of salt, but of course I was very hopeful. \n\nIn the fall of 2017, my department posted the ad for the new tenure track hire. It was clearly written around what I do. It was quite obvious, even to the point that friends and colleagues elsewhere were emailing me to figure out if the job was for me or if they should bother applying. I advised people to apply, because I knew that I wouldn't be given any particular advantage over other applicants. Nonetheless,  I was very hopeful. But, I didn't want to think of it as guaranteed and I did continue to apply elsewhere for TT positions. I didn't have much luck. I was shortlisted at another R1 Geography program and (as anyone who has been on the market for awhile knows), applying for jobs is enormously time consuming and emotionally draining. After January, I stopped applying to other jobs and  decided to let the chips fall where they would. \n\nI made it to the campus visit stage in the TT search at my university. I felt like my interview went well. Throughout the process I was very aware of everything else that was happening (a common challenge for the internal candidate). I knew when search committee meetings were happening, I knew when other candidates were visiting, I knew something of the internal dynamics of the search. For complicated reasons, the search was drawn out, a final candidate interviewed a month after the initial interviews happened. Members of the search committee were out of the country off and on. It was about 2.5 months from the time of my interview to the time when they actually made a decision about the job. \n\nMeanwhile, I organized a conference on themes that related directly to the position. I continued to work on publishing, provided quality educational experiences for my students, and generally do my thing well. But I was under an intense amount of pressure. My insomnia was terrible. I was dealing with some crippling anxiety. I was socially isolated because everyone I knew in this new place was either a colleague or a grad student in my department. It seemed like a bad idea to unload my stress on anyone in my department while the search was underway, so I kept my distance and spent a lot of time alone. It was honestly one of the hardest times in my life. Being alone in a new place, not being able to reach out to the few friends I had made there, and feeling like everything I did professionally was being judged. I felt that I had to do everything right so that they would give me this TT job. I was a mess emotionally, but managed to keep it to myself and appear as if I was doing fine professionally. \n\nThey didn't give me the job. Worse, they didn't give it to anyone. It was a failed search. No one would ever give me a straight answer about why. My colleagues were mostly gaslighting me and acting as if I should not be impacted by how this all played out. Senior colleagues said things like, \"I had lots of jobs I didn't get\" and tried to act as if they knew my experience. But they didn't. They all got TT jobs within a year of finishing their PhDs (most straight out of grad school) none of them had to go through what early career people do today. A couple colleagues even offered to help me improve my application materials so that when they re-run the search next year I would be better prepared. I tried to be polite and not burn bridges, but all of this was insulting and hurtful. I'd already made it to the campus visit stage. I felt that they had their opportunity for me to be a part of their department long term and they didn't take it. So why would I bother putting myself through another year of that hell? \n\nAs I saw it, my only pathway forward was to leave. But the NTT position I was in wasn't terrible so I couldn't just take anything. I knew it was a long shot but I applied to a few jobs that were posted in April. I got 2 on site interviews. One of them was an amazing good fit at an R1 near where I did my PhD. It's a great city that I love and I have friends in the area. The interview was like a great blind date. I loved it there and I could tell that their department was really excited about me. The day after I got back from my interview, I had an informal offer from the chair and after a bit of negotiation, I signed the offer letter and am now on my way to a TT position in a place I am very excited about. I really can't get over my good fortune here, especially after such a hellish year. So, after 4 years on the job market and a terrible experience an internal candidate, I finally got the job. It felt great to email my current colleagues brief polite emails about my imminent departure.  \n\nIf you made it to the end of this, thank you for reading. I am mostly posting this for my own catharsis, but also for grad students with academic aspirations and others still on the market. Good luck to all, the market is brutal and demoralizing. \n\nThe End \n",
  "author": "anonfacultyobserves",
  "created": 1528647165,
  "updated": 1634080719,
  "over_18": false,
  "upvotes": 195,
  "upvote_ratio": 0.97,
  "comments": {
    "e0fs6uq": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fs6uq/",
      "text": "Congratulations! Your story is important and I'm glad you shared it with the wider community. \n\nTo me, it suggests something about your grit and determination, but also the importance of self-care and not getting your hopes up for ANY job situation until the ink is dry on the offer letter. \n\nKeep on keeping on, take some time to celebrate, and again thanks for sharing. ",
      "author": "TrustMeIAMAProfessor",
      "created": 1528648212,
      "upvotes": 37,
      "replies": {
        "e0fvuuy": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fvuuy/",
          "text": "Thank you for the supportive comment!",
          "author": "anonfacultyobserves",
          "created": 1528651963,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "e0g824b": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0g824b/",
      "text": "GEOGRAPHERS UNITE!\n\nCongratulations! The job hunt is scary and disheartening and humbling, but you made it! I have only one question:\n\nPhysical geography or Human geography? ;)",
      "author": "arabis",
      "created": 1528664309,
      "upvotes": 19,
      "replies": {
        "e0gl8xm": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gl8xm/",
          "text": "Human! I'm pleasantly surprised to see so many geographers commenting, there are more of us lurking this sub than I realized. ;)",
          "author": "anonfacultyobserves",
          "created": 1528678499,
          "upvotes": 8,
          "replies": {
            "e3z82mj": {
              "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e3z82mj/",
              "text": "Really late to this party, but I'm with you guys. And it sounds like a familiar story. \n\nMy advisor finished her PhD in 2004 (medical geography), went straight into a tenure-track job at an R1. Looking around myself, it seems that even the small regional college next door puts their geographers into NTT instructor positions. \n\nMy own alma mater got 150+ applications for their TT position, and most of them had years and years of post-doc or were already tenure-track elsewhere. \n",
              "author": "Ut_Prosim",
              "created": 1533940606,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "e0ghy2n": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0ghy2n/",
          "text": ">Physical geography or Human geography?\n\nAre there still people doing Ph.D.s in human geography?  Back two decades ago I hunted down the last remaining cultural geographer in the department at my R1 so I could do some directed reading with him\\-\\- literally everyone else in the department had gone all\\-in with remote sensing/GIS/etc. to the point that he was literally in a basement office all alone.",
          "author": "SnowblindAlbino",
          "created": 1528674642,
          "upvotes": 4,
          "replies": {
            "e0gi1i3": {
              "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gi1i3/",
              "text": "Well... I do.\n\nI am a social scientist, probably best described as a behavioral geographer.  I know lots of others like me—though I’m from Canada, and it’s a different landscape (haha) up there.",
              "author": "arabis",
              "created": 1528674752,
              "upvotes": 12,
              "replies": {}
            },
            "e0gixv4": {
              "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gixv4/",
              "text": "Human geography might be the bigger of the two main subfields right now.",
              "author": null,
              "created": 1528675784,
              "upvotes": 6,
              "replies": {
                "e0gno12": {
                  "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gno12/",
                  "text": "That's good to know-- as an historian I was/am a big fan of the classic human geographers of the post-war era (i.e. Carl Sauer) and the generation that came right after (Donald Meinig, Wilbur Zelinsky,  Yi-Fu Tuan, etc.).  Their work informed my own theoretical orientation as my field (environmental history) was taking shape in the 1980s/90s, but by the time I was trying to find working geographers to guide me through their work in the early 1990s they had become a small minority in a sea of GIS acolytes.",
                  "author": "SnowblindAlbino",
                  "created": 1528681323,
                  "upvotes": 2,
                  "replies": {
                    "e0go12f": {
                      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0go12f/",
                      "text": "The early-90s was, I think, the new boom. David Harvey and Neil Smith had been around, obviously, but Michael Watts taking a position in the geography department at Berkeley and churning out an entire generation of really great human geographers working in political ecology (who are now all senior scholars with dozens of their own students) has really made the field grow in the US. But, like the OP said, there aren't very many actual geography departments so geographers end up all over the place. I'm starting a job in an anthropology department in the fall, for example. With administrators cutting and combining programs, I don't expect to see them start adding back the geography departments they started cutting in the 80s and 90s even with this regrowth. ",
                      "author": null,
                      "created": 1528681734,
                      "upvotes": 1,
                      "replies": {
                        "e0gocrt": {
                          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gocrt/",
                          "text": "> The early-90s was, I think, the new boom.\n\nI was just a bit too late then, and done taking grad courses by '95. While I'm aware of political ecology as a subfield, most of my contact with it is peripheral, usually through geographer-colleagues working in interdisciplinary programs like environmental studies or planning. I'm glad to know the field as a whole didn't go 100% into remote sensing (as it was at my R1) but of course saddened that so many departments are simply gone now, especially at smaller schools like my own. That's been reality for a long time though, even the SLAC I attended in the early 1980s did not have a single geographer on the faculty after the mid-1970s.\n",
                          "author": "SnowblindAlbino",
                          "created": 1528682097,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e0fy1nd": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fy1nd/",
      "text": "Oh man. I will contribute to this only because I think it goes along with your post. I'm absolutely not saying you did anything I'm detailing here.\n\nWe didn't hire one of our internal candidates once. It was terrible.\n\nEveryone was on-board with him for the beginning. He was a NTT in the department for several years. Really did a lot of great work (both research and teaching) in the department. The sticking points:\n\n1. There were a few professors in the department that he really rubbed the wrong way. People that he had gotten into email \"fights\" with about things that were, overall, pretty trivial. Ones where the chair had to tell him to STOP. And he didn't. He totally didn't see this as an issue, as he thought he was in the right. \n\n2. Had started policing the place like he owned it. See a student working alone in the lab? Kick them out. Even if their advisor is down the hall in the fucking bathroom. Not only was that not his place, but it was completely absurd.\n\nThose two things were enough to give everyone enough pause to ultimately say no. I mean, literally, every single person in the department voted for someone else. Even if they weren't the person on the receiving end of his issues. We ultimately just didn't want to work with someone that would be an issue with how we do things. We ultimately hired someone else, not a failed search. \n\nWe have also had failed searches before, and sometimes it is unavoidable. If there were good candidates but the school withdrew money, failed. If there were no good candidates, failed. If there was a reason to think the pool of candidates was not diverse enough by HR, failed. I think I've seen it failed many more times than not when it was an issue of circumstance completely out of our control. ",
      "author": null,
      "created": 1528654173,
      "upvotes": 8,
      "replies": {
        "e0fyxum": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fyxum/",
          "text": "Very interesting! And yes, quite different from my situation. I know I am well-liked, and had multiple people telling me they were advocating for me to have the job. But I do think there was some internal nastiness that happened during the search committee meetings. People are keeping this pretty quiet but a couple mentioned that the meetings were at times quite heated and emotional. So I do think there was a lot of disagreement over what should have happened. ",
          "author": "anonfacultyobserves",
          "created": 1528655067,
          "upvotes": 3,
          "replies": {
            "e0heysm": {
              "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0heysm/",
              "text": "[deleted]",
              "author": null,
              "created": 1528723380,
              "upvotes": 1,
              "replies": {
                "e0hhyf6": {
                  "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0hhyf6/",
                  "text": "Yes, I'm sure that more of the story will be revealed in time. I haven't been in a place mentally where I want to really talk about it, mostly I feel betrayed by people I trusted and do not want to spend time with them. But I'm sure you are correct, it would have been a way to get more information. Maybe at some point in the future when I have moved past it all.",
                  "author": "anonfacultyobserves",
                  "created": 1528726619,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "e0gi86o": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gi86o/",
          "text": ">We didn't hire one of our internal candidates once. It was terrible.\n\nThis candidate sounds like a mess, frankly. As a department chair I would likely have not recommended a second year as non\\-TT given that behavior. Certainly such a person would not have made it onto a short list in a search. One thing my colleagues and I always try to keep in mind is that anyone we hire on the TT may well be with us 30\\+ years and will likely be chair someday. There's no way we'd consider anyone who revealed themselves to be unpleasant, cocky, pushy, or uncolleagial to anyone a viable candidate...we've had TT candidates blow it by being dismissive to our support staff so this would be beyond the pale.",
          "author": "SnowblindAlbino",
          "created": 1528674964,
          "upvotes": 4,
          "replies": {
            "e0gj4nr": {
              "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gj4nr/",
              "text": "What was so strange is it only started the semester they applied for the job. The rest of their years were completely fine.\n\nOnly after we did all the interviews and sat around to discuss the candidates was it revealed that some people had been having these issues. The committee asked the chair for clarification and confirmation. \n\nSo yeah, if you are a shoe-in for a TT line at a place where you've done awesome work for years, don't turn into an asshole during the search. I'm still disappointed in that person.",
              "author": null,
              "created": 1528675998,
              "upvotes": 4,
              "replies": {}
            },
            "e0gvbf1": {
              "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gvbf1/",
              "text": "> There's no way we'd consider anyone who revealed themselves to be unpleasant, cocky, pushy, or uncolleagial to anyone a viable candidate\n\nFrom my admittedly limited experience, some of these negative qualities don't appear until after someone is hired. My department recently hired a faculty member who seemed excellent and collegial throughout the application process, but was not the first choice. This person was a disaster as a pedagogue (holding roughly 60% of course sessions) and unfriendly/uninterested the remainder of the time. I spoke with the faculty member 3 times, which was on the high side, and the faculty member **never** attended colloquia and only rarely attended lunch presentations. \n\nI say \"was\" because the faculty member resigned. ",
              "author": "psstein",
              "created": 1528689636,
              "upvotes": 1,
              "replies": {
                "e0he4or": {
                  "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0he4or/",
                  "text": "> I say \"was\" because the faculty member resigned.\n\nUgh. Sometimes hires do go wrong. Someone like you describe probably wouldn't make it to a second year with us even on a TT contract...prior to third year review we have significant annual reviews and would make it clear that they weren't going to make it. Indeed, I had an term hire once who cancelled a similar number of classes and the dean and I stepped in mid-semester to make it clear that we would have him replaced immediately if that didn't stop (and we did let him go at the end of the semester, the first of what was supposed to be a three-year contract). \n\nSometimes people just don't/can't/won't do the job, as with any other occupation.",
                  "author": "SnowblindAlbino",
                  "created": 1528722356,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "e0gz6gi": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gz6gi/",
          "text": "> If there was a reason to think the pool of candidates was not diverse enough by HR, failed.\n\nOut of curiosity, what is the penalty here? I'm not questioning the value of having a diverse department or diverse pool of applicants, just curious about the fallout. So if HR sees that the pool of candidates does not meet their expectations for diversity, what are the consequences for the department? Can HR unilaterally terminate the job search?",
          "author": "phsics",
          "created": 1528695126,
          "upvotes": 2,
          "replies": {
            "e0hdo7c": {
              "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0hdo7c/",
              "text": "So, in my experience, when the pool wasn't diverse enough, they made us keep the listing open for longer. Far too long. We end up with a candidate pool where all the great people have found other jobs by the time we even get to phone interviews. So we call it failed, because all the good people were gone.",
              "author": null,
              "created": 1528721784,
              "upvotes": 3,
              "replies": {
                "e0hhoiu": {
                  "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0hhoiu/",
                  "text": "Interesting. Thanks for the reply.",
                  "author": "phsics",
                  "created": 1528726336,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e0fv3ov": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fv3ov/",
      "text": "CONGRATS! Persistence and hard work pays off! Enjoy some R&R with the comfort of knowing they want you!",
      "author": "Evergreen3",
      "created": 1528651190,
      "upvotes": 9,
      "replies": {
        "e0fvver": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fvver/",
          "text": "Thank you!",
          "author": "anonfacultyobserves",
          "created": 1528651978,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e0fx6a0": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fx6a0/",
      "text": "Congrats!\n\nDo you have any idea for why your current department had a failed search? I sometimes wonder if accepting an NTT in hopes of getting TT isn't a bad idea because it's unlikely, but because working in the department gives the opportunity for politics/personal vendettas to arise when they wouldnt otherwise.",
      "author": "riggorous",
      "created": 1528653300,
      "upvotes": 5,
      "replies": {
        "e0fyry7": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fyry7/",
          "text": "Thank you! I have some idea, but it's vague and unsatisfactory. I think there is a lot people are not saying. Basically, they ranked the final candidates and decided that if the top 2 didn't take it, they weren't hiring anyone. I was #3 of 4 finalists. #1 was someone who had offers all over the country, from an elite school, had all kinds of amazing things going on. #2 was someone I didn't know much about, but I guess ticked more of their boxes than I did. So #1 and #2 took other offers. Pretty sure my (soon to be former) colleagues thought I would still be there regardless of how the search turned out. A known problem with internal candidates is that you are less new and exciting than the external candidates. I think that was a big part of how it went down. ",
          "author": "anonfacultyobserves",
          "created": 1528654902,
          "upvotes": 19,
          "replies": {
            "e0g2ybw": {
              "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0g2ybw/",
              "text": "Yeah, I’m pretty sure I didn’t get a postdoc at one location because I had spend an academic year there in that group as a grad student. Did good work, got a publication out of it, got along well with everyone. But i think familiarity breeds ennui, if you will, and they weren’t interested in me as a candidate.",
              "author": "bojibridge",
              "created": 1528659136,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "e0fy4hs": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fy4hs/",
      "text": "Congrats! The job search is hell.",
      "author": "Dr_Marxist",
      "created": 1528654255,
      "upvotes": 4,
      "replies": {
        "e0fz8c4": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fz8c4/",
          "text": "Thanks!",
          "author": "anonfacultyobserves",
          "created": 1528655362,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e0ghuvm": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0ghuvm/",
      "text": "Congrats OP! This sounds like the best possible outcome given your circumstances, and better than staying at your first school. It also underscores the risks of being an internal candidate...it's a tough position to be in, and often hard on departmental colleagues as well. Glad you were able to negotiate it while building your c.v. on the way to a better TT job.",
      "author": "SnowblindAlbino",
      "created": 1528674537,
      "upvotes": 4,
      "replies": {
        "e0glws5": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0glws5/",
          "text": "Thank you! And yes the internal thing was awful, I had read all the online advice and been warned by people, I knew it would be challenging. But it ended up way more difficult than I was prepared to deal with.  I think you are right, it was somewhat traumatic for my colleagues as well as the grad students in the program. They took the process seriously and invested a lot of time and energy. And I think my colleagues genuinely like me and it was hard for them to know how difficult the process was for me. Not that it excuses anything, but a failed search is nearly always a rough time for a department, especially when there is an internal candidate.",
          "author": "anonfacultyobserves",
          "created": 1528679274,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e0g7igc": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0g7igc/",
      "text": "Congrats on the job! Also, I think I know who this is and, if so, heard that the TT search at your institution was a mess. Regardless, I'm glad to see you pulled through!",
      "author": null,
      "created": 1528663751,
      "upvotes": 7,
      "replies": {
        "e0glaez": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0glaez/",
          "text": "Cryptic. ;) Maybe you do know!",
          "author": "anonfacultyobserves",
          "created": 1528678546,
          "upvotes": 4,
          "replies": {
            "e0gnbj3": {
              "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gnbj3/",
              "text": "If I do, then I will say that I had dinner with someone on the search committee and they told me it was a mess from drafting the job ad. I commented that I applied but really had no idea if I would be a good fit and how hard it was to write a cover letter that actually addressed the ad and the mentioned that it was way too vague for how specific of a person they were looking for. (Based on the description they gave me, I wouldn't have applied because it was so far out of my area of research but that wasn't clear from the ad.) So the applicant pool ended up being all over the place and that soured things from the start. After the interviews they kind of knew the #1 candidate wasn't going to take it no matter what they offered so it was really between you and the #2 person, who had just turned them down. They said they had been pushing for you but that others wanted to try again next year with a better description in the ad. It sounded like their assumption was definitely that you'd be there and would be a finalist again.",
              "author": null,
              "created": 1528680944,
              "upvotes": 10,
              "replies": {
                "e0gnwi8": {
                  "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gnwi8/",
                  "text": "Ok yeah, this sounds like the situation. It was pretty obvious people thought I'd go through it again next year. So happy that will not be happening! It would have been  rough. Even if I hadn't got this other job I wasn't going to re-apply. That ship sailed.",
                  "author": "anonfacultyobserves",
                  "created": 1528681587,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e0gj2um": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gj2um/",
      "text": "Congrats! The search process is such a meat grinder, and it’s really nice to hear a story with a happy ending. ",
      "author": "Ronnie_Pudding",
      "created": 1528675941,
      "upvotes": 3,
      "replies": {}
    },
    "e0gi0x5": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gi0x5/",
      "text": "Just finished my second year in my geography PhD and I'm glad to hear your search had a happy ending! Any tips for people much earlier on in our field? Also human or physical, and what type of methods? ",
      "author": "ohsideSHOWbob",
      "created": 1528674733,
      "upvotes": 2,
      "replies": {
        "e0gjrwx": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gjrwx/",
          "text": "Not OP, but a geographer starting an NTT job in the fall. Publish in top quality journals as early and often as possible, get a copy of *The Professor Is In* and start thinking about things like your CV now, and keep an eye on job ads to see what departments are looking for and each fall check out department websites to see the profiles of any new hires. TT jobs in the US (at least for human geography) are looking for people with ~3 publications out before moving them to the long list, based on my experience this year (and talking to people on search committees after the fact.) Also, if your department is hiring, find out if you can be a part of the process or sit in on meetings and the like. They might say no, but I did this and it gave me a lot of insight into how arbitrary some aspects of the search process can be.",
          "author": null,
          "created": 1528676744,
          "upvotes": 3,
          "replies": {
            "e0gl0j5": {
              "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gl0j5/",
              "text": "Yes, good advice here. The more pubs you have, the more competitive you are. But it's never a simple formula. Pubs, teaching experience, grant money and awards. It all matters, just try to develop your CV as much as you can while in grad school to give yourself flexibility for different types of positions when you are on the market. And practice lots of self care along the way.",
              "author": "GrandmaMabelGrey",
              "created": 1528678223,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "e0glf97": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0glf97/",
          "text": "I'm a human geographer, qualitative methods. Tips- as others have said, do what you can to build your CV as much as you can, and be open to a variety of future directions within and outside academia.",
          "author": "anonfacultyobserves",
          "created": 1528678704,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e0g3wyw": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0g3wyw/",
      "text": "Thank you so much for sharing your story here. \n\nI'd like to contribute a structural POV to the conversation: I was once in an interview with a program (as a potential PhD admit) and I asked how they saw their faculty hiring practices over the next several years as a component of their larger research agenda. \n\nThe committee responded in depth, describing how departments plan out, years in advance, what \"sort\" of department they want to be, what sort of research they want to produce, and what sort of position they ultimately desire in their field. Hiring and admission practices are bricks in this type of long-term agenda-building. \n\nIt could be that your research simply wasn't a match with the sort of department they want to be ten years down the line. This has, I'm sure, very little to do with the quality of work (which, from the quality of your writing, I can assume to be high), and everything to do with the direction they want to take the program in. \n\nAgain, thank you for your story, and congrats on the new job!",
      "author": "the_girl",
      "created": 1528660106,
      "upvotes": 3,
      "replies": {
        "e0gickq": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0gickq/",
          "text": ">The committee responded in depth, describing how departments plan out, years in advance, what \"sort\" of department they want to be, what sort of research they want to produce, and what sort of position they ultimately desire in their field.\n\nThis is very true. Even my SLAC department has a 10 years strategic plan that lays out exactly what sort of faculty we will prioritize for future hires or replacements for retiring colleagues. We've pretty much stuck to those plans for the two decades I've been here, with only modest exceptions. We have our \"next\" four hires clearly mapped out even though we don't anticipate hiring anyone on the TT in the next several years.",
          "author": "SnowblindAlbino",
          "created": 1528675105,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e0hgzl9": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0hgzl9/",
      "text": "Great story and congrats!!!",
      "author": "nas_deferens",
      "created": 1528725612,
      "upvotes": 1,
      "replies": {}
    },
    "e0ft7qx": {
      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0ft7qx/",
      "text": "[deleted]",
      "author": null,
      "created": 1528649246,
      "upvotes": -2,
      "replies": {
        "e0fuu0o": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fuu0o/",
          "text": "I studied “geography.”  Want to know what I do? I do statistics. I can make maps. Many times to do this I use big data. Why shouldn’t there be jobs for me? How are statisticians who can make maps and have experience with big, messy datasets not useful?",
          "author": "amos_mccoy",
          "created": 1528650914,
          "upvotes": 4,
          "replies": {
            "e0fv710": {
              "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fv710/",
              "text": "[deleted]",
              "author": null,
              "created": 1528651286,
              "upvotes": -4,
              "replies": {
                "e0fvz13": {
                  "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fvz13/",
                  "text": "Geography is far from 'empty'.  But those of us in the field do often have to deal with others' ignorance about what we do and that can be a bit frustrating.",
                  "author": "anonfacultyobserves",
                  "created": 1528652081,
                  "upvotes": 10,
                  "replies": {
                    "e0fwaqi": {
                      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fwaqi/",
                      "text": "I absolutely agree with both points; obviously there's something out there both educationally and professionally otherwise it wouldn't exist. I can imagine for geographers and geosicentists it's not easy to 'defend' your passion.   \nBut as the downvotes go, It's not OK to be part of the layperson and have any sort of viewpoint other than 'it's a flawless, amazing field' I guess. ",
                      "author": "Hardcore90skid",
                      "created": 1528652414,
                      "upvotes": -1,
                      "replies": {
                        "e0fx0gu": {
                          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fx0gu/",
                          "text": "The downvotes are because you're being a dick. You could have asked your questions in a respectful manner but you chose not to. \n\nAlso, understanding geopolitical issues in a quantitative way is a very employable skill in a variety of fields. I study economics, but I wish I would have gone with my original intention of geography because it would have been far more useful.",
                          "author": "riggorous",
                          "created": 1528653137,
                          "upvotes": 7,
                          "replies": {
                            "e0fxipn": {
                              "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fxipn/",
                              "text": "> Also, understanding geopolitical issues in a quantitative way is a very employable skill in a variety of fields.  \n\nAbsolutely, I agree completely. I think you and some others interpreted my concerns with 'geography' as 'there's absolutely no possible skills that geography teaches that are employable', when no, because I would have no way of knowing that geography apparently teaches statistics, quantitative analysis, data science, and all of these other great skills. And I'm sorry, but I'd find it a great challenge to accept that anyone who is studying geography knew all of those things starting out when they got into the field.   \n\n\n> The downvotes are because you're being a dick. You could have asked your questions in a respectful manner but you chose not to. \n\nI truly don't think so. I'm not being a dick,or at least I didn't choose to inquire in a disrespectful manner. While I fully grasp that intent =/= result, in this case I was truly asking in what I consider a lighthearted way, that I didn't think it's rational to have thought when you started your undergrad in geography, that you'd be able to pick up an easy, well\\-paying job anywhere. That's all. It's just not as an obviously employable career as some other fields are and I feel that perhaps you and the others downvoting me are drawing from their identify scripts and being defensive. The notion of 'well obviously MY field is great, \\*I\\* wouldn't go into a lacklustre field' rather than 'yeah, the average person probably wouldn't know that geography is a broad, great field, and it took me some time to realise how awesome it would become.'   \nI do sincerely apologise if I came across as offensive or abrasive, however. \n\n\nedit: I am also not trying to call geography a lacklustre field, just using an example statement. How would you have phrased the question?",
                              "author": "Hardcore90skid",
                              "created": 1528653645,
                              "upvotes": 1,
                              "replies": {
                                "e0fz204": {
                                  "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fz204/",
                                  "text": "My field is great! And we do have a hard time explaining to others that geographers don’t just memorize maps, that geography is different from cartography, and that it’s a heavily quantitative and incredibly useful specialty. I personally didn’t know that I could get a degree focused on what I study until after I had started an economics doctorate program. So my field is definitely flawed. \n\nMy point was that it’s mildly rude to say “you got a degree in X, how was that ever going to work out for you!?” I’m in a highly interdisciplinary field, and I come across a lot of scholars who have niche degrees. I used to think along similar lines — why would you spend so much time, energy, and money studying *that* useless area — but I used to not say anything because I was so junior. Now I would never voice that opinion, because I’ve noticed that a) I’m always proved wrong, and b) I usually have no idea what that person does. \n\nAnyways, maybe I should’ve used less abrasive language in my response. You clearly didn’t mean to offend. I’m happy that you learned something about our field today, and usually I try to be more diplomatic about it. I apologize for that!",
                                  "author": "amos_mccoy",
                                  "created": 1528655182,
                                  "upvotes": 6,
                                  "replies": {
                                    "e0g0ccb": {
                                      "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0g0ccb/",
                                      "text": "Yes, you're right that it is rude to ask that question but mine wasn't 'what can you do' but more '(in the beginning) you didn't expect an amazing career, did you?' which in my opinion differs strongly. But I was and am keen curious to learn about why these degrees are necessary, I love to learn how disciplines like geography fit into society at a high level. \n\nThank you for helping me understand. ",
                                      "author": "Hardcore90skid",
                                      "created": 1528656492,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e0fu412": {
          "link": "/r/AskAcademia/comments/8q1t9u/i_got_a_job_after_a_hellish_year/e0fu412/",
          "text": "A. I was naive, didn't know the market, and sincerely loved being a geographer.\nB. I love teaching, not sure I see where your question is coming from.",
          "author": "anonfacultyobserves",
          "created": 1528650167,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}