{
  "sid": "r6rb2z",
  "link": "/r/AskAcademia/comments/r6rb2z/quarterlife_crisis_about_reentering_academia/",
  "title:": "Quarter-life crisis about re-entering academia. imposter syndrome. halp",
  "text": "Hey academics, I'm in a quarter-life crisis related to academia, and I would really appreciate your input on things. \n\nI graduated with honors from a top-10 college in 2019. I was *so* passionate about my field (humanities / social sciences), although there were certainly toxic features of academia that burnt me out as a student with marginalized identities. I knew I wanted a PhD eventually, but I also felt a deep need to step away from all of it and focus on being a body. \n\nIn these past couple years out of school, those exciting ideas that once consumed my life have become... almost completely irrelevant, and now I'm feeling really lost. Ngl, it's hard to motivate myself to pick apart dense theoretical texts when I'm not in an intellectual environment with other people who are also excited about these things. And especially with quarantine, I've just been balls deep in the mind-numbing spell of American suburban isolation and media/dopamine over-consumption, which feels like a complete alternate reality from undergrad, where I was buzzing with ideas and inspiration and things I wanted to learn. But it's damn near impossible to read through idk Deleuze in this attention economy, with concerns about jobs and housing and bills and pandemic brain-fog, without help from the structure of school. \n\nOn top of that, I've barely revisited the material I studied in college, so I feel super rusty on it, which is contributing to my imposter syndrome about even applying to go back to school. I also don't know much about what higher ed is like beyond college. Despite how much I wish I was learning & producing knowledge again, and how much I need structure/resources/community (i.e. school) to do this, my anxiety and dread about the whole process of applying to school is so bad that I haven't been able to bring myself to research masters / PhD programs to apply to, or reach out to my old professors for advice or recommendations. It's now December, and I'm feeling terrible about myself. \n\nI guess my practical question is: what should I do about grad school applications this cycle, is it too late? I feel like with all of these issues, I'm just not ready to apply this winter, but I'm afraid that the longer I'm out of school, the worse this will get. I'm 25 now. \n\n(**Tldr)** I'm also struggling with questions like**:** If I were truly aligned with academia, shouldn't I be passionate enough to study these things on my own outside of academia? (Do you, reader, feel this passionate?) Like apparently, I don't pick up a book on any of that material when there's no academic institution holding me accountable to doing it -- is that what other people in academia are like too, or do I just lack genuine passion? Am I just wanting to enter academia because I miss excelling at something, and I only know how to excel at academics? Am I just wanting to enter academia because I feel lost without school, since I've been in school all my life? And if the \"Ivory Tower\" is the only setting that affords/incentivizes me to pursue my intellectual passion (which is definitely on the esoteric, ivory-towery side), is my passion really relevant at all?\n\nsome of these questions are kind of embarrassing and silly and don't make complete logical sense, but they feel very real to me. I'd really appreciate any reflections, advice, perspective. If you've ever wondered these questions yourself, would doubly love to hear how you've negotiated it. (Please be kind!)",
  "author": "perpetual_sigh_",
  "created": 1638398116,
  "updated": 1638479825,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.54,
  "comments": {
    "hmvakq7": {
      "link": "/r/AskAcademia/comments/r6rb2z/quarterlife_crisis_about_reentering_academia/hmvakq7/",
      "text": "It sounds like you need to meditate on this before acting.\n\nThe PhD deadlines are basically right now, so that's not going to happen. You could find M.A.s with rolling or later deadlines, but it sounds like you need to figure things out first.\n\nWhy not start reading a bit a few nights a week and see how that feels. If its sustainable and inspiring think about researching programs for next application cycle. There's no rush.\n\nFinally, the academic job market is horrendous, and many people leave academia or can find no academic employment after. Keep that in mind.",
      "author": "gggggggggggfff",
      "created": 1638405417,
      "upvotes": 3,
      "replies": {}
    },
    "hmvb0za": {
      "link": "/r/AskAcademia/comments/r6rb2z/quarterlife_crisis_about_reentering_academia/hmvb0za/",
      "text": "All of these are thought-provoking questions worthy of deep consideration. Still, even without addressing them first, though I recommend you do in time, you can consider applying for grad school because you want or need to, feel ready to, or are interested in pursuing your options. \n\nI started my Masters degree at 28, & my PhD at 30; our age is not indicative of our abilities or will. You have likely been engaging so many different situations of learning since you graduated; that you haven’t picked up a subject specific text since then, which as you note has been during a long period of total fucking upheaval, doesn’t negate any knowledge you have acquired. Now, passion…is a tricky thing. Passion for a subject/field is all well & good, but the ability to grow & then maintain it is impacted by every force we feel, & experience. It ebbs & flows, on a tidal scale we can’t control or track all that well. If your passion, for yourself, is pushing you to look into it, let that passion be your internal force. If/when you apply to some programs, when you get accepted (I prefer to leave the if out of this one) this passion may be a spark you can use to reignite some of your old passions. Academia is many things, but for now, in reference to this reply, know that whatever it is, involves/includes you if you want it to.\n\nDuring my own quarter-life crisis (now way too close to a quarter of my life ago than I am comfortable with), I questioned many similar things. Hindsight helps me see now that most, if not all, of what I questioned was borne out of imposter syndrome. The ‘real’ me isn’t what imposter me tried/tries to whisper into existence; so to are you not what/who imposter you tries to make you suspect you are. Research some programs, learn about each & about what they offer, then, if you’re still interested, apply, regardless of what imposter syndrome would have you otherwise do.",
      "author": "Mists_of_Analysis",
      "created": 1638405615,
      "upvotes": 3,
      "replies": {}
    },
    "hmvkcle": {
      "link": "/r/AskAcademia/comments/r6rb2z/quarterlife_crisis_about_reentering_academia/hmvkcle/",
      "text": "I took 4 years off in between and it was an excellent choice, I don't think it hurt me at all. Sure, i was rusty but once i started reading the materials and talking with people in the field (potential advisors)the questions came naturally! Something I found really helpful was being forced to explain exactly what i wanted to do in my statement of purpose. You sound like someone who understands assignments. I think you'll find that one promoted to put your motivations down on paper you'll be forced to think a bit deeper about the state of your field and how you can contribute.\nAdditionally, start researching programs, find an academic whose work inspires you and read their publications! (At least the abstract). I bet you'll find aome inspiration there. \nAt this point, i would wait another year to apply, its the 11th hour for most applications and you don't want to sell yourself short with a half ass attempt. Enjoy the rest of your year and start working on the slowly next August/September.",
      "author": "Mysterious_Sugar",
      "created": 1638409676,
      "upvotes": 2,
      "replies": {}
    }
  }
}