{
  "sid": "omx1sj",
  "link": "/r/AskAcademia/comments/omx1sj/advice_on_leaving_a_postdoc_after_1_year_with_job/",
  "title:": "Advice on leaving a postdoc after 1 year (with job in hand) [Biology, Postdoc year 1, USA]",
  "text": "The lab was not a good fit and I am currently interviewing for industry positions. Things appear promising and I expect I will have to tell my postdoc advisor that I found a job and am leaving before the end of this year. I currently feel some guilt and dread about this. Many others in this lab are doing the same, including someone who just got a job and will leave imminently. This person in particular is quite comfortable with the burned bridge so has no pertinent advice for me. \n\nThe idea of resigning is especially difficult bc one of the reasons was a toxic lab environment that wasn't present/obvious during the interview. How does 1 year postdocs look to employers? I am in a field where the average postdoc length for tenure track is 5 years. I have a feeling that my resignation will come more of a surprise to her because I was treated with some degree of favoritism relative to the other postdocs, but I have more solidarity for my fellow labmates and did experience the same bad environment. Despite the environment I actually don't hate the PI and would like to not burn the bridge.  For example, is a letter or meeting better? What if the PI is notoriously difficult to reach in person?",
  "author": "tarojelly",
  "created": 1626635213,
  "updated": 1634082511,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "h5pzehx": {
      "link": "/r/AskAcademia/comments/omx1sj/advice_on_leaving_a_postdoc_after_1_year_with_job/h5pzehx/",
      "text": "I did this. I had a postdoc that was nominally two years, and I decided to leave after one for an industry role. I am still in this industry role nearly a decade later and I love it.\n\nEmployers in industry absolutely do not care how long your postdoc was, or whether you even had one. So don't worry about that.\n\nEveryone was pretty surprised when I told them I was leaving the postdoc for industry - my two postdoc PIs, the director of my postdoc program, everyone in my small research center, and my advisors from graduate school. I was doing pretty well in academia - some papers, some grant funding, a great postdoc - I just didn't like the work or lifestyle.\n\nBefore I told anyone, I had the offer in hand and negotiated a start date that gave me time to wrap up projects. I came up with a plan for how I wanted to wrap up my projects and who to pass them to. When I sat down with my PIs, I not only told them where I was going and when, but also what my plan was to wrap up projects. The amount of time I gave myself and the fact that I had thought it through, I think, helped a lot - I didn't suddenly leave them in the lurch. Practice with yourself in the mirror (or a friend you trust), and remember that in the moment it may feel uncomfortable but it will be over. When I am facing uncomfortable conversations, what helps is visualizing a moment after the conversation is over, when the weight will be lifted either way.\n\nI got different reactions from different people. My primary PI and most of the colleagues in my center were supportive. One of those colleagues contacted me secretly to talk about my job search - turned out she, too, was interested in industry. My secondary PI was lovely; he told me people come back into academia much more often than I'd think, and that if I ever wanted to return to call him. My old advisor from grad school was a bit bewildered but supportive. The worst reaction was the director of my postdoc program, who told me they wouldn't have accepted me to the postdoc had they known I was interested in industry (too bad) and also said some racist shit to me (fuck them).\n\nI did not feel an ounce of guilt. At the end of the day, YOU are the only one who has to live your life. If you dislike academia and the work is not enjoyable to you, why should you feel guilty for pursuing your interests? When you got a PhD, you didn't sign a contract swearing to be a professor; when you took the postdoc, you didn't swear fealty to the lab. The secret is that although we tend to treat it like a calling, academia is a job just like any other: some people like it, some people don't, *and you can leave whenever you want for any reason you want.* If people are upset with you for leaving because you want to, that is their problem to get over, not yours. If your PI considers simply leaving academia for a job you like as \"burning a bridge,\" that is not a bridge worth having, IMO.\n\nI would do your level best to try to reach the PI in person - I just feel like this is a conversation that should be had in person. But if you can't - particularly if your PI makes themselves difficult to reach or is difficult to find - then a letter (or phone call) is the next best thing.",
      "author": "roseofjuly",
      "created": 1626672824,
      "upvotes": 14,
      "replies": {}
    },
    "h5o8guk": {
      "link": "/r/AskAcademia/comments/omx1sj/advice_on_leaving_a_postdoc_after_1_year_with_job/h5o8guk/",
      "text": "So as to how a 1 year postdoc looks, to most companies they won't care. Remember pharma/biotech/industry companies are full of PhDs who quit academia. It might not look great to an academic employer but you're going for industry and if you do decide to go back to academia later, they'll be far more interested in what you did since your postdoc than in the postdoc itself. \n\nAs for your resignation. You can't control your PI's response and just because she blows up at you doesn't mean you did anything wrong. The bridge may get burnt, but I suspect ultimately while you go on with one burnt bridge she's the one with scorched earth and a dearth of employees. Just behave professionally, with respect and courtesy. Tell her to her face, make sure you serve any notice period you're required to serve if you have a contract and make sure you've left your experiments and notebooks in order and catalogued so that someone else can pick them up. Then leave in good conscience.\n\nThe Ask A Manager website has lots of useful advice.\n\nETA you should do absolutely everything you can to avoid resigning over email (or other media). However, if she absolutely refuses to meet with you then a politely worded email will have to do.",
      "author": "ACatGod",
      "created": 1626640362,
      "upvotes": 11,
      "replies": {
        "h5pdg9n": {
          "link": "/r/AskAcademia/comments/omx1sj/advice_on_leaving_a_postdoc_after_1_year_with_job/h5pdg9n/",
          "text": "this was a very helpful answer thank you so much!",
          "author": "tarojelly",
          "created": 1626659702,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h5pdasq": {
      "link": "/r/AskAcademia/comments/omx1sj/advice_on_leaving_a_postdoc_after_1_year_with_job/h5pdasq/",
      "text": "Don't feel any guilt about changing your career path and finding a job.\n\nWait until you have something signed with the company and then quit in person. Maybe with a letter to hand in as well? If your PI wants the bridge to be burned because you only stayed a year, it'll be burned no matter how you quit so don't sweat that part.",
      "author": "SemiConEng",
      "created": 1626659628,
      "upvotes": 7,
      "replies": {}
    }
  }
}