{
  "sid": "pncx3h",
  "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/",
  "title:": "How to study for 12 hrs a day for 2 months straight without losing motivation?",
  "text": "People who have done this before, Please help. I have this big exam in 2 months, already attempted this exam and failed 3 times. Next attempt will be my last attempt as I have to start a job and move out from my parents house. \n\nMy exams are similar to CPA but of a different country.",
  "author": "Vintage__heart",
  "created": 1631529805,
  "updated": 1639839535,
  "over_18": false,
  "upvotes": 91,
  "upvote_ratio": 0.88,
  "comments": {
    "hcoqwg9": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcoqwg9/",
      "text": "When I studied/worked for 12 hours a day for a few months, I developed a chronic illness that screwed up my nervous system that I’m still dealing with today. So I do not recommend. People who say they do this are lying.",
      "author": "sweetypantz",
      "created": 1631539004,
      "upvotes": 119,
      "replies": {
        "hcowpya": {
          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcowpya/",
          "text": "Purely out of curiousity, might I ask what illness that is?",
          "author": "RexBox",
          "created": 1631541778,
          "upvotes": 23,
          "replies": {
            "hcpdvs9": {
              "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcpdvs9/",
              "text": "It’s called POTS, basically my nervous system doesn’t know how to adjust my blood vessels when I go from a sitting to standing position causing blood to pool at my feet and not enough oxygen getting back to my brain causing things like brain fog, fatigue and fainting. It’s a nasty illness but frankly the cause isn’t exactly known, just popped up after months of these long hours so doc thinks that was the trigger. It’s a common long COVID illness as well. Anyhow, it makes it hard to work. Hope it goes away one day.",
              "author": "sweetypantz",
              "created": 1631549008,
              "upvotes": 49,
              "replies": {
                "hcs3m5e": {
                  "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcs3m5e/",
                  "text": "Don’t know how old you are but a person close to me developed POTS in their 30s. Turns out the underlying cause was Ehlers-Danlos syndrome. Also a poorly understood disease and more common than people think. Might be something to look into because it comes with a bunch of other shit that’s worth getting ahead of.",
                  "author": "titosphone",
                  "created": 1631591721,
                  "upvotes": 4,
                  "replies": {
                    "hct7uer": {
                      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hct7uer/",
                      "text": "I’ve been meaning to get checked out for that, I am around that age. It seems like every other person on the POTS subreddit has EDS.",
                      "author": "sweetypantz",
                      "created": 1631622025,
                      "upvotes": 1,
                      "replies": {
                        "hct8lk1": {
                          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hct8lk1/",
                          "text": "Are you tall, have perms stoner eyes, can bend your thumb back to your wrist, have pectus excavatum, back pain, difficulty sleeping, cigarette paper scar tissue, stretchy skin, and other weird flexibility tricks? EDS is a spectrum disorder and my friend’s dad and sister both have a bunch of the symptoms but only she has enough to be technically designated as having EDS. Getting checked out is a good idea. There are no treatments or anything but knowing what exercises will prolong your quality of life are really helpful. Also EDS is bad for bone density so if you have it you should probably stop drinking alcohol if that’s something you do. Maybe you can tell from this comment that being even EDS proximal has an impact on life.",
                          "author": "titosphone",
                          "created": 1631622449,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hcsgg97": {
                  "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcsgg97/",
                  "text": "Very interesting - I've had Long Covid this last year, and I'm also still struggling with dysautonomia. I didn't develop Long Covid immediately: after my recovery from the infection, I worked very intensively for three weeks, at which point I started to experience the Long Covid symptoms. I'm super curious if there's a connection between Long Covid and the intensive work.\n\nEither way, my best wishes to you. This last year has been very difficult for me. I hope you'll recover too.",
                  "author": "RexBox",
                  "created": 1631599867,
                  "upvotes": 2,
                  "replies": {
                    "hct7ic6": {
                      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hct7ic6/",
                      "text": "I wonder that too but I haven’t heard about this connection from anyone else! I really thought I had had COVID but when my symptoms started to get worse, it hit me that I’ve had ALL these symptoms before when I had mono 2 years ago which was also nasty. Lasted for about 4 months, I also “recovered” but realized I never did. I’ve had random mild dysautonomia symptoms and general anxiety for these 2 years, prescribed antidepressants to deal. When I overworked myself is when the POTS emerged so it feels like my nervous system was pushed past stability. Unsurprisingly lots of people develop this and other dysautonomia from mono, just like covid. \n\nWish there was more awareness of that. And was less stigma on mono the “kissing disease” Anyhow, I wish you the best as well. I have so much empathy for people with these invisible illnesses.",
                      "author": "sweetypantz",
                      "created": 1631621833,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hcrtd18": {
          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcrtd18/",
          "text": "I worked 100+ hours/week (6:30 am- midnight non stopped every day with only a few extra hours of sleep on weekends) for about a straight year then 80 hours a week for another two years. I don't have any lasting effects, but during the thick of it I got so stressed out that I didn't eat for 13 days. Frequently went days without food. I got so freakishly skinny before I got fat. It definitely screwed up my metabolism but it has recovered a few years after the stress stopped. My fiance and I have worked like this for about a decade now. Every work day is at least 10 hours for me and 14 hours for her. Weekend work is about 4 hours/day... These types of schedules are totally doable. When studying for medical school admissions tests we worked from waking till sleeping for about 6 months before the exam. While it is indeed exhausting, this is just what it takes to succeed at some things. You either want it bad enough or you don't. Plenty of people do actually carry these schedules without lying and without problem. \n\nAnd for reference I am not bragging about working my life away, I am merely pointing out that succeeding in hyper competitive careers does factually require an intensity and sacrifice that most are not willing to deliver.",
          "author": "ActionXPotential",
          "created": 1631586749,
          "upvotes": -16,
          "replies": {
            "hcs9qrj": {
              "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcs9qrj/",
              "text": "“These schedules are totally doable” proceeds to describe how the schedules destroyed their health. \n\nTo your anecdotal evidence I can bring forth a dozen of successful people that have simply learned to be efficient. Time does not equal productivity, and the more you push your body to the limit, the less responsive your body and mind will become — sometimes with irreversible side effects. Just because you recovered doesn’t mean that everyone can or that there isn’t another way",
              "author": "Oycla",
              "created": 1631595231,
              "upvotes": 5,
              "replies": {}
            },
            "hct8z16": {
              "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hct8z16/",
              "text": "I mean I believed this too, otherwise I wouldn’t have tried to work 60-80 hour weeks. I was even proud of myself for pushing my body past exhaustion. Glad it hasn’t completely wrecked your body but it did mess mine up. And other people I know.\n\nI guess it is possible, like you say, I do know people closer to my dads age that do this for decades. I guess I don’t believe that it makes a meaningful life, or one with enough happiness, or awareness. It’s just how I feel. I am no longer proud when I treat my body like a machine but rather when I set proper limits.",
              "author": "sweetypantz",
              "created": 1631622654,
              "upvotes": 2,
              "replies": {
                "hcwi5fk": {
                  "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcwi5fk/",
                  "text": "I do it to hopefully contribute to a cure for spinal cord injury. I will gladly sacrifice my body and life to someday make the lives of paralyzed people better. Just as my fiance does it to help treat her patients. For me, at least, work is my passion, it is my life, and seeing a cure for spinal cord injury is the only thing I want out of my time in this world. Yes, it's stressful to work a ton despite loving what I do, but the results and mission are more meaningful than anything else I could possibly imagine. I don't know many people who work the way we do whom don't feel the same. This is why I said, and will say again, that succeeding in these competitive careers is all about how bad you want it and how much you're willing to sacrifice. For me, I would walk into a fire and burn alive if it cured spinal cord injury. Working my ass off is the closest thing I can realistically do to help make it happen.",
                  "author": "ActionXPotential",
                  "created": 1631672931,
                  "upvotes": 1,
                  "replies": {
                    "hcyxbzv": {
                      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcyxbzv/",
                      "text": "That’s really beautiful and meaningful! I hope you do have that impact, I also hope you can do it while also taking care of your own body!",
                      "author": "sweetypantz",
                      "created": 1631724631,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hcouw6c": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcouw6c/",
      "text": "I assume you are talking about a professional licensure exam and not a course exam and this exam has a fixed date either because it is only offered rarely or you will lose your job if you have not passed it by this date.  If any of this is not true, I may suggest delaying and taking the test at a later date.\n\nThe plus side is that I also assume that you have studied this material before if you have taken this exam 3 times so you are not starting from scratch.  It is easier to relearn than to learn for the first time.\n\nYou cannot study 12 hours a day, everyday.  There is no way to sustain your attention for that amount of time.  You need to figure out ways to break things up into manageable chunks and to focus on studying for the exam.  You have practice taking the exam so you know what kind of questions they ask.  There is no reason to re-read every textbook again.  You need to focus on only the material for the exam.  \n\nPurchase study guides, hire a tutor, and/or attend a prep course.  Take practice exams and lots of them often.  Develop the pile of things you have down and things you still need to work on.  Put less effort into the things you know.  Do you have a breakdown from your previous exams so you know what areas you did well on vs those you did not.  This will help you focus your study efforts also.",
      "author": "manova",
      "created": 1631540937,
      "upvotes": 32,
      "replies": {}
    },
    "hcodzvf": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcodzvf/",
      "text": "You don’t. You study intensely for 2-4 hours per day over a longer period of time to assimilate the information more thoroughly, and you work with a tutor or enroll in a prep course. You pay attention during the coursework and utilize the resources you have in school to do well in your classes, so that you don’t need to study as much for these exams. \n\nWhatever you’ve been doing to study has failed you 3 times. It’s time to shift your strategy.",
      "author": "GoldenBrahms",
      "created": 1631531285,
      "upvotes": 242,
      "replies": {
        "hcono1b": {
          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcono1b/",
          "text": "Yeah, and if you carefully track the hours that you're actually on-task, you'll often find that it takes you an 8 hour workday to get in those 4 hours of productive studying. There's a limit to what the mind can absorb in one day, so it's better to focus on making those 4 hours really count than to force yourself to sit in front of a book for 12 hours.",
          "author": null,
          "created": 1631537311,
          "upvotes": 16,
          "replies": {}
        },
        "hcq56i3": {
          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcq56i3/",
          "text": "Yeah, 2-4 hours a day on one subject should be more than enough. Don’t study 7 days a week for two straight months. The burnout will negate anything you’ve gained by doing so. Aim for 5 days a week. Allow an occasional 6th day for when you don’t hit your goal amount of between 10-20 hours during the week. Force yourself to do no work on your days off. And don’t forget repetitive work for 6-8 hours a day, like what most people do, and let’s be honest no one works on their work for their shift, is much different than trying to learn something new / improving at something. Which is why it’s fine if you aren’t “working” as many hours as someone working a 9-5.",
          "author": "bethemostworthy",
          "created": 1631560213,
          "upvotes": 10,
          "replies": {}
        },
        "hcrhtha": {
          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcrhtha/",
          "text": "Exactly. Short study sessions are more effective for the human brain to absorb... study smarter, not harder.",
          "author": "MatthewHWood",
          "created": 1631581439,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hcp1gm4": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcp1gm4/",
      "text": "Study in 45-90 minute intervals, with an exercise break for 20-30 min. Not vigorous exercise but a walk around the block listening to music or reciting the items you struggle with. Only drink water and make sure your electrolytes are balanced. Copious amounts of coffee, tea or soda will cause dehydration due to your body getting rid of the caffeine. You must be well hydrated for the brain to do it’s best work. Make flash cards of those “rules, methods,” or anything else you struggle with. Look at those cards when you are taking a exercise break. The exercise break allows the body to cycle the blood through every part of the body and the oxygen from walking will help keep the body awake and able to focus. Any type of medicine to “jack” you up into hyper study mode will be a detriment to your ability to study longer. I tell my students to go into a test without a rush of caffeine, sugar or anything else so they can think methodically and not all jumpy and shaky. When the caffeine and sugar/Med rush ends about midway through your test the brain will be exhausted. Water and at least 8 hours of rest will be best for those 3+hour tests. I recommend taking a snack with protein and something sweet for the break in a longer test.  Plus a bottle of water. If you are someone who has test anxiety, one or two Tylenol’s will help reduce that. My daughter had to take a mild blood pressure tablet so she could stay calm and focus on her nursing tests.  There are methods to looking at the questions and seeing the wrong two answers, the almost correct two answers and seeing the one correct answer.  I teach ACT prep courses for science.",
      "author": "Safe-Economy866",
      "created": 1631543849,
      "upvotes": 18,
      "replies": {
        "hcs5a2g": {
          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcs5a2g/",
          "text": "If you are used to drinking caffeine, do NOT change your schedule ahead of a big test or exam. Just stick to your usual dosing. Ditto with diet. Make it feel normal.",
          "author": "mediocre-spice",
          "created": 1631592579,
          "upvotes": 2,
          "replies": {}
        },
        "hcq07jb": {
          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcq07jb/",
          "text": "Just popping in to say that caffeine doesn't dehydrate you at all. That of course doesn't necessarily make it a great idea to chug caffeine all day. Good advice otherwise.",
          "author": "DontSlurp",
          "created": 1631558188,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hcp7bsl": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcp7bsl/",
      "text": "What are you doing differently in your approach to this exam in comparison to the last two times you took it? Do you need to do more practice questions? Is there a particular subset of the material that's tripping you up? \n\nNow is your opportunity to take a big step back and figure out what wasn't working the last time. As others have said, trying to force yourself to study 12 hours a day isn't feasible and is likely not going to make the difference you hope.",
      "author": "truthfulsnack",
      "created": 1631546308,
      "upvotes": 10,
      "replies": {
        "hcqdauc": {
          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcqdauc/",
          "text": "This is the essential element to passing. Not studying 12 hours a day",
          "author": "ivelynn",
          "created": 1631563488,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hcpnrk3": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcpnrk3/",
      "text": "I studied for 8 hours a day for two months for a professional exam. I ended up renting a small but very quiet office space. I was fairly broke at the time, so the expense wasn’t easy, and it motivated me to actually get what I paid for.\n\nI got ear plugs and was amazed at how much easier it was to study in silence.\n\nBy the end of my schooling I also needed a book stand. It keeps books or your notes at an angle so you don’t have to look straight down. If you have neck or headache issues, I can’t stress this enough! The book stand was key.\n\nI also made audio recordings of the study material I was having the toughest time memorizing and I listened to these recordings over and over again while I worked out. That way I was actually getting exercise, which was important for study retention, and the material REALLY seemed to stick for me.\n\nAnd get good quality sleep. Good sleep is essential for good memory.\n\nGood luck!",
      "author": "allbright1111",
      "created": 1631553081,
      "upvotes": 11,
      "replies": {}
    },
    "hcohbek": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcohbek/",
      "text": "[removed]",
      "author": null,
      "created": 1631533550,
      "upvotes": 43,
      "replies": {
        "hcoxk11": {
          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcoxk11/",
          "text": "It's not at all uncommon for people to be on campus or in their office or lab for 10+ hours a day, but it's very rare that they will actually be working or studying all those hours.",
          "author": "JHT230",
          "created": 1631542150,
          "upvotes": 33,
          "replies": {
            "hcoz9jb": {
              "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcoz9jb/",
              "text": "[removed]",
              "author": null,
              "created": 1631542901,
              "upvotes": 2,
              "replies": {
                "hcp1e16": {
                  "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcp1e16/",
                  "text": "Sure, why not?\n\nThe exact semantics of what counts or not doesn't really matter, just that spending more and more time does not necessarily mean that more work gets done.",
                  "author": "JHT230",
                  "created": 1631543817,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        },
        "hcolt31": {
          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcolt31/",
          "text": "While it's doable for some types of work, it's definitely not doable for studying!",
          "author": "doornroosje",
          "created": 1631536290,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hcom8x9": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcom8x9/",
      "text": "Never have motivation in the first place. That's a fleeting feeling. Have discipline and make it part of the daily routine.",
      "author": "dhunt501",
      "created": 1631536534,
      "upvotes": 27,
      "replies": {
        "hcpp8dt": {
          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcpp8dt/",
          "text": "This is by the way scientifically shown not to work. Discipline wears you out. You can force yourself to read for a day or even a week, but not for months, if the motivation isn’t there.",
          "author": "BoOtto",
          "created": 1631553684,
          "upvotes": 9,
          "replies": {
            "hcpphjo": {
              "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcpphjo/",
              "text": "You won't need the motivation if it's part of your disciplined routine.",
              "author": "dhunt501",
              "created": 1631553787,
              "upvotes": -1,
              "replies": {
                "hcprse2": {
                  "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcprse2/",
                  "text": "And as I said, just forcing a routine on yourself doesn’t work in the long run. If you don’ t have internal motivation, routines don’t stick with discipline.",
                  "author": "BoOtto",
                  "created": 1631554736,
                  "upvotes": 8,
                  "replies": {}
                },
                "hcq2p2d": {
                  "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcq2p2d/",
                  "text": "this reads like a sigma-mindset/grindset meme",
                  "author": null,
                  "created": 1631559210,
                  "upvotes": 0,
                  "replies": {
                    "hcq38ea": {
                      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcq38ea/",
                      "text": "I don't even know what that means, but thanks I guess.",
                      "author": "dhunt501",
                      "created": 1631559429,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hcow16d": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcow16d/",
      "text": "Uninstall all forms of social media",
      "author": "UpsolCons",
      "created": 1631541463,
      "upvotes": 19,
      "replies": {
        "hcpnz9n": {
          "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcpnz9n/",
          "text": "EXCELLENT suggestion.",
          "author": "allbright1111",
          "created": 1631553170,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hcouxbj": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcouxbj/",
      "text": "my advice would be whatever you do, do not distort your sleep cycle. get up early and sleep at night. i really messed up when i worked at nights for a couple of months",
      "author": "mr_born-to-lose",
      "created": 1631540951,
      "upvotes": 7,
      "replies": {}
    },
    "hcpju7n": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcpju7n/",
      "text": "Speaking from experience, I think one of the biggest mistakes students can make is to only study and not build in any time for rest, relaxation, relationships, *enjoyment*. \n\nMaintaining concentration 12 hours daily for 2 months is not physically possible, and when parents teach this \"learning style\" they are doing the kids a huge disservice.\n\nMy advice: schedule intense studying, and then schedule \"intense breaks\" - ideally away from the computer, with friends.",
      "author": "mohishunder",
      "created": 1631551482,
      "upvotes": 6,
      "replies": {}
    },
    "hcp2y2w": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcp2y2w/",
      "text": "Just take breaks of like at least 15 minutes every hour, it will be like a reward for your hard work and it will feel good. Also if you don’t take breaks often enough you will just lose concentration and motivation and forget a lot of stuff. Lastly don’t study for 12 hours per day, go do stuff you enjoy and forget about that exam for a bit, it will be good for your mental health.",
      "author": "Constantine7470",
      "created": 1631544481,
      "upvotes": 5,
      "replies": {}
    },
    "hcpa3bo": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcpa3bo/",
      "text": "Measure your progress by reaching attainable study goals rather than time. You can work for 12 hours and get hardly anything done, or you can work for 4 hours and be more productive than that entire 12 hours. I recommend reading Deep Work by Cal Newport.",
      "author": "draaj",
      "created": 1631547447,
      "upvotes": 3,
      "replies": {}
    },
    "hcpw07e": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcpw07e/",
      "text": "As others have pointed out ITT, it's practically impossible to study 12 hours a day for 2 months without losing motivation. So I'll offer my best studying practice instead.\n\nWrite questions that allow you to revise the content you have to study on little cards (one question per card) and the answers on the back. You can have 20, 50, 100 cards, it doesn't matter.\n\nWhen you go to the toilet, take the cards with you. When you're in public transportation, take the cards with you. When you want to study for 3-4 hours, use the cards. When you're bored, use the cards instead of social media. When you're done eating, use the cards. When you're watching Netflix, again use the cards. Apart from the specific periods you allocate yourself to study, you have to make it so the cards become a part of your everyday life. At some point you'll be able to refine your card pack to focus on your weaknesses.\n\nNot only do the cards help you revise the content you have to study, making them is also helpful. What's good is you can also ask someone to help you study with these and if they're in your class you can help them too, which will also allow you to learn the content. This method has never failed me. In fact I always felt at my best doing this.",
      "author": "pixel-janitor",
      "created": 1631556473,
      "upvotes": 4,
      "replies": {}
    },
    "hcp3fhy": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcp3fhy/",
      "text": "Go to high school in Korea",
      "author": "Archaia",
      "created": 1631544680,
      "upvotes": 2,
      "replies": {}
    },
    "hcprorc": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcprorc/",
      "text": "good advice in this thread of comments, just wanna add an accountability partner could benefit u. someone who will check up on u to make sure u haven’t fallen out of studying",
      "author": "webkinzpet",
      "created": 1631554693,
      "upvotes": 2,
      "replies": {}
    },
    "hcpjxtk": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcpjxtk/",
      "text": "Stop thinking about 12hrs, studying 12hrs is not the goal,  goal is to study such that you don't realise when day turns into night. \n\nMake chapters as your goal: Today I have to complete 3 chapters, 4 chapters and when you feel like giving up tell yourself that I will take once I complete learning/understanding (No. of pages). \n\nMoreover, remove the clock from your room, stop looking at time. Let's make the outer light your means of calculating time. \n\nAnd make sure to praise yourself, pat your back, whenever you perform the above given tactics successfully. \n\nLast but not the least: Fucking give up your phone for 2 fucking months. Fuck your smartphone, I am bigger than you, you can't fucking control my life, I'll make you my bitch.",
      "author": "nik0razoraous",
      "created": 1631551525,
      "upvotes": 1,
      "replies": {}
    },
    "hcpnhfw": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcpnhfw/",
      "text": "You don't. It's not possible.",
      "author": "blueb0g",
      "created": 1631552966,
      "upvotes": 1,
      "replies": {}
    },
    "hcpx3kd": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcpx3kd/",
      "text": "That's like asking \"How to jump in a lake without getting wet?\" \n\nWhat you have there is a recipe for giving yourself burnout. Burnout will make you do worse on studying and on the test. \n\nWhat works in studying is not quantity but quality. Work smarter, not harder. Pace yourself, give yourself achievable goals, take practice tests. Get a study partner and quiz each other. Take breaks to get fresh air and rest your eyes.",
      "author": "MisterSmeeee",
      "created": 1631556929,
      "upvotes": 1,
      "replies": {}
    },
    "hcq1mtp": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcq1mtp/",
      "text": "Don't study too much, but study with efficiency. As far as I am concerned, it is very important to learn or study something. You can create your study work with deep work techniques and you will reach your goals finally. Take care.",
      "author": "Beko_35",
      "created": 1631558778,
      "upvotes": 1,
      "replies": {}
    },
    "hcqe5dz": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcqe5dz/",
      "text": "Be very careful. It may give you a burn out. I got one early january and still have problems because of it, like mental problems",
      "author": "IWAHGGF",
      "created": 1631563826,
      "upvotes": 1,
      "replies": {}
    },
    "hcqfc5m": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcqfc5m/",
      "text": "maybe try to walk a little (1-2 hrs), before read some text, while walking recite/learn by heart the text - that's how i passed some courses",
      "author": "sunnyseasun",
      "created": 1631564309,
      "upvotes": 1,
      "replies": {}
    },
    "hcrl9qz": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcrl9qz/",
      "text": "You’ll stop learning anything after hour 5 or so",
      "author": "Slowmexicano",
      "created": 1631583016,
      "upvotes": 1,
      "replies": {}
    },
    "hcrugcs": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcrugcs/",
      "text": "Sleeping with binaural beats and lwaneing through osmosis",
      "author": "ChickendantZZZ",
      "created": 1631587257,
      "upvotes": 1,
      "replies": {}
    },
    "hcs54w4": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcs54w4/",
      "text": "You don't. 12 hours a day is counter productive. You find a more efficient way to study and you get sufficient rest.",
      "author": "mediocre-spice",
      "created": 1631592499,
      "upvotes": 1,
      "replies": {}
    },
    "hcsebzb": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcsebzb/",
      "text": "Take breaks dont have to study no stop  5min break can make the a huge difference",
      "author": "Dannyboithe1st",
      "created": 1631598301,
      "upvotes": 1,
      "replies": {}
    },
    "hcou94m": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hcou94m/",
      "text": "Have you tried the holy trinities of Adderall, Ritalin, and/or Dexamphetamine?\n\nHonestly though, if it's accounting and this is your 3rd try, maybe ask yourself is your heart really in it, and/or will you be happy doing this. \n\nThink of it like getting a driver's license. The test is not the finish, it's the start. Once you pass the test, you need to drive yourself. Probably everyday, sometimes through bad roads, sometimes carrying passengers who will rely on your skills. You sure you up for it?",
      "author": "gergasi",
      "created": 1631540637,
      "upvotes": -4,
      "replies": {}
    },
    "hnqdoxx": {
      "link": "/r/AskAcademia/comments/pncx3h/how_to_study_for_12_hrs_a_day_for_2_months/hnqdoxx/",
      "text": "I take lots of breaks intermittently throughout the sesh and this may come off as backwards but confuse your self and learn to apply ones knowledge in all facets of your existence also learn these items as a game that may or may not comfuze yoid",
      "author": "Patient047",
      "created": 1638980337,
      "upvotes": 1,
      "replies": {}
    }
  }
}