{
  "sid": "la8pmz",
  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/",
  "title:": "PhD advisor accused me of misconduct...???",
  "text": "Dear reddit,\n\nI had a fall out with former phd advisor and don't know what to do, so I thought I'd ask here (dummy account). I'll be vague to avoid ID of either party, but I hope to give enough details to draw a picture of my situation (if not just ask). When I finished my phd I stayed on the same lab for a postdoc, and during this time I had an idea (X). I proposed my advisor to apply for funding (for me) to develop idea X but my advisor dismissed it. 3 years later, another funding opportunity came along and I suggested again to apply and develop X, but my advisor dismissed it again.\n\nAs I needed to apply for funding (to be considered in the future for tenure-track jobs), and my advisor was busy, we discussed and agreed that I would work/publish a particular work on my own (I did all the work, advisor provided \"space and resources\"). This freed my advisor's workload and would allow me to show some independent work (my advisor never got his/her head around the manuscript I prepared and didn't mind). The manuscript is now under review in a top journal of the field.\n\nBy this time I left that institution and moved on to another as a postdoc. Given this manuscript, I thought about using part of the dataset (which I assumed \"freed\", as I had to submit the data to the journal, for openness reasons) to write a proof-of-concept manuscript based on the above idea X. The rationale is that, now there's a publication and hypothesis about X in the literature, my case for funding would be a bit stronger.\n\nThe journal sent a request for review to my now former advisor, who got in touch to say that I'm stealing his/her ideas---who apparently had years before I joined his/her lab. My advisor is effectively accusing me of misconduct for using data generated in his/her lab with his/her ideas. I put forward idea X twice to my advisor, and not once he/she mentioned anything like this.\n\nThe accusation of stealing the idea X is what truly bothers me (because it's \\_not\\_ true), because my advisor knew about it for 3 years while working in his/her lab. I can put the use of experimental data to lack of clear communication. After all, the data for the manuscript we agreed I would do on my own is in the open (as per journal request, common in my field). But the idea stealing thing truly bothers me.\n\nNow, in the email, laying out what I could or could not use for my future projects (I'm looking for tenure-track jobs) I was not allowed effectively to use any data \\_or ideas\\_ during my time in my advisor's lab.\n\nDo I retract the manuscript for idea X (which was already sent out to other referees)? What do I do? I've been feeling anxious since all this happened and can't find anywhere what to do.\n\nMy advisor gave a substantial part of my \\[PhD\\] work to a visiting postdoc for he/she to apply for fellowships, so I'm not sure whether to tell my advisor about other ideas I had during my time in his/her lab (which, besides idea X, do not pose any competition between us) as I fear the advisor might pocket them. Had my advisor not handed over my work to this visiting postdoc I would tell he/she about them, so here I am asking in reddit.\n\nEDIT 1:  I hope this helps.\n\n>a) you wrote a paper independently, with your previous advisor's blessing. That paper is published without the previous advisor as an author, and they have no problem with this.\n\nExactly, except the paper is not yet published (under peer-review). If it's published there (if), I will be forced to make data publicly available. But it's common nowadays, even society type journals do this in my field. I submitted the new manuscript with idea X 3-4 months after that manuscript. Last week.\n\n&#x200B;\n\n>b) you took data that was part of that publication (freely available to all) to work on a different idea you came up with on your own, that you never worked on in your past advisor's lab.\n\nData will be free once the manuscript is accepted (in current or alternative journal). I developed the theory behind the idea while working on my past advisor's lab, but in spare time (I didn't neglect my current research to work on this other idea). I suggested twice to apply for funding to develop the idea (fellowships for me, to develop idea in advisor's lab). Advisor refused both times.\n\n&#x200B;\n\n>c) your past advisor is mad that you're working on an idea they refused to let you work on when you came to them with it, and is especially galled you're using data you generated in their lab to do so, even though this data is now part of the public domain due to open access publishing.\n\nYes (except data is not yet public, will be  if other paper accepted).\n\n&#x200B;\n\n>d) your past advisor has now give this idea (??) to someone else?\n\nNo. In the past, my data from other project (accepted 2 weeks ago) to visiting postdoc. He wanted to apply for fellowships, and my advisor handed over my data for his application. In the mock presentation this postdoc gave, 50% of the slides were my data.  This is how I knew. All colleagues (postdocs, phd students, technicians) exchanged awkward looks and carried on.\n\n&#x200B;\n\nEDIT 2: OK so I sent an email to my ex-advisor suggesting to include my advisor in the second manuscript to try to end this amicably. I take on the cheek that as the other paper is still under review, the data is not yet technically publicly available. Nothing concrete for a face-to-face conversation, so I think the advisor wants things in writing. Thank you everyone, I'll keep this updated, and whether I might have a career after all this. To say I'm scared is an understatement.\n\n&#x200B;\n\nEDIT 3: Still waiting...",
  "author": "naiveScientist89",
  "created": 1612200562,
  "updated": 1634080753,
  "over_18": false,
  "upvotes": 188,
  "upvote_ratio": 0.99,
  "comments": {
    "glmljvm": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmljvm/",
      "text": "The idea is yours. It doesn't matter that you were working with your advisor when you generated it. Given this unfounded accusation and the fact that your advisor stole your idea and gave it to a visiting postdoc, I recommend that you contact the Research Integrity Officer (RIO)  for your university (if you are in the US, or the equivalent if you are not). I am the RIO for my university and your advisor is 100% in the wrong.",
      "author": "bigrottentuna",
      "created": 1612202609,
      "upvotes": 239,
      "replies": {
        "glnntp0": {
          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnntp0/",
          "text": "[deleted]",
          "author": null,
          "created": 1612217466,
          "upvotes": 13,
          "replies": {
            "glo5wzj": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo5wzj/",
              "text": "There are multiple issues here. The biggest one, from my perspective, is that the PI appears to have stolen OP's research idea and is falsely accusing OP of stealing *his* research ideas. That is serious misconduct. That's explicitly what I was referring to when I said that the PI was 100% in the wrong.\n\nWith respect to the paper, you all seem to have missed this statement by OP, \"we discussed and agreed that I would work/publish a particular work on my own.\" The PI specifically agreed that he would not be listed, so OP did nothing wrong there.\n\nThe remaining question is the research data. The PI agreed that OP could publish the paper. *Of course* OP was going to use data from the lab to do that. It is a non-issue. The only question is the timing; offering to delay publication to ensure that the PI can get the data out there first would be an appropriate solution, especially since the novelty of the data does not appear to be a contribution of OP's paper.",
              "author": "bigrottentuna",
              "created": 1612225394,
              "upvotes": 7,
              "replies": {}
            },
            "glo1hs9": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo1hs9/",
              "text": "/u/bigrottentuna \n\nThis is what I was trying to say, only this person said it better than me. I would love to hear your response, I can't imagine that's acceptable behavior at any university.",
              "author": "dhibbit",
              "created": 1612223337,
              "upvotes": 2,
              "replies": {}
            },
            "glnu8wf": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnu8wf/",
              "text": "I think you misunderstood OP. OP mentioned that the advisor agreed to publish the paper solo to free up some of his/her time. Then, the OP is taking that (soon to he published in an open source journal) data to illustrate further theories. This is commonly done in research. If Dr. X published something on a theory. I can use that research to justify why I think my research should get specific research funding. I wouldn't need Dr. X's permission, unless there was special copyright or patent info involved (which it doesn't sound like is involved). You're right that a Postdoc shouldn't publish without PIs permission, but the PI gave OP the OK.",
              "author": "holldoll_28",
              "created": 1612220141,
              "upvotes": 4,
              "replies": {
                "glnzpk9": {
                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnzpk9/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1612222523,
                  "upvotes": 4,
                  "replies": {
                    "glo20ng": {
                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo20ng/",
                      "text": "Additionally, perhaps I misunderstood OP, when they said the data was open source. When you submit to the article and link the data through certain places (like osf) even if the article is not accepted for publication, the data is still open access through OSF. I could still find that data and preregistration. But as you said, I don't need to explain that to you, you already know how open data works.",
                      "author": "holldoll_28",
                      "created": 1612223575,
                      "upvotes": 2,
                      "replies": {
                        "glo31pg": {
                          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo31pg/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1612224044,
                          "upvotes": -1,
                          "replies": {
                            "glo5fds": {
                              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo5fds/",
                              "text": "I was just replying that the new edit did make it seem like the temporal precedent wasnt as clear as it seemed in the original post. So you were right on that. And I agree that neither side is 100% is wrong (this seems to be a fact of life even outside of academia). I think that its very important for PIs and postdocs to discuss what belongs to whom at the start and end of these positions. But I also still have the inkling (even with the obvious ambiguity in the post) that the OP is less wrong than the PI. The fact the the PI wasn't even an author on the paper that the OP was publishing leads me to think that they didn't make significant contributions to the data collection, so that data would still belong to OP. This is an assumption I am making however, so I could be wrong.",
                              "author": "holldoll_28",
                              "created": 1612225164,
                              "upvotes": 3,
                              "replies": {
                                "glo5zx6": {
                                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo5zx6/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1612225432,
                                  "upvotes": 2,
                                  "replies": {
                                    "glo7yu4": {
                                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo7yu4/",
                                      "text": "From OP's comment:\n\nThe small dataset on that manuscript is taken from the other manuscript we agreed, my advisor and me, that I would develop on my own to show some independence (my advisor didn't quite understand the idea behind, and as he/she provided \"space and resources\" only and I did all the work to generate and analyse the data, we agreed). \n\nEnd quote. \n\nSo even though data was collected during their time as a postdoc, it sounds to me that the data was not  \"data from a lab\" but data collected by a single lab member that the advisor agreed would be am independent project. Otherwise, they wouldn't have agreed to the solo publication. Once the advisor permitted the project and the solo original manuscript to be submitted for publication, they admitted that they didn't have a hand in what would happen to the data in the future.",
                                      "author": "holldoll_28",
                                      "created": 1612226354,
                                      "upvotes": 0,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gln9cvr": {
          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/gln9cvr/",
          "text": "It does if the advisor funded their salary and provided the \"space and resources\". I have no idea what is going on in this comments section but most of it is just dead wrong.\n\nIf you work for a person, use their lab, generate data on their watch, you absolutely ***can not*** publish that work 1) without putting their name on it and 2) without telling them.\n\nIt certainly appears that the advisor was blindsided by this which makes me think that there as a major miscommunication about how this work should be handled at the publication stage.",
          "author": "dhibbit",
          "created": 1612211773,
          "upvotes": 40,
          "replies": {
            "glna2cq": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glna2cq/",
              "text": "Huh, the ethical guidelines for authorship I have in front of me don't seem to include \"paid their salary.\" Do yours?\n\nIn fact, here are the four major guidelines:\n\n>Substantial contributions to the conception or design of the work; or the acquisition, analysis, or interpretation of data for the work; \n\n>AND\n\n>Drafting the work or revising it critically for important intellectual content; \n\n>AND\n\n>Final approval of the version to be published; \n\n>AND\n\n>Agreement to be accountable for all aspects of the work in ensuring that questions related to the accuracy or integrity of any part of the work are appropriately investigated and resolved.\n\nThey must have forgotten to include \"OR - Paid for postdoc's salary and allowed them to use equipment in their lab. No contributions necessary.\"\n\nMore to the point:\n\n>Contributors who meet fewer than all 4 of the above criteria for authorship **should not be listed as authors**, but they should be acknowledged. Examples of **activities** that alone (without other contributions) **do not qualify** a contributor **for authorship** are **acquisition of funding**; **general supervision of a research group** or general administrative support; and writing assistance, technical editing, language editing, and proofreading.",
              "author": "ThePhysicistIsIn",
              "created": 1612212048,
              "upvotes": 76,
              "replies": {
                "glo5lhb": {
                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo5lhb/",
                  "text": "Even if your PI doesn't meet the journal's requirements for authorship, that doesn't necessarily mean you can publish without their permission. Those are two separate things.\n\nLike, for example, you can't use a colleague's figure in your manuscript without their permission -- even though inclusion of that figure wouldn't be enough to grant them author status.\n\nIdk exactly what the rules are here, but it's very possible the PI has some ownership over the data generated in their lab.\n\nEdit: to clarify, I agree that a PI doesn't *have* to be included as author. I'm just doubtful you're entitled to publish data generated in their lab without their knowledge and consent.",
                  "author": "xozorada92",
                  "created": 1612225243,
                  "upvotes": 7,
                  "replies": {
                    "glo7dhm": {
                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo7dhm/",
                      "text": "Right - the key part here is that OP said the data was going to be published publicly soon, which would make the question of data ownership moot.\n\nI agree, if you use *our* data, you should include me. Had I been OP, I would have asked my PI to be my collaborator on this project, even if I did most of the work by myself, and given them the opportunity to opine in.",
                      "author": "ThePhysicistIsIn",
                      "created": 1612226080,
                      "upvotes": 3,
                      "replies": {
                        "glo9jwq": {
                          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo9jwq/",
                          "text": ">Right - the key part here is that OP said the data was going to be published publicly soon, which would make the question of data ownership moot.\n\nIt would make it moot if the data had *already* been published...\n\nAs it is, the only argument I could see is that the PI implicitly agreed to let this data be used for other things when they agreed to submit the paper in this way. But idk, that feels pretty sketchy.\n\nI mean, what happens if the paper is rejected? The PI could then insist it only be resubmitted to a different journal without including all the data. (It'd be a dick move, but they could.)",
                          "author": "xozorada92",
                          "created": 1612227107,
                          "upvotes": 7,
                          "replies": {}
                        },
                        "h2f76co": {
                          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/h2f76co/",
                          "text": "OP is the one trying to publish it and thus making it public.",
                          "author": "e_lunitari",
                          "created": 1624192039,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "glnd8ik": {
                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnd8ik/",
                  "text": "This is obviously a messy situation, but you don't do what OP did -- at least not in my field, and I'd bet not in yours either.\n\nI can't even recall seeing a paper in a \"top\" journal that doesn't have the PI's name on it. Never happening.",
                  "author": "dhibbit",
                  "created": 1612213218,
                  "upvotes": 24,
                  "replies": {
                    "glnewmz": {
                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnewmz/",
                      "text": "Of course not. Papers in \"top\" journals are not performed by solo investigators doing a little side project in their spare time. They're multi-year large projects which demand large financial commitments - of course the PI will be on those. Not because they funded it - but because they satisfied the four criterias of ethical authorship, while incidentally having funded them.\n\nThat's just selection bias.",
                      "author": "ThePhysicistIsIn",
                      "created": 1612213843,
                      "upvotes": 37,
                      "replies": {
                        "glntam5": {
                          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glntam5/",
                          "text": "This really depends on the field. In my field (psychology) you could definitely run a side project, solo that could be published in a top journal (for example, you could run a simulation study testing the feasibility of using X statistical analysis on Y type of data). You could also do a policy analysis on publicly available datasets. You could write theoretical papers, meta-analyses, etc etc.",
                          "author": "holldoll_28",
                          "created": 1612219738,
                          "upvotes": 18,
                          "replies": {
                            "glnter5": {
                              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnter5/",
                              "text": "Mea Culpa. I was thinking of things like physics or biology where the results require access to equipment, supplies, etc... and purely computational studies rarely get you there.",
                              "author": "ThePhysicistIsIn",
                              "created": 1612219787,
                              "upvotes": 12,
                              "replies": {}
                            }
                          }
                        },
                        "glnn88x": {
                          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnn88x/",
                          "text": "> The manuscript is now under review in a top journal of the field.\n\nThis is from the OP.\n\nSo that is a HUGE red flag, not just to me, but also the the Journal editors, which is why they sent it to the OP's PI. Whether it's within the guidelines or not, it's just ***not done***",
                          "author": "dhibbit",
                          "created": 1612217212,
                          "upvotes": -8,
                          "replies": {
                            "glnsux1": {
                              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnsux1/",
                              "text": "Just to clarify, what is in a top journal (for the field) is the manuscript my advisor and me agreed to be submitted by myself only. There is no issues in any respect with that particular work. Like I said, my advisor was very busy at the time, I gave him/her three first author papers in 15 months that my advisor had to go through plus whatever grants he/she was working on (+ teaching, admin, panels, etc).\n\nIt was always deemed the least \"important\", so to speak, and given my advisor's workload + my need for papers we agreed I should carry it alone. Traditionally, papers are incredibly long in my advisor's laboratory so he/she always took a while to get through them. His/her current phd student finished the phd with no publications (due to the amount of data produced), whereas I managed to contribute to a couple as middle-of-the-road author and almost as a favour. So things do get long in my advisor's lab, and with no papers I get no job.\n\nThe manuscript where I'm accused of stealing ideas, is another manuscript submitted to a mid-tier (but decent enough) type of journal. It does use specific data (5-7%?) from the other paper simply to demonstrate the predictions of the theory behind idea X. The paper is theoretical, it always was, I put the data simply to demonstrate is not a blue-skies theory. Because this 5-7% of data belongs to the other manuscript, under review and forced to make it public as per journal policies, I assumed it could use bits of that same dataset. I did not generate any data explicitly for idea X, but repurposed data from the other manuscript under review.\n\nAnd why single author papers would be problematic (there are many in STEM)? If I produced the dataset, the skills to analyse that dataset, and to write a manuscript so that a top journal would consider it... why would this be a problem? (genuine question)",
                              "author": "naiveScientist89",
                              "created": 1612219554,
                              "upvotes": 6,
                              "replies": {
                                "glnznqu": {
                                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnznqu/",
                                  "text": "That certainly adds some clarification, I still think it should be something that you had discussed with your old PI so that they would not be surprised when contacted by a journal.\n\nIn my area of STEM, the only single-author things published are perspectives, i.e., a person's opinion about other publications and usually something that is reflective over that person's career.\n\nEven review papers are rarely single-author.",
                                  "author": "dhibbit",
                                  "created": 1612222501,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "glno444": {
                              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glno444/",
                              "text": "I do admit I missed that tidbit. I'm not sure what that means, personally - but I doubt OP is submitting to Nature. \n\nIn any case, I disagree. You snooze, you lose. OP's PI had no interest developing the idea, they do not own OP's scientific output now that OP has left their lab. And given that the dataset is about to be published publicly, they don't own the data either. \n\nWhat claim has the PI on OP's ideas on what future projects to do? Like any other scientist, the PI can try and perform and report this science first. Otherwise, the PI's claims end at the projects for which OP was assigned, and at the non-public data which was acquired. That's it.\n\n\"It's not done\" is a terrible argument one has to resort to when one no longer has sound ones. Why isn't it done? Because of the power differential between individuals? \n\nThe PI has no claim to scientific ownership of this project, and to suggest that they do is a gross ethics violation.",
                              "author": "ThePhysicistIsIn",
                              "created": 1612217590,
                              "upvotes": 6,
                              "replies": {
                                "glnot1h": {
                                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnot1h/",
                                  "text": "I'm messy on some of the details as well. As usual we are getting a one-sided story and it's mostly incomplete (for good reasons).\n\nIt sounded to me this recent paper had novel data. I thought OP generated this data in the PI's lab and then submitted it on their own to a top journal. Data that the PI's lab enabled and funded, and whose original funding was probably contingent on proposals that the PI wrote. \n\nYou're saying that the data in the paper is already published? Yeah, that changes everything. If the data is not new, only the ideas are new, and they were generated after the OP left that lab. I see no issues at all.\n\nThat was not my read on the situation, but who knows.",
                                  "author": "dhibbit",
                                  "created": 1612217883,
                                  "upvotes": 6,
                                  "replies": {
                                    "glnplis": {
                                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnplis/",
                                      "text": "It appears that the data is **about** to be published in a manuscript that is accepted and in press, where the PI is the senior author, and that OP worked on developing their idea after leaving the PI's lab. That's what they say in another comment.\n\nThe PI seems to think that OP shouldn't publish on this because it's \"stealing ideas\" from his group - though OP has the e-mails to show that they proposed the project to the PI, and the PI chose not to pursue. So OP originally generated the ideas while still under the PI's employment, but did not develop them into a proof of concept until after they left.\n\nI'm of the opinion that ideas are owned by the people who generate them, not the people who pay for them. For instance, when I switch institutions, I fully intend to continue all of the research activities which I was doing before that. There is some shared ownership of patents, of course, but that's about it. There are no \"non-compete\" agreements in academia, thank god.\n\nIt's true, it's a one-sided story. But based on what we've been told, it certainly does sound like an abuse of power from the PI.",
                                      "author": "ThePhysicistIsIn",
                                      "created": 1612218215,
                                      "upvotes": 6,
                                      "replies": {
                                        "glnsbyg": {
                                          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnsbyg/",
                                          "text": "The origin of the data is what I was hung up on, to me if I pay someone to gather data, I have a responsibility to steward that data into the literature.\n\nIf the data is already public, and the OP is attempting to publish a reinterpretation/analysis, I think they are fine to do so. I totally missed that other comment by the OP stating that the data is already out for review. The timing is really poor, on the part of the OP, that data is ***not published*** until it is actually published and online and can be properly cited.\n\nI would not have recommended that they publish a reanalysis/interpretation  independently (without their current or former advisor on it) until they had secured a faculty position (and thus their independence was no longer a question), because it remains a red flag.\n\nI sit on hiring committees for Assistant Professors, I have seen maybe 1-2 papers without an advisor and it's always a bit of a *wtf* moment.",
                                          "author": "dhibbit",
                                          "created": 1612219331,
                                          "upvotes": 4,
                                          "replies": {
                                            "glnttaw": {
                                              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnttaw/",
                                              "text": "Yes, I completely agree that OP should have waited until their previous paper had been published. \n\n>I sit on hiring committees for Assistant Professors, I have seen maybe 1-2 papers without an advisor and it's always a bit of a wtf moment.\n\nReally? I would have thought that shows independence and/or ability to collaborate with others. Aren't those things desireable in a faculty member?",
                                              "author": "ThePhysicistIsIn",
                                              "created": 1612219957,
                                              "upvotes": 1,
                                              "replies": {
                                                "glnzzc4": {
                                                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnzzc4/",
                                                  "text": "It usually just indicates dysfunction of one kind or another between the author/candidate and their advisor. I.e., it looks a lot like this situation in which the student/post-doc did not include the PI as a co-author because the PI may have had some issues with the work / idea / student.",
                                                  "author": "dhibbit",
                                                  "created": 1612222646,
                                                  "upvotes": 2,
                                                  "replies": {
                                                    "glo04bj": {
                                                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo04bj/",
                                                      "text": "I had a paper from my PhD without my advisor. I just collaborated with another lab on a subject on which my PI was not involved, or an expert.\n\nI'm glad you didn't review my CV.",
                                                      "author": "ThePhysicistIsIn",
                                                      "created": 1612222708,
                                                      "upvotes": 2,
                                                      "replies": {
                                                        "glo0ex0": {
                                                          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo0ex0/",
                                                          "text": "I guess I wasn't clear, papers without one of your main advisors are not a red flag. Papers without *any senior authors* are a red flag.",
                                                          "author": "dhibbit",
                                                          "created": 1612222842,
                                                          "upvotes": 2,
                                                          "replies": {
                                                            "glo0l4v": {
                                                              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo0l4v/",
                                                              "text": "Aaah, now I understand. That's not at all objectionable :)",
                                                              "author": "ThePhysicistIsIn",
                                                              "created": 1612222922,
                                                              "upvotes": 1,
                                                              "replies": {}
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        },
                                        "glnucjk": {
                                          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnucjk/",
                                          "text": "No, the paper is not about to be published. I will, eventually, but is under review in this top journal (is not C-N-S, tho I tried). It's been under review for nearly 3 months now. It might get rejected, it might not. But whenever it is accepted (in that top journal or another), the data would be made public.\n\nSorry if there was any confusion about this, I don't want to be too specific on purpose to avoid identifying anybody. Academia can be a small world.",
                                          "author": "naiveScientist89",
                                          "created": 1612220184,
                                          "upvotes": 2,
                                          "replies": {
                                            "glnv9s4": {
                                              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnv9s4/",
                                              "text": "Ah, then I agree that submitting this new paper was probably a bit premature, even if I disagree with your PI",
                                              "author": "ThePhysicistIsIn",
                                              "created": 1612220573,
                                              "upvotes": 2,
                                              "replies": {
                                                "glnwgjv": {
                                                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnwgjv/",
                                                  "text": "+1. This ends the argument. If the data are not publicly available yet, then you shouldn't use it without the consent of your prior lab.",
                                                  "author": "uniadminthrowaway",
                                                  "created": 1612221085,
                                                  "upvotes": 4,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "glqit4o": {
                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glqit4o/",
                  "text": "That is about coauthorship. And that ethical guideline is worth a piece of used toilet paper. See my papers on [coauthorship.com](https://coauthorship.com)\n\nThere is no ethical guideline that I know of that protects ideas. I am very serious. Intellectual property other than filed patents are not protected in science.",
                  "author": "Such_Possession4553",
                  "created": 1612277874,
                  "upvotes": 2,
                  "replies": {
                    "glqizxn": {
                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glqizxn/",
                      "text": "That's a broken link.",
                      "author": "ThePhysicistIsIn",
                      "created": 1612277942,
                      "upvotes": 1,
                      "replies": {
                        "glqraj7": {
                          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glqraj7/",
                          "text": "[http://coauthorship.com/coauthorship.nsf/presentation](http://coauthorship.com/coauthorship.nsf/presentation)",
                          "author": "Such_Possession4553",
                          "created": 1612280954,
                          "upvotes": 1,
                          "replies": {
                            "glr5i9o": {
                              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glr5i9o/",
                              "text": "Thank you. It's nice to have all these articles in a single location.\n\nThe fact that the ethical requirements for authorship are not universally adhered to does not convince me that it's wrong to say that the PI did not deserve to be on this paper just for having, in the past, funded OP.",
                              "author": "ThePhysicistIsIn",
                              "created": 1612286035,
                              "upvotes": 1,
                              "replies": {
                                "glwxh7h": {
                                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glwxh7h/",
                                  "text": "I am not saying it is wrong. I am just saying that it is not in the ethical guideline.",
                                  "author": "Such_Possession4553",
                                  "created": 1612389305,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "glpypey": {
                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glpypey/",
                  "text": ">In fact, here are the four major guidelines:\n\nAre you aware that physics is the most egregious example of violation of this rule?",
                  "author": "lucaxx85",
                  "created": 1612267331,
                  "upvotes": 2,
                  "replies": {}
                },
                "h2f742q": {
                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/h2f742q/",
                  "text": "Without the PIs lab/resources/funding the author (OP) cannot make the substantial contributions or the acquisition of data. That sentence doesn’t only mean the “first person” who actively conducted the experiment etc, but whoever is involved in contributing to data acquisition, whether they designed the experiment (for example) or they paid for the parts from their funding. This is why PIs are the last author on PhD students’ publications even if they didn’t come up with the idea the student worked on.",
                  "author": "e_lunitari",
                  "created": 1624191991,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "glncwv2": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glncwv2/",
              "text": "Sorry, no. You are simply incorrect. The ownership of ideas does not work that way. I’m not sure what your authority is, but I am the person who adjudicates these matters for my US R1 university.",
              "author": "bigrottentuna",
              "created": 1612213102,
              "upvotes": 18,
              "replies": {}
            }
          }
        }
      }
    },
    "glmheuf": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmheuf/",
      "text": "An advisor ripped off my ex.  Stick to your guns and get your documents ready.  Dig up every email and letter you can.",
      "author": "Legacy_user1010",
      "created": 1612201037,
      "upvotes": 112,
      "replies": {
        "glmjevy": {
          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmjevy/",
          "text": "Flippin' heck, sorry to hear that. I sent my advisor an email with a 2-page draft about idea X, as I pitched it originally while going to a coffee shop on campus and my advisor suggested to put it \\[briefly\\] in writing to help him/her get around it. I forwarded again that 3-year old email (with the pdf and my advisor's response) to no avail.",
          "author": "naiveScientist89",
          "created": 1612201804,
          "upvotes": 45,
          "replies": {
            "glmjqjn": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmjqjn/",
              "text": "Make sure you have all that ready to go.  To prove your ownership of the idea.  Otherwise you will get asses out.  Make a back up or two.",
              "author": "Legacy_user1010",
              "created": 1612201927,
              "upvotes": 38,
              "replies": {
                "glmlan5": {
                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmlan5/",
                  "text": "I dumped all my emails from my previous institution into my computer (it was an IMAP/outlook365 account). I did it just for my records, really, keep track of what people were invited to what conference, research details that I might need (we still have 2 manuscripts together), etc. I'm just baffled about the situation and the accusations of misconduct.\n\nMy advisor has personally told me similar things about other people, A stole this idea, B stole that other idea... This is why I worry when he/she has a chat with former colleagues (or whoever in the department) my advisor might say \"oh! naiveSciencist89 stole this idea\". If my advisor might have had a similar idea years before I joined the lab (which until now, I didn't know), couldn't have he/she told me that when I first mentioned idea X? That annoys me so much. I could have moved on back then (all vague, to be defined, etc) or do it together. Because my advisor dismissed it, but I liked idea X, I kept developing it in the background (the theoretical part which is all I had at the time). Now it's all in plain sight and obvious, I'm accused of stealing ideas.",
                  "author": "naiveScientist89",
                  "created": 1612202512,
                  "upvotes": 29,
                  "replies": {
                    "glo6olh": {
                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo6olh/",
                      "text": "In my field (biology) you have to very clearly discuss with a PI all your plans for what you can take with you when you leave. Some PIs want to own everything, others really let you take some projects with you. Some let you take projects with you but let you know they will keep working on those ideas/compete for grants and pubs. I was always under the impression (and attended NIH workshops at my post doc institution) that EVERYTHING is owned by the university/PI. Like literally they told us even if you came up with an idea on the weekend on your own, you couldn’t patent it yourself.",
                      "author": "ColaRBT16",
                      "created": 1612225757,
                      "upvotes": 5,
                      "replies": {
                        "glrypvh": {
                          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glrypvh/",
                          "text": "> Like literally they told us even if you came up with an idea on the weekend on your own, you couldn’t patent it yourself.\n\nIf it is unrelated, or even only tangentially related to your primary work this would not hold up in court. And by \"related\" I don't mean also being a biology project, I mean being very specifically an offshoot of what you are working on.\n\nThough IANAL, I received this standard boilerplate when working as a permatemp and explicitly asked the question above, and received the answer that ideas unrelated to my job were mine.",
                          "author": "827753",
                          "created": 1612297492,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "glmn5c7": {
                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmn5c7/",
                      "text": "Academia is cutthroat.  It is publish or die.  Now you know, arm up and prepare to do battle.",
                      "author": "Legacy_user1010",
                      "created": 1612203226,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "glmpfoq": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmpfoq/",
      "text": "If I understand correctly, your advisor sent *you* (not the journal, nor anyone else) an email with the accusation (or insinuation)? If it's just to you then I'd start documenting but also try to sort it out with him or her privately, first. Perhaps it's another miscommunication. If your relationship with your advisor was decent (or at least tenable) before, the presumption is that they still want the best for you.\n\nIf your first move is to \"lawyer up\" or go official (escalating to Research Integrity), that is your right, but think carefully about whether you want to go nuclear. \n\nOn the other hand, if they have gone public, that's another issue.",
      "author": null,
      "created": 1612204101,
      "upvotes": 15,
      "replies": {
        "glmtgvy": {
          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmtgvy/",
          "text": "Sorry for not being clear on that point.\n\nYes, the advisor sent me the email after reading the abstract sent by the journal for the invitation (I suggested other people as reviewers, but journals don't need to follow those recommendations). It was after receiving this invitation when my advisor contacted me. I don't know whether he/she also contacted the journal. As far as I can tell from the status (awaiting referee scores) the submission is going on as usual.\n\nThe small dataset on that manuscript is taken from the other manuscript we agreed, my advisor and me, that I would develop on my own to show some independence (my advisor didn't quite understand the idea behind, and as he/she provided \"space and resources\" only and I did all the work to generate and analyse the data, we agreed). That manuscript has a much larger dataset, and only some bits of it are relevant to the theory behind idea X. So, as it's usual nowadays, journals want the data in the open for reproducibility / open access purposes. Given this I assumed, right or wrong, I could use it to test some parts of the theory behind idea X (after all, the data will be in the open whenever the manuscript is accepted, and it's common to re-analyse other lab's data for different purposes only citing the data's manuscript in return... this would be me citing myself).\n\nOther than the issue with the visiting postdoc, which I never raised with my advisor, I'd like to think we had a pretty good working relationship (hence why I didn't raise the visiting postdoc issue). My first option is to sort this out amicably, or as amicably as possible. Like I mentioned, I still need my advisor's reference letter if I want a tenure-track job (or else, do a third postdoc... but even then I'd need a reference letter from that advisor). And I also spent with this advisor a substantial amount of time (phd + postdoc) so going \"nuclear\" it's just feels... awkard. I don't want to cross the street, so to speak, whenever I come across my advisor in conferences and the like. Ideas are a dime a dozen, the saying goes, and none of other ideas I put down over the years means an overlap (total or partial) in research niches besides idea X \\[partial overlap\\]. But I don't want to be accused of theft either.\n\nI only moved on because my advisor wanted me to stay to develop a project that he/she was more interested about than I was. To the point I ended up thinking my advisor wanted me there so long we had the same interests. Because I liked idea X, and felt my advisor was not going to support me for that \\[after two unsuccessful attempts\\], I left at the end of my contract.\n\nEDIT: I forgot. As for the accusation vs insinuation... this is how the advisor put it:\n\n>PhD students and post-docs are not fellows, they get the right to collaborate within our projects, they do not have the right to use our funding and our ideas and run independent, parallel research programmes because that constitutes plagiarism or mis-use of the lab.\n\nIt feels to me as an accusation.",
          "author": "naiveScientist89",
          "created": 1612205613,
          "upvotes": 9,
          "replies": {
            "glnfrxu": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnfrxu/",
              "text": "> hey do not have the right to use our funding and our ideas and run independent, parallel research \n\nSounds like your PI is mostly concerned that you're not using your time to work on the research they're paying you to do.  So maybe \"theft of wages\" but not \"plagiarism\".  And my \"our ideas\" they may mean ideas developed by you on paid time (not to say this is right, but it may not mean they're claiming they came up with the idea).",
              "author": "rlrl",
              "created": 1612214178,
              "upvotes": 10,
              "replies": {
                "glnj65s": {
                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnj65s/",
                  "text": "I know what you mean.\n\nDuring my time at that institution, I developed the theory behind idea X on my spare time. The project I was working on at the time was very interesting (although no interesting as to devote my career to it), so I didn't mock around at work. Developing the theory behind idea X involved a few lines of code and some notes on a piece of paper. I used to have a look at it while I waited for experiments to end, or in a break, at home, etc.\n\nIt was only when I moved to another institution when I gave it a big push (I was unemployed for a couple of months while transitioning jobs, moving across the globe etc so I worked on it full time), and included bits of data from the other paper we agreed I'd develop and submit as a sole author. And it was also here when I thought, instead of only including the theory and supporting data in fellowship applications, to write a little proof-of-concept paper and justify/strengthen my applications.",
                  "author": "naiveScientist89",
                  "created": 1612215534,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "gln3l16": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/gln3l16/",
              "text": "> Given this I assumed, right or wrong, I could use it to test some parts of the theory behind idea X (after all, the data will be in the open whenever the manuscript is accepted, and it's common to re-analyse other lab's data for different purposes only citing the data's manuscript in return... this would be me citing myself).\n\n....This is crucial....anyone could come along and analyse this data  - all the are obligated to do is cite the dataset.  Hell I could do it.  and it doesnt matter if you supervisor likes that or not.",
              "author": "zukerblerg",
              "created": 1612209525,
              "upvotes": 9,
              "replies": {
                "glnactx": {
                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnactx/",
                  "text": "It sounds like the issue with this is that the manuscript with the data set is not yet published, and hence not yet publicly available for anyone to use. The OP mentions that it's under review. \n\nSo they are using a (currently private) data set from their advisors lab that no one else would have access to.",
                  "author": "Eigengrad",
                  "created": 1612212161,
                  "upvotes": 14,
                  "replies": {
                    "glnmgyh": {
                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnmgyh/",
                      "text": "Fair point , but it could be resolved by embargoing the second manuscript until the first is published",
                      "author": "zukerblerg",
                      "created": 1612216895,
                      "upvotes": 3,
                      "replies": {
                        "glnrt92": {
                          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnrt92/",
                          "text": "Sure. Wasn't trying to argue one way or the other, just point out that it makes a difference.",
                          "author": "Eigengrad",
                          "created": 1612219116,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "glnu1h8": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnu1h8/",
              "text": "I'm honestly still confused. Is this accurate?\n\na) you wrote a paper independently, with your previous advisor's blessing. That paper is published without the previous advisor as an author, and they have no problem with this. \n\nb) you took data that was part of that publication (freely available to all) to work on a different idea you came up with on your own, that you never worked on in your past advisor's lab. \n\nc) your past advisor is mad that you're working on an idea they refused to let you work on when you came to them with it, and is especially galled you're using data you generated in their lab to do so, even though this data is now part of the public domain due to open access publishing. \n\nd) your past advisor has now give this idea (??) to someone else?\n\nYour post is really confusing but if it's the case that you're taking data that you released as part of the initial publication, your PI didn't care they weren't an author on that initial publication, but now that you're using said publicly available data to work on a project they kept turning down but have now handed to someone else...\n\nAll I can say is I would ask your current PI what to do. I definitely think you should just talk to your former PI and see if you can hash this out. If you can do something reasonable to make them happy, do it. If they are unreasonable, then see what your current PI says; maybe consider e-mailing the editor of the journal. I would say that if your former PI was a reasonable person, it would have been good to ask them to be a co-author on the paper to preserve the relationship, but I don't think it's that terrible to move on and just do the idea yourself after they already passed on it twice.",
              "author": "tishtok",
              "created": 1612220053,
              "upvotes": 3,
              "replies": {
                "glnxfrq": {
                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnxfrq/",
                  "text": "Sorry for all the confusion. I hope this helps.\n\n>a) you wrote a paper independently, with your previous advisor's blessing. That paper is published without the previous advisor as an author, and they have no problem with this.\n\nExactly, except the paper is not yet published (under peer-review). If it's published there (if), I will be forced to make data publicly available. But it's common nowadays, even society type journals do this in my field. I submitted the new manuscript with idea X 3-4 months after that manuscript. Last week.\n\n>b) you took data that was part of that publication (freely available to all) to work on a different idea you came up with on your own, that you never worked on in your past advisor's lab.\n\nData will be free once the manuscript is accepted (in current or alternative journal). I developed the theory behind the idea while working on my past advisor's lab, but in spare time (I didn't neglect my current research to work on this other idea). I suggested twice to apply for funding to develop the idea (fellowships for me, to develop idea in advisor's lab). Advisor refused both times.\n\n>c) your past advisor is mad that you're working on an idea they refused to let you work on when you came to them with it, and is especially galled you're using data you generated in their lab to do so, even though this data is now part of the public domain due to open access publishing.\n\nYes (except data is not yet public, will be  if other paper accepted).\n\n>d) your past advisor has now give this idea (??) to someone else?\n\nNo. In the past, my data from other project (accepted 2 weeks ago) to visiting postdoc. He wanted to apply for fellowships, and my advisor handed over my data for his application. In the mock presentation this postdoc gave, 50% of the slides were my data.  This is how I knew. All colleagues (postdocs, phd students, technicians) exchanged awkward looks and carried on.",
                  "author": "naiveScientist89",
                  "created": 1612221514,
                  "upvotes": 1,
                  "replies": {
                    "glnyehv": {
                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnyehv/",
                      "text": "I see....I'm not really sure what to advise here. It seems like more of a gray area since the paper is not yet published and the data is not yet public. In my field it is expected that students will take their data with them to new positions, but also that data collected in the old advisor's lab will have that advisor as a coauthor even if it's written up later, when the student is in a different lab. But it is also expected that if someone from the old lab wants to work on the data an alum generated, the alum would be on every project and proposal. So in my field it's kind of a 2-way street, which it seems like both parties here violated. But your field's expectations may be really different...I would just talk honestly to your current PI. They are probably best suited to advise on this specific situation.",
                      "author": "tishtok",
                      "created": 1612221938,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "glnxx6d": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnxx6d/",
              "text": "It's a sternly worded email for sure, probably based on a misunderstanding (misunderstandings lead to that). If she/he wanted to really mess with you, it would have gone to the journal already. Try having a phone conversation followed by an email summarizing the conversation and your position. If he didn't contact anyone else but you, then I'm not certain what you can go to the ethics board or lawyer with anyway. I would think based on what you wrote that you can sort it out amicably. Good luck!",
              "author": null,
              "created": 1612221724,
              "upvotes": 2,
              "replies": {}
            },
            "glo26i4": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glo26i4/",
              "text": "> they do not have the right to use our funding and our ideas and run independent, parallel research programmes because that constitutes plagiarism or mis-use of the lab.\n\nI guess everyone is different but it seems like this is EXACTLY what you're SUPPOSED to do. Does your advisor expect you to do identical work to theirs and then also get a job? That would be pretty silly. \n\nA healthy PhD generally starts off as an apprentice, works on guided or pre-fabricated projects, and then slowly moves toward working on their own. Again, not in all situations, but the general ideal would be to have you graduate after having completed or at least started an \"independent\" project. Which is exactly what you've done. I can't see a problem at all. \n\nThe only small thing would be, does it hurt you to include them as an author (if you haven't already)? Clearly they feel they contributed, perhaps you feel differently, but it doesn't hurt to add them given that they did the \"space and resources\" bit.",
              "author": "logouteventually",
              "created": 1612223648,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "glmtke4": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmtke4/",
      "text": "Documentation and open communication might save your bacon!\n\nI had a similar advisor in a postdoc position. She attempted this (successfully) with graduate students, and (unsuccessfully) with her three postdocs. Each of us had individual ideas, and each of us had individual little meetings with her where she essentially threatened to ruin our future careers and/or have us deported if we didn't either give her the idea or at least make her lead author on every publication/grant application. She was up for tenure, and had no real ideas for her file. She was desperate.\n\nHer power was in keeping us isolated from each other. Once we all got together and compared our stories, we realized it wasn't an isolated case or two. It was a pattern of abusive behavior and unethical conduct. The international members of our group were hesitant to report her - our nation's government was at the time controlled by a vocally anti-immigrant buffoon, and they feared deportation - but we eventually gathered all of our materials and reported her, as a group, to several of her superiors at once. Her immediate superiors (the college dean and department chair) saw no reason to investigate. But the university VPs and federal grant managers overseeing her lab and grants were outraged. They brought down the hammer on her, and she made a discreet exit to another university just in time to avoid not getting tenure. And we all learned a lesson. We also contacted the journal authors to inform them of her misconduct, but they didn't seem to care.\n\nBut she's still out there, at a more prestigious university, no doubt building up a fresh lab of terrified students and postdocs. Academia taught this woman how to use others and exploit fears to get ahead, and she clearly hasn't been punished yet for her conduct, so she will continue doing whatever it takes to get publications and get ahead.\n\nPerhaps you will learn, as I did, that academia sometimes creates monsters out of people. And when you ask The System for help, you get none.",
      "author": "Greenmantle22",
      "created": 1612205649,
      "upvotes": 39,
      "replies": {}
    },
    "gln054v": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/gln054v/",
      "text": "Did you put your advisor's name on the manuscript?  I was under the impression that it is standard to put the lab PI's name on as last author in most cases.  If you didn't, and discussed the idea extensively with them, I can understand why they would be upset.",
      "author": "MarsReina",
      "created": 1612208172,
      "upvotes": 10,
      "replies": {
        "gln42y4": {
          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/gln42y4/",
          "text": "As per OP, the advisor clearly turned down the idea, and the manuscript wasn't even written while OP was working in the advisor's lab. That simply is not sufficient for an authorship claim, as much as some PIs like to think their name should be the last one on any manuscript written in their vicinity.",
          "author": "simoncolumbus",
          "created": 1612209722,
          "upvotes": 3,
          "replies": {
            "gln7dyt": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/gln7dyt/",
              "text": "It sounds like the advisor funded a lot of it though?  \"Space and resources\"?  It sounds like they did the lab work, and then published one manuscript, submitted the dataset to the journal (was the dataset itself ever published?)  and decided it was \"Free data\".",
              "author": "MarsReina",
              "created": 1612211013,
              "upvotes": 6,
              "replies": {
                "glpaqmr": {
                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glpaqmr/",
                  "text": "Providing funding is not sufficient for an authorship claim by literally all authorship standards I've seen. \n\nAnd yes, once the data are published as part of a publication, they are 'free data'. I could go and write a paper on their basis, too.",
                  "author": "simoncolumbus",
                  "created": 1612247120,
                  "upvotes": 1,
                  "replies": {
                    "glpfuvx": {
                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glpfuvx/",
                      "text": "But it isn’t published yet?  So no? You couldn’t.     \n\nFunding by itself isn’t supposed to be sufficient, but practically I don’t think I’ve ever seen a postdoc in my field publish something without the lab PI on it.   It just isn’t done.  Based on field, ymmv of course.   Funding and talking about it in group meetings in practice generally is.",
                      "author": "MarsReina",
                      "created": 1612250990,
                      "upvotes": 2,
                      "replies": {
                        "glplato": {
                          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glplato/",
                          "text": "My postdoc supervisor told me before I even started: \"I don't expect to be on all of your papers.\" Guess not everybody has an egomaniac for a boss.",
                          "author": "simoncolumbus",
                          "created": 1612255733,
                          "upvotes": 1,
                          "replies": {
                            "glr0v1l": {
                              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glr0v1l/",
                              "text": "I mean, if you want to write off everyone in my entire field as an egomaniac, I guess that's your prerogative as a psych postdoc.  You'll have to excuse me if I don't put too much stock in your judgement though.",
                              "author": "MarsReina",
                              "created": 1612284298,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "glmh3jn": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmh3jn/",
      "text": "That is some bullshit, OP. I'm sorry this is happening to you.  I wish I had advice to give.",
      "author": "ThePhysicistIsIn",
      "created": 1612200919,
      "upvotes": 30,
      "replies": {
        "glmi5nj": {
          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmi5nj/",
          "text": "Thank you anyway. My concern is obviously.... the recommendation letters. Because I stayed in the same PhD lab, I only have one referee from that institution (advisor), and assistant professorships usually ask for three (at my current institution I am interacting with more people who can act as referee, so had this not happen I would have 3 by the end of my 2nd postdoc). This might force me to do a third postdoc unless I come to terms with this advisor, and even then I'm not sure whether I'll have his/her recommendation.\n\nNot to mention my advisor might  air this as misconduct on my part to former colleagues.",
          "author": "naiveScientist89",
          "created": 1612201323,
          "upvotes": 8,
          "replies": {
            "glmuv4j": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmuv4j/",
              "text": "A lot of the time, that sort of unsolicited \"airing of dirty laundry\" is seen for what it really is. If they've never heard of you and aren't considering hiring you, and she emails them out of the blue to warn them about what a horrible person you are, they usually won't take it too seriously. They will wonder why she went to such great lengths to wound the reputation of a total stranger.\n\nAlso, it's possible she's the sort of person who has done this before, and the community will know she's just a bellyacher who spreads disharmony for her own reasons. They'll ignore that, too.",
              "author": "Greenmantle22",
              "created": 1612206136,
              "upvotes": 7,
              "replies": {}
            },
            "glmxejl": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmxejl/",
              "text": "Have you tried going through Ombuds?",
              "author": "MercuriousPhantasm",
              "created": 1612207105,
              "upvotes": 5,
              "replies": {
                "glmykkj": {
                  "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmykkj/",
                  "text": "In all honestly I haven't. The lab is small (for 2-3 years, there was one postdoc-me-and one phd student, plus technician) and even if I asked them to keep things quiet until I knew what's all this about... it would clearly point to me (as in who got Ombuds involved) even if Ombuds decided not give any names.",
                  "author": "naiveScientist89",
                  "created": 1612207557,
                  "upvotes": 4,
                  "replies": {
                    "glmyxl9": {
                      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmyxl9/",
                      "text": "The idea with Ombuds is that a neutral third party helps resolve the disagreement between two parties. So if your former PI really believes that they are in the right they should be willing to have an impartial person hear the whole story from both sides.",
                      "author": "MercuriousPhantasm",
                      "created": 1612207698,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gln8w6g": {
          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/gln8w6g/",
          "text": "Shameful, indeed. And as we can learn from series like Cosmos, this kind of thing has happened before, even to famous people like Isaac Newton. His predecessor, Hooke, tried to claim credit for his theory of gravity. \n\nAnd on the flip side, I've seen students from various groups go on to work on very similar ideas to our former advisor, and though he may have been a bit irked, he was always supportive. He certainly did not try to claim credit or sabotage his students.",
          "author": "DrSpacecasePhD",
          "created": 1612211593,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "glmp4xa": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmp4xa/",
      "text": "This sounds more like your advisor committing misconduct and using his or her supposed power over you to propagate a false story. They did not tell you anything about you stealing or copying their work. They also have a history of denying you funding and other things. They have palmed off your work to some others. As I see it, you owe them very little. I would suggest that you not give in to their demands. That may make you guilty for no specific reasons.",
      "author": "Kingarvan",
      "created": 1612203988,
      "upvotes": 19,
      "replies": {}
    },
    "glndlth": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glndlth/",
      "text": "So this might be a dumb question, but have you openly discussed this with your supervisor? You mentioned you have a good working relationship and it's pretty common to have bad source memory, i.e. forget where you got info/ideas from. Is there a chance it's just misremembering and miscommunication? I would have a conversation before taking other steps and just ask about that bit you cite above that you feel is an accusation and say it confuses you and share your impression/experience. Imo it's worth the effort because it's the friendliest way. I know academia can be harsh, but it can also just be a silly misunderstanding. I hope it is at least. I would love to stay updated, so please share. I hope it works out.",
      "author": "Gretchen_Darko",
      "created": 1612213353,
      "upvotes": 6,
      "replies": {
        "glnk3pn": {
          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnk3pn/",
          "text": "I have. I even suggested to have a skype call to sort it out but it seems difficult when there are 8-9h difference between us so there's a bit of ping-pong email at the minute. Like I mentioned, I'd rather get this sorted amicably.\n\nI know what you mean, but this was my genuinely first idea. I guess it's like you never forget your first... you know. I'm even thinking about sending my advisor the submission, as to put his/her mind to rest I have not put data dishonestly from other people, and even to send him/her statements of research interests to try to put my advisor's mind to rest as to I don't want to screw his/her research. But the issue with the visiting postdoc is holding me back. If I knew no snitching would come out of this I would even send my advisor my fellowship applications!\n\nWould this be worth doing? sending my advisor the submission and/or research interests?",
          "author": "naiveScientist89",
          "created": 1612215917,
          "upvotes": 2,
          "replies": {
            "glnmoko": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnmoko/",
              "text": "Hmmmm I would be quite hesitant too because of what happened with the visiting postdoc. However, this too could be an honest mistake. I haven't experienced something that similar, but kind of related: my supervisor set up a new experiment and it was super related to my work. And I felt really passed over/ignored (not sure about the word here, non-native). I just asked him and he just hadn't stop to think about it because he figured I was too busy anyway. So it turned out to be very considerate more than inconsiderate. \n\nBut obviously it's still not okay for him to give your work away. I would sort that out before sharing anything. He can genuinely believe it was his idea. PI's have so much on, it can be super hard to keep track. \n\nLong story short, I think before you do/share/worry anything more, try to get an actual (skype) conversation. Stop pingponging over email and have a proper talk. If he's emailing I feel even stronger that it's just a misunderstanding.",
              "author": "Gretchen_Darko",
              "created": 1612216984,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "glnermr": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnermr/",
      "text": "I’d advise to include the ex-PI as a co-author or at least acknowledge their contribution of “space and resources”. As far as I understood, the work reported in the manuscript wouldn’t be possible without those contributions. Make peace, make them feel valued and appreciated, everyone is happy and you can move past it.",
      "author": "shur42",
      "created": 1612213791,
      "upvotes": 4,
      "replies": {}
    },
    "gloxk3y": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/gloxk3y/",
      "text": "In my field, if the data was collected in my lab, aka I was supervising/providing guidance and feedback on your work, I have intellectually contributed, and therefore I should be an author on the paper. If you did a follow up study with new data, ok, you don't have to include me as an author. But if you used the data from my lab to write the new paper and didn't include me as an author? Hell no. I'd be pissed too. If the original data wasn't completely your side project, then you don't completely own the data. The arguments that you asked the advisor to fund it and he wouldn't, or that the data will be published if the paper is accepted have nothing to do with whether the advisor met the standards for authorship on the paper.",
      "author": "coldgator",
      "created": 1612238827,
      "upvotes": 3,
      "replies": {}
    },
    "glmrnvh": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmrnvh/",
      "text": "Certainly try to gather all of the evidence you can. I'd also contact your university ombudsperson (or something similar). Basically this would be an office that deals with research integrity and ethics. They should hopefully be able to resolve this conflict.\n\n&#x200B;\n\nYour PI initially agreeing to allow you to publish on your own (without him on the paper I presume) seems highly unusual, at least in my experience. I hope you have something in writing to back this up because, if not, it would seem as though he has a bit of an upper hand because of his power and the fact that you technically utilized his resources to complete this.\n\n&#x200B;\n\nGood luck! Sounds like a  very frustrating situation and I really hope you can figure this out!",
      "author": "raulu95",
      "created": 1612204941,
      "upvotes": 2,
      "replies": {}
    },
    "gloxq2e": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/gloxq2e/",
      "text": "OP should have waited to propose idea X until after the top journal paper got accepted and its publication forthcoming. As it is, it’s an ms under review; it could stay under review for months, depending on how much interest there is in the data and findings. Once the dataset is published, OP would have been as  free to pursue this line of inquiry as any other researcher. It sounds like the pi maybe doesn’t have a lot of confidence in the top journal paper’s quality—they didn’t want their name on it, after all—but suspects the theoretical paper has some potential. Publication of the latter project would have made some of the pi’s data public earlier than they want. OP’s timing was bad.",
      "author": "Opening_Doors",
      "created": 1612238917,
      "upvotes": 2,
      "replies": {}
    },
    "gln0047": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/gln0047/",
      "text": "I would recommend talking to your ombudsman or research integrity officer at the former university (and current university/position) and tell them the whole story with documentation. Stick to your guns. Don’t let them scam you.",
      "author": "stitchwitchknits",
      "created": 1612208116,
      "upvotes": 3,
      "replies": {}
    },
    "glmxiev": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmxiev/",
      "text": "If you have those emails and pieces of evidence they are fucked and you should fight them.",
      "author": "orangeatom3",
      "created": 1612207148,
      "upvotes": 1,
      "replies": {}
    },
    "gln3d40": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/gln3d40/",
      "text": "I’m sorry that you are faced with this uncomfortable situation. I would not be surprised if the journal rejects the manuscript based on your former supervisor’s accusation. I suggest reaching out to your former supervisor and discussing this issue. Perhaps you can resubmit the manuscript with your former advisor as one of the coauthors. (you should have done this as it’s the respectful thing to do - just my opinion)",
      "author": "slcap124",
      "created": 1612209439,
      "upvotes": 1,
      "replies": {}
    },
    "gln8vd5": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/gln8vd5/",
      "text": "Do you have your lab notebook or record of your experiments while in your former lab? Any additional evidence that you came up with or worked on the idea would be very helpful.",
      "author": "flyzapper",
      "created": 1612211584,
      "upvotes": 1,
      "replies": {
        "glnfpft": {
          "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnfpft/",
          "text": "My lab notebook is at my former institution, the only hard evidence I have is two emails I sent him 3 years ago: 1) pitching the idea + some plots suggesting the idea was not BS, and 2) a second email with the 2-page draft that my advisor suggested me to write. After email 1) we went for a coffee and talked about it, and wanted something in writing to get his/her head around it.\n\nThe second time was at a meeting in his office when he realised there was a funding scheme I could use to develop a project we were working on but was running out of funding. This was about a year and a half ago. When I mentioned idea X instead, the conversation ended almost immediately. But this is my word against my advisor's. Hard evidence of idea X, just those 2 emails. I have no emails from my advisor suggesting he/she had similar ideas and wanted to work towards them in the future. This only happened a few days ago after my advisor was asked to review my manuscript for a journal.\n\nI did present idea X, alongside progress on the theoretical side, during one of the lab meetings (which, given the small size of my advisor's group, it was joint with another group). So people in the group and beyond are aware of idea X (some of them also of my attempts to develop the idea, in my advisor's institution or elsewhere). And with my name only. And nobody mentioned anything at all about \"this was my idea\" back then.",
          "author": "naiveScientist89",
          "created": 1612214151,
          "upvotes": 2,
          "replies": {
            "glp3cha": {
              "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glp3cha/",
              "text": ">  1) pitching the idea + some plots suggesting the idea was not BS, and 2) a second email with the 2-page draft that my advisor suggested me to write. After email 1) we went for a coffee and talked about it, and wanted something in writing to get his/her head around it.\n\nGoing to be real, this sounds a lot like your advisor approved the research direction and helped turn your rough idea into an actionable research question which is worth authorship.",
              "author": "Mezmorizor",
              "created": 1612242141,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "glop6l5": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glop6l5/",
      "text": "Did you use data that was previously published, but look at the data through another \"lens\" thereby making your spin on the data unique?",
      "author": "angel_disguise",
      "created": 1612234585,
      "upvotes": 1,
      "replies": {}
    },
    "glp7xsc": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glp7xsc/",
      "text": "I say you fight it. If this is correct, you’ve done nothing wrong and you should have enough to turn this situation against the prof if you have to. You should certainly seek additional help in this matter to make sure you fight it. I’m not sure how to do this, but I don’t think you should let this individual sideline your career for something you did not do(assuming what you’ve said is true).",
      "author": "Rhed-R",
      "created": 1612245133,
      "upvotes": 1,
      "replies": {}
    },
    "glphdv9": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glphdv9/",
      "text": "This becomes a legal battle.  If you have any email communications that explicitly show that the idea is yours, and that you had made such a deal with him in regards to the ownership of the work. in most scenarios one could say that because it was within his lab and supervision that he gets credit, however this is a special circumstance.",
      "author": "swell3gant",
      "created": 1612252269,
      "upvotes": 1,
      "replies": {}
    },
    "gmv0ii3": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/gmv0ii3/",
      "text": "Hello everyone, just to let you know I'm still waiting to hear back. I'll let you all know as soon as I know something.",
      "author": "naiveScientist89",
      "created": 1612990797,
      "upvotes": 1,
      "replies": {}
    },
    "glmlqal": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glmlqal/",
      "text": "Lawyer up yo",
      "author": "Nervous-Juice-3263",
      "created": 1612202678,
      "upvotes": -2,
      "replies": {}
    },
    "glnl1lg": {
      "link": "/r/AskAcademia/comments/la8pmz/phd_advisor_accused_me_of_misconduct/glnl1lg/",
      "text": "Look at the ethics guidelines. I don't believe there is anything at all in there about stealing ideas.",
      "author": "Such_Possession4553",
      "created": 1612216305,
      "upvotes": 0,
      "replies": {}
    }
  }
}