{
  "sid": "pp9ymk",
  "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/",
  "title:": "what's the most valuable thing you've learnt?",
  "text": "I'm in my first year of a PhD and just coming off 12 months of home working.\n\nTo me, the most crucial thing I've come to terms with is that I can't be expected to perform the way I did when I was on campus, especially because of the distractions or general setup I have at home.\n\nMoreover, I suppose it's also important to not judge productivity based upon raw output. Sometimes I only mabage to work 4 hours in a day or only make it through one article when I had 3 queued up. \n\nWhat are some good pointers or tools you've come to use?",
  "author": "Nuclear_Fermion",
  "created": 1631784651,
  "updated": 1634078967,
  "over_18": false,
  "upvotes": 96,
  "upvote_ratio": 0.95,
  "comments": {
    "hd2an5p": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2an5p/",
      "text": "Realistically judging my ability and saying “no” to things which would overtax me, even if they’re advantageous and I *want* to do them.",
      "author": "Cerulean_critters",
      "created": 1631789437,
      "upvotes": 87,
      "replies": {
        "hd2e2p2": {
          "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2e2p2/",
          "text": "I realized how easy it is to say \"yes\" to those requests and how challenging it is to say \"no.\" I've been thinking about saying \"no\" as a gift to my future self.",
          "author": "drLilu",
          "created": 1631791780,
          "upvotes": 14,
          "replies": {
            "hd66z8x": {
              "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd66z8x/",
              "text": "That’s a great way to think of it!",
              "author": "Cerulean_critters",
              "created": 1631853960,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hd573n4": {
          "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd573n4/",
          "text": "I said yes to everything the first ten years because I wanted to do everything I could to ensure my position at the institution. I've been able to back off in recent years, but I would say part of the reason I've secured my position was my willingness to be helpful when asked. So I would recommend saying \"yes\" in your first years, and tapering off as you learn what is important and what isn't.",
          "author": "bobzor",
          "created": 1631835944,
          "upvotes": 3,
          "replies": {
            "hd66wii": {
              "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd66wii/",
              "text": "Oh absolutely, say yes to things when you want to, and can do so! I’m on my 4th year of a PhD program though and I don’t have time/bandwidth to take on any more side projects or extracurriculars than I already have in play",
              "author": "Cerulean_critters",
              "created": 1631853912,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hd2bwt1": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2bwt1/",
      "text": "Be extremely critical about who / which projects and activities you let take your time. Definitely don't accept doing other people's work for them, especially if you have that pleaser-type inclination - you're contributing to the anti-meritocracy and ultimately harming the scientific process.",
      "author": "waterless2",
      "created": 1631790336,
      "upvotes": 63,
      "replies": {
        "hd2pbv8": {
          "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2pbv8/",
          "text": "I think this is especially important for newish PhD students like OP (and hell, everyone else too!) to realise.\n\nA lot of people leave undergrad with the \"perfect student\" mentality, where if they do loads of optional tasks and take on all the responsibilities then they'll be a \"good\" PhD student. No. The only things that truly matter are *your* research/publications (if you want a research career), *your* teaching (if you want a teaching career), and whatever else you are contractually obligated to do to receive funding and maintain your student status. \n\nEverything else unrelated to those is fluff. You're not going to advance your career by volunteering to sit on the computer users committee. It won't even go on your CV. No one will ever know (or remember) that you did that, so you should only do it for your personal enjoyment. Not because you want a gold sticker and an A+ for being the bestest-ever student.",
          "author": "officially_anxious",
          "created": 1631798017,
          "upvotes": 14,
          "replies": {}
        },
        "hd4p74x": {
          "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd4p74x/",
          "text": "redacted",
          "author": "zen_arcade",
          "created": 1631827621,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hd2dsxo": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2dsxo/",
      "text": "PhD/research is my career, not my life. Separate them with very firm hours.",
      "author": "CptSmarty",
      "created": 1631791606,
      "upvotes": 59,
      "replies": {
        "hd2j7t9": {
          "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2j7t9/",
          "text": "This was particularly hard for me. In grad school it was hammered into my head that the best scientists were those that you couldn't distinguish their personal persona from their professional persona. It took a long time to realize that only meant \"don't feel like you have to put on a show in talks\" NOT \"if you aren't working you aren't a scientist.\" Covid is probably the only reason I figured that out and didn't have a heart attack at 35.",
          "author": "chickabawango",
          "created": 1631794854,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "hd2fge7": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2fge7/",
      "text": "My personal worth is not determined by how well my science works. \n\nClosely related, I am worth infinitely more than my science or even this degree.",
      "author": "phangirloftheopera",
      "created": 1631792649,
      "upvotes": 37,
      "replies": {}
    },
    "hd2cd1e": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2cd1e/",
      "text": "I learned to accept that things will never go according to plan and to quickly adapt to change",
      "author": "methomz",
      "created": 1631790649,
      "upvotes": 28,
      "replies": {}
    },
    "hd2jhpm": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2jhpm/",
      "text": "Figure out which part of your job you enjoy the most, so that you can fall back to that when you get bored of it or feel burned out and unmotivated. \n\nFor me, it's reading big-picture papers. They remind me of how important it is what we're doing, how my own work fits into it, they inspire future research ideas, and they just remind me about what I want my research to say something about.\n\nWhenever I feel I lose motivation and become bored, I make time for papers and getting back to thinking about the big picture instead of the nitty gritty day to day work (admin, teaching, marking, ugh).",
      "author": "PandoraPanorama",
      "created": 1631795009,
      "upvotes": 22,
      "replies": {}
    },
    "hd2rku0": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2rku0/",
      "text": "Your advisor isn't always right, and what he or she says will not always transcend to where you want to be afterwards and the expectations and work needed to get there. This is especially true for career academics mentoring a person who wants to go into industry, I was one of those. Your advisor if they are young has very little management experience. Part of being an advisor is being a manager in the classic business sense. Some of these people have not worked a day in their life, and will not know how to coach you to be the best researcher you can be. In that sense you are on your own with some advisors. After my PhD program in one of the STEM disciplines I worked at the school for a young business professor to do research, I also did my MBA in that business school, before going into industry. My boss had industry, management experience, and was a great researcher, way smoother sailing compared to my PhD experience.",
      "author": "Weird_Surname",
      "created": 1631799079,
      "upvotes": 16,
      "replies": {}
    },
    "hd2y880": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2y880/",
      "text": "Be flexible, go with the flow, have multiple backup plans.  Experiments will blow up in your face.  A water pipe will burst and flood your lab.  Your advisor will land a huge grant and make you change your experimental plans.  Life events will happen.  \n\nWhile they will be a pain in the rear now, all of these things will be great experience when you are on your own.  Change is the only constant.\n\nAlso, learn a phrase like, \"I don't know but I will find out\" or \"That is an excellent question, let me get back to you.\"  You don't have to know everything and that is okay.",
      "author": "manova",
      "created": 1631802013,
      "upvotes": 13,
      "replies": {}
    },
    "hd2txli": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2txli/",
      "text": "That the system will ride a willing horse as long as it lets them.",
      "author": "anoddlittlebird",
      "created": 1631800165,
      "upvotes": 8,
      "replies": {}
    },
    "hd33dl4": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd33dl4/",
      "text": "Prioritize your outputs. \n\nI've always been tempted by fun projects or side projects more than what I actually need to do for publications or grant proposals. \n\nAll it really takes is 1-2 minutes of consideration across all your projects on your drive in.",
      "author": "KenReid",
      "created": 1631804130,
      "upvotes": 8,
      "replies": {}
    },
    "hd2wb6c": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2wb6c/",
      "text": "That science must not always be trusted.",
      "author": "Jogroig",
      "created": 1631801202,
      "upvotes": 7,
      "replies": {}
    },
    "hd2lqbq": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2lqbq/",
      "text": "Probably intellectual humility - most things are much more complex than they seem at face value and just because something seems like it's common sense or obvious does not mean that it's true.\n\nIf we're talking more meta about academia as a profession, it's that I'm absolutely awful at saying \"no\". Although I'm not sure I can really say that I've learned this because I still constantly make this mistake. As I write this, I'm about to agree to an outreach activity that I do not have the time for.",
      "author": "Chlorophilia",
      "created": 1631796221,
      "upvotes": 6,
      "replies": {}
    },
    "hd2vozx": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2vozx/",
      "text": "I’m not in Academia (I wish!), but my sister says my NASA stories remind her of her PhD program…\n\nSo the single most valuable thing I’ve learned in my academia-like world is ASK FOR HELP!!! There is always someone who can help you, and it’s so important to feel like you are not alone.",
      "author": "Alisaie-Leveilleur",
      "created": 1631800935,
      "upvotes": 4,
      "replies": {}
    },
    "hd30p58": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd30p58/",
      "text": "Maybe humility, and also sort of grace. While I was in grad school, I was often extremely unempathetic to undergrads, who I saw as lazy and chronically making bad choices. I took a certain kind of sick pleasure in being as \"hardcore\" as I could, pulling all-nighters to read, grade, etc. And then I looked down on the students in the classes I taught or TA'd who wouldn't do the same thing. Even in my own grad seminars, I took pride in having a snappy comeback, or a snarky retort that demonstrated how witty I was, or how much more reading I'd done than my classmates.\n\nI was insufferable.\n\nSince then I've figured out that I come from a pretty privileged background, and other people have a completely different lived experience, and the constraints on their lives are wildly different from mine. I really make an effort to remember that I don't always know best or that my way is \"the right way\". That's actually harder than one might think.",
      "author": "Ethan-Wakefield",
      "created": 1631803036,
      "upvotes": 13,
      "replies": {
        "hd3obxd": {
          "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd3obxd/",
          "text": "Congrats on your progress! I definitely had times when I wasn't kind when I was a PhD student, especially in the earlier years. I think it came from insecurity - being worried that I wasn't making any progress, so trying to emphasise any way I was 'better' than the less experienced students. It wasn't kind and I hate thinking about it, but I like to think I'm very different now.",
          "author": "bail245",
          "created": 1631812540,
          "upvotes": 3,
          "replies": {
            "hd3sb9u": {
              "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd3sb9u/",
              "text": "I think for me it was maybe slightly insecurity, but just as much a feeling that I was a \"good person\" because I valued education and work ethic, etc., which is what let me \"get ahead\". And then any failings that I saw in my undergrads were clearly due to not having the right priorities. I saw them as making bad choices. What my grade school gym teachers would have called \"playing stupid games and winning stupid prizes\".\n\nI thought that education (and US society as a whole) was a meritocracy, and that my success showed that I was \"winning\" and that objectively demonstrated that I was smarter/better than other people, and so naturally I was the right person to teach a class and tell people how to live their lives.",
              "author": "Ethan-Wakefield",
              "created": 1631814145,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hd3oi5i": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd3oi5i/",
      "text": "how to cook brussel sprouts to perfection",
      "author": "james28909",
      "created": 1631812611,
      "upvotes": 3,
      "replies": {}
    },
    "hd2p1nt": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2p1nt/",
      "text": "If you want something done, do it yourself",
      "author": "StimmedKarp",
      "created": 1631797883,
      "upvotes": 8,
      "replies": {}
    },
    "hd3kex2": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd3kex2/",
      "text": "Most deadlines aren't real, but the ones that are real, are ***VERY*** real.",
      "author": "PrinceWalnut",
      "created": 1631810978,
      "upvotes": 3,
      "replies": {}
    },
    "hd3kgmn": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd3kgmn/",
      "text": "From every failed experiment, there is also a lesson to be learned. Remember the lessons you learned along the way when you have to repeat those experiments. TLDR: You will fuck up more often then not. Make sure to write down why you think you fucked up.",
      "author": "ale890",
      "created": 1631810996,
      "upvotes": 2,
      "replies": {}
    },
    "hd3xve0": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd3xve0/",
      "text": "Methods and skills are important -- learn them now. You will only have time to learn these skills (think R, Matlab, programming etc) now and during post-doc. As soon as you're lecturer, you're knee deep in all the other things you need to do, so that there's very little time to learn them, unless you get a sabbatical or something like it.\n\nAt the same time, of course, make sure you devote enough time to your project, so that you can complete in time. That's the golden balance you have to find during a PhD. Do your work and publish to acquire a track record, but also learn, learn, learn.",
      "author": "PandoraPanorama",
      "created": 1631816399,
      "upvotes": 2,
      "replies": {}
    },
    "hd3y6q1": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd3y6q1/",
      "text": "And one more things: make friends. The friends you make now are so important. Many of them will leave academia over the years, but so many will remain, and they will form your network of people that you can rely on, for references, reviews, to hear about job offers, and for collaboration partners. And most importantly: having good people around makes life as an academic so much more fun.",
      "author": "PandoraPanorama",
      "created": 1631816525,
      "upvotes": 2,
      "replies": {}
    },
    "hd44bs4": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd44bs4/",
      "text": "That the relationship between time spent in lab/time working on your project is not linear with publications/progress. Hardwork correlates with success...sometimes. There are a lot of super talented scientists who are working their butts off learning new techniques, immersing themselves in the literature, doing a gazillion experients and yet stuck on a project that's not going anywhere. Simultaniously, there are students who get handed a great established project, spend minimal time/effort proving it out and still get multiple first author publications and graduate within 5 years (if I'm being honest, these are usually the MD/PhDs at my school). Maybe I'm a bit cynical at this point, but it's worth noting that sometimes there's a great deal of luck involved with \"success\"",
      "author": "IncompletePenetrance",
      "created": 1631819037,
      "upvotes": 2,
      "replies": {}
    },
    "hd47nku": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd47nku/",
      "text": "The paradoxical relationship of taking time off and getting work done. \n\nMy fear of taking an evening, weekend, or holiday off of work is that I will get less done. Rather I am more efficient if I regularly allow myself to step back from my work and do something relaxing or fun.",
      "author": "palepinkpith",
      "created": 1631820395,
      "upvotes": 2,
      "replies": {}
    },
    "hd4wnmc": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd4wnmc/",
      "text": "It can be perfect, or it can be complete. Not both.",
      "author": "xidifen",
      "created": 1631830925,
      "upvotes": 2,
      "replies": {}
    },
    "hd2eelt": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2eelt/",
      "text": "During my master's by research I've learned what I need from a supervisor, so I now know what to look for when applying for PhD positions!",
      "author": "AutumnBluee",
      "created": 1631791996,
      "upvotes": 1,
      "replies": {}
    },
    "hd2n95c": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd2n95c/",
      "text": "To remove emotion when making decisions",
      "author": "backdoor_breacher",
      "created": 1631797001,
      "upvotes": 1,
      "replies": {}
    },
    "hd4lyqi": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd4lyqi/",
      "text": "This might be controversial, but the PhD doesn’t matter. 99% of the population don’t have one and are living. It’s just a degree. Tying your self worth to a title and piece of paper is a recipe for misery, and I felt liberated to do better work and enjoy the work once I realised how unimportant it is.",
      "author": "StrepPep",
      "created": 1631826234,
      "upvotes": 1,
      "replies": {}
    },
    "hd4r810": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd4r810/",
      "text": "How to realistically manage expectations of what you can achieve - what I planned to do when I started is very different to what I actually managed to do.\n\nAnother thing I’ve learn is to have contingency plans, especially if you have experimental work or are reliant on other people. Always prepare for the worst but hope for the best!",
      "author": "haribo001",
      "created": 1631828496,
      "upvotes": 1,
      "replies": {}
    },
    "hd4vgnm": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd4vgnm/",
      "text": "Not be afraid to ask for help or fail. I keep doing both and I'm learning more.",
      "author": "cowjuicer074",
      "created": 1631830388,
      "upvotes": 1,
      "replies": {}
    },
    "hd5ms8m": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd5ms8m/",
      "text": "I feel like the value of my PhD was equal parts the subject-matter expertise I gained in my field of study and the soft skills, namely the ability to self-organize and self-motivate even in face of daunting tasks or discouraging results, and being able to efficiently skim through large quantities of information, distill content and extract patterns/trends.\nThese soft skills help me tremendously in my career (now corporate/industry).",
      "author": "Miles-away2007",
      "created": 1631843428,
      "upvotes": 1,
      "replies": {}
    },
    "hd4tlw8": {
      "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd4tlw8/",
      "text": ">I'm in my first year of a PhD\n\n>learnt\n\nSmh",
      "author": "syeysvsz",
      "created": 1631829552,
      "upvotes": -1,
      "replies": {
        "hd4u0ww": {
          "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd4u0ww/",
          "text": "Problem?\n\nhttps://dictionary.cambridge.org/dictionary/english/learnt",
          "author": "Nuclear_Fermion",
          "created": 1631829738,
          "upvotes": 1,
          "replies": {}
        },
        "hd4wwqh": {
          "link": "/r/AskAcademia/comments/pp9ymk/whats_the_most_valuable_thing_youve_learnt/hd4wwqh/",
          "text": "Are you implying this is an error?",
          "author": "xidifen",
          "created": 1631831039,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}