{
  "sid": "pib4e0",
  "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/",
  "title:": "Pure Life Science / Biotech careers from a Computer Science background possible?",
  "text": " Hi all, I will try to keep as short as possible:\n\n\\- I am interested in working in a pure life science jobs in a lab in places like pharma.\n\n\\- I have done a BSc in Computer Science and 2 years as a programmer.\n\n\\- I have done research but it seems that everything available is in Computational Biology, Bioinformatics or Data Science (in a drug discovery type of situation). The problem is that all those are Computer Science-centric stuff and not something like Pharmacology Research and Development or Clinical Trials etc.\n\n\\- So it seems that due to my change of interest, my degree is not really that relevant. I have no issue with applying to a whole new Bachelor degree in life science (biomed, biochem, pharmacology, genetics etc). And then do a Masters + PhD etc.\n\n\\- I want to make sure if there are options that can let me in through some Masters on top of my current IT degree or I must start over.\n\nAll of my friends that work in hospital labs, pharmaceutical companies (whether as a lab coat scientist or in a business role like Marketing), have classic Biochem etc degrees.\n\nThanks in advance!",
  "author": "justcamehere533",
  "created": 1630839794,
  "updated": 1634079393,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.9,
  "comments": {
    "hboc9d7": {
      "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hboc9d7/",
      "text": "If you never took the core biology major and other prerequisite courses (notably organic chemistry), and never took lab courses, you will find it nearly impossible to move into pure life science jobs directly. And if you want to shift away from anything computational at all, then you're right, a computer science degree and programmer is not really useful.\n\nSince you already have a BSc degree, one option (even if not officially), is to enroll as a bachelors or an extension student, take only the relevant/required courses to bring you up to speed which will probably take 2 or maybe 3 years, then apply to Masters or PhD programs from there. You won't need to retake all the gen ed and intro courses again, only the ones for a biology (or similar) major.",
      "author": "JHT230",
      "created": 1630841276,
      "upvotes": 5,
      "replies": {
        "hbocvmk": {
          "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbocvmk/",
          "text": "thanks!  \n\n\nSo I take it that Computational Biology / BioInformatics / even saw Biochemistry MSc or MSc + PhD pigeonhole you into computational aspects and won't be a classic RnD lab position making therapies in, say, Pfizer etc.",
          "author": "justcamehere533",
          "created": 1630841752,
          "upvotes": 2,
          "replies": {
            "hbodmcs": {
              "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbodmcs/",
              "text": "Not necessarily.\n\nWhat matters just as much is your Bachelor's degree - if you have taken the complete set of relevant biology and lab courses (or something similar like biomedical engineering, medicine, or med chem) then you should have the basic skills to work in a lab.\n\nSo a BS in Biology + MS in Computational Biology can set you up fine (although it won't be as competitive as a lab-based MS), but a BS in Computer Science + MS in Computational Biology leaves huge gaps on the experimental side.",
              "author": "JHT230",
              "created": 1630842312,
              "upvotes": 1,
              "replies": {
                "hbokq5b": {
                  "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbokq5b/",
                  "text": "Is there any ways to mitigate this short of re-doing a Bachelor (in BiomedSci/MedSci etc)?\n\nE.g I can get into a MSc Biomed engineering and a MSc + PhD in Biochem (yes not comp bio or biochem or bioinf) in Oxford (I am from the UK) but they told me projects will be given according to specialty in undergrad which I guess would pigeonhole me into the same.",
                  "author": "justcamehere533",
                  "created": 1630846978,
                  "upvotes": 1,
                  "replies": {
                    "hboom6n": {
                      "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hboom6n/",
                      "text": "It comes down to the lack of required basic skills and background knowledge. So if there is some other way of learning that, whether through a job or internship, or self study, and then being able to prove that you know enough, it might work. But taking the required courses (not necessarily getting another full Bachelor degree) is probably the easiest and most realistic way.\n\nIf you ask around at different universities they might have other options or solutions for what it would take for them to get to admit you to their program.",
                      "author": "JHT230",
                      "created": 1630849125,
                      "upvotes": 1,
                      "replies": {
                        "hbopjo0": {
                          "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbopjo0/",
                          "text": "yep, for example in Oxford they have a Biochem MSc or integrated PhD and they allow people from Comp/Physical science background. They said there will be an emphasis on computational if you are from an eng/comp sci background but I guess that will give me some bench wet-lab exposure and authority that I am \"in the context of life science)  \n\n\nanother thing that worries me is that, assume I do the above, a lot of RnD scientist jobs I have looked at still emphasis on wet-lab techniques and even if I have a MSc/PhD in Biochem IDK if they will accept because the BSc is not traditional at all (not BiomedSci/Bio/Chem/BioChem/Health Sci etc)",
                          "author": "justcamehere533",
                          "created": 1630849610,
                          "upvotes": 2,
                          "replies": {
                            "hbq9p75": {
                              "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbq9p75/",
                              "text": "If you want to make drugs, you need to know how to make drugs. So about 14 or so undergrad chem courses, and a lot of experimental grad school.",
                              "author": "Chemastery",
                              "created": 1630874765,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hbodidh": {
      "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbodidh/",
      "text": "I've had many students from computational background do lab work and one of them became a pure experimentalist. But, this requires transitional training. You could consider (1) postbacc programs (2) try to get a technician job where you start as a computer person and ask to be trained in lab work. (3l go to graduate school for compbio and find a lab that does both.",
      "author": "unreplicate",
      "created": 1630842230,
      "upvotes": 3,
      "replies": {
        "hbolb7p": {
          "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbolb7p/",
          "text": "How does this relate to certain jobs I am interested in, such as:\n\n\\- Making chemotherapy drugs in pharmaceutical companies.\n\n\\- Making vaccines etc.  \n\n\nRegarding your point about postbaccs - can you elaborate more, please? You mean directly applying to a Masters in stuff like Biomed/Microbiology/Genetics etc? Because they all require a pure life/medical science bachelor.  \n\n\nI think I can only get into BioInf and CompBio Masters and beyond.",
          "author": "justcamehere533",
          "created": 1630847309,
          "upvotes": 1,
          "replies": {
            "hbpjph0": {
              "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbpjph0/",
              "text": "I think you are saying you want to be in R&D in those areas--I presume not the run of the mill technician. For that, you need a PhD--for both jobs in industry and academia. In pharma companies nearly all scientists on R&D side are PhDs.\n\nTo go into a Biomed PHD program, you could apply to bioinfo programs and find labs that do both and are willing to train you in lab work. Or, you can do postbacc programs to get biology course credits. Typically these are 1-2 year undergrad programs designed to allow you to take courses outside of your original major--e.g.., it is very popular with med school applicants who originally did non-bio major. The main problem is that it costs tuition.",
              "author": "unreplicate",
              "created": 1630863176,
              "upvotes": 2,
              "replies": {
                "hbpkj9n": {
                  "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbpkj9n/",
                  "text": "Yes you can assume I know that scientist positions with decent progression requires at least a MSc and a PhD. But here I am just referring to MSc as an entry point to do that in a pure BioMed specialty then do a PhD specialising in Viral Infections and then apply to Pfizer vaccine stuff etc. Just an example.I am very well aware a BSc in Biomed/Biochem still cannot quality for much in pure RnD.\n\nSo apart from starting over, either through a full bachelor or half one or whatever, getting into the hybrid compbio/bioinf route and squeezing as much pure wet-lab training as possible to do a PhD in that. Although I feel this is still a wildcard because they still do put emphasis on a relevant BSc. And that emphasis is, I am afraid, worse when you look for IRL pharma/biotech industry jobs.\n\nI have given an example and clarification of what I mean on a comment subthread with another user. Copied it here to illustrate:  \n\n\n***Research Associate***\r  \n\r  \nhttps://inflammatix.com/careers/?gh\\_jid=4683112003\r  \n\r  \n\\^ This is what I think I want compared to comp stuff. Requirements are quite heavy - \"BS degree in Molecular Biology or a related field; Knowledge of molecular biology techniques including PCR, qPCR, RT-qPCR, and nucleic acid isolation and manipulation.\"\r  \n\r  \n***Medical Science Liaison (UK)***\r  \n\r  \nhttps://inflammatix.com/careers/?gh\\_jid=4653826003\r  \n\r  \n\\^ Again this sounds more communication/science information which is also something I became keen on (even compared to pure lab-worker stuff). However - \"Advanced degree (Ph.D., Master or Diploma) in medicine, pharmacy, or life sciences.\"\r  \n\r  \n***Senior Clinical Research Associate***\r  \n\r  \nhttps://inflammatix.com/careers/?gh\\_jid=4433388003\r  \n\r  \n\\^ This is clinical trials - in RnD but based on \"project management\" more, hence no PhD/MD mandatory but \"BS degree in relevant field\" probably means at least BSc in a Life Science.\r  \n\r  \n***Now here are two Machine Learning and Computational Biology roles:***\r  \n\r  \nhttps://inflammatix.com/careers/?gh\\_jid=4685772003\r  \n\r  \nhttps://inflammatix.com/careers/?gh\\_jid=4662172003\r  \n\r  \nClearly programming/computationally oriented and focused on the clinical advancement of the products.\r  \n\r  \n***But the questions still remain:***\r  \n\r  \n***1. I feel like I am drawn more to the former three rather than the latter two and I can't seem to understand how much the latter two are different when it comes to \"how biomedical labrat they are\" compared to the first one \"Research Associate\".***\r  \n\r  \n***2. If I want the former 3 then it seems like having a BSc Computer Science is a dead-end for them?***\n\nThank you for your time.",
                  "author": "justcamehere533",
                  "created": 1630863539,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hbpfwam": {
      "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbpfwam/",
      "text": "Hi, I did a similar transition. I have a background engineering (masters) and in mathematics (PhD). I moved to life sciences 10 years ago, and I am now a researcher in that field, even though my work still lies at a theoretical and computational, but with a consequent experimental biology component. I am also living in a place in Europe where Pharmaceutical companies hire large portion of the population.\n\nDepending what your target is and the field of biology you want to work, you will need to do masters in life sciences but you will still need to validate some BSc classes. If you want to do interesting jobs in Industry, like group leader or so, a PhD is mandatory. That's what I see around me everyday.\n\nIn the research group I am in, we have recruited people as PhD students with no prior background in Biology (CS, math, engineering, etc.) and they did pretty well. They learned how to do experiments from scratch and to devise their own research. This worked because we work on Systems and Synthetic Biology, which is essentially an engineering field and not a scientific field, but this may not work for other subfields of biology where prior background in biology is necessary.",
      "author": "ko_nuts",
      "created": 1630861490,
      "upvotes": 2,
      "replies": {
        "hbponep": {
          "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbponep/",
          "text": "Hi, and thanks for your input. I am aware that PhD is usually necessary for top tier progression. I was just referring to MSc only in the context of whether I can switch directly to a pure Biochem/Biomed one (with plans to do a PhD).  \n\n\nAnd this makes sense - apart from CompBio/BioInf MSc and PhDs there are some programmes in UCL/Imperial here in the UK (where I am based) for exactly synthetic biology where they also accept engineers/comp sci + maths/physics.   \n\n\nSo unless I am in a computational-bio hybrid I might have to start over with a full/partial BSc in stuff for pure wet-lab (like making vaccines or cancer chemo stuff). I think I can illustrate the separation of concern based on isolating a few job roles with comments from a single biotech start-up type company:  \n\n\n***Research Associate***\r  \n\r  \nhttps://inflammatix.com/careers/?gh\\_jid=4683112003\r  \n\r  \n\\^ This is what I think I want compared to comp stuff. Requirements are quite heavy - \"BS degree in Molecular Biology or a related field; Knowledge of molecular biology techniques including PCR, qPCR, RT-qPCR, and nucleic acid isolation and manipulation.\"\r  \n\r  \n***Medical Science Liaison (UK)***\r  \n\r  \nhttps://inflammatix.com/careers/?gh\\_jid=4653826003\r  \n\r  \n\\^ Again this sounds more communication/science information which is also something I became keen on (even compared to pure lab-worker stuff). However - \"Advanced degree (Ph.D., Master or Diploma) in medicine, pharmacy, or life sciences.\"\r  \n\r  \n***Senior Clinical Research Associate***\r  \n\r  \nhttps://inflammatix.com/careers/?gh\\_jid=4433388003\r  \n\r  \n\\^ This is clinical trials - in RnD but based on \"project management\" more, hence no PhD/MD mandatory but \"BS degree in relevant field\" probably means at least BSc in a Life Science.\r  \n\r  \n***Now here are two Machine Learning and Computational Biology roles:***\r  \n\r  \nhttps://inflammatix.com/careers/?gh\\_jid=4685772003\r  \n\r  \nhttps://inflammatix.com/careers/?gh\\_jid=4662172003\r  \n\r  \nClearly programming/computationally oriented and focused on the clinical advancement of the products.\r  \n\r  \n***But the questions still remain:***\r  \n\r  \n***I feel like I am drawn more to the former three rather than the latter two and I can't seem to understand how much the latter two are different when it comes to \"how biomedical labrat they are\" compared to the first one \"Research Associate\".***\r  \n\r  \n***If I want the former 3 then it seems like having a BSc Computer Science is a dead-end for them?***",
          "author": "justcamehere533",
          "created": 1630865351,
          "upvotes": 1,
          "replies": {
            "hbqfxdv": {
              "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbqfxdv/",
              "text": "Where are you based or where do you want to work? The systems are different from one place to another. Some of the offers you posted are in the US where most people do BSc whereas in Europe it is very common to do a MSc after that since there is an an explicit master program in Europe which is separated from the PhD program.\n\nSpeaking for Europe, even if you start with a master in life sciences, you will need to show that you have the prerequisites. So, in the end whether you do another BSc or not does not matter much.",
              "author": "ko_nuts",
              "created": 1630877625,
              "upvotes": 2,
              "replies": {
                "hbqqssf": {
                  "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbqqssf/",
                  "text": "Based - UK (also an EU citizen of a country in Eastern Europe);  \nWork - can take any location for a job if that is the job I want;\n\nI just illustrated the different types of jobs I am interested in + the computational bio ones from a single, start-up biotech company for simplicity sake. If I open GSK/Astra-Zeneca/other pharma in the UK it will show the same requirements and same job titles.\n\nSeparate Masters are available in the USA and PhDs with an integrated Masters are also available in the UK. But I am not sure why this matters. Interesting point, however.  \n\n\nSo based on the first 3 types job titles I am not sure if I am \"screwed\" when it comes to obtaining them compared to the latter 2, unless I start over with a BSc in Biomed/Biochem or go down the Masters in CompBio/BioInf and get some bench/wet-lab and try to convince a PhD program (in Pure Life Science) to take me. \n\nBut even then afterwards I am not sure how an employer like Pfizer/Novaritis/Astra-Zeneca would take that.  \n\n\nThank you for your time.",
                  "author": "justcamehere533",
                  "created": 1630882859,
                  "upvotes": 1,
                  "replies": {
                    "hbqrii7": {
                      "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbqrii7/",
                      "text": "I mean if you want to work in a wet lab or on pharma companies and do some experimental work, you will need to study life sciences, there is no other way for you to prove that you have the necessary background for achieving all your tasks. They will never take a BSc in CS with no prior knowledge of biology.\n\nIf you are interested in some programs, let me know. \n\nAnother question. Why are you attracted so much in experimental jobs in Biology. I mean when I started in biology I realized that the field was dramatically different from what I thought. Biology is a weird field, nothing is really predictable, a lot of tasks are very repetitive and dull. It is a very interesting field, though. I am saying that because I have the feeling that you may be attracted to this field for reasons that may turn out to be unsatisfied in the future.",
                      "author": "ko_nuts",
                      "created": 1630883206,
                      "upvotes": 2,
                      "replies": {
                        "hbqrx6r": {
                          "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbqrx6r/",
                          "text": "Even if I hybrid myself through a MSc/PhD in Comp-Bio/Bio-Inf try to get progressively more wet-lab?  \n\n\nDoes my segregation above from that start-up company in terms of job titles make sense though? And, am I toast for the former 3?  \n\n\nTbh tho, the latter 2 still look clinically relevant as much as the first one on the post.",
                          "author": "justcamehere533",
                          "created": 1630883410,
                          "upvotes": 1,
                          "replies": {
                            "hbqsmys": {
                              "link": "/r/AskAcademia/comments/pib4e0/pure_life_science_biotech_careers_from_a_computer/hbqsmys/",
                              "text": "You can technically do a master and take an experimental master thesis. Same thing with a PhD. An experimentalist with good computer and programming skills is very attractive. Usually, when they look for Data Scientist that will be only computer job. If they look for some experimentalist, that's going to be some lab work. If you can analyze your own data, it is certainly a plus but large companies have some IT teams to take care of that in general.",
                              "author": "ko_nuts",
                              "created": 1630883765,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}