{
  "sid": "r16c78",
  "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/",
  "title:": "Citing a not-peer-reviewed masters thesis?",
  "text": "Can I cite a masters thesis that has been posted online via the university? The author of the thesis hasn't published any papers from their work because, as far as I can tell, they went into industry and aren't interested in pursuing publication. I can cite the work they cited to make the points they made in their work, but that feels very disingenuous because they made novel connections that have guided my understanding of the concepts I'm writing about. My field is geology, if that is relevant to the answer.\n\nThanks to everyone who answered! Your advice is very helpful. ",
  "author": "Groundbreaking-Dot-3",
  "created": 1637763845,
  "updated": 1638206340,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.89,
  "comments": {
    "hlwnlzi": {
      "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hlwnlzi/",
      "text": "You can cite anything. If it’s relevant, cite it.",
      "author": "Broric",
      "created": 1637765944,
      "upvotes": 25,
      "replies": {
        "hlx9npn": {
          "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hlx9npn/",
          "text": "Agreed. And peer reviewed journals aren't the gold standard of quality research anyway. Lots of garbage or mediocre research gets published in peer reviewed journals, as well as much quality work. Being published in a peer reviewed journal alone isn't a mark of whether or not a source is usable.\n\nWhat you should be concerned about is the *quality* of the research in the dissertation (as well as any other source). Are the methods sound? Do the data justify the conclusions? Is the research supported or refuted by other research?",
          "author": "SaltNVinegarNips",
          "created": 1637774827,
          "upvotes": 12,
          "replies": {
            "hm074ii": {
              "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hm074ii/",
              "text": "This, so hard.\n\nA lot of peer-reviewed, published papers... are garbage.\n\nA lot of pre-prints... are amazing.\n\nA lot of pre-prints... are butchered by the time they go through peer review.\n\nA master's thesis and dissertation? They are probably given a more careful peer-reviewing than a journal peer review process. Honestly - How many times have you submitted a paper for review, where only 2-3 reviewers are found, of those 3, maybe 1 actually looked at it in detail, and of all the comments, only 30% are useful or relevant. At least with a master's thesis or dissertation, it's usually seen by > 4 people, heavily critiqued, and heavily revised over months of quick back-and-forth review.\n\nI often \\*prefer\\* reading theses/dissertations, and pre-prints. The journal review system is in dire need of reform. Do not be afraid to cite whatever you find to be quality, relevant work.",
              "author": "StephenSRMMartin",
              "created": 1637821405,
              "upvotes": 2,
              "replies": {
                "hm0fndb": {
                  "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hm0fndb/",
                  "text": "This is *super* field dependent. I’ve seen *many* garbage theses, and dissertations, for that matter. That said, cite the thesis if it’s relevant and dig into its references as they likely contain other relevant material.",
                  "author": "Cicero314",
                  "created": 1637827118,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlwzdi7": {
      "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hlwzdi7/",
      "text": "Yep. Theses are reviewed by their committee and published through the university. Not the same as a journal per se, but still referable",
      "author": "thylako1dal",
      "created": 1637770788,
      "upvotes": 13,
      "replies": {}
    },
    "hly5ypl": {
      "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hly5ypl/",
      "text": "You can and should cite the thesis. First of all, one of the points of citations is to credit the people whose work you used, so whether it was a peer reviewed paper, a thesis, or a sign held up by a high conspiracy theorist shouting about the end of the world, if it contributed to your work you have to cite it. Second a thesis is an academic work. Even if it's not necessarily held to the same standard as a peer reviewed paper it's still taken seriously and can be cited. If you're worried that it's not enough to back up your claims, you can always point to other citations as well. Eg it's common to see a citation like [this person's master thesis, also see references 13-17 within]",
      "author": "010011100000",
      "created": 1637787492,
      "upvotes": 7,
      "replies": {}
    },
    "hlybe44": {
      "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hlybe44/",
      "text": "I mean; nominally the master's thesis *is* reviewed, not by peers per se, but by the faculty members who sign off on the thesis. As a result, a thesis is basically as good as peer-reviewed.",
      "author": "r3dl3g",
      "created": 1637789671,
      "upvotes": 5,
      "replies": {}
    },
    "hlx4jnf": {
      "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hlx4jnf/",
      "text": "A master's thesis is a scientific publication that can be cited just like a journal article. Maybe citing databases won't track it, but that's not really something you need to care about. A master thesis is still peer-reviewed, in a sense, because the advisor and probably some other (external) reviewers have read and approved it. I would prefer to cite journal articles that arose from the thesis, but in this case the findings weren't published elsewhere, so just cite the thesis.",
      "author": "Hapankaali",
      "created": 1637772827,
      "upvotes": 3,
      "replies": {
        "hlx6n5y": {
          "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hlx6n5y/",
          "text": "A Masters thesis definitely isnt peer reviewed in any meaningful sense. Many Masters theses will be low quality and get a really bad grade, even if its technically a pass. Its quire rare for students to outright fail their thesis, even if the work is shoddy.\n\nWhether you should cite a thesis really depends on what specifically you are citing. If there are conceptual ideas in the thesis that you have borrowed then yes of course you should cite them -- but this would also apply to (eg) someone's blog post or private communication. The \"peer review\" aspect isnt really relevant. If you are citing claims from the thesis that you can verify yourself (eg a mathematical theorem+proof) then this isnt really a problem either: in a sense you are peer reviewing it yourself.\n\nHowever I would say it gets a bit more tricky when you are citing unverfiable claims (such as the results of an experiment or data analysis) since you have no way of knowing whether the analysis was done properly. The same applies to citing published papers of course (many journal papers are garbage despite passing peer review) but the average quality of analysis is going to be even lower in a Masters thesis especially since you dont know what grade it got, or whether the supervisor even believes the results. And many theses wont be written properly and will leave out crucial details of how the analysis was performed, and so on (yes I realise this also applies to many published papers).\n\nIn general I would say that you should treat yourself as a \"peer\" and trust yourself to review the work and determine yourself whether it has quality. But this is obviously easier when it comes to claims that you can directly verify.",
          "author": "MoneyPrize2283",
          "created": 1637773650,
          "upvotes": 1,
          "replies": {
            "hm0aru6": {
              "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hm0aru6/",
              "text": "This is not the case in the US",
              "author": "eggplant_wizard12",
              "created": 1637823750,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hm06voa": {
      "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hm06voa/",
      "text": "Thesis are considered as published documents. Yes, you can cite it.  Most style guides can tell you how to cite correctly.",
      "author": "Life_time_learner",
      "created": 1637821254,
      "upvotes": 1,
      "replies": {}
    },
    "hm0anah": {
      "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hm0anah/",
      "text": "I’d say that theses and dissertations are actually peer reviewed. Consider that they have been read and approved by at least 3 phds who likely provided considerable commentary and suggestions. That’s basically peer review.",
      "author": "eggplant_wizard12",
      "created": 1637823668,
      "upvotes": 1,
      "replies": {}
    },
    "hlxwaep": {
      "link": "/r/AskAcademia/comments/r16c78/citing_a_notpeerreviewed_masters_thesis/hlxwaep/",
      "text": "It may be beneficial to see if the university lists the student in their graduate database from the program with the advisor. My University keeps a public record of all theses with advisor names as well as an online database. The student may not have published the work as a paper, but the advisor or a committee member might have, which would get you what you need. \n\nAside from that, I would recommend handling the case individually: what are you citing this in? Your thesis? I'd go for it. A paper for a class? Sure, as long as the thesis is good quality. Grant application? Consider the funding source. A paper for publication? I'd think twice. Also consider the simple merit of the evidence presented by the student in his or her thesis and its individual quality.  Are you convinced by it? \n\nStandards vary between tasks and fields. I would never cite anything from a masters or even PhD thesis in something I intended to send to a journal, but would probably use it if it helped build my case for a grant or presentation to a conference, both of which are more open to dialogue and critique by the audience.",
      "author": "Aamakkiir94",
      "created": 1637783655,
      "upvotes": 0,
      "replies": {}
    }
  }
}