{
  "sid": "axnqyp",
  "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/",
  "title:": "Are there many people on here who have went straight from bachelors to PhD?",
  "text": "I really can not afford to pay for a masters but recieced a top grade at a UK university at undergraduate. I am putting in a tremendous amount of effort to be accepted onto a PhD and have been working as a research assistant for past few months. Really don't want my efforts to be in vain. Shall I continue or shall I seek another path? Thanks. ",
  "author": "Banditjumper",
  "created": 1551807090,
  "updated": 1634081747,
  "over_18": false,
  "upvotes": 120,
  "upvote_ratio": 0.96,
  "comments": {
    "ehurf1o": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehurf1o/",
      "text": "I went straight from a bachelors to a PhD. I think this is more normal now, but I am in science so I don't know about other fields. I say go for it!",
      "author": "innominata_name",
      "created": 1551807825,
      "upvotes": 112,
      "replies": {
        "ehwky1e": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwky1e/",
          "text": "Thank you :) ",
          "author": "Banditjumper",
          "created": 1551860502,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ehuts5f": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuts5f/",
      "text": "It is fairly common in the US. Rarely do we get an M.S.",
      "author": "Geldarion",
      "created": 1551809363,
      "upvotes": 101,
      "replies": {
        "ehuzd0c": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuzd0c/",
          "text": "It's not really a good comparison though - for example in my PhD I just did research, no quals or anything. In the states, math grad students are expected to do several graduate courses in the first year or so. But I already did that in my masters, as almost all English system PhD students do one way or another.",
          "author": "l_lecrup",
          "created": 1551813056,
          "upvotes": 56,
          "replies": {
            "ehv5g18": {
              "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv5g18/",
              "text": "This is an important distinction -- in the US, most PhDs require getting an MA included as part of the PhD program itself -- my first two years of my programs consisted purely of coursework and another eight-ish months of comps/quals that are required as part of the program, and was granted an MA as a result (at which point several of my cohort left the program). As a result, most US PhDs (at least in my field) are typically 1-3 years longer than their UK counterparts that don't include MA coursework and they are given funding for those years that typically isn't available for UK MA programs. Even if an admitted PhD student has a masters already, they are usually required to do a second round of coursework and get a second masters.\n\nThere are separate MA programs in the US that are typically unfunded (or minimally funded), but they are often \"consolation prizes\" for applicants who applied to the PhD program but didn't get in, and so students who pay for their MAs at a university that offered a funded PhD are sometimes considered \"cash cows\" for the university and given less attention/mentoring than their funded, PhD-route counterparts.\n\nIf OP is looking to avoid paying for their masters, looking to US PhD programs is probably their best bet, but lacking a masters while applying to UK PhD programs is definitely an uphill battle (though I can't say how much).",
              "author": "Loimographia",
              "created": 1551817097,
              "upvotes": 24,
              "replies": {
                "ehv9ub3": {
                  "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv9ub3/",
                  "text": "For the sciences anyway, most don't actually grant you a MS, though you do all the course work and everything that you would do to get a non thesis masters. But I guess that's not really that important. ",
                  "author": "Average650",
                  "created": 1551819958,
                  "upvotes": 11,
                  "replies": {
                    "ehvo3c8": {
                      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvo3c8/",
                      "text": "That is my experience. If you pass your quals, you go on to do your dissertation and become a PhD candidate. If you fail quals, the masters is your consolation prize.",
                      "author": "perceptionactionprof",
                      "created": 1551829755,
                      "upvotes": 6,
                      "replies": {
                        "ehvw746": {
                          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvw746/",
                          "text": "Unless you already have a masters...",
                          "author": "Average650",
                          "created": 1551836146,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ehv0daj": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv0daj/",
          "text": "I’m at a large R1 in the US. We are actively trying to get rid of Masters programs or on route MS degrees... I went straight through with no masters and knocked a year off the program, which was nice considering the ridiculous opportunity cost of doing a PhD.",
          "author": "master_innovator",
          "created": 1551813708,
          "upvotes": 23,
          "replies": {
            "ehvido3": {
              "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvido3/",
              "text": "That's interesting. Universities in the UK seem to be expanding MSc and MRes courses to make up for falling numbers of undergraduate applicants.",
              "author": null,
              "created": 1551825524,
              "upvotes": 6,
              "replies": {
                "ehvmlmo": {
                  "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvmlmo/",
                  "text": "We are expanding 1 year professional masters with high tuition fees for that reason as well.",
                  "author": "master_innovator",
                  "created": 1551828619,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "ehv1nr3": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv1nr3/",
          "text": "Strongly depends on the program. In lots of engineering fields (not all of them) a masters is common without looking for a PhD at all. I’m in a master program right now and think I’d like to go back for a PhD at some point. In my field it’s not uncommon to either get just a M.S. or take a few years before a PhD after a masters.",
          "author": "elh93",
          "created": 1551814561,
          "upvotes": 14,
          "replies": {}
        },
        "ehxby9i": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehxby9i/",
          "text": "Msc is looked upon as a failed PhD. Which is a problem I think. It would be more fortunate if Msc was a prerequisite for PhD. 3 years of basic scientific training does not provide a sound base for specialization. An msc provides a wider view of your chosen field. (A friend of mine who was working with muscle physiology had no idea about mendel and his peas... She only knew about her very narrow field. Basic genetics was unknown to her...) ",
          "author": "rambo77",
          "created": 1551889866,
          "upvotes": 1,
          "replies": {}
        },
        "ehv0uhq": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv0uhq/",
          "text": "I’ve heard that in certain disciplines a masters=couldn’t hack it in the PhD program (math being one that comes to mind). Anecdotal as I have no personal experience with this.",
          "author": "pinksparklybluebird",
          "created": 1551814021,
          "upvotes": 1,
          "replies": {
            "ehv3rqk": {
              "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv3rqk/",
              "text": "That's kind of how we see it in chemistry. It's called \"mastering out\" so you can get out of your PhD program early. People do go for just a master's degree, but I don't think it's as useful as it once was. ",
              "author": null,
              "created": 1551815965,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "ehurxzo": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehurxzo/",
      "text": "It depends on the field. Some areas that’s not even an option.",
      "author": "leejh06",
      "created": 1551808166,
      "upvotes": 19,
      "replies": {}
    },
    "ehuvzvv": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuvzvv/",
      "text": "Yes I got a chemistry BS and went right to a chemistry PhD. IDK how common it is in the UK, but it's fairly common where I am in the US. The only real disadvantage I've noticed is that I feel the need to catch up a little bit, since my group is mostly international students who already got a Master's, and also I'm a bit younger than everyone. But it's still very doable. ",
      "author": null,
      "created": 1551810840,
      "upvotes": 20,
      "replies": {
        "ehuy5ps": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuy5ps/",
          "text": "Was it difficult for you to catch up? I was accepted into a program but I’m a little worried I’ll be behind everyone (although I’m going into the social sciences so it’ll be a bit different than your experience)",
          "author": "_hotwhiskey",
          "created": 1551812272,
          "upvotes": 3,
          "replies": {
            "ehv1m09": {
              "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv1m09/",
              "text": "I found it was a little tricky at first, but I just studied A LOT during the first year when I was taking classes. I think I more or less got caught up. You may just have to work a bit harder, but you can do it!",
              "author": null,
              "created": 1551814528,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ehurztw": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehurztw/",
      "text": "in (non-clinical, at least) psychology it’s common to go straight from bachelors to PhD. \n\nedit: saw someone else implying that this only happens in US? I’m not in US (not in UK either) and it’s still common to go straight to PhD. ",
      "author": null,
      "created": 1551808200,
      "upvotes": 35,
      "replies": {
        "ehw7a65": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehw7a65/",
          "text": "Why non-clinical? Just curious (: ",
          "author": "lildragg69",
          "created": 1551844726,
          "upvotes": 3,
          "replies": {
            "ehw7u1w": {
              "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehw7u1w/",
              "text": "clinical is a *lot* more competitive than other subfields of psych so i’d think that some people would decide to do a masters to make themselves more competitive for admissions into a clinical psych phd programme. \n\nalso, in my country, you don’t need a phd to become a registered practicing psychologist/psychotherapist. a masters with practicum is sufficient, so if you don’t intend to become an academic or researcher, there’s no reason to do a phd in clinical (note for any other prospective psychologists reading this: please check your own country/state’s requirements for accreditation/registration/licensure!)",
              "author": null,
              "created": 1551845189,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ehuvyos": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuvyos/",
      "text": "Depends on the field. In a lot of arts/humanities it’s often expected to get a master’s, and some science areas are super competitive and so most students have master’s degrees and research experience.\n\nIn my field, everyone either has a master’s or a clinical degree - that’s just due to the competitiveness. However I have friends in other areas of science who went straight to PhD from undergrad.\n\nMaybe try asking one of your lecturers/your dissertation supervisor what’s the norm for your field?",
      "author": "ayeayefitlike",
      "created": 1551810817,
      "upvotes": 13,
      "replies": {}
    },
    "ehuw07j": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuw07j/",
      "text": "I don’t have an MA, mostly bc my Ph.D. program only offered Ph.D.s. Some programs offer MAs along the way, but that can lower a university’s ranking in the US (giving out too many MAs vs. Ph.D.s). I would not say my situation is common in the humanities, but it has not hurt me at all. I have tenure.",
      "author": "Gratitude411",
      "created": 1551810846,
      "upvotes": 11,
      "replies": {}
    },
    "ehuzrt3": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuzrt3/",
      "text": "Hey don't listen to all the US people saying it's common: their grad school system involves taking graduate courses and doing quals which are not as common in the UK because most do a separate masters degree. I did my masters and bachelors as a joint degree (an MMath as it's called in some institutions), and then did my PhD at a different institution altogether. In the US system they do the equivalent of a masters year early on in their grad school system.\n\nIf you really can't afford it, and you have an offer to do a PhD, just go and do it. If you're prepared to work hard, you can catch up anything you would have learned during a masters degree. ",
      "author": "l_lecrup",
      "created": 1551813326,
      "upvotes": 29,
      "replies": {
        "ehvt1bj": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvt1bj/",
          "text": "It is relevant though - because we're paid like a european PhD student for the entirety of the program, even the first 2 years when we're taking courses and doing quals, and OP's concern was cost.",
          "author": "mediocre-spice",
          "created": 1551833663,
          "upvotes": 10,
          "replies": {
            "ehvtum8": {
              "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvtum8/",
              "text": "You have a point there but the way I read the post is: the decision not to do a masters has already been made due to cost; the question is whether or not doing a PhD without a masters (in the UK see below) will be a disaster.\n\nI am sort of assuming they want to stay in the UK because otherwise they could probably go to Germany or a Nordic country and get a masters for next to nothing.",
              "author": "l_lecrup",
              "created": 1551834313,
              "upvotes": 6,
              "replies": {
                "ehvu45q": {
                  "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvu45q/",
                  "text": "I guess I read it more as \"I'd love to get a masters than a PhD but can't go another 2 years without a job\" -- in which case a 5 year PhD in the US would work. Even in Germany or Nordic countries without tuition, you aren't getting a salary during a master's, are you?",
                  "author": "mediocre-spice",
                  "created": 1551834522,
                  "upvotes": 5,
                  "replies": {
                    "ehwphcq": {
                      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwphcq/",
                      "text": "The problem is that if you can’t get a PhD in the U.K. as a home student, your not likely to be competitive forninternational applications - you cost an awful lost more to your department and scholarships are incredibly competitive.\n\nEqually, it costs a fortune to even apply for US programs. It’s £200 for the GRE and then costs for each application - you get *paid* to go to interviews in the U.K. usually and certainly don’t pay a penny to apply (excepting Oxbridge). So that’s another financial consideration.",
                      "author": "ayeayefitlike",
                      "created": 1551868652,
                      "upvotes": 3,
                      "replies": {
                        "ehx0432": {
                          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehx0432/",
                          "text": "The interviews are paid for in the US as well (or rather, flights/hotels/meals are covered), but I get your point. It's still an option to look into though. ",
                          "author": "mediocre-spice",
                          "created": 1551881269,
                          "upvotes": 1,
                          "replies": {
                            "ehxoh16": {
                              "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehxoh16/",
                              "text": "> It's still an option to look into though.\n\nOh totally. But typically you’d be good enough for a DTP (a four year PhD including a sort-of-master’s-year) if you were good enough for international scholarships, so it’s unlikely to be an easy way around doing a master’s and then it’s also going to cost you more to even apply, so unless you’re specifically wanting to work with a US PI or work in the US as an academic in the future then it’s probably more of a risky move.",
                              "author": "ayeayefitlike",
                              "created": 1551898193,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "ehwnohb": {
                      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwnohb/",
                      "text": "In Finland they have some student benefit.. in principle EU citizens should be entitled to that benefit, if I understand correctly. It's just about enough to pay rent in Helsinki. But obviously UK students might suddenly be ineligible for that in a month. Also UK PhD students aren't typically salaried like in some other countries. In my situation, I had 3000 a year fee to pay - but I got a scholarship which paid that and gave me an additional 15,000 per year stipend. ",
                      "author": "l_lecrup",
                      "created": 1551865383,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "ehvvepb": {
                      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvvepb/",
                      "text": "*Wooo* It's your **1st Cakeday** mediocre-spice! ^(hug)",
                      "author": "CakeDay--Bot",
                      "created": 1551835540,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ehuvw34": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuvw34/",
      "text": "I did, but I'm in the US where this is the standard.",
      "author": "iammaxhailme",
      "created": 1551810768,
      "upvotes": 8,
      "replies": {}
    },
    "ehuyo36": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuyo36/",
      "text": "Yeah, it seems to be extremely common in the US in sciences, and very uncommon (or even impossible) in most of EU or UK. I am kinda curious why there's such a difference.",
      "author": "newpua_bie",
      "created": 1551812606,
      "upvotes": 8,
      "replies": {
        "ehuyzgh": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuyzgh/",
          "text": "Because UK and US PhDs have different course requirements. UK PhDs generally involve little or no coursework, thus the need for a masters, while US degrees require at least some coursework. I did a US PhD and even though I never received a masters, I still had to do all of the coursework that would have been required of one.",
          "author": "guttata",
          "created": 1551812814,
          "upvotes": 15,
          "replies": {
            "ehv0vp6": {
              "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv0vp6/",
              "text": "Yeah, but the UK system is an anomaly in EU. In Finland there's a lot of coursework for a MSc (plus a mandatory thesis), and then there's also about one year full-time equivalent amount of coursework (meaning about 12 full-semester courses, i.e. about 40 hours of work per week for a year) for a PhD, plus 3-4 years of required research.",
              "author": "newpua_bie",
              "created": 1551814042,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "ehw7gh2": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehw7gh2/",
          "text": "PhDs in the EU are 3-4 years, PhDs in the US are 5-6. They just include the masters in the PhD, whereas in the EU (and most of the world) the masters is a separate thing.",
          "author": "Melkovar",
          "created": 1551844871,
          "upvotes": 6,
          "replies": {
            "ehw7omd": {
              "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehw7omd/",
              "text": "That's not my experience at all. In my experience, PhDs (in science) in EU take roughly as long as those in the US.",
              "author": "newpua_bie",
              "created": 1551845061,
              "upvotes": 2,
              "replies": {
                "ehw9nxk": {
                  "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehw9nxk/",
                  "text": "Hm, that's strange - every PhD position I've seen listed in Europe (France, Spain, Germany, Netherlands, UK) is either 3 or 4 years, and every program I have looked up the graduation details for in the US has an expected time to graduation of 5 or 6 years. Also science. We could have just randomly looked at exactly the opposite set of programs.",
                  "author": "Melkovar",
                  "created": 1551846795,
                  "upvotes": 5,
                  "replies": {}
                },
                "ehws8qv": {
                  "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehws8qv/",
                  "text": "4 years is the max I've come across (doing a science PhD in the UK) and even that is unusual, 3 years is the standard ",
                  "author": "crownsandclay",
                  "created": 1551873069,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ehwm8dx": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwm8dx/",
          "text": "I think it's more that entry to UK PhDs is quite competitive - you're against a very well qualified applicant pool.\n\nOver 100,000 UK students each year get places on an integrated master's degree, and I think that's because school students with good A Level grades don't see any downside to choosing an integrated masters over a BSc/BEng.\n\nIf they later decide they don't want to do the extra year they can just drop down to the BSc/BEng, and the way UK undergrad loans work means that an integrated masters is a far better financial decision than a bachelors and a separate masters. Integrated masters graduates do better in the graduate job market than bachelors graduates too, so there's no concern that getting one might be a waste of time if they aren't keen on acadaemia.\n\nSo a good proportion of the graduates considering a PhD already have a masters. And while a masters isn't a requirement, if a BSc and an integrated masters graduate are interviewing for the same PhD position, the masters grad has a year-long individual project they can talk about.\n\nSo people who don't do an integrated masters need to do other things to be competitive. That could be a separate Master's degree, but it doesn't *have* to be. They could also have done a year in industry placement, or have worked in a lab for a couple of years after graduation.\n\nIt's a bit of an arms race really!",
          "author": null,
          "created": 1551862730,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ehv7ts6": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv7ts6/",
      "text": "I did this in Australia, though it might be somewhat field dependent. First class honours is generally enough to be competitive for a grant/stipend and anything Second-class-II or higher is enough for admission into a PhD. I believe we're closer to the UK/EU than the US is, so hopefully that is helpful!",
      "author": "splodingshroom",
      "created": 1551818632,
      "upvotes": 8,
      "replies": {}
    },
    "ehuzlmy": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuzlmy/",
      "text": "Pretty common here in the US. Doing an MS along the way requires stopping to write a thesis. While there is overlap between writing papers / your dissertation and writing a thesis, it definitely adds time to the whole process, as that is time spent NOT working on your doctoral dissertation. I'd day it's the difference of a year or so. Going straight through is typically a 4-6 year process in the states. If you get your MS as well it can turn that into 5-7.\n\nThe only people I've seen do MS/PhD in 4 years had very lenient professors/committees and did not switch groups/labs at all between the two. Obviously anecdotal, but that's my experience.",
      "author": "ilessthan3math",
      "created": 1551813213,
      "upvotes": 6,
      "replies": {}
    },
    "ehuva5h": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuva5h/",
      "text": "Yep I did - solid research experience as an undergraduate, a year in an RA post, a couple of papers (not first author) and some first author papers in the pipeline. UK uni. ",
      "author": "no_mango",
      "created": 1551810359,
      "upvotes": 4,
      "replies": {}
    },
    "ehuzqfl": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuzqfl/",
      "text": "It depends on the field, even in the sciences. In chemistry its not common at all to get an MS first. But in the geology/hydrology department at my school they required an MS to get in the PhD",
      "author": "stathicus",
      "created": 1551813300,
      "upvotes": 4,
      "replies": {}
    },
    "ehv0ffs": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv0ffs/",
      "text": "In engineering some universities in the US specifically state that a master’s degree is required for a PhD application.",
      "author": "AfterTruth",
      "created": 1551813747,
      "upvotes": 4,
      "replies": {}
    },
    "ehv15u2": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv15u2/",
      "text": "I did. I’m in the U.K. as well. I graduated last year with a first class (environmental science related topic) and I’m now doing my PhD. It’s definitely possible!",
      "author": "DevilInHerHeart_",
      "created": 1551814228,
      "upvotes": 4,
      "replies": {}
    },
    "ehvhcpd": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvhcpd/",
      "text": "It varies on the system and the field. In continental Europe it's almost unthinkable that you'd get into a PhD program without a Master's, afaik. But in Australia it's common to get an Honours degree and then go into a PhD.",
      "author": "tfburns",
      "created": 1551824803,
      "upvotes": 4,
      "replies": {}
    },
    "ehuyaka": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuyaka/",
      "text": "It’s pretty common in Canada, at least in Science research-based (versus course-based) programs. Depending on the school, you may have to enter the Masters program and apply to “roll-over” to the PhD after a year. If that’s the case, be clear with your supervisor that this is your intent! Good luck!",
      "author": "deemarree",
      "created": 1551812362,
      "upvotes": 7,
      "replies": {
        "ehv3ln4": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv3ln4/",
          "text": "For the program I was looking at, UoT and McGill won't accept PhD students straight out of the Bachelor without \"an exceptional record\". \n\nSo it's definitely school and program-based. ",
          "author": "Murderous_squirrel",
          "created": 1551815850,
          "upvotes": 10,
          "replies": {
            "ehvu72j": {
              "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvu72j/",
              "text": "UBC is the same. Unless you have a stellar GPA and significant research experience, you’ll have to do at least one year in a MSc program.",
              "author": "angieseaanemone",
              "created": 1551834586,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ehuxpd7": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuxpd7/",
      "text": "Yes, a lot of them, including me.",
      "author": "winner_in_life",
      "created": 1551811974,
      "upvotes": 3,
      "replies": {}
    },
    "ehuytma": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuytma/",
      "text": "More common than it used to be, I think. I'm in the social sciences, and it's quite common to enter a PhD program directly. Some will still require an MA along the way, but by no means all. ",
      "author": "quietlysitting",
      "created": 1551812707,
      "upvotes": 3,
      "replies": {}
    },
    "ehvg0js": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvg0js/",
      "text": "Yeah, I skipped a masters and went to a PhD I don't feel like I'm massively behind, I did a few masters courses to catch up and I'm all good now.",
      "author": "AydenClay",
      "created": 1551823899,
      "upvotes": 3,
      "replies": {}
    },
    "ehvklah": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvklah/",
      "text": "Not sure about the social sciences/humanities, but I can perhaps provide some information about the STEM fields. I did my undergraduate work in the US and moved to the UK for my PhD. So the two systems are quite different (and I think UK and Europe share similar structures).\n\n&#x200B;\n\nIn the US, graduate programs usually pool from applicants that have completed their 4-year bachelors. However, it is not unusual for applicants with masters degrees to move onto a PhD program as well. US PhD programs typically involve \\~2 years of intense coursework that would make up (approximately) a masters degree in a particular field.\n\n&#x200B;\n\nIn UK/Europe, students specialize far earlier and often get awarded both a BA/BS and MSc/MRes/etc. by the end of their 4th year. A BA/BS in the UK is a 3 year program usually. PhD programs in the UK expect applicants to have a masters degree by the time they move onto a PhD (and this seems to be the case in Europe). There are some exceptions though.\n\n&#x200B;\n\nSome PhD programs in the UK follow a 1+3 program, where the 1st year is a masters program (involving coursework and examinations) then move onto the PhD (3 years) phase after successfully completing the masters. These are called Doctoral Training Programmes (DTPs) or Centres for Doctoral Training (CDTs). I was able to get into a CDT/DTP with a US bachelors degree and go on from there. Many of my colleagues (in the same program) already had an MSc or MA by the time they were admitted, but most had only a bachelors degree. You might want to consider these kind of programs if they're available in your field.",
      "author": "JapaneseGinger",
      "created": 1551827117,
      "upvotes": 3,
      "replies": {}
    },
    "ehuzwa6": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehuzwa6/",
      "text": "I did because it was a combined MS/PhD program in chemistry. It seems more common in the sciences than most other programs. The research for the MS was part of the research for the PhD so it meshed well as a combined program.",
      "author": "CHEIVIIST",
      "created": 1551813407,
      "upvotes": 2,
      "replies": {}
    },
    "ehv4nc4": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv4nc4/",
      "text": "I did so in the UK, straight from bachelor to a 3 year PhD program (no coursework) in a Russel group uni. It was in a STEM field and I had about 18 months of research experience at that point. ",
      "author": "KappaPersei",
      "created": 1551816562,
      "upvotes": 2,
      "replies": {
        "ehv5l0p": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv5l0p/",
          "text": "I'm in a similar situation now. Would you say the lack of coursework was an issue? I find the perspective of not having lectures a bit intimidating, but of course I won't refuse an offer because of this. ",
          "author": "Leopin2",
          "created": 1551817182,
          "upvotes": 2,
          "replies": {
            "ehv8yfb": {
              "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv8yfb/",
              "text": "Not at all in my case, I was actually quite looking forward not having to deal with coursework and focusing solely on research. ",
              "author": "KappaPersei",
              "created": 1551819368,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ehv582c": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv582c/",
      "text": "I did - as a PhD student in Engineering in the US. Straight to PhD is common in the United States, if masters is not required, because most of the funding is for PhD. I will note that in my program, students who enter with a masters degree tend to graduate around the same time as those who entered direct to PhD.",
      "author": "executionofflash",
      "created": 1551816951,
      "upvotes": 2,
      "replies": {}
    },
    "ehv7q6s": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv7q6s/",
      "text": "I did an integrated masters (MBiol) up in York, which didn't have as intense a research period as my mates who did an MRes. Got onto a PhD programme down at KCL in the final year of my undergrad. \n\nWhat field do you want to go into and what was your undergrad in? Having been a research assistant is definitely in your favour, the more experience the better!",
      "author": "tommeetucker",
      "created": 1551818567,
      "upvotes": 2,
      "replies": {}
    },
    "ehv9tus": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehv9tus/",
      "text": "I went straight from a Bachelors to a PhD! It was partially for timing reasons as I am also in a concurrent DVM program and partially for funding reasons. My school offers full DVM tuition scholarships for PhD students,  but offers no scholarships for MS/DVM. I don’t feel like I was behind at the start of my program due to not having a MS. And in my field (Epidemiology) and what I want to do after my programs a MS would provide little to no benefit. \nYou got this! Good luck with your search! ",
      "author": "DVMPhDLife",
      "created": 1551819950,
      "upvotes": 2,
      "replies": {}
    },
    "ehvcu5r": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvcu5r/",
      "text": "That's what I'm doing, so yes, very possible. Heads up though, your colleagues will have the added experience and publication record from the master's year(s), which may contribute to imposter syndrome. But if you can fight through that, it's really nice to not have the additional debt.",
      "author": "hold_the_reins",
      "created": 1551821861,
      "upvotes": 2,
      "replies": {}
    },
    "ehvdk2p": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvdk2p/",
      "text": "Extremely common in the field of philosophy -- go straight from BA to PhD programs. MA programs are seen as a back-up option to strengthen your application to PhD work.",
      "author": "Theomancer",
      "created": 1551822321,
      "upvotes": 2,
      "replies": {}
    },
    "ehve021": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehve021/",
      "text": "This depends entirely on the field. I am a PhD in environmental science in the US, and it is not necessarily the norm to skip a MS. Even international students seem to have a MS before starting a PhD. I personally know many students (myself included) who are glad they did a MS before a PhD. In my case, the experiences I gained doing a MS left me much better prepared to undertake a PhD. Without a very solid undergraduate research background, I personally would be hesitant to skip through the MS. I don’t know your field, but in mine there are plenty of paid assistantships available in the US for MS and PhD study (sometimes it’s even easier to get funding for a  MS).",
      "author": "fineaubs",
      "created": 1551822604,
      "upvotes": 2,
      "replies": {}
    },
    "ehvekk0": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvekk0/",
      "text": "I went straight into a PhD program in mathematics right after I got my bachelors degree.  I picked up a masters along the way while still getting paid a stipend.  However, my total time here will be 7 years due to this fact.  Either way, it beats digging yourself deeper into the debt hole.",
      "author": null,
      "created": 1551822957,
      "upvotes": 2,
      "replies": {}
    },
    "ehvf0jx": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvf0jx/",
      "text": "In sociology I don't know anyone. But it's the classical example of a subject that is easy to obtain a bachelor in, but really hard to get into a PhD, since it requires you to be really skilled with research techniques and develop coherent argumentations. Doing at least one master is necessary to acquire these abilities.",
      "author": null,
      "created": 1551823238,
      "upvotes": 2,
      "replies": {}
    },
    "ehvf3gq": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvf3gq/",
      "text": "I'm in a first year PhD program (statistics) and I came from undergrad (chemistry)",
      "author": "AllSheNeededWasSum",
      "created": 1551823290,
      "upvotes": 2,
      "replies": {}
    },
    "ehvf3iz": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvf3iz/",
      "text": "Yep! I had funding for a PhD but the university only accepted me for an MPhil because they said I didn't have enough research experience. After 1 year I applied to upgrade to a PhD and was accepted. My research all stayed the same and I was able to use the 1 year of MPhil towards my PhD so I didn't lose any time. This was in Australia.",
      "author": "picklestheunicorm",
      "created": 1551823291,
      "upvotes": 2,
      "replies": {}
    },
    "ehvf3l4": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvf3l4/",
      "text": "You could consider going to another EU country to do a masters more cheaply.. you might be able to get in under the Brexit hammer, but I don't really have any idea and it might be risky. Four years ago I would have recommended it more thoroughly.",
      "author": "l_lecrup",
      "created": 1551823292,
      "upvotes": 2,
      "replies": {}
    },
    "ehvhsal": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvhsal/",
      "text": "It really depends on the field in my experience. Some programs offer a masters lead in program to a PhD. ",
      "author": "lickmysackett",
      "created": 1551825101,
      "upvotes": 2,
      "replies": {}
    },
    "ehvlo2r": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvlo2r/",
      "text": "I was under the same situation as you. Did a lot of research over it. You will not find any European institution accepting PhD directly after bachelor's except ETH Zurich and few other Swiss universities (not 100% sure). On the other hand almost every US and Canadian university accept PhD student without masters. NTU and NUS Singapore also accepts direct PhD students. If you want to be paid during masters, many Canadian universities pay their masters students also there are few Erasmus mundus programs for masters that have a good stipend but you might have to check your eligibility. Msg me you need further clarifications. ",
      "author": "abhishek_ub",
      "created": 1551827918,
      "upvotes": 2,
      "replies": {
        "ehwdhva": {
          "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwdhva/",
          "text": "Swiss universities (including ETH and EPFL) do not accept PhD candidates without a master. That’s one of the reason why I went to the UK to do my PhD (did my undergrad in Switzerland). ",
          "author": "KappaPersei",
          "created": 1551850575,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ehvlp4w": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvlp4w/",
      "text": "You could also consider an iPhD (integrated PhD) with a CDT (Centre for Doctoral Training) if you're in the UK, this is typically a 4 year paid programme where the first year is a taught masters, with you spending some time on your research. The last 3 years are a typical UK PhD.",
      "author": "RandomPhysicist",
      "created": 1551827940,
      "upvotes": 2,
      "replies": {}
    },
    "ehvltbe": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvltbe/",
      "text": "Here in Spain we must have master before enrolling in a PhD. However, many people enroll themselves in cheap master (including masters from on line universities) even if the master has nothing to do with their field of interest. In Spain many people get into the master that prepares you to become a high school teacher. By doing this they kill two birds with one stone: they have a master so that the can enroll in a PhD and additionally they can work as high school teachers if things go south.",
      "author": "davidlopez_76",
      "created": 1551828029,
      "upvotes": 2,
      "replies": {}
    },
    "ehvnyln": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvnyln/",
      "text": "I did this in psychology. It’s a bit of a learning curve but ultimately it’s not too big a deal to go straight from one to the other!",
      "author": "flowerbich",
      "created": 1551829653,
      "upvotes": 2,
      "replies": {}
    },
    "ehvoqfk": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvoqfk/",
      "text": "I went straight to PhD. The first 2 years consisted of lots of coursework and research. I completed my master’s thesis in 2.5 years. Now that the MA has been awarded, I’m working toward quals and the colloquium so I can knock those out during the 1st semester of my 4th year. I’d say it’s fairly common and completely doable. ",
      "author": "amberJL_S",
      "created": 1551830252,
      "upvotes": 2,
      "replies": {}
    },
    "ehvosuf": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvosuf/",
      "text": "Common in US, but doctoral programs (in science) are *much* longer here than the UK. \n\nWhat have your professors/advisors said?",
      "author": "OphioukhosUnbound",
      "created": 1551830303,
      "upvotes": 2,
      "replies": {}
    },
    "ehvp0co": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvp0co/",
      "text": "Go for it you have nothing to lose and will gain valuable application/interview experience! I went straight from undergraduate to PhD and had a little bit of RA work as well which was very useful to talk about in the interview! Go for it!!",
      "author": "dinoxmattJ",
      "created": 1551830468,
      "upvotes": 2,
      "replies": {}
    },
    "ehvpgzo": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvpgzo/",
      "text": "Another option (UK based) is to find a 1+3 PhD program, where the first year is the equivalent of a taught masters (but you get a stipend and the PhD funding covers fees). No idea what your field is, but Wellcome offer this, as do BHF.",
      "author": "sb452",
      "created": 1551830836,
      "upvotes": 2,
      "replies": {}
    },
    "ehvpsk2": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvpsk2/",
      "text": "In my field, going straight through is the most common thing. In the US at least.",
      "author": "sadgrad2",
      "created": 1551831092,
      "upvotes": 2,
      "replies": {}
    },
    "ehvr4ri": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvr4ri/",
      "text": "Without being too specific, I am talking about students in the Physics in the UK, don't know about humanities, and different sciences might have different approaches, so take my advice with a pinch of salt\n\nIn my subfield, I haven't heard of maybe a couple doing that recently in the UK, of course I only know about the people I talked to about it, but most of the ones I talked to about it had a masters level qualification.\n\nI had a three friends who I know went straight from a Bachelor to a PhD, but one of them I would say was a special case as his PhD was at an interesection between subjects and he did his bachelor in one field and because he was older he had previous experience in the other subject, so he was more ideally qualified for the position than someone who just went to University on leaving school and applied for the position after just getting a masters. That said, two other guys, went straight from school to bachelor to PhD.\n\nI don't know about your subject, but almost everyone I know did an Undergraduate Masters, which basically is a 4 year undergraduate course, where the final year is mainly taught, but there is a bit more focus (~30% of credits for the year, though might be different depending on institute) on a research project. Though from what I saw the people that stopped after 3 years were generally the ones who got lower grades and wanted to leave the field and get a job ASAP, so of course if very few of them apply, there will be very few of them doing PhDs, so its not exactly a good representation of your chances. \n",
      "author": "ThePlanck",
      "created": 1551832154,
      "upvotes": 2,
      "replies": {}
    },
    "ehvs34o": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvs34o/",
      "text": "It's fairly common in STEM field in the US that you can directly go straight from BA/BS to PhD.",
      "author": "maxchem6",
      "created": 1551832902,
      "upvotes": 2,
      "replies": {}
    },
    "ehvtg7t": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvtg7t/",
      "text": "In the US at least, good grades and a few months as an RA probably isn't enough for a properly funded PhD program. You might be able to work as a tech/lab manager/etc for a couple years though, which is a pretty common route instead of doing a master's between for people who aren't competitive right out of school.",
      "author": "mediocre-spice",
      "created": 1551833997,
      "upvotes": 2,
      "replies": {}
    },
    "ehvtgg5": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvtgg5/",
      "text": "Yes, I am one of them.",
      "author": "thnok",
      "created": 1551834002,
      "upvotes": 2,
      "replies": {}
    },
    "ehvy9ce": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvy9ce/",
      "text": "I did it (civil engineering) in Canada. Graduated from undergrad in May while having 8 months of research experience from summer terms in a lab. Professor convinced me to stay and directly enter PhD program instead of pursuing what I was really passionate about. I have never regretted something so badly in my life. You play catch up for the first year and question everything you do because your lab mates have years of experience on you. My advice is to make sure that it’s something you really really want and are willing to settle for whatever funding you get for at least the next 4 years of your life.\n\nBest of luck to you",
      "author": "ob15005",
      "created": 1551837707,
      "upvotes": 2,
      "replies": {}
    },
    "ehvzng9": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehvzng9/",
      "text": "It happens a lot in American universities. I did it, in the natural sciences. ",
      "author": "imhereforthevotes",
      "created": 1551838762,
      "upvotes": 2,
      "replies": {}
    },
    "ehw0jsg": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehw0jsg/",
      "text": "Yes , started grad school in 2004",
      "author": "Thegymgyrl",
      "created": 1551839444,
      "upvotes": 2,
      "replies": {}
    },
    "ehw2sbn": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehw2sbn/",
      "text": "I did. In the sciences in the US, this is primarily how it's done",
      "author": "belevitt",
      "created": 1551841144,
      "upvotes": 2,
      "replies": {}
    },
    "ehw538k": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehw538k/",
      "text": "Got my bachelors in neuro in 2018, will be starting my PhD in August! ",
      "author": "m00nchilddd",
      "created": 1551842958,
      "upvotes": 2,
      "replies": {}
    },
    "ehw7je9": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehw7je9/",
      "text": "You can! I was just accepted as one of the more competitive candidates for a PhD program in the US. I think it comes down to your application (if you’re qualified), if you know anyone in the program, your ability to be personal, and to hold a conversation well. \n\nMy education is US based - biochemistry with an emphasis in biochemistry and I had ~3 years of undergraduate research experience, as well as holding lots of leadership positions. ",
      "author": "austie3",
      "created": 1551844939,
      "upvotes": 1,
      "replies": {}
    },
    "ehwbdof": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwbdof/",
      "text": "I think that there is an interesting perspective that should be noted: \n\nThere has been a recent influx of people applying for masters degree across the board in the US in all fields as it seems to be an easier route into getting into grad school . More than likely this will start to influence PHD admission standards due to the fact that they will be able to evaluate students ability to perform at a graduate level, and make the easier transition then a undergrad . \n\nWith the recent increase in Grad applications this seems like an easier way to weed out weak applicants and give a preference to students who are more than likely to be successful . \n\nSo to answer your question a lot of people seem to go to PHD from Undergrad but likely struggle as they have to adapt to the difficulties of performing at a Graduate level , in comparison to students who already have a masters and have done graduate level work, seem to have an easier transition . ",
      "author": "Johndope2402",
      "created": 1551848404,
      "upvotes": 1,
      "replies": {}
    },
    "ehwfxhx": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwfxhx/",
      "text": "In the US it is common to go bachelor's -> PhD (where the first few years will be coursework, essentially completing a master's \"along the way\"). AFAICT this is uncommon in the EU.",
      "author": "lasagnaman",
      "created": 1551853295,
      "upvotes": 1,
      "replies": {}
    },
    "ehwfztj": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwfztj/",
      "text": "It’s possible to do a PhD straight from a BSC in the UK. A lot of PhD positions (especially DTPs) will allow you to do so. I have three friends who are all PhDs straight from BSc. \n\nEuropean universities however, mostly still require you to have a MSc first. ",
      "author": "freyari",
      "created": 1551853374,
      "upvotes": 1,
      "replies": {}
    },
    "ehwlze2": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwlze2/",
      "text": "Most universities in the UK will accept a 1st class undergrad degree for admission onto a PhD. If you want to make it “easier” look for 4-year doctoral training centres in your field. You’ll do a first year MRes equivalent (some courses you’ll actually get the MRes, you won’t on most) and then onto a PhD which has to be completed by the end of the 3rd year. Tough but readily doable ",
      "author": "legendfriend",
      "created": 1551862277,
      "upvotes": 1,
      "replies": {}
    },
    "ehwmszq": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwmszq/",
      "text": "Yep. Went from an honours bachelors straight into a PhD. Don’t regret it at all, was great to just keep on going.",
      "author": "ranglin",
      "created": 1551863760,
      "upvotes": 1,
      "replies": {}
    },
    "ehwnjm6": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwnjm6/",
      "text": "I'm a Physics PhD student in the UK and I went straight from undergrad to PhD but my undergraduate degree included a masters project so I have a MSci (rather than a bachelors then a postgrad MSc).\n\nHowever, my dad who just completed a BSc in Computing Science got a PhD. I think it depends on the subject area to be honest. Computing Science have a hard time recruiting people as many go straight into well paid jobs.",
      "author": "blizzardgirl13",
      "created": 1551865134,
      "upvotes": 1,
      "replies": {}
    },
    "ehwr73p": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwr73p/",
      "text": "I think that it is subject dependent. I got a 1st class BSc in the UK and went straight to PhD in the UK. This is pretty normal in biology.",
      "author": "phage10",
      "created": 1551871551,
      "upvotes": 1,
      "replies": {}
    },
    "ehwvbqs": {
      "link": "/r/AskAcademia/comments/axnqyp/are_there_many_people_on_here_who_have_went/ehwvbqs/",
      "text": "The quote on my department’s graduate studies website summarizes it well for Canada.\n\n “applicants should have an M.Sc. or equivalent; excellent B.Sc. graduates admitted to an M.Sc. program may be eligible to transfer to a Ph.D. program after their first year of study”.\n\nBachelors > PhD is exceedingly rare and (in my experience) kind of frowned upon since they tend to be weaker than their bachelors > masters > PhD counterparts who have graduate level theory, thesis writing, and research experience.",
      "author": "altobrun",
      "created": 1551876747,
      "upvotes": 1,
      "replies": {}
    }
  }
}