{
  "sid": "m8cc48",
  "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/",
  "title:": "Do former professors miss students the way we miss them?",
  "text": "I had a really wonderful professor a few semesters ago that really changed my perspective about life. In private she taught us so many life lessons and I’m so grateful to have had her as my professor. I miss her. \n\nI’m just wondering if it is mutual.\n\nEdit: did not expect this post to blow up, it’s been lovely to hear your thoughts and personal experiences. Thank you so much!",
  "author": "janaimariekalicharan",
  "created": 1616140952,
  "updated": 1634080095,
  "over_18": false,
  "upvotes": 418,
  "upvote_ratio": 0.98,
  "comments": {
    "grgrorf": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgrorf/",
      "text": "I think it's less so. An individual professor or 2 can make a real difference in the life of a student as they help the student learn, change perspectives, and maybe make a life-changing decision. It happened in my life and here I am 48 years later, with a career that I can really trace to an individual professor (who remains my friend) for helping me determine. It's very powerful stuff as a student.\n\nFor a professor, this is what we do and I think many of us hear about life-changing classes and experiences on a regular, but uncommon basis. But, we're not typically intimately involved in those thought processes and decisions. I think that when we hear about them, we're gratified. And we do often hear about individual successes from individual students. Heck, I hired a TT faculty member who had taken my Intro Psych class years before who became a psychologist, he said, because of me! But, the students who I think of fondly I don't miss. I am much more interested in their successes as they move on to bigger and better things!",
      "author": "rockyfaceprof",
      "created": 1616149359,
      "upvotes": 164,
      "replies": {
        "gri0ccy": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/gri0ccy/",
          "text": "This reflects my experience as well. Full disclosure, I am not a professor, but have had a couple students that I taught while I was in grad school reach out to me later about how influential I was as their TA. For me, I absolutely enjoyed teaching these students, but it is an asymmetric relationship by design.",
          "author": "wjs018",
          "created": 1616173843,
          "upvotes": 20,
          "replies": {}
        },
        "gsf86ud": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/gsf86ud/",
          "text": "This was very informative! Thanks!",
          "author": "janaimariekalicharan",
          "created": 1616840885,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grgugsd": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgugsd/",
      "text": "You always remember the good ones. And good doesn’t just mean academically, it means all round good people.",
      "author": "reversechinlock",
      "created": 1616151892,
      "upvotes": 135,
      "replies": {
        "grh60fd": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grh60fd/",
          "text": ">And good doesn’t just mean academically, it means all round good people.\n\nThat's a good point-- some of the students I enjoyed working with the most were actually not the top students, but the ones who struggled or with whom I worked closely over a longer period of time to help them get through some challenge.",
          "author": "SnowblindAlbino",
          "created": 1616159727,
          "upvotes": 58,
          "replies": {}
        },
        "grhw71j": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhw71j/",
          "text": "> And good doesn’t just mean academically, it means all round good people.\n\nExactly. Thanks for saying this. I think it would help students to know that we notice and appreciate the ones who are good people.",
          "author": "huskiegal",
          "created": 1616172034,
          "upvotes": 17,
          "replies": {
            "grj8oky": {
              "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grj8oky/",
              "text": "Thank you for thinking this way",
              "author": "janaimariekalicharan",
              "created": 1616194755,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "grj8mm3": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grj8mm3/",
          "text": "This was heart warming to read. I like that professors appreciate more than grades, and see students as people.",
          "author": "janaimariekalicharan",
          "created": 1616194725,
          "upvotes": 4,
          "replies": {}
        },
        "grhgeou": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhgeou/",
          "text": "This.",
          "author": "jayswaz",
          "created": 1616165014,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "grgk5zf": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgk5zf/",
      "text": "Depends on the professor.  But for those of us that got into it because we actually enjoy teaching, it is the interactions with students and seeing that look of Revelation on their face when they understand something that is why we do it.  Being online only has denied us for any meaningful dialogue, and the ability to connect with our students on some deeper level.",
      "author": "ProfessorOnEdge",
      "created": 1616141576,
      "upvotes": 269,
      "replies": {
        "grgnn99": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgnn99/",
          "text": "Thanks for this",
          "author": "janaimariekalicharan",
          "created": 1616145214,
          "upvotes": 31,
          "replies": {}
        },
        "griqpf1": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/griqpf1/",
          "text": "This. There are some positives- former lab members from around the world get to occasionally drop in on our (now) Zoom meetings and catch up with people. \n\nBut mostly, I really miss any ability to really connect with students.",
          "author": "Eigengrad",
          "created": 1616185640,
          "upvotes": 4,
          "replies": {}
        },
        "griokds": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/griokds/",
          "text": "This so much this. So much of academia sucks and is toxic (in my experience). Except the classroom and having those amazing moments when there are the \"Aha\" moment.\n\nAnd yes there are students I miss because they helped  those \"Aha\" moments and I genuinely liked them as a person.",
          "author": "DrippyCheeseDog",
          "created": 1616184646,
          "upvotes": 9,
          "replies": {}
        },
        "grogr4w": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grogr4w/",
          "text": ">it is the interactions with students and seeing that look of Revelation on their face when they understand something that is why we do it\n\nThose little nods are what I live for, bonus if it's followed by scribbling/typing something to their notes.",
          "author": "gergasi",
          "created": 1616311062,
          "upvotes": 2,
          "replies": {}
        },
        "grj33tt": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grj33tt/",
          "text": "I gotta disagree on your meaningful dialogue & connections point. I’ve had a great year (#22 in higher ed), full of excellent conversations and connections with my students, all via zoom.",
          "author": "rboller",
          "created": 1616191818,
          "upvotes": 3,
          "replies": {
            "grjf8na": {
              "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grjf8na/",
              "text": "Again, depends on the University, and on your students. The students in my classes have not been nearly as open to being themselves on the online platforms.  And given that I teach philosophy, which is based on dialogue I understand how it could be more difficult than other subjects. If yours haven't had those issues, more power to you",
              "author": "ProfessorOnEdge",
              "created": 1616198317,
              "upvotes": 3,
              "replies": {}
            },
            "grj8r28": {
              "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grj8r28/",
              "text": "That’s great",
              "author": "janaimariekalicharan",
              "created": 1616194791,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "grgnzzg": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgnzzg/",
          "text": "[deleted]",
          "author": null,
          "created": 1616145587,
          "upvotes": -95,
          "replies": {
            "grh3sin": {
              "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grh3sin/",
              "text": "Why are we getting this many trolls",
              "author": "math_chem",
              "created": 1616158437,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "grgqlv0": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgqlv0/",
      "text": "While professors deal with dozens if not hundreds of students a year, it's easy for them to not remember every student. However, they do remember certain moments or perhaps certain parts of their classes where they know they've made a big impact on those students. Even more so it's the relationships and mentorships they build with some of their students, the ones who engage in the class, who clearly want to learn the material as much as the professor wants to teach it, or even simply just keeping in touch after graduation. I have two professors of mine from my undergrad whom I keep in semi-regular contact with and even 8 years later they still remember me (even if they don't remember all the details). One of whom even has helped me out a lot in my grad school applications with offering feedback and letters of recommendation. \n\nThe professors have a lot more students than the students have for teachers, so not every student will be remembered, but the professors do remember the students that put in that extra effort to be active and engaged in the class.",
      "author": "bttrflyr",
      "created": 1616148292,
      "upvotes": 51,
      "replies": {
        "grh5wqs": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grh5wqs/",
          "text": "> I have two professors of mine from my undergrad whom I keep in semi-regular contact with and even 8 years later they still remember me (even if they don't remember all the details).\n\nI'm still in touch with professors I had 35+ years ago as an undergraduate in the 1980s. And regularly talk with students I taught myself in the late 1990s.",
          "author": "SnowblindAlbino",
          "created": 1616159669,
          "upvotes": 12,
          "replies": {
            "grj8ykj": {
              "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grj8ykj/",
              "text": "This gives me some hope my prof might have more to teach me after I graduate! If not, I’m glad other students get this opportunity :) thanks for commenting",
              "author": "janaimariekalicharan",
              "created": 1616194903,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gri1udw": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/gri1udw/",
          "text": "That professors can have an outsized effect is not surprising.\n\nAn engaging speaker in the front of a room, auditorium or camera obviously can impact the lives of people they have never known or those they barely know.",
          "author": "rethinkingat59",
          "created": 1616174504,
          "upvotes": 5,
          "replies": {}
        },
        "grmp1gv": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grmp1gv/",
          "text": "I suppose genuine connections are still connections regardless of context. Lovely read, thank you.",
          "author": "janaimariekalicharan",
          "created": 1616274432,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "grgt1a2": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgt1a2/",
      "text": "Does not happen often, but there are definitely some students I am sad to not have in class anymore.  Those few, however, usually keep in contact with me, and I with them, which is really really nice, and I consider them extended family.  To one student, I am referred to as \"campus dad\" and she is my \"campus daughter\", she is currently in law school, keeping me updated on her progress.  I have another former student who has traveled many states with me to see our favourite band together over the years.  Few connections persist, but the ones that do are excellent.",
      "author": "k_laiceps",
      "created": 1616150637,
      "upvotes": 28,
      "replies": {
        "griugyw": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/griugyw/",
          "text": "You seem like a really genuine educator. So glad you do what you do",
          "author": "janaimariekalicharan",
          "created": 1616187471,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "grgstge": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgstge/",
      "text": "Sure, I can still remember my best students, and I miss my interactions with them.",
      "author": "missdopamine",
      "created": 1616150434,
      "upvotes": 24,
      "replies": {}
    },
    "grgxdea": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgxdea/",
      "text": "I miss the weekly debates with my honours students even 20 years later. I’ve kept in contact with some of them (I’ve had almost 100), even got invited to weddings, birthdays, graduation parties. I miss the (almost) carefree time that they had when they were undergrads, when they had time to sit and chat in my office for hours. I miss that feeling of being tested by someone coming to the topic anew and seeing the light go on when you see that something has finally clicked. I still get it in class occasionally but research supervision is more of an ongoing dialogue so you get to know them better.",
      "author": "jzz175",
      "created": 1616154190,
      "upvotes": 12,
      "replies": {}
    },
    "grgyqak": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgyqak/",
      "text": "Yes.  If you felt a connection they probably did too.  Personally once they have left I feel like I would be intruding on their lives but I love it when former students reach back out to me and give me an update on their lives.",
      "author": "VeblenWasRight",
      "created": 1616155166,
      "upvotes": 12,
      "replies": {
        "grmp3sy": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grmp3sy/",
          "text": "💗",
          "author": "janaimariekalicharan",
          "created": 1616274461,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grh5jhv": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grh5jhv/",
      "text": "Of course we do. I have students from 20 years ago that I still miss. I'm also in touch with a great many going back over the last two decades and it's wonderful to watch them grow in careers and into their adult lives.  We develop close mentoring relationships with a subset of students and I almost always miss those when they leave-- though by the same token it's exciting to see them head out on their own.\n\nRelationships differ between types of school as well. I'm at a liberal arts college where faculty lead all the study abroad programs and we do a lot of field work as well. I've been abroad with students, led them on domestic trips, taken them on extended camping trips, etc. etc. The students I've spent time with in those contexts I often especially miss because I get to know them on a deeper level. That's different from just teaching hundreds of anonymous people in huge lectures, which I did at my previous institution (though I made connections with some of them as well and missed them after they left).",
      "author": "SnowblindAlbino",
      "created": 1616159461,
      "upvotes": 9,
      "replies": {}
    },
    "grh5pk7": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grh5pk7/",
      "text": "Yes. \n\nI will never forget my community college teaching days. I had more than a handful of really excellent students. Most of them weren't academically gifted, but came from diverse backgrounds and had unique needs, and I was honored to be the one they came to to help solve their issues around balancing personal life with school.",
      "author": "insanityensues",
      "created": 1616159556,
      "upvotes": 7,
      "replies": {}
    },
    "grh34s1": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grh34s1/",
      "text": "Yes, but rarely.  Probably the best student I've had graduated last spring and had been in my classes for three semesters.  He missed one of my fall classes due to other commitments, but it was something he would eventually have to take (I teach CC, so he would have just taken it at 4y), so I agreed to teach it to him alone.  We finished the normal semester's material by spring break, and I was so looking forward to teaching him brand new, more advanced topics in the second half when we just didn't come back from spring break at all.  I gave him materials to work on, like I did with the rest of my classes, but it was not the same energy as our in-person class.  I would very much like to have spent another semester with him.",
      "author": "shellexyz",
      "created": 1616158041,
      "upvotes": 6,
      "replies": {}
    },
    "grhc2fd": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhc2fd/",
      "text": "I always take a photograph of my class at the beginning of the semester, and write their names under their faces in Photoshop, to help me learn them. It's also a fun part of the \"ice-breaking\" exercise. Every once in awhile I end up opening up an old photo from a class a few years back, and it's a fun little trip. Some of the students I can't remember at all, because I teach so many and they just didn't distinguish themselves that much from the others. But others I think, \"oh, yeah, they were great, I wonder what they're up to?\" It's nice, though it also reminds me how quickly the old classes fade from my mind once I am half-a-semester into a new class (I recently looked at the last pre-pandemic class photos I took, and it feels like it was a million years ago).\n\nThe students I have been a thesis advisor to, I frequently am in touch with after graduation, because I got to know them a lot better than most of the others. Some of them I consider to be friends at this point. \n\nI don't \"miss\" students, though; that sort of implies a longing, and there isn't any of that. But I do like staying in touch with them, and I love it when a former student e-mails me to tell me what they're been up to.",
      "author": "restricteddata",
      "created": 1616162897,
      "upvotes": 6,
      "replies": {}
    },
    "grgvbji": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgvbji/",
      "text": "Have you seen the movie 'Her'?  At some point, Joaquin Phoenix's character is chatting with the AI he's fallen in love with, and he learns that 'she' is chatting with roughly 3000 other people.  There definitely are students we remember fondly (at least that's true for many of us), and so in that regard it is mutual, but it's also very asymmetric.",
      "author": "FunkyColdHypoglycema",
      "created": 1616152610,
      "upvotes": 17,
      "replies": {}
    },
    "grhejj6": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhejj6/",
      "text": "Not really because if I really like a student I try to keep in contact with them.\n\nBTW: tell your profs how you feel.  A prof I T.A.ed for died 5 years ago and I still get messages from students saying how much they regret never telling him how he changed their lives.",
      "author": "MercutiaShiva",
      "created": 1616164114,
      "upvotes": 14,
      "replies": {
        "griujaz": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/griujaz/",
          "text": "💗 how lovely",
          "author": "janaimariekalicharan",
          "created": 1616187502,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "grh5g42": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grh5g42/",
      "text": "I also remember and kind of miss working with my strongest students. I feel really proud when I hear about what they are doing now and love hearing updates at alumni events or getting the occasional email when they start a new job. It’s definitely not every student. A lot of people I totally forget their name over time. But the ones who are either extremely talented or just super friendly usually stand out.",
      "author": "QueenAsphyxiaXIX",
      "created": 1616159407,
      "upvotes": 6,
      "replies": {}
    },
    "grh8gn4": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grh8gn4/",
      "text": "No, they don't -- I'm not sure I'd use \"miss\" for either direction of the interaction. But that doesn't mean former profs don't remember you fondly and wouldn't love to hear from you! \n\nI am closer to done with my PhD than I am to starting it (notice I didn't say I'm close to done... FML), but I have definitely seen both sides of the coin is the point.\n\nI have written former profs to share exciting life and/or academic news, and some write back to say things like, oh of course I remember you! we had XYZ exchange, or you brought me this neat paper I hadn't seen, etc etc etc. We may exchange a few emails and they'll wish me well and we'll have a nice short reminiscence. But they don't \\*miss\\* me.\n\nSimilarly, I've taught enough now to have students out in the \"real world\" (hate that phrase), and sometimes they'll write to ask a question or check in and say hi. It's very uplifting to know students took something positive out of the experiences we shared in the classroom. But I don't \\*miss\\* them--I'm thrilled to hear from them, because it helps me know I'm doing something right, and I often do fondly recall that student for whatever quirks or unique aspects of their personality they brought to classes or interactions.",
      "author": "Jack-ums",
      "created": 1616161067,
      "upvotes": 5,
      "replies": {}
    },
    "grhngvw": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhngvw/",
      "text": "Echoing what a lot of others are saying, I remember many of my students fondly, but I don’t exactly miss them. However, that doesn’t mean I wouldn’t be excited if one stopped by my office or emailed me to catch up. \n\nI did have a class one year that was suppose to go on for two semesters (first year English stretched out over Fall and Spring). I loved one of my classes. We all just jived really well. Before Spring began, the school I was working for was having major enrollment issues. A lot of instructors were not getting the classes they needed in order to pay the bills. I had been splitting my time between this school and another and had planned on this being my last semester anyway before moving to work solely at the other school. So I told the department head to give my second semester classes to someone else (luckily to an instructor I knew and trusted). \nI felt good about my decision, but oh boy did I miss that class once Spring semester started. They invited me to stop by on the last day of the semester. I did, and it was such a joy to see them all again.",
      "author": "PrinceQuatre",
      "created": 1616168266,
      "upvotes": 5,
      "replies": {}
    },
    "grh5si3": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grh5si3/",
      "text": "It depends on the type of class you were on, and, if its a big group, whether you spoke up. I'm sure it's harder in huge 101 lecture courses. I remember all my students who were in my labs and journal discussion groups, even the quiet ones. Every year it was so hard to lose another awesome batch- each class had its own personality as a whole- quirky and interesting. And then the next group were so fun to get to know the same way. I love hearing from old students and finding out what they're doing. So yes, reach out and tell that professor if they made a difference in your life! We don't get much positive feedback from our peers or administrators. It's you students who really made the job fun and meaningful.",
      "author": "Plastic_Fun_2490",
      "created": 1616159602,
      "upvotes": 5,
      "replies": {}
    },
    "grhbxgf": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhbxgf/",
      "text": "I do, especially students I’ve taught in multiple classes. I also miss those whole classes in which we really establish a sense of community.",
      "author": "abd2phd",
      "created": 1616162826,
      "upvotes": 5,
      "replies": {}
    },
    "grhut5g": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhut5g/",
      "text": "As a former TA, I always wondered if my students thought of me and wished me as well as I wished them, so this makes my heart happy. Reach out and send an e-mail. You can't even imagine how much that can mean to someone to hear you made a difference in their life.",
      "author": "RoyalEagle0408",
      "created": 1616171446,
      "upvotes": 4,
      "replies": {
        "gri0lfu": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/gri0lfu/",
          "text": "💗💗 I will!",
          "author": "janaimariekalicharan",
          "created": 1616173954,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "grixhvf": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grixhvf/",
      "text": "Very smart and engaged students, yes. And very funny students. Most students, honestly....no. When you're teaching 100 students or more a semester, honestly, a lot of them are quickly forgotten. Just kind of the way it goes. But I \\*love\\* hearing from former students!",
      "author": "crackmethisnut",
      "created": 1616188971,
      "upvotes": 3,
      "replies": {
        "grj0nq9": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grj0nq9/",
          "text": "Professors can have thousands of students over their career. It makes sense",
          "author": "janaimariekalicharan",
          "created": 1616190570,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "grguxgq": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grguxgq/",
      "text": "I remember students fondly.  but don't \"miss\" any of them.",
      "author": "printandpolish",
      "created": 1616152296,
      "upvotes": 10,
      "replies": {}
    },
    "grgnagw": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgnagw/",
      "text": "Probably not if they have 300 new students a semester.",
      "author": "passwordistako",
      "created": 1616144843,
      "upvotes": 12,
      "replies": {
        "grgnn1h": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgnn1h/",
          "text": "Makes sense",
          "author": "janaimariekalicharan",
          "created": 1616145207,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "grgqswi": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgqswi/",
      "text": "It very well could be. \n\nIt depends, as the other commenters have said, and mainly on the professor and their workload. If your prof changes your perspective in a smaller class that allowed them time to get to know you, then I’d say it’s very possible. \n\nI have had plenty of students that I think about, even eight years after our class together. I myself still think fondly of my undergrad profs, and I’ve become friends with them on Facebook. More recently, I was asked by one to give a talk to their class, so I’m assuming at least she thinks fondly of me!",
      "author": "Rizzpooch",
      "created": 1616148488,
      "upvotes": 3,
      "replies": {}
    },
    "grgxo0n": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgxo0n/",
      "text": "I usually have a couple of students a semester that I really hit it off with and at least keep in touch with while they are in school, and a few have kept in touch long after graduation. I think it is pretty cool that I had enough of an impact on them that they would want to stay in contact.",
      "author": "TheKodachromeMethod",
      "created": 1616154405,
      "upvotes": 3,
      "replies": {}
    },
    "grh9krg": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grh9krg/",
      "text": "Yep.",
      "author": "PaigeOrion",
      "created": 1616161640,
      "upvotes": 3,
      "replies": {}
    },
    "gripyni": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/gripyni/",
      "text": "I'm a lecturer and I often think about my current and past students... I don't miss them, but I do care about them. This just goes to show the power of one good adult for young emerging adults.",
      "author": "Niamhintheworld",
      "created": 1616185291,
      "upvotes": 3,
      "replies": {
        "gritbll": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/gritbll/",
          "text": "This is lovely to hear. Must be nice to make a difference",
          "author": "janaimariekalicharan",
          "created": 1616186910,
          "upvotes": 1,
          "replies": {
            "grk3dfn": {
              "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grk3dfn/",
              "text": "It is nice to make a difference. Kindness in higher education goes way further than people realise. Students might not see it at the time, but some years later they do. I know this because I was a student and I am often grateful for the good adult I met at college who put me on the right track in life.",
              "author": "Niamhintheworld",
              "created": 1616212394,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "grjz694": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grjz694/",
      "text": "I think the relationship is very different from the professor's side, but the professor-student relationship can evolve into colleagues and even friends after graduation. Most of my former profs I'd be happy to run into at a conference and they might or might not remember me. A few I keep in touch with regularly (not only for recommendation letters!) and would grab lunch and catch up with if we were in the same place. I don't exactly miss them per se and we aren't quite colleagues or friends, but I genuinely like them as people and they seem to genuinely like me back, and if we landed at the same institution or in the same town I think we could become friends.",
      "author": "threecuttlefish",
      "created": 1616209713,
      "upvotes": 3,
      "replies": {
        "gsf7uk4": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/gsf7uk4/",
          "text": "Thank u!",
          "author": "janaimariekalicharan",
          "created": 1616840776,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grjzx69": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grjzx69/",
      "text": "Though I’ve never been a professor, I’ve taught K-14 (community college as well) for about 15 years. I recently did the math and I’ve had well over 2,000 students. I remember about 50% by name and miss some of them A LOT. I can’t imagine feeling that why while teaching a 400 person lecture, but I am SURE that they miss certain students in seminars and other more intimate classes.",
      "author": "aranhalaranja",
      "created": 1616210183,
      "upvotes": 3,
      "replies": {
        "gsf7wpb": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/gsf7wpb/",
          "text": "Makes sense",
          "author": "janaimariekalicharan",
          "created": 1616840795,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grgzykg": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grgzykg/",
      "text": "I miss some of my students, definitely. The great part of my job is that I get to meet new students every year, but I definitely remember a lot of my old students too.",
      "author": "Felixir-the-Cat",
      "created": 1616156022,
      "upvotes": 3,
      "replies": {}
    },
    "grh0zaq": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grh0zaq/",
      "text": "Yes",
      "author": "GetCookin",
      "created": 1616156696,
      "upvotes": 2,
      "replies": {}
    },
    "grh1eth": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grh1eth/",
      "text": "I had a brain injury in 07 and returned to college afterwards to earn a 4.0 gpa in linux administration. Graduated in 04. My primary linux teacher there told me last year im one of his favorite students, and always will be. I check in with him occasionally. So, i guess i can answer your question, it depends on the teacher/student/circumstances",
      "author": "cyanonic",
      "created": 1616156975,
      "upvotes": 2,
      "replies": {}
    },
    "grhed41": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhed41/",
      "text": "Some, yes.\n\nOthers? [\"Hello Professor, I took your nonmajors class and got a D 8 years ago can I have a letter of recommendation?\"](https://www.youtube.com/watch?v=IU4Crduhv68)",
      "author": "guttata",
      "created": 1616164027,
      "upvotes": 2,
      "replies": {
        "gricnbp": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/gricnbp/",
          "text": "I get that",
          "author": "janaimariekalicharan",
          "created": 1616179175,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grhesqs": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhesqs/",
      "text": "Yup!",
      "author": "jkanaris",
      "created": 1616164240,
      "upvotes": 2,
      "replies": {}
    },
    "grhhl4i": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhhl4i/",
      "text": "not really.\n\nYou guys are in a growth position where a mentor or older figure can have a lot of influence and it is new to you.  I like helping students and I am happy for their success but even students I interact with comparatively a lot are only a couple hours a week in a sea of hundreds of other students.  It is fairly rare that any of the m say or do something that stands out so much that I remember it any time later.",
      "author": "PersephoneIsNotHome",
      "created": 1616165572,
      "upvotes": 2,
      "replies": {}
    },
    "grhmkpo": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhmkpo/",
      "text": "Yes, it’s mutual. :)",
      "author": "ambitious_hibiscus",
      "created": 1616167867,
      "upvotes": 2,
      "replies": {}
    },
    "grhqqfp": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhqqfp/",
      "text": "i definitely miss my students and wonder how theyre doing. i love getting an email from them updating me on their progress or asking how i am",
      "author": "sdbabygirl97",
      "created": 1616169676,
      "upvotes": 2,
      "replies": {}
    },
    "grhslzr": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhslzr/",
      "text": "Yes! Specific ones. I often wonder where they are and what they do.",
      "author": "fiona0000",
      "created": 1616170494,
      "upvotes": 2,
      "replies": {}
    },
    "grhuo99": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhuo99/",
      "text": "I usually don't think about them until I hear from them. It's more about the volume. I have \\~150 students every year, and I never teach the same one twice; students have \\~10 professors per year.\n\nWhen I do hear from old students, I love it, especially if it's not just to get a recommendation. I had one contact me to get book recommendations. It was fun putting together a list for her! Another contacted me to give an example of how my course content had improved his life.",
      "author": "Crazy-Analyst",
      "created": 1616171388,
      "upvotes": 2,
      "replies": {}
    },
    "grij9zu": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grij9zu/",
      "text": "Please let her know! She may not know you feel this way. It would definitely brighten her day.",
      "author": "browneyes3190",
      "created": 1616182232,
      "upvotes": 2,
      "replies": {}
    },
    "grip4mo": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grip4mo/",
      "text": "I still email former students randomly to say hi (especially now with COVID). So I guess I do. Most students don’t respond though.",
      "author": "Jonjoloe",
      "created": 1616184905,
      "upvotes": 2,
      "replies": {
        "grite5t": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grite5t/",
          "text": "I wish my prof would reach out ^_^. Thanks for caring, it matters!",
          "author": "janaimariekalicharan",
          "created": 1616186944,
          "upvotes": 2,
          "replies": {
            "griug6y": {
              "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/griug6y/",
              "text": "Haha thanks. I don’t expect them to respond, and I know emails that are non pertinent are always a last priority for people, so it’s not a big deal to me. \n\nIt’s always an option if they want to!",
              "author": "Jonjoloe",
              "created": 1616187460,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "griy20p": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/griy20p/",
      "text": "Not a professor, but work closely with university students by the dozen, some over a period of years. I will periodically think of students I liked and wonder how they are doing. Sometimes I genuinely miss them.\n\nThe students I don't care for simply slip away from my mind and I will forget about them entirely unless their name comes up for some reason.",
      "author": "stolid_agnostic",
      "created": 1616189249,
      "upvotes": 2,
      "replies": {}
    },
    "grj3f8d": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grj3f8d/",
      "text": "Speaking as a liberal arts prof, yes, it’s mutual!",
      "author": "DoctorFescue",
      "created": 1616191984,
      "upvotes": 2,
      "replies": {
        "grj3rnc": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grj3rnc/",
          "text": "Liberal arts, I go to a small liberal school myself!",
          "author": "janaimariekalicharan",
          "created": 1616192161,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "grjbe7f": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grjbe7f/",
      "text": "I'm new, only been teaching for six years as an adjunct and graduate student, but I can say there are absolutely students from each semester so far that I remember and miss. My mother recently retired after 37 years as a professor, and I know she misses and remembers many students (and is very close friends with some, still). This gets way harder when you have bigger classes. I once TA'd a 900 person course, and that would have been difficult to get to know anyone in.",
      "author": "AskAboutAnimals",
      "created": 1616196211,
      "upvotes": 2,
      "replies": {
        "grjm8ze": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grjm8ze/",
          "text": "Thanks for sharing, it sounds like your mom had a very rewarding career. So happy to hear the impact is mutual. 💗 good luck with all your endeavours as an educator!",
          "author": "janaimariekalicharan",
          "created": 1616202206,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grtrtyr": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grtrtyr/",
      "text": "Students are amazed when I remember them by name and can recall where they sat in class ten years later. If you make a good impression, you stick with your professors. If you make not only a good impression but a deep connection, you will not only be remembered but missed. :)",
      "author": "biglybiglytremendous",
      "created": 1616430380,
      "upvotes": 2,
      "replies": {
        "grusrmj": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grusrmj/",
          "text": "💗💗💗 this is so wonderful, how lovely. What a gift it is to make genuine connections.",
          "author": "janaimariekalicharan",
          "created": 1616446822,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gujwg4m": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/gujwg4m/",
      "text": "It depends on the person. I connected with some and will always keep in touch with them. But for those who have not been so fair to me I want to forget them as soon as I can. Why do people in academia not realize that kindness goes a long long way.",
      "author": "sree2016",
      "created": 1618447143,
      "upvotes": 2,
      "replies": {}
    },
    "gzywjpu": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/gzywjpu/",
      "text": "I can only speak for myself as a professor - yes. When you teach classes with 80 students and 76 of them stare at you with a combination of sad, sleepy, annoyed, or uninterested (despite my best effort) the 4 students who work hard, smile once in a while, stop by for a chat at your office, and talk about their interests and dreams are a lifeline. Those 4 students are why I don't quit when I'm exhausted and discouraged myself. So I do miss those students and am always so pleased when they send me a follow-up email to let me know how they are doing! 🤗",
      "author": "Psychologist1111",
      "created": 1622377990,
      "upvotes": 2,
      "replies": {
        "h00vdpk": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/h00vdpk/",
          "text": "Thank you, this is just lovey. I’m glad they make your day.",
          "author": "janaimariekalicharan",
          "created": 1622415780,
          "upvotes": 1,
          "replies": {}
        },
        "h00vfeg": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/h00vfeg/",
          "text": "Nothing better than a prof who actually enjoys students who engage with them and connect with them!",
          "author": "janaimariekalicharan",
          "created": 1622415807,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grhpekv": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhpekv/",
      "text": "Are we not allowed to talk about our crushes? There's a student from a few semesters ago I remember wistfully. She sat up front and laughed at all my jokes. No, we were never alone together and no, I'd never cross that line. Just a fond memory of a good person.",
      "author": "estrellalevante",
      "created": 1616169110,
      "upvotes": 1,
      "replies": {
        "gri5vom": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/gri5vom/",
          "text": "This is cute. I’ve seen crushes before. It’s taboo, but doesn’t need to be. Some people get along. No judgement here. Thanks for sharing!",
          "author": "janaimariekalicharan",
          "created": 1616176227,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "grhrid4": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grhrid4/",
      "text": "TAs, yes. Students, no.",
      "author": "ph0rk",
      "created": 1616170011,
      "upvotes": 1,
      "replies": {}
    },
    "grk3r33": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grk3r33/",
      "text": "I’m fairly close with two of my previous professors and will text them well wishes on holidays and whatnot, and they do the same from time to time as well—checking into see how I am. They were both wonderful professors and I’m happy that they still think of me and reach out on occasion. \n\nAs someone who has worked with students (granted, for elementary school) I do have a few stand-out students that I miss and think of from time to time. I always hope they’re doing well navigating the world safely and, hopefully, with support from their families.",
      "author": "0011010100110011",
      "created": 1616212645,
      "upvotes": 1,
      "replies": {
        "grkil9d": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grkil9d/",
          "text": "This is wonderful to read. I’m glad that at no matter what the level some students just stick in the mind! — I also assumed you’ve contacted profs after you’ve graduated, it seems most profs are most comfortable when the former relationship is over.",
          "author": "janaimariekalicharan",
          "created": 1616225161,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grmb1qu": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grmb1qu/",
      "text": "Not all students are missed.\nThey miss only those who stand out either in character or performance.",
      "author": "Strict_Protection266",
      "created": 1616268324,
      "upvotes": 1,
      "replies": {
        "grmorsu": {
          "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grmorsu/",
          "text": "This makes sense, thanks 💗",
          "author": "janaimariekalicharan",
          "created": 1616274314,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grjawab": {
      "link": "/r/AskAcademia/comments/m8cc48/do_former_professors_miss_students_the_way_we/grjawab/",
      "text": "ROFLMAO",
      "author": "snakeman1961",
      "created": 1616195947,
      "upvotes": -1,
      "replies": {}
    }
  }
}