{
  "sid": "j4er6u",
  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/",
  "title:": "I’m 18 and have just started a masters degree in astrophysics, I love astrophysics and I love the environment. I was wondering if there anyways to get into work to do with protecting the environment after my degree?",
  "text": "It’s basically most post title. Just fleshing out the body in case there is a text limit.\n\nEdit: There are so many people fighting in the comments who aren’t even from the UK trying to say how a UK degree system works... Good job.",
  "author": "Huskyy23",
  "created": 1601730609,
  "updated": 1634081803,
  "over_18": false,
  "upvotes": 115,
  "upvote_ratio": 0.75,
  "comments": {
    "g7if7w3": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7if7w3/",
      "text": "In atmospheric and climate physics we get a lot of former astrophysics enthusiasts! I just finished my PhD in atmospheric physics literally yesterday so feel free to ask my any questions!",
      "author": "lplash",
      "created": 1601731673,
      "upvotes": 98,
      "replies": {
        "g7jo7k7": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jo7k7/",
          "text": "Congratulations! 🎈",
          "author": "mikebeentrill",
          "created": 1601754230,
          "upvotes": 18,
          "replies": {}
        },
        "g7jcu5e": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jcu5e/",
          "text": "Ooh that’s pretty cool, I don’t even know what to ask really, I just want to work in environmental science of some sort and I was wondering if it was possible at all",
          "author": "Huskyy23",
          "created": 1601750222,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "g7ihl5p": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ihl5p/",
      "text": "With a master's in astrophysics, you would have a solid background for doing a PhD in climate science. A lot of the skills and knowledge transfer over, like fluid dynamics modeling and computational physics.",
      "author": "notadoctor123",
      "created": 1601733070,
      "upvotes": 45,
      "replies": {}
    },
    "g7ig7gt": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ig7gt/",
      "text": "Sorry, what? 18 and starting a Masters?",
      "author": "MrLegilimens",
      "created": 1601732274,
      "upvotes": 82,
      "replies": {
        "g7igw8t": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7igw8t/",
          "text": "It'll be a 4 year undergraduate integrated degree; rather than graduating after 3 years with a BSc you blow right through to an MPhys.",
          "author": "foibleShmoible",
          "created": 1601732684,
          "upvotes": 68,
          "replies": {
            "g7ik3m1": {
              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ik3m1/",
              "text": "Right, but that's also not really starting a Master's. It's starting a combo BSc/MSc.",
              "author": "IamRick_Deckard",
              "created": 1601734495,
              "upvotes": 149,
              "replies": {
                "g7ip1c3": {
                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ip1c3/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1601737127,
                  "upvotes": 145,
                  "replies": {
                    "g7ipjjl": {
                      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ipjjl/",
                      "text": "Ding ding; we have a winner.",
                      "author": "IamRick_Deckard",
                      "created": 1601737435,
                      "upvotes": 48,
                      "replies": {
                        "g7ir8l3": {
                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ir8l3/",
                          "text": "No offense meant, but can we please let the “ding ding” die?",
                          "author": null,
                          "created": 1601738449,
                          "upvotes": -39,
                          "replies": {
                            "g7iwh54": {
                              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7iwh54/",
                              "text": "No",
                              "author": "ReadItInBothTenses",
                              "created": 1601741390,
                              "upvotes": 17,
                              "replies": {
                                "g7iwwtv": {
                                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7iwwtv/",
                                  "text": "Well damn. That’s disappointing.",
                                  "author": null,
                                  "created": 1601741633,
                                  "upvotes": 9,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g7is48b": {
                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7is48b/",
                  "text": "They are doing a masters degree, that is what it is called. They are enrolled on a masters degree, to say that they are starting a masters degree is entirely accurate.\n\n> It's starting a combo BSc/MSc.\n\nIt isn't, because you never get the BSc. I have never seen it described as a combo BSc/MSc. An MPhys is always just referred to as an [MPhys](https://en.wikipedia.org/wiki/Master_of_Physics). It is simply an undergraduate masters degree.\n\nPeople in this thread are getting really nit-picky with OP over what is an accurate description of the degree they're doing, all because they assumed one thing based upon what OP wrote, but that doesn't match the reality of the education system in which OP is working. I'm not saying it wouldn't have been helpful for OP to state they were in the UK at the start of their post, but that doesn't warrant people trying to portray OP as playing up the 18-year-old-masters-student element, when in fact they were just stating what they were doing.",
                  "author": "foibleShmoible",
                  "created": 1601738952,
                  "upvotes": -20,
                  "replies": {
                    "g7itppt": {
                      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7itppt/",
                      "text": "But the coursework OP does at the start will not be master's level. I feel like these distinctions are to flatter prospective students rather than accurately describe the degree.",
                      "author": "IamRick_Deckard",
                      "created": 1601739849,
                      "upvotes": 46,
                      "replies": {
                        "g7lpuj4": {
                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7lpuj4/",
                          "text": "It will effect the grade they get at the end, so counts as working towards the degree.\n\nI'm my bachelor's degree I took some masters level courses - but that doesn't change the fact that I was working towards a bachelor's.",
                          "author": "drcopus",
                          "created": 1601779275,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "g7ivplm": {
                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ivplm/",
                          "text": "I can promise you at no point when I started my MPhys degree did I think \"ooh, look at me doing masters level work\". The MPhys is an undergraduate degree, it is only ever billed as such, and at no point does anyone starting it think they're doing something equivalent to graduate level work.\n\nWhen I started it was literally a case of \"oh yay, I get to go straight through to getting my masters without paying graduate level fees for my fourth year, and with undergraduate (which had lower interest) loans to cover my living expenses that year\". Now they've jacked up tuition fees, but it is still a good way to graduate with more research experience and something beyond a BSc.\n\nI feel like you (and others) are getting het up because of how you are used to interpreting a masters degree, so it seemed to you like OP was making a grandiose statement. But to a UK physics student saying you're doing a masters degree (meaning MPhys) really isn't a big deal. Literally no one cares if you're a BSc or an MPhys, MPhys is just more useful if you plan on doing a PhD later.\n\nSimilarly, OP is probably only going to be familiar with the system they've just signed up to, so I imagine they were quite surprised by how strongly people reacted to the words they used, which were wholly accurate for the degree that OP is studying.",
                          "author": "foibleShmoible",
                          "created": 1601740962,
                          "upvotes": 7,
                          "replies": {}
                        },
                        "g7k74im": {
                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7k74im/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1601760748,
                          "upvotes": 2,
                          "replies": {
                            "g7kmo6q": {
                              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7kmo6q/",
                              "text": "*Thank you*. I'm getting really frustrated at people telling OP that they are wrong to describe their degree by its actual name. And trying to make absolute statements on a matter they still don't seem to understand (or want to understand), just because it doesn't match the system they're used to.",
                              "author": "foibleShmoible",
                              "created": 1601766085,
                              "upvotes": 0,
                              "replies": {
                                "g7lr0e0": {
                                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7lr0e0/",
                                  "text": "Yes this thread is sooooo frustrating. I don't understand how these people can be so adamant about something they clearly just don't understand. \n\nPeople from the UK seem to be explaining the situation with crystal clarity yet they're getting downvoted for using language differently?!",
                                  "author": "drcopus",
                                  "created": 1601779681,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "g7ivkn9": {
                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ivkn9/",
                          "text": "Feels like you’re reading into it way to deep instead of just offering advice mate. \n\nWhen I started in emergency medicine I was in a Basic to Medic course. In this course I learned everything that a Basic level EMT would, then an Intermediate/Advanced, then only after that did I start learning about the heart and different drugs. I learned all those things and my work wasn’t technically paramedic level, but I was never KNOWN as an EMT-B or EMT-I.",
                          "author": "ODST-judge",
                          "created": 1601740884,
                          "upvotes": 1,
                          "replies": {
                            "g7juefq": {
                              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7juefq/",
                              "text": "It is pretty important in degrees, especially in environmental science. I just started a MA in Geography this year, and while OP would be more than welcome in Geography, they would likely need to complete a MA or MS prior to applying to PhD programs. \n\nFrom what I know, Geography PhD programs do not accept MPhys as a requisite Master's degree as it is not strictly considered a masters degree.",
                              "author": "the_Q_spice",
                              "created": 1601756361,
                              "upvotes": 1,
                              "replies": {
                                "g7oyj1j": {
                                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7oyj1j/",
                                  "text": "This just isn't true in the UK.",
                                  "author": "BlokeyBlokeBloke",
                                  "created": 1601828760,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g7jfjak": {
                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jfjak/",
                  "text": "No. It's not. At no point in the course of the study do you get an BSc.",
                  "author": "BlokeyBlokeBloke",
                  "created": 1601751237,
                  "upvotes": -8,
                  "replies": {
                    "g7jk9jo": {
                      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jk9jo/",
                      "text": "But you do the same coursework as BSc. Seems like a bad deal.",
                      "author": "IamRick_Deckard",
                      "created": 1601752873,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                },
                "g7lpeci": {
                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7lpeci/",
                  "text": "How is it a combo when you don't get a BSc? At no point in the 4 years are you working towards a BSc and all your grades count towards the classification of your MSci degree.\n\nThat sounds a hell of a lot like starting an masters.\n\nThis seems to be a cultural difference, maybe you don't really have MSci degrees wherever you're from, but I can assure you that this OP's language is perfectly appropriate for the UK. Also, an MSci is different to an MSc, but both are masters degrees.",
                  "author": "drcopus",
                  "created": 1601779120,
                  "upvotes": -4,
                  "replies": {}
                }
              }
            },
            "g7isf6y": {
              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7isf6y/",
              "text": "How does this work? Less course requirements for both, and no thesis for the masters?",
              "author": null,
              "created": 1601739123,
              "upvotes": 6,
              "replies": {
                "g7iu4vj": {
                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7iu4vj/",
                  "text": "There is a [wikipedia page for the MPhys](https://en.wikipedia.org/wiki/Master_of_Physics), but lifting the section on course structure:\n\n> In terms of course structure, MPhys degrees usually follow the pattern familiar from bachelor's degrees with lectures, laboratory work, coursework and exams each year. Usually one, or more commonly two, substantial projects are to be completed in the fourth year which may well have research elements. At the end of the second or third years, there is usually a threshold of academic performance in examinations to be reached to allow progression into the final year. Final results are, in most cases, awarded on the standard British undergraduate degree classification scale, although some universities award something structurally similar to 'Distinction', 'Merit', 'Pass' or 'Fail', as this is often the way that taught postgraduate master's degrees are classified.\n\nSo the first three years are the same as the BSc course, you just don't graduate at the end of it. Although the way it describes the 4th year doesn't match what I and other people I know at other universities did. In my 4th/masters year we each did a research project that spanned the whole academic year (and did literature reviews over the summer before the year started in preparation) and we did write a thesis at the end (some universities may call it a report instead, but the length usually corresponds to the length of a typical STEM masters thesis).",
                  "author": "foibleShmoible",
                  "created": 1601740082,
                  "upvotes": 12,
                  "replies": {
                    "g7ivmps": {
                      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ivmps/",
                      "text": "Interesting! Thanks for taking the time to reply. It sounds like an efficient pipeline into a PhD if one was so inclined.",
                      "author": null,
                      "created": 1601740917,
                      "upvotes": 6,
                      "replies": {
                        "g7ivzgn": {
                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ivzgn/",
                          "text": "No worries, I think it is useful for us all to know more about the different systems in different countries. \n\nAside from anything, this thread has demonstrated 1) the importance of posters putting their locations in their OP, and 2) the importance of commenters not assuming that everything works the same way everywhere as it does in their own locations.",
                          "author": "foibleShmoible",
                          "created": 1601741117,
                          "upvotes": 6,
                          "replies": {
                            "g7iwjuc": {
                              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7iwjuc/",
                              "text": "I agree completely. I definitely had an initial reaction, based on my experience with the system in the US, because I thought the OP meant they had already finished an undergrad degree before 18. But reading your explanation adds a lot of clarity.",
                              "author": null,
                              "created": 1601741431,
                              "upvotes": 6,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g7iiabv": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7iiabv/",
          "text": "Yeah. That's normal in England. You start a 4 year course at 18 and end up with an MPhys",
          "author": "BlokeyBlokeBloke",
          "created": 1601733447,
          "upvotes": 2,
          "replies": {
            "g7imm3l": {
              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7imm3l/",
              "text": "That’s not really starting a Master’s.",
              "author": "MrLegilimens",
              "created": 1601735765,
              "upvotes": 33,
              "replies": {
                "g7jfcsa": {
                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jfcsa/",
                  "text": "Yes. It is. It is starting a course of study at the end of which you have a Master's degree.",
                  "author": "BlokeyBlokeBloke",
                  "created": 1601751175,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "g7igbp0": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7igbp0/",
          "text": "Yeah you can do that in England",
          "author": "Huskyy23",
          "created": 1601732345,
          "upvotes": -15,
          "replies": {
            "g7imlry": {
              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7imlry/",
              "text": "That’s not really starting a Master’s.",
              "author": "MrLegilimens",
              "created": 1601735761,
              "upvotes": 18,
              "replies": {
                "g7impnm": {
                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7impnm/",
                  "text": "What on Earth are you talking about?",
                  "author": "Huskyy23",
                  "created": 1601735818,
                  "upvotes": -19,
                  "replies": {
                    "g7inggx": {
                      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7inggx/",
                      "text": "That’s starting a combined BA/MS kind of thing, where your first classes aren’t all Masters level classes.",
                      "author": "MrLegilimens",
                      "created": 1601736204,
                      "upvotes": 18,
                      "replies": {
                        "g7inuw0": {
                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7inuw0/",
                          "text": "Tbh I don’t understand what you’re saying, I just know that after 4 years I graduate with a Masters degree in Astrophysics",
                          "author": "Huskyy23",
                          "created": 1601736411,
                          "upvotes": -21,
                          "replies": {
                            "g7ioi4t": {
                              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ioi4t/",
                              "text": "They're saying that if you're doing an integrated masters course, the first 3 years is not Master's level - you are doing the equivalent of a Bachelor's degree in those first 3 years. The Master's component is only in the 4th year. So you're not really starting a Master's now.",
                              "author": "boochyfliff",
                              "created": 1601736802,
                              "upvotes": 29,
                              "replies": {
                                "g7iolms": {
                                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7iolms/",
                                  "text": "Oh okay, I get it now. Well, regardless, my question is still valid I think",
                                  "author": "Huskyy23",
                                  "created": 1601736861,
                                  "upvotes": 16,
                                  "replies": {
                                    "g7ioswt": {
                                      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ioswt/",
                                      "text": "Of course your question is valid! I just think your initial phrasing was confusing some people because it implied you're doing a 1 year MSc at the age of 18... which would be pretty impressive haha.",
                                      "author": "boochyfliff",
                                      "created": 1601736984,
                                      "upvotes": 12,
                                      "replies": {
                                        "g7ipfxi": {
                                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ipfxi/",
                                          "text": "Oh okay, well thanks for clearing that up!",
                                          "author": "Huskyy23",
                                          "created": 1601737375,
                                          "upvotes": 10,
                                          "replies": {}
                                        },
                                        "g7j1naz": {
                                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7j1naz/",
                                          "text": "And totally possible, which is why I find the outrage in this thread to be ridiculous. People in this community have such fragile egos that they feel threatened by the idea of an 18-year-old getting an MA. Even if OP made a mistake, why should anyone care? The question is not about his age.",
                                          "author": "Tycchi",
                                          "created": 1601744317,
                                          "upvotes": 9,
                                          "replies": {
                                            "g7j8x8p": {
                                              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7j8x8p/",
                                              "text": "Totally agree with you. Unnecessarily nitpicky and annoying, especially since it is not impossible to start a Master's at 18 in the first place and furthermore the American educational system is not the only one to exist in this world. Sorry that you had to deal with this, /u/Huskyy23",
                                              "author": "bartimaeus122",
                                              "created": 1601748306,
                                              "upvotes": 6,
                                              "replies": {
                                                "g7jcepo": {
                                                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jcepo/",
                                                  "text": "Thanks, but it’s okay, I had some nice answers that I appreciate with some useful information",
                                                  "author": "Huskyy23",
                                                  "created": 1601750007,
                                                  "upvotes": 3,
                                                  "replies": {
                                                    "g7jp0aq": {
                                                      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jp0aq/",
                                                      "text": "Don’t go around telling people that you are doing a masters program. Seriously. You should say a joint BSc/MSc degree.",
                                                      "author": "Kpapangelis",
                                                      "created": 1601754499,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "g7jp2pt": {
                                                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jp2pt/",
                                                          "text": "Noted",
                                                          "author": "Huskyy23",
                                                          "created": 1601754522,
                                                          "upvotes": 3,
                                                          "replies": {
                                                            "g7kns5p": {
                                                              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7kns5p/",
                                                              "text": "Please don't pay too much heed to the people wrongly insisting that you're doing a joint BSc/MSc degree. An undergraduate masters is a well understood concept in the UK and your choice of words were completely accurate, since you will not be getting a BSc, just the masters. For some reason today, rather than accepting that systems can just differ between countries, some people seem to have decided to just tell you that the UK system is wrong. I like to think we're usually more open minded than that here.",
                                                              "author": "foibleShmoible",
                                                              "created": 1601766483,
                                                              "upvotes": 3,
                                                              "replies": {
                                                                "g7qj01l": {
                                                                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7qj01l/",
                                                                  "text": "Thanks for this comment, I know I am doing a master’s degree but I thought for some reason I made a big mistake haha",
                                                                  "author": "Huskyy23",
                                                                  "created": 1601855450,
                                                                  "upvotes": 1,
                                                                  "replies": {}
                                                                }
                                                              }
                                                            }
                                                          }
                                                        },
                                                        "g7oystx": {
                                                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7oystx/",
                                                          "text": "No. He shouldn't. Since that is not what he is doing.",
                                                          "author": "BlokeyBlokeBloke",
                                                          "created": 1601828898,
                                                          "upvotes": 3,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "g7iprgg": {
                                      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7iprgg/",
                                      "text": "Just don't go around telling people you're starting a Master's program.",
                                      "author": "MrLegilimens",
                                      "created": 1601737571,
                                      "upvotes": 9,
                                      "replies": {
                                        "g7oyuz7": {
                                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7oyuz7/",
                                          "text": "Unless you are. Like OP is",
                                          "author": "BlokeyBlokeBloke",
                                          "created": 1601828929,
                                          "upvotes": 2,
                                          "replies": {}
                                        },
                                        "g7l4r10": {
                                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7l4r10/",
                                          "text": "[deleted]",
                                          "author": null,
                                          "created": 1601772191,
                                          "upvotes": 3,
                                          "replies": {
                                            "g7lo48a": {
                                              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7lo48a/",
                                              "text": "> because the US isn't the centre of the world\n\nExactly - I'm pretty sure everyone in the UK would be comfortable with someone starting an MSci saying that they're \"starting their masters\". Yet, people on this thread seem very very offended that another country uses words differently.\n\nI wonder how they're going to feel when they find out that there are some countries that speak completely different languages?!\n\nAdditional point: I've seen some people claim that you don't get to say that you're starting your masters until you reach forth year. This is just incorrect. On an integrated masters program in the UK you are at no point working towards a Bachelor's degree, so what should you say you're doing for the first three years?",
                                              "author": "drcopus",
                                              "created": 1601778681,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "g7irznl": {
                              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7irznl/",
                              "text": "Is it NatSci at Cambridge ?",
                              "author": "xekatinaz",
                              "created": 1601738880,
                              "upvotes": 2,
                              "replies": {
                                "g7j2b16": {
                                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7j2b16/",
                                  "text": "Astrophysics at Aberystwyth",
                                  "author": "Huskyy23",
                                  "created": 1601744686,
                                  "upvotes": 2,
                                  "replies": {
                                    "g7j583x": {
                                      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7j583x/",
                                      "text": ">Yeah you can do that in England\n\n>Aberystwyth\n\nWell that’s one way to get a bollocking from the locals",
                                      "author": "gold-ukthrowaway",
                                      "created": 1601746300,
                                      "upvotes": 5,
                                      "replies": {
                                        "g7j5d8a": {
                                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7j5d8a/",
                                          "text": "Yeah sorry, I just think of it all as the same haha",
                                          "author": "Huskyy23",
                                          "created": 1601746379,
                                          "upvotes": 0,
                                          "replies": {}
                                        }
                                      }
                                    },
                                    "g7jp8r3": {
                                      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jp8r3/",
                                      "text": " Aberystwyth is not in England...",
                                      "author": "Kpapangelis",
                                      "created": 1601754577,
                                      "upvotes": 6,
                                      "replies": {
                                        "g7jpeoo": {
                                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jpeoo/",
                                          "text": "Did you not look at the comment literally right above you",
                                          "author": "Huskyy23",
                                          "created": 1601754632,
                                          "upvotes": -2,
                                          "replies": {
                                            "g7jqaj5": {
                                              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jqaj5/",
                                              "text": "No",
                                              "author": "Kpapangelis",
                                              "created": 1601754937,
                                              "upvotes": 3,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "g7ipa5f": {
                      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ipa5f/",
                      "text": "You technically only start the masters section of your degree when you pass the first three years successfully.",
                      "author": "izvin",
                      "created": 1601737277,
                      "upvotes": 11,
                      "replies": {
                        "g7oypic": {
                          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7oypic/",
                          "text": "No. You \"technically\" don't. That's not now the degree works in the UK.",
                          "author": "BlokeyBlokeBloke",
                          "created": 1601828851,
                          "upvotes": 1,
                          "replies": {
                            "g7pkb01": {
                              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7pkb01/",
                              "text": "Technically, I studied in a UK university and had a technically 4 year combined programme and technically have a first-hand insight into how it technically works.",
                              "author": "izvin",
                              "created": 1601837982,
                              "upvotes": -1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g7iqtq8": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7iqtq8/",
      "text": "You totally got a good background to do climate science.\n\nI graduated with a physics degree but am now doing environmental work and a masters research. Infact I would consider them as very closely related subjects, a sort of “applied physics”\n\nAtmospherics and climate change science is one intersection you can look at with your astrophysics masters",
      "author": "notohate",
      "created": 1601738208,
      "upvotes": 7,
      "replies": {
        "g7jcj2t": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jcj2t/",
          "text": "That’s pretty cool, from what I’ve seen, climate science seems like the way to go, thanks for your response!",
          "author": "Huskyy23",
          "created": 1601750070,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g7iliw3": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7iliw3/",
      "text": "You need to get in touch with people who took a similar path, and ask what they did or what they found helpful. They can give you tips about what skills and background knowledge are most useful in climate sciences, so you can make sure to focus on those things too when you're presented with an opportunity to make choices (like when choosing a topic for a class project, or a programming language for a research project, or what papers to read this week).\n\nA few people in this thread mentioned that they were on similar paths or knew people who were, so if I were you I would DM them.",
      "author": "pb-pretzels",
      "created": 1601735211,
      "upvotes": 5,
      "replies": {
        "g7jcly6": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jcly6/",
          "text": "Okay thanks for this, I’ll email some professors at my uni and talk to them about that I should do :)",
          "author": "Huskyy23",
          "created": 1601750109,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g7jwyls": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jwyls/",
      "text": "Honestly, if you're 18 you're so early in your career that you can decide to devote your science to protecting the environment without having to do the backflips many of us have to do when we decide we'd like to focus on something other than what we specifically trained to do.  Why not just study environmental science or atmospheric chemistry or climatology or any of those subjects?",
      "author": "TourmalineTart",
      "created": 1601757250,
      "upvotes": 3,
      "replies": {
        "g7jxe4j": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jxe4j/",
          "text": "Well I really want to study Astrophysics, but I’m intrigued to see if I’ll be able to study both topics I’m passionate about. Astrophysics is my main choice, so I’d rather not just switch what I want to study",
          "author": "Huskyy23",
          "created": 1601757399,
          "upvotes": 2,
          "replies": {
            "g7k0zu3": {
              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7k0zu3/",
              "text": "Sure, I understand where you're coming from. But are we talking career-wise? If so, what are your career goals? ...If you even have clear cut goals for your career trajectory at 18; I was a twerp in cosmetology school at 18.",
              "author": "TourmalineTart",
              "created": 1601758628,
              "upvotes": 3,
              "replies": {
                "g7k1jlw": {
                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7k1jlw/",
                  "text": "Kind of career wise? I’m just looking to see if it’s possible to combine Environmental science work with astrophysics; or if I can work in the environmental science field, or something closely related",
                  "author": "Huskyy23",
                  "created": 1601758799,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g7ii8jv": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ii8jv/",
      "text": "Definitely possible. I know someone who did their Master's on black holes and is now doing a climate physics PhD.",
      "author": "Chlorophilia",
      "created": 1601733420,
      "upvotes": 4,
      "replies": {}
    },
    "g7il0qj": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7il0qj/",
      "text": "You can also look into the growing field of Geo engineering and Geo physics! They're basically making really innovative technology to try and reverse the effects of climate change.",
      "author": "shreddedstallion69",
      "created": 1601734955,
      "upvotes": 2,
      "replies": {
        "g7jcoh7": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jcoh7/",
          "text": "I have not heard of geo physics or geo engineering as terms before, I’ll definitely check them out, thanks :)",
          "author": "Huskyy23",
          "created": 1601750145,
          "upvotes": 3,
          "replies": {}
        },
        "g7jwlcf": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7jwlcf/",
          "text": "I don't quite think that's how I'd characterize either geophysics or geological engineering.  In fact, the most common place geophysicist tend to work is for oil companies. Maybe you're thinking of carbon sequestration work, which I could see being lumped in there.  Can you give examples of what you're thinking of?",
          "author": "TourmalineTart",
          "created": 1601757121,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g7is4e1": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7is4e1/",
      "text": "Is it NatSci at Cambridge ?",
      "author": "xekatinaz",
      "created": 1601738954,
      "upvotes": 2,
      "replies": {
        "g7k9o9h": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7k9o9h/",
          "text": "We don't have immediate entrance to Astrophysics here. As you say, students have to enrol in NatSci for Parts IA/B and II, and can only move into Astrophysics at Part III of the Tripos, not any earlier. So OP couldn't be enrolled in a Masters degree in Astrophysics straight away in our system.",
          "author": null,
          "created": 1601761607,
          "upvotes": 2,
          "replies": {
            "g7lp1yy": {
              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7lp1yy/",
              "text": "There is a Part II Astrophysics you can do in the 3rd year before Part III if you want to.",
              "author": "DifferentWestern8834",
              "created": 1601779004,
              "upvotes": 1,
              "replies": {
                "g7o7z2f": {
                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7o7z2f/",
                  "text": "Ah yes, I should have remembered: I do teach them! But still, the point stands that you can't enrol in your degree in astrophysics, and can only declare it at a later stage. So OP wouldn't have said they were enrolled in a Masters degree in *astrophysics* given they wouldn't be enrolled in astrophysics in year 1, they'd be in Nat Sci.",
                  "author": null,
                  "created": 1601815108,
                  "upvotes": 1,
                  "replies": {
                    "g7qpyi2": {
                      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7qpyi2/",
                      "text": "You're critical to their astrophysics education then! \n\nI think in UCAS you used to be able to choose if you wanted to do the BA or the integrated masters (BA & MSci) from the start. However, it was somewhat meaningless as all of the Part IIIs (integrated masters) are conditional on Part II results (usually a minimum of a 2:1) so, as you mention, it's not actually possible to guarantee enrolment in the masters from the start. You could even argue that you can't even technically get a masters in astro as the certificate will say MSci in NatSci. (Can't remember if it's the same for candidates who don't have a Cambridge BA who get awarded the MASt instead – another oddity.)\n\nActually, in some ways it's even weirder than that. All Cambridge bachelor degrees lead to the award of the same BA in no specific subject and no class. So you could say that it's not technically possible to enrol in NatSci at the start as there is no BA in NatSci awarded. NatSci only appears in the MSci certificates. This is all rather pedantic though and obviously in practice there are different kinds of BAs.",
                      "author": "DifferentWestern8834",
                      "created": 1601859519,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g7k26wp": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7k26wp/",
      "text": "I’m getting some /r/iamverysmart vibes here.",
      "author": "stupidsexyflanders-",
      "created": 1601759026,
      "upvotes": 2,
      "replies": {
        "g7k2dbi": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7k2dbi/",
          "text": "Okay, I’m only pointing out my age so people know where I’m at in terms of uni, not like just about to graduate or anything",
          "author": "Huskyy23",
          "created": 1601759092,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g7idz0t": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7idz0t/",
      "text": "You can do WHATEEEEEVER you want to DO!",
      "author": "Albatross_Total",
      "created": 1601730783,
      "upvotes": 0,
      "replies": {
        "g7ie397": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ie397/",
          "text": "Yeah but it’s an astrophysics degree, I’m just curious about realistic options haha",
          "author": "Huskyy23",
          "created": 1601730867,
          "upvotes": 4,
          "replies": {
            "g7ii6hd": {
              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7ii6hd/",
              "text": "You will have a degree with a high level of numeracy and probably familiarity with coding. You'll be fine.",
              "author": "BlokeyBlokeBloke",
              "created": 1601733390,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "g7mdrqx": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7mdrqx/",
      "text": "Environmental engineering?",
      "author": "le_redditusername",
      "created": 1601788068,
      "upvotes": 1,
      "replies": {}
    },
    "g7irof1": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7irof1/",
      "text": "LOL starting a master's",
      "author": "half_a_lime",
      "created": 1601738700,
      "upvotes": -4,
      "replies": {}
    },
    "g7k4tyg": {
      "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7k4tyg/",
      "text": "protecting the environment? LOL\n\ngo to a Bernie Bros rally",
      "author": "tonymaric",
      "created": 1601759957,
      "upvotes": -16,
      "replies": {
        "g7keaq7": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7keaq7/",
          "text": "You're in an academic subreddit.\n\nBegone, reich-winger.",
          "author": "Hoihe",
          "created": 1601763193,
          "upvotes": 8,
          "replies": {}
        },
        "g7kwli0": {
          "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7kwli0/",
          "text": "Get back in the pond if you’re going to be such a silly little goose.",
          "author": "mikebeentrill",
          "created": 1601769572,
          "upvotes": 1,
          "replies": {
            "g7kyiwl": {
              "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7kyiwl/",
              "text": "you're",
              "author": "tonymaric",
              "created": 1601770197,
              "upvotes": -2,
              "replies": {
                "g7kys7m": {
                  "link": "/r/AskAcademia/comments/j4er6u/im_18_and_have_just_started_a_masters_degree_in/g7kys7m/",
                  "text": "Guess I’ll get in the pond.",
                  "author": "mikebeentrill",
                  "created": 1601770278,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}