{
  "sid": "raavpn",
  "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/",
  "title:": "Fear of failing my defense",
  "text": "My PhD defense is about 5 weeks from now and I'm really nervous that I'm not going to be prepared for it.\n\nI have been working part-time during my PhD and I just landed a full-time job. I quit my part-time job with my last day being 12 days from today, and then I start my new job the following week. I asked my new employer if it was possible to start after my defense but they said they prefer I start as soon as possible because they are quite busy and need to train me. They said they are happy to give me some days off prior to my defense to make sure I am prepared for it. I've been trying to find the time and energy to study when I'm not working but I'm worried that it will become more difficult once I start my new job. I'll pretty much only have evenings and weekends to study. My PI knows I work part-time and is aware that I've been looking for a full-time job since I was nearing the end of writing my dissertation. \n\nI'm really anxious that I'm going to be unprepared for my defense and fail. How likely is it to fail a PhD defense? Has anyone here worked full-time while preparing for a defense? Any advice or reassurances are welcome. Thanks!",
  "author": "cookie_monster_10",
  "created": 1638807254,
  "updated": 1639515576,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.94,
  "comments": {
    "hnh1q84": {
      "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnh1q84/",
      "text": "If your dissertation advisor says you’re ready, you are ready. Unless they are an asshole, and advisor has no incentive to set you up to fail.\n\nEveryone gets these jitters, everyone feels under prepared. Remember, you are the expert.",
      "author": "EconomistPunter",
      "created": 1638807350,
      "upvotes": 45,
      "replies": {
        "hnheyh0": {
          "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnheyh0/",
          "text": "This.",
          "author": "BronzeSpoon89",
          "created": 1638812541,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hnh4iw3": {
      "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnh4iw3/",
      "text": "I have never seen anyone failing a PhD defense. Once, a guy was working with a specific method for 5 years, so the committee asked him 'Who invented this method and when was that?' and his answer was simply \"I do not know\". It was also clear that his work had a pretty glaring fundamental flaw, both to me and to at least some of the committee members. That guy still passed.\n\nThe only failed defense I ever witnessed was a Bachelor student, who worked with a certain imaging method and admitted during the defense that he had altered his results in Photoshop. That was the straw that broke the camel's back as the rest of his work was also underwhelming.",
      "author": "territrades",
      "created": 1638808457,
      "upvotes": 16,
      "replies": {}
    },
    "hnh8lnj": {
      "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnh8lnj/",
      "text": "I would never let a student defend if they weren’t expected to pass. I’ve never seen anyone fail.",
      "author": "pugbug2016",
      "created": 1638810063,
      "upvotes": 8,
      "replies": {}
    },
    "hnhmf9z": {
      "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnhmf9z/",
      "text": "I've never known someone fail who submitted with their PI's support. I've known a couple of fails where they submitted against their PI's wishes. \n\nThis is about your work, you know your thesis better than anyone else in the world. You are literally the expert. \n\nRead the key papers again, read your thesis and stay up to date with any developments in the field. You'll be champion.",
      "author": "ACatGod",
      "created": 1638815455,
      "upvotes": 7,
      "replies": {}
    },
    "hnhs5s7": {
      "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnhs5s7/",
      "text": "Defended my dissertation a month ago. I, too, felt stressed and underprepared and little overwhelmed. It went perfectly well. Do what you can, and know the hard work is behind you. You’ll ace this.",
      "author": "Courbet72",
      "created": 1638817699,
      "upvotes": 6,
      "replies": {}
    },
    "hniszr7": {
      "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hniszr7/",
      "text": "It's legit almost impossible for you to fail your defense if you are at the stage of defending. I asked the question a few months ago, I recommend you look at the answers of the thread to help reassure you and be less stressed about it. Hope you have a great defense! \n\nhttps://www.reddit.com/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/?utm_source=share&utm_medium=mweb",
      "author": "methomz",
      "created": 1638832252,
      "upvotes": 5,
      "replies": {}
    },
    "hnioz0o": {
      "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnioz0o/",
      "text": "Have you written up your dissertation? If you have and have completed the work, then why do you think you'll fail?",
      "author": "anicedayinnewyork",
      "created": 1638830560,
      "upvotes": 3,
      "replies": {
        "hnj5phl": {
          "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnj5phl/",
          "text": "Yes, I already submitted my dissertation for examination and set a date for my defense. I just worry I won’t have enough time to prepare properly and won’t feel confident going in, leaving me unable to answer too many questions. Everyone’s comments here have been very reassuring and made me less anxious. I hope I’ll feel differently closer to my defense date",
          "author": "cookie_monster_10",
          "created": 1638837892,
          "upvotes": 1,
          "replies": {
            "hnjw7u3": {
              "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnjw7u3/",
              "text": "Yeah it sounds like you'll be fine. Remember to get enough sleep ... good luck! :)",
              "author": "anicedayinnewyork",
              "created": 1638849526,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hnj3d0g": {
      "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnj3d0g/",
      "text": "I was in your shoes just 2 weeks ago. I had crazy anxiety about failing (and I’m not an anxious person). I ended up passing, to no one’s surprise but my own. Your advisor won’t let you defend unless you are actually ready to defend. \n\nYou’re going to do just fine!",
      "author": "breadabloom",
      "created": 1638836828,
      "upvotes": 2,
      "replies": {}
    },
    "hnjik1b": {
      "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnjik1b/",
      "text": "The chances of failing a PhD defense, as many others mentioned, are extremely low.\n\nIt is normal to feel like preparing your defense means frantically “studying” as many topics as possible to cover all possible questions, which makes it feel like there won’t ever be enough time to prepare.\n\nThinking about my defense, the most effective preparation for me was focusing on the actual work I did and think about possible discussion threads that panel members can pick up on (not too different from what journal peer reviewers would do). Thinking about these topics in advance is likely to make you more comfortable discussing your work in a constructive way (and not an attack on the quality of your research). Most questions can be answered with a balanced combination of (1) reasons why certain choices made sense with information available, (2) acknowledging that there are alternative methods and/or interpretation of results, and (3) positioning questions/ideas as future work.\n\nI had my defense 6 month after I started a full-time industry job (in another country!). It does require effort to shift from the day-job mindset and get “in the zone” to focus on preparing your thesis. I’d recommend doing it in a consistent and planned manner (by allocating a couple hours on evenings), and leveraging that flexibility that your employer is giving you.\n\nThere is no doubt that you are the expert in your work/thesis. The key here is practicing the discussion muscle and you will certainly feel confident about your defense.\n\nGood luck, it will be great and then you can fully focus on your next career chapter!",
      "author": "Miles-away2007",
      "created": 1638843520,
      "upvotes": 2,
      "replies": {
        "hnjmi57": {
          "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnjmi57/",
          "text": "Thank you! This was really helpful and reassuring",
          "author": "cookie_monster_10",
          "created": 1638845217,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnkjkxi": {
      "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnkjkxi/",
      "text": "The defense is basically a rubber stamp. You've been given permission to write/defend because they think you are ready to graduate and you've turned in your dissertation. I've never heard of a student failing the actual defense.",
      "author": "queue517",
      "created": 1638863998,
      "upvotes": 2,
      "replies": {}
    },
    "hnkphwx": {
      "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnkphwx/",
      "text": "All the reassurances here are great! Just to add some advice (from someone who also felt unprepared for their defense): \n\nMake sure to celebrate the day of your defense. Take photos, be with your friends and family. It's an important day that you worked hard for! I regret not having things like this to look back on for my own.",
      "author": "botanicalbuddy",
      "created": 1638868985,
      "upvotes": 2,
      "replies": {
        "hnl45dc": {
          "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnl45dc/",
          "text": "Thanks! You’re right, I’ll make sure to do that",
          "author": "cookie_monster_10",
          "created": 1638880401,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnjw8hb": {
      "link": "/r/AskAcademia/comments/raavpn/fear_of_failing_my_defense/hnjw8hb/",
      "text": "Thank you everyone for your reassurances, I really appreciate it",
      "author": "cookie_monster_10",
      "created": 1638849534,
      "upvotes": 1,
      "replies": {}
    }
  }
}