{
  "sid": "pte0s3",
  "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/",
  "title:": "Are PhD Students Really Older?",
  "text": "I'm applying to PhD programs this application period, and I was wondering if PhD students are actually older in the programs. I'm currently finishing up my Master's, and all of those in my cohort are fresh out of undergrad (22-24), and I know many students go straight to PhD from undergrad as well.\n\nI worry I'll be older than many other students if this is the case, as I am spending two years in the master's program prior to attending PhD.",
  "author": "Serious_Rat",
  "created": 1632336050,
  "updated": 1634078888,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hdvl5lx": {
      "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/hdvl5lx/",
      "text": "Some are. My PhD cohort had people in it everywhere from mid-20s to in their 50s.\n\nBut you're talking 2 years - not really an age gap in your case.",
      "author": "CerebralBypass",
      "created": 1632336353,
      "upvotes": 12,
      "replies": {}
    },
    "hdvm3nl": {
      "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/hdvm3nl/",
      "text": "I think this is field dependent actually.\n\nIn my humanities PhD R1 department average age was probably late 20s-early 30s with a few older and a few younger.",
      "author": "gggggggggggfff",
      "created": 1632336733,
      "upvotes": 7,
      "replies": {
        "hdwq4dp": {
          "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/hdwq4dp/",
          "text": "Yep, very field dependent.\n\nIm an education professional - ID1 (31M) at a four year regional university with 3 years of in-field experience and praying to god a flagship lets me slide into the pool of 15-25 year veterans trying to get their Phd in education sometime soon. It’s more of a king-making process than it is educational.",
          "author": "BaddestBrian",
          "created": 1632358627,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdwb5ki": {
      "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/hdwb5ki/",
      "text": "I’m 45 and just starting my masters. I’ll start my PhD at 48. The thing is, being older allowed me to earn my BA with a 3.95 (one B+ because COVID else all 4.0’s)… I’m also a much more fluid writer, responsible and financially able to support myself with my self-employment.",
      "author": "ostrogotha",
      "created": 1632351525,
      "upvotes": 3,
      "replies": {}
    },
    "hdwwz1r": {
      "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/hdwwz1r/",
      "text": "In terms of when you should start a PhD, I think age is less important than how prepared you are for a PhD program and what it entails (which is field dependant). In some fields, having some years of relevant work experience before starting the program is helpful, whereas in others going straight through might be beneficial so you can more easily retain prerequisite knowledge. \n\nOnce you're in the program your peers will be the other students in your cohort regardless of age. It's just like in the workforce where your peer group may include people in their 20s and people in their 60s.",
      "author": "ZenosBrownie",
      "created": 1632361918,
      "upvotes": 3,
      "replies": {}
    },
    "hdvr571": {
      "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/hdvr571/",
      "text": "I was in my late 30’s during my PhD program (and appreciated having the life and professional background). I was certainly not the youngest in our gang, but I wasn’t ever the oldest.",
      "author": "REC_HLTH",
      "created": 1632338763,
      "upvotes": 2,
      "replies": {}
    },
    "hdw5jv7": {
      "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/hdw5jv7/",
      "text": "my current PhD students are 26, 32 and 43, but I've had as young as 21 and and old as 64",
      "author": "IntLawprof",
      "created": 1632349035,
      "upvotes": 2,
      "replies": {}
    },
    "hdvocgq": {
      "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/hdvocgq/",
      "text": "I started my PhD when I was 24 and defended a thesis at 27. One my colleague started at 23, and defended thesis at 27 as well. Most of other colleagues started after 26-30.\nAnd I know 2 really great scientists who started a PhD after 40.",
      "author": "MrBacterioPhage",
      "created": 1632337631,
      "upvotes": 1,
      "replies": {}
    },
    "hdwbgn4": {
      "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/hdwbgn4/",
      "text": "Does bring 45-50 make it harder to get into a program because you don’t have as long of a career ahead of you, or does your life experience help? I’ve been a software engineer 25 years and built platforms for the likes of ESPN, Microsoft and Shell Oil, but I’m pursuing history degrees.",
      "author": "ostrogotha",
      "created": 1632351666,
      "upvotes": 1,
      "replies": {
        "hdxx7jn": {
          "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/hdxx7jn/",
          "text": "it shouldn't, while I can only speak from my experience we don't really consider your career prospects when making admit decisions, its about how you'll be as a PhD candidate, after all if career prospects were factored in no one would be admitted to a history phd!\n\n'Life experience' is too variable to know how useful it can be, the main thing for you is to highlight that its relevant, especially as you're changing careers. So how does being a software engineer for 25 years make you a better PhD candidate in history?",
          "author": "IntLawprof",
          "created": 1632385840,
          "upvotes": 1,
          "replies": {
            "hdzsh6t": {
              "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/hdzsh6t/",
              "text": "I’m organized. I’ve run huge multi-team projects, I’ve completed multi-year projects, I’ve been both a cog and leadship.",
              "author": "ostrogotha",
              "created": 1632421351,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hdwfw6u": {
      "link": "/r/AskAcademia/comments/pte0s3/are_phd_students_really_older/hdwfw6u/",
      "text": "I started my PhD last year at 24 and was the youngest in my cohort. The others ranged from 25-30",
      "author": "Individual-Elk4115",
      "created": 1632353746,
      "upvotes": 1,
      "replies": {}
    }
  }
}