{
  "sid": "qjjtd5",
  "link": "/r/AskAcademia/comments/qjjtd5/nserc_masters_scholarship_has_anyone_here_applied/",
  "title:": "NSERC Masters scholarship, has anyone here applied before?",
  "text": "I want to apply to the masters NSERC scholarship:\n\n[https://www.nserc-crsng.gc.ca/Students-Etudiants/PG-CS/CGSM-BESCM\\_eng.asp](https://www.nserc-crsng.gc.ca/Students-Etudiants/PG-CS/CGSM-BESCM_eng.asp)  \n\n\nIt explicitely says that the online application will open 5 days before the official deadline which is Dec 1. What I don't know is if you should prepare something beforehand (e.g. fill in a form to submit as PDF, write down a proposal...) to be ready on those 5 days.  \n\n\nSaid otherwise, what should I start doing today to make sure that once the application opens I don't have nasty suprises like missing a 30 page long thesis proposal.",
  "author": "camilo16",
  "created": 1635662267,
  "updated": 1635779279,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hiqqqke": {
      "link": "/r/AskAcademia/comments/qjjtd5/nserc_masters_scholarship_has_anyone_here_applied/hiqqqke/",
      "text": "I applied and had one of these back in the day, before the Canadian common CV was a thing.\n\nIf I read that page correctly, the application system opens within 5 days of program launch, NOT the deadline.\n\nThe application instructions seem rather specific about what you need: https://www.nserc-crsng.gc.ca/ResearchPortal-PortailDeRecherche/Instructions-Instructions/CGS_M-BESC_M_eng.asp\n\nResearch proposal is only up to one page.\n\nI would say the other big thing that you can start on right away is the Canadian common CV. It's a standardized form for Canadian research funding and you'll have a lot of info put in there.",
      "author": "Vievite",
      "created": 1635668142,
      "upvotes": 6,
      "replies": {}
    },
    "hiqwm8o": {
      "link": "/r/AskAcademia/comments/qjjtd5/nserc_masters_scholarship_has_anyone_here_applied/hiqwm8o/",
      "text": "I’m applying to the same one, tho under the SSHRC. Applications are already open now, you can work on both that and your cccv. Application requires a 1 page research proposal, a short abstract of the proposal, the CV and two references. You’ll want to release invitations to your references well before the deadline. The website is old so it’s not very clear but there are actually instructions for both the application and the cccv that are very detailed, linked by vievite in the other comment.",
      "author": "aladuran",
      "created": 1635673249,
      "upvotes": 3,
      "replies": {}
    },
    "hitypuj": {
      "link": "/r/AskAcademia/comments/qjjtd5/nserc_masters_scholarship_has_anyone_here_applied/hitypuj/",
      "text": "I think you can start working on the forms but you can only submit 5 days before the deadline. If you go to NSERC online portal you should be able to select and start your application form. The submit button will be active 5 days before the deadline.",
      "author": "a_scientist_wannabe",
      "created": 1635728428,
      "upvotes": 1,
      "replies": {}
    }
  }
}