{
  "sid": "pd18t5",
  "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/",
  "title:": "Second choice in job",
  "text": "Any advice on how to handle things when you've been informed post-interview (which you thought went excellently well by the way) that they were impressed but think another candidate might be an even stronger fit and they're moving forward with that while still trying to accommodate your time constraints?",
  "author": "Juice2003",
  "created": 1630116724,
  "updated": 1634079465,
  "over_18": false,
  "upvotes": 35,
  "upvote_ratio": 0.91,
  "comments": {
    "hangn9c": {
      "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/hangn9c/",
      "text": "It means exactly what they said. You are second in the line for the job. If the job negotiations, e.g. salary, starting package, etc, fall through, they will offer the position to you. It happens quite often. Some universities go as far as having 2-3 candidates as 'reserves.'\n\nThe time constraints bit sounds like they are expediting any actions to ensure that they can come back to you within your time frame. This may also indicate how close you were to the first choice (i.e. it was not a clear-cut case on who was the better candidate of the two).\n\nThis is perfectly normal. If you like the position and it is offered to you, then go for it.",
      "author": "RecklessCoding",
      "created": 1630129368,
      "upvotes": 48,
      "replies": {
        "hanjo3j": {
          "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/hanjo3j/",
          "text": "Thank you. This really clarifies matters for me and it was very helpful!",
          "author": "Juice2003",
          "created": 1630131644,
          "upvotes": 7,
          "replies": {
            "hao2d24": {
              "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/hao2d24/",
              "text": "Exactly this. This is how I got my first position.",
              "author": "PandoraPanorama",
              "created": 1630147642,
              "upvotes": 10,
              "replies": {
                "hapnbrv": {
                  "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/hapnbrv/",
                  "text": "So they offered to keep me updated on the progress with the other candidate. I thought about it and decided I'd rather not be kept in limbo. So I asked them to keep me apprised of their final decision as soon as possible rather than have a step by step update. Not sure if I should have acted differently? There are differing views on this with folks telling me to call them and ask for what I lack that the other person is offering. I was thinking that I'd ask that question if they get back to me with an offer. Should I push more aggressively or take a step back? What did you do?",
                  "author": "Juice2003",
                  "created": 1630175717,
                  "upvotes": 1,
                  "replies": {
                    "hapu7x7": {
                      "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/hapu7x7/",
                      "text": "Telling you that you are second in line is not a step-by-step update. They do that so you can plan, e.g. defer a decision for another place, and for them to plan if they need to find a different reserved candidate. \n\nDo nothing. When the top-ranked candidate decides, they will let you know. Being 'pushy,' even if they give you the job won't get you anywhere other than making a bad impression on your future colleagues.\n\nAsking for feedback is not only reasonable, but it is also often mandated by law/internal policy. However, now, it is not the time to do that. You should ask *after* any decision has been made.",
                      "author": "RecklessCoding",
                      "created": 1630178761,
                      "upvotes": 5,
                      "replies": {
                        "hapxzhr": {
                          "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/hapxzhr/",
                          "text": "Thanks. That is some sound advice and aligns more with what my instincts tell me. I did feel that all that advice to give them a surprise call might end up not giving them a favorable impression and may only come across as desperate. I'll just continue with my search and try to stave off the fatigue!",
                          "author": "Juice2003",
                          "created": 1630180462,
                          "upvotes": 2,
                          "replies": {
                            "haq0w8q": {
                              "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/haq0w8q/",
                              "text": "best of luck -- i know how much of treadmills this is. But being 2nd choice is great. It means you match the criteria well, and you did interview well, so the chances are high that you will find something sooner or later.",
                              "author": "PandoraPanorama",
                              "created": 1630181781,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "haptcoa": {
                      "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/haptcoa/",
                      "text": "More or less the same as you. I did not ask for updates, but they also didn't offer. I was first told, after the interview, that I was number 2 on their ranking, and they would get in touch with me if number 1 falls through. I didn't think this would happen and was then very surprised when i got a call that exactly this has happened, and they would like to offer me the position.",
                      "author": "PandoraPanorama",
                      "created": 1630178369,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "han26h5": {
      "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/han26h5/",
      "text": "What does it mean that they’re still trying to accommodate your time restraints? It sounds like they’re offering the job to someone else.",
      "author": "RoyalEagle0408",
      "created": 1630120185,
      "upvotes": 29,
      "replies": {
        "han2kc8": {
          "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/han2kc8/",
          "text": "They're going ahead and processing someone else. I told them that I have a limited amount of time before I need to consider other options. Visa issues and such. So they need to move fast to get me if they want me. They're trying to see if the other one works out on my timeline so I'm still under consideration.",
          "author": "Juice2003",
          "created": 1630120404,
          "upvotes": 13,
          "replies": {
            "han2zaz": {
              "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/han2zaz/",
              "text": "If I were you, I’d consider other options- you’re not their top choice.",
              "author": "RoyalEagle0408",
              "created": 1630120641,
              "upvotes": 40,
              "replies": {
                "haoxvj4": {
                  "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/haoxvj4/",
                  "text": "Jobs aren't marriages. If it's a good job then who cares if they liked someone else better? 🙂",
                  "author": "jdfoote",
                  "created": 1630164827,
                  "upvotes": 14,
                  "replies": {
                    "haozigr": {
                      "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/haozigr/",
                      "text": "Sure, if you aren’t worried about getting deported. I just think OP should not risk this job not working out and not having a back up in place.",
                      "author": "RoyalEagle0408",
                      "created": 1630165551,
                      "upvotes": 4,
                      "replies": {
                        "hap3iyl": {
                          "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/hap3iyl/",
                          "text": "Ah - gotcha. I thought you were saying that people shouldn't take a job if you aren't the department's first choice.",
                          "author": "jdfoote",
                          "created": 1630167312,
                          "upvotes": 3,
                          "replies": {
                            "hapfhe7": {
                              "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/hapfhe7/",
                              "text": "No, not as a general rule, just in the case of OP.",
                              "author": "RoyalEagle0408",
                              "created": 1630172399,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "hapv91u": {
                          "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/hapv91u/",
                          "text": "Lol. No. I don't risk getting deported. I can always be on someone's rolls as an unpaid/volunteer staff. Its just that that option is not too desirable to me and my savings are not unlimited.",
                          "author": "Juice2003",
                          "created": 1630179226,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hap0152": {
                  "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/hap0152/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1630165777,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "han3fl3": {
              "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/han3fl3/",
              "text": "[deleted]",
              "author": null,
              "created": 1630120891,
              "upvotes": 11,
              "replies": {
                "han3x6r": {
                  "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/han3x6r/",
                  "text": "I don't need a visa right away so much as an offer. I'm on OPT with employment authorization and there's only a certain no. of days you can remain unemployed and in the country. I'm 2/3 of the way through it so they gotta rush.",
                  "author": "Juice2003",
                  "created": 1630121170,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "han3iqs": {
      "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/han3iqs/",
      "text": "It is out of your hands. At this stage, there is nothing you can do regarding this job but wait. But, given the job market, at least in my field and country, I would move forward with the expectation that you won't get this job and focus on alternate opportunities.",
      "author": "hartfordmove",
      "created": 1630120941,
      "upvotes": 10,
      "replies": {}
    },
    "haotwok": {
      "link": "/r/AskAcademia/comments/pd18t5/second_choice_in_job/haotwok/",
      "text": "Pretty standard, and they're just being transparent.",
      "author": "ph0rk",
      "created": 1630163070,
      "upvotes": 3,
      "replies": {}
    }
  }
}