{
  "sid": "pqdt80",
  "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/",
  "title:": "Help w/ Job Decision - Professorships at State Colleges vs. Universities",
  "text": "I was going to make this ELI5 but I'm thinking I might get more information here. I'm in my 5th and final year, preparing for graduation in the spring, and Assistant Professor job postings have started to appear. My advisor and I have started to discuss applying to some of these positions, and I've reached a point where I'm a little lost.\n\nWe looked at several job postings (field is education -- some are at state colleges, some are at universities), and I noticed when it came to the university positions, he mentioned that my responsibilities would primarily include publishing, doing research etc., and less about teaching (and the same goes for my ability to obtain tenure at these schools). He knows that I *really* enjoy teaching a ton, and so he has been trying to recommend other types of jobs, and has cautioned me about university jobs. I was lucky enough to get some experience as instructor of record the past 2 years and was nominated for an excellence in teaching award.\n\nThis doesn't mean I don't enjoy research. While at this school, I gained some experience working as a graduate research assistant on a large scale study, and then there's my own dissertation. Conducting research, collecting, data, and especially presenting at conferences is fun (at least in my opinion). My only dislike was revising papers over and over and over again.\n\nIt's also important to mention that in a very recent conversation with my advisor, he mentioned that his concern isn't my ability to be successful as a university faculty member -- he thinks I'm capable of doing the work. I was surprised (and happy) to learn that his primary concern was whether or not I'd be happy there.... He's not convinced that I would enjoy a high research-expectation job (because of the constant writing), and I'm not experienced enough to know whether or not I would. He told me to consider whether I'd be interested in a high research-expectation job. There's no such thing as a perfect job, so I might be open to it.\n\nSo, can anyone share some insight/guidance? I'm not sure what would be helpful here, but I think even if you're not in education I could use the advice. Perhaps the day to day of an assistant professor at a university vs a state college? Do university schools just not care about teaching? Do I ignore these positions? Am I barking up the wrong tree? Thanks in advance for your support and advice.",
  "author": "SoAsIPray",
  "created": 1631931177,
  "updated": 1634078952,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hdah1bc": {
      "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/hdah1bc/",
      "text": "If the Humanities tag is correct: Apply to all of them. The market is shit, and there's little room to be picky.\n\nAnd even the idea that \"University\" means there's a clear rule on research vs. teaching is silly. I was at a 2000 student university where research was meaningless. I'm at a university where teaching and research are both important - but it's certainly not R1, publish or perish, or research centric.",
      "author": "CerebralBypass",
      "created": 1631935647,
      "upvotes": 10,
      "replies": {
        "hdb3i48": {
          "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/hdb3i48/",
          "text": "Yea, I was hoping I had the right tag. Maybe a mod can correct it? Anyways, I think some of the schools I'm referring to are R1 and I think your advice about applying to stuff that I'm interested in is sound. My thinking was that it can't hurt to apply, and in the meantime, I could spend time deciding if I'd like a job that has high research/publication expectations.",
          "author": "SoAsIPray",
          "created": 1631951555,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hda9zcp": {
      "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/hda9zcp/",
      "text": "My experience has only been at a community college/state college so I can only speak to that. But the focus here is definitely on teaching. You can do research but it's not expected so much. More emphasis is put on service to the college. We certainly have a fair amount of professors who do research, present, etc.  \n \nSometimes people view community colleges as something \"less\" but I see their mission as something completely different and therefore appealing to the right kind of person. \n\nMy two cents. :)",
      "author": "bungchiwow",
      "created": 1631931913,
      "upvotes": 5,
      "replies": {
        "hdb2f43": {
          "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/hdb2f43/",
          "text": "I appreciate the insight!! I do think there's a right place for everyone. Question: what I'm learning (and please feel free to correct me if I'm wrong) is that these types of schools pay much less than those schools that expect a ton of research out of you. That is, it seems like teaching-focused jobs are synonymous with less pay, and the assistant professor positions at these universities pay more, but require far more research. Do I have that right? \n\nThere needs to be some kind of balance. As much as I love teaching, I would like to be compensated fairly well. Are there any kinds of schools that offer a balance and still pay well?",
          "author": "SoAsIPray",
          "created": 1631950637,
          "upvotes": 2,
          "replies": {
            "hdborhp": {
              "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/hdborhp/",
              "text": "That is definitely not a universal. I make more at my CC than regular people at the two main alternatives in my city: the local state college and the fancier private university (endowed professorships for example at the latter pay more of course). I also make more than people at my level at the R1 state university (in a smaller town) and have never had a wage freeze (not true for most of these others). Not all CCs pay well but it is very dependent.",
              "author": "mrshmllw",
              "created": 1631968103,
              "upvotes": 2,
              "replies": {}
            },
            "hdceh83": {
              "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/hdceh83/",
              "text": "I would say my cc pays a living wage for sure but I would bet the two major universities that we feed into (about 45 minutes away in a large city) probably do pay better.  You may be interested in looking at really large community/state college systems. My college would probably fall on the medium size of the spectrum but there are some systems in my state that have 50,000-60,000 students. I'd bet they'd pay more.",
              "author": "bungchiwow",
              "created": 1631980604,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hdaz874": {
      "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/hdaz874/",
      "text": "I live in a different country, but work (i.e. do research) and have a teaching obligation and can only tell you how it feels on the \"other end\" of a job like this. For me (and most people in my team), teaching is great, but it takes a lot of time out of our research time. We obviously all need to publish (not tenured, even the tenured ones are under that pressure) and the less you have to teach, the better. I love teaching, but it takes so damn much time to prep, answer emails, read papers, teach... We dont have that distinction between \"research job\" and \"teaching job\", we all need to do both, but many people have priorities and that shows up in the social climate.  If you like teaching go for a job that has a clear number of hours reserved for teaching and you dont end up in a job that already has the atmosphere to where teaching is not valued that much, because its just something that stops you from publishing, because it takes time away from that. \n\nThe atmosphere is just different, depending on the focus of the University/College. Apply for all, but ask about how many hours you have to teach and what the expectations on publications are. And if there is an option to teach more in one year and less in the other so you can get research done. So my advice would be to ask and then try to find somewhere that values/prioritizes teaching over research. So aks when applying/being interviewed where the priorities are.",
      "author": "Crona_something",
      "created": 1631947991,
      "upvotes": 2,
      "replies": {
        "hdb2sks": {
          "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/hdb2sks/",
          "text": "Thanks for sharing. What I learned from reading this is that if someone (or the institution) cares more about research, then teaching actually gets in the way (and can feel kind of annoying to do)?",
          "author": "SoAsIPray",
          "created": 1631950955,
          "upvotes": 1,
          "replies": {
            "hdc1zjc": {
              "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/hdc1zjc/",
              "text": "Yes, sort of. It impacts how the departments (or the team you are working with) speaks about teaching. I have no doubt that everyone in my team likes teaching to some degree, but it is not the priority and the prep (especially for newbies) can take longer and add a lot of stress, because it feels like it is not as important as publishing and if you have to prep for class, you cant write papers. Ask how much time should be set aside for both and how important each of the tasks is in this job and then decide if this is an environment you would like to work in.",
              "author": "Crona_something",
              "created": 1631975010,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hdbqy4v": {
      "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/hdbqy4v/",
      "text": "The division between college and university isn’t really useful for you here, the Carnegie classification is more useful. An R1 position is going to be more research intensive, but there are non-tenure track jobs or teaching track jobs at R1s, as well. An R2 will still have research expectations, but a higher teaching load (maybe 2-2). Once you get to masters and below universities, you are going to be focused more on teaching, but with some research expectation. Community college professors will teach more and only research if they want.\n\nI am at a regional comprehensive, it is still a university. We deliver masters programs, but the bulk of students are working on their undergrad degrees. I teach a 3-3 and make a good salary. I am part of a larger state system. I had a classmate who got a job at the flagship R1 in the same system at the same time. He taught a 2-1 and made about 20k more than me to start. We had the same benefits package though and I lived in a lower cost area.",
      "author": "profpetitfours",
      "created": 1631969347,
      "upvotes": 2,
      "replies": {
        "hdcayet": {
          "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/hdcayet/",
          "text": "Thank you for your thoughtful post. Would you recommend applying for both types of jobs then?",
          "author": "SoAsIPray",
          "created": 1631979088,
          "upvotes": 1,
          "replies": {
            "hdcb5wj": {
              "link": "/r/AskAcademia/comments/pqdt80/help_w_job_decision_professorships_at_state/hdcb5wj/",
              "text": "If there just aren’t a lot of jobs in your field, you should probably apply to everything. You might find that you get a bite, at the end of the day you don’t have to take a job even if you get it.",
              "author": "profpetitfours",
              "created": 1631979180,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}