{
  "sid": "qtoitv",
  "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/",
  "title:": "What are your podcasts of choice?",
  "text": "I really like to have background noise so normally have podcasts on a low volume whilst I work.\n\nI normally listen to quite a narrow band of podcasts \n\n1. Stuff you should know\n2. Gus and Eddy (until the recent drama/revelations about Gus)\n\nI've seen people go mad for JRE etc and having casually listsened to a couple of his episodes I kind of get it but I want something less controversial.\n\nWhat do you listen to?",
  "author": "Weekend_metalhead",
  "created": 1636891703,
  "updated": 1637180901,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.82,
  "comments": {
    "hkkywfc": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkkywfc/",
      "text": "Ologies with Ali Ward is the best!",
      "author": "benevolentgoat",
      "created": 1636894174,
      "upvotes": 14,
      "replies": {
        "hklyg0a": {
          "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hklyg0a/",
          "text": "Omg yes this was going to be my first answer. I love this podcast, and now I have so many awesome random facts about bats and squids and fire",
          "author": "grossgusting",
          "created": 1636910773,
          "upvotes": 2,
          "replies": {}
        },
        "hkl9mx0": {
          "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkl9mx0/",
          "text": "Yes! I haven't been able to listen much lately but love me some Ologies! The episodes can be fun assignments for students, too. Especially teaching intro undergrad classes.",
          "author": "PossibleProject6",
          "created": 1636899897,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkl0s5j": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkl0s5j/",
      "text": "RadioLab is my new jam",
      "author": "geogle",
      "created": 1636895249,
      "upvotes": 5,
      "replies": {}
    },
    "hkl7x5a": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkl7x5a/",
      "text": "You’re Wrong About",
      "author": "Fear_n_trembling",
      "created": 1636899011,
      "upvotes": 6,
      "replies": {}
    },
    "hkkwdmb": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkkwdmb/",
      "text": "I go for freakonomics, This American Life and Bad People. Different things for different moods. I have a bunch of others that I dip in and out of but those are the regulars. \n\nLouis Theroux's lockdown interviews were quite entertaining and the Common Descent is great for insomnia (sorry guys, you just have a great rhythm for sleeping).",
      "author": "ACatGod",
      "created": 1636892567,
      "upvotes": 4,
      "replies": {
        "hkm34hw": {
          "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkm34hw/",
          "text": "I go for Freakonomics as well; just started branching out into the new spin-off Freakonomics MD, too.",
          "author": "downwardsquirrel",
          "created": 1636912681,
          "upvotes": 3,
          "replies": {
            "hkm4sfw": {
              "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkm4sfw/",
              "text": "Yes. Some of those are very good. \n\nThere's also some fantastic documentaries on BBC sounds. The cryptoqueen and Fake Heiress were excellent. Not so great for background noise though as they were quite engrossing.",
              "author": "ACatGod",
              "created": 1636913328,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkkzlzy": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkkzlzy/",
      "text": "The Ongoing History of New Music by Alan Cross is my favourite podcast of all time. It's a Canadian show that originated as a radio show that I grew up with. It focuses on alt rock but dabbles in music in general, especially since alt rock is so heavily intertwined with basically every other genre except maybe EDM and hip-hop.\n\nThe episodes are short, unlike most podcasts that like to run 1-2 hours, but they're so interesting and of such high quality you won't mind the wait.\n\nDon't be concerned with the \"new\" part of it, there's no limitation to any timeline.\n\nHere's some sample subjects: What does the 'Foo' in 'Foo fighters' mean? (Nothing, it was completely random and meaningless); What the hell was the story with Sid Vicious? (He didn't actually know how to play and had a stagehand play all his music, also he was probably the most self-destructive musician of all time); and the various hobbies of musicians (Did you know, a member of the Offspring has a Ph.D?)\n\nRandom fun fact: his name is in the liner notes for a Muse album that they did without his consent or knowledge, but he's cool with it.  \n\n\nedit: just saw the sub this was posted in and you probably are asking about academic podcasts. I'll leave it here anyway. You can consider it educational for music academics?",
      "author": "Hardcore90skid",
      "created": 1636894551,
      "upvotes": 4,
      "replies": {
        "hklsydq": {
          "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hklsydq/",
          "text": "I used to listen to this in the 90s and early 2000s (I think - long time ago!). Can attest to the high quliity of content/production! I had no idea it was still around in podcast form.",
          "author": "OttawaExpat",
          "created": 1636908530,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkkx31y": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkkx31y/",
      "text": "I will go with conan o’brien needs a friend",
      "author": "adeptbr",
      "created": 1636893030,
      "upvotes": 3,
      "replies": {}
    },
    "hkm41qi": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkm41qi/",
      "text": "Do radio shows that I've listened to via podcast distribution count? If so, Under the Influence; a show about marketing and the advertising industry with Terry O'Reilly. Fascinating stuff.",
      "author": "BarackTrudeau",
      "created": 1636913051,
      "upvotes": 2,
      "replies": {}
    },
    "hkpg1mm": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkpg1mm/",
      "text": "Hidden Brain - NPR",
      "author": "Chance_Assumption_93",
      "created": 1636973734,
      "upvotes": 2,
      "replies": {}
    },
    "hklysq7": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hklysq7/",
      "text": "This Paranormal Life is a great comedy podcast! Two Irish dudes investigating ufos, ghosts, curses and deciding if they’re real or not. One of my all time favorites.",
      "author": "grossgusting",
      "created": 1636910918,
      "upvotes": 1,
      "replies": {}
    },
    "hkm3pea": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkm3pea/",
      "text": "I usually listen to: Criminal, Freakonomics (+ Freakonomics MD), Hidden Brain, Serial, Brain Science with Ginger Campbel, and Dark History for more learning/serious stuff.\n\nThen I'll listen to The Double Cleanse Podcast or the Bald and the Beautiful with Trixie and Karya for fun/laughter.",
      "author": "downwardsquirrel",
      "created": 1636912915,
      "upvotes": 1,
      "replies": {}
    },
    "hkm49oc": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkm49oc/",
      "text": "Very Bad Wizards or\nCult Liter (true crime)",
      "author": "MgBog",
      "created": 1636913137,
      "upvotes": 1,
      "replies": {}
    },
    "hkmdp9p": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkmdp9p/",
      "text": "Lately I’ve been trying to pick up Korean. So I’ve been listen to this one simply called “learn Korean with David.” \n\nIf I wanna listen to something just to laugh at and get some insight on other cultures and communities I like listening to Trash taste.",
      "author": "Sylvaintheg",
      "created": 1636916580,
      "upvotes": 1,
      "replies": {}
    },
    "hkmshbv": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkmshbv/",
      "text": "Well There's Your Problem\n\nIt's a rambling and irreverent dark comedy podcast about engineering disasters. I love the show very much. They use humour to deal with the awfulness of the systems that lead to the disasters in a way that I find very funny while still very humane.\n\nThe upcoming episode will be about the Tacoma Narrows Bridge Disaster!",
      "author": "Jagulaari",
      "created": 1636922100,
      "upvotes": 1,
      "replies": {}
    },
    "hknt3pw": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hknt3pw/",
      "text": "The only podcast i listen to is Arena Craft Podcast, it's about Magic: the Gathering Arena, a digital version of a card game.",
      "author": "Few-Amount-1595",
      "created": 1636937437,
      "upvotes": 1,
      "replies": {}
    },
    "hkq7u6k": {
      "link": "/r/AskAcademia/comments/qtoitv/what_are_your_podcasts_of_choice/hkq7u6k/",
      "text": "I like Science Sort Of. It’s fun to listen to different episodes on different science subjects that are not my  field. Plus the revolving cast of guest hosts is always fun and entertaining. \n\nI also enjoy In Defense Of Plants which is an ecology and botany podcast. \n\nRecently I’ve been working my way through the Huberman Lab podcast. Which is a human bio/health/medical podcast.\n\nIf I need something shorter I pull up The Magnus Archives which is a very excellent horror/mystery fiction podcast. I would highly recommend only listening to this during daytime hours when other people are around, because it’s really good at being a horror podcast.",
      "author": "translucent_spider",
      "created": 1636989658,
      "upvotes": 1,
      "replies": {}
    }
  }
}