{
  "sid": "apvdix",
  "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/",
  "title:": "Sexually harassed by postdoc supervisor and forced to quit.",
  "text": "I was forced to resign from a postdoctoral position in a major research institute in the US after being sexually harassed by my postdoc PI. It's been 4 months since I resigned, but I'm still struggling to move on from what happened.\n\nIt started a couple of months into my postdoc. He started leering and staring at me in public and moving too close to me during one-on-one meetings. At one point, I moved away from him slightly when he started getting too close, which made him really angry. After this incident, I tried to keep the door open when we have our one-on-one meetings. He decided to get back at me for doing this by criticizing my work in a loud voice. He also made everyone believe there was something going on between us. I stopped talking to him during social gatherings and generally stayed away from him. In retaliation to this, he started humiliating me in group meetings and putting down my suggestions. It affected my self-esteem so much that I stopped speaking up in meetings altogether. He brought up my lack of participation in meetings during a progress review. I made excellent progress at the beginning of my postdoc and had my first manuscript ready in a matter of months. But after the harassment started, I got so depressed that I couldn't focus on my work and my progress suffered.\n\nAfter putting up with his abuse for over a year, I reached my breaking point when he invited me to go to a conference with him. It was a small conference with several interesting talks, but it was on the other side of the country and there was hardly anyone I know attending it. So I didn't want to take the risk. I made an excuse about a prior commitment, but he didn't buy it. He got angry and started to bully and harass me even more. I was so depressed at this point that I tried to commit suicide. After several days in the ICU and a week in the hospital, I recovered, at least physically. I went back to work a week later. I didn't tell anyone what happened, but my postdoc PI made it clear that he knew. He mentioned in passing that he has access to anyone's medical record, and in another instance, made a snide comment about me trying to kill myself for my work.\n\nI handed in my resignation a couple of months after this. I wasn't in a place to apply for jobs let alone go for interviews while I was there. So I quit without having a job lined up. I also started seeing a therapist around this time and I think my mental health has somewhat improved since then. However, I'm still so traumatized by this whole experience that I can't seem to bring myself to apply for jobs. Every time I see a job I could apply to, I get paralyzed with fear that the same thing will happen. How do I move on from this and go back to work? Any advice or suggestions will be greatly appreciated.\n\n&#x200B;\n\nUpdate 1:\n\nThank you all for your comments and kind words of encouragement. I really appreciate it.\n\nAbout the title IX comments, the postdoc before me left under similar circumstances. I was told by someone in the lab that she did try to make a complaint. Her contract was not extended after she did this and she had to leave. So the institute is aware of his misconduct. They just don't want to do anything about it. I did get asked questions at the exit interview, but it was conducted by someone who works for my PI. There was no way she would have done anything about it except maybe tell him what I told her. So there was no point in saying anything to her. But I just want to move on from all this. I really want to be able to go back to work.\n\n&#x200B;\n\nUpdate 2:\n\nI just want to say, I really appreciate all your comments, especially the ones who shared similar stories. I'll be honest here. This is the first time I've ever posted anything on Reddit and I just can't believe how helpful you guys have been. Thank you so much!\n\nI also have happy news to share. I finally got enough courage to get back out there. I already have one offer (went for an interview yesterday), one lead from a friend and several others lined up!!! There is hope after all!\n\n&#x200B;\n\nUpdate 3:\n\nI got a job at a biotech company and am doing really well. I was lucky I guess because I was only out of work for a short time, and the new job is in a city I always wanted to live in. \n\nSo for anyone out there going through what I did, all I have to say is: you can overcome it! It will take time and you may struggle with PTSD as I did, but it will eventually heal, and you will be able to go on with your life. Don't put up with abuse. Get out of such situations before it affects your mental health. Try your best to make a planned exit; that is the only thing I would have done differently. But if you can't because of the harm your current situation is doing to your mental health, you can still leave without a job lined up and land on your feet again.",
  "author": "harassDoc",
  "created": 1549990375,
  "updated": 1634080628,
  "over_18": false,
  "upvotes": 225,
  "upvote_ratio": 0.95,
  "comments": {
    "egbji3s": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbji3s/",
      "text": "Title IX\n\nTitle IX\n\nTitle IX",
      "author": "solkim",
      "created": 1549994167,
      "upvotes": 183,
      "replies": {
        "egbsc0q": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbsc0q/",
          "text": "To clarify for OP: Your university has a Title IX compliance officer. I bet that office even has a web-based reporting system. You should do this today. ",
          "author": "Kornpett",
          "created": 1549999997,
          "upvotes": 69,
          "replies": {}
        },
        "egbw8ll": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbw8ll/",
          "text": "This. The title IX compliance officer at your university has more experience evaluating these cases than you can imagine. You may think that your situation may look ambiguous to an outside party, but the officer will size it up pretty quickly after they do an investigation and tell you exactly where you legally stand. You may be shocked how cut-and-dry they consider your situation when your pattern perfectly matches previous cases of harassment. Don't try to solve this on your own. Get the professionals involved.",
          "author": "psychguy",
          "created": 1550002577,
          "upvotes": 40,
          "replies": {
            "ege0rvf": {
              "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/ege0rvf/",
              "text": "Title IX officers lack training and education in law most of the time. They also act on behalf on the institution many times and have no legal impetus to collect all necessary information to make a decision. At best, the guy will get fired. At worst, nothing will happen.\n\nA lawyer, on the other hand, has far more training, education, and experience in exactly these matters and is there to work on behalf of the person that he or she is representing. Lawyers also have a legal mechanism to collect *all* relevant information. IANAL but I cannot imagine a more clear-cut case where monetary damages are awarded, the guy gets fired, and the university gets shamed for not taking action sooner. At worst, the university makes the news for their incompetence. I can think of zero scenarios where Title IX helps more than a lawyer. ",
              "author": null,
              "created": 1550074119,
              "upvotes": 3,
              "replies": {
                "ege6nha": {
                  "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/ege6nha/",
                  "text": "That is a good perspective to keep in mind. I have used our Title IX officer on multiple occasions, and she has done a stellar job at representing the student's interest. Our university may not have a typical culture, however.",
                  "author": "psychguy",
                  "created": 1550077986,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "egbzgk6": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbzgk6/",
          "text": "Do not assume title IX will work on your behalf. Often their purpose is to flag and squash potential lawsuits. Not to protect accusers and punish perpetrators.\n\nConsider instead reporting this, with as much documentation as possible, to (1) funding agencies, and (2) journalists. Buzzfeed, for instance, has been gathering and occasionally publishing articles on harassment in academia. The National Science Foundation, for instance, has steep consequences for PIs and institutions who fail to prevent and punish sexual harassment. I suspect other agencies are similar.\n\nEdit because: I see you probably get funding from NIH. I'd contact them with all documentation including the HIPPA violation evidence. ",
          "author": "andropogongerardii",
          "created": 1550004651,
          "upvotes": 43,
          "replies": {
            "eh0m2qx": {
              "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/eh0m2qx/",
              "text": "That’s so true!!! I was a victim of misappropriation of my intellectual property (my entire phd thesis) by my supervisors and once I went through the university channels to ask them to ensure compliance with the policy, it only triggered them to create a task force to squash me and it got to a point that I decided after weeks of issues to just quit and get out of the “hotel california”! I have thoroughly documented every single action they took, but I have no idea whatsoever where to start sharing with the media..I’m afraid the media I contact may have ties with the university..",
              "author": "Foreign_Membership",
              "created": 1550821096,
              "upvotes": 2,
              "replies": {
                "ehcd6r8": {
                  "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/ehcd6r8/",
                  "text": "Ugh. I'm so sorry to hear that. It's really painful. Hopefully you're in the same place as me now or very soon. I rarely think about that period in my life, and when I do it's with a lot of breathing room and no visceral pain. ",
                  "author": "andropogongerardii",
                  "created": 1551211559,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "egfgnxg": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egfgnxg/",
          "text": "I have news for you when it comes to Title IX not doing its job: [http://www.dailycal.org/2019/02/11/an-institutional-and-pervasive-problem-title-ix-documents-reveal-wave-of-sexual-misconduct-cases-at-uc-santa-cruz/](http://www.dailycal.org/2019/02/11/an-institutional-and-pervasive-problem-title-ix-documents-reveal-wave-of-sexual-misconduct-cases-at-uc-santa-cruz/)",
          "author": "prettyfly_2020",
          "created": 1550110505,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "egbk3kt": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbk3kt/",
      "text": "First off, all my condolences. That sounds like an incredibly toxic work environment. I am glad you are seeking therapy and hopefully recognizing that you are not at fault in this situation as it was a clear abuse of power. At any reasonable job or situation with an advisor/supervisor, you should not have to deal with something like this.\n\nSecond, if you can and are mentally stable enough to do so, you should make a complaint to his superiors. I know there is a good chance it won't result in him being punished, but it does potentially create a paper trail for him being terrible to the people working under him. If you don't feel comfortable doing that, please take care of yourself!\n\nThird, it seems rather odd that he can access any and all medical records for those who work for him. Granted, I'm in the humanities which have different requirements by employers than someone working in STEM, so I might be out of the loop. No matter, it is incredibly unprofessional and possibly illegal to reference or punish someone for previous/current medical issues. Your medical issues are personal and should not affect your workplace barring your inability to use equipment. We all take tumbles, contract pneumonia, get afflicted with cancer, etc. \n\nFourth, and finally, I hope therapy helps you with this issue. Your Postdoc supervisor was in the wrong and seems like a predatory asshole. When looking for another job, you probably won't find someone that is as bad. Take your time and be careful and I wish you all the best.",
      "author": "Boudicca13",
      "created": 1549994562,
      "upvotes": 39,
      "replies": {
        "egbla7j": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbla7j/",
          "text": "Thanks for you comment. I'm in medical research. He has access to medical records/patient data because of his work. I agree, I think it's definitely unprofessional and possibly illegal.",
          "author": "harassDoc",
          "created": 1549995348,
          "upvotes": 33,
          "replies": {
            "egbn8tf": {
              "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbn8tf/",
              "text": "Accessing an employee's medical records for the purpose of bullying them is not only an egregious abuse of power, it's a HIPAA violation, possibly in violation of labor laws, a damn good reason for your Institutional Review Board to consider revoking his research permissions, and a damn good reason (if applicable) for your state's medical board to suspend his license and/or levy a 4- or 5-figure fine.\n\nI know from personal experience that holding people in positions of power accountable is scary, but him accessing your medical records may make your case much easier. It's obviously your decision about what you feel comfortable pursuing (these things do take a lot of time, effort, and emotional energy), but I just want you to know that from one victim of sexual harassment and retaliation to another, I hope you burn this mother fucker to the god damn ground. \\*Hugs\\*",
              "author": "MidnightSlinks",
              "created": 1549996630,
              "upvotes": 61,
              "replies": {
                "egbukgd": {
                  "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbukgd/",
                  "text": "I second this. They should also be able to find evidence for this via his computer (or lab computers) and see which records he was accessing.",
                  "author": "GWFKegel",
                  "created": 1550001474,
                  "upvotes": 14,
                  "replies": {}
                },
                "egc1j76": {
                  "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egc1j76/",
                  "text": "I cosign this as well. I've never had to deal with sexual harassment and I have no idea what OP went through. I understand if she wants to just move on, but I feel like she really should say something, if for no other reason than to stop it happening to the next person. Accessing anyone's medical record without the purpose of care in the line of duty is illegal. ",
                  "author": "zero2hero2017",
                  "created": 1550005992,
                  "upvotes": 3,
                  "replies": {}
                },
                "egd2vp5": {
                  "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egd2vp5/",
                  "text": "This! OP please take this motherfucker down so he can’t hurt anyone else.",
                  "author": "piconutz",
                  "created": 1550034279,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "egbn8j6": {
              "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbn8j6/",
              "text": "Again, I'm not in the field so I don't know myself. If you are out of his influence, I think you should consider speaking to his superiors or a hospital he is affiliated with. Please consider reporting him if you are able/you personally feel up to it. \n\nIf it affects your potential job search, also be careful. I wish you all the best and hopefully you can one day be an advocate for other students or patients.",
              "author": "Boudicca13",
              "created": 1549996624,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "egbh5dp": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbh5dp/",
      "text": "I’ve had a similar experience with a supervisor, though definitely not as bad as yours, where I was being asked out, commented on and approached in a way that had nothing to do with how a supervisor should treat their student. I sat it out, secretly taped every meeting we had and got my degree, though it gave me a lot of stress. It’s not just the fact that they’re interested in you but more the inequality of power: he had the upper hand and could’ve cost me my degree if I went against him. I had to balance a fine line between making sure that he knew I wasn’t interested, and not pushing too far to make him fail my project (and me). It did leave a mark on me. \n\nI went on to pursue another degree that involved intense supervision. Like you, I kept thinking about the other supervisor and not wanting to end up in the same place. I had a number of conversations prior to us working together that gave me an idea of the type of person he was. I made sure that I was clear from the start that I had no personal interest in this person. I did not answer personal questions, and didn’t ask any. I recorded our first few meetings, but asked him beforehand (he was perfectly fine with it), and made sure that I knew who the confidentiality advisor in the department was. We ended up becoming more friendly as time went on, but it was because I opened up more as I got to know him. It’s ended up being a good working relationship and kind of restored my faith in supervisors. I hope you’ll end up having the same experience. \n\nThings I could recommend: if possible, have a few meetings or talks in which you get to know them a bit. Make your boundaries clear. If possible, contact previous students or people he worked with and ask what it was like (my inappropriate supervisor’s had student quit, rumour goes that he cheated on his wife with a student, other students he was supervising at the same time as me asked me careful questions about his conduct, wanting to see if he was overall inappropriate with me too). If you’re uncomfortable at the start, check out those who offer confidential guidance in the department (even if it’s for PGR and UG students), and perhaps take notes or tape meetings (you could say it’s due to having a less than perfect memory, which is what I did). \n\nNot all supervisors are like the jerk that you had, they sound beyond vile. You deserve to get back out there, do great work and see that he is a minority. I hope it works out for you! ",
      "author": null,
      "created": 1549992598,
      "upvotes": 15,
      "replies": {
        "egdtzkv": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egdtzkv/",
          "text": "Thanks for your suggestions. They were really helpful, especially your suggestion to ask around. I think a lot of people do know about him, and if I had asked around, I might have found out about this. Some people even warned me at the beginning of my postdoc. At least, I see now that they were trying to warn me. What seemed like random/odd comments at the time, make perfect sense now.",
          "author": "harassDoc",
          "created": 1550069233,
          "upvotes": 1,
          "replies": {
            "egdvbeg": {
              "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egdvbeg/",
              "text": "I'm glad!I had the same. While I was in the middle of all this, I had a classmate notice that his name was on my paperwork on the table, and told me to be careful. Her friend had quit her program a few months before finishing and refused to address the reason why (but it was dissertation season and he was her supervisor). He was apparently really inappropriate in social events (e.g. making sexual comments, getting drunk and vomiting in the department common room) and there were rumours about his divorce (which he openly discussed, bitterly, with his students including me). I personally got approached by others who had questions about him too. I think it's worth asking previous postdocs how they experienced his supervision (in your case, especially female students or colleagues). If I was approached by someone who'd asked me anything about how my 4 supervisors were, I'd be happy to report my experience with them.\n\nI noticed that someone else mentioned why one wouldn't report incidents like yours (or mine). I don't know about you, but I'd seen other students complain about their supervisor or teachers that were being swept under the rug. The department knew about that specific lecturer (not my supervisor) and his racism, sexism and inappropriate behaviour but as he was tenured said they couldn't do anything without really solid proof. After seeing this happen to someone else (who ended up becoming the black sheep in the department) I didn't report anything either, not wanting to risk my own reputation and knowing they didn't do anything. And this was a Top 20 worldwide institution with a great reputation. So don't beat yourself up for not reporting it, reporting inappropriate behaviour by someone in a powerful position isn't as easy as some would like to think it is (or has become).\n\nBut I hope the advice will be helpful to you, and that you can make a fresh start somewhere else where you feel comfortable!",
              "author": null,
              "created": 1550070269,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "egbg7df": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbg7df/",
      "text": "Not trying to criticize, as I know internalizing, self-blame, and silence is a wall hard to overcome for victims, but did you go over his head, and file a complaint? It seems as tho this was going on during the Me Too movement, which has had a dramatic impact on the sexual harassment scene. I imagine any University operations facility worth their salt would be handling complaints more seriously. Usually if you're afraid of ramifications from Department Heads, or even the Dean, they have intermediaries set in place that have no loyalty to the institution, or the students, an ombudsman. If it goes unreported, the behavior will go unchecked when the next attractive grad student comes along. I'm sorry for the pain, and mental anguish you've endured, and  hope you find a resolution, take care. ",
      "author": "crewchief227",
      "created": 1549991954,
      "upvotes": 51,
      "replies": {
        "egbq6lu": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbq6lu/",
          "text": "I’ve reported a professor before and also watched a lot of others report or try to report and I’ve never seen a case that worked out in favour of the students. Mine was the closest to “good” and it was still horrible, retraumatizing, and problematic. \n\nI say this not to discourage anyone from reporting, because I do think reporting is important, but to make sure people know what they’re getting into if they decide to report.",
          "author": "eyecontactishard",
          "created": 1549998553,
          "upvotes": 25,
          "replies": {
            "egbqpas": {
              "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbqpas/",
              "text": "There've been a couple of high-profile cases of professors getting in trouble for this kind of thing and being forced to step down in recent years.  So, some progress is being made...",
              "author": "dampew",
              "created": 1549998900,
              "upvotes": 8,
              "replies": {
                "egcqib8": {
                  "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egcqib8/",
                  "text": "I know current cases right now where professors are suing people who made accusations against them and winning, despite being serial abusers. I know *multiple* cases like this. It might be getting a bit better, but the overall atmosphere is toxic and these problems runs deep.",
                  "author": "eyecontactishard",
                  "created": 1550024281,
                  "upvotes": 2,
                  "replies": {
                    "egdt2kt": {
                      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egdt2kt/",
                      "text": "@eyecontactishard: Thank you so much for speaking up about your experience with trying to make a complaint. I know of several cases like this too, some of them, in the very institute I was in. It's really important to make sure people know what they're getting into when they decide to report.",
                      "author": "harassDoc",
                      "created": 1550068491,
                      "upvotes": 2,
                      "replies": {
                        "egdxwop": {
                          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egdxwop/",
                          "text": "Thank you. I’m wishing you the best. 🖤",
                          "author": "eyecontactishard",
                          "created": 1550072152,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "egbrlji": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbrlji/",
      "text": "I'm so very sorry this happened to you. I'm sure you know already, but it is categorically not your fault. Your \"supervisor\" is a predatory, abusive ass who should be drummed out of academia on a rail. You deserve to be in a position where you are respected and treated professionally. Well done on you for getting out of that toxic environment and seeking therapy.\n\nIf you Google \"\\[your university\\] + Title IX\" you should quickly find a list of resources for reporting sexual harassment, with a list of contact information for people and departments whose job it is both to help you and to bust this creep. The university probably also has a women's center, LGBT center, or the like, where there will be some people you may feel more comfortable talking to. While it's totally up to you whether you choose to report, consider that you are very likely not the only person this creep has taken advantage of, and will probably do so again until he gets busted. Predators have patterns and there's never just one victim.\n\nAs for moving on, you're absolutely doing the right thing by getting professional counseling. Having post-traumatic stress is perfectly normal and understandable. Give yourself time to heal, if you need a job maybe consider a low-stakes position for a bit before moving back to your field. You will grow past this and become stronger in the end. ",
      "author": "MisterSmeeee",
      "created": 1549999506,
      "upvotes": 10,
      "replies": {}
    },
    "egbfton": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbfton/",
      "text": "I don't have any advice for you (currently a master's student) but I just wanted to say that I'm sorry that happened to you. It sounds like you've already made great decisions by getting out of that environment and seeking therapy. Stay strong and I bet it'll get easier with time. I'm sending you kind thoughts. ",
      "author": "cshot95",
      "created": 1549991692,
      "upvotes": 18,
      "replies": {}
    },
    "egbmvxc": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbmvxc/",
      "text": "Don’t suffer in silence. Document as much as you can, save emails, etc.",
      "author": "TakeOffYourMask",
      "created": 1549996392,
      "upvotes": 8,
      "replies": {}
    },
    "egbu2wy": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbu2wy/",
      "text": "I'm sorry you're having to go through this. It's awful every single time it happens.\n\nI'm a pretty burly dude, so I don't have to deal with shit in the same way. But, I do have close girl friends in academia who've gone through similar stuff. Here's what they'd say (based on my talking with them).\n\nFirst, get yourself healthy. Lots of my friends have PTSD from assaults and harassment. And they seek therapy at least once a week. If money's an issue, look around for therapists that have discounts for people below certain incomes (as I imagine you are since you lost your job). Also, while I can't recommend it unqualified, some people find group therapy or survival groups very helpful. The point is you gotta get help. This shit is acidic and will eat at you if you don't find a way to neutralize it. Unfortunately, this happens a lot. So, there are people out there who can help you through this. My friends would say not to feel so ashamed that it prevents you from reaching out to an organization or person you trust.\n\nSecond, if you feel like you're safe enough and have enough strength, do like other responders have said: find the Title IX office at the university and file a complaint (if in the US). Only if you can withstand the pain: try to find documentation in emails or even ask lab partners if they could say something (usually, though, once they start the investigation, they'll ask for names of people who might've seen something. So, if it's too painful to talk with people, don't worry too much). Try to get the medical record from your suicide attempt. Basically once a complaint opens in a Title IX office, they're going to do an investigation. And in order to bring disciplinary measures down on the faculty member, they're going to need proof or corroborating reports. Unfortunately, that ends up demanding more of you (who didn't do the crime), and many times it can end with lenient discipline (if there's not sufficiently strong evidence to actually fire the professor with tenure).\n\nLastly, be very prudent before going to social media. I know women who were counter-sued for slander and libel for going public with complaints. That doesn't mean that you can't put them on blast. You totally can. (This isn't legal advice.) But be ready for the blow back if you go that route. It might be worth seeing if your university (or a local university) has a legal clinic for sexual assault (or if something like a women's organization does). They'll know exactly how to proceed and help at little to no cost.\n\nI'm really sorry I can't be more helpful than this. And I'm sorry you're having to deal with this. Please take care of yourself and be very kind to yourself as you heal and try to find a way to move on.",
      "author": "GWFKegel",
      "created": 1550001155,
      "upvotes": 6,
      "replies": {}
    },
    "egbguep": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbguep/",
      "text": "I'm terribly sorry you had to go through this and unfortunately what is more sad is that I'm not surprised a male PI (supervisor) did this. I agree that you should still file a report. You have title IX protection legally and this needs to be on his permanent record. Have you thought about trying to find positions in female PI labs? This might at least alleviate the fear of having a male PI? ",
      "author": null,
      "created": 1549992390,
      "upvotes": 10,
      "replies": {}
    },
    "egbtzs6": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbtzs6/",
      "text": "/r/legaladvice",
      "author": "holidaySocks2018",
      "created": 1550001097,
      "upvotes": 6,
      "replies": {}
    },
    "egbgoze": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbgoze/",
      "text": "It makes me extremely sad to see this. Your decision to quit is most definitely the right one - all of us are human first, researcher second. Seek therapy!",
      "author": "Theutates",
      "created": 1549992287,
      "upvotes": 11,
      "replies": {}
    },
    "egc0dy4": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egc0dy4/",
      "text": "I'm really sorry you had to go through that, it's absolutely terrible. As others are saying you should report him and do what you can through the university. However also consider naming and shaming, sometimes that works the best, even if you do it confidentially or anonymously. Depending on the size/dynamics of the lab this may or may not be an option for you, for example if you were the only post-doc at the time and quit, then it'd be easy to find out. Keeping others from joining the lab and protecting future postdocs/grad students by putting your experience out there, if you're comfortable doing that anonymously, could be helpful",
      "author": "AxOfCapitalism",
      "created": 1550005237,
      "upvotes": 2,
      "replies": {}
    },
    "egcioud": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egcioud/",
      "text": "I agree it is important to move on,  but it is also important to stop this person from doing this to others. Please report this. ",
      "author": "stickyonthebeak",
      "created": 1550018285,
      "upvotes": 2,
      "replies": {}
    },
    "egdhzdw": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egdhzdw/",
      "text": "Well very sorry to hear this. Post-doc position is especially prone to abuse because of its specific design which puts you directly and solely at the mercy of the supervisor with no alternative support (at least practically if not in theory). As a victim of academic abuse, quite understand your pain.  Didn't read all the suggestions, but the minimum is to first secure a job and then write an enlightening letter to the chair. You owe yourself this minimum in order to regain your mental health, hopefully pretty soon.",
      "author": "siali",
      "created": 1550056194,
      "upvotes": 2,
      "replies": {
        "egdspg1": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egdspg1/",
          "text": "Thank you for your comment and suggestions. Sadly, suffering academic abuse seems to have become a rite of passage. I think I will focus on regaining my mental health and securing a job first. ",
          "author": "harassDoc",
          "created": 1550068189,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "egdpx1y": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egdpx1y/",
      "text": " This is unfair! Why do we have to be always the side that remains silent or leaves in silence?! I had  roughly the same experience when I was a master's student. We had a lecturer who was quite smart with good research expertise in his flield. He was well respected and feared but he was a total psychopath! He was so obnoxious, rude and arrogant. The problem is, he used his position and intellectual capacities to sexually harass several female students. He smartly did so without getting his hands dirty... everyone in the department knew there was something wrong but no one dared to say something, because for one, they did not want to lose him as an important academic figure, and for two, they did not capture any tangible evidence which would convict him because he did everything smartly and stealthily ... He had bad intentions for me and my friend, we were hard working and aspiring students who looked forward to success, but above all, we were aware of his unethical misconduct which made us quite worried but we did our best to remain professional and keep our relationship with him within the academic scale. He was okay with us at first and everything started well until his first exam. He intentionally lowered our grades though we did well and humiliated us in front of our classmates. We were so shocked! He was clearly waiting for us to complain so that he asks to see us for one on one meeting and then start the dirty game. I asked my friend not to complain or say anything though she was so angry... He waited for some time close to our table and then invited us for one on one meeting in front of our colleagues which was quite unusual! We refused and then he became outrageous! He increased the level of his humiliation while everyone around was shocked! After that he heard me telling my friend not to respond to his  comments and just ignore anything he says or does which made him angrier.. our relationship hit the wall and for two years, he psychologically tortured us! Intentional sabotage, not endorsing any of our work though we worked unbelievably hard, endless humiliation in front of everyone. He caused us endless fear and anger that we had to bottle because we were afraid of saying anything to anyone. We secretly complained to some of our lecturers who we were close to. Some believed us but did not know what to do, others did not believe us, others ignored us coz they did not want any troubles in the department. So.....we were the only victims to bear the brunt.... Two years passed and I'm now doing my PhD. I just remember this incident with a heavy heart and anger. Sometimes I wish I'd done something, sometimes I just wish I could see him in person and blow the whistle on him wherever he is so that he experiences what felt before. But this experience taught me how to be cautious and strong to face a similar harassment if it comes my way. ",
      "author": "AminaRain",
      "created": 1550065769,
      "upvotes": 2,
      "replies": {
        "egdsa3h": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egdsa3h/",
          "text": "Thank you so much for your comment. This was really helpful. It's so encouraging to see that people do move on from this and that it's even possible to become stronger as a result. I was really hoping to hear more stories like this.\n\nIt's all well and good for people to say we should complain/file title IX, but the truth is, it won't make much of a difference. It will probably ruin what's left of our careers and mental health, but it won't make a difference. Plus, at least in my case, *the institute was made aware of his misconduct*. I really like the term you used to describe people like him. They are truly 'psychopaths'. There is no winning with these people. The more you interact with them, the more harm you do to yourself. Change should happen at the institution level. When a complaint is made, they should do something about it. Until such change happens, there is no point in asking victims to re-traumatize themselves.\n\nI do believe it's important to educate others on the kind of abuse that happens in sexual harassment, and that is one of my intentions in writing my original post. No one other than myself and this man know what actually happened and I wanted that to change. If I had known what I was going through was sexual harassment when it started, I could have stopped it from derailing my career (and life?). The crazy making nature of these situations is that the abuse is hidden. At first you think you're imagining it or that you're overreacting. I just didn't know enough to recognize the abuse when it started. I hope this post will help someone in such a situation.\n\nThank you once again for taking the time to write about your experience! I love your last line!\n\n>But this experience taught me how to be cautious and strong to face a similar harassment if it comes my way.\n\n&#x200B;",
          "author": "harassDoc",
          "created": 1550067833,
          "upvotes": 2,
          "replies": {
            "egdwleo": {
              "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egdwleo/",
              "text": "Thank you for taking the time to respond to my reply. I like the line where you said that at first we may think that we are imagining things. That's exactly what happened to myself and my friend. He was so smart that he knew exactly how to provoke and bully us without making it noticeable. In the place where I studied before, talking about such a  thing as a woman is not acceptable. Even if you are right about being harassed and abused and everyone supports you, your social image and reputation will be ruined! And that's what kept us from going public about it, especially with his power and influence. It's unfair isn't!!! I remember when things started going south with him, myself, my friend and other colleagues were standing close the lectures room discussing something. He was standing there calmly like a predictor and when my friend looked up at him unintentionally, he walked away slowly, threw a slight devilish smile and moved his head asking her stealthily to accompany him!!! My friend swallowed it and later told me about it with an utter shock!!! We couldn't believe it!!!! Same thing happened to me after that but he didn't do anything, he just had this hungry disturbing look on his face... There are many awful things he did to us coz he taught us for two years. But the Lesson learned is: never remain silent when you feel someone acting is suspiciously...",
              "author": "AminaRain",
              "created": 1550071220,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "egc4z1q": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egc4z1q/",
      "text": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/ladiesofscience] [Sexually harassed by postdoc supervisor and forced to quit.](https://www.reddit.com/r/LadiesofScience/comments/apyqj1/sexually_harassed_by_postdoc_supervisor_and/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
      "author": "TotesMessenger",
      "created": 1550008208,
      "upvotes": 1,
      "replies": {
        "egcfvdq": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egcfvdq/",
          "text": "Also posted verbatim on Chronicle of Higher Ed fora. ",
          "author": "ms5h",
          "created": 1550016040,
          "upvotes": 2,
          "replies": {
            "egcp454": {
              "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egcp454/",
              "text": "And on an Academic Stack",
              "author": "ms5h",
              "created": 1550023245,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "egcpaag": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egcpaag/",
      "text": "Sounds like you have a lawsuit, even if it's just against this person since it doesn't seem like the institute was made aware of the problem. However if your employer was notified about this, the situation seems absolutely actionable.  /r/legaladvice is a good suggestion.",
      "author": "scintor",
      "created": 1550023372,
      "upvotes": 1,
      "replies": {}
    },
    "egd2xwm": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egd2xwm/",
      "text": "Please consider talking to an attorney. I think you might have a lawsuit",
      "author": "piconutz",
      "created": 1550034341,
      "upvotes": 1,
      "replies": {}
    },
    "egd9ole": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egd9ole/",
      "text": "r/legaladvice ",
      "author": null,
      "created": 1550042280,
      "upvotes": 1,
      "replies": {}
    },
    "ege6jm6": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/ege6jm6/",
      "text": "Do you know where their funding comes from?  For example, NSF takes complaints about their grant holders directly.  So, if a student or postdoc in a group funded by an NSF grant had issues and couldn't get it resolved by the university, they can go directly to the funding agency. ",
      "author": "benegesseritwitch",
      "created": 1550077913,
      "upvotes": 1,
      "replies": {
        "egectpp": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egectpp/",
          "text": "Most/all of their finding comes from the NIH. Unlike the NSF, the NIH seems to not be that serious about sexual harassment.\n\n[http://www.sciencemag.org/news/2018/09/nih-director-expresses-concern-offers-no-new-policy-sexual-harassment-grantees](http://www.sciencemag.org/news/2018/09/nih-director-expresses-concern-offers-no-new-policy-sexual-harassment-grantees)",
          "author": "harassDoc",
          "created": 1550082074,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "egieibk": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egieibk/",
      "text": "I am so sorry this happened to you.  We over at r/MeTooSTEM are building resources to help situations with TitleIX and reporting, or even not reporting and just finding a friend to listen if reporting is too much.  It's your story, you get to decide how you want to narrate it.  Come see us if you need. Take care of you.",
      "author": "FungalSquirrel",
      "created": 1550206625,
      "upvotes": 1,
      "replies": {
        "egj8sno": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egj8sno/",
          "text": "Thanks for your comment and kind words. I do follow MeTooSTEM on twitter. Amazing work btw, please keep doing what you guys are doing. I'd like to help in any way I can. I think one of the reasons I wrote this post was so I could share my story with other people, maybe it will help someone in a similar situation.",
          "author": "harassDoc",
          "created": 1550244885,
          "upvotes": 2,
          "replies": {
            "egjn07r": {
              "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egjn07r/",
              "text": "I am so proud of you for being so brave! Keep fighting and speaking your truth. \n\nKeep us updated on the interview. Fingers crossed!",
              "author": "FungalSquirrel",
              "created": 1550254747,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "egbt3js": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbt3js/",
      "text": "Report his ass FFS",
      "author": "SniffingSarin",
      "created": 1550000507,
      "upvotes": 0,
      "replies": {
        "egbu56j": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbu56j/",
          "text": "doesn't always work.",
          "author": "dudenotrightnow",
          "created": 1550001196,
          "upvotes": 4,
          "replies": {
            "egbyorj": {
              "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbyorj/",
              "text": "I agree. But the best I can say is that an accumulation of evidence that this supervisor is a POS can have an effect, and I can imagine that this isn't the first time this supervisor has decided to treat a trainee like this. Maybe this complaint will be the one that puts it over the edge. Yes, maybe it'll get get ignored by the people who should be doing something about it - but also maybe it means the next person who complains won't get \"oh we've never had a complaint about this guy\".",
              "author": "drmarcj",
              "created": 1550004165,
              "upvotes": 2,
              "replies": {}
            },
            "egbu93i": {
              "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbu93i/",
              "text": "If she pursued this with any sort of motivation, I'd give it a high chance of it working out in her favor, especially if she has messages between them. ",
              "author": "SniffingSarin",
              "created": 1550001268,
              "upvotes": -2,
              "replies": {}
            }
          }
        }
      }
    },
    "ego3lzc": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/ego3lzc/",
      "text": "I’m so happy to hear ure going to land on ur feet! But what happened to u is terrible & I hope he is held fully to account for his crimes against students. U can submit ur story to @metoostem.\n\nPls join r/MeTooSTEM & on Twitter, @metoostem #metoostem @mclneuro\n\n@mclneuro is #metoostem founder & her tenure was reversed in retaliation for filing & winning a Title IX report. Pls sign the petition. \n\nhttps://www.change.org/p/nicholas-s-zeppos-vanderbilt-do-right-by-bethann-mclaughlin?recruiter=24332769&utm_source=share_petition&utm_medium=twitter&utm_campaign=psf_combo_share_abi.pacific_post_sap_share_gmail_abi.gmail_abi&utm_term=share_twitter_responsive&recruited_by_id=3f4d8ee0-c79c-012f-f0bb-40406f61fb41",
      "author": "sandraduffy",
      "created": 1550421765,
      "upvotes": 0,
      "replies": {}
    },
    "egbi4te": {
      "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbi4te/",
      "text": "[deleted]",
      "author": null,
      "created": 1549993257,
      "upvotes": -9,
      "replies": {
        "egbluwo": {
          "link": "/r/AskAcademia/comments/apvdix/sexually_harassed_by_postdoc_supervisor_and/egbluwo/",
          "text": "This is bad advice in so many ways, not in the least because you could get yourself seriously hurt by inviting violence.\n\n>Whenever you see a red flags like this, act crazy, like a loose cannon. learn self defense classes and delibirately talk about it so all men know that you aren't afraid to use physical force. ",
          "author": "Hedoin",
          "created": 1549995723,
          "upvotes": 8,
          "replies": {}
        }
      }
    }
  }
}