{
  "sid": "kint9r",
  "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/",
  "title:": "How many papers did you finish a PhD with? (Neuroscience; United States).",
  "text": "Just curious how many papers (peer-reviewed journal article) you all finished your PhD with especially from those in neuroscience or the life sciences since it seems to vary so much by field. How many firsts? How many 2nds? Mids? What would you say is a solid number and what number for those students that became PI's? Just trying to figure out a reasonable reach and stretch target for productivity (despite what people say about best-laid plans). Thanks!",
  "author": "Stereoisomer",
  "created": 1608704638,
  "updated": 1634082083,
  "over_18": false,
  "upvotes": 97,
  "upvote_ratio": 0.96,
  "comments": {
    "ggsa0ji": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsa0ji/",
      "text": "I graduated my PhD in neuroscience (Denmark) in 2017 with one published first-authorship, one first-authorship ready to be submitted (published in 2018) and one manuscript in preparation that I’m actually still working on, since we decided to include more experiments. \nI had around 4-5 mid-authorships at the time, but I didn’t include or mention those in my PhD.",
      "author": "Miss_Forest",
      "created": 1608717997,
      "upvotes": 30,
      "replies": {
        "ggscpj1": {
          "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggscpj1/",
          "text": "This sounds similar to me. I’m psych and I’m at the end of my 3rd year, with one published, one accepted and one that I’m preparing (will edit from my thesis chapter). It totally depends on your field and supervisors I’ve found - I’ve always been encouraged to publish as I went along, but I know others that haven’t!",
          "author": "staringspace",
          "created": 1608720942,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ggs9g77": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggs9g77/",
      "text": "I had zero (primate neurobiology in Germany) which isn't uncommon since the deadline our gradschool imposes on us and the time it takes to train two monkeys in our tasks doesn't match up.  \nIn other fields, where experiments usually go faster, that would be more unusual.\n\nI was told by multiple PIs that in their experience it's not necessarily a problem but you should expect to publish a bit more during your postdoc(s) and might be stuck in that phase for a bit longer. This disadvantage even gets a bit smaller if you manage to publish your \"PhD papers\" after you graduated.  \n\nThat said, the process to advance is anyways highly unpredictive and based on luck, so I wouldn't sweat the exact number too much.   \nSome people get lucky and have a lower publication count but get \"that one\" famous paper they can profit on, others outpublish their peers but still never manage to land a position. And some people aren't really above average but still manage to apply to the right position at the right time to become a group leader. After all, you only need to be the best candidate in that single application period to get a job, not outperform anyone who didn't apply. \n\n\nAlso don't forget that similar to \"the one\" paper (which usually isn't the one you thought would take off and their hard to influence) overall quality still can beat quantity. We love to cite \"publish it perish\" as if our career would *only* depend on the exact number but fewer publications of a higher quality still often help more than pushing out a lot of absurd mediocre papers (most obvious if you think in impact factor or citations). It also helps to get people to talk about your work, which is an important factor to be acknowledged by search committees (other than having an amazing pedigree).  \nI even know one postdoc who's interested in many questions and amazing at collaborating that got told by one committee (obviously unofficially) that him publishing in many unrelated fields about many questions shows a lack of commitment and was therefore seen as a negative... It's such an absurd process, where it feels like it's easy to do things wrong and very hard to get everything just exactly right.",
      "author": "LittlePrimate",
      "created": 1608717360,
      "upvotes": 45,
      "replies": {}
    },
    "ggse754": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggse754/",
      "text": "Im required to publish 3 at least as a main author to finish mine in theoretical physics",
      "author": null,
      "created": 1608722510,
      "upvotes": 14,
      "replies": {
        "ggsnu2a": {
          "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsnu2a/",
          "text": "If you don’t mind me asking where do you study?",
          "author": "Pattern_Stock",
          "created": 1608730936,
          "upvotes": 3,
          "replies": {}
        },
        "ggt9n00": {
          "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggt9n00/",
          "text": "Same; geoscience R1 institute in North America",
          "author": "RagePoop",
          "created": 1608743507,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ggs8dvs": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggs8dvs/",
      "text": "I was wondering this recently and came across [this paper](https://link.springer.com/article/10.1007/s11192-017-2540-6#:~:text=For%20instance%2C%20first%2Dyear%20PhDs,from%20the%20self%2Dreport%20data.) that goes through the average publications of Psychology PhDs, post-docs and new faculty members.\n\nI work in Psychology/Neuroscience (neuroimaging and some purely psychology studies) and I'm just finishing my 3rd year with three publications (one 1st author, one 2nd author, one 5th author) and have two in review (one 1st, one 2nd) and more that will be submitted early next year but since I have no idea how long it will take to get them actually published I won't count them here.\n\nI've also checked out various people I know (including my supervisor, post-docs, and other academics I've been in contact with) and anywhere between 1-4 first author papers seems normal. 5 is uncommon and those with 5 during the PhD usually only have 1 or none in the year after they finish compared to those with fewer during their PhD who tend to have a few papers published the year after completion. I don't consider non-first author papers so much because in a lot of cases it depends on the size of the lab more than anything else.",
      "author": "Miroch52",
      "created": 1608716180,
      "upvotes": 37,
      "replies": {
        "ggspcuh": {
          "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggspcuh/",
          "text": "Any in-vivo work? That is impressive to have two first-author papers within 3 years, considering the first two years of most PhD programs are heavy with coursework. Good on you and your lab for getting stuff done.",
          "author": "airwalker12",
          "created": 1608731995,
          "upvotes": 6,
          "replies": {
            "ggsxd71": {
              "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsxd71/",
              "text": "Maybe this is so for most empirical academic disciplines, but within psychology you can often squeeze out a load of publications from the same study. For instance, you might be doing a study on some treatment for depression, and your main query is what the effect of the treatment is, that's one paper. However, at the same time you can study therapist behaviors and other mediating factors, another paper. And you can administer a new scale to your participants, the psychometric properties of which you later scrutinize in a third paper.",
              "author": "hansgreger",
              "created": 1608736925,
              "upvotes": 5,
              "replies": {
                "ggszn5l": {
                  "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggszn5l/",
                  "text": "Ahh good point. I just revert to my experience- I was technically in the dept of psychiatry during my postdoc but was working on mice and stem cells. So when I saw psych/ neuro I just assumed there was a mouse/ cell component.",
                  "author": "airwalker12",
                  "created": 1608738200,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gguca4x": {
              "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/gguca4x/",
              "text": "Forgot to mention I'm in Australia and don't have coursework. I don't do any in-vivo work (just human brain imaging) and my first paper was based off existing data from a cohort study that my supervisor leads. My 2nd author publication is from my honours year research that someone else wrote up because I wasn't that intersted in the topic. My 1st author paper under review was an online study intended as a pilot study for an intervention, but it became clear that the project I was going to use it for wasn't feasible so I got a larger sample and published that alone. Covid just made the original plan impossible.\n\nAll the other papers I'll submit in the new year are using the cohort study data. We still collect data for that study but most of what's being worked on now is using data previous students collected. The biggest pro is not having to wait for data collection to finish. The downside is that the methods aren't necessarily what I would choose but I still have to justify them. I found it much easier to write up the paper for the study I designed because I fully understood why I made the methodological decisions I made (even if in hindsight it could be better). Also the stats was a bitch so my first year felt like a DIY statistics course.",
              "author": "Miroch52",
              "created": 1608763894,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ggsl2n5": {
          "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsl2n5/",
          "text": "Is it different to appear as 1st or as subsequent author it terms to apply for an academic position?",
          "author": "Antonio-Cansinos",
          "created": 1608728869,
          "upvotes": 4,
          "replies": {
            "ggucqby": {
              "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggucqby/",
              "text": "[This paper](https://pubmed.ncbi.nlm.nih.gov/24892909/) says yes.",
              "author": "Miroch52",
              "created": 1608764111,
              "upvotes": 1,
              "replies": {
                "ggux3tc": {
                  "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggux3tc/",
                  "text": "Thanks for your answer Miroch52. But I am not sure if I expressed my thought properly. My question is if, in terms of merits to obtain a place in academia, is it relevant that your name appears before or after in the paper. For example, if my name appears at the 3th place as author count less? \n\nI am not sure how work the system to apply and work on academia there in the US. In Spain it's a «simple» system of points. But it is going to count for you if you appear as an author in a paper, independtly if you are placed as the 3th one or the first one.",
                  "author": "Antonio-Cansinos",
                  "created": 1608775396,
                  "upvotes": 1,
                  "replies": {
                    "gguykl0": {
                      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/gguykl0/",
                      "text": "This differs by field so if you're not in Psychology/Neuroscience this might not apply to you. But in my field first author means you've contributed the most work to the paper. Second author would contribute the second-largest amount of work, etc. The last author in my field is also the senior author, meaning they're usually the head of the lab or project even if they didn't write the paper. \n\nBecause the author order relates to the amount of work contributed, it definitely affects your likelihood of getting into academia. Having first author papers would mean that you're able to do the bulk of the work on the paper. On my 5th-author paper I did not contribute very much. I was involved in the project but any of the other authors easily could have done what I did - so that paper won't mean too much for me in terms of moving forward. \n\nThat said, there's no straightforward points system. If you have a very good paper (high impact factor, lots of citations) that you aren't first author on, that might still give hiring committees a higher view of you compared to other candidates that don't have any papers at that level. But if your first author papers for instance are reliably in lower impact journals than the work that you co-author on, then maybe that will be interpreted negatively because it's probably not your contribution specifically that has made those other papers good. But it's also easier to just count the number of papers than to consider impact, author position, what the papers were about, etc. So I think there would still be a bias towards people with more papers regardless of author position. For grants they might have a scoring system but I don't know what that system is.",
                      "author": "Miroch52",
                      "created": 1608776217,
                      "upvotes": 2,
                      "replies": {
                        "ggy3gn6": {
                          "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggy3gn6/",
                          "text": "Thanks for your answer.",
                          "author": "Antonio-Cansinos",
                          "created": 1608856183,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ggs326q": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggs326q/",
      "text": "I haven't seen one for neuroscience, but someone performed and published a data-gathering exercise on recent hires in the North American ecology job market [here](https://esajournals.onlinelibrary.wiley.com/doi/full/10.1002/bes2.1624).  \n\nWhile the raw numbers will be different between different fields, you may be interested to see how much spread there is, and what different categories were considered possibly relevant enough to look into.  As the other commenter has suggested, you can find much more trustworthy and relevant data yourself by looking at the CVs of recent hires in your field, in the genres of institutions that interest you.  You should do this anyways, if you want to apply for faculty jobs.\n\nOf course, number of papers are only one piece of the puzzle.  Networking and communication skills are vital, but hard to quantify.  A history of achieving (even small) funding is ideal if you want to be competitive.  You'll need to do a postdoc, and that should be in a group/position where you can publish high-impact work while demonstrating a high level of independence and complementing/expanding your existing skills and knowledge.  Teaching experience will probably be necessary, but the expected amount/level really depends on what country you end up applying in.",
      "author": "polyphonal",
      "created": 1608710644,
      "upvotes": 12,
      "replies": {}
    },
    "ggsd29h": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsd29h/",
      "text": "Not in neuroscience but rather bioinorganic chemistry (not sure if that counts as a life science as per your request), but I published 7 papers (all first author) as a grad student (4.75 years).",
      "author": "Aubenabee",
      "created": 1608721321,
      "upvotes": 10,
      "replies": {}
    },
    "ggs5ghg": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggs5ghg/",
      "text": "I received my PhD in neuroscience in 2014, and had 3 first author publications from it.  I published one in 2012 and the other 2 in 2015.",
      "author": "atlantagirl30084",
      "created": 1608713026,
      "upvotes": 10,
      "replies": {}
    },
    "ggso0lk": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggso0lk/",
      "text": "I had 0 first author papers from my neuroscience phd in the US. Luckily I had 2 first author papers from before and got 8 papers as a co author.          \nI should add that I was studying cell/molecular biology of a critical protein for synaptic plasticity.   \n         \n         \n   \nI wound up doing very well with a scientist position in biotech mostly due to the soft skills I developed outside the lab. The drive for more papers, I believe, would have kept me in grad school for an unacceptable amount of time so I had to take advantage of pressure on my PI from others to graduate and move on. I never had sufficient time to work on my main project and my side project(as well as the lab's main focus) was a train wreck and I had to gtfo",
      "author": "the-duck-butter-er",
      "created": 1608731064,
      "upvotes": 7,
      "replies": {}
    },
    "ggs0nk0": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggs0nk0/",
      "text": "This is something you yourself can look up on Google scholar. Just check out any \"young-er\" professor in your field. Most folks will have a \"Before starting at XYZ\" in their publication list. Good luck!",
      "author": "arknado1",
      "created": 1608708331,
      "upvotes": 17,
      "replies": {}
    },
    "ggsi7uw": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsi7uw/",
      "text": "I am in computer science. I have published two papers so far (first author). However, my supervisors have told me that they won't approve me defending without at least three more, so it will have to be five in total by the time I am done. It's a paper farm over here.",
      "author": "goatsnboots",
      "created": 1608726445,
      "upvotes": 5,
      "replies": {
        "ggtaxag": {
          "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggtaxag/",
          "text": "5 papers in CS? Are you in AI/ML, because otherwise this looks like a lot. For me it's about ~3 top-tier publications.",
          "author": "iHubble",
          "created": 1608744170,
          "upvotes": 1,
          "replies": {
            "ggtegiv": {
              "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggtegiv/",
              "text": "I'm in human-computer interaction, so like AI and ML, a lot of mine are conference papers. I'm aiming to get 2 of the 5 into journals though.",
              "author": "goatsnboots",
              "created": 1608745994,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ggsz1fq": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsz1fq/",
      "text": "Just finished with my PhD in Molecular and Cellular Biology (my research itself was in immunology), and I had 1 first-author publication by the time I graduated. Our program required 1 first-author research paper (reviews didn’t count) in order to graduate. I will be a middle author (like 3rd or 4th) on some papers submitted by the postdocs from our lab, as I contributed to portions of their projects. I also graduated in 5.25 years, all of which is about average for our program. However, I am not staying in research and chose not to do a postdoc, so the amount of papers I published wasn’t super critical for me.",
      "author": "snazzyscientist",
      "created": 1608737868,
      "upvotes": 3,
      "replies": {}
    },
    "ggsdw0n": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsdw0n/",
      "text": "I’m U.K., and we rarely get more than one paper from the PhD published before submitting the thesis, but usually you’d expect 3-5 papers to come from your PhD work, and maybe a few extra from collaborative projects. \n\nI’m in my final year now, and have 4 first author papers planned/in prep, two published (one first author), and 3 from collaborative projects in prep. Only 4 of that 9 are likely to be published/accepted prior to my viva though.",
      "author": "ayeayefitlike",
      "created": 1608722187,
      "upvotes": 4,
      "replies": {}
    },
    "ggsdnea": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsdnea/",
      "text": "Definitely varies by field and year of graduation. I am in sociology and had 3 with two of them first authored (one of those was sole authored) but that was in 3010, now we hire people with around 5 to 9.",
      "author": "abandoningeden",
      "created": 1608721938,
      "upvotes": 2,
      "replies": {}
    },
    "ggsmc8h": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsmc8h/",
      "text": "Experimental Psych PhD - finished with 0 publications, did a terminal Master's and followed with a PhD 3 years later. I worked with two advisors that were on their way out the door, the first retiring and the second moving onto administration. I literally wiped an inch of dust of the lab for the latter during my two years on campus. \n\nFirst publication was sole-author, published independently three months post-graduation. I now have four, total, and two under review. I have mostly spent the last several years ramping up recruitment for my own lab and working on forming solid collaborations and contacts in the state. I have an \"alternate\" research position at a major state university, rather than faculty, and legitimately don't know that I would even be considered for a faculty position anywhere for at least another 3-4 years, since I really need to advance my publication record and grant-writing work. Given all of that, I have had the luck of incredible collaborators and overall positive experiences in work-life balance. Faculty seems out of reach, but also not terribly appealing, given the workload and the likely loss in pay/job security. I think that the expectations for psych faculty are ridiculously high, and have been on several search committees where folks expect 5-6 publications immediately out of grad school. Personally, I don't think that publications should be the sole gatekeeper in determining whether or not someone will make a good faculty member or research contributor, but rather their mentorship record and ability to make connections that are beneficial to the university. Others feel very differently, however.",
      "author": "insanityensues",
      "created": 1608729849,
      "upvotes": 2,
      "replies": {}
    },
    "ggsmm7s": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsmm7s/",
      "text": "I think this probably depends a lot on subfield, so it can be hard to compare between different people. I honestly find it confusing to try and understand what is considered \"good enough\" and what isnt, and I think we'd be a little more saner if we stopped thinking too hard about it.\n\nIn my case, my phd was something like computational neuroscience and neuroengineering, with some applied machine learning (I have a mixed background). I had 7 papers when I graduated (6 first author, and usually only 2-3 authors per paper), then 3 first author the next year, 4 papers the year after (one first author, one last author),  etc. etc. I think I'm on track for a faculty position in a few years, but it's honestly too hard to tell.\n\nI'm finding I'm putting out fewer first author papers and more second and last author papers now, but I need to work on some more first authored stuff now to stay competitive. I've just been having more fun solving modeling problems and applying stats and machine learning lately, and haven't been inspired to pursue very original ideas until about a month ago.\n\nIt sounds like you're doing just fine. I wouldnt stress too much!",
      "author": "MillennialScientist",
      "created": 1608730053,
      "upvotes": 2,
      "replies": {}
    },
    "ggsrcds": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsrcds/",
      "text": "My PhD thesis was required to have three first author papers already submitted/accepted, and a fourth “to be submitted” (also first). I had a smattering of other Nth author papers. \n\nThis was the minimum standard to graduate in the Netherlands in my field (astronomy). I guess it means I finished a little ahead but TBH that’s a super high bar if things don’t go well in your project or you do work that is essential but doesn’t go into a paper, and I had both of those in spades.",
      "author": "Andromeda321",
      "created": 1608733305,
      "upvotes": 2,
      "replies": {}
    },
    "ggsvdvk": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsvdvk/",
      "text": "Ecology-ish:\n\n5 lead (2 from MS, 3 from PhD)\n\n4 co-author, of which two were second author",
      "author": null,
      "created": 1608735769,
      "upvotes": 2,
      "replies": {
        "ggt9snv": {
          "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggt9snv/",
          "text": "[deleted]",
          "author": null,
          "created": 1608743587,
          "upvotes": 2,
          "replies": {
            "ggteomi": {
              "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggteomi/",
              "text": "Thanks, the second paper was the hardest I've ever had to publish. I was in the third year of my PhD when it was finally accepted at the fourth journal we tried...\n\nIt wasn't a great paper and reported negative (albeit surprising) results. It's been cited twice in eight years.\n\nWorth it!",
              "author": null,
              "created": 1608746116,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ggtj358": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggtj358/",
      "text": "I'm in neuroscience, I had 2 firsts and 2 middles.  From CVs I have seen in faculty searches, I would say the typical range for fresh PhDs is 2 to 6 publications. \n\nGranted, there is some self selection.  If they have fewer publications, they are probably not applying for faculty positions and if they have more, they are probably appilying for more research intensive positions than my university.  But unless you (or the lab) are a machine or data collection is very quick for what you do, getting more than about 3 first authors out during a PhD is a tall order.  How many middle authors you pick up is more of a function of how active a lab you are in and how many other grad students and post-docs you can assist.",
      "author": "manova",
      "created": 1608748400,
      "upvotes": 2,
      "replies": {}
    },
    "ggtoh7a": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggtoh7a/",
      "text": "Cognitive Psychology here (2000)- I finished with three pubs, one in a top journal in my field (JEP: General), and one first author.  I later published off of my dissertation.  That was enough to get lots of interviews and offers at Masters level institutions,  two phone interviews at R1 schools, and a good postdoc offer at an R1. I was tired of the treadmill, so I took one of the Masters level job offers.  In retrospect, another pub or two would have pushed me solid into R1, and I likely should have taken the Postdoc.  But I was tired, my personal life had suffered from a single minded pursuit to the PhD and research, and I was worried I would burn out before I made it. I wanted to have a life.\n\nEdit- if I had waited, I also got a job offer at an R1, but in an undesirable part of the country.  I had already taken a job, so I decided the honorable thing to do was to turn it down, and I really did not want to live in Starkville MS anyway.",
      "author": "Der_Kommissar73",
      "created": 1608751204,
      "upvotes": 2,
      "replies": {}
    },
    "ggtpl1f": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggtpl1f/",
      "text": "PhD in neuro (behavioral) in 2018; 6 first author + 3 middle author. Others in my class graduated with only 1 first author under consideration, so it really varies.",
      "author": "Froggy101_Scranton",
      "created": 1608751780,
      "upvotes": 2,
      "replies": {}
    },
    "ggtrxyw": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggtrxyw/",
      "text": "I finished my PhD in Astrophysics (4 years), and I published 3 papers as a first author.",
      "author": "Illustrious_Lemon_93",
      "created": 1608753036,
      "upvotes": 2,
      "replies": {}
    },
    "ggtywpg": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggtywpg/",
      "text": "3 first author, 14 mid author. You should collaborate and help people as much as possible to get on their papers, especially those in other departments that want to test new technology.\n\nBehavioral neuroscience takes forever, so you really want to branch out.\n\nEdit: phd in 2017, postdoc now.",
      "author": "krazyk1661",
      "created": 1608756755,
      "upvotes": 2,
      "replies": {}
    },
    "ggsg1jp": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsg1jp/",
      "text": "My PI (clinical/health psych) would suggests 1 first-author paper a year. In addition, maybe a handful of 2nd and 3rd author papers a year. Obviously not linear- I didn’t have an official publication my first year and a half but by the end I was getting 1.5-2 first-author papers a year.",
      "author": "Dr_TLP",
      "created": 1608724374,
      "upvotes": 1,
      "replies": {}
    },
    "ggsgo4x": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsgo4x/",
      "text": "2",
      "author": "TakeOffYourMask",
      "created": 1608724985,
      "upvotes": 1,
      "replies": {}
    },
    "ggsn7tt": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsn7tt/",
      "text": "I believe my institution's Neuroscience students are required to have 2 first author and 1 review paper (their average PhD length is 5-7 years). Most people end up on couple more papers during that time as non-first authors.",
      "author": "bacon_music_love",
      "created": 1608730492,
      "upvotes": 1,
      "replies": {}
    },
    "ggsqdzn": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsqdzn/",
      "text": "Immunology here. 6 first author research papers, 1 first author review paper. 2 middle authors with collaborators. My program required 1 first author research paper to graduate. My productivity was about having many concurrent but related projects and novel techniques (scRNAseq). I’d say you should aim for at least 2: one lower-mid impact on a side project to get you writing and for practice and one that you go all out on for your main project. You don’t need huge productivity in grad school, that’s for your post doc. You really just want to make sure you’re ready to be an independent thinker and writer by the end of your PhD.",
      "author": "RedDeadMedemption",
      "created": 1608732689,
      "upvotes": 1,
      "replies": {}
    },
    "ggsuora": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsuora/",
      "text": "PhD mechanical engineering. Graduated with 3 first author papers. 5 in preperstion. Total 8 first author papers (impact factor > 4.5 for all is required by my professor, so there was some delay). 4 papers in 4.5 impact factor journals, and 4 in > 8. Now all are published. Recently published ( Dec 17, 2020) a review paper but as coauthor total 9. Do you think I'm strong candidate for academic position?",
      "author": "slowpokesardine",
      "created": 1608735356,
      "upvotes": 1,
      "replies": {}
    },
    "ggsx8p7": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsx8p7/",
      "text": "(I'm **not** in life sciences caveat)--\n\nI finished two empirical, one theoretical/review, one book chapter (comes out next year), and 4 book reviews. I defend my dissertation next year (written, just needs final edits). This is across 8 years and only focuses on papers. I'm a 1/2 time PhD student and full time faculty-member (teaching grad students).",
      "author": "ocherthulu",
      "created": 1608736851,
      "upvotes": 1,
      "replies": {}
    },
    "ggt0cor": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggt0cor/",
      "text": "Got my Neuroscience PhD this year (United States). We were required to have one first-author, but if you weren't doing primate work, encouraged to have more than one. I graduated with two first-author research papers, one first-author review.",
      "author": "lmnox",
      "created": 1608738586,
      "upvotes": 1,
      "replies": {}
    },
    "ggt1md9": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggt1md9/",
      "text": "Zero, but office colleague (epidemiology) had >30, though not all directly related to his thesis",
      "author": "bobmcpop",
      "created": 1608739276,
      "upvotes": 1,
      "replies": {}
    },
    "ggt7vdk": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggt7vdk/",
      "text": "I had zero when I defended my thesis (1 submitted and under review). After graduating, though, I've had 2 first author research papers, 1 first author review, and 2 middle author research papers from my PhD work. I worked on the manuscripts during my postdoc.\n\nEdit: this was in mouse neurophysiology\n\n>What would you say is a solid number and what number for those students that became PI's?\n\nReally depends on the journal. In neuroscience, one Neuron/Nature Neuroscience and one Journal of Neuroscience during grad school would be good enough for a future PI. In any case, 5-7 publications (during PhD) are usually a solid number.",
      "author": "rick2882",
      "created": 1608742591,
      "upvotes": 1,
      "replies": {}
    },
    "ggti35h": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggti35h/",
      "text": "I have about 6 (I think?) currently. I’m a 6th year on my doctoral internship in clinical psychology (I’m sort of a graduate student still sort of not- it’s hard to explain- clinical psychology is weird but by the time you get to your 6th year you’ve already defended you dissertation and basically have to work in the field for a year prior to getting your PhD).\n\nIf memory is serving me well today - 3 first author, 3 other pubs, and 1-2 under review right now.",
      "author": null,
      "created": 1608747885,
      "upvotes": 1,
      "replies": {}
    },
    "ggun2xg": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggun2xg/",
      "text": "3 firsts, 2 lasts (submitted one of the firsts during first year postdoc)",
      "author": "mmilthomasn",
      "created": 1608769879,
      "upvotes": 1,
      "replies": {}
    },
    "ggsb59r": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/ggsb59r/",
      "text": "My roommate studies civil engineering and he has 8 papers, all journal, many of which he is first author, if not all. This is for 2020 alone. He started in 2018, so probably has well over 10 in total now.\n\nEdit: sorry just realized asking neuroscience only",
      "author": "jz9chen",
      "created": 1608719253,
      "upvotes": 1,
      "replies": {}
    },
    "gslmnkq": {
      "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/gslmnkq/",
      "text": "[deleted]",
      "author": null,
      "created": 1616953742,
      "upvotes": 1,
      "replies": {
        "gslv0v1": {
          "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/gslv0v1/",
          "text": "That’s a lot! What field of neuro? Are those all research papers?",
          "author": "Stereoisomer",
          "created": 1616957760,
          "upvotes": 1,
          "replies": {
            "gslv939": {
              "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/gslv939/",
              "text": "Neuroregeneration, all in vivo work and all original research manuscripts. Highest IF 16.xx lowest IF 5.xx",
              "author": null,
              "created": 1616957871,
              "upvotes": 2,
              "replies": {
                "gslyq0x": {
                  "link": "/r/AskAcademia/comments/kint9r/how_many_papers_did_you_finish_a_phd_with/gslyq0x/",
                  "text": "That’s super solid! I’m trying to have 4 or 5 firsts by the end of grad school but I work with primates so it’s very slow; I should probably rebenchmark my goals.",
                  "author": "Stereoisomer",
                  "created": 1616959584,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}