{
  "sid": "pbltej",
  "link": "/r/AskAcademia/comments/pbltej/going_home_every_weekend/",
  "title:": "Going home every weekend",
  "text": "I am a first year grad student who struggles with anxiety. I am having a very hard time transitioning to being away from home as it is my first time ever away from home even though I am 22. I am only 2.5 hours away and do not have classes on Friday. I have considered living here through the week and at home on the weekends since 2.5 hours is not that much. I was wondering what the general thoughts were on that and if I would be hindering or failing myself by doing that.",
  "author": "Key_Confidence_4751",
  "created": 1629929743,
  "updated": 1634079488,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 1.0,
  "comments": {
    "hacqle1": {
      "link": "/r/AskAcademia/comments/pbltej/going_home_every_weekend/hacqle1/",
      "text": "I wouldn't think this would hurt you on the academic side at all, and if it is what you really need to do to take care of you while you adjust, you can. That said, if you keep going home, you are never going to feel like your new home is home. You are going to miss getting to know your fellow grad students, or getting involved in the local activities. Little things like decorating your home and joining some groups- sports groups, volunteer groups, book clubs, whatever, will help make this be a home. What you don't want is 2 years from now all your peers have really put down strong roots and have strong local support and you are still just camping out while relying on your going home. I also hope you are working with a therapist.",
      "author": "AwkwardAccountant5",
      "created": 1629931894,
      "upvotes": 43,
      "replies": {}
    },
    "had9pfw": {
      "link": "/r/AskAcademia/comments/pbltej/going_home_every_weekend/had9pfw/",
      "text": "Give yourself some time. If you feel like going back home, do it. As time passes, you’ll see how it goes. Don’t force yourself to stay away, but also give yourself a chance to feel at home in the new place. \n\nIt takes time to feel at home somewhere. You’ll do fine. Good luck.",
      "author": "dsilesius",
      "created": 1629940585,
      "upvotes": 7,
      "replies": {}
    },
    "hae2cgt": {
      "link": "/r/AskAcademia/comments/pbltej/going_home_every_weekend/hae2cgt/",
      "text": "It's perfectly fine to get the support you need from your home environment with weekend trips, since this is still your first year and you're at the very start of it. But be sure to give yourself a chance to put down roots in your new town, make friends, participate in things, go have coffee, hit up a sporting event, or sit around at someone's house and have a beer and conversation until the wee hours. These are the things that start to fill the spaces where the anxiety likes to hide. Soon you'll have a support system in your new town too, and it will start feeling like home too. \n\nAll that being said, I am in a similar boat- I'm getting my doctorate, live 2 hours from campus because of reasons, and I commute. I usually stay on campus during the week, and drive home to my partner on the weekends. It is fucking exhausting. It sucks. I miss out on things, I spend a sizable chunk of my week on the road, I don't sleep well because it feels like I'm always living out of a suitcase both in town and at home, and never have any stability or time to physically or mentally relax. Getting into a focused mindset to study on the weekends is difficult because of the environment change, and I'm tired during the school week because of the unrestful weekend, long drive, and out-of-whack eating and sleeping habits. It took a long time to make friends too, because I was always away when people were hanging out, or not available for an impromptu invite or dinner. \n\nIt's all temporary- I'll be done with school soon, the living situation can't be helped, I cherish every moment I spend with my very supportive partner, and I immensely love being at school. I'm very lucky to have this opportunity and would jump through a thousand flaming hoops without hesitation to keep it. But no lie- it really is hard. There has been a lot of anxiety and tears and white-knuckling. I really think that if you make a long term habit of going home every weekend, I think it will be detrimental to your studies, relationships, confidence, and sleep/body/mental health. \n\nAlso very worth mentioning is the wear and tear and mileage on your car. I frequently put 1200+ miles a week on my car depending how many times I have to commute, and for awhile was changing my oil every 3 weeks ($$). I've gone through two full sets of tires in two years *($$$$)*, and have put almost 80k miles on my already high-mileage, 8 year old car in those two years alone, which means lots and lots of proactive and expensive maintenance to keep it running smoothly and safely and efficiently on the highway.",
      "author": "drilllbit",
      "created": 1629955647,
      "upvotes": 7,
      "replies": {}
    },
    "hacov3z": {
      "link": "/r/AskAcademia/comments/pbltej/going_home_every_weekend/hacov3z/",
      "text": "Mate it’s fine. If it helps, 5 hours a week over the weekend is not a very big investment to improve your disposition.",
      "author": "p53lifraumeni",
      "created": 1629931125,
      "upvotes": 7,
      "replies": {}
    },
    "hafjaew": {
      "link": "/r/AskAcademia/comments/pbltej/going_home_every_weekend/hafjaew/",
      "text": "In some places, the entire student body goes home every weekend and obviously no one thinks it's weird. Do what you want to do.",
      "author": "goatsnboots",
      "created": 1629989756,
      "upvotes": 3,
      "replies": {}
    },
    "had182s": {
      "link": "/r/AskAcademia/comments/pbltej/going_home_every_weekend/had182s/",
      "text": "Did that during undergrad, but it was 2 hours per trip. I would drive Friday after work and come back Sunday evening. And this was at a time with no Spotify or unlimited data. With my anxiety, sometimes I can just sit around for hours and literally do nothing. Thus, the action of driving made me feel productive and I would rather be lazy at home, with my family, than alone in my apartment. My mom also cooked a lot of food for me every weekend. It was probably the healthiest thing I did in my undergrad. Honestly, I always advise people to try to be a child whenever possible because life is too tiring, and I'm always a child when I'm with my mom.",
      "author": "chillzxzx",
      "created": 1629936771,
      "upvotes": 6,
      "replies": {}
    },
    "hadp1r3": {
      "link": "/r/AskAcademia/comments/pbltej/going_home_every_weekend/hadp1r3/",
      "text": "Massive time loss per week",
      "author": "grandpassacaglia",
      "created": 1629947799,
      "upvotes": 1,
      "replies": {}
    },
    "hdwfzin": {
      "link": "/r/AskAcademia/comments/pbltej/going_home_every_weekend/hdwfzin/",
      "text": "I drove 1.5 hours each way every day for my entire MS degree.  That's 3 hours a day, 15 hours a week.\n\nI pulled a 4.0 as an OVERLOADED graduate student (12 credits when 9 was more common), and I published more journal articles, gave more presentations, and gave more talks than any other student in my program.  \n\n\nDo what you need to do.",
      "author": "coursejunkie",
      "created": 1632353791,
      "upvotes": 1,
      "replies": {}
    },
    "hae18re": {
      "link": "/r/AskAcademia/comments/pbltej/going_home_every_weekend/hae18re/",
      "text": "You can try different things and see what is convenient. Your idea seems great to me, and of course you can decide by yourself once you get here if you'll want to return home.",
      "author": "GoldEagle-_-",
      "created": 1629954903,
      "upvotes": 0,
      "replies": {}
    }
  }
}