{
  "sid": "q274i4",
  "link": "/r/AskAcademia/comments/q274i4/asking_for_update_on_journal_manuscript/",
  "title:": "Asking for update on journal manuscript reviews/decision",
  "text": "Hello,\n\nI am a PhD candidate working in a social sciences field in the United States. \n\nI have a paper that was revised and resubmitted to a leading journal in my field.  The paper was submitted on 6/22/2021, and its status was updated to \"Required Reviews Completed\" on 8/17.  However, there has been no update since then, and I have not received the reviews or a decision.  I sent a polite email asking when an update may be expected almost two weeks ago, but I still haven't heard back.  \n\nHow much longer should I wait before I send another email asking for an update?  Or would a different action be recommended?  Thanks in advance.",
  "author": "echowatson",
  "created": 1633472547,
  "updated": 1634078755,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hfje870": {
      "link": "/r/AskAcademia/comments/q274i4/asking_for_update_on_journal_manuscript/hfje870/",
      "text": "My general rule of thumb is to only contact an editor if there is something actionable for me in their potential response. In a situation like this, that might be that you're thinking of withdrawing your article from consideration at this journal and submitting it elsewhere if the delay is too much longer.\n\nOnly you know how much longer you're willing to wait. However, when you're about two weeks away from your limit, I would send an email along the lines of \"I'm inquiring about the status of my submission titled XYZ, which I submitted in June. I wanted to see if you have an update about the manuscript or when I might hear the results of the peer review. While I would like to proceed with this journal, if I do not hear back within two weeks by [date here], I intend to withdraw the manuscript so that I may submit it to another journal.\"",
      "author": "jogam",
      "created": 1633474976,
      "upvotes": 3,
      "replies": {}
    },
    "hfjb4jx": {
      "link": "/r/AskAcademia/comments/q274i4/asking_for_update_on_journal_manuscript/hfjb4jx/",
      "text": "What does your advisor say? Do they have any experience with this journal? \n\nDoes the journal’s website say anything about usual turnaround on articles?",
      "author": "AceyAceyAcey",
      "created": 1633473531,
      "upvotes": 2,
      "replies": {}
    },
    "hfkn47i": {
      "link": "/r/AskAcademia/comments/q274i4/asking_for_update_on_journal_manuscript/hfkn47i/",
      "text": "In this kind of situation I will hint at the possibility of withdrawal. “We think this is an excellent venue for our work but will eventually need to consider other possibilities if our work cannot be adequately reviewed here” or something to that effect. It usually gets a reply. Also- the tone should always be polite and understanding.",
      "author": "ohnoyoudin",
      "created": 1633499015,
      "upvotes": 1,
      "replies": {}
    },
    "hfkqhkt": {
      "link": "/r/AskAcademia/comments/q274i4/asking_for_update_on_journal_manuscript/hfkqhkt/",
      "text": "I think 2 weeks is fair, and would email again.  One possibility is that the system is set to need 2 reviews, and will then change to required reviews received.  However, if the editor saw the review were diametrically opposite, they might invite a third reviewer. If they did not manually set the required number of reviews to 3, you would only see what you see.  However, they still should have responded to your original email.  If you emailed the journal, I would try to directly contact the editor.  If you directly emailed the editor, I would try to contact the journal.  If you are using the submission system messaging, I would try to find a way to email directly (journal support or editor).",
      "author": "Life_time_learner",
      "created": 1633501628,
      "upvotes": 1,
      "replies": {}
    }
  }
}