{
  "sid": "ou8dvi",
  "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/",
  "title:": "How did academics find research topics before the internet?",
  "text": "I know the common answer is libraries, textbooks, word of mouth, and monographs but I’d like to learn more. Another example is in math research. Many mathematicians will find a proof in a text and their research will be on simplifying that proof or finding inspiration in the one they found, so I’m guessing the way research is conducted in that area didn’t change much.",
  "author": "Ill_Flan_5174",
  "created": 1627599384,
  "updated": 1634082393,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.93,
  "comments": {
    "h70yc3u": {
      "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h70yc3u/",
      "text": "I remember in undergrad one of my professors telling us that physical copies of journals resided in the basement of libraries. This was my communication professor. She told the class that she used to have to go through file cabinets of journals and stacks of books when writing her dissertation to find sources. She wrote her 400 page thesis on a type writer. \n\nFor me, imagine not having a citation generator (or the auto generation from journal sites) and not having a way to do spell check- if you make an error towards the bottom of the page you have to rewrite the entire thing.",
      "author": "SnooTomatoes3816",
      "created": 1627605992,
      "upvotes": 12,
      "replies": {}
    },
    "h7178zt": {
      "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h7178zt/",
      "text": "The difference is that because finding and obtaining journal articles was so difficult (often involving photocopies sent from other universities libraries!) you focused on only the most relevant papers and read them THOROUGHLY. Many papers I read these days cite huge numbers of references but it's often clear that they are not all relevant, haven't been considered in depth, and may often be misinterpreted.",
      "author": "pixiepasty",
      "created": 1627610191,
      "upvotes": 10,
      "replies": {
        "h719s06": {
          "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h719s06/",
          "text": "Part of me wishes it was still like that. Most topics I am interested in (and most papers I read) have at least 30+ citations. This is a really good point though",
          "author": "Ill_Flan_5174",
          "created": 1627611433,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h70xr3o": {
      "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h70xr3o/",
      "text": "Not sure but I imagine it involved reading journal issues that arrive in the mail. Traveling to conferences. And correspondence with colleagues and collaborators by mail or telephone.",
      "author": "dime_a_d0zen",
      "created": 1627605724,
      "upvotes": 9,
      "replies": {}
    },
    "h726p11": {
      "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h726p11/",
      "text": "Lets see - before the internet.\n\nOK.  There used to be something called \"Current Contents\".  It was a little booklet that had basically the content page of several hundred life science and medical journals.  You got title, authors and the corresponding authors address.  That was it.  It was mailed out weekly.  There was some keyword indexing.    We all had little pre-printed postcards, with space for the details, basically asking for a copy of the paper that we filled in and mailed out.\n\nWe would order 50 or a hundred off prints when our paper was published, and so we would happily mail the papers out when the requests came in.  \n\nNow part of the Clarivate conglomerate I believe.",
      "author": "Life_time_learner",
      "created": 1627632958,
      "upvotes": 7,
      "replies": {}
    },
    "h71dja8": {
      "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h71dja8/",
      "text": "The movie a Beautiful Mind shows a montage of John Nash finishing his thesis. He's frantically going through books, typing on his type writer, and since there's no latex he has to leave room when writing on his type writer to hand write equations. \n\n&#x200B;\n\nYou can also find his thesis online, I still can't read his equations.",
      "author": "KingofSheepX",
      "created": 1627613324,
      "upvotes": 4,
      "replies": {}
    },
    "h72e2nb": {
      "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h72e2nb/",
      "text": "It wasn't that long ago. I wrote my undergrad dissertation, and conducted all of my undergrad work by going to library and referring to hardcopy journal copies. Universities had (and in many places still have) huge enormous racks of roller-shelving with hundreds of thousands of journal volumes. So you go through exactly the same process then as you do now,  just using hard copy.\n\nClasses are not really where current reseach is dicussed unless you're at Masters level or above. Current research is discussed in journals. That is where the academic discourse happens (and, of course, at conferences).",
      "author": "OrbitalPete",
      "created": 1627639486,
      "upvotes": 3,
      "replies": {
        "h72w2x2": {
          "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h72w2x2/",
          "text": "Would you say this was less stressful than the plethora of information we have on the internet now, or was it more of a pain?",
          "author": "Ill_Flan_5174",
          "created": 1627651342,
          "upvotes": 1,
          "replies": {
            "h72zoam": {
              "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h72zoam/",
              "text": "It was a complete nuisance compared to the current system. Very often your university would;dn't hold the journals you needed, so you had to wait on inter-library loans to come through. There was no ability to search texts, so you were physically trawling through and reading entire documents to see if they even discussed the topic you were concerned about.\n\nThere was something perhaps more contemplative about being sat in a nice quiet library, but it was a huge time soak compared to what can be done now. And if you want to go and work in a nice quiet library you can still do that.",
              "author": "OrbitalPete",
              "created": 1627653102,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h72emfp": {
      "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h72emfp/",
      "text": "Back, back in the day that's the basis of learned societies. You would assemble to hear the great speakers of the day and present and debate the research.",
      "author": "ACatGod",
      "created": 1627639969,
      "upvotes": 3,
      "replies": {}
    },
    "h718hqz": {
      "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h718hqz/",
      "text": "back in my day, television was called books",
      "author": "RollWave_",
      "created": 1627610795,
      "upvotes": 2,
      "replies": {}
    },
    "h736o27": {
      "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h736o27/",
      "text": "I would say that there are two main differences:\n\nToday you can be reasonably knowledgeable and go from there. With the help of databases etc. you can form a good enough picture of the state of things. Back in the day, you had to be a senior expert to know what research is out there, and what is missing.\n\nYou couldn't search forward in time. If I read a book that was five years old, I knew what research it built on, but I had no way of knowing who built on it since. Therefore you always had to be up to speed to get by. There were no shortcuts.\n\nConferences played a more central part in science as well, I argue. This was often the only way to know what other people were up to, what large projects were ongoing that hadn't published yet, and so on.",
      "author": "molobodd",
      "created": 1627656325,
      "upvotes": 1,
      "replies": {
        "h76knkh": {
          "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h76knkh/",
          "text": "You specifically say books, but for papers you could \"track forward\" by looking at what papers cited that work.  I seem to recall (and this is going back 40 plus years!), that a whole wall of the library had the citation records held in large volumes.",
          "author": "Life_time_learner",
          "created": 1627719312,
          "upvotes": 3,
          "replies": {
            "h76nxis": {
              "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h76nxis/",
              "text": "I don't think we had that. Was it a STEM thing?",
              "author": "molobodd",
              "created": 1627722386,
              "upvotes": 1,
              "replies": {
                "h79sh5c": {
                  "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h79sh5c/",
                  "text": "Science Citation Index and Social Science Citation Index were wrist-wrenchingly heavy tomes...",
                  "author": "pixiepasty",
                  "created": 1627785622,
                  "upvotes": 3,
                  "replies": {
                    "h7aigaj": {
                      "link": "/r/AskAcademia/comments/ou8dvi/how_did_academics_find_research_topics_before_the/h7aigaj/",
                      "text": "That's them!\n\nIt is staggering how far we have come.  All that information at the touch of a key.",
                      "author": "Life_time_learner",
                      "created": 1627804231,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}