{
  "sid": "icvtgf",
  "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/",
  "title:": "My research supervisor doesn't do his work and it's starting to overwhelm me",
  "text": "I started my postdoc a couple months ago, and it's starting to become apparent to me is how much my research supervisor delegates all parts of tasks he should have some kind of hand in. He's also the research director of the lab, so I understand to some extent why he's so busy, but his expectations are starting to overwhelm me. This has become more apparent now that we're collaborating with other even more senior professors and researchers, who do more hands-on production in their projects, like reaching out to potential funders and write portions of papers or funding applications. \n\nCurrently my supervisor has tasked me with identifying applicable funding sources, writing white papers and probably full proposals for this year, as well as keeping up with weekly advances in our research. All of this sounds fairly standard, I'm sure, but I'm also the head of one of the lab's research programs, so I'm over seeing multiple people's weekly advances as well. I've essentially taken on my boss' tasks in this project with minimal training. \n\nI think perhaps I'm trying to figure out if this is normal and I just need to adapt to the workload, or if there is something I need to do to sort of distribute the workload. Has anybody else been in this kind of position?",
  "author": "pocket_world_atlas",
  "created": 1597869254,
  "updated": 1634081902,
  "over_18": false,
  "upvotes": 106,
  "upvote_ratio": 0.96,
  "comments": {
    "g2593wd": {
      "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g2593wd/",
      "text": "The key question here is: is your supervisor not doing what *you think should be* his work, or is he actually not doing any work?\n\nIn the latter case, I admittedly don't have much advice as you're just frankly stuck in a poor situation and will have to make the best of it or else find an escape hatch. If the former case, continue reading...\n\nYou do note that this supervisor is understandably busy. Every PI or lab director has the freedom to choose how to run their lab as long as it leads to things getting done (subject to legal and institutional rules, of course), so it may be a case where your supervisor is putting most or all of his energy into the lab research direction job and delegating specific sub-tasks to other people. Your position as head of a research program would seem to suggest that this is the case.\n\nNoting that you're a fresh postdoc, I'd remind you that the goal of a postdoc is not just to be a second PhD without a course load, but rather is meant to be a career stage where you are developing and demonstrating the skills needed to be an independent, professional researcher. Critically, these skills include a very heavy dose of identifying funding sources, submitting proposals, working with collaborators, and so on - in addition to the necessary tasks of directing and conducting research using said funding in order to secure more funding, of course. In light of this, it sounds to me like the tasks your supervisor is assigning to you are well in-line with your role as a project head - as a project head, a large part of your role is to make sure that the research area you oversee is supported and to identify opportunities for impact in that area which can open up further opportunities.\n\nIf you feel like your workload is too much, therefore, consider if you are expecting yourself to do too many of the things you're *used* to doing from a previous PhD (or postdoc, I don't know your life) which perhaps in this lab you should be delegating down to the people you're responsible for leading. If you are a project head, then perhaps (as an example) you should not expect to spend much if any time actually at the lab bench doing the menial or technical work of the research, but instead engaging primarily at the intellectual level i.e. discussing results with colleagues, overseeing design of experiments, leading on papers/proposals, and so on - focus on using your time efficiently to keep your project area running rather than being thorough and doing everything yourself. I'd suggest also having an open conversation with your supervisor to help clarify expectations, as well as communicating with other postdocs in the lab who are in similar positions (heads of other projects and so on) for advice and clarification.\n\nAs a side note, try to avoid comparing with how other senior researchers run their labs or groups. As mentioned, every PI approaches their job differently based on what works well for them as well as, frankly, what they like doing. The seniority of a researcher has little to do with this - some old hands will keep their groups smaller so they can do less management and more hands-on work that they enjoy, while some young up-and-comers will try to build a large lab with multiple subgroups and postdocs and prefer the high-level managing work.\n\nAnd again - if your supervisor is just being a lazy ass and offloading everything on his employees so he can take an 8-hour siesta every day, little of the above applies and I have nothing to offer but my sincere condolences on your situation.",
      "author": "nuclearslurpee",
      "created": 1597871887,
      "upvotes": 80,
      "replies": {
        "g25c21j": {
          "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g25c21j/",
          "text": "To address your first question: he simply doesn't do his work. Time and time again when asked by me or others to do something-- send an email, provide feedback on something, sign papers to approve a student's research funding, these tend not to get done until the very last minute when it's absolutely critical for some action to be taken. Which isn't to say that he's lazy, just so scattered he can't get work done outside meetings. It seems to me that his days are more or less scheduled back to back with meetings, leaving little if any time to anything else. \n\nFor example, part of one of his action items was to read and give comments on a 1-pg funding document we are collaborating on. He had an entire week to give me feedback on what he wanted changed, but he waited til the day before it was due to me into a last minute meeting so he could read what I had written and give comments. This appears to be a pattern with his work habits: do all work inside direct meetings with the other person whom he needs to do that work with. I think it isn't laziness but maybe poor time management.\n\nAs for my own workload, my supervisor has made it very clear he expects me to be doing the vast majority of the theoretical and applied research on the project, as well as added admin and staff duties. Due to the covid situation, the amount of undergrads we can afford to hire has dropped, and currently we only have one working with us. I am doing data collection and analysis alongside identifying funding sources and outreach. I can reach out to my supervisor and see if they can approve another undergrad or two for data analysis, but most of the undergrads are for a different project.\n\nAlso I am the only postdoc in this lab. It's a fairly young lab, I think it's about 5 years old at this time, and aside for the student researchers, there's only three to five other staff members beside me. \n\nI will however try to avoid comparing other labs run against mine. There are many good points to my lab that I appreciate, I'm just trying to find a way to understand and navigate the position I'm in.",
          "author": "pocket_world_atlas",
          "created": 1597873353,
          "upvotes": 17,
          "replies": {
            "g25l134": {
              "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g25l134/",
              "text": "Sounds like a mix of both situations then, which is unfortunately quite shitty but hopefully manageable.\n\nIt definitely sounds like your supervisor is struggling with time management which is unfortunately common for PIs as the time burden of meetings upon meetings is not easy to plan for.\n\nI suppose I would suggest taking your observation of your supervisor's own difficulties as a sign of caution and prioritize your own time management. Try to block out time to make sure that every major task or set of tasks you have under your purview is worked on at some time during a day or week and stick to a reasonable schedule. With that established try to get a handle on how much work is realistic in each area based on the time you have available to you as well as what your priorities need to be. Unfortunately you're in a tight spot where the lack of students would indicate that you need to pursue funding aggressively to pay for additional graduate student researchers, but as a postdoc you do not really have the time to wait for funding and students as you need to get results, publications, etc. onto your CV as soon and as often as possible. The silver lining is that if you can learn to manage this, your own career as a PI will be hopefully much easier.\n\nA last word on time management: make sure to prioritize yourself and your ability to work as you go about setting up your personal system. By which I mean, be conscious of burnout, exhaustion, etc. and do not force yourself to work beyond your limit of productivity just because you have a lot on your plate. Pare down and prioritize and the work you do get done will be of a much higher quality and efficiency.",
              "author": "nuclearslurpee",
              "created": 1597878011,
              "upvotes": 14,
              "replies": {
                "g25sq0h": {
                  "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g25sq0h/",
                  "text": "To add to this, if you know your supervisor struggles with time management, give them earlier deadlines to review things. Tell him you need it 2 days before it’s due so you can make the edits before sending out. Make weekly task lists to send him of the things you need.",
                  "author": "clubtropicana",
                  "created": 1597882150,
                  "upvotes": 17,
                  "replies": {}
                },
                "g25vas5": {
                  "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g25vas5/",
                  "text": "Thanks for the suggestion of adhering to a schedule. It would probably at the very least give my brain an easier time digesting the amount of work if I partition it out. I hope that figuring out the most effective and sustainable way to do this now will pay off in the future. \n\nI will keep in mind to prioritize myself. I was pretty burned out at the end of my PhD, and launching straight into my postdoc has not really alleviated it. Maybe I can work in small breaks through the day.",
                  "author": "pocket_world_atlas",
                  "created": 1597883534,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "g268rer": {
              "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g268rer/",
              "text": "Lots of good advice in this post (for myself too as a junior PI). \n\nI know easier said than done, but you need to be outcome oriented—meaning what do you need to have happen (I assume papers) and then work backwards from there. If you realize that you don’t have enough resources/time, then you need to figure out what can be jettison (as you said below, some can be delegated; some that are more important to the PI than to you [like some regulatory work or grant writing] can be diplomatically put back on the PI (easier said than done, I know). \n\nAs far as “easy things that don’t get done by PI” (like approving conference abstract, 1page funding doc etc... I would just schedule regular meetings with him and have him do it there. \n\nIn my post-doc and grad school, many times I said working on my laptop during a 1on1 meeting with my PI while the PI sat there and marked up a manuscript etc. \n\nAnd employ “monkey on the PI’s back” thinking (I never knew the HBS article cited below but it made concrete what I think many of us subconsciously know)—e.g., if you have an abstract due for a conference, email it and say, fyi, the abstract is due Sept 1st, so please let me know any comments, otherwise I’ll submit it as it is... if your PI blocks you from submitting but won’t edit it on time...then you either have to do the “sit in a meeting while s/he reads it” or have a talk about how pi has to do one or the other... I know all of this is stuff you know but harder to effect in practice",
              "author": "schizontastic",
              "created": 1597890918,
              "upvotes": 10,
              "replies": {}
            },
            "g2666cy": {
              "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g2666cy/",
              "text": "I don't work in research but I'm familiar with the in-meeting work habit. It also happens to me when I'm truly overburdened. What works for me and might work for you is go with it- don't give him a document to review and 1 week to do so, send him a calendar invite for 30 min to review it with the doc attached. Then it's done.",
              "author": "wannabesoc",
              "created": 1597889468,
              "upvotes": 8,
              "replies": {}
            },
            "g26a1ch": {
              "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g26a1ch/",
              "text": "[deleted]",
              "author": null,
              "created": 1597891638,
              "upvotes": 2,
              "replies": {
                "g26cav3": {
                  "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g26cav3/",
                  "text": "I may not have made some of these points clear in my earlier post and replies, but the only reason I anticipate these things being done is that he said he would do them by XYZ time. As in, he has stated he will do work at this time, or will have it done by that time. Rather than nagging, I assume he will get to it. I have found that in the majority of the cases, he isn't doing the work. \n\nPerhaps part of the reason why I am so edgy about this is because we are currently in the process of finding and applying for grants. There are certain actions that he alone is able to do that directly affect whether or not we actually make a proposal. If we do not send out a proposal and get awarded one, I will not have a job next year. My lab will not have money to fund me or other workers.\n\nSo I think perhaps the reason I'm so hard on my boss' work habits is that I'm more worried about my job. Him not doing things directly impact whether or not I will have money for next year.",
                  "author": "pocket_world_atlas",
                  "created": 1597892929,
                  "upvotes": 4,
                  "replies": {
                    "g26ebz6": {
                      "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g26ebz6/",
                      "text": "It just seems like you're low on his priority list and the many meetings he has is higher. If he's not helping you out with things that are important to you, consider finding another PI where you are a priority. How are you funded now? If you're a \"free\" postdoc to him, and he hasn't committed to funding you a second year, then it sounds like he might just expect you to be around for one year.",
                      "author": "ivyprof",
                      "created": 1597894178,
                      "upvotes": 3,
                      "replies": {
                        "g27qum2": {
                          "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g27qum2/",
                          "text": "I'm afraid I don't know what you mean by \"free postdoc\", but I head one of the major projects in the lab, carried over from my PhD. I suspect he hasn't committed to funding me for a second year because there are no available funds for anyone past this year, which is why he has us all looking around for grants so we have our salaries for next year.",
                          "author": "pocket_world_atlas",
                          "created": 1597933067,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "g272q3e": {
                      "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g272q3e/",
                      "text": "> but the only reason I anticipate these things being done is that he said he would do them by XYZ time.\n\nnot to jump in on you but I've been in your supervisors position and basically something came up or took longer that has a higher priority so because I had time to but back 'your' request and still get it done by the deadline I pushed back 'your' request, I get that from the PhD/Postdoc perspective this is frustrating but I've got more than can be done in a week on my plate so I have to juggle things",
                      "author": "tc1991",
                      "created": 1597914588,
                      "upvotes": 1,
                      "replies": {
                        "g27qipe": {
                          "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g27qipe/",
                          "text": "And this is totally understandable, and something I've figured a while ago. The problem is that once we get back together for some meeting or other, he suddenly realizes the urgency of the things he's been putting off with me, and tries to slide some of the more pressing tasks on me regardless of whether or not I'm capable of doing it. For example, suggesting I email his industry colleagues, when I have neither their addresses nor any previous contact with them that would merit a cold email.",
                          "author": "pocket_world_atlas",
                          "created": 1597932899,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g26qrca": {
              "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g26qrca/",
              "text": "I have ADHD and your boss sounds a lot like me. I thrive on deadlines. I also am most effective inside meetings. I recognize that this sucks for other people, so I try to set up working sessions instead, where I get the added urgency of another person's presence without them wasting time watching me figure my life out. Maybe you can do something similar with him? Set a \"writing session,\" and bring something else you can do (not immediately, but pick it up once he's engaged) so you don't have to just watch him read your work. If it is stressful for you that the work be happening so close to the deadline, set the session a couple weeks ahead of that. \n\nOther things that work for me & may work for your boss include:\n\n- specific, clearly stated goals & tasks\n\n- deadlines that are meaningful, aka I understand why it is important that this thing be done by that time\n\n- patience when I fuck up\n\n- relaxed reminders of things that I've missed\n\nIf he legitimately just isn't capable of doing the work, that's obviously a bigger issue. Maybe learning a little about ADHD would make it clearer to you whether he just does things in a disorganized / unusual way, which you might be able to find ways to work with, or if he genuinely isn't doing anything.",
              "author": "k10ftw",
              "created": 1597902946,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g26jfen": {
          "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g26jfen/",
          "text": ">Noting that you're a fresh postdoc, I'd remind you that the goal of a postdoc is not just to be a second PhD without a course load, but rather is meant to be a career stage where you are developing and demonstrating the skills needed to be an independent, professional researcher. Critically, these skills include a very heavy dose of identifying funding sources, submitting proposals, working with collaborators, and so on - in addition to the necessary tasks of directing and conducting research using said funding in order to secure more funding, of course. In light of this, it sounds to me like the tasks your supervisor is assigning to you are well in-line with your role as a project head - as a project head, a large part of your role is to make sure that the research area you oversee is supported and to identify opportunities for impact in that area which can open up further opportunities.\n\nI'm sorry I'm gonna call bullshit here.  Part of a postdoc may involve these things to some degree, but this really sounds like a full time job.  OP's *boss'* full time job.  A postdoc should be focused on research, not administration.\n\nThe time management stuff is also a disrespectful use of OP's time.  Sitting there and reading the paper in the meeting -- come on.",
          "author": "dampew",
          "created": 1597897451,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "g25hvda": {
      "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g25hvda/",
      "text": "The job of a manager is to manage, not do things yourself. Managing involves prioritizing, figuring out what is important and what is not important, figuring out who to delegate it to, delegating it to someone and following up on the progress and control the flow of information (all roads lead to rome).\n\nThe job of your boss is to make you (and your peers) do all the work and supervise that it gets done. It's not as easy as it sounds, otherwise we wouldn't need managers. It's a full time job just to be aware of everything that is going on. Decision making is another full-time job.\n\nThat's why for example in the military you have a commanding officer and then an executive officer. One makes all the decisions, the other one is the one that actually passes on those decisions and manages the people below to actually do all the work. You sound like an \"XO\", the guy that runs day-to-day operations while the \"CO\" is running around getting yelled at by his superiors and figuring out how to implement their vision.\n\nIf you think that \"job training\" is a thing in academia, then you're in for a surprise. Your PhD was it, rest is on you to figure out.\n\nIn the corporate world, you're lucky if you actually see your manager. They spend 90% of their time in meetings with their bosses and descend from the mountain once a week to delegate and then go back up.\n\nRemember, shit flows downwards. Find some PhD students/research assistants to delegate as much work to as possible. If you don't have any, go find some.\n\nWhen I did my PhD, we were the ones that got to write portions of funding applications and portions of papers. The professor would hand it over to the post-doc, the post-doc would hand it over to us and we would hand it over to masters students/research assistants/interns. It takes less time and effort to supervise work than to do it yourself and eventually they get better at it so you barely need to even check it.",
      "author": null,
      "created": 1597876346,
      "upvotes": 13,
      "replies": {
        "g25vrnr": {
          "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g25vrnr/",
          "text": "I think I probably need to take your advice and go scrounging for students to delegate work to. There's certainly at least two or three things I can think off the top of my head this past week I needed someone to work on while I did other things.",
          "author": "pocket_world_atlas",
          "created": 1597883789,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "g260hht": {
      "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g260hht/",
      "text": "I sincerely recommend you both to read the following paper on time management:\nhttps://hbr.org/1999/11/management-time-whos-got-the-monkey\nEnjoy.",
      "author": "data-an-sich",
      "created": 1597886366,
      "upvotes": 5,
      "replies": {
        "g26b2qp": {
          "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g26b2qp/",
          "text": "Yeah, this has a very \"who is working for whom?\" vibe.",
          "author": "rlrl",
          "created": 1597892231,
          "upvotes": 3,
          "replies": {}
        },
        "g2680gq": {
          "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g2680gq/",
          "text": "Thanks, this should be required reading for a new PI!",
          "author": "schizontastic",
          "created": 1597890496,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g26htgo": {
      "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g26htgo/",
      "text": ">Currently my supervisor has tasked me with identifying applicable funding sources, writing white papers and probably full proposals for this year, as well as keeping up with weekly advances in our research. All of this sounds fairly standard, I'm sure, but I'm also the head of one of the lab's research programs, so I'm over seeing multiple people's weekly advances as well. I've essentially taken on my boss' tasks in this project with minimal training.\n\nWhat field are you in?  I never did this stuff as a postdoc and I don't know anyone who does.  This is full-time work.  You won't have time for your own research if you do this stuff.",
      "author": "dampew",
      "created": 1597896402,
      "upvotes": 5,
      "replies": {
        "g27pv22": {
          "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g27pv22/",
          "text": "This is what I've been discovering. I'm in an interdisciplinary lab that does computer science and cognitive science. I wish we had a grant writer or something similar, but I doubt my supervisor would want to spend the money on one.",
          "author": "pocket_world_atlas",
          "created": 1597932557,
          "upvotes": 1,
          "replies": {
            "g280dgs": {
              "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g280dgs/",
              "text": "You do.  It's your boss' job.",
              "author": "dampew",
              "created": 1597937648,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g26l1ja": {
      "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g26l1ja/",
      "text": "I feel like this is a somewhat common from advisors in my field, and imo, can be a way to mask their own feelings of overwhelm and incompetence.\n\nThe problem with this method, as I've seen, is that a professor who delegates out their whole job (and doesn't oversee it closely) loses touch, and slowly becomes more incompetent. Someone who hasn't touched a dataset in 15 years can't answer your analysis questions because they can't analyze data.\n\nOne reason I think that people do it (in my field) is to get plausible deniability in the case of a scandal. \"Oh, you had a problem with that analysis? I actually allowed my student to analyze that data and had no idea it was incompetent\".",
      "author": "fiftycamelsworth",
      "created": 1597898563,
      "upvotes": 2,
      "replies": {}
    },
    "g26z15h": {
      "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g26z15h/",
      "text": "I am so thankful for this posting... I am dealing with a similar situation: I am trying to publish an article but my coordinator is not reliable. He is asking me for all sort of \"improvements\" on the research paper but when it comes to his feedback, he is not reachable anymore. This is so frustrating...so I didn't think until now that there are some others that are facing the same problem. All your advices are useful so I will try to apply them also. Hope it will work out:)",
      "author": "scanteitza",
      "created": 1597910728,
      "upvotes": 1,
      "replies": {}
    },
    "g2696vd": {
      "link": "/r/AskAcademia/comments/icvtgf/my_research_supervisor_doesnt_do_his_work_and_its/g2696vd/",
      "text": "Step up! While I’m sure your supervisor may not be doing what you want, he is expecting you to be  a lot closer to an assistant professor than a PhD. This is for you. Get the things you need and then apply for a job. Academia is hard work.",
      "author": "FoCoCS",
      "created": 1597891160,
      "upvotes": 1,
      "replies": {}
    }
  }
}