{
  "sid": "ivahfn",
  "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/",
  "title:": "I work seems pointless",
  "text": "I recently graduated undergrad. I was super diligent and got to publish my senior thesis to a conference. I just recently spoke at a conference on said paper. \n\nI am enrolled in a masters program, I know I want to be a professor/researcher and do a PhD and the whole shebang. \n\nBut with the conference, listening to everyone’s presentations on small details of hypothetical scenarios ... I am just left thinking, is any of this important? Why am I spending my time on this, when the world is going to crap? \n\nI don’t think that I dislike research... I think that I need to move to another field  that is a little more applied and tied to real world problems.\n\nHas anyone else felt this way before? Would love to hear stories.\n\nMaybe I just depressed at the pandemic/climate change/political environment etc.\n\nEdit: rip title, “MY work”",
  "author": "willmartian",
  "created": 1600450024,
  "updated": 1634080619,
  "over_18": false,
  "upvotes": 234,
  "upvote_ratio": 0.98,
  "comments": {
    "g5q9u1v": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5q9u1v/",
      "text": "You are coming into the world at a very strange time. There are times of stability where people focus on themselves, and times of instability where their attention is necessarily turned outwards to the systems that surround them. America has been in the former basically for the entirety of our parents generation so they’ve given us a set of expectations for life that were made for a static prosperous time. The world we are prepared for is not the world as it is. We will need to deal with much more complex and difficult and borderline dangerous work than they ever had to face. Do not hold yourself to their ambitions, they are just telling you what they understand of their world, however their entire model and understanding has been shown to be obsolete.\n\nFor your own sake, persist with your career, you’re gonna need it in the times ahead. I would offer a suggestion, that your source of discomfort is not that you are focused on your work, but that you sense you need to gain an awareness of what’s going on with the world. I think there are many people that feel this way right now. Please continue to explore your understanding of the world, I suggest History to give you perspective that we are not alone as people in the distant past have been in our shoes, make your own opinions, and think of ways you might influence the system for good. All while you simultaneously do your work and I assure you will feel more complete.\n\nYour feelings are 100% valid, not because your work is unimportant but because current events have become more important relatively. Our parents generation can't help us as they have no perspective. Look to our grandparents or great-grandparents generation for guidance on how to exist and be happy in a troubled world. All you need to be happy in life is friends, food and shelter, we still live in good times, we are just restless because we are pushed to ridiculous standards.\n\nYou're very lucky to have made it into a graduate program, there are many which are not giving funding for 2020-2021 cycle. This is a great time to be in a graduate program, as normally the downside of graduate school is the opportunity cost of working in the prosperous industry job market. So on the bright side, you're not missing out on anything.",
      "author": "otterpigeon",
      "created": 1600454640,
      "upvotes": 80,
      "replies": {
        "g5qwyu5": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qwyu5/",
          "text": "Thank you for this",
          "author": "willmartian",
          "created": 1600465544,
          "upvotes": 8,
          "replies": {
            "g5rbxx8": {
              "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5rbxx8/",
              "text": "No problem at all, I wish someone told me that years ago. I’ve felt like I’ve just been constantly gaslit my whole life by my parents generation to believe that everything is fine, which led me to freak out at the walls I was constantly hitting (I say this as a BS STEM grad with a a handful of publications with 100’s of cites between them, the market is fucking hard right now). Only now that everyone seems to agree there is a problem, do I see now that the goal of our generation is not to be personally successful and learn to game and exploit the system as our parents did. Our purpose is to reject the gaming of the system which has so corrupted it, and bring the value of morality and simple reason back in spite of the system we live in.\n\n\nI’d like to believe the world isn’t going to crap. We’re just noticing it more, and the instability we are facing is not only an inevitable consequence of recognizing the inequalities in our system, it is also an opportunity for us to influence the world and make it a better place.",
              "author": "otterpigeon",
              "created": 1600473353,
              "upvotes": 29,
              "replies": {
                "g5scalb": {
                  "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5scalb/",
                  "text": "This reads like a very important conversation.",
                  "author": "crushedbycookie",
                  "created": 1600493058,
                  "upvotes": 9,
                  "replies": {}
                },
                "g5skjmr": {
                  "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5skjmr/",
                  "text": "Wish I could upvote this more than once!",
                  "author": "alix992",
                  "created": 1600499545,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "g5t3bv7": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5t3bv7/",
          "text": "This was very well put. Thank you for writing it.",
          "author": "MandieMoore",
          "created": 1600519205,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g5q51bk": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5q51bk/",
      "text": "Have you read Andrew Kay's essay called \"Fanning the Flames While the Humanities Burn\"? From your post it doesn't sound like you're in the humanities, but in this essay Kay talks at length about the seeming frivolity of hyper-niche research that doesn't seem to affect anyone else and the commiserate disheartenment. It's definitely worth a read, even if you're not in the humanities.\n\nEdit: The Kay article is actually called \"Academy's Extinction Event.\" \"Fanning the Flames\" is a response to it by Anastasia Berg. They're both worth a read, but I wanted to make sure I was referencing the correct piece.",
      "author": "augusyy",
      "created": 1600452197,
      "upvotes": 127,
      "replies": {
        "g5sce3u": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5sce3u/",
          "text": "Academy's Extinction Event: [https://www.chronicle.com/article/academes-extinction-event-failure-whiskey-and-professional-collapse-at-the-mla/](https://www.chronicle.com/article/academes-extinction-event-failure-whiskey-and-professional-collapse-at-the-mla/)  \n\n\nFanning the Flames: [https://www.chronicle.com/article/fanning-the-flames-while-the-humanities-burn/](https://www.chronicle.com/article/fanning-the-flames-while-the-humanities-burn/)",
          "author": "crushedbycookie",
          "created": 1600493139,
          "upvotes": 10,
          "replies": {}
        },
        "g5r01y4": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5r01y4/",
          "text": "> Fanning the Flames While the Humanities Burn\n\nI'm finding something called \"Academe's Extinction Event\" by Andrew Lay, and an article called the quoted text by Anastasia Berg which references it. Is there a different article, or is that the one?",
          "author": "dumbnerdshit",
          "created": 1600466956,
          "upvotes": 7,
          "replies": {
            "g5r12ns": {
              "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5r12ns/",
              "text": "Sorry about that -  \"Academy's Extinction Event\" is the Kay  essay that I was referring to. \"Fanning the Flames\" was Anastasia Berg's reply to another article criticizing Kay's original essay. A little muddled, I know, but Kay's article (Academy's Extinction) is what I meant originally. Hope that clears things up!",
              "author": "augusyy",
              "created": 1600467458,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "g5q984m": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5q984m/",
          "text": "Thank you for this recommendation!",
          "author": null,
          "created": 1600454332,
          "upvotes": 5,
          "replies": {}
        },
        "g5q7x57": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5q7x57/",
          "text": "Is there any way to come to terms with it?",
          "author": "JustSkipThatQuestion",
          "created": 1600453673,
          "upvotes": 8,
          "replies": {
            "g5q8rqz": {
              "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5q8rqz/",
              "text": "I'm not sure. For Kay, it meant leaving academia (for a host of other reasons, too). But I don't think that's what it has to mean. For many, realizing that studying *anything*—no matter how seemingly frivolous or insignificant—is an expression of and tribute to the vastness of human curiosity, part of our innate desire to understand the universe we live in. So even if your area of interest is seemingly inconsequential or irrelevant to \"practical concerns\" or \"the big picture,\" you can know that whatever discoveries or realizations you make are contributions to the pursuit of knowledge—even if (and notwithstanding) you're the only one who might ever know or care. Just my two cents!",
              "author": "augusyy",
              "created": 1600454103,
              "upvotes": 68,
              "replies": {
                "g5qas7o": {
                  "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qas7o/",
                  "text": "People don't have food to eat and here you want to understand the universe.",
                  "author": null,
                  "created": 1600455125,
                  "upvotes": -60,
                  "replies": {
                    "g5qeaaa": {
                      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qeaaa/",
                      "text": "Yes? As people have throughout human history? There is no reason why having a highly specific interest in some niche area precludes a desire to help people gain sustainable access to food. Not everyone can work for a nonprofit -- in fact, the vast majority of people work in fields entirely unrelated to humanitarian relief. That doesn't make them bad people. Sometimes volunteering on the weekend is going to have to do.",
                      "author": "augusyy",
                      "created": 1600456966,
                      "upvotes": 35,
                      "replies": {
                        "g5qhb5d": {
                          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qhb5d/",
                          "text": "Additionally, if the powers that be would actually use the knowledge humanities provide for a good cause, we could have had far fewer people going hungry.",
                          "author": "samadsgonetown",
                          "created": 1600458542,
                          "upvotes": 19,
                          "replies": {}
                        }
                      }
                    },
                    "g5r5sf5": {
                      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5r5sf5/",
                      "text": "Man doesn't live on bread alone, right?",
                      "author": "nallgire1",
                      "created": 1600469844,
                      "upvotes": 10,
                      "replies": {}
                    },
                    "g5slmfo": {
                      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5slmfo/",
                      "text": "People like you are the reason India, my home country, is one of the unhappiest places on the planet. You don't understand that to live a happy life, people need to have a purpose.",
                      "author": "obitachihasuminaruto",
                      "created": 1600500610,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "g5qcxa9": {
                  "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qcxa9/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1600456251,
                  "upvotes": -48,
                  "replies": {
                    "g5qepn4": {
                      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qepn4/",
                      "text": "hey you. get a life",
                      "author": "augusyy",
                      "created": 1600457191,
                      "upvotes": 23,
                      "replies": {
                        "g5qh0i1": {
                          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qh0i1/",
                          "text": "*And* something other than Sam Harris to fill its miserable hollowness.",
                          "author": "samadsgonetown",
                          "created": 1600458387,
                          "upvotes": 10,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g5q9ror": {
              "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5q9ror/",
              "text": "One thing I think about is the extent to which we need to step away from considering our work as atomized, individualistic projects. While any one paper might not be terribly significant, it is all part of a larger conversation that continually moves the field forward. Don't think about the \"text\" at the level of your own work, consider the ways in which everyone is producing a much larger work collaboratively and rhizomically.",
              "author": "PogueMahone82381",
              "created": 1600454607,
              "upvotes": 34,
              "replies": {
                "g5rf979": {
                  "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5rf979/",
                  "text": "This is a great perspective. It also reminds me that academia often encourages or romanticizes isolation--even in disciplines that depend on collaboration. This perspective helps to push against that illusion.",
                  "author": "synthesis-synthesis",
                  "created": 1600475134,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "g5qa6ta": {
              "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qa6ta/",
              "text": "As a historian, I only see my work becoming more relevant in the current day and age. When I teach students about race, Civil War memory, the systemic forms of inequality and their legacies, I feel like it actually matters. My point is that your research doesn’t have to be useless. You can make sure that you study something that you think matters.",
              "author": "crimbuscarol",
              "created": 1600454821,
              "upvotes": 20,
              "replies": {
                "g5rhddv": {
                  "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5rhddv/",
                  "text": "This is very true. But history always feels like its relevant. I think its much harder to think this way when your papers are fundamentally incremental chisels. Not to say history is also incremental, but it doesn't feel that way.",
                  "author": "way2mchnrg",
                  "created": 1600476296,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "g5rmmad": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5rmmad/",
          "text": "Is there a link online to read it without having to make an account?",
          "author": "b29superfortress",
          "created": 1600479018,
          "upvotes": 1,
          "replies": {
            "g5rmwqt": {
              "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5rmwqt/",
              "text": "I think so. I know the Chronicle has it locked behind a paywall, and I originally read it with a university subscription. But I found it again a couple months ago for free somewhere online, though I can't remember where. I think it was as a PDF somewhere",
              "author": "augusyy",
              "created": 1600479149,
              "upvotes": 1,
              "replies": {}
            },
            "g5sb565": {
              "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5sb565/",
              "text": "there is, kinda- I just used a temp-mail to sign up for and a fake name",
              "author": "_donotforget_",
              "created": 1600492122,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g5q4nlp": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5q4nlp/",
      "text": "That isn't just your field. Research is incremental, the more you understand how those small steps translate into large understandings, the sooner you can see the importance in your own small steps. If you're looking for big findings, go back in time, not to a different program.",
      "author": "rosealyd",
      "created": 1600452005,
      "upvotes": 32,
      "replies": {
        "g5ulrhh": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5ulrhh/",
          "text": "While I agree that its important to find satisfaction in the incremental steps of research, if only to keep your sanity, I don't think it's right to say you have to go back in time to make big findings. \n\nSure, highly developed fields may seem mined out and need more incremental work to get us to the next breakthrough, but all of that chipping away can separate the field from the rest of the scientific community. As research gets more and more niche, the gap opens up for interdisciplinary work, creating new fields at the intersection of various fields.\n\nFor example, my field is computational cognitive neuroscience. If machine learning hadnt developed to give a variety of modeling perspectives, neuroscience hadn't rigorously mapped types of transmitters, neurons, and connectivity, and if we didn't have carefully gathered behavioral data from psychology, CCN couldn't have developed.",
          "author": "deathofamorty",
          "created": 1600543011,
          "upvotes": 1,
          "replies": {
            "g5vfi39": {
              "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5vfi39/",
              "text": "Sure there are big discoveries being made but people should be realistic on their chances of being one to make them.",
              "author": "rosealyd",
              "created": 1600553414,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g5q4r0z": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5q4r0z/",
      "text": "Use your position as an academic to organize and agitate for societal change.",
      "author": "Onion-Fart",
      "created": 1600452052,
      "upvotes": 41,
      "replies": {
        "g5q70qu": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5q70qu/",
          "text": "Yesss!! Additionally, not sure if it's possible in OP's field but a lot of research can be done organising with communities that one may feel passionately for.",
          "author": "kevinfire2015",
          "created": 1600453212,
          "upvotes": 9,
          "replies": {}
        },
        "g5rfpwg": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5rfpwg/",
          "text": "Yes! And remain aware of how exploitation operates specifically within academia (i.e. the treatment of adjuncts) and push against that as well.",
          "author": "synthesis-synthesis",
          "created": 1600475394,
          "upvotes": -1,
          "replies": {}
        }
      }
    },
    "g5qol88": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qol88/",
      "text": "I agree.  I worked in a humanitarian field before academia with life and death stuff.  Now as a professor it's just stunning that people get so worked up about things which matter so little and that the tenure system is built around producing largely meaningless work instead of emphasizing teaching which has genuine real-world impact.  Bleh.",
      "author": "saltsage",
      "created": 1600461771,
      "upvotes": 11,
      "replies": {}
    },
    "g5qieoo": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qieoo/",
      "text": "> But with the conference, listening to everyone’s presentations on small details of hypothetical scenarios ... I am just left thinking, is any of this important? Why am I spending my time on this, when the world is going to crap? \n\nIt could be depression from current state of the world getting to you; but it could also be a deeper truth reveling itself to you as well. Practically speaking not enjoying the work you are doing, or seeing the value of the work you are doing is a sign that in the long run you will not be happy in a *very* demanding career. \n\nBack before I did my graduate studies a couple of my colleagues (I was a programmer at the time) advised me to avoid research into computer science since \"all of the low hanging fruit has been plucked, and most people are not happy with making an incredibly small improvement to a known solution.\" They weren't wrong and I ended up doing my graduate studies in a computer science adjacent field (computational science and engineering) where the focus is less on the incremental improvements can be more on the big problems (e.g., climate change, public health, etc.). \n\nMy experience has generally been that those thoughts don't really go away. Some people thrive looking at incredibly niche topics purely due to the intellectual joy they experience; however, other people enjoy knowing that their work has a measurable (if small) impact upon the broader world around them. If you are in the category it might not be such a bad idea to explore interdisciplinary (or even transdisciplinary) research if you want to stay adjacent to where you started. Of course, there's also nothing wrong with changing disciplines as well! I've known people over the years that started in A, got their PhD in B, ended up in C as professors, and eventually retired a couple more steps removed!",
      "author": "ManInBlackHat",
      "created": 1600459062,
      "upvotes": 9,
      "replies": {}
    },
    "g5q4qjq": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5q4qjq/",
      "text": "I feel exactly the same way and I am an assistant professor in Biomedical engineering. I wish I could start over in greentech or  just something that would make a difference for the environment. \n\nWhat use is a tissue engineered kidney is all the water is polluted anyway...",
      "author": "dqsl",
      "created": 1600452045,
      "upvotes": 29,
      "replies": {
        "g5r8hvo": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5r8hvo/",
          "text": "Water person here - we're on it! But people will still need kidneys when we're done (and until then), so keep at it.",
          "author": "Lelislazuli",
          "created": 1600471415,
          "upvotes": 17,
          "replies": {
            "g5vngdb": {
              "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5vngdb/",
              "text": "Can you help me switch career?",
              "author": "dqsl",
              "created": 1600556136,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g5qejej": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qejej/",
          "text": "This kind of hurt. I'm in humanities and I've always thought that a field like yours got to feel relevant or important.",
          "author": "AnnaGreen3",
          "created": 1600457099,
          "upvotes": 16,
          "replies": {
            "g5vnch4": {
              "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5vnch4/",
              "text": "The field is important - but not as important as greentech. Biomedical engineering does get a lot more funding because 1) There's money to be made 2) there's money to be made. The thing is that a lot of the progress you read about e.g. 3D printed organs is just research going around in circles. Case in point: the infamous Atala TED talk which is now about 10 years old.",
              "author": "dqsl",
              "created": 1600556100,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "g5r87u9": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5r87u9/",
          "text": "It's not quite the same, but in the last few years I pivoted directly onto social justice work, from an applied but much more esoteric niche. I don't regret it, I think, but it is was just trading one set of problems for another. Of course, I always thought these issues were important and addressed them from the perspective of my little world, but it's another thing to work in it day in and out. Crushing doom is a common experience for me now. I don't work in climate change or greentech but I can only imagine it's similar. You're on the side of progress and there's true comfort in that, at the same time you're also neck-deep in the futility of it all, because the problems are all you read and talk about.\n\nI think this is certainly a grass-is-greener situation, overall.",
          "author": "arrrrr_won",
          "created": 1600471250,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "g5remr2": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5remr2/",
      "text": "Have you read Chomky's essay on \"The Responsibility of Intellectuals\"?\n\nIf not, I'd think you'd enjoy it: https://chomsky.info/19670223/",
      "author": "TibiaKing",
      "created": 1600474788,
      "upvotes": 6,
      "replies": {}
    },
    "g5r8s85": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5r8s85/",
      "text": "You might be better suited for a research-type career in public service. When you work for government you can do interesting work, and once you hit more senior levels you can also influence budgetary measures that can have a real and immediate impact out in the world.",
      "author": "jimmythemini",
      "created": 1600471585,
      "upvotes": 3,
      "replies": {}
    },
    "g5rser9": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5rser9/",
      "text": "The truth is, I think, that most of us wont do any truly revolutionary research. What we will do is contribute to a larger body of knowledge. Every bit of research is something that wasn't known before. It might not make a huge difference now but the little things build up over time. \n\nI think too that many, if not all fields are tied to real world problems once you dig into them.",
      "author": "InNeedOfGoats",
      "created": 1600481652,
      "upvotes": 5,
      "replies": {}
    },
    "g5qhhm7": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qhhm7/",
      "text": "That's what depressed me. Plus the idea that any good, scholarly work I create will be read by a few hundred people, tops.",
      "author": "dali-llama",
      "created": 1600458637,
      "upvotes": 3,
      "replies": {
        "g5t2v00": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5t2v00/",
          "text": "but they’ll take it and do the same with a different few hundred people and each of those few hundred with another few hundred until what was good about your idea is infused throughout the world",
          "author": "MedicineDesperate",
          "created": 1600518896,
          "upvotes": 1,
          "replies": {
            "g5tn6d9": {
              "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5tn6d9/",
              "text": "Seems like it would be easier to just write a book that's a little less scholarly but would get a lot more widespread circulation.",
              "author": "dali-llama",
              "created": 1600528131,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g5qiyao": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qiyao/",
      "text": "This was exactly how I felt about 10 years ago when I decided to leave my PhD program with a masters and pursue a different career path. \nI love to teach and I enjoy doing research but when I would read the journal articles published in my field, I found them boring. This made me think about how other people in my field would read my boring research because they had to read it for their literature review and then create some other research, which, like mine,  had no practical application. It was just an endless string of research with nothing important at the end. \nMaybe I was just in the wrong field.",
      "author": "cheeseburgerBrahms",
      "created": 1600459296,
      "upvotes": 3,
      "replies": {}
    },
    "g5qvnns": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5qvnns/",
      "text": "Everyone does research for different reasons so I understand your need or urge to contribute to what you call real world problems. For me, research is just finding answers to question I find interesting. I have zero interest in its applicability or whatsoever. When I was little, many of my questions had already been answered and all I had to do was to read the answers in encyclopedias. Now I have to answer some of my questions myself and I read recent papers for others. I do not feel like I have an obligation or duty to contribute to society with my research at all.\n\nFurther, I don't think it is obvious that researches with a direct focus on social impact contribute more than \"research for the fun of it\". I am pretty sure almost none of the 19th century mathematicians cared even slightly about the social impact of their research, yet they have contributed to our society tremendously.\n\nSo I just focus on finding an interesting question, answering it in a clear way and record it in an accessible way. If it so happens that one day someone uses something I have written about, great! If not, also great because I enjoyed thinking and learning about it. Of course it is personal but this is just how I feel about research.",
      "author": "amhotw",
      "created": 1600464965,
      "upvotes": 3,
      "replies": {}
    },
    "g5r9tr2": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5r9tr2/",
      "text": "Depending on your field, you can take a Phd and go elsewhere with it. For instance, I know someone who worked on sociology of drug recovery and then went into policy. That kind of thing. \n\nThat said, I’m finishing a PhD in history and for a number of reasons am in the process of leaving academia, so you know. Things change.",
      "author": "J-Snyd",
      "created": 1600472200,
      "upvotes": 3,
      "replies": {}
    },
    "g5r4s4q": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5r4s4q/",
      "text": "I'm a professor in education. My work is very practical and I do a lot of work in schools. I chose that.  On the one hand, the research may not be widely read and we repeat each other a lot. BUT what I'm doing now affects kids right now. \n\nI can find motivation all the time (except really existentially threatening times). I would not be able to keep that up if I was doing basic research.",
      "author": "parkerMjackson",
      "created": 1600469273,
      "upvotes": 2,
      "replies": {}
    },
    "g5s1twx": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5s1twx/",
      "text": "Find a way to mobilize your work for good, or develop a secondary competency, or shift into an applied/interdisciplinary space. I did all of those myself, right out of grad school, for reasons broadly similar to OP. I've published 250+ opinion pieces on current events (and done lots of media interviews) informed by my scholarship and my secondary/tertiary training and my activism. Easier to do from inside the academy and from a tenured/TT platform, to be sure, but lots of my friends have followed similar paths. I still do my \"academic research\" as well, but much of my time now goes to issues/activities I feel are more directly relevant to the future of the planet and the health of our democracy. I chose to pursue a career at an SLAC partly to I'd have the time (and relative freedom) to do that.\n\nAlso: collaborations across disciplinary lines can really open up doors. I'm primarily a humanist but I've published with natural and social scientists, and am part of two different teams of academic bloggers that publish mostly political/social commentary and do public lectures together. Lots of ways to leverage an academic appointment into a public voice regardless of your field these days.",
      "author": "SnowblindAlbino",
      "created": 1600486313,
      "upvotes": 2,
      "replies": {}
    },
    "g5sm6gw": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5sm6gw/",
      "text": "My advice is to do the thing that you think will be applicable, even though it does against the current of your field.\n\nMy most successful paper ever was a paper totally directed by myself, with minimal participation from my PI.",
      "author": null,
      "created": 1600501158,
      "upvotes": 2,
      "replies": {}
    },
    "g5snzkx": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5snzkx/",
      "text": "It’s great that you recognized this early. Don’t fall victim to the sunk cost fallacy. \n\nIf you feel like you need to move to another field that‘s more applied, then that’s something you should look into and really weigh your options. If it’s bothering you that much, consider taking a break next semester.\n\nIt’s definitely a strange time filled with uncertainty, but I think we’ll get through this. Pressure makes diamonds. Stay strong mate.",
      "author": "FreudTheGoat",
      "created": 1600503015,
      "upvotes": 2,
      "replies": {}
    },
    "g5stj77": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5stj77/",
      "text": "I can relate to it, but my process was the opposite. I always thought I should do something with social impact, that \"matters\", but I also had that feeling that nothing I choose would matter enough... it was 5 years of suffering.\n\nSo, I started therapy and tried to discover what was important to me and that helped a lot choosing a master's degree that makes my heart beat faster. I've just started it and I'm very happy!\nMaybe, it will have a social impact in the future, but I really don't care. It's my study, my time and I believe we should do what we really like to, specially because it demands time and effort... if you don't like it a lot, it won't work...",
      "author": null,
      "created": 1600509140,
      "upvotes": 2,
      "replies": {}
    },
    "g5q9zsa": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5q9zsa/",
      "text": "Im economist so I can resonate with your points. However if you love research you will realize that your passion for research is greater than anything else.\n\nI can give you many examples of economics being useful: the kidney market in the US, the entire mechanism of google and faceboom ads, and sometimes monetary system around the world.\n\nAlso the carbon tax and carbon market were designed by economists, they definitely helped with climate change.",
      "author": "Economist294",
      "created": 1600454720,
      "upvotes": 3,
      "replies": {}
    },
    "g5s8tt9": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5s8tt9/",
      "text": "are you in economics? \n\nGet into climate/environmental economics! You still might not find your work impactful enough to change the big picture, but at least you can convince yourself you’re into something meaningful ;)",
      "author": "overlapping_gen",
      "created": 1600490356,
      "upvotes": 2,
      "replies": {
        "g5sxicf": {
          "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5sxicf/",
          "text": "Great thought! Climate change is an impending disaster but I wonder just how big the demand is for environmental Economists even though their job is so important (or if what they say matters in a company in which the executives are looking to greenwash their company because of PR meanwhile cutting costs). \n\nThe real tragedy in the world is of talent diversion: smart people going to work on complex derivates in finance instead of working on global problems that affect us all.",
          "author": "RagnarokReaper",
          "created": 1600513613,
          "upvotes": 1,
          "replies": {
            "g5t2axy": {
              "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5t2axy/",
              "text": "May be it is a tragedy that finance is getting the most funding instead of climate science.  \n\nI’m in finance, working on climate related projects. Getting the best of both world! There were a few papers on climate finance in the last three years, and to me those seem to be pretty low hangin fruit. I see the demand for climate scientist (climate finance specifically) going up in the next ten years, and its provides great job security since climate change is only getting worse",
              "author": "overlapping_gen",
              "created": 1600518400,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g5sciyj": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5sciyj/",
      "text": "I'm a more junior PhD student and I've definitely been feeling this way all summer. I do research in STEM and my research is actually somewhat applicable in the real world, but it feels so detached from our current reality of global pandemic/climate catastrophe/civil unrest/crumbling democracy.\n\nOn the one hand I enjoy my research; I feel like it's something I can actually sustain as a career and could lead to a positive impact. Plus I can contribute to our educational institutions. But on the other hand, there are so many people struggling to even survive these major crises, so shouldn't I put my energy and skills towards more pressing problems?\n\nI'm working on fellowship applications, and it's a real existential time thinking about what I actually want to pursue in the next few years. No answers here, but you're not alone.",
      "author": "RaffyCh",
      "created": 1600493252,
      "upvotes": 2,
      "replies": {}
    },
    "g5r4gar": {
      "link": "/r/AskAcademia/comments/ivahfn/i_work_seems_pointless/g5r4gar/",
      "text": ">  I think that I need to move to another field  that is a little more applied \n\nthose fields will seem just as minutia and pointless at their conferences too.\n\n> when the world is going to crap? \n\ndon't watch so much news. unbookmark facebook. you'll be happier.",
      "author": "RollWave_",
      "created": 1600469086,
      "upvotes": 1,
      "replies": {}
    }
  }
}