{
  "sid": "a4ax1r",
  "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/",
  "title:": "From \"flirty\"/nice to aggressive/nonsensical email from a \"colleague\"--how to respond?",
  "text": "I recently participated in a small conference that had one of its goals as publishing the conference papers in a journal. I only talked to the organizer a few times at the conference, but at some points I had the feeling that he was being very mildly flirtatious with me. We are around the same age and career-level (both postdocs). After the conference, the organizer emailed me with well wishes that I had a good time, etc. etc. and then asked me to do a \"close reading\" of his book that is about to be published. He didn't email my friend who also attended the conference, so I am assuming he only emailed me. The subject of the email referenced an \"inside joke\" between us, which had been the mildly flirty thing that he initiated at the conference. I didn't respond that same day because as soon as I got back from the conference, I started doing undergraduate admissions interviews at my uni and didn't have time to respond to all my emails. 24 hours after he initially sent the email, he sends me another email with a much curter tone than the first (\"hi\" instead of \"dear idratherbeinegypt, no niceties, no \"best wishes\" or signature) to say that he is not going to consider my paper for publication because I \"did not respond to [his] email.\" There were only 24 hours in between. I actually was not interested in publishing my work with him, because it is already accepted in a much more prestigious journal. \n\n\nMy question is this: should I directly address this as unprofessional (on his part) or just let it go? He is not in my field and is not someone that could impact my career at all. I am a postdoc at a much more prestigious university than he is, if that matters. He seems to have a seriously fragile ego, and I sense there are some weird (perhaps gender-informed) power dynamics going on here, and some part of me feels like I should NOT put up with that. I kind of want to stand up for myself. But, then again, is it worth it?\n\n\nShould I tell him he is unprofessional or let it go? \n\n\nTLDR: I didn't respond to this guy's friendly and unrelated email within 24 hours so he decided not to publish my paper. Should I call him on his bullshit?\n\nEdit: THANK YOU for your responses. This has been truly helpful. I'm still going to think on it for another day but I've taken your suggestions to heart. \n\n--To those of you saying I have my own ego issues, the point of including info about the prestige of my university and publication was to demonstrate that he does not have any institutional power over me which would force me to \"play nice\" no matter how he behaves. We might like to pretend that all universities and publications are equal, but when it comes to hiring committees and the scramble to the TT job that is rarely the reality, unfortunately. \n\n--The point of including info on his flirtatiousness was not to suggest that it was harassment--it wasn't. I was trying instead to rationalize why he could possibly get so butt hurt about not getting an immediate response to his email. But that was speculative on my part. Sorry for not being more clear. Thanks again to everyone who responded.",
  "author": "idratherbeinegypt",
  "created": 1544277669,
  "updated": 1634082052,
  "over_18": false,
  "upvotes": 98,
  "upvote_ratio": 0.92,
  "comments": {
    "ebd1flz": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebd1flz/",
      "text": "If we don't retaliate against this kind of behavior, it will persist. What if he behaves this way with someone he does have power over? I think he needs to learn that it's highly unprofessional to extort colleagues for positive reactions to his flirtation.  If you do put him in his place, you're not only standing up for yourself but also for others who might be in a weaker position than you.",
      "author": null,
      "created": 1544285210,
      "upvotes": 93,
      "replies": {
        "ebd3wjd": {
          "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebd3wjd/",
          "text": "Agreed. I certainly wouldn't apologize because you have nothing to apologize for. I don't know if calling him out will have any impact, but if you're polite and professional it can't hurt to try.",
          "author": "Gggorilla",
          "created": 1544287078,
          "upvotes": 30,
          "replies": {}
        },
        "ebd57tr": {
          "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebd57tr/",
          "text": "> If we don't retaliate against this kind of behavior, it will persist.  \n\nHow would you retaliate?  What is to put him in his place?\n\nFurthermore, will it stop him to do it with someone else?",
          "author": "panchoop",
          "created": 1544288027,
          "upvotes": 12,
          "replies": {
            "ebd7suz": {
              "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebd7suz/",
              "text": "OP could politely inform him of how this behavior made her feel uncomfortable or objectified, could constitute sexual harassment, is generally unacceptable or any of the above. Will it have an effect? That depends on this guy, but I still think he needs this kind of wake up call. ",
              "author": null,
              "created": 1544289918,
              "upvotes": 15,
              "replies": {
                "ebdf20a": {
                  "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdf20a/",
                  "text": "> 24 hours after he initially sent the email, he sends me another email with a much curter tone than the first (\"hi\" instead of \"dear idratherbeinegypt, no niceties, no \"best wishes\" or signature) to say that he is not going to consider my paper for publication because I \"did not respond to [his] email.\" \n\nPutting aside the gender dimension, having this kind of response to someone not replying to an email (much less in 24 hours!) reads medical-grade insane to me. Like, if he doesn't know that this is inappropriate, the problem goes way deeper than a wakeup call.",
                  "author": "thegreenaquarium",
                  "created": 1544294943,
                  "upvotes": 27,
                  "replies": {}
                },
                "ebdghau": {
                  "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdghau/",
                  "text": "I feel we are not reading the same post.\n\nWhere does OP mention that she felt uncomfortable? objectified? sexually harassed?  These are serious accusations that you just introduced into this post.\n\nThe core issue here is the unprofessional email of the other party, from which we are inferring other intentions (leverage for sexual favors, or whatever your mind could think about). You would have to call him out into what you *suspect* were his *intentions*. There lies the issue.\n\nJust to add, I feel just wrong that someone would jump to make a sexual harassment accusation out of giving someone a \"wake up call\", and worse, academics up-voting such behavior... Unless I'm reading this wrong, I would love to be corrected.\n\n&#x200B;",
                  "author": "panchoop",
                  "created": 1544296026,
                  "upvotes": 8,
                  "replies": {
                    "ebdhitf": {
                      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdhitf/",
                      "text": "Oh, I'm definitely not trying to speak for OP. These are just possible reactions that they might have had. I'm also not trying to accuse the person in question of sexual harrassment, as I don't have the details that OP does. Sorry for the confusion.",
                      "author": null,
                      "created": 1544296820,
                      "upvotes": 6,
                      "replies": {
                        "ebdirak": {
                          "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdirak/",
                          "text": "Oh ok, I guess it was a generic answer.\n\nWell, in that case my question stands. I don't see what can be done to give someone a \"wake up call\", as I understand the issue lies on the interpretation of his actions through his emails. Without any first email there wouldn't have been any issues with them. Without the last email there wouldn't be an issue yet. So I believe this is  confined to the emails and their interpretation, as such any \"wake up call\" or \"retaliation\" would be about the *interpretation* OP gives them.\n\nAnd that is easily dismissible (his answer would be: what are you talking about?), and furthermore, it could backfire and then suddenly you become the unreasonable and crazy person.\n\nThe smart thing to do is to either write a polite email to close communications or just not answer. Retaliation is just a bad idea overall in this context.",
                          "author": "panchoop",
                          "created": 1544297780,
                          "upvotes": 1,
                          "replies": {
                            "ebdjoq3": {
                              "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdjoq3/",
                              "text": "I see, there's likely some room for interpretation of the guy's two emails. In that case, if the emails did make OP feel a certain way, then OP could certainly inform the guy that his conduct made her feel uncomfortable or threatened or blackmailed or whatever. Again, I'm not OP so I don't know how they felt, just speculating on the basis of this post. \n\nMy initial point was just that all too often men go unchallenged when they're acting unprofessionally, and they should be told when they cross the line.",
                              "author": null,
                              "created": 1544298435,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ebcu6fn": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebcu6fn/",
      "text": "Ignore him. Don’t respond to any emails or work with him again. His power in the situation is/was fully centred in manipulating you. And from your in-depth (no offence!) analysis of the situation, he had you. But only assholes write these types of emails. Don’t give it anymore thought.",
      "author": "reversechinlock",
      "created": 1544278920,
      "upvotes": 56,
      "replies": {
        "ebdb0yd": {
          "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdb0yd/",
          "text": "> And from your in-depth (no offence!) analysis of the situation, he had you.\n\nAgreed.",
          "author": "Spidaaman",
          "created": 1544292195,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ebcyni6": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebcyni6/",
      "text": "Outside of your field, a person you are not likely to meet again, and he did likely have different assumptions about your past interactions. Contacting him is to his benefit, not yours. Trust your instincts and don’t respond. ",
      "author": "Der_Kommissar73",
      "created": 1544282976,
      "upvotes": 26,
      "replies": {}
    },
    "ebe279t": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebe279t/",
      "text": "Just on the matter of those two emails; whenever something like that happens to me, I like to respond this way.\n\nReply to first email like you haven't seen the next email. Just totally what your normal reply would be. Start by apologising for the delay, that you had been busy with etc etc... and **just got the chance to go through your emails**.\n\nThen about 15-20 mins later, reply to the next one acting like you just reached this email in your inbox and their impatience caught you off-guard. You can choose to end the relationship there.\n\nI like to think this gives such people a mild \"oh shit, i dun goofed\" moment and hopefully teaches them a lesson to be patient.\n\nHelps if you do it at an off-hour so they don't get to reply immediately to your first reply.",
      "author": "anotherbozo",
      "created": 1544313051,
      "upvotes": 9,
      "replies": {}
    },
    "ebdwmbr": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdwmbr/",
      "text": "This whole situation reminds me of a r/niceguys thread. Wow. ",
      "author": "99kedders",
      "created": 1544308495,
      "upvotes": 8,
      "replies": {}
    },
    "ebcuf26": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebcuf26/",
      "text": "Personally, I would not call him out because you never know quite what is going on in the background. \n\nWhat I would do: when I have time to respond, typically not on the weekend, I would send a brief and professional reply to thank him for his emails, great to see him at the meeting, and apologize for being very busy with end of term/admissions/other etc. Then wish him luck, sincerely me. Why the apologies? Because, frankly, it’s how I typically deal with fragile academic egos, male or female. I tend to error on the side of understanding and kindness but keep strict boundaries on my time. I’m busy and do not owe anyone my time, but I want to keep things collegial and professional. \n\nOthers may respond differently. This is just my typical MO. \n\nSorry, on my phone, so short and crappy formatting. ",
      "author": "justabovemaine",
      "created": 1544279172,
      "upvotes": 108,
      "replies": {
        "ebdbccy": {
          "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdbccy/",
          "text": "Why would you thank someone for terrible emails from both ends of the spectrum - trying to flatter you and then cutting you off? Ridiculous advice. Why is looking after this guys ego the responsibility of anyone? Responding again only rewards his behavior. \n\nPlease think carefully before taking this poster’s advice",
          "author": "reversechinlock",
          "created": 1544292411,
          "upvotes": 36,
          "replies": {
            "ebdfml6": {
              "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdfml6/",
              "text": "> Why would you thank someone for terrible emails \n\nBecause it's the collegial thing to do. Collegiality isn't about liking the people you work with - it's about collectively engaging in civil behavior. It may feel good to be rude to an asshole, and we think OP would be completely justified in doing so, but she doesn't know who else is watching and how her actions appear to other people based on their priors. In the vast majority of cases, responding cattily, especially in an email or other tractable form of communication, only has negative consequences for all involved. ",
              "author": "thegreenaquarium",
              "created": 1544295369,
              "upvotes": 17,
              "replies": {
                "ebdg4ei": {
                  "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdg4ei/",
                  "text": "No one suggested that she respond cattily or be rude. The point is any response gives this type of person exactly what they want - attention - and it fuels future behavior.",
                  "author": "reversechinlock",
                  "created": 1544295756,
                  "upvotes": 9,
                  "replies": {
                    "ebdg7ne": {
                      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdg7ne/",
                      "text": "I mean I don't think she should respond at all if she can help it, but you asked a person who is not her why they would thank someone for a rude email - and I gave an idea for why.",
                      "author": "thegreenaquarium",
                      "created": 1544295825,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ebcw37s": {
          "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebcw37s/",
          "text": "This is a great response. ",
          "author": "accountofmountzuma",
          "created": 1544280776,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ebd1bjm": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebd1bjm/",
      "text": "Dear [Person]\n\nThanks for your messages.\n\nSincerely, Me\n\nIf you really feel like you need to respond in some way, I would try to make it as much of an academic equivalent of a \"k\" message. No need to address the professionalism. The email you send could help to seal the \"I'm not interested professionally or personally\" message you appear to want to send. ",
      "author": "RhodaMorgenstern",
      "created": 1544285124,
      "upvotes": 18,
      "replies": {
        "ebdorep": {
          "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdorep/",
          "text": "This is how I respond when I absolutely must (such as when I'm a program chair). Brush it off. But otherwise, I don't respond, and just shut that foolishness out. ",
          "author": "khosikulu",
          "created": 1544302306,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ebf6xdf": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebf6xdf/",
      "text": "\"Hi,\n\nSorry I wasn't able to respond to your initial email within 24 hours. I hadn't realised there was a timeframe involved. As I'm sure you understand I've been very busy with a variety of tasks as semester comes to an end. As it is, my paper has already been accepted at [Journal XXXX], but thank your for the thought.\n\nGood to see you at the conference,\n\nidratherbeinegypt\"\n\n\nEDIT - actually, in hindsight, I'd go a little differently...\n\n\"Hi, I wasn't able to respond to your initial email within 24 hours; you also didn't make it clear that there was a timeframe involved. As I'm sure you understand I've been very busy with a variety of tasks as semester comes to an end. As it is, my paper has already been accepted at [Journal XXXX], but thank your for the thought.\n\nidratherbeinegypt\"",
      "author": "OrbitalPete",
      "created": 1544354177,
      "upvotes": 3,
      "replies": {}
    },
    "ebdvj2o": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdvj2o/",
      "text": "I say ignore the bullshit and move on. Your time is limited and he is not worth your time. Chances are he won’t learn anything from the incident anyway. ",
      "author": "zabulon_",
      "created": 1544307594,
      "upvotes": 2,
      "replies": {}
    },
    "ebem36x": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebem36x/",
      "text": "Are you tenured? If no, document and ignore. If yes, can escalate.",
      "author": "Soyiuz",
      "created": 1544329778,
      "upvotes": 2,
      "replies": {}
    },
    "ebcvyl2": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebcvyl2/",
      "text": "Out of curiosity, what are you thinking of saying to him? Do you think it'll actually make any difference? I'm sure it'll satisfy your ego to do so, but I suspect he'll just brush it off as you trying to get back at him for opting not to publish your paper.",
      "author": "eta_carinae_311",
      "created": 1544280660,
      "upvotes": -10,
      "replies": {}
    },
    "ebdazhg": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdazhg/",
      "text": ">I actually was not interested in publishing my work with him, because it is already accepted in a much more prestigious journal.\n\n>I am a postdoc at a much more prestigious university than he is, if that matters. \n\nBe careful that you're not projecting. It seems he's not the only one with a fragile ego.\n\n\nBut really it doesn't matter. None of this does. *Yes*, it was unprofessional. But you should let it go. Ignore this person. There's no cheese down this tunnel. ",
      "author": "Spidaaman",
      "created": 1544292164,
      "upvotes": -9,
      "replies": {
        "ebdfbdj": {
          "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdfbdj/",
          "text": "How is disclosing the details of the situation evidence of a fragile ego? The sentences you quote are directly relevant to OP's question and potential advice.",
          "author": "anonewgirl",
          "created": 1544295135,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "ebd6avw": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebd6avw/",
      "text": "Not an academic, but I think you should try to snoop around or call him out in some way. If he pulled this type of thing with you it’s not unreasonable to believe that he have done it in a different way, in a different situation and actually hurt someone, or that he will in the future, and maybe that person will have something larger to lose for calling them out.\n\nI’d try to tell someone, and do it in a way that puts things exactly in proportion (“I may have completely misinterpreted this email but what do you think..”)",
      "author": "nongiga",
      "created": 1544288830,
      "upvotes": -5,
      "replies": {}
    },
    "ebd7cr4": {
      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebd7cr4/",
      "text": "[deleted]",
      "author": null,
      "created": 1544289593,
      "upvotes": -8,
      "replies": {
        "ebd84if": {
          "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebd84if/",
          "text": "Umm? I might be socially inept, but I don't read anything in OP's post which might indicate that she looks down on this person for anything other than his weird, inappropriate flirting or tantrum after not getting an email reply in 24 hours. \n\nThe use of 'prestigious' is not particularly weird. You could possibly shorthand it by saying 'better journal' but the impact is still the same - she doesn't need to publish with this guy because the work is already accepted in a journal with a better impact factor / reputation / whatever people use.\n\nPersonally, I would be (and have been) put off when someone is flirting with me at a conference. Moreover, if someone decided to extend that flirting into emails and then acted all huffy and aggressive if I don't reply within 24 hours? That's ridiculous and sounds like an entitlement complex. Some people have a real entitlement complex and those same people tend to respond very badly when rebuked by women. It sounds like that's what is happening here. It hardly seems appropriate to blame OP for that. ",
          "author": "CosmicCurvature",
          "created": 1544290158,
          "upvotes": 11,
          "replies": {
            "ebd8lfb": {
              "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebd8lfb/",
              "text": "[deleted]",
              "author": null,
              "created": 1544290512,
              "upvotes": -2,
              "replies": {
                "ebd8r7t": {
                  "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebd8r7t/",
                  "text": "Been intern, about to finish PhD, and soon to be postdoc.",
                  "author": "CosmicCurvature",
                  "created": 1544290621,
                  "upvotes": 4,
                  "replies": {
                    "ebdaebw": {
                      "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdaebw/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1544291738,
                      "upvotes": 0,
                      "replies": {
                        "ebdbiwc": {
                          "link": "/r/AskAcademia/comments/a4ax1r/from_flirtynice_to_aggressivenonsensical_email/ebdbiwc/",
                          "text": "I think we're looking at different things. I haven't said one way or the other whether or not OP should actually do anything about this. If it were me, I'd be split between two mindsets:\n\n1) This person is behaving inappropriately, and it may or may not be the first time he has done so (or will do so). Calling it out in some form might lower the chances that another woman will have to deal with this in the future. \n\n2) This person is behaving inappropriately, and it may or may not be the first time he has done so (or will do so). However, knowing that some people respond very very badly to rejection or being challenged, it may be safer for OP to not do anything.\n\nI'm not sure which avenue I would choose. I've seen how bad that reaction can get, so I'd have to have a proper risk assessment before taking any action.\n\nBut on the specifics of OP's language, I think that her motivation is different to what you are assuming. You pointed out the use of the word 'prestigious' re: the journal and their institutions. It might be the case that she has mentioned this *not* to make herself appear better than him (or because she thinks she's better than him in some way), but rather because *if* he were at a more 'prestigious' institution than she is (or if he were further in his career than she was) there might be a power differential affecting how to treat this situation. I'd be thinking: Could I run into him again? Could he threaten my career somehow? Could he threaten my reputation? And all of these are valid things to think about.\n\nSince they're in different fields, probably she doesn't have to worry about this. But that could be a reason why it was mentioned.\n\nAnd yes, postdocs (and PhD students, and academics in general) can be `awkward' and they can also be outright aggressive. I can't fault somebody for being awkward, I'm also awkward. The flirting at the conference falls under awkward please-don't-do-that, but the aggressive-sounding email after 24 hours of non-response is what bothers me the most here, because it hints at an entitlement complex where he feels owed her time and attention. I don't get the impression that she wants to burn his career to the ground over this, but it is these kinds of behaviours which - if left unchallenged - can make academia quite unwelcoming and/or intimidating. ",
                          "author": "CosmicCurvature",
                          "created": 1544292530,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}