{
  "sid": "q1gkuz",
  "link": "/r/AskAcademia/comments/q1gkuz/uk_phd_students_how_is_your_relationship_with/",
  "title:": "UK PhD students- how is your relationship with your supervision team?",
  "text": "I'd say mine is fairly good insofar as we get work done and I have 2 supervisors with different expertise so I always have someone to turn to for advice.\n\nThat said, I suck at smalltalk and I'd love to know both of them on a more personal level. How do you make Smalltalk with someone who has like 20+ years more experience than you in the field?",
  "author": "Erwin_Schr0dinger",
  "created": 1633385249,
  "updated": 1634078770,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hfgh4xm": {
      "link": "/r/AskAcademia/comments/q1gkuz/uk_phd_students_how_is_your_relationship_with/hfgh4xm/",
      "text": "Don't force the small talk, it should happen organically. Chit chatting at a poster session, meeting at a coffee machine, etc.",
      "author": "needlzor",
      "created": 1633422454,
      "upvotes": 1,
      "replies": {}
    },
    "hfhq5n4": {
      "link": "/r/AskAcademia/comments/q1gkuz/uk_phd_students_how_is_your_relationship_with/hfhq5n4/",
      "text": "This might sound a bit mean, but do they want to do small talk? Some people prefer to just discuss work and the bigger issues in their plate and find small talk exhausting or stressful. \n\nBut largely you need to let it come organically. Ask if they had a good weekend, ask if they watched any of them Olympics (when it was on - it's niche but everyone has an event) and so on. But don't do too much chit chat and move on to work stuff.",
      "author": "ACatGod",
      "created": 1633449351,
      "upvotes": 1,
      "replies": {}
    },
    "hfkq1fv": {
      "link": "/r/AskAcademia/comments/q1gkuz/uk_phd_students_how_is_your_relationship_with/hfkq1fv/",
      "text": "How would you make small talk with anyone else? But basically, don't force it. It could well be that they are only comfortable with a professional relationship and that is fine. People don't always want more than that at work.",
      "author": "BlokeyBlokeBloke",
      "created": 1633501266,
      "upvotes": 1,
      "replies": {}
    }
  }
}