{
  "sid": "q6hwgx",
  "link": "/r/AskAcademia/comments/q6hwgx/help_former_phd_sv_is_asking_about_manuscript/",
  "title:": "Help! Former PhD SV is asking about manuscript status",
  "text": "I just started a new academia job mid Aug, and I'm swamped with all the new start-up faculty stuff (teaching stuff, exams, syllabus etc.) that I just put that manuscript in a back-burner and procrastinated. and the final draft has been sitting in my folder, just waiting to be submitted to the journal since the 1st of Sept.\n\nSV is awesome and involved with every step of the manuscript preparation. I do plan to submit it next week after all the other urgent deadlines due this week, but I guess the SV caught up to me first. \n\n**How to reply without seemingly unprofessional and like I can't get my head straight. Help!**\n\n**Side question; How do people have time to prepare manuscripts and funding applications, etc., while still getting all the other faculty work and teaching done well? I'm just so overwhelmed right now.**\n\n&#x200B;\n\n\\*New STEM lecturer at a private uni, yep fresh off the PhD",
  "author": "Dr_mochi",
  "created": 1634028969,
  "updated": 1634078373,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgc2wdw": {
      "link": "/r/AskAcademia/comments/q6hwgx/help_former_phd_sv_is_asking_about_manuscript/hgc2wdw/",
      "text": "Just be honest and courteous. They know what it's like starting a new job, let alone a faculty position with having to get all the lecturing material ready from scratch. There's lots to do, and your previous job isn't going to be the priority - **it shouldn't be.**  \n\n\n\"Hi SV!  \nThanks for the email and sorry about being a bit quiet lately, I've been somewhat overwhelmed with starting the new job and getting everything ready for lecturing! Things have been a bit hectic trying to adapt - especially with the COVID regulations.  \nI've been slowly working on the manuscript, and aim to submit it next week to Journal X. I'll drop you an email once I've submitted, and will keep you in the loop about the answer.  \nHope all is well!\"",
      "author": "Cell_Division",
      "created": 1634030873,
      "upvotes": 4,
      "replies": {}
    },
    "hgcr99u": {
      "link": "/r/AskAcademia/comments/q6hwgx/help_former_phd_sv_is_asking_about_manuscript/hgcr99u/",
      "text": "It’s not a big deal. Just be honest and let them know that you plan to submit it next week — then make sure that you do. It’s easy to let your research sit on the back burner while you get overwhelmed with other responsibilities, and it is also a mistake.\n\nIn general, it is critical to prioritize your research along with your teaching. Schedule time for it and do it. Don’t let it be something you do only when you have free time, because you will never have free time.\n\nAnd learn how to be efficient with your teaching. Make choices that reduce your teaching workload. For example, in computer science, my area, studies show that pair programming can increase learning. Bingo—I allow it, students learn more, and my grading workload is cut in half. I know that writing-intensive courses often incorporate peer review, which have similar benefits for both students and instructors.\n\nWhile those examples benefit the students, there will be cases where you have a choice between doing more for your students or doing more for yourself. That’s a balancing act that all teachers must deal with and we are all there in part because we want to help our students learn, but ultimately, to be successful, you must put yourself first. Nobody else is going to do it for you and you aren’t really helping anyone if you torpedo your career by ignoring your research. \n\nThat doesn’t mean that it’s ok to be a bad teacher. It’s just important to realize that your students will always take as much of your time as you are willing to give them, so you have to decide how much you can give and stick to it. And you have to recognize that at some point, giving too much help may be helping them learn less instead of more. Students learn more by figuring things out on their own. Our job is to set them up to be able do that, not to facilitate their never having to do so.",
      "author": "bigrottentuna",
      "created": 1634046701,
      "upvotes": 2,
      "replies": {}
    }
  }
}