{
  "sid": "ca3il1",
  "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/",
  "title:": "Do you ever feel like your research is pointless?",
  "text": "Hi everybody. I'm in the middle of writing my Masters dissertation (in International Relations) and I'm feeling pretty hopeless. Do you ever feel like your research is pointless? Or not worth the time you've given it? Are your expected outcomes obvious, or just not that important anymore? Feeling down. Need a pick me up. At the very least, it'd be nice to know I'm not alone.",
  "author": "sullenwizard",
  "created": 1562477997,
  "updated": 1634081300,
  "over_18": false,
  "upvotes": 143,
  "upvote_ratio": 0.99,
  "comments": {
    "et5mnnq": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5mnnq/",
      "text": "[deleted]",
      "author": null,
      "created": 1562479651,
      "upvotes": 101,
      "replies": {
        "et73fn9": {
          "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et73fn9/",
          "text": "That’s a really good comic",
          "author": "wheniwashisalien",
          "created": 1562523877,
          "upvotes": 8,
          "replies": {}
        },
        "etcgbzn": {
          "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/etcgbzn/",
          "text": "found the positivist",
          "author": "whosedeadparrot",
          "created": 1562684109,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "et5m0m7": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5m0m7/",
      "text": "It is -almost- pointless.  But the fact that its value has some non-zero value is the point of academia.  Millions of papers piling up like a snowbank and then someday a single flake causes an avalanche.  You dont get to control if you are the avalanche maker or just another flake in the snowbank, all you get to control is if you wanna be a part of it or not.",
      "author": "bjos144",
      "created": 1562478901,
      "upvotes": 109,
      "replies": {
        "et5mhvh": {
          "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5mhvh/",
          "text": "Some snowflakes will obviously be much more likely to cause that avalanche when they hit the snowbank though.",
          "author": "BKindYall",
          "created": 1562479462,
          "upvotes": 12,
          "replies": {
            "et5nq0l": {
              "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5nq0l/",
              "text": "Sure.  But if you realize your work isnt going to cause the avalanche, you have to take solace in the fact that you are laying at least a little bit of the ground work for those that will follow.  If you feel  that that value proposition doesnt outweigh the investment of your time and energy  then your ~~field~~ project might not be right for you.",
              "author": "bjos144",
              "created": 1562480959,
              "upvotes": 20,
              "replies": {
                "et5o6xc": {
                  "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5o6xc/",
                  "text": "Changing entire fields or leaving academia is a pretty drastic first step, is it not? Once you have a better idea of what is pointless, you then also have a better idea of what isn't pointless. If one feels that their research is relatively useless, they could alternatively try to change their research goals or their specialization after completing what they're currently working on.",
                  "author": "BKindYall",
                  "created": 1562481553,
                  "upvotes": 5,
                  "replies": {
                    "et5oacn": {
                      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5oacn/",
                      "text": "'Field' could be interpreted as 'project' sure.",
                      "author": "bjos144",
                      "created": 1562481673,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "et5p9a6": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5p9a6/",
      "text": "“No single raindrop feels responsible for the flood.” - Douglas Adams\n\nThough this quote originally most likely had a different meaning/intention, it makes me feel better that my work may be a part of this ‘flood’. Just being a part of this upward march of humanity gives me more satisfaction than working to help a company make a profit ever could.",
      "author": "nesion",
      "created": 1562482933,
      "upvotes": 38,
      "replies": {}
    },
    "et5sruo": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5sruo/",
      "text": "Always remember that a thesis is not necessarily there for you to bring ground-breaking ideas into the field, particularly at MA level. Focus on all of the skills that you are acquiring thanks to the writing up and research - those are the most valuable assets of the whole process in my opinion.  Then, of course, if your research ends up being internationally acclaimed, then that's a bonus. Selfishly, we have to accept that, most often than not, research might simply be a pleasurable thinking exercise and we should embrace it as such.",
      "author": "yukit866",
      "created": 1562487903,
      "upvotes": 20,
      "replies": {}
    },
    "et5ul8z": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5ul8z/",
      "text": "It's completely pointless (I'm in the same field). But unfortunately, most jobs in this field are pointless. I've had different types of jobs in this field, and I don't see any way I'm making a difference. But it keeps us off the street.",
      "author": "doornroosje",
      "created": 1562490745,
      "upvotes": 11,
      "replies": {}
    },
    "et5zei1": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5zei1/",
      "text": "Long ago a very wise older professor told me that your dissertation topic has to “Reward the sustained engagement.”\n\nSo don’t pick something that’s going to bore you from the very beginning. But it is absolutely normal to be frustrated, irritated, bored, exasperated, desperate, distracted, and not fulfilled at times during the dissertation engagement. Here’s the thing: Keep your eyes on the prize. A dissertation is a tool to the next step in your career. \n\nAnother wise professor told me that “the dissertation should be the worst piece of research you ever do.” This incensed me: I was putting all this misery and stress into something that was going to be terrible? Nope. What he meant was that hopefully, over time as a researcher, your research will get better and better and better, right? I mean everybody wants to do better on the next project than they did on the last project? You are not supposed to peak your career at your dissertation.\n\nThese two philosophical insights help me get through it. It’s a business transaction. Finish it. Do a good job. Pass. Use it to get to the next step whether that’s a post doc or a tenure-track position or a good job in industry or government. Then the dissertation has worked.",
      "author": "DavidDPerlmutter",
      "created": 1562498345,
      "upvotes": 7,
      "replies": {}
    },
    "et66zkh": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et66zkh/",
      "text": "As usual, there are lots of responses in this thread justifying why it is okay to have pointless research.\n\nThe fruits of research aren't always immediately evident, but there is no denying that a lot of academia is stuck frying small fish and pumping out low value papers in order to look productive.",
      "author": null,
      "created": 1562505593,
      "upvotes": 6,
      "replies": {}
    },
    "et5mtcp": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5mtcp/",
      "text": "I am also writing a Masters dissertation in IR and feeling pretty hopeless! A lot of the research in my subject seems to be: here's a way in which the world is super bleak and dark, and research into the specifics of that doesn't feel like it's actually... doing anything? Like it's not going to make an impact and probably nobody other than the markers is doing it.\n\nBut it's valuable to me, to my personal development, and I care about it. That's enough for now.",
      "author": "ladywolvs",
      "created": 1562479837,
      "upvotes": 11,
      "replies": {}
    },
    "et5ou26": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5ou26/",
      "text": "[deleted]",
      "author": null,
      "created": 1562482377,
      "upvotes": 6,
      "replies": {
        "et5umgc": {
          "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5umgc/",
          "text": "Compared to other (starter) jobs in the field of OP (IR), it's not bad actually!",
          "author": "doornroosje",
          "created": 1562490798,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "et5nica": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5nica/",
      "text": "I’m writing a master’s thesis in history and am feeling the same way. In a strange way it helps knowing I’m not alone in this.",
      "author": "slak17",
      "created": 1562480689,
      "upvotes": 3,
      "replies": {}
    },
    "et5q5vf": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5q5vf/",
      "text": "Sometimes I do feel a sense of pointlessness with my field, where there are so many relatively low quality papers published (almost all yet another unquestioning application of a particular theory to a marginally different case study) that get zero citations. But at the same time, there are people who have done really high-quality research that has had an impact on professional practice.",
      "author": "HQNJ",
      "created": 1562484163,
      "upvotes": 2,
      "replies": {}
    },
    "et6bvrd": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et6bvrd/",
      "text": "Doing research is my job and I do my job well. That provides all the satisfaction I need.",
      "author": "planitall",
      "created": 1562509199,
      "upvotes": 2,
      "replies": {}
    },
    "et6nqhd": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et6nqhd/",
      "text": "I feel like that all the time, but I guess I take solace in the fact that basically everything is pointless so you just pick something to do which you enjoy (at least enough of the time) and that you get paid for. The longer I've been in research, the more I've realised that you have to be wary about your work becoming your identity. Academics let our work absorb our lives too much and therefore success/enjoyment of our work is conflated with success/enjoyment of our life. Treat it as your day job, and find enjoyment in things outside of your work. \n\nYour job doesn't need to be where you find meaning or purpose in your life, it can just be a thing that you're quite good at, that you do on week days, and that pays your salary. Of course, it shouldn't be making you miserable all the time, in that case you might consider trying other things. Everyone's work could be considered pointless, but accountants, actors, and electricians etc. haven't been implicitly encouraged to believe that their job's need to be world changing the way that we have.",
      "author": "dhen061",
      "created": 1562516169,
      "upvotes": 2,
      "replies": {}
    },
    "et79yq2": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et79yq2/",
      "text": "A short about how even pointless, seeming research can change the world in unexpected ways. https://youtu.be/nDU3i2VWdTQ",
      "author": "InfuriatingComma",
      "created": 1562527606,
      "upvotes": 2,
      "replies": {}
    },
    "et7ksra": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et7ksra/",
      "text": "I have a feeling that the more experienced you are, the more valuable research you being to make. Once you get to this point, every single project gets you excited and you feel that someone actually needs what you find and it has practical implications as well. To get there, however, \"experience\" is the key so keep it going till you make it! :)",
      "author": "applingu",
      "created": 1562533014,
      "upvotes": 2,
      "replies": {}
    },
    "et7qloy": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et7qloy/",
      "text": "The Master's thesis is anyway just an extended school assignment. It's not supposed or required to be particularly original or impactful. It's not really about the topic, it's about *you*.",
      "author": "RRautamaa",
      "created": 1562536046,
      "upvotes": 2,
      "replies": {}
    },
    "et6brsr": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et6brsr/",
      "text": "Most research *is* pointless. Academia has become a beast that exists to feed itself. The vast majority of research output will never be widely read nor will it have any larger contributions to society.",
      "author": "IIII1111II1IllII1lI",
      "created": 1562509129,
      "upvotes": 2,
      "replies": {}
    },
    "et5pnua": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5pnua/",
      "text": "I’m currently writing my master thesis as well. I had a similar feeling last year when I was writing a short research paper for an award. I was just half a year into the program at the time. I started feeling like my contribution was insignificant. Which, it’s expected to be imo. I was a first year master student. How am I to solve challenges in a technology that has been in the interest of researcher for decades? If you’re exceptional, then maybe you’ll get the attention of a few people. Sometimes you have to be lucky, I guess. But normally, master students are going through a learning process, and they don’t have significant contributions. Research is new to us. We haven’t experienced it before (at least myself). So, it’s an opportunity for us to learn how to do research, so that in our next stages we can do better. I don’t believe getting a degree should to be a goal for us. It should be an intermediate stage for whatever our actual goal it, and whatever that goal is for you is, you have acquired enough skills from your research to have more significant contributions to it. Cheers and good luck with writing!",
      "author": "Alkhwarizmi_AB",
      "created": 1562483477,
      "upvotes": 2,
      "replies": {}
    },
    "et5xy4h": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5xy4h/",
      "text": "Hello, I am exactly in the same situation as you (master's dissertation in IR) and I just wanted to let you know that I feel the exact same way: pointless research, obvious outcomes... \nSo yes I guess that this doesn't do much to help you but at least we're not alone, yay.\nSeriously I feel like it is close to impossible to do meaningful research as a social scientist before your PhD. This gets better! (Hopefully)",
      "author": "almostgreen81",
      "created": 1562496145,
      "upvotes": 2,
      "replies": {}
    },
    "et6epvq": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et6epvq/",
      "text": "Still love my research, and I purposely chose something that’s both interesting to me, and that’s in the media basically every single day. It may not help save the world, but it’s relevant to huge corporations and their investors and shareholders, so at least there is some value in that ;)",
      "author": "AnonBizPhD",
      "created": 1562511076,
      "upvotes": 1,
      "replies": {}
    },
    "et6rcir": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et6rcir/",
      "text": "Especially with everything that’s happening politically right now in my country (the US), I indeed often feel like my work that centers on changing the academy specifically is less urgent.",
      "author": "NotYourFathersEdits",
      "created": 1562517947,
      "upvotes": 1,
      "replies": {}
    },
    "et6wlx3": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et6wlx3/",
      "text": "I'm struggling with this myself but it is important to level your expectations. You're not going to change the world with a masters dissertation. If you can get published great, but your main goal should be getting your masters and setting yourself up for future work. \n\nBeing a researcher is very much a slow burn. The individual stuff you do often don't often make an impact but as you gain more experience and knowledge you will be able to contribute more to your field. Even then it is a lottery with how many papers are coming out all of the time.\n\nIf you enjoy what you do on the macro level then you are in the right field. Just don't expect to love every second of your work. Sometimes it is best to take a break and come back with a fresh perspective.",
      "author": null,
      "created": 1562520565,
      "upvotes": 1,
      "replies": {}
    },
    "etgjzi2": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/etgjzi2/",
      "text": "I’ll add a different perspective to this conversation and echo the fact that sometimes your research is an instrument for things beyond just your immediate findings.\n\nI work as a researcher in tech working on product, and quite honestly a lot of the research I do is pointless in the sense that a product manager or engineering team might ignore my findings and decide to do something anyway. Or they ask me to do research that doesn’t make any sense, but I might have to do it as a quick throwaway just to build a better relationship. Sure, I usually scope projects like this to a few weeks so the grind isn’t nearly as bad as a dissertation, but “meaningless” work isn’t just an academic thing. It’s everywhere.\n\nWhen I was working on a publication during my masters, I felt like quitting at multiple points in the year long process, but that publication is something I’m still proud of today because at least I started it and felt that there was meaning in the work. Hopefully you’ll come out feeling the same when it’s all over and find yourself working on other research projects.\n\nYour dissertation has a concrete outcome and goal: graduation. Even if it doesn’t make a huge splash, you’ve already completed a key goal for starting it in the first place. You can accomplish one goal and make a dent in another (i.e. doing cutting edge research) if you think of them separately.",
      "author": "Kylaran",
      "created": 1562792654,
      "upvotes": 1,
      "replies": {}
    },
    "et6dwxw": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et6dwxw/",
      "text": "The only way most research is valuable is that with the degree you can ask for more money sooner in a job, depending on the field",
      "author": "FJLyons",
      "created": 1562510531,
      "upvotes": 1,
      "replies": {}
    },
    "et5whe5": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et5whe5/",
      "text": "Depending on your research topic, mine was the effect of monetary policy tools of the central bank of bahrain on the gdp and inflation, it was fun to be honest, like my variables were pegged currency effect, intrest rate, BHIBOR, required reserve, money supply, and gdp with inflation.\nI used multiple liner regression, it was fun, my friend did his thesis on womens busniess impact on the economy and believe me it was boring as hell.",
      "author": "Araifi",
      "created": 1562493778,
      "upvotes": 0,
      "replies": {
        "et6ehoa": {
          "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et6ehoa/",
          "text": "Good for you. Not sure why this was getting downvoted.",
          "author": "AnonBizPhD",
          "created": 1562510924,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "et6bqo0": {
      "link": "/r/AskAcademia/comments/ca3il1/do_you_ever_feel_like_your_research_is_pointless/et6bqo0/",
      "text": "Ultimately, does any of this have a point? Life, research or otherwise? Philosophers, zealots, and wanderers have contemplated the point of anything we do for centuries. Don’t let it get to you too bad. \n\nPerhaps what would be best applicable is to shift your expectations/sense of gratification to something more self-centric. Do you enjoy what your are researching? That’s a good start. Shift the focus from whether or not the research is worth it or not, and shift to gauging your happiness and ask “did I do the best I could today?”\n\nIf you did. It do your best, why not? Was it something within your control? If yes, how can you work towards changing that? If not, why worry? Simply be happy with doing your best. It may not be *the* best, but it will be *your* best, and that is something to be proud of.",
      "author": "One_Left_Shoe",
      "created": 1562509108,
      "upvotes": 0,
      "replies": {}
    }
  }
}