{
  "sid": "qkkuq2",
  "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/",
  "title:": "Does corresponding author matter?",
  "text": "Trying to settle a debate in the lab. A PhD student recently submitted a paper (lead author), and a postdoc in the lab was surprised that our PI got corresponding author. They felt it undermined the PhD student. Does this really matter? The PhD might not stay in academia so I guess it's safer but it is her work",
  "author": "Nervous_Upstairs_Bed",
  "created": 1635792770,
  "updated": 1635890359,
  "over_18": false,
  "upvotes": 42,
  "upvote_ratio": 0.88,
  "comments": {
    "hix8vnf": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hix8vnf/",
      "text": "The PI is almost always the corresponding author in many fields. If it is that PhD's work, they should be first author and that is their credit. Corresponding author with student affiliations is a bit difficult at they change in a few years, so PI as corresponding author is common.",
      "author": "professorbix",
      "created": 1635796644,
      "upvotes": 128,
      "replies": {
        "hixp04h": {
          "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hixp04h/",
          "text": "Agreed. In our lab, PI is corresponding author because their credentials and contact info are more stable than me as a student. If needed, PI can track down previous students more easily for more info about the paper than a reader can.\n\nETA. I'm in biology if that helps.",
          "author": "EnthusedBotanist",
          "created": 1635803211,
          "upvotes": 32,
          "replies": {}
        }
      }
    },
    "hix4l00": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hix4l00/",
      "text": "That's absolutely fine and very common. No worries about it.",
      "author": "MrBacterioPhage",
      "created": 1635794902,
      "upvotes": 28,
      "replies": {}
    },
    "hix98cn": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hix98cn/",
      "text": "Field dependent (and note STEM is a lot of fields with many different conventions), but for astronomy corresponding author is not important, and if the first author isn't going to stay in academia, having someone else do it would be sensible in my view.  Author order matters, correspondingness does not).",
      "author": "Spambot0",
      "created": 1635796786,
      "upvotes": 17,
      "replies": {}
    },
    "hix4wsb": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hix4wsb/",
      "text": "Thank you everyone! I'm relieved that it's quite common and not just a PI thing",
      "author": "Nervous_Upstairs_Bed",
      "created": 1635795035,
      "upvotes": 7,
      "replies": {}
    },
    "hix09n1": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hix09n1/",
      "text": "I'm assuming this is STEM based on your mention of the lab. PIs are pretty much always corresponding author in STEM because it's their lab and all the work that goes into having a lab plus they're considered ultimately responsible for the work in the lab, especially when it's a PhD student.",
      "author": "ACatGod",
      "created": 1635793131,
      "upvotes": 44,
      "replies": {}
    },
    "hixkwo9": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hixkwo9/",
      "text": "In my case, my supervisor has always been the corresponding author. I have always been the first author",
      "author": "mzchennie",
      "created": 1635801513,
      "upvotes": 4,
      "replies": {}
    },
    "hix1rq4": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hix1rq4/",
      "text": "In my experience (STEM), the last author is typically the PI who runs the lab and is ultimately responsible for the project, so they typically take corresponding. This is particularly true, if as you mentioned, the PhD is not sure they will stay in academia. However, it is also not uncommon for a PI to give the first author corresponding. For example, my PI typically lets me take corresponding, but likely wouldn't do the same for an masters or undergraduate student who may not stay in academia or pursue a PhD. I don't think it really undermines the student though, I wouldn't have any issues if my PI wanted to take corresponding on my paper. I feel like it may have been more important in the past, but now if you need to contact any of the authors, it's pretty easy to fine their contact information.",
      "author": "sensorimotorneuro",
      "created": 1635793751,
      "upvotes": 14,
      "replies": {}
    },
    "hixmh4t": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hixmh4t/",
      "text": "In life sciences, the supervisor, PI etc is always corresponding author.  They probably conceived the study, acquired funding, managed the project etc.  It also comes with a lot of responsibilities.  There are circumstances when first author is postdoc who's about to leave the lab and start their own research program, in which case they can both be corresponding.  If the research is a collaboration, several PIs can be corresponding, all listed at the end of paper.",
      "author": "onehundredmiles10",
      "created": 1635802161,
      "upvotes": 12,
      "replies": {}
    },
    "hix4zsr": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hix4zsr/",
      "text": "Since nobody else has said it yet, it should be pointed out that there isn't any prestige involved in being the corresponding author. This is just the person who submits the paper and receives the referee reports. TBH any time you find yourself not the corresponding author its a good day since this role carries with it (a minor amount of) inconvenience and nobody honestly wants to do it. Its not something to be concerned about.",
      "author": "mathisfakenews",
      "created": 1635795068,
      "upvotes": 19,
      "replies": {
        "hixrgk4": {
          "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hixrgk4/",
          "text": "Often not true. Professors are often dinged if they are not the corresponding author of too many papers.",
          "author": "fwafwa",
          "created": 1635804247,
          "upvotes": 20,
          "replies": {
            "hizvxa5": {
              "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hizvxa5/",
              "text": "Absolutely agree.  My evaluations are heavily weighted towards corresponding authorships.",
              "author": "Life_time_learner",
              "created": 1635850289,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "hixqou6": {
          "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hixqou6/",
          "text": "this is generally true, unless you’re somewhere with… um, “uninformed” deans who think that corresponding authors matter. this was the case for one of my previous collaborators, so we gave her corresponding author even though she was not the most senior author because it counted towards her tenure review or whatever. very strange but does happen.",
          "author": "victoria-lobster",
          "created": 1635803923,
          "upvotes": 12,
          "replies": {}
        },
        "hizo6of": {
          "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hizo6of/",
          "text": "This really depends on the country or university. Some countries very much value corresponding author, to the point that only first author or corresponding author papers really 'count' towards someone's record.",
          "author": "bobgom",
          "created": 1635843654,
          "upvotes": 3,
          "replies": {}
        },
        "hj050xf": {
          "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hj050xf/",
          "text": "Not true—as a post-doc I was first and corresponding. This looked good on my job interviews, and now I am the one that gets asked to review other papers, sit on panels, etc. if you are  high up enough this is “busy work” but when you are starting it helps get your name out there.",
          "author": "ColaRBT16",
          "created": 1635856233,
          "upvotes": 3,
          "replies": {}
        },
        "hiyqbjd": {
          "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hiyqbjd/",
          "text": "Correction: the corresponding author is the person whose account submits the paper and receives the referee reports. The grad student still does that work…",
          "author": "sahndie",
          "created": 1635819834,
          "upvotes": 4,
          "replies": {}
        },
        "hix5ilk": {
          "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hix5ilk/",
          "text": "Lol that's a great point, and thank you for the insight - I'm still new to this so kind have though that everything on a paper was fought over for the prestige, so it seems not in this case... but good point about having to deal with emails",
          "author": "Nervous_Upstairs_Bed",
          "created": 1635795281,
          "upvotes": 2,
          "replies": {}
        },
        "hiztxqb": {
          "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hiztxqb/",
          "text": "Not completely correct: you can, as an author, do all that stuff on behalf of the corresponding author themselves. Many publishers' portals allow to do that.",
          "author": "zen_arcade",
          "created": 1635848729,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hix0s0b": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hix0s0b/",
      "text": "I have also heard about some \"tensions\" based on this, but on any of my work (STEM), senior author is always corresponding author UNLESS the lead author is leading a big project and are likely to keep publishing based on the same data etc. But no, I wouldn't think it was undermining the PhD student at all.",
      "author": "commonirishbutterfly",
      "created": 1635793343,
      "upvotes": 3,
      "replies": {}
    },
    "hiybens": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hiybens/",
      "text": "In my bio focused area in the USA in a Cancer Center and Biochemistry and Molecular Biology Dept (bioinformatics mostly), if it is a paper in our lab, the PI is pretty much always corresponding, and if it's across a couple labs, I've seen two PIs negotiate co-corresponding. \n\nThe corresponding is normally for whomever holds the majority of funding for the work (which is **generally** the PI in our lab), and first is for whomever did the majority of research and writing (student or staff member). The number of corresponding author papers definitely counts towards tenure, and will reflect on grant applications. \n\nHowever, my understanding is that for students / post-docs looking for a new professor position (I've not gone that route, I'm staff), first author publications are what will count **most** heavily. Obviously can't necessarily be first on everything, but a majority are expected to be first author publications. And then after starting professor position and independent grant funding, this switches to **majority** corresponding author.",
      "author": "rflight79",
      "created": 1635813041,
      "upvotes": 2,
      "replies": {}
    },
    "hiyzzge": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hiyzzge/",
      "text": "Depends on the field. \n\nFor us, author list is in alphabetical order, so the only \"signifier\" of who did the work and who was among the 20-60 coauthors along for the ride (i.e. contributed some hardware or datataking work but not the brains behind this particular analysis or component) is corresponding author. It makes sense anyway that the ones who did the biggest part of the work in the research and in the drafting of the paper should do the work of communication. \n\nI have gotten in arguments about this, and yes it was worth it because recognition is important.\n\nHaving more than one corresponding author is possible, so we often have 2 or 3, including at least one person with permanent position not expected to move.",
      "author": "nickbob00",
      "created": 1635824693,
      "upvotes": 2,
      "replies": {}
    },
    "hixqa2e": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hixqa2e/",
      "text": "The PI in my lab has always been corresponding author, but I was recently told I should be the corresponding author on my dissertation papers as they are my work.",
      "author": "Professional_Bar_481",
      "created": 1635803749,
      "upvotes": 5,
      "replies": {
        "hiy9yff": {
          "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hiy9yff/",
          "text": "Do you have papers that aren't dissertation papers?",
          "author": "indecisive_maybe",
          "created": 1635812404,
          "upvotes": 1,
          "replies": {
            "hiyent4": {
              "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hiyent4/",
              "text": "Yes! And the PI is corresponding author on those. Not quite certain I can articulate the distinction, but my assumption is the dissertation papers are a gateway of sorts to independence as a researcher (particularly since I won’t be doing a postdoc) but again not entirely clear to me.",
              "author": "Professional_Bar_481",
              "created": 1635814504,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hiyllxy": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hiyllxy/",
      "text": "Students do all the work, PIs get all the glory, amirite?\n\nSource: r/PhDComics 😉",
      "author": "PropertyOfBarry",
      "created": 1635817649,
      "upvotes": 2,
      "replies": {}
    },
    "hix0srd": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hix0srd/",
      "text": "I'd say that for me  it's odd not to see the main author as 'corresponding author'. We usually list authors alphabetically, so first author doesn't carry a meaning, and that might be why...\n\nIn some fields, professors go 'last', and they even talk about their number of 'last-author papers', but never heard of them being the corresponding authors.",
      "author": "systematico",
      "created": 1635793352,
      "upvotes": 2,
      "replies": {}
    },
    "hix4td3": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hix4td3/",
      "text": "I can't imagine it will matter in the long run. First/last/single author has staying power but I have never seen a CV where someone listed \"corresponding authorships\".\n\nThat being said, it does seem a bit odd to put the PI as such in this case.",
      "author": "molobodd",
      "created": 1635794997,
      "upvotes": 2,
      "replies": {}
    },
    "hix3kiq": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hix3kiq/",
      "text": "I'm in STEM and have always been the CA when I was first author. My PI doesnt know enough of the details nor does he care tbh",
      "author": "DeepSeaDarkness",
      "created": 1635794491,
      "upvotes": 0,
      "replies": {
        "hiz6jhq": {
          "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hiz6jhq/",
          "text": "I dont know why I get downvoted for stating facts about my own career but go ahead, reddit",
          "author": "DeepSeaDarkness",
          "created": 1635828750,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hizqv8x": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hizqv8x/",
      "text": "It doesn't matter so long as the PhD student is the first author. Anyone amongst the authors can be the corresponding author and it has no impact whatsoever on the \"prestige\" of those involved. The designation simply means communication (correspondence) between the editor and the authors will go to one email address for the editor's convenience.",
      "author": "afMunso",
      "created": 1635846133,
      "upvotes": 1,
      "replies": {}
    },
    "hizv6ra": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hizv6ra/",
      "text": "Doesn't matter one bit. Honestly, its whoever has more time to handle the submission process and the reviewer responses. It literally doesn't mean a thing.",
      "author": "CptSmarty",
      "created": 1635849727,
      "upvotes": 1,
      "replies": {}
    },
    "hizu8nq": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hizu8nq/",
      "text": "The corresponding author speaks on behalf of all authors when presenting a manuscript/arguing for corrections to the editor/reviewers. Also one of the first things an editor checks when assessing a submission is the corresponding author's track record. It is common (and sensible) that a senior author does all that even if they didn't actually do the work themselves. It's in the best interest of the first author as well. Of course, if the PhD student actually wrote a large part of the paper it's fair they at least share the corresponding authorship.",
      "author": "zen_arcade",
      "created": 1635848978,
      "upvotes": 1,
      "replies": {}
    },
    "hizun0c": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hizun0c/",
      "text": "The corresponding author is literally that: the author to whom correspondence is addressed. So it's best if that is someone with a stable position, usually the PI. However, my own PhD supervisor felt it best that I became corresponding author on most of my papers, as he felt I'd be more suited to answer any follow-up questions. I agreed, but used my personal e-mail address since I wouldn't be reachable otherwise after I completed my PhD. I can now say that in the 12 years since, I have received several e-mails with legitimate questions about my publications and a whole lot of spam. Also numerous job applications from students from India or Iran wishing to join my lab...",
      "author": "caspaseman",
      "created": 1635849298,
      "upvotes": 1,
      "replies": {}
    },
    "hizks0m": {
      "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hizks0m/",
      "text": "PI?",
      "author": "keyboardtoes",
      "created": 1635840445,
      "upvotes": 0,
      "replies": {
        "hizpdus": {
          "link": "/r/AskAcademia/comments/qkkuq2/does_corresponding_author_matter/hizpdus/",
          "text": "Principle investigator, head of the lab who gets the funding etc",
          "author": "Nervous_Upstairs_Bed",
          "created": 1635844792,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}