{
  "sid": "re4sf5",
  "link": "/r/AskAcademia/comments/re4sf5/those_on_search_committees_what_is_usually_the/",
  "title:": "Those on search committees, what is usually the hold up post phone/Skype interview?",
  "text": " I know variations of this question have been asked before, but especially in the current climate, curious about what you have experienced in terms of the various wait times candidates experience after the phone or Skype interview before you contact candidates for campus visits. It can be a day, it can be 2 months. What happens on your end? Part of the reason I’m asking is because I had a phone interview yesterday for my literal dream faculty position and the wait is/will be excruciating.",
  "author": "rose5849",
  "created": 1639244729,
  "updated": 1639515505,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.8,
  "comments": {
    "ho582oq": {
      "link": "/r/AskAcademia/comments/re4sf5/those_on_search_committees_what_is_usually_the/ho582oq/",
      "text": "Yesterday? Oh sweet summer child...\n\nSo many possibilities: bureaucracy, the committee being busy, you not being their first choice, questions of funding for the position and travel, etc.\n\nDo NOT get attached to any position.",
      "author": "CerebralBypass",
      "created": 1639244964,
      "upvotes": 30,
      "replies": {
        "ho5beff": {
          "link": "/r/AskAcademia/comments/re4sf5/those_on_search_committees_what_is_usually_the/ho5beff/",
          "text": "My current position, I received an offer 2 months following my interview. I am under no illusions, just generally curious about some of the various machinations happening behind the scenes.",
          "author": "rose5849",
          "created": 1639246335,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ho65r08": {
      "link": "/r/AskAcademia/comments/re4sf5/those_on_search_committees_what_is_usually_the/ho65r08/",
      "text": "They could be interviewing multiple candidates, and have to narrow it down from there to the few they'd bring to campus. So it could a week or two of phone interviews, then a week of picking the top 3 to bring in, then 3 weeks of getting all those travels approved by the dean and provost.",
      "author": "Plasma4life",
      "created": 1639259554,
      "upvotes": 10,
      "replies": {}
    },
    "ho5dvjx": {
      "link": "/r/AskAcademia/comments/re4sf5/those_on_search_committees_what_is_usually_the/ho5dvjx/",
      "text": "Wrangling schedules, bureaucracy, and being overworked. Most people want to move things along quickly and respectfully. I also echo the other person who responded that getting attached to one position will do major damage to your mental health. While on the job market I have taken up a new hobby: ceramics, water color, roller skating, etc. it really helps to channel creative or physical energy in a new and enjoyable manner. Big hugs for this process. It is brutal.",
      "author": "MiztheBigBad",
      "created": 1639247358,
      "upvotes": 9,
      "replies": {}
    },
    "ho6b282": {
      "link": "/r/AskAcademia/comments/re4sf5/those_on_search_committees_what_is_usually_the/ho6b282/",
      "text": "What others have said, basically. If you phone screen about half a dozen candidates, then meet to short list for campus visits, work through red tape to get permission to bring the candidates in etc. we’re easily talking several weeks. We do try to get regrets out quickly for those applicants who did not make the pool but otherwise you may not officially hear back until a selection is made. \n\nI remember applying for a TT position in an R1 and it took them 6 months to get back to me *shrug*.",
      "author": "Gremdelion",
      "created": 1639261970,
      "upvotes": 7,
      "replies": {}
    },
    "ho5gqax": {
      "link": "/r/AskAcademia/comments/re4sf5/those_on_search_committees_what_is_usually_the/ho5gqax/",
      "text": "I'm on 2 search committees right now. (FML) It could be anything.",
      "author": "grayhairedqueenbitch",
      "created": 1639248564,
      "upvotes": 4,
      "replies": {}
    }
  }
}