{
  "sid": "m7i3mv",
  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/",
  "title:": "Friend outsourced her thesis portfolio for MFA. Should I keep quiet?",
  "text": "I consider myself to be a pretty ethical person, but I'm not really sure what to do here, or the proper course of action. Hopefully you folks can help guide me a bit.\n\nA friend of mine is graduating in May from her Creative Writing program, an MFA. She recently bragged, in private, about paying other people to write for her ever since she was an undergrad (at the same school she's getting her MFA now). This behavior even extends to the portfolio for her thesis project. \n\nShe said no one knows besides the people that wrote for her, and the whole vibe was very much like she'd found a lifehack that she couldn't believe everyone didn't do.\n\nAny other time, I would probably steer clear of the whole mess, especially if it were a one time thing. Who knows what people are going through, you know? But since she's done it for so much of her academic career, it's been weighing on me.\n\nDo I report this? Is there even a mechanism for doing so?  I think part of what I'm wrestling with is since she doesn't seem to have told anyone else, she'd probably know it's me if I speak up. It could blow up about a quarter of my social circle. But since I have no proof myself, no smoking gun, is there even any point in putting myself out there in the line of fire for this one? \n\nWhat would you guys do? ☹️\n\nUPDATE: After considering the discussion and weighing my options, I reported. I was very upfront about having no proof beyond my own account. They now want to talk to me 1 on 1 and have a meeting to go over everything. I didn't want to get even further involved after the initial report, but that looks like it will be a challenge. 😭\n\nUPDATE 2: They wanted as many details as I could give them, which wasn't a lot. I ended up delivering them via video conference, which was pretty awkward. As far as I'm aware, my identity was preserved, and nothing was done. Her thesis/book was printed, and I got a copy of it. It has so many basic spelling and grammar errors not only in the text but on the back cover as well. I guess I know what an MFA at [REDACTED for privacy] is worth 😵",
  "author": "natthrow",
  "created": 1616038271,
  "updated": 1634080543,
  "over_18": false,
  "upvotes": 258,
  "upvote_ratio": 0.96,
  "comments": {
    "grbspqi": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbspqi/",
      "text": "You're worried about her academic career? It's not even hers.",
      "author": "russian-scout",
      "created": 1616049703,
      "upvotes": 394,
      "replies": {
        "grc4ttw": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc4ttw/",
          "text": "What is she exactly gonna do for her job? Give the money she gets to other people ? For the rest of her life?",
          "author": "oops_ana",
          "created": 1616061750,
          "upvotes": 111,
          "replies": {
            "grc5col": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc5col/",
              "text": "Wild guess: she has rich parents and won't have a job.",
              "author": "Overunderrated",
              "created": 1616062261,
              "upvotes": 110,
              "replies": {}
            },
            "grec03b": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grec03b/",
              "text": "Reminds me of this \"software developer\" who worked for Verizon and [outsourced all his coding to Chinese software developers.](https://www.bbc.com/news/technology-21043693)",
              "author": "ChristianSky2",
              "created": 1616095305,
              "upvotes": 11,
              "replies": {
                "gretla3": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gretla3/",
                  "text": "Honestly I know a couple people that do this. Most of them actually are good devs, they're just greedy at and \"work\" multiple jobs and basically give half the salary for one to some guy in China.\n\nPretty fucked up.",
                  "author": "Macduffer",
                  "created": 1616103514,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "gre7lxw": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre7lxw/",
              "text": "If it's an MFA, she may indeed do that and call it \"Performance Art.\" James Franco will retweet her.",
              "author": "Greenmantle22",
              "created": 1616093371,
              "upvotes": 7,
              "replies": {
                "greymc1": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greymc1/",
                  "text": "\"For my thesis, I've collected a portfolio of writing samples from around the world\"",
                  "author": "set_null",
                  "created": 1616105864,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "grbgwnw": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbgwnw/",
      "text": "This is serious-as-a-heart-attack plagiarism, and one of the highest academic violations a student can knowingly commit.  I once sat as a senator for a Canadian university, and we expelled people for less.  Report her; she may as well learn one thing while at school.",
      "author": "Selfpropelledfapping",
      "created": 1616040482,
      "upvotes": 378,
      "replies": {
        "grc1f1o": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc1f1o/",
          "text": "[removed]",
          "author": null,
          "created": 1616058254,
          "upvotes": -356,
          "replies": {
            "grce9c3": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grce9c3/",
              "text": "And Fuck you for making out like neuro-diverse people need to cheat. We do not. We bring our own differences to the table, we can work with our professors in finding a way to show we are capable of learning the content and *earning* our degrees.\n\nWe may do it differently, but we certainly don't need to cheat to do it.",
              "author": "-Pneuma--",
              "created": 1616068089,
              "upvotes": 194,
              "replies": {}
            },
            "grcpzxl": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcpzxl/",
              "text": "Stop makin people with adhd look like petulant children.",
              "author": "Yeti_Poet",
              "created": 1616073109,
              "upvotes": 45,
              "replies": {}
            },
            "grc8vf8": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc8vf8/",
              "text": "What a hill to die on.",
              "author": "Eamon_Valda",
              "created": 1616064573,
              "upvotes": 42,
              "replies": {}
            },
            "grc4jwx": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc4jwx/",
              "text": "Did you even read OP's post? Their friend *bragged* about it. Totally not driven by \"systemic discrimination\". Nobody's talking about all the points you mentioned - it's clearly academic dishonesty we're talking about. Have some level of basic comprehension.\n\nAlso let's not forget that you cheated your way through your biochem degree, so it's not yours. You don't have the right to shit on anyone LMAO. Wake tf up:)\n\nEdit: I'm sorry you had to deal with a shitty education system but coming from a country with a highly regarded education system that doesn't really work I understand your struggles with ADHD, maybe not completely but I do because I have an acquaintance who struggles with it too. I hope you find the strength to ignore those who dismissed you. Be better.",
              "author": "xlez",
              "created": 1616061477,
              "upvotes": 95,
              "replies": {}
            },
            "grcaz9g": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcaz9g/",
              "text": "And fuck you for believing You're a helpless idiot and for cheating for your degree. You shouldn't have one either. \n\nAlso \"I will never fuck with a system that marginalized me my entire life...\" and \"I have my fucking biochem degree...\". Make it make sense...",
              "author": "Known-Okra-3040",
              "created": 1616065606,
              "upvotes": 87,
              "replies": {
                "grdh8gp": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdh8gp/",
                  "text": "They might have a biochem degree but, with this attitude, there’s no way they’ll ever use it in their career effectively. As someone in biochem, you can’t fake it irl. You either know your stuff or you don’t. And if they really did cheat their way through a biochem degree, they won’t be able to apply it to anything useful in the future.",
                  "author": "WhoCaresWhyBother",
                  "created": 1616082515,
                  "upvotes": 20,
                  "replies": {}
                }
              }
            },
            "grc7apv": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc7apv/",
              "text": "Hey, I know having a mental illness is tough, and doubly so during graduate school. It's hard to struggle with basic things, but be held to such high standards. But what you are saying doesn't seem very constructive or like it is an attitude that helps you. Are you able to get help in any way? Have you talked to school counselors?",
              "author": "Euneiphreniae",
              "created": 1616063780,
              "upvotes": 26,
              "replies": {}
            },
            "grc26sw": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc26sw/",
              "text": ">Rules are meant to be broken, do not conform to a system that does its best to fuck you up. Cheat the fuck out of it.\n\nRules are meant to be broken?\n\nThen you won’t mind that I will take the deeds of your house illegally, and have police escort you out of my premises...\n\nThen you won’t mind that your bank account is suddenly zero because the bank needs money and rules are meant to be broken\n\n... why are you even in this subreddit? Who would actually hire you in academia?",
              "author": "advanced-DnD",
              "created": 1616059060,
              "upvotes": 111,
              "replies": {
                "grd0b89": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd0b89/",
                  "text": "Sounds like being a minority for most of American history.",
                  "author": "makemeking706",
                  "created": 1616076860,
                  "upvotes": -4,
                  "replies": {}
                },
                "grc27ad": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc27ad/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1616059073,
                  "upvotes": -4,
                  "replies": {
                    "grc2plc": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc2plc/",
                      "text": "Bad bot.",
                      "author": "SilencioTwat",
                      "created": 1616059590,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "grccfzs": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grccfzs/",
              "text": "Agreed that the everything is not A-ok with how neurodivergent people are treated. Agreed that the current educational system is not alright. But...\n\nI cannot agree much with the rest. I too have ADHD and a biochemistry degree (I know at least a couple more). I don't \"shit\" on others about it. It's tough, class feels meaningless, and self-teaching has been the only way for me.\n\nI also think that reporting is a personal choice. Everyone is living through their own filtered lens. People should live as they so choose, as you seem to do.  \n\nIt's easy to apply your own philosophy to everyone, as I guess you feel that neurotypicals do to us. But I don't think the solution is to say \"fuck you all\" and go rogue. Do you expect to be heard like this? Do you think this will lead to change? --side note: it may, if you organize a successful large-scale protest at a small institution\n\nI think many would agree with some of your sentiments. And I think change is happening in real-time as we speak. But I have found that it only happens by us having direct conversations with those in positions of power. I think with COVID especially, I've been giving my graduate school directors a lot of feedback on what works and what doesn't, as well as how to make school for inclusive for neurodivergent or culturally-divergent people. \n\nI can feel your struggle, and I wish you well.",
              "author": "YeastAssassin",
              "created": 1616066732,
              "upvotes": 19,
              "replies": {}
            },
            "grcvjye": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcvjye/",
              "text": "Dude ive got adhd and depression and haven't fucking cheated my way through my degree. The current educational system may not be alright but that doesn't excuse cheating. \n\nSaying people cheat because they're neurodivergent gives us all a bad rap. All my friends and students who had mental health issues never cheated and the students I had who did cheat did it because they thought they could get away with it. All the times I saw it, it was on inconsequential 1-5% assignments and it was students already with great averages trying to get into med school or vet school. \n\nSo chill out on trying to say people only cheat because of mental health and congratulations on literally the worst take anyone has ever had.",
              "author": "r3allybadusername",
              "created": 1616075178,
              "upvotes": 15,
              "replies": {}
            },
            "grc248y": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc248y/",
              "text": "[deleted]",
              "author": null,
              "created": 1616058988,
              "upvotes": 50,
              "replies": {
                "grc26wz": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc26wz/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1616059064,
                  "upvotes": -80,
                  "replies": {
                    "grc35lt": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc35lt/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1616060052,
                      "upvotes": 37,
                      "replies": {
                        "grc3rnl": {
                          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc3rnl/",
                          "text": "Yah no you're right I just get unreasonably mad for no reason, stay mad for like 10 minutes then calm down and hate myself.\nIt just triggers the shit out of me when people talk about reporting others without knowing their situation.\n\nI for example cannot sit down and study for more than 5 minutes without having to take meds I don't want to take because of the neurological damage they can cause which would worsen my condition but some random dude can just sit for 5 hours doing nothing but studying.\n\nI was born with adhd and there's literally nothing I can do but take meds, I've tried most possibilities. \n\nCan you tell why it makes me mad? I'm legitimately handicapped and 95% of people dismiss it as \"not able to sit down\".\n\nNot deleting the comments because otherwise I won't learn.",
                          "author": "OhConfusing",
                          "created": 1616060678,
                          "upvotes": -39,
                          "replies": {
                            "grc4xo7": {
                              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc4xo7/",
                              "text": "But if that's what you're like isn't it better to pursue a career that caters to your strengths? I don't just mean you but anyone in this situation. Eg you might enjoy working with your hands and be a great woodworker etc.\n\nI don't understand the point in cheating to get a degree, where you then don't have any of the actual skills and can't be useful in a job anyway? Surely it would come out quite quickly in any type of relevant job where you have to perform? And if it doesn't, and you keep outsourcing your tasks, then maybe you should start a company that helps provide such services as you would be very good at organising them.",
                              "author": "GlassCannonLife",
                              "created": 1616061854,
                              "upvotes": 31,
                              "replies": {
                                "grc9s4q": {
                                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc9s4q/",
                                  "text": "I think this discussion has gone way off track from the OP's situation, so I'm just going to add in my personal experience here. \n\nI also have ADHD. I never graduated high school (or got a GED), and nearly failed out of 3 community colleges and my undergrad institution due to my undiagnosed adhd symptoms. Once I got treatment the academic stuff became almost manageable. At the same time I met a professor who was just starting up a lab and needed some undergrads for the summer. \n\nIt's now 4 years later and I'm currently 2 years into a chemistry PhD program (I have my 2nd year exam in 12 hours lol). I graduated with my bachelor's after 6 years (11 if you count the community colleges), and finally cracked a 3.0 in my final semester. I suck at taking classes, but I'm really good at research; I had 2 first author publications in *J. Phys. Chem.* as an undergrad. I also managed to pick up the NSF GRFP fellowship. \n\nAlong the way I had several people, including my first therapist, who told me I should drop out and find a career that suits me better because obviously college was not for me. I am really glad that I did not listen to those people. Those comments were some of the most demoralizing messages I could have received. I knew that my understanding of the material was not the problem, I just couldn't demonstrate that understanding in a way that got me good grades. I was severely depressed, and I was constantly telling myself that I want good enough and I should just quit. Actually hearing that from other people just compounded that negativity, and I replayed those comments in my mind countless times. \n\nI'm starting to get off track here, so I'll circle back to my main point. \n\nColleges are not built to accommodate neurodiverse people. They fail us out of inflexibility, not because we don't understand what we are learning. I don't condone cheating, but once I got diagnosed and started seeing that I was pretty successful in the lab, I quickly recognized that college was more about jumping through the correct hoops than actually learning. \n\nAgain, I am not commenting on the cheating described in the OP. That is clearly wrong. That said, those of us who can't study and memorize information like 'normal' people have to find alternatives. \n\nFor example, my second year exam includes a proposal presentation. I passed the written component with flying colors, but I generally struggle to remember information until I get some external promoting. Knowing that, I designed my slides so that they would elicit lots of questions from my committee. Unfortunately most undergrad programs don't offer the flexibility to take a non-standard approach like this for most graded assignments. \n\nAs a general rule I assume I'll lose 10% of the points on an exam due to the ADHD tax. That's on a good day. On a bad day that tax can skyrocket. \n\nI have a collection of spreadsheets that I've made for common calculations because I fuck up simple math quite easily. Does that mean I don't understand stoichiometry? No, it just means that I transpose numbers and lose decimals very easily. That is essentially not a problem in the lab because I have access to my computer, but on an exam I'm fucked. \n\nI'm just trying to point out that a person's success and grades in college does not necessarily have any bearing on how successful they will be in their career. Hell, my tendency to hyperfocus and leap down rabbit holes can be helpful because I end up exposed to information that I otherwise would not have come across.",
                                  "author": "sailingpj",
                                  "created": 1616065021,
                                  "upvotes": 31,
                                  "replies": {
                                    "grcw8ep": {
                                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcw8ep/",
                                      "text": "I’m neurotypical and find this really inspiring. You are so resilient, congratulations on your success, you clearly earned it.",
                                      "author": "jamieviva",
                                      "created": 1616075418,
                                      "upvotes": 6,
                                      "replies": {
                                        "grd20od": {
                                          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd20od/",
                                          "text": "Thanks! I couldn't have done it if I hadn't met my undergrad research advisor. Being just giving me the opportunity to work with him, he was extremely supportive and encouraged me to get my mental health in order. \n\nI have plenty of other people to thank too, but meeting him was a major turning point for me.",
                                          "author": "sailingpj",
                                          "created": 1616077434,
                                          "upvotes": 5,
                                          "replies": {}
                                        }
                                      }
                                    },
                                    "grfxi8f": {
                                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfxi8f/",
                                      "text": "That's great, I'm glad you pursued it!",
                                      "author": "GlassCannonLife",
                                      "created": 1616124007,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "grc555u": {
                              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc555u/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1616062058,
                              "upvotes": -8,
                              "replies": {
                                "grc5iqu": {
                                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc5iqu/",
                                  "text": "I can't just use hyperfocus lmfao it's not a pokemon attack.\n\nI hyperfocus on random shit that hasn't anything to do with necessary skills, sometimes it overlaps but that's rare.\n\nLast big hyperfocus I had was on minecraft pvp, I did nothing at home besides play 8h of that a day for a few months after work lmao.",
                                  "author": "OhConfusing",
                                  "created": 1616062421,
                                  "upvotes": 14,
                                  "replies": {
                                    "grc5zhw": {
                                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc5zhw/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1616062856,
                                      "upvotes": -9,
                                      "replies": {
                                        "grc8dwl": {
                                          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc8dwl/",
                                          "text": "Wow holy shit the ignorance drips outta you.\n\nIt's not something you can just decide to do. It just happens on fucking random shit.\n\nI'm so fed up with the lack of knowlegde about adhd. \n\nI cannot chose I have to obey my subconscious.0",
                                          "author": "OhConfusing",
                                          "created": 1616064328,
                                          "upvotes": -2,
                                          "replies": {
                                            "grcdeo2": {
                                              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcdeo2/",
                                              "text": "[deleted]",
                                              "author": null,
                                              "created": 1616067468,
                                              "upvotes": 2,
                                              "replies": {
                                                "grdot85": {
                                                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdot85/",
                                                  "text": "Don't forget, not everyone experiences ADHD symptoms the same way. Some people really can't control what they hyperfocus on.",
                                                  "author": "sailingpj",
                                                  "created": 1616085287,
                                                  "upvotes": 3,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "grd6jwl": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd6jwl/",
              "text": ">Rules are meant to be broken, do not conform to a system that does its best to fuck you up. Cheat the fuck out of it.\n>\n\nAcademic honesty is the foundation of research. You can't explore new ideas without robust documentation.\n\n>Edit: downvote me all you want but I will never fuck with a system that marginalized me my entire life because my brain is wired differently and forced me to find every way to exploit every situation just to live somewhat normally because I have adhd lmao.\n\nYeah, lots of people are neurodivergent. To be honest, they are more prevalent in academia than out of academia. It sounds like you're fairly bitter about something in your past, and that's motivating your bile here. Have you spoken with someone? Or maybe you did some academically dishonest things and are now feeling defensive? Either way, interrogate the root of this anger and you'll be happier.\n\n>\n>Fuck you if you think everything is A-ok with how neuro divergent people are treated.\n\nNobody addressed that until you brought up the seeming non-sequitur. As an aside, every school I've been at has had accomodations for neurodivergent individuals. While these accomodations only account for some small part of the challenge of neurodivergent academic work, the intent is there and I know I'm happy to accommodate folks.\n\n>\n>Fuck you if you think the current educational system is alright.\n>\n\nNope, nobody is saying that, just that within the system there are reasonable rules as well as unreasonable. Cheating is a form of theft and is reasonably proscribed.\n\n>Fuck you if you think people cheat because they want to, it's because they have to or have been driven to by systemic discrimination.\n\nA lot of people do cheat for exactly that reason. Like in the OP, she's bragging about it, not trying to do an art piece showing discrimination.\n\n>\n>And a big fuck you to everyone that thinks reporting people is the right thing to do.\n\nThink about if an MD got their degree by cheating. Would you want them to be taking care of your family, after doing F-level work in chemistry or physiology?\n\n>\n>I have my fucking biochem degree and I shit on all of you lmao.\n\nTo help you consider that maybe others have important perspectives, I've got a PhD in Nuclear Chemistry. Grow up, please.",
              "author": "atchemey",
              "created": 1616079052,
              "upvotes": 15,
              "replies": {
                "grdfe1w": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdfe1w/",
                  "text": "Great point about neuro divergent people in academia.  Very common!  Thinking differently makes you better for academia, not worse.",
                  "author": "Depressaccount",
                  "created": 1616081924,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "grcbjq7": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcbjq7/",
              "text": "You’re not the only student with ADHD bud... take the meds, you don’t like them? Go to behavioral health therapy. There is an answer to everything, but blaming all your problems on ADHD is going to get you nowhere\nEdit: there is also accommodations for students with ADHD",
              "author": "imarabianaff",
              "created": 1616066027,
              "upvotes": 35,
              "replies": {}
            },
            "grcxobt": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcxobt/",
              "text": "I have adhd and got straight As all through my undergrad without ever cheating. The thought never crossed my mind. I knew I faced different challenges that others didn't, and I worked my ass of to make up for it. I am now getting my PhD in chemistry, and guess what, still have never cheated.\n\nAlso, don't gloat about your undergrad degree literally one second after talking about how you cheated your way through school. Maybe if you hadn't cheated your whole life you'd see the irony.",
              "author": "Greatbigdog69",
              "created": 1616075949,
              "upvotes": 12,
              "replies": {}
            },
            "grcvisy": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcvisy/",
              "text": "This is neither the appropriate time nor place for you to die on this hill.  Sir, this is a Wendy's.",
              "author": "renieri",
              "created": 1616075167,
              "upvotes": 7,
              "replies": {}
            },
            "grd6n7q": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd6n7q/",
              "text": "Weird. I have pretty obnoxious ADHD and anxiety and was able to get two degrees without cheating at all. Quit using your neurodivergency as an excuse to fuck around. Yeah the system is stacked against us, and stacked against people who may be NT but aren't born into good situations but that's no excuse to cheat. People like you are just as fucked up as the people who paid to have their kids accepted to good schools. They didn't do the work to get where they are and if you cheated to get your degrees neither did you.",
              "author": "NarcissisticDramaQwn",
              "created": 1616079082,
              "upvotes": 6,
              "replies": {}
            },
            "grc5qr5": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc5qr5/",
              "text": "Lol \"someone discriminated me for X reason, therefore the whole blame is on the world's educational system and thus I am entitled to cheat on exams\"\n\nGrow up and start facing the world for a change, and while at it leave this sub. Not everything that happens in life is other people's fault",
              "author": "math_chem",
              "created": 1616062628,
              "upvotes": 39,
              "replies": {
                "grcy9im": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcy9im/",
                  "text": ">someone discriminated me for X reason\n\nI think you lost your \"against.\" It goes right after \"discriminated.\"",
                  "author": "shinypretty",
                  "created": 1616076153,
                  "upvotes": -8,
                  "replies": {}
                },
                "grc6hkl": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc6hkl/",
                  "text": "Ah yes, the perfect example of what I meant. Thank you.\n\"Start facing the world\" he says to someone that literally cannot function in this world without medication he cannot afford nor want to use.\n\n\"Grow up\" he says to someone that's literally clinically blocked in the emotional state of a teenager for his entire life.\n\nGather slightly more life experiences, I say, to someone that doesn't have an ounce of empathy.",
                  "author": "OhConfusing",
                  "created": 1616063321,
                  "upvotes": -62,
                  "replies": {
                    "grcsgwb": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcsgwb/",
                      "text": "I’ve known people with untreated ADHD who had morals and integrity and would never cheat. You’re just using your condition as an excuse for being a bad person, and this is plainly obvious to everyone.\n\nI’m sure you could do better in life if you focused on being a better person. Your condition is not your destiny.",
                      "author": "TakeOffYourMask",
                      "created": 1616074067,
                      "upvotes": 37,
                      "replies": {}
                    },
                    "grccnfs": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grccnfs/",
                      "text": "Right, and is it the school or the university's fault that you have this conditions? Is it your teachers fault that you have this condition? Is it your university's fault that you cant function and cant afford your medications?\n\nUnless you answer Yes to any of these questions, academia is not to blame for your own personal issues which, from what you say, you were BORN WITH, years and years before attending college. If you want to blame someone or something, do it on your country's lacking public health system, whichever that is. Unless you went to a college and all your professors/staff said \"you're a pussy Grow the fuck up\" we have nothing to do with your thing\n\nEveryone has their own difficulties and hardships in life, don't try to throw this thag you're more especial than me or anyone else here for whatever reason. You know your stuff, I know mine and others know theirs, you're the one saying its the world's fault here. It's not about lack of empathy, is about putting entitled people with misdirected hatred in check",
                      "author": "math_chem",
                      "created": 1616066895,
                      "upvotes": 28,
                      "replies": {}
                    },
                    "grdmfke": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdmfke/",
                      "text": "As someone with adhd and bipolar.. grow the fuck up.",
                      "author": "Bright_Push754",
                      "created": 1616084422,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "grcn7hv": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcn7hv/",
              "text": "Upvote because this post cracked me up.",
              "author": "CaptainCornerCamper",
              "created": 1616072081,
              "upvotes": 7,
              "replies": {}
            },
            "grd4r13": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd4r13/",
              "text": "So you think you are winning here? That you are somehow cheating the system? Sticking it to the man?\n\nYou are only cheating yourself. Sad.",
              "author": "dali-llama",
              "created": 1616078470,
              "upvotes": 5,
              "replies": {}
            },
            "grcebjv": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcebjv/",
              "text": "r/iamverysmart",
              "author": "mqrocks",
              "created": 1616068134,
              "upvotes": 10,
              "replies": {}
            },
            "grderxq": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grderxq/",
              "text": "Yet another neuro divergent here.  I never told anyone.  At best I took adhd meds, but not even until grad school.  I struggled with a host of other shit, but I got my phd.\n\n\nNo one owes you for existing.  There are so many accommodations out there if you really want to take advantage of them.  You're not a victim.  You are making excuses for your behavior, but none of it is justified.  \n\n\nCould things be better?  Yes.  But if you needed to cheat to get that degree, the degree means nothing, and I sure hope you aren't responsible for anything important.  \n\n\nOf course reporting is the right thing to do.  Someone could end up hiring a writer who doesn't know how to write.  That's insane.  This is beyond cheating - it's fraud.  \n\n\nStop making neuro divergent people look bad.  Do what every other group who has been discriminated against does: work harder than the person beside you and prove your worth.",
              "author": "Depressaccount",
              "created": 1616081741,
              "upvotes": 3,
              "replies": {}
            },
            "grd2p3q": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd2p3q/",
              "text": "\"Wah, I have ADHD so I am justified in being a total loser who cheats to get his degree.\" I have news for you, bucko, the world is a shitty place and everybody struggles with something. Just because those of us who are neurodivergent have particularly difficult struggles does not give us the right to commit academic dishonesty. Your actions and attitudes damage those of us who have struggled and succeeded in spite of our difficulties, and for that, you can fuck off.",
              "author": "TheDevoutIconoclast",
              "created": 1616077658,
              "upvotes": 6,
              "replies": {}
            },
            "grd6bzh": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd6bzh/",
              "text": "You may have a biochemical degree, but you sure as hell don’t deserve it or qualify for it, and I wouldn’t trust any project that you worked on by extension.",
              "author": "kinderdemon",
              "created": 1616078980,
              "upvotes": 3,
              "replies": {}
            },
            "grdhffb": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdhffb/",
              "text": "Writing your own short stories for your MFA program isn't \"cheating a broken system.\" It's cheating other, hard-working students and cheating herself out of skills. She may even keep this attitude going, get a writing job at a TV show or magazine, and end up stealing peoples' work for decades. It's shitty, not smart.",
              "author": "SlothRogen",
              "created": 1616082586,
              "upvotes": 2,
              "replies": {}
            },
            "grccoaf": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grccoaf/",
              "text": "[removed]",
              "author": null,
              "created": 1616066914,
              "upvotes": -22,
              "replies": {
                "grckshs": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grckshs/",
                  "text": "This is not the fucking place to be a racist.",
                  "author": "xlez",
                  "created": 1616071215,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "grbzqnt": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbzqnt/",
      "text": "In addition to all the basic claims here, I want to posit one other point. \n\nMFA spots are limited, in COVID even more so. She got in, meaning someone didn’t.\n\nYour friend, through plagiarism, has already taken an MFA spot from someone who probably didn’t. I understand she is your friend, but she has effectively stolen funding from someone who has worked their ass off to work at a place she is not qualified to work.",
      "author": "WhyIsThatImportant",
      "created": 1616056493,
      "upvotes": 302,
      "replies": {}
    },
    "grbvciw": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbvciw/",
      "text": ">It could blow up about a quarter of my social circle.\n\nIf this were to happen, you need new friends. You don't need anyone in your life who would support one of the highest academic violations a student can do.",
      "author": "BelgianWaffle97",
      "created": 1616052174,
      "upvotes": 212,
      "replies": {}
    },
    "grby332": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grby332/",
      "text": "As someone who literally just turned in their MFA thesis a week ago, this is mind boggling. She went through an entire MFA program with plagiarized writing? WTF\n\nEven worse is if she intends to teach. She won't have the first clue what she's doing. She didn't go through workshops with her own work. She hasn't learned how to edit or apply criticism or anything if she hasn't been the one doing the writing.\n\nOn the one hand, she'll have a hard time teaching on a college level without publication credits of some kind. On the other, I would worry this will lead to even more plagiarism down the line.\n\nPlease report this. While you are under no obligation to do so (since you are not in school with her) you might just save some poor future student from having a sham of a teacher.",
      "author": "MadWitchLibrarian",
      "created": 1616054839,
      "upvotes": 105,
      "replies": {
        "grdfxqo": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdfxqo/",
          "text": "I agree, what I'm wondering is how the OP can report it without it being obvious that it was the OP.  Unless she told a group of people at once? Will they believe OP, especially without proof?  I'd almost prefer the OP find documentation on all these papers somehow.",
          "author": "Depressaccount",
          "created": 1616082080,
          "upvotes": 8,
          "replies": {}
        },
        "gt9ib6p": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gt9ib6p/",
          "text": "It's looking like she'll be doing some kind of Americorps fellowship after graduation in order to defer loans. 🙃",
          "author": "natthrow",
          "created": 1617471123,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grbhl1g": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbhl1g/",
      "text": "I just couldn’t understand why your friend wanted the MFA. Given she doesn’t have the ability to write, how would a master’s degree in writing benefit her? \n\nI hope she find direction in life",
      "author": "overlapping_gen",
      "created": 1616040920,
      "upvotes": 140,
      "replies": {
        "grbkpft": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbkpft/",
          "text": "Coincidentally, she works at her school's writing center. I'm not entirely sure what this means, but she has a level 2 tutoring certificate from something called the CRLA? It's some kind of credential that she said would help her get a job as a teacher while she works on her book. That she plans to teach is part of why I'm so concerned about this behavior.\n\nAs far as her philosophy, when she was talking about all this, one of the excuses she used was that she already knew how to write, and that the MFA was a piece of paper that largely didn't matter except to employers",
          "author": "natthrow",
          "created": 1616043075,
          "upvotes": 98,
          "replies": {
            "grbvq11": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbvq11/",
              "text": "Oh my dear fucking god she doesn't have a clue how to write. When I was in my third year I was cocky enough to think I already knew how to write, but writing and rewriting dozens of essays taught me that there was plenty of growth for me to achieve still.",
              "author": "True-Inside-9255",
              "created": 1616052531,
              "upvotes": 90,
              "replies": {}
            },
            "grc5arm": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc5arm/",
              "text": "Lmao are other people writing her “book” as well?",
              "author": "oops_ana",
              "created": 1616062210,
              "upvotes": 45,
              "replies": {}
            },
            "grebzbu": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grebzbu/",
              "text": "CRLA certification will really only be helpful if she wants to work in a writing center after graduation, or if she’s applying for writing center director jobs. It won’t help her land a faculty position. Tbh, the MFA probably won’t help her get a full time or tt job, either. While the MFA is technically a terminal degree, to get a CW job, writers usually need a CW PhD, a book deal, and a lot of pubs in literary journals.",
              "author": "Opening_Doors",
              "created": 1616095295,
              "upvotes": 5,
              "replies": {}
            },
            "grct0ls": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grct0ls/",
              "text": "Yeah I wouldn’t worry too much about her job prospects. Level 2 certified CRLA writing tutor here. It looks good on a CV, but it’s pretty much just a peer review center. \n\nIf she doesn’t have any actual teaching experience and no book from a national press then her job prospects-at least in CW-are very slim. \n\nI also work in publishing. If she somehow manages to get an agent using someone else’s work, the editing process will reveal her inabilities. \n\nEven many English departments won’t hire adjuncts to teach Eng 101 without an MA. MFAs really don’t count for much in the academic world unless you also have at least one book pubbed.",
              "author": "cudlmnstr",
              "created": 1616074266,
              "upvotes": 19,
              "replies": {
                "grd1wjk": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd1wjk/",
                  "text": ">MFAs really don’t count for much in the academic world unless you also have at least one book pubbed.\n\nThat's simply not true-- the MFA is considered a terminal degree in many artistic fields. Lots of faculty in the arts (theater, dance, music, studio art, etc.) have MFAs, as do a fair number of composition instructors at schools which consider that an appropriate degree for English faculty.",
                  "author": "SnowblindAlbino",
                  "created": 1616077395,
                  "upvotes": 11,
                  "replies": {
                    "grdl6jo": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdl6jo/",
                      "text": "You might be right about those other artistic fields. However, if you're trying to get a tenure-track creative writing professorship, you absolutely need a book pub -- or if you're really lucky, a list of impressive literary journal pubs -- in addition to the MFA, which you generally also need.",
                      "author": "hysterical_abattoir",
                      "created": 1616083949,
                      "upvotes": 11,
                      "replies": {}
                    },
                    "grdmq49": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdmq49/",
                      "text": "Yes but my comment was in the context of CW. As I stated, SOME programs do not accept MFAs as adequate schooling to adjunct and require the MA. Yes, that does mean SOME programs do accept them. However, in the grand scheme of things, the MFA in CW is not all that helpful if you’re trying to teach English or CW and you don’t have a book pubbed. I say this as someone who has an MFA in CW and who is currently a TA in an MA program bc my MFA was not enough to get hired as an adjunct even at a community college. \n\nYes, you do generally need the MFA to teach, but you ALSO need a book pubbed.",
                      "author": "cudlmnstr",
                      "created": 1616084526,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "grcb45e": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcb45e/",
              "text": "The MFA is a piece of paper of no value to employers.",
              "author": "talondarkx",
              "created": 1616065679,
              "upvotes": 1,
              "replies": {
                "grd1nrb": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd1nrb/",
                  "text": ">The MFA is a piece of paper of no value to employers.\n\nNo reason to shit on degrees you don't understand-- lots of my faculty colleagues have MFAs and the are brilliant, creative people. I know many dozens of folks with MFAs who are highly valued by their employers inside and outside of academia.",
                  "author": "SnowblindAlbino",
                  "created": 1616077315,
                  "upvotes": 29,
                  "replies": {
                    "grg2exn": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grg2exn/",
                      "text": "Did the MFA get them their job/position, or did their work that they accrued through the MFA get them there? The MFA is not a CPA or some other credential that will open professional doors if they have no ability on their own - it is an opportunity to accrue experience with talented mentors. Someone who buys a CPA accreditation is probably also equally fucked in terms of their job hunt but this one is uniquely useless.",
                      "author": "talondarkx",
                      "created": 1616126982,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "grdalmd": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdalmd/",
                  "text": "Sure, I guess. Unless that employer is a university and you’re seeking a tenure track appointment. In that case, the MFA (as a terminal degree) is a basic qualification.",
                  "author": "Arderis1",
                  "created": 1616080373,
                  "upvotes": 11,
                  "replies": {
                    "grduuwy": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grduuwy/",
                      "text": "Nobody will hire an MFA in creative writing for a TT creative writing without an outstanding portfolio of published work. If this person was trying to cheat their way through a nursing or civil engineering degree I would agree there is a duty to report. In this case, they are only cheating themselves out of their own necessary experience on an expensive and otherwise useless degree.",
                      "author": "talondarkx",
                      "created": 1616087820,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "grd7g3p": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd7g3p/",
              "text": "I also have a CRLA level 2 tutoring certificate, it just means I tutored a certain number of hours in an accredited tutoring center or whatever. I tutored random classes in undergrad. It doesn't mean much.",
              "author": null,
              "created": 1616079341,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "grbev6k": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbev6k/",
      "text": "I mean, you should definitely report this. what strikes me about what you're saying is that she seems to be pretty smug and proud of herself. I would be disappointed to learn from or work with someone like this and it should disqualify her.",
      "author": "doctorelian",
      "created": 1616039202,
      "upvotes": 131,
      "replies": {
        "grbn8mt": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbn8mt/",
          "text": "Smug was the word my husband used when I tried to describe this all to him too. The way she told me, it *did* seem like she was waiting for me to tell her she was a genius and give her a good pat on the back. \n\nIt surprised me, because I'm kind of known for being the Goodie Two-Shoes? It doesn't really make sense to tell me of all people. Maybe she's feeling guilty now that she's so close to graduation or something.",
          "author": "natthrow",
          "created": 1616045006,
          "upvotes": 97,
          "replies": {
            "grbyalv": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbyalv/",
              "text": "Self-sabotage tends to be part of imposter syndrome.\n\nWhilst I'm at it, whatever happens, you didn't really do this to her.",
              "author": "Valentine_Villarreal",
              "created": 1616055044,
              "upvotes": 53,
              "replies": {
                "grc4tvb": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc4tvb/",
                  "text": "Is it really imposter syndrome when someone is, in fact, an imposter?",
                  "author": "kemushi_warui",
                  "created": 1616061751,
                  "upvotes": 53,
                  "replies": {
                    "grc51ji": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc51ji/",
                      "text": "Imposters don’t experience imposter syndrome.",
                      "author": "tiensij",
                      "created": 1616061958,
                      "upvotes": 30,
                      "replies": {}
                    },
                    "grc58y1": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc58y1/",
                      "text": "That is indeed a good point.\n\nAt the same time, I don't think imposter syndrome is an issue in a single aspect of someone's life and it could be the imposter syndrome that drove her to plagiarism in the first place.",
                      "author": "Valentine_Villarreal",
                      "created": 1616062161,
                      "upvotes": 14,
                      "replies": {
                        "grfwq97": {
                          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfwq97/",
                          "text": "She has mentioned feeling like she has imposter syndrome... I'm also now remembering some issues she voiced in the past regarding her program too. She was frustrated because she wanted to write genre fiction and her advisor, professor, and classmates all kept telling her to stop. That that wasn't what the program was for.\n\nIf she hadn't been plagiarizing during undergrad too, I would wonder if that's what set her off",
                          "author": "natthrow",
                          "created": 1616123560,
                          "upvotes": 2,
                          "replies": {
                            "grfwr04": {
                              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfwr04/",
                              "text": "when the imposter is sus!",
                              "author": "epic_gamer_4268",
                              "created": 1616123572,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "grcunkz": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcunkz/",
                  "text": "Being an actual imposter is the antithesis of imposter syndrome.",
                  "author": "TakeOffYourMask",
                  "created": 1616074858,
                  "upvotes": 11,
                  "replies": {}
                },
                "grbyb1d": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbyb1d/",
                  "text": "when the imposter is sus!",
                  "author": "epic_gamer_4268",
                  "created": 1616055056,
                  "upvotes": 13,
                  "replies": {}
                }
              }
            },
            "grcksjb": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcksjb/",
              "text": "I believe you should report it. I know you said you didn't have proof, but a person who pays someone to write a thesis won't take the time to read said thesis. All they will have to do is ask her questions about what's in the paper to know its not her work.",
              "author": "ncgunny",
              "created": 1616071216,
              "upvotes": 11,
              "replies": {
                "grfxemb": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfxemb/",
                  "text": "She said she had a process, which was\n\n1: Buy paper/story\n2: Strip out what doesn't sound like her writing style and replace it\n3: Pass the class\n\nFrom how easy others have said it is to detect author's voice, maybe she's learned more than I thought since she's been able to pass it off as her own voice?",
                  "author": "natthrow",
                  "created": 1616123949,
                  "upvotes": 3,
                  "replies": {}
                },
                "grdhyj3": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdhyj3/",
                  "text": "I bet that administrators and professors will be able to find the \"proof\" pretty easily if they start comparing her stories and asking questions. There's also a chance that if someone sold her a story, they sold it to someone else. There's a chance they won't find anything, but there's also a good chance that google could blow this up in a matter of 5-10 minutes.",
                  "author": "SlothRogen",
                  "created": 1616082774,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "grdqsbt": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdqsbt/",
              "text": "If it makes you feel any better, I truly doubt you are the only person she has confided in/bragged to. If you report her anonymously, the suspect pool is probably larger than you think. And I don't think there's anything wrong with flat out denying that you were the one who did.",
              "author": "butidontwannasignup",
              "created": 1616086082,
              "upvotes": 6,
              "replies": {
                "grfxsak": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfxsak/",
                  "text": "... huh. I didn't even consider that she could have lied about not telling anyone else. I just took for granted that she was telling the truth. \n\nThanks for the insight!",
                  "author": "natthrow",
                  "created": 1616124169,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "grdgou4": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdgou4/",
              "text": "Is there any way to find out if she's using a service for this, and maybe get the login and get your hands on the records?  I can't see the administration being able to do much without proof.  I'd hate her to get away with a snap on the wrist.  If the police were involved, may be there could be a fraud charge that would let them search the computer.  I know that sounds a little crazy, but police are there for a reason.",
              "author": "Depressaccount",
              "created": 1616082301,
              "upvotes": 1,
              "replies": {
                "grdyrzs": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdyrzs/",
                  "text": "No. Sorry but this is awful and possibly criminal advice. You do not want to potentially violate the CFAA and Stored Communications Act and probably a myriad of state laws. Not your job to play super-sleuth.\n\nIMO your best options are to alert Academic Affairs of do nothing. I’m sorry you’ve been put in such a miserable situation...",
                  "author": "ilearnthingshard",
                  "created": 1616089507,
                  "upvotes": 5,
                  "replies": {
                    "grdz9u8": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdz9u8/",
                      "text": "I don’t disagree.  That’s why I suggested the police.  The administration isn’t going to be able to do much.",
                      "author": "Depressaccount",
                      "created": 1616089724,
                      "upvotes": -4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "grbghv6": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbghv6/",
      "text": "Report it.  Even if it goes nowhere, you did the right thing",
      "author": "invisible760",
      "created": 1616040221,
      "upvotes": 101,
      "replies": {
        "grclcpl": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grclcpl/",
          "text": "It could come back to hurt OP. Pure speculation but somebody that has paid their way to get through undergrad and a master’s program probably has a wealthy family. I would want to make sure that person’s family isn’t like a wealthy donor to the school or something like that.\n\nNot saying that OP shouldn’t do it, but don’t want to act like there is no chance of consequences either",
          "author": "burtalert",
          "created": 1616071417,
          "upvotes": 33,
          "replies": {
            "grfydyt": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfydyt/",
              "text": "Yipe.\n\nI'm not entirely sure how wealthy her family is, but I am reminded that her dad works in the government of a neighboring county. I should probably Google this and make sure that couldn't come back to bite me if they got angry",
              "author": "natthrow",
              "created": 1616124522,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "grbvlge": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbvlge/",
      "text": "I think you've gotten your opinion, but I would want to mention, since I feel you're being a bit browbeaten here - be aware whom you're asking. Plagiarism is a huge, glaring violation in academia, but if you're not part of academia yourself I find it questionable whether academics have the right to *demand* that *you* adhere to academic ethics. Perhaps there are in fact actual general laws that might apply to you in your country, I dunno, and perhaps your personal conscience does end up telling you to report your friend, but be aware you're not going to get what you might consider a balanced response here.",
      "author": "timtaa2",
      "created": 1616052410,
      "upvotes": 104,
      "replies": {
        "grfziyn": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfziyn/",
          "text": "I really appreciate that nugget of clarity. I figured this was the perfect subreddit for this question, but I didn't anticipate that it could also skew the responses I received as well.\n\nWhile I didn't expect the post to blow up like this, I've been so, so grateful for every post. It's been enlightening in a multitude of ways. I'd like to make a decision by the weekend, so I'll try to post an update by then 💜",
          "author": "natthrow",
          "created": 1616125191,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "grc9piv": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc9piv/",
      "text": "Here’s a thought: to hell with the academic part...is she planning to PUBLISH work that she paid others to write for her? Is she planning to put, in a journal or book, the work of others with her name at the top of it?\n\nIf so, this is bigger than merely teaching etc. This person has to be stopped. Maybe they have already been publishing??",
      "author": "amishius",
      "created": 1616064985,
      "upvotes": 29,
      "replies": {
        "grfzt7t": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfzt7t/",
          "text": "Her advisor and a few professors have tried to get her to submit work to various places to see if she can be published, but she hasn't. One of her courses was structured to prepare to submit for publication, and I remember her saying that she did the work but didn't submit for publication at the end... makes me wonder now if that was because she didn't write the piece for that class 😬",
          "author": "natthrow",
          "created": 1616125364,
          "upvotes": 3,
          "replies": {
            "grg266m": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grg266m/",
              "text": "I think if you're not sure, etc., it's at a point where someone higher than an old friend needs to be the one asking the questions. There's an academic honesty office at the university they are at. DM if I can be of service.",
              "author": "amishius",
              "created": 1616126827,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "grbiij5": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbiij5/",
      "text": "Time to make new friends...",
      "author": "tryatriassic",
      "created": 1616041535,
      "upvotes": 40,
      "replies": {}
    },
    "grbwvox": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbwvox/",
      "text": "If she is actually doing this, I guarantee there are other red flags. Reporting it will allow others in the institution to come forward and validate their concerns. Then it’s out of your hands. Report!",
      "author": "a_sunion",
      "created": 1616053659,
      "upvotes": 39,
      "replies": {}
    },
    "grbgtc6": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbgtc6/",
      "text": "This is a very serious academic integrity violation. In fact, if you do not report, you have committed a violation as well. \n\nThis kind of cheating affects everyone. Your friend cheated herself out of an education. She also skewed the grading in all of her classes, cheating her fellow students out of appropriate grades for their work. And when eventually gets a job she is unqualified for, she will be cheating her future employer AND cheating the university and every graduate by cheapening the reputation of the entire institution.\n\nYou can report it to your Dean, or the Dean of students (if there is one), or the university Provost. Any professor should also be able to tell you who they report violations to.",
      "author": "bigrottentuna",
      "created": 1616040423,
      "upvotes": 90,
      "replies": {
        "grbnvpo": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbnvpo/",
          "text": "Thank you, I appreciate your response. There's a voice in the back of my head that keeps telling me I'm making too big of a deal about all of this, but you outlined the consequences of letting this go and the sheer amount of people it could impact in a way that makes me feel validated in being so shaken by it. The actionable information about who the proper people might be to contact if that's where I end up was very valuable. I haven't exactly had to do anything like this before.\n\nI'd like the opportunity to sleep on this before I make any decisions, but you've given me a lot to ponder.",
          "author": "natthrow",
          "created": 1616045529,
          "upvotes": 47,
          "replies": {}
        },
        "grbjjpx": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbjjpx/",
          "text": "I got the impression from the post that the OP doesn’t attend school with this person, and may herself be out of college. If that is indeed the case, I think she ought not to report this. She’d be going very far out of her way to contact an administrative body with which she has no affiliation. Another poster said to let karma get her; I agree. It just seems very much like not the OP’s place to intervene.",
          "author": "ConsciousReindeer265",
          "created": 1616042239,
          "upvotes": 25,
          "replies": {
            "grbmq8g": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbmq8g/",
              "text": "Your impressions were correct! We went to different schools and I'm no longer in college. It's definitely a factor in my hesitation to get involved. I don't know anyone that I could approach about any of this, and I don't know if the school has a specific standard for these matters. If I did come forward, I imagine I would have to Google the Dean's email or something.\n\nThis is especially difficult because it's not like I have records of the transactions she made to pay her writers or anything. I just have my word, which would be against hers, and I have no prior relationship with the faculty. They have no real reason to believe me.",
              "author": "natthrow",
              "created": 1616044603,
              "upvotes": 43,
              "replies": {
                "grbom2p": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbom2p/",
                  "text": "You don’t know if the school has a specific standard for these matters? I’ll clear that one up: every school everywhere prohibits plagiarism. \n\nIt isn’t your job to prove anything. You can report it and let them deal with it. They will either follow up on it or not, but at that point it is their problem and you will not have to be involved (and they will not have to say that it was reported, just that they had a suspicion).\n\nIf you have integrity, you will take the time to report it. It is a serious matter, as I explained. It harms many people.",
                  "author": "bigrottentuna",
                  "created": 1616046137,
                  "upvotes": 47,
                  "replies": {
                    "grbzmcb": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbzmcb/",
                      "text": "Things are almost never black and white. But this is.",
                      "author": null,
                      "created": 1616056370,
                      "upvotes": 12,
                      "replies": {}
                    },
                    "grg0hau": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grg0hau/",
                      "text": "My apologies for being unclear. I'm aware that every school attempts to police plagiarism, but I meant that I was unsure the procedure for addressing this lunacy. I've been doing a lot of research today, looking into who to contact and that sort of thing.\n\nI needed to be reminded that it isn't my job to find proof. I've been slowed down in making a decision by that line of thinking. I think you're probably right, and that's the school's responsibility, not mine. \n\nThank you again for your input!",
                      "author": "natthrow",
                      "created": 1616125769,
                      "upvotes": 1,
                      "replies": {
                        "grg21p7": {
                          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grg21p7/",
                          "text": "You’re welcome. FYI, I’m the person that investigates faculty research misconduct at my university (which is fortunately rare). I think about these things a lot.",
                          "author": "bigrottentuna",
                          "created": 1616126747,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "grbwi25": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbwi25/",
                  "text": "You could start with an email to the writing center. That she is working at the writing center is pretty crazy, since spotting and helping students understand plagiarism is one of the things a Writing Center often does. She's getting paid to lie to students. You will not be called to testify in court, but you might trigger alarm bells for someone, and they can start watching more closely. It sucks, because of you are really good at deception and know the writing process (and how to fake it) it might be very hard to catch her.",
                  "author": "hawkswingseeker",
                  "created": 1616053285,
                  "upvotes": 11,
                  "replies": {
                    "grcb8jk": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcb8jk/",
                      "text": "Since the OP does not have any relationship to the school I highly doubt any action would be taken. A friend of mine reported a first year in his lab who cheated on the placement exams, and now action was taken despite another student getting kicked out for the same infraction the previous year. \n\nI would expect that any reports coming from an outside source would be looked on with extreme scepticism. \n\nI think the OP doesn't have much to lose from sending an email or making a phone call, but they should be prepared to not be taken seriously.",
                      "author": "sailingpj",
                      "created": 1616065775,
                      "upvotes": 10,
                      "replies": {}
                    }
                  }
                },
                "grexeqe": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grexeqe/",
                  "text": "I used to work in an office alongside the academic integrity officer for our uni and depending on the school you should be able to email them and lodge some kind of \"anonymous\" complaint. What happens after that is up to the uni, they will assess whether the information is enough to warrant an investigation. Perhaps there's been other slightly fishy instances which they've passed over with her and someone coming forward will help give them a foot in the door to understanding what's going on. Contract cheating is a huge thing, it's been growing over the last 10 years and every uni is (or should be) aware of it and how to identify it. \n\nThe academic integrity advisor I worked alongside would work with a small group of people to assess each complaint and was trained to read through work and pick up inconsistencies and evidence of potential cheating. Often confronting the students with this is how they solidify their ideas, because the student's reactions are usually very telling. Depends on their attitude - she seems smug and proud of herself - but often when confronted by an authority they usually either admit they did it or its obvious they haven't.",
                  "author": "Ysuran9211",
                  "created": 1616105287,
                  "upvotes": 1,
                  "replies": {
                    "grg2ngt": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grg2ngt/",
                      "text": "Much obliged! Your experience helped with my search into what proper channels I might tap into, as well as thinking through some of the intricacies of this. I'm not really sure how she'd come off if she's confronted by faculty though. She was in theatre programs twice before this. Her ability to improvise and land on her feet is ridiculously good",
                      "author": "natthrow",
                      "created": 1616127134,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "grem8ho": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grem8ho/",
      "text": "No proof? Forget about it. Don't stick your neck out to bring someone down with no gain for yourself. I don't see how you benefit.",
      "author": "onepageone",
      "created": 1616100149,
      "upvotes": 6,
      "replies": {
        "grg350m": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grg350m/",
          "text": "I don't really feel like I need to benefit, or bring her down. My goal here is kind of trying to decrease the amount of world suck. The sticking point is kind of that I'm not certain any action I'd take would actually accomplish that",
          "author": "natthrow",
          "created": 1616127449,
          "upvotes": 1,
          "replies": {
            "grjb46k": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grjb46k/",
              "text": "> My goal here is kind of trying to decrease the amount of world suck\n\nI would rather try other avenues than reporting this person. \n\nI know that what she did is wrong, but I have a bad feeling about this. Reporting someone without proof... you may just get yourself in an huge, unpleasant mess. Let it go. She will pay for her choices down the road.",
              "author": "specific_account_",
              "created": 1616196063,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "grcfaks": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcfaks/",
      "text": "Even if you don’t report her, remember that she plagiarized a masters in creative writing! At whatever job she has next where she will actually have to write something she will completely fail at it if she hasn’t actually been practicing those skills for the past 5 years.",
      "author": "pumpkinator21",
      "created": 1616068820,
      "upvotes": 10,
      "replies": {}
    },
    "grchdkc": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grchdkc/",
      "text": "Johaness Kreidler, a composer, paid composers in low-wage countries to write a work he was comissioned to write. he admitted that and the outsourcing was part of the whole work. [https://www.youtube.com/watch?v=L72d\\_0zIT0c](https://www.youtube.com/watch?v=L72d_0zIT0c)  \n\n\nIn the case of your friend, it is clearly not the case that it is part of a conceptual portfolio. This is straight up fraud. Not only does it put the University in a bad spotlight, what is she going to do after the MFA? As somebody else writes, probably she has rich parents and will land a cushion job. In that case I would be even more inclined to report her: she abused her privilege and took away opportunities from other people.",
      "author": "frugalacademic",
      "created": 1616069922,
      "upvotes": 9,
      "replies": {}
    },
    "grbwumi": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbwumi/",
      "text": "Report her.  This is a major violation of academic integrity.  \n\nDepending on the University, this may be handled by an \"office of student conduct\" or whatever the equivalent is at your university.  If this is the case, they will be able protect your identity.  What will happen is that you will tell them what you know, they will investigate, and will only act if they find that the individual is \"responsible\" for a breach of academic integrity.  It should be noted that \"responsible\" is an intentionally different designation than \"guilty.\"  This is because universities have their own \"standard of evidence\" which means that \"proof\" in a legal sense is not actually required for someone to be found \"responsible.\"\n\nYou should be able to report this either through some kind of online form or actually going to speak to someone in this office (assuming it exists).  In other words, you **DO NOT** need to go directly to the student's advisor, chair, dean, etc. and instead log the concern with the office actually exists to handle these kinds of issues.  This is in place to ensure you have a degree of anonymity (i.e. so that no one in your department knows that you reported) while also protecting your friend (i.e. the department doesn't start to think they did something wrong unless the office finds enough proof to meet their \"standard of evidence\").",
      "author": "PhysicsIsPants",
      "created": 1616053630,
      "upvotes": 10,
      "replies": {}
    },
    "grcer1w": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcer1w/",
      "text": "[deleted]",
      "author": null,
      "created": 1616068441,
      "upvotes": 17,
      "replies": {
        "grcuvdq": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcuvdq/",
          "text": "Yes I agree with this. If she is truly your friend and you care about your friendship, then challenge her and hold her accountable. That’s what friends do. They hold interventions instead of calling the police. Going behind her back to report her suggests she’s not actually your friend.",
          "author": "cudlmnstr",
          "created": 1616074936,
          "upvotes": 12,
          "replies": {
            "gre7yiq": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre7yiq/",
              "text": "Interventions are for addictions. Criminal behavior still gets reported to the police. \n\nPeople like you are what allows criminals and liars to get by in life. You won't do the right thing because you're afraid of making someone sad. Are your morals really that cheap?",
              "author": "Greenmantle22",
              "created": 1616093523,
              "upvotes": 1,
              "replies": {
                "greek4w": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greek4w/",
                  "text": "I’m afraid it’s not that simple, friend. There is a lot more at stake here than “making someone sad.” \n\nTruly, oversimplification of complex issues is the bane of human society. 🤷‍♀️",
                  "author": "cudlmnstr",
                  "created": 1616096543,
                  "upvotes": 1,
                  "replies": {
                    "greg83a": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greg83a/",
                      "text": "What's at stake is OP's academic integrity. It's already clear their friend has none of that to begin with, but OP still has to decide if they're an honest person on their own. \n\nCheating one's way through higher education, and leaning on emotional bullshit to skate past punishment \"because friends don't snitch\" - now THAT is a bane of human society.",
                      "author": "Greenmantle22",
                      "created": 1616097358,
                      "upvotes": 2,
                      "replies": {
                        "grerrof": {
                          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grerrof/",
                          "text": "Hmm. “Friends don’t snitch” is a misinterpretation of my comment. \n\nI do think it would be a dif situation if OP was a student in the friend’s program or even at their school. However, the way I see it (as a student and instructor and also a writer myself), as of right now, the friend is only hurting herself with her cheating. \n\nThere are two ways to (potentially) prevent the friend from affecting others down the road: confront her or turn her in. Turning her in would lead to significant consequences for both parties, as the poster above has outlined. Confronting her allows her an opportunity to change, which we could all probably use at some point in our lives. It’s a more empathetic approach and still gets the job done (if the friend is not receptive, well then, that’s a different issue altogether). \n\nI’m not suggesting helping her hide a body. Just showing a little empathy and giving a person a chance to change.",
                          "author": "cudlmnstr",
                          "created": 1616102673,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "grevi3d": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grevi3d/",
                  "text": "Someone who would rat out a friend lecturing others on morals.",
                  "author": "icecreamlegend",
                  "created": 1616104406,
                  "upvotes": -1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gre822w": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre822w/",
          "text": "Will you please be my friend, so I can go on a crime spree and have you look the other way? \n\nIn fact, what are you doing Saturday? Wanna be my getaway driver? What are friends for?!?!",
          "author": "Greenmantle22",
          "created": 1616093567,
          "upvotes": 1,
          "replies": {
            "greskqz": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greskqz/",
              "text": "I will happily be your friend if I get to drive the car 😜",
              "author": "cudlmnstr",
              "created": 1616103044,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "grbqvzq": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbqvzq/",
      "text": "Yes, you should report it. Plagiarism is probably the biggest sin in academia. They’re not going to brush you off if you report this.",
      "author": "AskMyAnxiety",
      "created": 1616048076,
      "upvotes": 7,
      "replies": {}
    },
    "grbipqw": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbipqw/",
      "text": "Let karma get them.  But do drop that friendship.",
      "author": "apl2291",
      "created": 1616041669,
      "upvotes": 12,
      "replies": {}
    },
    "grcez5l": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcez5l/",
      "text": "If she’s going to cheat her way into a career, she’s going to cheat in every aspect of life. You should do what is right, and consider her and others who support her behavior not a friend. You don’t want to be associated with people like this.",
      "author": "987654321anonymous",
      "created": 1616068600,
      "upvotes": 7,
      "replies": {}
    },
    "grdcobw": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdcobw/",
      "text": "Considering the subreddit we're on I don't expect what i'm about to say will fly, but I don't think you should say anything. She's fucked anyway, what good is a creative writing degree if you can't write?",
      "author": "7eas",
      "created": 1616081074,
      "upvotes": 4,
      "replies": {}
    },
    "grdc1iy": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdc1iy/",
      "text": "When I was a masters student, my friend told ne she is paying someone to write her masters dissertation. At the time I wasn't sure if I would do a PhD and become an academic. It still felt unethical but I felt bad for her, also didn't think anyone would believe me either. It is custom written so things like Turnitin can't detect it and if you accuse them and they say deny it, how will the professor test it, given that they have shit ton of other things to grade?\nIn my example, I didn't say anything. Her paid dissertation was shit so she had to sit down and write it herself. She failed, was given extra time. Not sure what happened after.",
      "author": "sollinatri",
      "created": 1616080870,
      "upvotes": 2,
      "replies": {}
    },
    "gre7hh9": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre7hh9/",
      "text": "\"Outsourced?\" This isn't a shoe factory or a spouse's exotic kink. It's graded school work.\n\nShe didn't outsource squat. She's a dirty cheater, plain and simple. Tell the world.",
      "author": "Greenmantle22",
      "created": 1616093318,
      "upvotes": 2,
      "replies": {}
    },
    "grec2ah": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grec2ah/",
      "text": "Ok so I see a lot of “report her” but not much how (forgive me if I missed it, I’m on mobile).\n\nI think the best thing you can do is talk with her advisor/thesis supervisor/committee (I’m in science/not sure how arts works). You could theoretically do it anonymously by leaving a typed note under their door or faculty mailbox. Be honest in that you have no proof and you don’t want to ruin her life, but you would be remiss if you did not speak up about what this person is claiming behind closed doors. The person who said there may be other red flags is right - even if you don’t have the proof, this starts the inquiry. She could be just really awkward and said that to sound...I dunno...imposter syndromy? But it sounds like it’s legit. \n\nIf you want a frame of reference for my advice: I teach an intensive high school STEM program that preps students to go into labs their first year of college. We have a written code of ethics  contract and plagiarism is number one. Violations are typically two strikes you’re out, but it depends on the assignment plagiarized.",
      "author": "Takeurvitamins",
      "created": 1616095335,
      "upvotes": 2,
      "replies": {
        "grec3be": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grec3be/",
          "text": "when the imposter is sus!",
          "author": "epic_gamer_4268",
          "created": 1616095349,
          "upvotes": 0,
          "replies": {
            "grf1m96": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grf1m96/",
              "text": "Haha yup",
              "author": "Takeurvitamins",
              "created": 1616107312,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "grejoym": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grejoym/",
      "text": "Honestly, this is hard for me to answer.\n\nOn the one hand, I always say that not even karma has to lift a finger, because people always do themselves in by the very actions that sting you.\n\nTake for example I had an ex-colleague that for whatever reason started power tripping and smearing my reputation(silly drama because I didn't give him my chair when I was starting work?), but after a year and a half he was on speaking terms with no one and they all avoided him like the plague. No one wanted to be near him, professionally, relationship-wise, or any other way. \n\n*Sometimes you gotta let them bury themselves.*\n\nOn the other hand what she is doing is not a degree. People who have degrees are because they earned them. So....if she is mad at you reporting because of HER wrongdoing then that is HER problem. She isn't outsmarting herself by taking unethical shortcuts, she is dumbing herself down excusing herself from hardwork and it will also impact whoever she ends up working with. Whether it be fellow colleagues or students, someone is going to take the brunt of her shitty work ethic. Unfortunately those people find wiggle room in areas of life.\n\n&#x200B;\n\nWhatever you decide, just make sure you are firm in your certainty. There are pros and cons to both. I'm sorry you even have to make this decision.",
      "author": "excelnotfionado",
      "created": 1616099034,
      "upvotes": 2,
      "replies": {}
    },
    "grer5hy": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grer5hy/",
      "text": "Of course, it is always possible that she is writing a story and you are the main character: “The Ethical Decisions of Emily”.  Kind of reminds me of the movie: A murder of Crows: https://m.imdb.com/title/tt0133985/\n\nThough I do not think it is wrong to report her, I also do not think an anonymous letter under a door would do much.  My University once got an anonymous letter detailing all of the moral failings of a new adjunct a month before he started working. I was asked to talk to the guy “lightly”, but the anonymity of the letter and the fact it was sent before he started working led to the question who could have sent it. Since the person who did  knew he was going to start this new job, it had to be some one in his inner circle, possibly with a personal reason to fuck up his career. \n\nIf you knew who her main advisor was, I would probably try to contact that person directly. And if I didn’t know, I probably would not try to become a detective to find out. Anonymity and email make it easy to throw out baseless charges. \n\nWhatever you do, a true friend would never put you in this moral quandary. You will be better off without her in your life. \n\nGood luck!",
      "author": "emergent4now",
      "created": 1616102382,
      "upvotes": 2,
      "replies": {}
    },
    "grexmfw": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grexmfw/",
      "text": "Wow, people came out to comment with their pitchforks ready to go. \n\nThis whole situation is based on a private conversation and there is no evidence aside from OPs word. The person bragging could have been over exaggerating to seem like a bad ass, but who knows from the limited information OP and everyone else has. OP also mentioned that they’re not affiliated with the university or program in any way. If an outside individual contacted my department with no evidence it would be considered a rumor or attempt to get back at someone. \n\nIt’s a weird situation, but there’s no actual evidence of plagiarism to report with the information you have. If you could reference a piece of her work that you know she didn’t create it would make sense to report, but this doesn’t make much sense as it stands now. People acting like all of academic integrity is doomed if you don’t report are over dramatizing the situation. If she isn’t doing her own work her advisors will notice inconsistencies throughout her portfolio, and she will be incapable of meeting professional expectations set for her",
      "author": "quenual",
      "created": 1616105390,
      "upvotes": 2,
      "replies": {
        "grf5ev5": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grf5ev5/",
          "text": "I thought this as well.",
          "author": "emergent4now",
          "created": 1616109177,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grf8e1j": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grf8e1j/",
      "text": "Plagiarism is a serious offense and she can be expelled. Most colleges and universities allow anonymous tips. However, if you decide to report the issue, you need to make sure you contact her/his Supervising Professor. Earning an advanced degree is supposed to be challenging but at the same time it should be an experience to enjoy because this is your area of specialization. You should want to grow as a scholar not cheat your way through it.",
      "author": "FKF1918",
      "created": 1616110646,
      "upvotes": 2,
      "replies": {}
    },
    "grbi8m1": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbi8m1/",
      "text": "Report this disgusting and sad behavior!",
      "author": "Dungbeetlescientist",
      "created": 1616041350,
      "upvotes": 9,
      "replies": {}
    },
    "grbroof": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbroof/",
      "text": "I think as an academic, we each have a responsibility to make sure that the work being contributed to our respective fields is honest and truthful. \nWith that being said, your friend is committing a disservice and a mockery of all the honest hard work and contributions other academic have made to the same field. It hurts so many people. She does not deserve to graduate.\nReport her, there’s got to be some way to hold her accountable with proof. Make the report please",
      "author": "MdmMargaux",
      "created": 1616048774,
      "upvotes": 4,
      "replies": {}
    },
    "grbvk3t": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbvk3t/",
      "text": "This should be reported. You can send an anonymous letter to the HoD other department/ Dean of the course.",
      "author": "Ron_Because_Why_Not",
      "created": 1616052375,
      "upvotes": 5,
      "replies": {}
    },
    "grbyl2h": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbyl2h/",
      "text": "Gather more proof first. Then report her anonymously if possible.",
      "author": null,
      "created": 1616055329,
      "upvotes": 4,
      "replies": {}
    },
    "grcenmf": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcenmf/",
      "text": "If she brags about it, there is a high possibility that it comes out. What do people do when they are caught? They usually blame everyone else. What if she (irrationally) claims that everybody does this? What happens if she says everyone *knows* she did it, and start naming people? I wouldn't rule out that you can be in trouble or at least be suspected for something yourself if you don't speak up.\n\nReport away.",
      "author": "molobodd",
      "created": 1616068374,
      "upvotes": 3,
      "replies": {}
    },
    "grcvbe7": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcvbe7/",
      "text": "This makes me really angry considering how much hard work I put into my education. When numerous people do this it makes degrees meaningless. She’s abhorrent and I would absolutely report. You don’t need friends like that.",
      "author": "Serenava",
      "created": 1616075094,
      "upvotes": 2,
      "replies": {}
    },
    "grcef0i": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcef0i/",
      "text": "Well now your friend just involved you, because in most honor codes and for the NIH, if you are aware of a problem and you don't say anything you are part of the violation.",
      "author": "PersephoneIsNotHome",
      "created": 1616068204,
      "upvotes": 3,
      "replies": {
        "gre8jcj": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre8jcj/",
          "text": "I'm reminded of SNL's skit about Ivanka Trump's new fragrance for women working in that White House: \"Complicit.\"",
          "author": "Greenmantle22",
          "created": 1616093775,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grbtc55": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbtc55/",
      "text": "Report her. As another said, she’s cheating herself, her school, her fellow students, and her future employers. \n\nI seldom received the best grades as a student but I’ll be damned if I didn’t earn them.",
      "author": "KXLY",
      "created": 1616050280,
      "upvotes": 4,
      "replies": {}
    },
    "grbvp5c": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbvp5c/",
      "text": "Keeping quiet about a crime is wrong. Report this.\n\nI have seen these websites where you pay people to write your paper for you so I guess there is a market there....I wonder how many people actually do this? I personally could never do it as I would feel super guilty but I know a lot of people have zero scruples.",
      "author": "Whtzmyname",
      "created": 1616052507,
      "upvotes": 3,
      "replies": {}
    },
    "grc2acn": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc2acn/",
      "text": "[removed]",
      "author": null,
      "created": 1616059159,
      "upvotes": 6,
      "replies": {
        "grd2fdx": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd2fdx/",
          "text": "How much did it cost you to fake your masters? Was it uncomfortable being the only person too stupid to do the work themselves that you knew? \n\nThose aren’t very nice things to say to you, are they? And that is so precisely because of how bad this behaviour is. If you’re this ok with what’s basically research misconduct, I feel very bad for your coauthors and trainees.",
          "author": "sunlitlake",
          "created": 1616077569,
          "upvotes": 0,
          "replies": {
            "grd7lp3": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd7lp3/",
              "text": "The laziness and dishonesty that is required to fake a masters is abhorrent. But I also have a personal morality that prevents me from being a tattletale. I think everyone agrees that what this person did was unethical, but I personally don't snitch unless it's to prevent harm.",
              "author": "goatsandhoes101115",
              "created": 1616079391,
              "upvotes": 2,
              "replies": {
                "grdmvgn": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdmvgn/",
                  "text": "Why aren’t her students harmed by her behaviour? Why isn’t the struggling young writer who didn’t get into an MFA program harmed by her behaviour? Why isn’t her institution and all its graduates harmed by vouching publicly for her credentials every time someone reads her CV? \n\nWe’re all very impressed that you aren’t a tattletale, though. Very very hardcore.",
                  "author": "sunlitlake",
                  "created": 1616084584,
                  "upvotes": 1,
                  "replies": {
                    "grh31qp": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grh31qp/",
                      "text": "Your opinion is valid, I'm not saying my philosophy is the only right way to conduct ourselves. I've just been overwhelmed with the witch-hunting in this sub recently.",
                      "author": "goatsandhoes101115",
                      "created": 1616157990,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "grcganf": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcganf/",
      "text": "I would do nothing before having a conversation with her to explain my point.",
      "author": "dzn_m",
      "created": 1616069470,
      "upvotes": 2,
      "replies": {}
    },
    "grcryef": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcryef/",
      "text": "Yes, you report it. Are you in the same program?",
      "author": "TakeOffYourMask",
      "created": 1616073879,
      "upvotes": 2,
      "replies": {}
    },
    "grd5hvz": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd5hvz/",
      "text": "Don't put this on your own conscience, but do dump this \"friend.\" She has put you in a morally compromising position by revealing this to you, and she sounds like the kind of person who would quite likely lie to you one day.\nI wouldn't report her though. If you do and she's found out,  it will ruin her life, at least this stretch of it. I'd step back from the friendship and let life's own consequences take their natural toll on her. She knows she's a fraud and she'll have to live with that guilt everyday. In other words, she'll get hers.",
      "author": "HappyCamper2121",
      "created": 1616078712,
      "upvotes": 2,
      "replies": {}
    },
    "grdcocp": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdcocp/",
      "text": "Mind your own business, not like she’s becoming a doctor",
      "author": "EhopHIVE666",
      "created": 1616081074,
      "upvotes": 2,
      "replies": {}
    },
    "grdqkgv": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdqkgv/",
      "text": "> Who knows what people are going through\n\nThat goes some way to explaining unethical behaviour, but it doesn't justify continuing to reap the rewards. There are other people going through stuff that don't cheat. Why should we reward the cheaters?\n\nI personally could not maintain a friendship with such a person, so being in the \"line of fire\" would not bother me. However, I can understand that it might cause a lot of turmoil in your support network. So perhaps you could ask your friends what they think of the situation. Also if you do decide to report it, you could tell her first, give her a chance to come clean. That might also give her a chance to cover some tracks though (I can't think what tracks there could be, but maybe).\n\nYou might not have evidence but I bet companies who provide these services are recycling their material. Maybe cross checking by the right people will catch her out. You could ask her a bit about it, if you want to be sneaky you could claim you or a relative are thinking about doing the same. Do you at least have a written confession? I would have thought these private conversations are taking place via text/IM but maybe I'm wrong.",
      "author": "l_lecrup",
      "created": 1616085988,
      "upvotes": 2,
      "replies": {}
    },
    "grduut5": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grduut5/",
      "text": "If you had a serious secret like this, would you want her to keep quiet? Do not make an argument based on the assumption that you'd never do something like this either, because you would. Desperation is universal. Please keep in mind that the people here tend to give advice much more moral than they'd actually apply to a situation like this because there is a disconnect. They will give advice that \"sounds right\" but not what they would actually chose irl.",
      "author": "StrayBlondeGirl",
      "created": 1616087819,
      "upvotes": 2,
      "replies": {
        "gre8euo": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre8euo/",
          "text": "It's not a harmless little personal secret. It's an admission of academic misconduct, deception, and bribery. Her friend cheated her way through something everyone else worked hard to earn, and her degree is meaningless. \n\nIf OP knows about this level of dishonesty and does nothing, then it's on their conscience for letting a liar take advantage of people and effectively steal something she did not earn. \n\nI've known cheaters, and I've reported cheaters. As a working academic, my first duty is to the truth, not my friends' feelings.",
          "author": "Greenmantle22",
          "created": 1616093721,
          "upvotes": 5,
          "replies": {
            "greu1od": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greu1od/",
              "text": "The fifth and sixth word in my comment was \"serious secret.\" I fully understand the gravity of what her friend has done. I find it morally wrongful (although I know for a fact that major cheating goes on in all levels of academia). All of us, every single one, will have a serious secret at some point in our lives. Would you want your friend to tell yours? It's not murder or rape or pedophilia. There is no going to jail. There is no going back to help the people who got screwed. Both people, the friend and the OP will be hurt by this. One will have her life ruined. The other will have all trust dissolved. Her other friends and family will know that she CANNOT be trusted with major secrets. What will be accomplished by reporting it? The cheater will probably go on to either fail completely or have a lackluster career anyways.",
              "author": "StrayBlondeGirl",
              "created": 1616103725,
              "upvotes": 1,
              "replies": {
                "greyeq4": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greyeq4/",
                  "text": "Your life isn’t ruined if you don’t have a masters degree. Think of the person whose spot she took in the program. Was their life “ruined?” If so, does any of your endless sympathy extend to them? \n\nAs far as “trusted with major secrets,” I obviously don’t know what lowlifes you’ve chosen to chain yourself to, but I would personally lose a lot of respect abs trust from my friends if they knew I was complicit. Doing the right thing in this case will not be pleasurable, but that is the cheater’s fault, not OP’s. Even TV gangsters have the decency not to confess to their family members and put them in this situation.",
                  "author": "sunlitlake",
                  "created": 1616105762,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "grdvb16": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdvb16/",
      "text": "Look up the school's website, and look for a place to report potential plagiarism. If you talk to someone in the school to make them be the \"bad guys\" (totally not- but in the case, the student will think so) to do the leg work proving the claim.\n\nAs someone finishing draft 1 of my thesis paper, I would love to know that all my peers are doing their own work like I am, because it is a lot of work and time and tears and brilliant ideas followed by feelings of doubt. Plagiarism is a huge problem and needs to be identified by the school. It is not your job to prove it, but to let the school know there should be inquires made, that is fair and reasonable.\n\nFurther, OP, I agree with other replies made here that if this blows up your friend circle, you don't need them in your life. Trustworthy friends are better!\n\nBEST LUCK, and good for you for both having the conscience and taking the time to verify various consequences of your own actions, as that is all you have control over in this instance.",
      "author": "Happy-birdie-918",
      "created": 1616088014,
      "upvotes": 2,
      "replies": {}
    },
    "grdxw8u": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdxw8u/",
      "text": "As a current MFA holder and university faculty, I believe that you have a moral duty to report her so that an investigation can be conducted, and also that reporting her will be a net positive.\n\nPeople tend to be averse to reporting on others, but dishonesty at this level needs to be reported.",
      "author": null,
      "created": 1616089132,
      "upvotes": 2,
      "replies": {}
    },
    "grc6058": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc6058/",
      "text": "Is an MFA thesis different than other disciplines? In my discipline, we can hire undergrads as research assistants to help with our thesis work. I hired 7 to collect my data. I paid a few with academic credit even, with assistance from my professor. \n\nA grad student hired undergrads to help with her thesis. That's pretty legit to me.",
      "author": "Individual-Schemes",
      "created": 1616062874,
      "upvotes": 1,
      "replies": {
        "grc8wlg": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc8wlg/",
          "text": "Think of this in a similar way to authorship credit.  Typically, authorship is given for intellectual contribution.  Technical work such as data collection, lab bench analysis, or archive searches are not really intellectual, they only require technical skills.  If you were writing a journal article, these technicians would be in the acknowledgement section, not the author list.\n\nA thesis is a solo author project.  There is an expectation that you are doing the intellectual heavy lifting (of course with help from your advisor because you are still a trainee).  So having undergrads help with data collection or other \"technical\" work is perfectly fine.  Having an undergrad run your analysis, write a section of your thesis, or other \"intellectual\" work is not fine.",
          "author": "manova",
          "created": 1616064589,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "grcm2q3": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcm2q3/",
      "text": "Jesus fuck, why get the degree at all, in creative writing no less. It's not like having an MFA will confer some sort of pecuniary benefit beyond what you yourself accomplish/can do as an artist by the time you finish... Stupidity all around.\n\nThat said, unpopular opinion, but I wouldn't get involved. Not your monkeys.",
      "author": "thegreenaquarium",
      "created": 1616071679,
      "upvotes": 3,
      "replies": {}
    },
    "grduyp2": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grduyp2/",
      "text": "Where I did my undergrad the rule was reciprocal responsibility. That meant if you cheat, and I know, and I don't report you, I'm no better than you are. In fact, if you cheated, and I knew, it was my responsibility to tell you, to your face, that I know you cheated, and you have 24 hours to report yourself to the judicial committee or I will.\n\nIn my first year I had to report a senior. It was the hardest thing I had to do in my life up to that point. But not doing it would have been worse.\n\nYou have a responsibility to yourself, to the other people who didn't get in, and to your friend. She knows what she is doing is wrong, and if she's any kind of human, it has to be eating her alive. I know how much I suffer from imposter syndrome in my grad program, imagine feeling like you have to pay someone else to do your work..",
      "author": "Lady-Jenna",
      "created": 1616087866,
      "upvotes": 3,
      "replies": {
        "grduzuv": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grduzuv/",
          "text": "when the imposter is sus!",
          "author": "epic_gamer_4268",
          "created": 1616087880,
          "upvotes": -3,
          "replies": {}
        }
      }
    },
    "gre1b7k": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre1b7k/",
      "text": "You must report it. The MFA program needs to be aware that it has been scammed to ensure this doesn’t happen in the future. If the allegations are proven true once the friend has her MFA, then the credibility of the program, and by extension, the degree-granting institution, is at a huge risk.",
      "author": "bill_klondike",
      "created": 1616090589,
      "upvotes": 1,
      "replies": {}
    },
    "grd1ng2": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd1ng2/",
      "text": "Mind your own bis",
      "author": "Parking_Judgment_315",
      "created": 1616077312,
      "upvotes": -1,
      "replies": {}
    },
    "grbf9oi": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbf9oi/",
      "text": "Maybe try to talk to her first to kind of convince yourself that youve done everything else you can so you dont feel guilty about reporting her. She probably wont change so its your last resort.",
      "author": "levisbrokenteacup",
      "created": 1616039451,
      "upvotes": -5,
      "replies": {}
    },
    "grbos5r": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbos5r/",
      "text": "I wouldn’t. You are their friend, if you really have an issue with it go outside of the bounds of official sanctions and talk to them like a person. Sounds to me like your friend is very smug, self-centered, and possibly spoiled, but that doesn’t mean they should lose everything, right? \n\nYou should understand that by reporting them you will be drastically altering the course of their life. What they did was incredibly wrong and incredibly bad, no doubt, but you really really need to think about how willing you are to take the course of somebody’s life in your hands. \n\nWill you talk to them as a friend and try to get them to realize their mistakes or will you defer somebody’s life course to a more structured power? This may alter her life forever and you don’t in fact have any proof. \n\nYou’re just that, a friend. Not a cop, not an administrator. It doesn’t even sound like you’re in the same program as her right? Is your goal for her to change as a person or for her to be punished for her misdeeds? You have the power to do both here, but I think number one is a whole lot better.",
      "author": null,
      "created": 1616046277,
      "upvotes": -17,
      "replies": {
        "grbyks9": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbyks9/",
          "text": "If this is in fact true, this woman's career is a lie. As someone who has gone through the turbulence and trials of writing my own thesis, this is a slap in the face to any and all people who truly work their ass off. A.woman who outsources their career is not someone who is going to \" be talked into reason.\" As you said, their whole life is at stake. Do you really think now, she's going to come around? That's cute... It's also cute you think she shouldn't be punished for what she did. She most certainly should be punished because she never actually worked in the first place. When you graduate, you are expected to have certain skills and experiences that lend you to your next job. She doesn't have those. This would be a continuing disadvantage for anyone who hired her. This cycle has to end and she should be reported.",
          "author": "noschoolspirit",
          "created": 1616055321,
          "upvotes": 4,
          "replies": {
            "gre1hm5": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre1hm5/",
              "text": "> a disadvantage to anyone who hires her\n\nSounds like your sympathies lie with people who own companies and not with working people, I think that’s “cute” as well. No, fuck me I guess for thinking that somebody who does bad things doesn’t deserve to have their life ruined forever 🤷‍♂️ I’d never think of cheating and never once have, but I think the fetish of punishment is a little bit psychotic hm? If that’s OP’s prerogative then do it, report it, whatever, but for the love of god talk to your friend like a human being about it before you do.",
              "author": null,
              "created": 1616090667,
              "upvotes": 0,
              "replies": {
                "gre2rgt": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre2rgt/",
                  "text": "You have blown the punishment way out of proportion and took this to a level that it did not need to go. There are rules and consequences that govern this sort of thing and in this case, are there for a reason.  If you pay someone else to do the work you get credit for, you should be punished according to what has been well established. You have delivered a lie and claimed skills and experience you do not have. This goes beyond a simple moment and displaces people undeservingly who may be better equipped and capable.  And the punishment that she was very well aware of (everyone is told this, more times than once), is to remove the credentials she does not deserve. Maybe the punishment should not be she can't continue to go to that school, but she can apply to another program and actually do the work and get the credit. But, what you fail to realize, is that the end game is the same whether OP talks to her or not. If OP talks, and she listens, she has to admit what she did. The punishment will commence. If he doesn't, the school will investigate and the punishment will commence. In the end, it needs to be taken care of. True, she should be given an opportunity to defend herself, and maybe OP should inform her what they are doing, but should go ahead and report it if she doesn't. The world is bigger than her and her actions have consequences well outside her little sphere. She made decisions and those decisions should be handled accordingly.",
                  "author": "noschoolspirit",
                  "created": 1616091240,
                  "upvotes": 1,
                  "replies": {
                    "gre3sg3": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre3sg3/",
                      "text": "You’re definitely underselling what the punishment mighty be. If she stands to lose a bachelors and masters? That’s thousands of dollars. Its psycho shit to be like “yeah you deserve that” lmao. I hope none of y’all did your thesis on restorative justice or critical theory or anything 😂. I think she’ll fail on her own eventually anyways if this is the attitude with which she approaches life. Let her.",
                      "author": null,
                      "created": 1616091699,
                      "upvotes": 0,
                      "replies": {
                        "gre96qs": {
                          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre96qs/",
                          "text": "She can't lose her Bachelors if they can't prove she didn't do anything wrong. She can only lose a masters, and deservedly so. You have made a mountain out of a mole hill. This is far different than social justice that is way more complex with much more layered feedback mechanisms that are harder to control. Don't conflate the two. This is a clear cut case of academic dishonesty - right and wrong. These types of situations are pretty straightforward. She knew the consequences which were laid out bare. They are not ones that are argued by anybody. People fight hard to get what was handed to her - I would argue this kicks out the teeth of those who worked and suffered to get to where they are. She won't go poor, she just won't get the degree she doesn't deserve. How is that unfair? Her life will be shitter for a while, but things could be far worse.",
                          "author": "noschoolspirit",
                          "created": 1616094054,
                          "upvotes": 1,
                          "replies": {
                            "grelk02": {
                              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grelk02/",
                              "text": "Losing a masters and potentially bachelors that you’ve already paid for and possibly went into debt for combined with the fact that you won’t be able to use those degrees in a job search now? But she definitely won’t “go poor”? Are you fucking kidding me? What country are you from? Did somebody else pay for your school? Piss poor analysis used to justify your vengeance boner.",
                              "author": null,
                              "created": 1616099844,
                              "upvotes": 1,
                              "replies": {
                                "greq25c": {
                                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greq25c/",
                                  "text": "Wow. Naivete at a bad level. Look, you are right. She will go poor because I forgot she screwed her Bachelor's too. I assumed it was just the masters when I wrote that. But all the same, she should have thought of that. \n\nAs a Professor, I see this shit more often than I should. It has farther repercussions than you clearly realize. When you put kids out into the work force, or worse, academics, and they can't do what is expected, it reflects poorly on the department and the advisor. If my students were hired by a consulting firm and couldn't do their job, I would develop a reputation. And as someone who would also receive funding from some of the same places my students may get hired, that could be negatively impacted too. This is a cycle that affects more than just one person. \n\nClearly you are not within the higher Ed game and don't understand the pervasiveness or severity of this type of situation. Again, this is bigger than them. I'm happy you want to be the empathetic soldier; to be honest I'm incredibly liberal (see my post history) and would probably agree with you on a lot of issues. But not this. This is a serious, all too common problem which is why academic departments take it so seriously. It has serious back consequences that can haunt departments, advisors and even institutions.",
                                  "author": "noschoolspirit",
                                  "created": 1616101873,
                                  "upvotes": 1,
                                  "replies": {
                                    "grfm4on": {
                                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfm4on/",
                                      "text": "Look, I never said it wasn’t a bad issue, I’m just not in the ruining lives game. It’s different if you’re a professor and you catch a student cheating, but if your friend drunkenly divulges something like that? Fucking christ, OPs not a cop lmao! \n\nNo, i don’t think we would agree on very much. I don’t care how “incredibly liberal” you are and if you want to hide behind the aesthetics of having “the good politics” whatever that means in this howling void of a country, When you say shit like: \n\n “But all the same, she should have thought of that”\n\nAre you fucking kidding me? Come on, listen to yourself. It sounds psychotic. Just be a normal person and talk to your friend about what they’re doing wrong in a normal way. Goddamn, everything has to be routed through the official channels so that you can be properly punished for cheating by being doomed to work retail forever. Wild shit.",
                                      "author": null,
                                      "created": 1616117719,
                                      "upvotes": 0,
                                      "replies": {
                                        "grfobsz": {
                                          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfobsz/",
                                          "text": "Oh please. Get off your high horse. I admit, though I feel like my approach is more pragmatic and justifiable based on more experience and understanding of the severity of the consequences of such actions, my position can be construed as a bit elitist, to be sure. But no more than your feigned social warrior routine that is myopically focused. \n\nI was simply trying to find common ground to start from. Apologies that *shockingly* backfired over the internet. You sound impossible, naively stubborn and whiny. You appear to pass sweeping judgement about psychopathy while having zero experience in this and whining about my sweeping judgement of a more clear cut issue. You talk about caring about ruining someone's life and yet seem perfectly fine to overlook a serious ethics issue that actually causes more problems. You keep repetitively saying shit like \"are you fucking kidding me??!\" Like it means anything or propels discussion. It's stupid. Good day.",
                                          "author": "noschoolspirit",
                                          "created": 1616118882,
                                          "upvotes": 0,
                                          "replies": {
                                            "grfpose": {
                                              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfpose/",
                                              "text": "Damn bro that response really proved that you’re not elitist lmao. Nothings feigned here, I have beliefs and I fight for them.",
                                              "author": null,
                                              "created": 1616119633,
                                              "upvotes": 0,
                                              "replies": {
                                                "grfqquf": {
                                                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfqquf/",
                                                  "text": "You're clearly young. It's fine. You have your opinions from, in this instance, limited experience and I have mine. Look, it's great to fight for something and even though I will never agree completely with you on this issue, it's refreshing.  You can call me elitist, I can call you...a whole bunch of other crap. We probably miss the mark on each other with limited information from the interwebs, but at least I admit that. I'm sure you'll.come back with some weird lmao comment and blast me, so sure. But this is getting stupid and probably misconstrued.",
                                                  "author": "noschoolspirit",
                                                  "created": 1616120217,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "grfucng": {
                                                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfucng/",
                                                      "text": "It’s not a young-old thing, it’s a fundamental disagreement about problem solving through punishment versus problem solving through dialogue",
                                                      "author": null,
                                                      "created": 1616122223,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "grgtgg3": {
                                                          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grgtgg3/",
                                                          "text": "I agree and never said the whole problem was delineated by young and old. The point is experience that comes with age can change the dialogue and perspective.",
                                                          "author": "noschoolspirit",
                                                          "created": 1616151015,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "grhue3g": {
                                                              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grhue3g/",
                                                              "text": "Seems like a bit of a cop out to me. I could just as easily say that, “look, you’re obviously middle aged. It’s normal to lose a certain sense of empathy and compassion as you age, and that can lead you towards reacting without thinking based on the structural processes that you’ve become accustomed to participating in without analysis” but I wouldn’t because it really doesn’t have *that* much to do with anything",
                                                              "author": null,
                                                              "created": 1616171266,
                                                              "upvotes": 1,
                                                              "replies": {}
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "grcw0px": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcw0px/",
          "text": "No, her decision to cheat drastically altered the course of her life. \nBehaviour like this makes degrees meaningless and should be stopped.",
          "author": "Serenava",
          "created": 1616075344,
          "upvotes": 1,
          "replies": {
            "gre1m4j": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre1m4j/",
              "text": "The entire system that we participate in makes degrees meaningless tbh",
              "author": null,
              "created": 1616090723,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "grbsrha": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grbsrha/",
      "text": "Don't be a nark. They'll expose how shit they are themselves when they can't measure up",
      "author": "poorblanket",
      "created": 1616049748,
      "upvotes": -11,
      "replies": {}
    },
    "grc5729": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc5729/",
      "text": "Don’t grass her up Christ what do you stand to gain? Challenge her as a friend and see what she says.. she is a pal not a colleague or a competitor so treat her as such",
      "author": "bstaf003",
      "created": 1616062111,
      "upvotes": -4,
      "replies": {}
    },
    "grceptb": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grceptb/",
      "text": "A question for others here: what is the role of public knowledge of the plagiarism? Could OP go to her and say \"Either you turn yourself in or I tell the school?\" Does turning herself in necessarily mean she could hide that the plagiarism happened? Obviously the punishment would then be solely not having the degree, which seems less than satisfactory.",
      "author": "dcgrey",
      "created": 1616068417,
      "upvotes": 1,
      "replies": {}
    },
    "grd0y91": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd0y91/",
      "text": "It's pretty rich that she's getting an MFA in creative writing when she's never written anything by herself",
      "author": "wildblue123",
      "created": 1616077076,
      "upvotes": 1,
      "replies": {}
    },
    "grd6ar5": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd6ar5/",
      "text": "Why do you choose to be around people like this when we are all influenced by such company? If you let on that you're not happy, she could formally accuse you in order to secure her own interests\n\nReport her, be smart, do it in writing - send it to the programme leader and relevant deans. They'll conduct a short interview with her and if there's a serious problem, it'll evidence your claims. The danger is that you do this without evidence, thereby potentially jeapodizing your own position",
      "author": "zante2033",
      "created": 1616078970,
      "upvotes": 1,
      "replies": {}
    },
    "grdbhln": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdbhln/",
      "text": "I agree with reporting it because of how much of a pattern it sounds like this is. If it was just one assignment for one class that she couldn't do because of personal issues, I'd let it slide. But she did this throughout undergrad and for her thesis. I feel resentful about this knowing how much I am struggling, and also how degrees are being cheapened by this. \n\nI've been a TA and seen how hard students work with very poor writing skills to get through their classes. These students don't have the money to do this and/or have too much integrity. This kind of behavior comes at the expense of these students because who is getting awards/scholarships, good job offers, letters of rec, etc? The people with good grades. \n\nI know that on an interpersonal level this is hard - if you have a therapist I suggest talking with them about this. \n\nHowever if you really decide that this is super unethical and want her to be held accountable, you could look for proof before reporting her - say that your sister (or whoever) needs help with a paper in college and ask if she can recommend a service/person she used. Depending on the laws about recording people without their knowledge in your state, you could even try to record her secretly (do look into these laws though). Either way it gives more information you could provide to the school. \n\nI agree with others that talking with her will probably not result in her wanting to turn herself in. If you were feeling really brave and confident in your position, you could cut ties with her and tell her directly that this is why. Not even in an angry way, just being clear about your values. \n\nOn another note if you are really concerned about her knowing it was you, you could also try bringing up her cheating in front of other friends. Just do it casually, as if it's not a big deal. That would give you the opportunity to both see how your other friends react, and give plausible deniability about who turned her in. Though it does kind of risk making it look like it was someone else who did it - but who knows, they could agree with the action of reporting her.",
      "author": "academico5000",
      "created": 1616080662,
      "upvotes": 1,
      "replies": {}
    },
    "grdvvgi": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdvvgi/",
      "text": "so much for MFA as \"multi-factor authentication\" then...",
      "author": "woggabogga",
      "created": 1616088258,
      "upvotes": 1,
      "replies": {}
    },
    "grdyepo": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdyepo/",
      "text": "Report her before she becomes a Politician",
      "author": "InfamousGodlike",
      "created": 1616089351,
      "upvotes": 1,
      "replies": {}
    },
    "gre4580": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre4580/",
      "text": "Remember that this sort of behavior dilutes the value of degrees from your institution. You're doing a public service by stopping her.",
      "author": "stolid_agnostic",
      "created": 1616091856,
      "upvotes": 1,
      "replies": {}
    },
    "gre9pgv": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre9pgv/",
      "text": "The question isn't if you should snitch, but how. \n\nThat kind of behavior can't be allowed to stand.",
      "author": "ggcpres",
      "created": 1616094282,
      "upvotes": 1,
      "replies": {}
    },
    "grerti2": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grerti2/",
      "text": "Reporting a friend like this would be a truly horrible thing to do. I hope you do not take the advice of the fools responding otherwise. You will destroy your friendship and badly hurt someone you ostensibly care about, who trusted you. Any fantasy of her learning a lesson and becoming a better person through her expulsion is just that, a fantasy. If you actually care about her growth as a person or about your friendship, and if this weighs so heavily on your conscience that you have to do something, then talk with her about it. If she doesn't respond well or this so disgusts you that you no longer want to be her friend, then stop being her friend. But do not involve yourself in her degree/the thousands and thousands of dollars she or her family have spent on her education. You have no right to interfere in her relationship with the school. It has nothing to do with you and will not affect you in any way (no, she is not going to steal a job from you). Chances are this will catch up with her one way or another. Most professional writers at some point need to write. But it isn't your job to make that happen, unless you just want an excuse to blow up the relationships in your life.",
      "author": "icecreamlegend",
      "created": 1616102696,
      "upvotes": 1,
      "replies": {}
    },
    "gret0dv": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gret0dv/",
      "text": "Just mind your own business. She will have to face the repercussions of her actions without a doubt.",
      "author": "Upstairs_Ostrich2420",
      "created": 1616103246,
      "upvotes": 1,
      "replies": {}
    },
    "greu0zm": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greu0zm/",
      "text": "It boils down to what you want more: your friendship/social circle or holding her accountable. \n\nI am troubled to learn she was able to bypass the academy system for so long like this. It does not reflect well on the system at your institution. I know plagiarism is rampant in undergraduate works even in big universities but at the grad level it is low and usually limited to courses. \n\nIf you do choose to report her yes expect your social circle to blow up. If she is actually an imposter she will fight dirty. Be ready for that backlash.  \n\nBut I have a feeling that you will not be able to be her friend even you don't report her. Your friendship may be over.",
      "author": "Cowboy_Yankee",
      "created": 1616103717,
      "upvotes": 1,
      "replies": {
        "greu21w": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greu21w/",
          "text": "when the imposter is sus!",
          "author": "epic_gamer_4268",
          "created": 1616103730,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "grdbm2f": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdbm2f/",
      "text": "I wouldn't say anything, I don't think its your place to and would be a very begrudging thing to do to a friend, it's not like you're in the course with them being marked alongside them?   \n\n\nAlso from a legal stand point, that's defamation of character without any hard proof?\n\nYou can be sure there's plenty of people doing this, there's an industry that caters to it. This person will get their comeuppance when they get a job and they reveal themselves to be a fraud, be sure.\n\n&#x200B;\n\nNow if this really bothers you, you should cut ties and end this friendship, and if you so wish you can tell them how it doesn't align with your principles. We don't choose our family, but we choose our friends!",
      "author": "reddit_hates_me_91",
      "created": 1616080713,
      "upvotes": 0,
      "replies": {
        "gre8xi7": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre8xi7/",
          "text": "\"Don't call the police. Someone else heard that neighbor screaming for help. They'll call the cops. Just go back to bed and mind your own business!\"\n\nRead the tale of Kitty Genovese's gruesome murder, and its apocryphal usage as an example of the Bystander Effect.",
          "author": "Greenmantle22",
          "created": 1616093944,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "grej0gl": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grej0gl/",
      "text": "REPORT!",
      "author": "WyldeLoki",
      "created": 1616098727,
      "upvotes": 0,
      "replies": {}
    },
    "grc181v": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc181v/",
      "text": "[removed]",
      "author": null,
      "created": 1616058044,
      "upvotes": -15,
      "replies": {
        "grceigo": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grceigo/",
          "text": "> I mean why bother doing something if you can cheat your way through it?\n\nWhat a trash mindset. Practically everything in life *can* be cheated, but that not only cheapens the work other people have done and damages the thing you've cheated to gain, but it will catch up with you one way or another - either when you're specifically exposed, or when you havenlt learned the things and gained the skills that your qualifications suggest you should have.\n\nNot sure I would necessarily report in this case but I'd be very unhappy w/ the 'friend'...",
          "author": "blueb0g",
          "created": 1616068272,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "grfj8hm": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfj8hm/",
      "text": "You have an ethical obligation to report this conversation. Indeed, by not reporting it, you could also be sanctioned under some honor codes. Talk to your advisor or mentor. They can help decide the best path and support you on it. Even if there’s no hard evidence yet, this perosn’s advisor and committee should be warned. They’ll know how to discover if her portfolio is her own original work before granting her degree. \n\nAs for the friendship, that ended the moment she made you an accomplice to a breach of academic integrity. There’s nothing to salvage.",
      "author": "RiverThatBends",
      "created": 1616116201,
      "upvotes": 1,
      "replies": {}
    },
    "grghq7e": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grghq7e/",
      "text": "Don't worry about her just consult with some good educational consultants and take the advice she also can earn a good amount if she is a [good English writer](https://www.researchprospect.com/).",
      "author": "expertfreelancer",
      "created": 1616139204,
      "upvotes": 1,
      "replies": {}
    },
    "grc3llz": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc3llz/",
      "text": "You are willing to throw morals away for a friend? Then they aren't really morals..\nAnd If you aren't willing to report them because they would know it was you but would report if they wouldn't know it was you..\nSounds like you should maybe learn some integrity.. \nStand up for what you believe in no matter the consequences..\nAnd if they were really your friend you would talk to them and tell them what was happening, not being shady and doing it beging their back only if they won't know it's you..\nDon't be a snake..\n\nAs to the situation..\nIf it were me..\nI couldn't tell you what I would do..\nBecause I was screwed by the school systems as a kid so I feel like fuck that side of it and yea go ahead and cheat..\nBut on the other hand, By doing that you are taking away from the people who actually worked for it all because you have money and can pay someone else to do your work.. I don't think that is ok..\nSo it's a grey area in my opinion..\n\nI would say follow your soul and heart not your mind.. Be true to yourself..",
      "author": "pudgeyboy1988",
      "created": 1616060504,
      "upvotes": -5,
      "replies": {
        "gre036g": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre036g/",
          "text": "[deleted]",
          "author": null,
          "created": 1616090057,
          "upvotes": 1,
          "replies": {
            "greatbu": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greatbu/",
              "text": "So you would \"rat\" a \"friend\" out? I'd rather try and elevate myself and be honest than be sneaky.. How does that not make sense or sound decent?",
              "author": "pudgeyboy1988",
              "created": 1616094757,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "grc2gz6": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grc2gz6/",
      "text": "Maybe she’ll become an editor/manager? \nGet some evidence maybe, or find the true authors.",
      "author": "alecesne",
      "created": 1616059347,
      "upvotes": -5,
      "replies": {}
    },
    "grdd2um": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdd2um/",
      "text": "[deleted]",
      "author": null,
      "created": 1616081204,
      "upvotes": -3,
      "replies": {
        "gre9bif": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/gre9bif/",
          "text": "I look forward to your two-minute career as a museum tour guide.\n\n\"This diorama features a recreation of the lab of Marie and Pierre Curie. And now, for no reason, let's talk about Palestine and the plight of lesbians with disabilities!\"",
          "author": "Greenmantle22",
          "created": 1616094113,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "grcnstg": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grcnstg/",
      "text": "Do you want to remain friends? If so, don't report it.",
      "author": "BlokeyBlokeBloke",
      "created": 1616072289,
      "upvotes": -1,
      "replies": {
        "grd2dk6": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grd2dk6/",
          "text": ">Do you want to remain friends?\n\nI certainly would not want to be friends with a liar and a cheat.",
          "author": "SnowblindAlbino",
          "created": 1616077552,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "grdhrot": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdhrot/",
      "text": "I'm also a grad student, and I think I'd report it to my department, then play stupid and deny reporting it. That is just unfair and she shouldn't be awarder her MFA...\n\nA similar thing happened to my friend/colleague- a person in our department asked her to do a bunch of the coding for her dissertation and she'd pay her- and she did it! I didn't say anything since she is my friend, but I made it known that I thought that was super wrong.",
      "author": "notjennyschecter",
      "created": 1616082707,
      "upvotes": -1,
      "replies": {
        "greuxba": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greuxba/",
          "text": "That really shows your integrity say the truth to the department and then lie to the friend when they come asking.",
          "author": "Cowboy_Yankee",
          "created": 1616104136,
          "upvotes": 0,
          "replies": {
            "greyrh4": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greyrh4/",
              "text": "Judgmental much? I do have integrity because I'm telling the truth to my department. I don't need to be nice or honest to a \"friend\" who's a liar anyways, and I wouldn't be that person's friend afterwards, either...",
              "author": "notjennyschecter",
              "created": 1616105932,
              "upvotes": 1,
              "replies": {
                "greyx5w": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/greyx5w/",
                  "text": "Yes 👏",
                  "author": "Cowboy_Yankee",
                  "created": 1616106006,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "grdbilk": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grdbilk/",
      "text": "I would write an anonymous not to her advisor. Then, the advisor can find a way to verify her work. I think you would be in the clear. Ask the advisor not to mention the note to her.",
      "author": "poolhero",
      "created": 1616080672,
      "upvotes": 0,
      "replies": {}
    },
    "grevnq2": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grevnq2/",
      "text": "Just be quiet and mind your business, especially if you lack proof. I say this as someone who agrees your friend is lazy and lacks proper ethics. Heck, my response would be very different if this wasn't your friend but rather some random student in your class, but you're basically facing two different ethical dilemmas and I'm telling you friendship should take precedence. Controversial I know, I'm just an undergrad student but hear me out, most of the other people on here are grad students and professors that have been brainwashed into a completely different set of ethics than what the rest of the world operates on because academia selectively promotes people that abide by them.\n\nYour thought process is basically coming down to academic integrity vs friendship integrity. Friendship integrity is more real and lasts for life whereas the latter disappears once you graduate into the real world.\n\nFirst I'd like to dispel the notion of academic \"integrity\" you've been brainwashed into losing sleep over. I get that cheating and plagiarism are against the rules, but think about who makes those rules for a second... Academia, which is an archaic institution that gouges whole generations on loans just so they can get credentials for a job that actually pays enough to put food on the table, supposing they weren't sold on something worthless like \"gender studies\" or \"Medieval philosophy'. \n\nAcademia operates on a completely different ruleset than the working world. The reason cheaters look at it as a joke is because it is, it an absolute joke that these massive for profit institutioms actually dare to moralize why students using every tool at their disposal to regurgitate useless class material, ethical or not, is out of turn when they've spent decades lobbying government to effectively game capitalism and turn students into debt slaves.\n\nLet me make this abundantly clear, all cheating does is cheat the person doing it out of whatever knowledge they decided to forego. It doesn't effect you, it doesn't effect the value of the degree, and it doesn't effect the school's reputation. Those are all myths you've been told on the supposition that people look past your qualifications and resume in a job interview. They don't. Penn state has had foot ball players found guilty of rape and sexual assault, yet their reputation as a university is just fine.\n\nNow let's touch on friendship integrity. You yourself have admitted that you would lose a good portion of your social circle by snitching on them. Why is that? Either you have some really dubious characters in your circle, at which point you lose nothing, or there is something innately wrong in coming forward enough to warrant that kind of collective condemnation. Basically, you gotta ask yourself if the problem is with them or you, most often it's the latter but we all have our own moral principles. On some level though, you know you'd be stabbing this person in the back, and I think that's more dubious than any level of academic dishonesty you could commit. This is information you've been privy to as their friend, and friendship warrants a certain amount of confidentiality.\n\nNow, I'm going to get downvoted to hell and back for this post, but that's because my perspective comes from a very different world than most academics on this sub, and I suspect you fall somewhere in the middle otherwise you wouldn't need reddit's help on this. But take it from me, if she gets caught, let it happen on her own merit instead of trying to meddle. She'll learn whatever lesson there is and you won't burn any bridges in doing so.",
      "author": null,
      "created": 1616104479,
      "upvotes": 0,
      "replies": {
        "grfm8y5": {
          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfm8y5/",
          "text": "You’re going to get downvoted to hell and back because you’re a disgrace to your institution and to the academy. If you have so little respect for it and feel that it’s setting you up for a life of slavery, get out. No one will miss you.",
          "author": "RiverThatBends",
          "created": 1616117780,
          "upvotes": 1,
          "replies": {
            "grfqx7c": {
              "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfqx7c/",
              "text": "\"YoUr A dIsGrACe tO YOuR InStITUtiON aND ThE aCAdEMy.\"\n\nBite me, I actually know how to play ball with submission guidelines and cover my tracks when I don't. Doesn't matter how I get there so long as what I turn in can legitimately be claimed as my own. \n\n\"You can't turn in that coding assignment you've done before because that's self plagiarism!\" Oh really? Watch me as I write out new code methods from scratch that do the exact same thing with as different commands as possible while building off what I did the first time. Takes me half a day to do, but it's still infinitely faster than spending a week drafting it all up from scratch because I already solved the problem before.\n\nOh, you want me to do a list of practice problems on codeworkout? I can literally pull up 50 different solutions off codeacademy then make my own original solution based on those after seeing how a general solution needs to work, and no honor court would be able to prove otherwise short of bugging my apartment.\n\nOh, you want me to take a test on my computer at home for a zoom class? What's that, you aren't going to make me use lockdown browser or have my webcam up? I guess I'll just use google to my heart's content then. God know's most other students without a virtue complex will.\n\nI have no qualms about cutting corners when the school has no way to catch it or no way to enforce their policy on it, because grades are more important than learning clearly. At the end of the day, I feel no guilt because I'll be able to take my degree and land a cushy software engineering job at 70-90k a year, of which I am doing more than enough work to prep myself for outside the classroom by pursuing internships and learning the actual tools of the trade instead of some intro to data science class that isn't even up to date on its curriculum.\n\nWhy do I rationalize this? Simple, nobody stops you from looking stuff up in the work place or referencing preexisting solutions because most jobs are about \"running the laps\" instead of actually doing anything innovative. As long as you follow industry guidelines and ethical standards, which are very different from the academic world's, you're golden.\n\nSo bite me.",
              "author": null,
              "created": 1616120315,
              "upvotes": 0,
              "replies": {
                "grfwvev": {
                  "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grfwvev/",
                  "text": "I truly wish I could watch karma at work with you. It’s going to be a thing to behold.",
                  "author": "RiverThatBends",
                  "created": 1616123643,
                  "upvotes": 1,
                  "replies": {
                    "grg0jlr": {
                      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grg0jlr/",
                      "text": "Ah yes, stride up on your high horse and cite karma as your excuse to wish ill on others. Tell you what doofus, I will personally come back to this thread and follow up if I ever happen to get my \"karma\" so you can breakout the popcorn and enjoy yourself. Because guess what, your pathetically self righteous butt isn't going to get that satisfaction, ever :)",
                      "author": null,
                      "created": 1616125809,
                      "upvotes": 0,
                      "replies": {
                        "grg45hh": {
                          "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grg45hh/",
                          "text": "At least you’re eloquent in your insolence.",
                          "author": "RiverThatBends",
                          "created": 1616128095,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "grf4s6u": {
      "link": "/r/AskAcademia/comments/m7i3mv/friend_outsourced_her_thesis_portfolio_for_mfa/grf4s6u/",
      "text": "Can I ask: is it possible your friend is exaggerating a bit about the number of papers they actually bought? Lots of students buy/have someone else write their papers - I'm TT prof and I'm not that mad about it as long as it is original work and it's only once or twice in a student's career. If this is true, she would have had to had the same person writing for her in the same classes, because it is really easy to tell when someone turns in a paper in a tone they've never used before. And if its a smaller program where she had a prof more than once? Again, I'm a sociology prof and if its obvi to me, pretty sure a CW prof would notice...\nIs it possible your friend is testing you to see if you will tell? Because if you report and the evidence isn't there, you could look bad. \nFrom a prof pov... if the faculty and CW program didn't notice or think she was a problem, there's a problem with the program so her degree isn't going to be worth much anyway. \nBUT. Most schools have an anonymous form where you can report plagiarism, maybe look for that? \nGood luck.",
      "author": "Katie4147",
      "created": 1616108870,
      "upvotes": 0,
      "replies": {}
    }
  }
}