{
  "sid": "p6rqyf",
  "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/",
  "title:": "Are there benefits to accepting a Research Assistant position?",
  "text": "Hi everyone, I recently left a job where I was a junior lecturer. I'm 25 (f) and not in my doctoral program yet, but despite this I got a lot of 'wiggle room' in my role as a junior lecturer- I got to design and teach my own undergraduate course in my discipline and was able to teach first-year master students as well (again in my area of interest which is African gender studies). \n\nI recently got offered a research assistant position to someone who is an extremely high profile academic in my field of study. I am very excited but also a little hesitant because the position would involve a whole lot of admin work (like a lot ). I was wondering about people's experiences as research assistants before pursuing their PhD. How well did being an RA prepare you for a doctoral position, if at all? How does it read on an academic CV? \n\nI also got an offer to lecture full time in a masters program around African Studies and Global health, which I have not yet declined. To be able to fully make an informed decision, I just wanted to hear some experiences from others :) \n\nThanks a lot!",
  "author": "aincs22",
  "created": 1629295284,
  "updated": 1634079561,
  "over_18": false,
  "upvotes": 66,
  "upvote_ratio": 0.89,
  "comments": {
    "h9fca4b": {
      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9fca4b/",
      "text": "\"Research assistant\" is not some kind of standardised position - it can be almost anything: a glorified admin, a random group minion, a lab technician, a programmer or data analyst, a PhD student's stipend, or even a junior postdoc.  \n\nYou're asking very sensible questions, but no one here can give a reliably meaningful answer without an actual job description.  \n\nAs for your CV, again, it doesn't mean anything on its own.  What matters is whether the specific skills, experience, and  professional network that you gain there will make you a stronger candidate for whatever you're applying for.  You'll need to consider what your weaknesses are as a PhD applicant and evaluate whether this particular job will help boost your credentials in those areas.",
      "author": "polyphonal",
      "created": 1629304691,
      "upvotes": 54,
      "replies": {
        "h9it7jr": {
          "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9it7jr/",
          "text": "Very true ! Thanks for bringing these reflective points in, they’re important :)",
          "author": "aincs22",
          "created": 1629373999,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9et782": {
      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9et782/",
      "text": "I'm doing a PhD in a fairly highly ranked Australian university so I can only speak from my specific experience, but I would be thinking about the research output you could demonstrate via the RA job. Will you be an author on papers? Ideally first author on at least one, but I know that might be unrealistic. \n\nBeing an author alongside a highly influential researcher means you are likely to get a relatively high number of citations for your field and level of experience, which in my realm is very desirable.\n\nAnother good thing for an academic CV is to be listed on grants.\n\nI too would be hesitant about the amount of admin work. In my experience RA positions are VERY easy to exploit. I've seen highly competent, eager people who struggle to say \"no\" and set boundaries pushed to burn-out because they end up doing several people's jobs. Again, just my experience.\n\nPersonally I might not mind grunt work if there was a payoff in the form of publications.",
      "author": "ravencrawr",
      "created": 1629296030,
      "upvotes": 32,
      "replies": {
        "h9ezxx5": {
          "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9ezxx5/",
          "text": "I don’t think I would be publishing alongside them to be honest, at least this is not the impression I was getting from our talk. I would get my hands on first drafts of books etc that I would get to brush up and edit, so I would expect a mention in that kind of a capacity. \n\nThe real benefit from the job would be … concrete training in archival work and database stuff but more importantly the network they would introduce me to.",
          "author": "aincs22",
          "created": 1629299175,
          "upvotes": 8,
          "replies": {
            "h9ghly1": {
              "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9ghly1/",
              "text": "Given your other comments about not being accepted in a PhD program, I think that training and database stuff will definitely be handy! \n\nIn my experience being accepted into a PhD isn't the hard part, it's gaining a scholarship/grant so you can be paid while you do it. Here people straight out of undergrad need good grades in the very least, but across the board the more research skills you can demonstrate the better. It sounds like an RA position alongside an influential academic will go a long way toward that goal which is great. I brought up publication because papers are a concrete example of your skills AND there's that pesky publish or perish mentality out there. \n\nAt the end of the day you need to convince the people paying you to do your PhD (or maybe the people giving an opportunity for a PhD regardless of pay, again just my experience) that you are a worthy investment, where the payoff they want in the end is to elevate their academic image.",
              "author": "ravencrawr",
              "created": 1629323200,
              "upvotes": 4,
              "replies": {}
            },
            "h9gi9k4": {
              "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9gi9k4/",
              "text": "Also, just want to add that you could always negotiate authorship before you accept the position, if this is something you are interested in. \n\nIf you are an important part of their data collection/analysis then there's no reason you should be left out of publications. But I do know some fields often have papers with very few listed authors so maybe they work differently. I'm in psychology and as long as someone makes a contribution to the idea, data collection, analysis, writing, and/or editing of a paper then they can generally be authors. A good lab should have a predetermined set of criteria for what constitutes authorship, for fairness.",
              "author": "ravencrawr",
              "created": 1629323502,
              "upvotes": 3,
              "replies": {
                "h9itekc": {
                  "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9itekc/",
                  "text": "Again super helpful to think and consider all of this, so thank you so much for the response. I think you’re right and there is probably more room with authorising etc that might come later on. Having read peoples replies I’m going to go for the RA position :))",
                  "author": "aincs22",
                  "created": 1629374118,
                  "upvotes": 2,
                  "replies": {
                    "h9j4h9t": {
                      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9j4h9t/",
                      "text": "Awesome! I hope you love it and it leads to bigger and better things :)",
                      "author": "ravencrawr",
                      "created": 1629380022,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h9f8wco": {
      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9f8wco/",
      "text": "Not always but RA-ships are often more or less identical to what a PhD student does, but lower stakes, (often) low pay, typically less independence. It's probably the best possible preparation for a doctoral position.",
      "author": "mediocre-spice",
      "created": 1629303200,
      "upvotes": 6,
      "replies": {
        "h9fwusd": {
          "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9fwusd/",
          "text": "Thank you this is really helpful !",
          "author": "aincs22",
          "created": 1629313834,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9fym9r": {
      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9fym9r/",
      "text": "I was an RA before I started my PhD, and an RA many times while in my PhD, and it was a super good experience. I learned a lot about how real professors do research, I got paid, and I got to show the professors that I could do it myself. The latter pays off in spades when you later need letters of recommendation (which you will, for fellowships, for jobs, etc.) — it's a chance to show a professor what you are capable of, above and beyond what they'll see in a class.  It also teaches you a lot about how universities work (and don't), and also teaches you a lot about how to manage researchers working for you in the future (and how not to). \n\nNot saying that every RA position is equal, but it's definitely useful if you are planning to go onto a career in academia. I know in my case my performance as an RA was way more impactful on my advisors' understanding of me than my performance in classes was. Everybody can be sort of OK in classes in grad school, but I was able to gain a reputation as an excellent and dedicated researcher, and that made a huge difference.",
      "author": "restricteddata",
      "created": 1629314632,
      "upvotes": 4,
      "replies": {
        "h9itfkh": {
          "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9itfkh/",
          "text": "Thanks so much, this is really helpful !",
          "author": "aincs22",
          "created": 1629374136,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9ewe7v": {
      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9ewe7v/",
      "text": "Why would a Research Assistant be doing any administrative work at all?? Confused here. You should be doing 100% research as an RA, at least that's how it is in my STEM field.",
      "author": "__x0x__",
      "created": 1629297538,
      "upvotes": 31,
      "replies": {
        "h9f7hlr": {
          "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9f7hlr/",
          "text": "Lab manager/RA positions are pretty common in the sciences, where you have a dedicated 25% or 50% to admin",
          "author": "mediocre-spice",
          "created": 1629302574,
          "upvotes": 27,
          "replies": {
            "h9fdx8b": {
              "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9fdx8b/",
              "text": "A productive lab should have a dedicated full-time lab manager, not some inexperienced graduate student doing it on a part-time basis.",
              "author": "mleok",
              "created": 1629305408,
              "upvotes": 3,
              "replies": {
                "h9ft829": {
                  "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9ft829/",
                  "text": "This is totally field dependent. Most labs in my field don't have any lab manager at all and are perfectly productive. The ones that do are mostly doing minor things like scheduling undergrads and managing reimbursements.",
                  "author": "mediocre-spice",
                  "created": 1629312192,
                  "upvotes": 14,
                  "replies": {
                    "h9ftsqq": {
                      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9ftsqq/",
                      "text": "That’s what I call a false economy, get a full time staff member for these kind of things, particularly managing lab finances.",
                      "author": "mleok",
                      "created": 1629312451,
                      "upvotes": -6,
                      "replies": {
                        "h9fu1x5": {
                          "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9fu1x5/",
                          "text": "There's nowhere near enough work for a full time admin staff. I've only seen that in wet labs. I did maybe 5 hours a month of admin as an RA.",
                          "author": "mediocre-spice",
                          "created": 1629312566,
                          "upvotes": 10,
                          "replies": {
                            "h9g0m9p": {
                              "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9g0m9p/",
                              "text": "One can always share admin staff with another lab, but the point is to have staff who will be long-term.",
                              "author": "mleok",
                              "created": 1629315525,
                              "upvotes": 1,
                              "replies": {
                                "h9g4g0j": {
                                  "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9g4g0j/",
                                  "text": "I'm glad you found something that works for you!",
                                  "author": "mediocre-spice",
                                  "created": 1629317230,
                                  "upvotes": 6,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "h9fs158": {
                  "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9fs158/",
                  "text": "I agree with this 100%. I agreed to be a lab manager as a part of my graduate studies fellowship and I often regret it quite a bit.\n\nCould you drop me in an empty room and have a full wetlab setup in XYZ time frame? Sure.\n\nCan I manage a small army of undergrads and graduate student while teaching them all types of assay protocols alongside extractions blah blah blah. Sure.\n\nDo I have a bunch of authorships? Sure, but no first accepted.\n\nDid I almost have a nervous breakdown and taking classes, writing a Master's thesis and running a lab with 10+ project going through it any given time? Yes.\n\nI am a firm believer the GA should not run a lab for their assistantships. Assistant to the lab manager? Sure! But absolutely not a lab manager.",
                  "author": "Zelamir",
                  "created": 1629311653,
                  "upvotes": 3,
                  "replies": {}
                },
                "h9fzme1": {
                  "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9fzme1/",
                  "text": "I think in biology, especially in newer less established labs, bachelorette students are often hired as managers. They make solutions, do ordering, and maintain animal strains. Most stay 1-3 years and also do some research in the role, then leverage it into a PhD program. Only labs with large numbers of animals to manage or that reach a certain size (15 people?) seem to have lab full time lab managers with much experience. \n\nIt is the norm, even if it is not ideal. Heck, I was basically the lab manager for a new PI during one of my rotations, and then she couldn’t understand why I struggled to produce data. I have a friend who is the de facto manager of his lab and it is keeping him from graduating because it eats up his time.",
                  "author": "Bookwyrm752",
                  "created": 1629315080,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "h9f5knm": {
          "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9f5knm/",
          "text": "Same in my STEM field as well. Every RA I have ever known (about a dozen) has worked on research projects doing research activities. I would put them sort of in the same level as a PhD student but without the need for a dissertation or coursework. Very little if any admin work, and usually there's at least some push to publish their work.",
          "author": "Prukutu",
          "created": 1629301728,
          "upvotes": 6,
          "replies": {}
        },
        "h9fw7oz": {
          "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9fw7oz/",
          "text": "Unfortunately, a lot of professors treat their RA's as secretaries. Update my CV, send e-mails to these people about workshop registrations, etc. It's atrocious but it's very common. I haven't seen it happen in STEM, though.",
          "author": "newpua_bie",
          "created": 1629313540,
          "upvotes": 3,
          "replies": {
            "h9git1m": {
              "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9git1m/",
              "text": "Out of curiosity why is it atrocious? If a PI is paying your salary doesn't it follow that they get to tell you what to do in your working hours? (I don't mean RA positions that grad students get for PhD funding, I mean paid positions like the one I think OP is talking about)",
              "author": "tishtok",
              "created": 1629323751,
              "upvotes": 0,
              "replies": {
                "h9gjm2q": {
                  "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9gjm2q/",
                  "text": "I agree with what you said, and I think I may have misunderstood OP's post. My comment was about PhD student RA positions.\n\nObviously, if someone hires you to be a lab manager and/or secretary and you are informed that's what it's going to be, then there's no issue. However, if you're hired and there's an expectation that you would be able to assist in actual research work (which would presumably help you get publications), and instead you're only handed administrative duties, not included as a co-author, etc, then I would still consider this a bait & switch type of a situation",
                  "author": "newpua_bie",
                  "created": 1629324130,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "h9ezex8": {
          "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9ezex8/",
          "text": "That’s ra very  interesting perspective actually. I just assumed the admin component was natural for something like this, but perhaps not? Anybody within the Humanities or SS have experience with this ?",
          "author": "aincs22",
          "created": 1629298932,
          "upvotes": 5,
          "replies": {
            "h9f5h0e": {
              "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9f5h0e/",
              "text": "I'm an RA right now (Social Science) and would not expect to be given admin work. I focus on research, writing, developing certain programs, etc.",
              "author": "t3sseracting",
              "created": 1629301684,
              "upvotes": 10,
              "replies": {
                "h9gib19": {
                  "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9gib19/",
                  "text": "However I think it's different if the job description is laid out ahead of time. A research heavy RA position shouldnt expect large amounts of admin work, but that doesn't mean admin heavy RA positions don't exist or are necessarily bad. If you know that's what you're getting into then you know what to expect. It kind of doesn't matter what is \"standard\" if the PI is being very clear about what they need and is letting OP decide if it suits their interests.\n\nFor what it's worth I know plenty of RA's & lab managers who were hired to admin heavy positions in social science labs.",
                  "author": "tishtok",
                  "created": 1629323521,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h9f18fn": {
              "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9f18fn/",
              "text": "yeah as a STEM person, I've only had to focus solely on research and all the tasks associated with my project and publishing my article!",
              "author": "almondbutter_22",
              "created": 1629299768,
              "upvotes": 7,
              "replies": {}
            },
            "h9gi10p": {
              "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9gi10p/",
              "text": "In SS I think it's quite normal, as long as the duties are laid out ahead of time. If your goal is to get into the best possible grad school, it may not matter too much if it's an admin-heavy position. In many cases a letter from a famous PI goes much farther than skills you can learn in grad school anyways. So, what are your long term goals? And can you talk to anyone in your field about these options? Perhaps some of the PI's other research assistants/grad students?",
              "author": "tishtok",
              "created": 1629323392,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h9ewg26": {
      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9ewg26/",
      "text": "My field (economics) is not remotely similar, so take this with a grain of salt...\n\nAre you accepted into a PhD program already? If not, I would jump at this chance regardless of whether you'll be a coauthor on research. In economics at least doing a high-profile RA position is super helpful for doing a PhD at a top program. \n\nIf you're already accepted, the benefit is a lower but I'd still do it. You're going to learn a lot from this person just from talking. This will read as much more impressive on your CV than the lecturer position you're also offered, even if admin work is not that exciting.\n\nLast question: is there any way to discretely ask around to see if this professor is a decent human being? If they're a jerk this opportunity sounds much less appealing.",
      "author": "schwza",
      "created": 1629297562,
      "upvotes": 14,
      "replies": {
        "h9ezn17": {
          "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9ezn17/",
          "text": "Thanks so much for the reply! I’m not yet accepted so I was indeed hoping this would boost my chances of getting into one of my top choices. That being said the person is quite ‘intense’ with their work and also with the quality of their work. They have also worked in the US for a long time and I think that is probably the work culture they’ve adjusted to - which can be quite exploitative of juniors.",
          "author": "aincs22",
          "created": 1629299037,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h9f0st7": {
      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9f0st7/",
      "text": "Well RA is usually nice to get experience in research so it gives you actual experience and looks good on resume if you are looking for phd.",
      "author": "579red",
      "created": 1629299571,
      "upvotes": 3,
      "replies": {}
    },
    "h9hh33u": {
      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9hh33u/",
      "text": "Business PhD student here, so take this with a grain of salt. I was a research assistant during my Master's program just to get some exposure to research before applying for a PhD. In my field, it is the norm for PhD applicants to not have any research experience, although most fields I believe are the opposite. \n\nThat being said, my experience as an RA ended up being the strongest point of my CV for a few reasons:\n\n1. I RA-ed for a well known professor in my field, who later wrote an amazing letter of recommendation for me. Although I obviously haven't seen the letter, it was mentioned to me multiple times during interviews that my interviewers knew that professor personally and were very excited to interview someone with his recommendation. \n2. If you do any research work at all, you will likely be working on a paper that is co-authored with someone else (hopefully someone at a different institution). If you can connect to them while you're RA-ing, it will make a world of a difference if you end up applying to their institution. I personally didn't get to interact with any of my professor's co-authors. However, it was very helpful when applying to a certain university to be able to say \"I've already worked on a paper written by a professor at your institution.\" (also makes a great talking point during interviews!)\n3. This may be field-specific because of what I mentioned earlier, but getting a PhD is a huge commitment for both you and for your university. They invest a lot of time, money, and effort into you and don't want it to go to waste if you drop out. This is especially important in my field because many applicants haven't even touched research before and therefore might be unprepared for academia. RA-ing shows that you have had some experience with research, have exposure to the world of academia, and have a better grasp of what being a PhD and later being a professor will be like. All of that means that you are less likely to drop out halfway through because it wasn't what you expected or wasn't for you.\n\nOther pros: It is also a great interview topic and if you can be an author on papers, it will boost your CV. Hope this helps! Good luck!",
      "author": "arivinrolila",
      "created": 1629339912,
      "upvotes": 2,
      "replies": {
        "h9isyi3": {
          "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9isyi3/",
          "text": "Wow! Thank you so much for taking the time to answer this, it really helps and it seems like you took a lot from your experience with being an RA !",
          "author": "aincs22",
          "created": 1629373841,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9hkyni": {
      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9hkyni/",
      "text": "I worked as a Research Associate and Lab Manager for a PI whose work was important in his field, and whose research I was genuinely interested in. The job involved a LOT of admin work, but in exchange, I got to work on my own research project (which I presented at a poster), and a research story that I can talk about in my graduate school applications that demonstrates my ability to apply my academic interests to a research question. I also got to go to talks at the institution and explored the field I was interested in. \n\nThe administrative experience was not fun. It was thankless and tedious, but it it gave me the perspective of what is needed to run a laboratory and the skills to balance a research calendar in addition to supporting the research goals of others.\n\nI'm applying to grad school in a related field, I was able to demonstrate my research skills. I was delayed by the pandemic and my personal medical rollercoaster so I can't say how successful it is in academia but I do feel like it was a worthwhile experience that gave me opportunities in academia (which were only hindered by a weird turn of events).\n\nThe quality of the job was shaped by the lab culture and the PI's experience and investments in his mentees. It has helped me get both research and agriculture jobs too.\n\nI would do it again both for experience and networking/support within the field.",
      "author": "tired-scientist-7",
      "created": 1629341844,
      "upvotes": 2,
      "replies": {
        "h9it21o": {
          "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9it21o/",
          "text": "Thank you for sharing your experience with me , really really helpful ! After reading a couple of the comments that speak specific to the possible benefits I think I’m going to take the offer !",
          "author": "aincs22",
          "created": 1629373904,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h9fn0uu": {
      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9fn0uu/",
      "text": "If you are in the humanities or social sciences, you need to look three steps ahead. \n\nHow likely is it that this will lead to a good PhD program? \nAnd how likely is that PhD degree to lead you to a better job than lecturer? According to this subreddit and other sources, I suspect you will end up as a lecturer or adjunct so … I would not do this… unless I was independently wealthy.",
      "author": "ThatProfessor3301",
      "created": 1629309419,
      "upvotes": 2,
      "replies": {}
    },
    "h9f1c20": {
      "link": "/r/AskAcademia/comments/p6rqyf/are_there_benefits_to_accepting_a_research/h9f1c20/",
      "text": "Research assistants are PhDs who get paid more to do mostly the same things, but don't end up with a degree.",
      "author": "CptSmarty",
      "created": 1629299814,
      "upvotes": -7,
      "replies": {}
    }
  }
}