{
  "sid": "p8ga74",
  "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/",
  "title:": "Is it Unreasonable to Work From Home One Day a Week as a Postdoc?",
  "text": "Hi All,\n\nSo I recently started a postdoc and so far I really enjoy the research! During my PhD, my advisor was very hands off and allowed us to make our own schedule. I was good at setting my own hours and found that I worked efficiently and well by working 4 long days in lab (12-15 hr days) and working from home one day a week doing writing, reading, data workup, experiment planning, etc. I really liked this schedule as it allowed me to principally focus on lab when I was there and then focus on desk-related work once a week. Additionally, it gave me freedom to have weekends to spend time with family, friends, and enjoy hobbies to keep myself sane! \n\nHowever, now that I have started my postdoc, this schedule seems to be viewed as lazy and not putting enough work in. My new advisor is younger and more hands-on, but before joining the lab, I clarified that her metric for evaluation was on project progress rather than hours worked. My question is whether you think working this schedule is unreasonable or not enough for a postdoc. My standpoint is that if I can complete the work necessary to move my projects forward at a reasonable pace, then the hours worked in lab is irrelevant. However, I also understand that for many labs, the culture for postdocs is to have a very high output that necessitates longer hours in lab.  For context, I am a chemist with plans on going into industry after my postdoc.\n\nThanks for your input!",
  "author": "ibthugin",
  "created": 1629501383,
  "updated": 1634079537,
  "over_18": false,
  "upvotes": 36,
  "upvote_ratio": 0.88,
  "comments": {
    "h9qocqw": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9qocqw/",
      "text": "4x12 is already more than you should work, TBH.",
      "author": "NilsTillander",
      "created": 1629511349,
      "upvotes": 119,
      "replies": {
        "h9u72q8": {
          "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9u72q8/",
          "text": "It’s about outcomes. As a postdoc you are not really in a ‘job’ for pay, you are expected to develop your career (yes, it’s complete exploitation). Sometimes it takes huge hours to get results, other times it doesn’t, that’s part of what makes science and research so fun for me. I’ve spent months of long lab hours for almost no return and other times come across something with little effort for huge return.",
          "author": "deltaQdeltaV",
          "created": 1629583595,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h9rvgsr": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9rvgsr/",
      "text": "One thing that you didn't mention, but that might be important, is the supervisory capacity of your new role as a postdoc.\n\nDoes your new PI have other postdocs? Does she have undergraduate or masters students who shouldn't be lone working in the lab? Is there a health and safety aspect to your presence that you've discounted? Does your new role include a large degree of technique transfer to junior lab members?\n\nWith what you've posted here, I don't have the information to say whose expectations are off-base. That said, I'm struck that, when you listed your outputs, none of them involved the lab as a whole, only you, your hours and your projects. A lot of PIs never set foot in the lab before COVID (and far more these days), which necessitates Mon-Fri coverage by the postdocs for basic supervision of junior staff - regardless of how productive you are in your chosen hours - and that's a large and often missed component when making the shift from PhD to postdoc.",
      "author": "Hasefet",
      "created": 1629541253,
      "upvotes": 19,
      "replies": {}
    },
    "h9rip22": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9rip22/",
      "text": "As a PI, I don't care if my students work 7 days from home, as long as they deliver data, papers and ideas I'm happy.",
      "author": "IHTFPhD",
      "created": 1629530043,
      "upvotes": 10,
      "replies": {}
    },
    "h9qua1b": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9qua1b/",
      "text": "That's a lot of hours anyway, I did far less as a postdoc.\n\nWorking from home should be 100% ok if it's doable from home. I prefer to work in my office to keep a distance between work and life, but using a VPN to access my office computer Vs sitting at it directly, should be the same.",
      "author": "PersonalZebra8993",
      "created": 1629514244,
      "upvotes": 30,
      "replies": {}
    },
    "h9rzpq5": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9rzpq5/",
      "text": "The issue isn't is it reasonable/unreasonable, it's does your PI allow this? Rightly or wrongly they seem to object to it. So you can either push back with her or accept that's how it is.",
      "author": "ACatGod",
      "created": 1629544772,
      "upvotes": 9,
      "replies": {}
    },
    "h9r1sr6": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9r1sr6/",
      "text": "Really depends on your PI but if you're doing 50-60 hours in just four days, that's more than enough.",
      "author": "RoyalEagle0408",
      "created": 1629518339,
      "upvotes": 25,
      "replies": {}
    },
    "h9q42jq": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9q42jq/",
      "text": "It is not necessarily unreasonable, and I get that it works for a lot of people, but each lab has their own culture and way of doing things. There could be many reasons they want you around. First, you are new and you do need to establish trust and show your work ethic. If you are new, there also might not be many papers to be working on yet. They might also want you around because they have more impromptu discussions and value that face to face time. As a postdoc, they might also want you around to help others and be a positive presence overall for the lab. Running my lab through COVID, I'm happy that many were productive at home, but I am also aware of all the intangible things that were lost not having face to face interactions. My advice is give it time. Get settled, get to know your labmates and supervisor, let them see your work ethic, and re-examine it down the road.",
      "author": "AwkwardAccountant5",
      "created": 1629501678,
      "upvotes": 32,
      "replies": {
        "h9rjnnp": {
          "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9rjnnp/",
          "text": "I agree with this entirely. \n\nWorking hours are a very lab specific thing. I am a PhD scholar in a lab where I can make my own schedule and only the project progress matters. My wife was in a lab where she had to be physically present in the lab, regardless of whether she has work that requires her physical presence (she mostly does wet lab work but once a week you have to sit and write and do data backup). \nHer boss was a super sweet man and when we asked him why he was so anal about being in the lab his reply was exactly this.",
          "author": "bloodmark20",
          "created": 1629530838,
          "upvotes": 9,
          "replies": {}
        },
        "h9rt27m": {
          "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9rt27m/",
          "text": ">\t…the intangible things lost not having face to face interactions\n\nThis entire reply just reeks of academic jingoism.",
          "author": "the_bio",
          "created": 1629539137,
          "upvotes": -13,
          "replies": {}
        }
      }
    },
    "h9s9iur": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9s9iur/",
      "text": "Working 12 hour days literally made me sick,",
      "author": "sweetypantz",
      "created": 1629551166,
      "upvotes": 5,
      "replies": {}
    },
    "h9s15fk": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9s15fk/",
      "text": "Have you asked your PI yet?\n\nEvery lab is different, but my PhD advisor has generally wanted students and postdocs in the lab during the day (he was fine about hours in general and taking time off). As a postdoc or senior graduate student, part of the job is helping and mentoring younger students, and if a student has a quick question, needs advice for an experiment, or especially any potential safety issues, it's very helpful to have more people around.",
      "author": "JHT230",
      "created": 1629545870,
      "upvotes": 4,
      "replies": {}
    },
    "h9qmu78": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9qmu78/",
      "text": "[deleted]",
      "author": null,
      "created": 1629510620,
      "upvotes": 24,
      "replies": {
        "h9rmi3b": {
          "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9rmi3b/",
          "text": "> If I had a new postdoc negotiating with me on day 1 about less time spent in the lab, as you seem to be\n\nOP seems to want to negotiate spending 12-15 hours in the lab, 4 days a week. That is 48-60 hours a week, which isn't \"less\" lab time, it is more than if OP worked 9-5 5 days a week.\n\nI'm not saying OP shouldn't prove themselves reliable first, before negotiating different working hours. But if anything OP is overworking in the lab, not asking for less lab time.",
          "author": "foibleShmoible",
          "created": 1629533283,
          "upvotes": 16,
          "replies": {}
        },
        "h9u35bw": {
          "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9u35bw/",
          "text": "I've worked in labs where, due to limitations on equipment or scheduling in the case of students in classes, we had people wanting to work on weekends or late hours. Definitely something that can be accommodated in time, but everyone needed to go through a supervised proving period before being turned loose to figure out their own best schedules. \n\nThere are also definite benefits to having *everyone* in the lab for at least a certain time period every day. I've been in labs where we had some people working 6-2 vs 12-8, but at least everyone saw each other every day for at least a few hours.",
          "author": "alexa-488",
          "created": 1629581750,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h9qzi0e": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9qzi0e/",
      "text": "Also a chemist. As others have said, each lab is different. In grad school, my advisor did not count working from home as \"real\" work. Only time spent in the lab was seen as real work. In my current (postdoc) lab, my advisor is more flexible, but I had to build that trust over time.",
      "author": "Phe-Ile-Thr-Cys",
      "created": 1629517035,
      "upvotes": 7,
      "replies": {}
    },
    "h9qax59": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9qax59/",
      "text": "I think the PI will really set the lab culture and could see a younger one with a smaller group pushing their postdocs for more hours in the office/lab. It helps inspire younger students and push the groups output. A very famous and established PI with a large group and lab would typically be all about output not time (their labs/offices are usually always occupied during allowed hours anyway because of shared space/equipment/etc). So it depends on the group. Just have an honest discussion about what they expect and how you would like to manage your time.",
      "author": "deltaQdeltaV",
      "created": 1629504907,
      "upvotes": 10,
      "replies": {
        "h9rrcbf": {
          "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9rrcbf/",
          "text": "I will say yes you are all right but communication with a dictactorship will be totally pointless.",
          "author": "Metalpen22",
          "created": 1629537594,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h9qsdjz": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9qsdjz/",
      "text": "Doesn't matter what I think. It matters what your boss thinks. sometimes bosses want people to be in the lab so they can find them or they can help other people. From my experience, most PIs do not want to have to remember when you will be there and when you will not be there. I would suggest instead of taking that day off at home you have a computer day in your office (assuming you have an office) on campus. If you are worried about being disturbed put a sign up that asked to only be bothered if its an emergency and put some earplugs/earbuds/headphones on",
      "author": "Ru-tris-bpy",
      "created": 1629513287,
      "upvotes": 5,
      "replies": {}
    },
    "h9qc9vb": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9qc9vb/",
      "text": "Nope, not at all. But it does somewhat depend on your PI",
      "author": "amateurviking",
      "created": 1629505555,
      "upvotes": 2,
      "replies": {}
    },
    "h9rhxl5": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9rhxl5/",
      "text": "Different schools have different expectations. At my institution, everyone is required to do five days on campus if they are faculty.",
      "author": "phoenix-corn",
      "created": 1629529423,
      "upvotes": 2,
      "replies": {}
    },
    "h9s35v0": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9s35v0/",
      "text": "No. I’m currently working from home 2-3 days per week as a postdoc. If anything I get more work done at home because I avoid my 40 minute each way commute.",
      "author": "Titcomb84",
      "created": 1629547284,
      "upvotes": 2,
      "replies": {}
    },
    "h9rq21e": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9rq21e/",
      "text": "The surprising part for me is your brief remark on the context. What is the point of the postdoc if you plan to go into industry anyways?",
      "author": "ColourlessGreenIdeas",
      "created": 1629536438,
      "upvotes": 2,
      "replies": {}
    },
    "h9qx5zn": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9qx5zn/",
      "text": "Depends on your PI and lab culture and the nature of your work. A post doc in my lab did computational work, he had some personal reasons so he went back to his family and worked remotely most of the time and would come to the lab to present stuff or for meetings and stuff. This was in Europe though.",
      "author": "Hjem_D",
      "created": 1629515757,
      "upvotes": 2,
      "replies": {}
    },
    "h9ruocw": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9ruocw/",
      "text": "I feel you,\nDuring my PhD I had more flexibility than during the post doc. This because my PI once told me that a successful post doc has no holidays, works 24h per day, 7 days per week. He is also suggested to choose a partner who decides to not work so she can stay at home taking care of the kids.\nI thought he was dramatic, but when he started to organise meeting during the weekend and/or considering the wfh as holiday, expecting results in the Sunday or finish a paper in 72 h. I realised he really thinks that.\n\nI went through a very difficult moment: panic attacks, depression, alcohol abuse and a lot of money spent in therapy.\nAt the end of the grant I will change job.\n\nPlease think about your own healthy. Do what it is the best for you.",
      "author": "Visual-Snow4057",
      "created": 1629540552,
      "upvotes": 1,
      "replies": {}
    },
    "h9sqlic": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9sqlic/",
      "text": "In my lab anybody can pick their work hours and their schedules how they want, and I fare pretty well with this policy. For me, what counts is the bottom line. In some projects (and situations) this is obviously much more feasible than in others. And, if your particular situation  does no place limits on this in some way, you should be able to work a day (or more) at home without having to pull that many hours during the other days....12 or 15 h days sounds unreasonable.",
      "author": "Matthias_Rillig",
      "created": 1629559605,
      "upvotes": 1,
      "replies": {}
    },
    "h9tcbxn": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9tcbxn/",
      "text": "I think after the start of the current Covid pandemic it should be 100% acceptable, but I realize not every PI views is this way. I would try to be present more when you first start maybe, but I would scale back your long days. I think your PI should have learned during Covid you don’t need those crazy hours to be productive.\nMy PI even works remote one day…. To try to have a lab culture where it’s ok to bc we’re not supposed to be in lab if we don’t need to be for Covid safety reasons.",
      "author": "Cupcakequeen789",
      "created": 1629569349,
      "upvotes": 1,
      "replies": {}
    },
    "h9tvd0y": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9tvd0y/",
      "text": "You have a PhD, I guess you're old and educated enough to decide where you want to work and what's best for the project. But honestly, the hours are way over the top. Do you only live to work? Wish you all the best & sucess!",
      "author": "nice_tomeet_you",
      "created": 1629578141,
      "upvotes": 1,
      "replies": {
        "h9tvtg7": {
          "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9tvtg7/",
          "text": "By the way: I work 2 days in the lab and 3 days from home. But this is because I do have all the data via VPN. Sitting in front of the computer at home or at work doesn't make a difference besides saving my personal free time (1h to get to my office).",
          "author": "nice_tomeet_you",
          "created": 1629578354,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9u3u3r": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9u3u3r/",
      "text": "Really depends on lab culture and current project(s). \n\nI've done 4-5 hours 7 days a week, 10-12 hour days for 3 or 4 days with an extended weekend, 72 hrs on and 72 off (with access to a place for napping), shifted work weeks to be Wed-Sun, worked nights instead of days, etc.",
      "author": "alexa-488",
      "created": 1629582068,
      "upvotes": 1,
      "replies": {}
    },
    "h9z3uhm": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9z3uhm/",
      "text": "Postdocs like all academics should surely be able to work wherever they like?\n\nBeing forced into the office for 12 hour days 5 days a week on a  (probably) £35-40k salary is hilarious, wtf are you even doing?  You could get paid much more than that in industry and get more flexible work hours too. The whole point of academia is being able to do pretty much whatever you like, not to have some idiot forcing you to go into work every day of the week",
      "author": null,
      "created": 1629678676,
      "upvotes": 1,
      "replies": {}
    },
    "h9zu960": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9zu960/",
      "text": "The schedule you propose sounds reasonable enough to me, but I think what you're forgetting is that an employee doesn't get to do whatever he or she wants merely because it's reasonable.  The fact of the matter is that you have a boss, and if your boss won't approve your proposed schedule, then that's really all there is to it.  In that case, you'd have two options: (i) come up with a schedule that is acceptable to your boss, or (ii) find a different job where the boss is satisfied with your desired schedule.\n\nGood luck.",
      "author": "ChemMJW",
      "created": 1629692508,
      "upvotes": 1,
      "replies": {}
    },
    "h9rr80k": {
      "link": "/r/AskAcademia/comments/p8ga74/is_it_unreasonable_to_work_from_home_one_day_a/h9rr80k/",
      "text": "Because your new advisor is a monarch type person. She is the kind of person that judge people by her own mood, not the performance. I just did some WFH for 2 days a year and then got discontinuing my contract because my boss think of me as being \"too much care in family\". \n\nTBH you need to change the boss to maintain your schedule, or change your schedule for better cooperation. She can refuse to publish your work to kill you. Be aware.",
      "author": "Metalpen22",
      "created": 1629537492,
      "upvotes": -3,
      "replies": {}
    }
  }
}