{
  "sid": "8jeumv",
  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/",
  "title:": "Transgender in academia?",
  "text": "Does anyone know how trans people are usually treated in academia? \n\nEspecially grad students?\n\nAnd also especially in molecular biology and biochemistry related fields?\n\nI ask because I’m going to be an incoming PhD student, but am also considering the costs and benefits of transitioning.\n\nThanks in advance for the information!\n\nEdit: I don’t understand the downvotes? This question seems perfectly fit for this sub?\n\nEdit2: Never mind, it was at like 55% upvoted when I posted that, it was probably just a couple people at the beginning. Also corrected candidate to student.",
  "author": "tossawaytransasker",
  "created": 1526324289,
  "updated": 1634081334,
  "over_18": false,
  "upvotes": 135,
  "upvote_ratio": 0.83,
  "comments": {
    "dyzphh5": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzphh5/",
      "text": "If you plan on changing your name, do it before your publish your first paper. You will want to have a consistent name in your publication history.",
      "author": "aftersox",
      "created": 1526346782,
      "upvotes": 110,
      "replies": {
        "dyzppxt": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzppxt/",
          "text": "That's a good point. Do you know if I can publish with a name that isn't my legal name? I currently go by a gender neutral nickname and I put that on my posters that I've presented at conferences, but don't yet have a publication, so I don't know if I can do it with those too.",
          "author": "tossawaytransasker",
          "created": 1526347023,
          "upvotes": 21,
          "replies": {
            "dyzpxbk": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzpxbk/",
              "text": "Yes, you can absolutely use a different professional name than your legal name. Women in academia sometimes do this to keep a consistent publication record despite name changes due to marriage and divorce. ",
              "author": "benjamindallen",
              "created": 1526347234,
              "upvotes": 62,
              "replies": {
                "dyzqavh": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzqavh/",
                  "text": "Cool, thanks! That's at least something I can worry less about then.",
                  "author": "tossawaytransasker",
                  "created": 1526347618,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "dyzrgm0": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzrgm0/",
              "text": "It varies, but most editors will let you publish with whatever name you want. I know one person who changed their name after they were married, but continues to publish using their maiden name. I know another person who often uses a pen name for some complicated reasons. If you have a name you are dead-set on changing to, use that when you send off manuscripts.",
              "author": "aftersox",
              "created": 1526348804,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "dyzswpk": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzswpk/",
          "text": "Just put whatever name you want on the paper.",
          "author": "aelendel",
          "created": 1526350274,
          "upvotes": 7,
          "replies": {}
        },
        "dz0a1hi": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0a1hi/",
          "text": "Came here to say this. You can pick literally ANY name that you want to publish under, but I recommend once you pick one you always stick with it. Someone convinced me for my middle initial I should use my maiden name instead of my actual middle initial and for some reason I listened to them so now I have to always publish with this random letter as my middle initial.... le sigh",
          "author": "Pink_324",
          "created": 1526378272,
          "upvotes": 6,
          "replies": {}
        },
        "dz0ag4y": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0ag4y/",
          "text": "Remember that last names are listed first in citations and references, so that changing your first name is not a big issue regarding consistency.",
          "author": "FortressFitness",
          "created": 1526379181,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "dyz6oj6": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyz6oj6/",
      "text": "This will depend on department and area as well as field, but generally academia is pretty liberal and most people, if they don't explicitly support you, are content to let you do your thing. Of course there are assholes and bigots everywhere but it's not generally acceptable to bully people for their gender identity in US academia. \n\nI'm not trans myself (and trans people pls correct if wrong), but I'd probably transition sooner rather than later so as to minimize the number of people in your professional network that you need to come out to. Unless you want to be very public about it, ofc.",
      "author": "riggorous",
      "created": 1526327798,
      "upvotes": 85,
      "replies": {
        "dyzb4ws": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzb4ws/",
          "text": "Thanks! That sounds promising and I appreciate the advice.",
          "author": "tossawaytransasker",
          "created": 1526331850,
          "upvotes": 13,
          "replies": {}
        },
        "dz06s9n": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz06s9n/",
          "text": "The field goes in the direction of hard science, and the faculty in those is going to be politically further to the right than in the liberal arts. Or, perhaps more importantly, it's not a field where such issues as gender identities are thematized. Still, I think academia is one of the places where they'll take just about anybody who can do good research (barring stuff like crime).",
          "author": "darko_hands",
          "created": 1526370562,
          "upvotes": 6,
          "replies": {
            "dz0j2sg": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0j2sg/",
              "text": "> the faculty in those is going to be politically further to the right than in the liberal arts\n\nI'm not sure this claim is accurate, actually. Either way, I don't think any field in academia is far to the right enough to campaign against people's private lives and identities.\n\n> Or, perhaps more importantly, it's not a field where such issues as gender identities are thematized.\n\nWhat does that even mean?\n\n> Still, I think academia is one of the places where they'll take just about anybody who can do good research (barring stuff like crime).\n\nThat comes off as a little offensive. Trans people aren't lesser humans. There's no reason to imply that they can only enter fields where \"they'll take anyone\".\n\n",
              "author": "riggorous",
              "created": 1526391718,
              "upvotes": 9,
              "replies": {
                "dz0l1zw": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0l1zw/",
                  "text": "> I'm not sure this claim is accurate, actually. \n\nI think that you'll find that there are a lot more conservatives in the hard sciences, maybe because these fields are not overtly political so political differences are tolerated. \n\n> What does that even mean?\n\nI don't think my sentence is above the 8th grade reading level, so I don't know what I should say to this. Literature departments tend to include the experiences of transgender folks in their curricula--which generally leads to arguments in favor of tolerance and respect for transexuals. \n\n> That comes off as a little offensive. Trans people aren't lesser humans.\n\nNow you're reading a lot into what I actually said. I certainly don't believe that trans people are \"lesser humans.\" I have trans friends and respect the variety of differences in gender and sexuality among humans. When I said \"they'll take anyone,\" I just meant that you're unlikely to encounter (at least overt) discrimination based on anything in academe.",
                  "author": "darko_hands",
                  "created": 1526393810,
                  "upvotes": 2,
                  "replies": {
                    "dz0lig8": {
                      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0lig8/",
                      "text": "> I think that you'll find that there are a lot more conservatives in the hard sciences, maybe because these fields are not overtly political so political differences are tolerated.\n\nI don't think \"conservative\" is synonymous with \"transphobe\". \n\n> I don't think my sentence is above the 8th grade reading level\n\nI'm just not sure what you mean by thematized, so I asked. There is no need to chastise me for asking you clarifying question. \n\n> Literature departments tend to include the experiences of transgender folks in their curricula\n\nThis is less common/mandatory than you think, but for general purposes, sure.",
                      "author": "riggorous",
                      "created": 1526394259,
                      "upvotes": 12,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "dyzssc3": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzssc3/",
      "text": "[deleted]",
      "author": null,
      "created": 1526350149,
      "upvotes": 34,
      "replies": {
        "dyztame": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyztame/",
          "text": "That's really cool that everyone was so supportive about it! \n\nDo you think that people were especially supportive because you were in a humanities department? I've heard that they tend to be the best about it compared to social sciences and then science/engineering.\n\nI'm lucky enough to also have an androgynous name (or at least nickname) so I'll use that I think.\n\nAnd yeah, part of me says that I totally should and that people who think they want to transition are very rarely wrong. But I think I'm also really scared and that may be paralyzing me with indecision (though in this case waiting/indecision is a choice of it's own). And I fluctuate between thinking I should totally do it and thinking that I probably shouldn't, but I've heard that's normal too. Part of it is also that I don't have super severe dysphoria, like some other people do. \n\nThanks for the information!\n\n",
          "author": "tossawaytransasker",
          "created": 1526350684,
          "upvotes": 7,
          "replies": {
            "dyzvmg4": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzvmg4/",
              "text": "[deleted]",
              "author": null,
              "created": 1526353103,
              "upvotes": 21,
              "replies": {
                "dyzw3o1": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzw3o1/",
                  "text": "Hmm, that's really interesting, I would have expected more problems from being trans than being a woman, and I'm not sure if that says really good things about the state of people accepting trans people or really bad things about how women are treated. Probably a combination of both I guess.\n\nAnd hmm, I'll be moving really far from where I am now for grad school. Do you mean it was helpful because they were in the area or because you could meet with them in person.\n\nThanks for the advice!",
                  "author": "tossawaytransasker",
                  "created": 1526353613,
                  "upvotes": 7,
                  "replies": {
                    "dyzwk9b": {
                      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzwk9b/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1526354100,
                      "upvotes": 8,
                      "replies": {
                        "dyzwsg3": {
                          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzwsg3/",
                          "text": "Hmm yeah, I'll see if I can maybe call a center there and see or something like that. It's in the southern part of the US, but in a very large city, so I'm not sure exactly what it would be like.",
                          "author": "tossawaytransasker",
                          "created": 1526354349,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "dz03s58": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz03s58/",
                  "text": "Its because they are trying to cosplay their role and that's the current line to say, not because [its something true](http://slatestarcodex.com/2017/08/07/contra-grant-on-exaggerated-differences/).  \n\n\n\"\nAnd if your answer is just going to be that apparently the negative stereotypes in engineering were stronger than the negative stereotypes about everything else, why would that be? Put yourself in the shoes of our Victorian sexist, trying to maintain his male privilege. He thinks to himself “Well, I suppose I could tolerate women doctors saving my life. And if I had to, I would accept women going into law and determining who goes free and who goes to jail. I’m even sort of okay with women going into journalism and crafting the narratives that shape our world. But women building bridges? NO MERE FEMALE COULD EVER DO SUCH A THING!” Really? This is the best explanation the world can come up with? Doesn’t anyone have at least a little bit of curiousity about this?\n(and I don’t think it’s just coincidence – ie I don’t think it’s just that a bunch of head engineers happened to be really sexist, and a bunch of head doctors happened to be really non-sexist. The same patterns apply through pretty much every First World country, and if it were just a matter of personalities you would expect them to differ from place to place.)\nWhenever I ask this question, I get something like “engineering and computer science are two of the highest-paying, highest-status jobs, so of course men would try to keep women out of them, in order to maintain their supremacy”. But I notice that doctors and lawyers are also pretty high-paying, high-status jobs, and that nothing of the sort happened there. And that when people aren’t using engineering/programming’s high status to justify their beliefs about gender stereotypes in it, they’re ruthlessly making fun of engineers and programmers, whether it’s watching Big Bang Theory or reading Dilbert or just going on about “pocket protectors”.\"\n\n\n\nNote that many of these imbalances are even more lopsided than the imbalance favoring men in technology, and that many of these jobs earn much more than the average programmer. For example, the average computer programmer only makes about $80,000; the average veterinarian makes about $88,000, and the average pediatrician makes a whopping $170,000.",
                  "author": null,
                  "created": 1526364388,
                  "upvotes": -17,
                  "replies": {}
                }
              }
            },
            "dz1mxai": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz1mxai/",
              "text": "[deleted]",
              "author": null,
              "created": 1526428676,
              "upvotes": 2,
              "replies": {
                "dz20uxq": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz20uxq/",
                  "text": "Out of curiosity, what made you decide to transition if you were so on the fence about it? I've found that mine also fluctuates and on some days I think that I'll inevitably transition, so I should get it over with and on other days I think that I don't really need to, so I might as well not have to go through all the trouble.\n\nAh yeah, that makes sense.\n\nThanks for sharing your experience!",
                  "author": "tossawaytransasker",
                  "created": 1526442607,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "dyzop10": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzop10/",
      "text": "I can't give any specific advice, but I would encourage you to read up on Ben Barres. Ben was one of the most highly respected neuroscientists of our time, elected to the National Academy of Sciences, and was also fairly outspoken about his life. I can't look any commentaries up now, but information about his experiences shouldn't be hard to find (incl. pieces in Nature, Science, etc.).",
      "author": "HuecoRancheros",
      "created": 1526345939,
      "upvotes": 27,
      "replies": {
        "dyzoz5x": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzoz5x/",
          "text": "Thanks! His work and life both look really interesting and I'll definitely look up some of the things he's said!",
          "author": "tossawaytransasker",
          "created": 1526346246,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "dz0mw1i": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0mw1i/",
      "text": "I am trans. Be aware that there can be significant structural barriers, especially around access to medical care and insurance coverage.\n\nHow much access to medical resources will you have, and what kind? Does the available insurance cover HRT and/or whatever interventions you might consider? Does it only cover a fixed number of talk therapy sessions per year? Where will you have to go for healthcare? Is it a significant distance / time investment? \n\nWhat hoops will you have to jump through for your school change your name and / or photo on course rosters / TA sheets?",
      "author": "cc_cyanotephra",
      "created": 1526395563,
      "upvotes": 10,
      "replies": {
        "dz210qg": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz210qg/",
          "text": "The school provides health insurance and it seems to cover SRS with doctor support plus associated services with that. And it doesn't mention hormones explicitly, but I'd be surprised if they somehow covered SRS, but not HRT. \n\nIt's in a big city, so there is definitely medical care nearby.\n\nHmm, I'm not sure about those, I should probably look them up. \n\nWere those the main things you had trouble with? ",
          "author": "tossawaytransasker",
          "created": 1526442809,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "dyzrb4z": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzrb4z/",
      "text": "Do you know of Ben Barres?\n\nhttps://www.nature.com/articles/d41586-017-08964-1",
      "author": "slugbearwave",
      "created": 1526348652,
      "upvotes": 7,
      "replies": {
        "dyzrjrc": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzrjrc/",
          "text": "Someone else mentioned him a little earlier, and he seems really inspiring, so I'll certainly read more about him. Thanks for the article!",
          "author": "tossawaytransasker",
          "created": 1526348895,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "dz0a70o": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0a70o/",
      "text": "In my personal experience at two different graduate schools \\(masters then PhD\\), science was one of the most liberal fields I've experienced. Unless you have tattoos  of swastikas across your forehead, literally no one cares about hair styles, tattoos, piercings, clothing \\(unless lab safety is involved\\), sexual orientation, relationship style, etc. In my lab, my lab manager is the most flamboyant gay man you'll ever meet and does not adhere to a lot of gender \"norms\" and I dont think its ever caused an issue whatsoever. If he wants to wear a dress to a conference, no one says anything they wouldn't say to a woman in the same dress or to him if it was dress slacks \\(just the normal \"you look nice today\" because he dressed up instead of his usual\\). We also have someone with very detailed sleeves, chest and legs and the only person I've ever heard of saying anything negative is our department chair, and as soon as she said it a TON of faculty jumped to his defense and said she's outdated and out numbered. \n\nI know these things are vastly different than transitioning, and there are some truly god awful humans in existence that penetrate any and every field, but my hopes are high that this would be a supportive field for you to be in while transitioning. That said, graduate schools is HARD. Its a ridiculously, unreasonably shitty time in a lot of peoples lives, so you may want to consider transitioning before starting if its possible to take a year off so that your stress level isn't 10000 when you transition. ",
      "author": "Pink_324",
      "created": 1526378612,
      "upvotes": 7,
      "replies": {
        "dz216a5": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz216a5/",
          "text": "Ha ha, luckily I don't have a tattoo like that. It's cool that people are really accepting then, that's reassuring. \n\nHmm, yeah, I've heard it's pretty hard and stressful, but I'm not really sure what I'd do in a year off. I'll consider it though because it will be multiple powerful stressors at the same time.\n\nThanks for sharing your experience and advice!",
          "author": "tossawaytransasker",
          "created": 1526443002,
          "upvotes": 2,
          "replies": {
            "dz2ck16": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz2ck16/",
              "text": "You’re welcome. And good luck!!! (With both grad school and I hope it’s a smooth transition with lots of support and love!)",
              "author": "Pink_324",
              "created": 1526464096,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "dz0l83i": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0l83i/",
      "text": "This is a minor point, but when you are just starting your PhD you are not yet considered a candidate. You don't have that label until you pass qualifying exams.",
      "author": "eskimo111",
      "created": 1526393979,
      "upvotes": 6,
      "replies": {
        "dz0n3uu": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0n3uu/",
          "text": "What do you all yourself before that? A PhD student?",
          "author": "craigjclemson",
          "created": 1526395759,
          "upvotes": 4,
          "replies": {
            "dz0nswx": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0nswx/",
              "text": "Yes indeed.",
              "author": "eskimo111",
              "created": 1526396404,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "dz204ug": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz204ug/",
          "text": "Oh oops, my bad. I didn't know that.  It makes sense that a candidacy exam makes you a candidate, but I somehow never made the connection ha ha. Thanks for saving me the embarrassment of accidentally using the wrong term in the future!",
          "author": "tossawaytransasker",
          "created": 1526441750,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "dz00pl2": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz00pl2/",
      "text": "I know at the University of Louisville where I'm getting my PhD in Biochemistry and Molecular Genetics they have been nothing but super supportive and welcoming. I've been well received by my peers and professors, and there's not been that first issue of misgendering, or using my deadname (I haven't got to legally change my name yet). I know every university is different, but I think academia is definitely more liberal and progressively minded than the general population. ",
      "author": "JNTC0788",
      "created": 1526359347,
      "upvotes": 3,
      "replies": {}
    },
    "dz00uvy": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz00uvy/",
      "text": "Varies a lot, just like real life and real people.\n\nBut I know the University of Edinburgh had a dedicated inclusion programme for raising awareness on unconscious bias that was mandatory staff training. \n\nI would hazard a guess that in the field you mentioned, researchers and staff tend to be open towards transgender people. ",
      "author": "mrgumble",
      "created": 1526359568,
      "upvotes": 3,
      "replies": {}
    },
    "dz0qi9p": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0qi9p/",
      "text": "If your university’s grad students are unionized, I’d check the text of your collective bargaining agreement (and any relevant MOUs) for trans-related provisions (e.g., health care). I’d also reach out to the union, see what their experience has been re: trans grad students and the grievance process (e.g., have they had to pursue a lot of trans related grievances?), and see if they have a working group dedicated to trans issues.\n\nIf your university provides or facilitates the purchase of health insurance, it is probably also worth taking a look at the insurance benefits booklet to see what aspects of trans care are covered and at what rates. This may take a bit of googling to find, but it’s likely publicly accessible.",
      "author": "jumprealhigh",
      "created": 1526398878,
      "upvotes": 3,
      "replies": {
        "dz20jf6": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz20jf6/",
          "text": "Ok that's a good idea, I'll look that up. \n\nIt seems like the university provided health care covers SRS if it's advised by a doctor, but doesn't precisely mention hormones. It also covers things related to that, and I'd be surprised if they cover surgery, but not HRT, so I think I'd be fine there.",
          "author": "tossawaytransasker",
          "created": 1526442220,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "dyzdhq5": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzdhq5/",
      "text": "It’s kind of funny to see cis people answering this question. I’m a trans academic. Academia sees the same amount of transphobia and cissexism that exist in the ‘real world’. While its doable to be trans + an academic, it’s a mistake to somehow think that a “liberal” social setting = less transphobia. My experience, as well as the experiences of all the other trans academics I know, points more so to the liberal setting of the university equaling a *different* kind of transphobia, instead of lessening it in some way. Not at all saying this to deter you, just wanted to provide some firsthand input. Good luck!",
      "author": "ratcookie",
      "created": 1526334069,
      "upvotes": 43,
      "replies": {
        "dyzfgqx": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzfgqx/",
          "text": "Could you elaborate on what you mean by \"a different kind of transphobia\"? Is it very different than what you would see from an average person?\n\nAlso, do you think it depends on the field of study?",
          "author": "tossawaytransasker",
          "created": 1526336000,
          "upvotes": 20,
          "replies": {
            "dyzzly3": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzzly3/",
              "text": "My guess \\(BIG caveat is I'm a cis male so speaking more on what I hear others have experienced\\) on what ratcookie may be talking about is you won't find most academics outright displaying hatred towards you \\(though there's always a number of bad eggs and I don't want to discount the bad experiences some have had in academia\\). Thus, academia does seem welcoming in a certain POV. Rather, it's a lot of issues with implicit bias that we all have picked up; people may treat you differently than they would towards others, which may mean less opportunities for success in your career. This of course shouldn't dissuade you, just realistically should know there may exist more bumps in the road for you than others. \n\nAs for your second question, I think it's less different fields of study to consider and more different departments at different institutions. Some institutions are better or worse than others, and then within institutions, some departments may be better or worse as well. I imagine most institutions have a graduate organization to represent LGBTQ issues and when considering programs, perhaps it would serve you well to reach out to such groups to ask their opinions of the various departments and relevant resources at their institution.",
              "author": "drago1337",
              "created": 1526357775,
              "upvotes": 11,
              "replies": {
                "dz21mkp": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz21mkp/",
                  "text": "Hmm yeah, that makes sense. \n\nAnd that also makes sense, I'll look into what programs my school has more in depth then and ask them.\n\nThanks!",
                  "author": "tossawaytransasker",
                  "created": 1526443577,
                  "upvotes": 2,
                  "replies": {
                    "dz25u6j": {
                      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz25u6j/",
                      "text": "Hmm, misunderstood that you already were accepted and chose a school. So I'd like to quickly add congrats and welcome to the PhD life! ",
                      "author": "drago1337",
                      "created": 1526449844,
                      "upvotes": 2,
                      "replies": {
                        "dz29qd9": {
                          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz29qd9/",
                          "text": "Thanks! I'm excited to join in! Though also slightly worried given all the horror stories I hear about grad school and of course my other issues.",
                          "author": "tossawaytransasker",
                          "created": 1526457486,
                          "upvotes": 2,
                          "replies": {
                            "dz3t12j": {
                              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz3t12j/",
                              "text": "I think a good number of horror stories can be distilled down to people not paying attention and ending up in a bad environment, meaning a lack of support structure and good mentors. If you spend the time and effort to find a community \\(which can be people inside or outside the institution\\) for yourself and the right thesis advisor. And your advisor shouldn't be the only mentor you have; find people who can mentor you in all aspects of your life and career.",
                              "author": "drago1337",
                              "created": 1526517915,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "dyznmcq": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyznmcq/",
          "text": ">It’s kind of funny to see cis people answering this question.\n\nThe question wasn't posed to trans people, it was posed to academics in general. Most people here also haven't clarified whether they are trans or cis so you are betraying your own prejudices by simply assuming that all those voicing opinions you happen to dislike are in the \"other\" group from you. You don't want that to be done to you, so don't do it to others.\n\n>Academia sees the same amount of transphobia and cissexism that exist in the ‘real world’.\n\nThat's just incorrect. By making excessively exaggerated claims like this, you are weakening your stance and make people less likely to believe you on other issues. You are harming a good cause with stuff like this. It is absolutely a fact that transphobia is a thing even in academia. Of course it is, because academics are humans and share human flaws. However, it is still absolutely true that academia is typically less preoccupied with such thoughts and statistically is a more welcoming place in that regard than most other career paths one might take. You are helping nobody by denying this. I'm sorry if your experience has been bad, these are questions of statistical nature not of an absolute one. Academia tends to be more welcoming to trans people than most other typical career paths. That's a fact and that's a good thing. It needs to be viewed as a strength and worked on further so that it can improve in the places where it still isn't good or good enough.",
          "author": "MrMehawk",
          "created": 1526344770,
          "upvotes": 31,
          "replies": {
            "dyzpg1q": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzpg1q/",
              "text": "I personally find statistics very reassuring, and since you mentioned that academia is statistically shown to be more welcoming and have less obstacles than most other careers, could you provide a source? I'm assuming that you have one I mean. If not and you're just speaking of statistics colloquially that's ok too. But if you do have one then I'd definitely like to read it so that I can be more informed on the subject, and it would definitely be relevant to my concerns. Thanks!",
              "author": "tossawaytransasker",
              "created": 1526346744,
              "upvotes": 22,
              "replies": {
                "dyztvla": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyztvla/",
                  "text": "I think they may be conflating “academia is more liberal” (which is demonstrably true) with “academia is more welcoming” (which I’ve never seen demonstrated and am not even sure how one would go about attempting). ",
                  "author": null,
                  "created": 1526351287,
                  "upvotes": 16,
                  "replies": {
                    "dz084hj": {
                      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz084hj/",
                      "text": "Ha, that's the truth. Academia is much more about conforming than welcoming. ",
                      "author": "Overunderrated",
                      "created": 1526373676,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "dz0dcj8": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0dcj8/",
              "text": "This is such an embarrassing and hostile response. But, usefully, it does speak to the \"transphobia by other means\" that the parent commenter was mentioning (rather than explicit bigotry, you get minimization, being dismissed, held at arm's length, treated like a museum curiosity, but, you know, as long as there are good intentions behind it, right?).\n\n>\"It’s kind of funny to see cis people answering this question.\"\n\n>The question wasn't posed to trans people, it was posed to academics in general. Most people here also haven't clarified whether they are trans or cis so you are betraying your own prejudices by simply assuming that all those voicing opinions you happen to dislike are in the \"other\" group from you. You don't want that to be done to you, so don't do it to others.\n\nYou have totally missed the tone of the quote you responded to. Clearly this person isn't saying, \"oh my god, cis people are not allowed to speak on this topic! Get your hand out of the cookie jar!\" They obviously mean, \"these responses are funny to me, because they are said with a lot of confidence but don't reflect the experience of any trans academics I've talked to, including myself.\" So, of course academics in general can respond to the question; that was never at stake. However, the hostility with which you strongly misread an innocuous comment does betray a few things about your biases.\n\nAs for the \"don't assume our gender!\" tone policing, well, some academics can be clever enough readers to infer all sorts of things about theoretical orientation, educational background, context, identity, etc., from the content of discourse (you know, for some of us this is our main area of training). Weird that in a comment about how great it is to be trans in academia you would choose to weaponize (and misunderstand) a concept that comes out of trans critical theory.\n\n>That's just incorrect.\n\nAs OP pointed out, it would be nice if your comment had any kind of evidence to back it up beyond your \"feelings\" about how nice academics are. Now, since this is an academic subreddit, know that all sorts of things can be counted as \"evidence\" (such as discourse analysis, ethnography, personal experiences). But, from your comment, it sounds like you just \"know what it's like\" for trans academics without actually learning about it in the first place (and even here in this very comment you've had an opportunity to learn from a trans academic and *actually* gain even a modicum of knowledge! But you chose to just tell them that they're wrong without even engaging in dialogue or asking what they mean).\n\n>By making excessively exaggerated claims like this, you are weakening your stance and make people less likely to believe you on other issues. You are harming a good cause with stuff like this. It is absolutely a fact that transphobia is a thing even in academia. Of course it is, because academics are humans and share human flaws.\n\nThis is all platitude and optics policing. Like, \"I agree with the *message* of Black Lives Matter, but why do they have to shout?\" There's also some kind of weird reductionism where the \"you\" that is weakening the \"other issues\" is a collapse of all trans academics into a singularity of response.\n\n>However, it is still absolutely true that academia is typically less preoccupied with such thoughts and statistically is a more welcoming place in that regard than most other career paths one might take.\n\nI almost don't even want to touch what \"preoccupied with such thoughts\" is supposed to mean. On the face of it, it is factually incorrect. Academia is one of the few places where trans rights, trans experiences, critical gender studies, etc., actually get taken seriously, that is, actually \"occupy\" our thoughts. But, the statement doesn't really mean to ask if we *neutrally* think about trans issues. Instead, it seems to imagine that we aren't \"preoccupied with such thoughts [of transphobia],\" that is to say that our brains are too \"occupied\" to bother to be filled up with transphobia---so, this seems to imagine that trans issues are invisible or suppressed in academia (since we're busy doing other things), AND it imagines that thinking about transgenderism can only mean thinking transphobic thoughts (that productive and critical and positive thoughts re: transgenderism don't exist).\n\n>I'm sorry if your experience has been bad, these are questions of statistical nature not of an absolute one. Academia tends to be more welcoming to trans people than most other typical career paths.\n\nThis is no different than a black american in New York saying, \"there's racism here,\" and then being told, well, it's worse in Alabama, and that's a fact, and you do nobody any good denying it. Or even worse, well, you're lucky this isn't 1930, or 1845, etc etc. Or, like, what would your response be if someone said that racism or sexism exist in academia? Of course it is often different than the non-academic world, but it's also a beyond obvious fact that these are all huge problems in academia, and, as the parent commenter put it, often express themselves *differently* in academia, which, I suppose, probably leads to these problems being unrecognized and invisible.\n\n>Academia tends to be more welcoming to trans people than most other typical career paths. That's a fact and that's a good thing. It needs to be viewed as a strength and worked on further so that it can improve in the places where it still isn't good or good enough.\n\nJust more platitudes. Of course being trans in academia is better than being trans in a pit of hungry lions. But it is so ridiculously out-of-touch to imagine that the way academia and academics treat *actual* trans people is \"a strength\" rather than being rife with conscious and unconscious problems. That is, you're asking academics to be complacent in the status quo (which, if you did know the transphobic stuff that some people have to deal with, I'm sure you would never advocate for).\n\nIf I were you, as any good academic should do, I would ask myself, \"what's at stake for me if transphobia exists in academia, and what's at stake for me if it is welcoming?\"",
              "author": "Bananasauru5rex",
              "created": 1526384585,
              "upvotes": 23,
              "replies": {
                "dz0ihtg": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0ihtg/",
                  "text": ">Or, like, what would your response be if someone said that racism or sexism exist in academia? Of course it is often different than the non-academic world, but it's also a beyond obvious fact that these are all huge problems in academia, and, as the parent commenter put it, often express themselves differently in academia, which, I suppose, probably leads to these problems being unrecognized and invisible.\n\nThis kind of thing happened in a local (non-academic) sub. A poster's trans friend was coming to visit and they wanted to take the town temperature. Lots of commenters were saying no one would ever bat an eye at or mistreat someone who is trans. A trans person responded along the lines of, \"I guess you aren't trans. I am and have had people discriminate against me here.\" Cue the \"did you just assume my gender, shitlord?\" responses. Of course, she then was called a tr/nny, a man in a dress, too sensitive, responsible for her own discrimination because she's clearly just a terrible customer, etc. by the same people who had just been waxing poetic about their sweet, liberal, trans-friendly town. It's interesting to see the academic (attempt at being more \"respectful\"/smarter) version happening here. Instead of \n\n> did you just assume my gender, shitlord?\n\nwe have \n\n>...you are betraying your own prejudices by simply assuming that all those voicing opinions you happen to dislike are in the 'other' group from you.\n\nWhile some might say\n\n> you're clearly the problem\n\nWe see\n\n> You are harming a good cause with stuff like this.\n\nAnd instead of \n\n> you're just too sensitive\n\nwe get\n\n> By making excessively exaggerated claims like this, you are weakening your stance and make people less likely to believe you on other issues.\n \nAnd in review, someone with first-hand knowledge on this topic said, \"I've experienced just as much discrimination in academia as I do in the 'real world,' as have my trans academic friends, it's just of a different variety.\" They were then accused of crying wolf, exaggerating, hurting the \"cause,\" and written off with absolutely zero evidence. Anyway, all this to say I appreciate your response. ",
                  "author": "lepa",
                  "created": 1526391092,
                  "upvotes": 13,
                  "replies": {}
                }
              }
            }
          }
        },
        "dyzzpy3": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzzpy3/",
          "text": "It shouldn't be at all unusual to see mostly cis people answering the question. First, the percentage of trans academics is small, and second, how many of that small number of trans academics are subscribers to AskAcademia?",
          "author": "qthistory",
          "created": 1526357933,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "dyzmjx5": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzmjx5/",
      "text": "I have met a few from other labs and worked with a few personally. They rarely have any issues and mostly it comes to be misuse of pronouns that are quickly rectified by a one or two sentence interaction. As long as you do your research and aren't a prick, issues tend to not arise. Though everything I have seen/heard has been second hand. There may have been actual issues that were not discussed because of personal reasons. ",
      "author": null,
      "created": 1526343599,
      "upvotes": 4,
      "replies": {}
    },
    "dyzdk7c": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzdk7c/",
      "text": "I know two UG students who transitioned during their degree this year. As far as I can tell they’ve been treated exactly as before, and I’ve had specific discussions with people in our admin team to figure out how we ensure they aren’t deadnamed or otherwise. As a department we’re also looking into ways of raising awareness among staff, particularly older staff, of trans students, pronouns etc.",
      "author": "ardbeg",
      "created": 1526334133,
      "upvotes": 3,
      "replies": {
        "dyzfiem": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzfiem/",
          "text": "What do you think the state of how older staff think is like right now? Given that you’re trying to improve it I mean.",
          "author": "tossawaytransasker",
          "created": 1526336047,
          "upvotes": 3,
          "replies": {}
        },
        "dyztbem": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyztbem/",
          "text": "Raising awareness, or ensuring compliance with an ideology?",
          "author": "terfmermaid",
          "created": 1526350707,
          "upvotes": -8,
          "replies": {}
        }
      }
    },
    "dyzyewf": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzyewf/",
      "text": "I'm assuming you're US based. I only have experience in NZ and Australia institutions, and I'm a straight cis white dude so what do I know about this. I am in genetics/biochem and the places I've worked at i've only ever seen very positive support for the LGBTQ\\+ community. One University was rather indifferent, and just treated you like anyone else \\(from what I could see anyway\\).\n\nMy current one had a celebration when same sex marriage was legalised and has a very active LGBTIQA\\+ community. The home page of our intranet is currently advertising IDAHOBIT \\( International Day Against Homophobia, Transphobia and Biphobia\\) and is putting on a few seminars about inclusive spaces etc and I'm currently in a pilot study for an inclusive leadership program. So they try very hard to be inclusive, although i can't personally speak to it's efficacy, my friends have had no problems at all being accepted as a serious scientist.",
      "author": "Ducks_have_heads",
      "created": 1526356194,
      "upvotes": 2,
      "replies": {}
    },
    "dyzzn19": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzzn19/",
      "text": "I know someone transgender in this field that was in a PhD program a few years ago. Send me a pm if you would like to speak with her, I'm sure she would be happy to talk to you. ",
      "author": "Onefroginapond",
      "created": 1526357818,
      "upvotes": 2,
      "replies": {}
    },
    "dz071vo": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz071vo/",
      "text": "This doesn't answer your question but Julia Serano (http://www.juliaserano.com/biologist.html).",
      "author": "Pretty_Critter",
      "created": 1526371174,
      "upvotes": 2,
      "replies": {
        "dz1zyud": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz1zyud/",
          "text": "Oh yeah, I've seen some of her stuff mentioned places, but haven't read it myself. I'll look into her more too. I didn't realize she was a biologist too. Thanks!",
          "author": "tossawaytransasker",
          "created": 1526441561,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "dz072i5": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz072i5/",
      "text": "Some quite big names in my field (CS/Discrete math) got behind (ie blogged supportively about) the  LGBTQIA meeting at Eurocrypt and there are calls to have a similar event at STOC etc.\n\nSlightly tangential but ACM now has a proper code of conduct that includes sections on harassment and the last time I submitted to an ACM conference the reviewing was double blind. I am not 100% behind double blind peer review as it happens, but it shows a willingness to consider issues that obviously disproportionately affect people who might be marginalised in some way.\n\nOf course, I don't imagine this will solve every problem but there are support structures at least.",
      "author": "l_lecrup",
      "created": 1526371214,
      "upvotes": 2,
      "replies": {}
    },
    "dz0p20i": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0p20i/",
      "text": "[deleted]",
      "author": null,
      "created": 1526397568,
      "upvotes": 2,
      "replies": {
        "dz208ii": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz208ii/",
          "text": "Cool, that's good to hear. Thanks for sharing her experience!\n\nIf you're comfortable sharing, what's your general location? Like I've heard it's pretty different in the Northeast to the South for example.",
          "author": "tossawaytransasker",
          "created": 1526441865,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "dz0w8o4": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0w8o4/",
      "text": "[removed]",
      "author": null,
      "created": 1526403827,
      "upvotes": 2,
      "replies": {
        "dz20ku0": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz20ku0/",
          "text": "Cool, that's good to hear! Thanks!",
          "author": "tossawaytransasker",
          "created": 1526442268,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "dz18hyp": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz18hyp/",
      "text": "For what it’s worth, I’m a successful transfemme/nonbinary academic in STEM who graduated and is in the first year of a competitive industry postdoc.\n\nI didn’t notice academia being particularly better or worse than any other part of society. People screwed up my pronouns and I lost friends, but at the same time didn’t face any kind of violence or blatant discrimination. It also doesn’t seem to have affected my publishability or employability.\n\nI wouldn’t hold off on transitioning just because you’re in academia. I would very much look into seeing if you can form a support network at school though. See if your school has support groups for trans students, figure out whether student affairs has policies in place in case you face discrimination, and try to socialize with other grad students in and out of your department. Transition isn’t easy no matter where you do it. Good luck, and stay safe.",
      "author": "DarklingAalis",
      "created": 1526414642,
      "upvotes": 2,
      "replies": {
        "dz20qdl": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz20qdl/",
          "text": "It's good to hear that you've been able to be successful! And I was more concerned about impacts on things like employability than more overt stuff, so it's especially good to hear you haven't had problems with that. \n\nOk, I haven't really been using the resources at my undergrad much, but I'll look into the ones at my grad school.",
          "author": "tossawaytransasker",
          "created": 1526442457,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "dz1m3ix": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz1m3ix/",
      "text": "Academia is generally accepting and more focused on what you can offer ... academically, but someone will have a problem, whether it be students, peers or a professor. Stay professional, document incidents and you'll be fine. ",
      "author": "da_borg",
      "created": 1526427810,
      "upvotes": 2,
      "replies": {}
    },
    "dyzqs7m": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzqs7m/",
      "text": "For what it's worth, I am a cis grad student in computer science and I know several trans women and gender non-conforming folks in my academic network who are open about their gender identity. I don't know any of them super well, so I don't know exactly what their experiences have been, but they have been successful professionally from what I've seen. Good luck!",
      "author": "lambda_schmambda",
      "created": 1526348109,
      "upvotes": 2,
      "replies": {}
    },
    "dyztds5": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyztds5/",
      "text": "I can't speak from personal experience because I'm cis, but I do know that several faculty in my department (chemistry/biochemistry) don't \"believe\" in LGBT identities. One even has a lesbian daughter and he's just in total denial of it. \n\nI will mention that I do live in the Bible belt of the US. These specific scientists (there are two of them that I know about) are also avid church goers. I think this is an issue more likely to happen in the Southeastern US, as I only saw very progressive people in Midwestern and northern schools.",
      "author": null,
      "created": 1526350774,
      "upvotes": 2,
      "replies": {
        "dyztwpj": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyztwpj/",
          "text": "Do you know approximately what proportion of the faculty hold that belief? Is it like everyone or only a couple people?\n\nAnd hmm, the school I'm going to is in the southern half of the US, but I'll be in a big city, so I'd hope that that could help somewhat. ",
          "author": "tossawaytransasker",
          "created": 1526351319,
          "upvotes": 2,
          "replies": {
            "dyzucpr": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzucpr/",
              "text": "It is a minority of the FACULTY for sure, but I have a lot of really special students. Depending on how you transition, you may or may not have issues with students that you TA. We had an issue last year in our department with a MTF. The chair of the department kept having female students complain any time she would go to the women's bathroom because she didn't look very female. They kept saying there was a man using the women's restroom.\n\nI have another student though, FTM, who nobody would second guess he has a huge pair of testicles. Nobody has ever said anything about him, because nobody suspects him of having ovaries. ",
              "author": null,
              "created": 1526351776,
              "upvotes": 4,
              "replies": {
                "dyzuqkr": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzuqkr/",
                  "text": "Wow, that definitely highlights the importance of passing I guess. I'll definitely take that into account, thanks!",
                  "author": "tossawaytransasker",
                  "created": 1526352179,
                  "upvotes": 2,
                  "replies": {
                    "dyzuxld": {
                      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzuxld/",
                      "text": "Ultimately, I don't feel like you would be *unsafe* or anything, but I could see you having to deal with assholes. My very passing FTM student refused to take certain professors because he was afraid they would use his dead name in class (before he was able to get it legally changed). ",
                      "author": null,
                      "created": 1526352377,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "dz05oay": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz05oay/",
      "text": "I always find these comments interesting.\n\nAmericans may a big deal about things. Western Europeans don't really care. We have male faculty that wear lipstick in biochem/microbio where I work, no one really cares. Also, some that would probably be considered non-binary.\n\nIs it really that uncommon?",
      "author": null,
      "created": 1526368114,
      "upvotes": 3,
      "replies": {
        "dz219qy": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz219qy/",
          "text": "I mean, it's like 0.3-0.7% of the population that are trans (depending on state), so I wouldn't be surprised if many smaller departments don't have even a single trans person in them. And people always tend to be more unaccepting of people who they don't have much real contact with. ",
          "author": "tossawaytransasker",
          "created": 1526443125,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "dyznmkk": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyznmkk/",
      "text": "Don't make it your entire personality and no one will care. Best of luck!",
      "author": "feistyrooster",
      "created": 1526344777,
      "upvotes": 1,
      "replies": {
        "dyznqjx": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyznqjx/",
          "text": "I definitely won't! I'd prefer if as little attention were placed on it as possible personally. Thanks for the advice!",
          "author": "tossawaytransasker",
          "created": 1526344898,
          "upvotes": 3,
          "replies": {
            "dyznyox": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyznyox/",
              "text": "Sounds great :-) I'm also in a biology related field as a 4th year PhD student. We welcome newcomers! It's a long road ahead but keep at it and it'll be worth it. Do you want to stay in academia after grad school? ",
              "author": "feistyrooster",
              "created": 1526345147,
              "upvotes": 2,
              "replies": {
                "dyzp7fv": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzp7fv/",
                  "text": "I'm not sure. I'm definitely interested in doing research, but industry also seems appealing. Or maybe even a biotech startup. Especially because I like doing research that creates real things. I've worked in an academic lab during my undergrad since my freshman year and I like it, but I also worked at a biotech company as an intern in their R&D department over a summer and I liked that too. It's a decision I'll strategically put off until later I suppose.",
                  "author": "tossawaytransasker",
                  "created": 1526346489,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "dyzt6vy": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzt6vy/",
      "text": "Do what you will, as long as you remember that others may not share your understanding of what gender *is*. There is nothing 'phobic', or necessarily conservative about this. ",
      "author": "terfmermaid",
      "created": 1526350575,
      "upvotes": 3,
      "replies": {
        "dyztomy": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyztomy/",
          "text": "Oh yeah, I absolutely would never want to force my own ideas on someone else. I'm mainly looking for information from people who know more than me so that I can make an informed decision based on the potential costs (mainly social) and benefits (mainly psychological).\n\nAnd I'm assuming that you're one of the people who doesn't share what my idea of gender is? (Based off of your username, sorry if it's an inaccurate assumption)\n\nSo would you mind sharing what your understanding of gender is so I can see how it's different from mine and maybe learn from it? If you don't want to that's ok too, but I am curious and I do think that it could be helpful for me to see and understand your perspective better.\n\nThanks for the input!",
          "author": "tossawaytransasker",
          "created": 1526351088,
          "upvotes": 7,
          "replies": {
            "dyzu5u7": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzu5u7/",
              "text": "Wow, I'm impressed by your response (in a not-remotely-condescending way, I promise.) I understand how deeply felt people's sense of gender identity can be... and I sympathise with gender dysphoria, or the feeling of just not fitting expectations of what a woman is supposed to be. Problem is I don't quite believe that gender is an 'identity' per se.\nI believe however that \na) Having a female reproductive system is a rather important, material fact of life. It's pretty decisive about your life experience, whether or not you choose to use it. However, *it doesn't need to mean anything else about you than that.* It doesn't mean you have to be feminine. But femininity ≠ womanhood.\nb) Femininity is an oppressive social construct to prop up masculinity anyway. You don't have to conform to femininity as a woman. *Not* conforming to femininity doesn't make you a man or 'non-binary.'\nc) Having gender dysphoria can have all manner of causes, especially in this patriarchal world. But it doesn't follow logically that you *must* be a man if you feel horrible about being a woman. \n\nUnder patriarchy, women have been forced into a little box. We don't *know* what women would be like outside of that. Whatever you choose to do I wish you the best, but I hope you know that you can be a woman and be whatever kind of woman you want. And what's more, you can challenge people's expectations of how a woman is supposed to be.",
              "author": "terfmermaid",
              "created": 1526351581,
              "upvotes": 1,
              "replies": {
                "dyzvv40": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzvv40/",
                  "text": "Ha ha, ok, I'm glad you're impressed I guess.\n\nSo just to make sure I'm understanding what you're saying, woman is an innately biological idea meaning someone who has a female reproductive system (Is it based on the function of it? Because what about women with nonfunctional reproductive systems? They seem like they'd still be women, even without a reproductive system?) femininity is a social construct that exists in opposition to masculinity to emphasize it, and gender dysphoria has a variety of causes but does not necessarily have the single solution of transitioning\n\nIs that right? I feel like I didn't completely understand your first point because it doesn't quite make sense to me. But you seem like you have pretty well thought out views, so I think that's more likely an issue with my understanding than your view itself. \n\nAnd yeah, that's a good point, it reminds me of some of the examples I've seen in other cultures where stereotypes are different and we see people displaying different preferences to what we have here (ie women were more assertive than men on average). So then we assume that what exists here is natural, but really a lot of it is probably the result of cultural effects rather than innately biological things.\n\nAlso, I think you might have a misunderstanding that I was assigned female at birth and looking to transition to male. I'm assigned male at birth and considering transitioning to female. And I've heard that people who share some of your beliefs might be a lot less sympathetic to people like me than people who are like what you thought I was, but I hope you don't dismiss me outright, I am actually trying to understand your perspective. I didn't want you to misunderstand though.",
                  "author": "tossawaytransasker",
                  "created": 1526353357,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "dz0pca7": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0pca7/",
          "text": "You're in an academic subreddit. There are good academic definitions of sex and gender, and there certainly are wide disagreements, but trans-exclusionary definitions are not among them.",
          "author": "Bananasauru5rex",
          "created": 1526397831,
          "upvotes": 4,
          "replies": {
            "dz160pt": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz160pt/",
              "text": "There are, however, perfectly legitimate variants of academic queer/feminist theory that view sex and/or gender categories as *per se* oppressive and thus aspire to the abolition of gender as their ultimate goal. That's compatible with a *queer* trans-inclusive politics, but it's also in tension with *mainstream* trans-inclusive politics which affirm that one's gender identity is or should be an expression of one's authentic self. To be clear, I agree that no credible academic theory justifies disrespect or discrimination against trans people, just saying that drawing the line between disrespect and disagreement can get a little messy.",
              "author": null,
              "created": 1526412425,
              "upvotes": 3,
              "replies": {}
            },
            "dz1fmik": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz1fmik/",
              "text": "Yeah sure. There is a good reason why there are still a hell of a lot of radical feminists in academia: we've got reason on our side.",
              "author": "terfmermaid",
              "created": 1526421190,
              "upvotes": 2,
              "replies": {}
            },
            "dz1fqb1": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz1fqb1/",
              "text": "PS. You seem to have forgotten how trans  ideologues conflate sex and gender. 'Lesbians must sleep with me because my penis is female' etc.",
              "author": "terfmermaid",
              "created": 1526421293,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "dyzvxdo": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzvxdo/",
      "text": "Cis male, social sciences. Had a MA student my first year as a phd student. Started a phd in a different dept after the MA, and transitioned after the fact. (Still salty the grad committee didn't let them into the phd program, but they went to a better dept for their phd, so egg's on our dept's face.) To my knowledge, the rejection was in no way related to gender/sexual identity or expression, but research/methods foci and lack of advisor fit. \n\nFurther, AFAIK hasn't impacted their career trajectory. Shifted to a more androgynous nickname at the new dept., and hadn't published previously -- at least, not peer reviewed, so no concerns re: the lost pubs.\n\nSorry I don't have more interesting insight. But I guess I can add to the chorus of allies saying, \"go you!\" and that my limited experience suggests tolerance and, if anything, it being totally irrelevant to many profs, for whom your self worth should entirely be derived from the quality of your schoolwork 😂😂😂.\n\nBest of luck! Seconding the statement earlier that grad school sucks, and often will make you feel super worthless and exhausted. The worst thing you can add to that is being uncomfortable with who you are as a person. So, be your authentic self and good grad school work will follow. The other way around is a recipe for unhappiness! ",
      "author": "Jack-ums",
      "created": 1526353424,
      "upvotes": 2,
      "replies": {
        "dyzx01w": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzx01w/",
          "text": "Oh cool, that also sounds promising to hear a story like their's!\n\nAnd no problem, that is interesting insight! I appreciate every story that someone posts!\n\nLol, I feel like deriving all self worth from schoolwork has other problems, but less related to this post.\n\nHa ha, I'll definitely expect the worst going in (and probably have my expectations surpassed in suckiness). \n\nThanks for the encouraging words!",
          "author": "tossawaytransasker",
          "created": 1526354581,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "dyz6xpz": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyz6xpz/",
      "text": "If you're in the U.S., I imagine that you'll be treated with the same respect as any other person (Aside from the occasional bigoted piece of garbage that you can't avoid.) \n\nI guess it would depend on the area of the country as well, but I'd really be appalled if any place of higher education treated you any differently than anyone else. This is coming from a New Yorker here, so my area is very liberal in this regard, my opinion might be skewed.\n\nThis second part doesn't come from personal experience, but I listen to a podcast that had a trans scientist as a guest (I believe it was biology or chemistry, but I really don't remember.)\n\nIn her experience, iirc the biggest issue with transitioning was how to deal with the change of name between previously published papers and papers that will be published in the future. \n\n\n",
      "author": "NervousTumbleweed",
      "created": 1526328024,
      "upvotes": 1,
      "replies": {
        "dyzb2yo": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzb2yo/",
          "text": "Out of curiosity, do you remember what that podcast was and what episode it was? I might be interested in listening to it, and thanks for the advice!",
          "author": "tossawaytransasker",
          "created": 1526331800,
          "upvotes": 2,
          "replies": {
            "dyzbdpi": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzbdpi/",
              "text": "No idea what the particular episode was, but it was on Harmontown. The person in questions name is Jane, they’re a guest on several episodes so I’m not sure exactly which one they discuss their career on.",
              "author": "NervousTumbleweed",
              "created": 1526332080,
              "upvotes": 3,
              "replies": {
                "dyzbhl8": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzbhl8/",
                  "text": "Thanks! I’ll check it out, I’m always looking for new good podcasts too, so that’s a plus.",
                  "author": "tossawaytransasker",
                  "created": 1526332182,
                  "upvotes": 2,
                  "replies": {
                    "dyzbn4x": {
                      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzbn4x/",
                      "text": "It’s a great one! Start at the earlier episodes, people have been kinda bummed out post-election",
                      "author": "NervousTumbleweed",
                      "created": 1526332331,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "dyzplu2": {
      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzplu2/",
      "text": "I can't personally speak to the experience of being a trans person in biology, but I finished my degree in 2015, and I've been working as a postdoc since.\n\nAcademia has a some bigoted people in it. It's also incredibly challenging, intellectually, psychologically, socially, and financially.\n\nI'm a white, cis, hetero, man, and I've been shouted at, insulted, put down, called stupid, lazy, and a few other choice terms. In my first year in a PhD, I rotated through five labs before I found one that would take me. After the fifth lab rejected me and I thought I had scrubbed out, I just went to my car and cried for half an hour. \n\nI guess what I'm saying is that neither going into or staying out of academia is going to protect you from bad treatment. If you can deal with it, then you get to do what you love. ",
      "author": null,
      "created": 1526346908,
      "upvotes": 2,
      "replies": {
        "dyzq8h9": {
          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzq8h9/",
          "text": "Thanks for sharing your experiences, I really appreciate it.\n\nFor me the question is more of whether the social costs of transition are worth the benefit. Because I don't have super severe dysphoria (like people who are depressed, anxious, or even suicidal because of their dysphoria) I'm not sure whether transition is worth it for me personally. I'm definitely not giving up on my career, and I'm less afraid of getting yelled at or something and more afraid of people being less likely to help me or advise me or hire me. (Though I would prefer not to get yelled at of course)\n\nSo I'm trying to do a cost-benefit analysis type thing so I can make a good choice and I'm trying to gather information now. I've heard a lot of horror stories about grad school and I hope to avoid them, but I think I'm prepared (That's probably just until I actually start and realize I am far less prepared than I think I am ha ha). And I guess I'm mostly concerned with the difference between presenting as a cis man and a trans woman rather than the raw struggle values of each of them.\n\nAnd thanks again for helping!",
          "author": "tossawaytransasker",
          "created": 1526347556,
          "upvotes": 3,
          "replies": {
            "dyzr269": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzr269/",
              "text": "FWIW I wish this were a world where you didn't have to worry about how you'd be treated for presenting in a way that makes you comfortable. \n\nI know there are a lot of good people in science too. Hopefully you find the good people and get to work with them.",
              "author": null,
              "created": 1526348402,
              "upvotes": 3,
              "replies": {
                "dyzratz": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzratz/",
                  "text": "Yeah, I am hopeful that we're moving more towards a world like that over time \\(at least for gender\\). \n\nThanks! I hope you're doing better than that low in your first year of your PhD! And hopefully you do even better in the future, you seem like a cool guy.",
                  "author": "tossawaytransasker",
                  "created": 1526348644,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "dz0phnm": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz0phnm/",
              "text": ">  (Though I would prefer not to get yelled at of course)\n\nGetting yelled at in graduate school is very unusual and I haven't heard of it happening at either of the schools I've been to. That's not to say that it doesn't happen though since some fields can get very \"energetic\" during defenses. However, I'd be very surprised if someone got though graduate school and was never put down or insulted in some way. That's just the nature of the beast and I lost count of the times that my work has been put down or insulted in someway. Generally the insults will be limited to your work, but sometimes it can cross over that line to where it is personal. It also tend to happen more if there is a major intellectual rivalry going on between field, method, or interpretation A vs. competing B. Remember: people get very invested in defending their life's work.",
              "author": "ManInBlackHat",
              "created": 1526397964,
              "upvotes": 2,
              "replies": {
                "dz20ewu": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dz20ewu/",
                  "text": "Hmm yeah, thanks for the info. It makes sense that people would be likely to get really invested in arguments and stuff like that when it relates to something they've spent a lot of time on and are emotionally attached to. And of course I wouldn't expect to never be insulted, I'm more comparing it to the baseline of if I presented as cis and how much difference would there be. (But more constructive criticism might actually be helpful lol)",
                  "author": "tossawaytransasker",
                  "created": 1526442071,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "dyzteh2": {
              "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzteh2/",
              "text": "You don't have to become a man to express your gender in a way people read as 'masculine' though? Why do it if you don't have to? It wouldn't really change who you *are*.",
              "author": "terfmermaid",
              "created": 1526350793,
              "upvotes": 4,
              "replies": {
                "dyzuk18": {
                  "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzuk18/",
                  "text": "Yeah, I totally agree that people's gender expression isn't determined by their gender identity, and people can present as more masculine or feminine regardless of their gender. For me it's less about that \\(I think my behavior wouldn't change too dramatically with or without transition. It's partly based on physical dysphoria \\(the effects of hormone replacement therapy seem really appealing to me\\) and alleviation of some measure of mental distress \\(which causes me to spend a lot of time thinking about stuff like this\\). \n\nAnd I would hope it doesn't change who I am deep down! I'd rather still be me \\(defining me as my psychological self at least\\) than become someone else, and I wouldn't plan to act much differently \\(except due to differing social pressures, which would obviously affect me in ways I can't really predict\\). And I understand of course my chromosomes wouldn't change, but that matters a lot less to me than my physical body \\(in terms of physical sex I mean, I'd value my mind over both of those of course\\). So it's less about becoming something I'm not and more becoming comfortable with my body and myself. I don't know if that makes sense?",
                  "author": "tossawaytransasker",
                  "created": 1526351988,
                  "upvotes": 3,
                  "replies": {
                    "dyzv32y": {
                      "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzv32y/",
                      "text": "It does make sense. I would hope for you that hormones etc. would help your dysphoria *but* I doubt they're the only way, and I'd be worried about the long-term health risks. Moreover, the effects are largely not reversible. I think it's really important to ask yourself if there might be any other reason for your feelings of dysphoria than that you might be a man. \n\nI think it's also important to look critically at transgender discourse. It seems so often that explanations have recourse to oppressive gender stereotypes. *And* you're likely to notice that the voices of trans women are foregrounded over those of trans men, suggesting that male privilege cannot so easily be acquired or divested of. ",
                      "author": "terfmermaid",
                      "created": 1526352533,
                      "upvotes": 3,
                      "replies": {
                        "dyzwpdw": {
                          "link": "/r/AskAcademia/comments/8jeumv/transgender_in_academia/dyzwpdw/",
                          "text": "Hmm, I know what you mean. I'm mostly looking at hormones because they seem to be the most effective method for alleviating dysphoria and transition is the only method that I've seen be effective in the medical and psychological journals I've looked at. \n\nDo you know of other treatments that have been proven to be effective?\n\nWhat do you mean the explanations recourse to gender stereotypes? Could you elaborate on that? I feel like I'm probably blind to what you're talking about there due to being part of the subject and of course my own biases.\n\nAnd yeah, I do see what you mean. I wonder how much of that is bias in the voices that are foregrounded and how much is based more on the trans women being taught that it's ok to speak up more than the trans men. (I'm not sure I'd consider that male privilege exactly, because when I think of male privilege it's more of a social benefit. Do you think that counts as male privilege?) And yeah, I would suspect that for non-passing trans people they have the gender role and expectations of their assigned birth gender pushed on them regardless of identity. But it also seems like that privilege would be acquired/lost if the trans person is passing, right? ",
                          "author": "tossawaytransasker",
                          "created": 1526354256,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}