{
  "sid": "6wuukw",
  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/",
  "title:": "\"I'm at a top X university / program...\"",
  "text": "Just stop. No one cares, and this ridiculous dick measuring that goes on with people starting their post this way is getting really irritating.\n\nI've seen maybe two posts here where knowing the ranking of a program or university of a poster actually mattered.\n\nOtherwise, it's just pointless.\n\nPractically every poster feels the need to include that he or she is at a top something or other program. You're not all at top programs. If you are-- based on some of the questions you're asking-- I can assume that your top programs are doing a shit job of preparing you for actual positions.\n\nStop.\n\n(**Edit:** to clarify, I'm not saying program and university rankings don't matter at all. They can and do. But I'm saying that the problems detailed in the posts here for the most part in no way are dependent on university rankings.)",
  "author": "deaconblues99",
  "created": 1504046149,
  "updated": 1634080674,
  "over_18": false,
  "upvotes": 210,
  "upvote_ratio": 0.87,
  "comments": {
    "dmb8ktt": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb8ktt/",
      "text": "Can I please continue to start my posts with, \"I'm at a mediocre college in a largely-ignored program\"?",
      "author": "FGF10",
      "created": 1504060526,
      "upvotes": 150,
      "replies": {
        "dmbfanw": {
          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbfanw/",
          "text": "I'm going to start mine with \"I'm at a community college, so I believe you are legally allowed to run me over with your car and sell my hair.\"",
          "author": null,
          "created": 1504071036,
          "upvotes": 85,
          "replies": {}
        }
      }
    },
    "dmayn6z": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmayn6z/",
      "text": "I'm at a third tier university where no one is expected to get a job upon graduation from the graduate program because we lack the name recognition, even though within my field of study, its research is some of the best coming out of north america.\n\nLoving every minute.\n\n/end dick measuring",
      "author": "bitparity",
      "created": 1504047932,
      "upvotes": 70,
      "replies": {
        "dmaz06o": {
          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmaz06o/",
          "text": "I went to a good (but not at all top-ranked... I honestly have no idea what its rank is) public university for my PhD, with an awesome advisor who I'm still close friends with.\n\nI have a tenure track job at a smaller regional public university now, and I love where I live, what I do, and even when I'm stressed I'm still happy.\n\nPeople posting about how highly ranked your university / program is... It really doesn't matter. How far you go will have more to do with what you do and your connections than the ranking of your university.  ",
          "author": "deaconblues99",
          "created": 1504048392,
          "upvotes": 31,
          "replies": {
            "dmbkbjf": {
              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbkbjf/",
              "text": "<bro fist>\n\nMid-tier PhD here, tenured at mid-tier health science university masquerading as a lib arts college. And \"mid-\" is just something I say but have no actual idea about. My PhD was hard, tenure was hard, and research is hard. But I love my colleagues and my students. \n\n",
              "author": "AerosolHubris",
              "created": 1504083372,
              "upvotes": 13,
              "replies": {
                "dmbkej7": {
                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbkej7/",
                  "text": "Exactly. I almost feel like we should have another thread in here detailing what does matter... And I would not totally discount program / university rankings, but I would put *major* footnotes / provisos on that. \n\nIn the meantime, getting a job in academia is hard, and requires preparation during a grad program that people often don't do or get until it's too late.\n\nMaybe we need a straight up panel discussion here or elsewhere: how to go about getting a tenure track job in academia.\n\nCould be interesting.",
                  "author": "deaconblues99",
                  "created": 1504083615,
                  "upvotes": 8,
                  "replies": {
                    "dmbn1s8": {
                      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbn1s8/",
                      "text": "> In the meantime, getting a job in academia is hard, and requires preparation during a grad program that people often don't do or get until it's too late.\n\nI would be extremely interested in hearing what this preparation involves, if you're willing to write it up. ",
                      "author": "Eltargrim",
                      "created": 1504090947,
                      "upvotes": 6,
                      "replies": {}
                    },
                    "dmbv4qc": {
                      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbv4qc/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1504103261,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "dmbv85p": {
              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbv85p/",
              "text": "I'm at a \"meh\" school that, due to its need for that tuition money, seems to be trying to plummet to the bottom of any rankings. A few admins are horrified by my very existence. But my colleagues are great and as long as I keep my head down and meet my teaching requirements they let me research whatever the hell I want, so I'm okay with my gig. Would I love the salary and prestige of a top-tier university? Of course. But the interpersonal politics and dick-measuring of academia have left me so jaded that I think I might actually prefer this. ",
              "author": "DocHorrorToo",
              "created": 1504103367,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "dmbolwj": {
          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbolwj/",
          "text": "[deleted]",
          "author": null,
          "created": 1504094196,
          "upvotes": 5,
          "replies": {
            "dmg3i78": {
              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmg3i78/",
              "text": "How???",
              "author": null,
              "created": 1504307845,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "dmb8pno": {
          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb8pno/",
          "text": "Does \"no one is expected to get a job upon graduation\" refer to tenure-track jobs or are you actually expecting to become unemployed?",
          "author": "bike0121",
          "created": 1504060704,
          "upvotes": 1,
          "replies": {
            "dmbbf42": {
              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbbf42/",
              "text": "Tenure track.  We all know the state of academia, and we also know that despite the connections of some good faculty, the tier of our school is simply too low to be considered for many job applications.\n\nI think our department has only had 1 phd out of... the last 50 I'd say get a tenure track job.\n\nI myself am tooling my PhD skills to work in the private sector, or the government.",
              "author": "bitparity",
              "created": 1504064463,
              "upvotes": 3,
              "replies": {
                "dmbqulx": {
                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbqulx/",
                  "text": "For my personal curiosity: if you and your fellow students know this to be the case, why are y'all still pursuing the PhD at that institution?",
                  "author": "riggorous",
                  "created": 1504097810,
                  "upvotes": 3,
                  "replies": {
                    "dmbvlwc": {
                      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbvlwc/",
                      "text": "For me, because this is my second \"career\" (i already had a work career previously) and i love every god damn minute of my research, my peers, and my professors.  I also think, given my past work experience, I might be better suited toward tooling the PhD toward a job elsewhere than others with only experiences in this field.\n\nFor others, I think it's because they like the field, they like teaching it, but also a little because they haven't been trained to do anything else, so they've proceeded in it out of a certain momentum.  They're aware of the difficulties, but the graduate system doesn't prepare them for many other options once they're locked into it.\n\nWhich as we all know from this subreddit, is a main failing of academia.",
                      "author": "bitparity",
                      "created": 1504103801,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "dmeofpp": {
          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmeofpp/",
          "text": "Religious studies high five!",
          "author": "mormoerotic",
          "created": 1504232402,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "dmbt0rk": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbt0rk/",
      "text": "This isn't a problem that is unique to AskAcademia, unfortunately.  Or Reddit, for that matter.\n\nHowever, I imagine that some people might list their program ranking (or \"ranking\") sort of reflexively because they're so used to getting shit about their choice to pursue a PhD by people outside the academy, and having their problems invalidated by people who don't get it (\"if you hate it so much, just leave!  Your school sucks anyway, blahblahblah\").  \n\nMaybe people think mentioning their credentials they are when posting will mitigate this.  That they'll be given more constructive advice than \"give up and get a real job\" if they give the impression that their program is legit, and one that could put them on the path to a tenure-track position.",
      "author": null,
      "created": 1504100745,
      "upvotes": 14,
      "replies": {}
    },
    "dmb6pq7": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb6pq7/",
      "text": "I'm tempted to start talking about \"a top 13.41987231 university\"",
      "author": "diazona",
      "created": 1504058130,
      "upvotes": 7,
      "replies": {
        "dmbh0hf": {
          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbh0hf/",
          "text": "Would \"ranked 97th out of 100 but tied with 12 other institutions for 97th place\" work too?",
          "author": "tah_infity_n_beyarnd",
          "created": 1504074658,
          "upvotes": 12,
          "replies": {
            "dmbhtkx": {
              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbhtkx/",
              "text": "That might be a little too realistic ;-)",
              "author": "diazona",
              "created": 1504076548,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "dmb5kkn": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb5kkn/",
      "text": "I'm *not* at an ivy league or top 10 and I think it matters. Culturally and curricularly a ton of academia follows these schools. If you want to see what a state school will look like in 10 years look at harvard today.",
      "author": "freet0",
      "created": 1504056702,
      "upvotes": 18,
      "replies": {
        "dmbkc58": {
          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbkc58/",
          "text": "[deleted]",
          "author": null,
          "created": 1504083420,
          "upvotes": 2,
          "replies": {
            "dmbr1eu": {
              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbr1eu/",
              "text": "I think he/she is saying that state schools will ape whatever Harvard does, but there is a lag. Which is... a questionable statement to say the least.\n\nI would rephrase as: \"If you want to see what kind of nonsense state school administrators will be spouting in 10 years, look at the nonsense being spouted by administrators at Harvard today.\" \n\n:-) \n\nI don't think state schools will actually _look_ anything like Harvard (especially at the rate that public education is being defunded — you can't \"be Harvard\" without that cash flow, full stop). But I don't doubt they will try to _sound_ like Harvard (or some similarly \"top tier\" brand).\n\n(One of the best talks I saw — _while at an Ivy League university that rhymes with Marvard, har har_ — was from ASU President Michael Crow who explained, in detail, why ASU would never ape the Harvard model, because ASU would be idiotic to think that \"it worked at Harvard, it will work here\" because it is such a different school with so many different variables. I know that not everyone at ASU has agreed with Crow's specific policies or methods, but I think he's right on about that general sentiment. I am not even sure Harvard is the place you'd want to ape these days; they've got a strong brand, to be sure, and a lot of money, but there are a lot of negatives associated with how they do things as well.)",
              "author": "restricteddata",
              "created": 1504098082,
              "upvotes": 11,
              "replies": {
                "dmbr6cm": {
                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbr6cm/",
                  "text": "> \"If you want to see what kind of nonsense state school administrators will be spouting in 10 years, look at the nonsense being spouted by administrators at Harvard today.\"\n\nI see. Thanks. Yeah, different strokes for different folks. There are plusses and minuses to the US way of handling higher education with so many institutions, public and private. Resistance to sweeping change can be counted as both, I suppose.",
                  "author": "AerosolHubris",
                  "created": 1504098283,
                  "upvotes": 2,
                  "replies": {
                    "dmbrc38": {
                      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbrc38/",
                      "text": "> Resistance to sweeping change can be counted as both, I suppose.\n\nArguably resistance to change is baked into the DNA of universities — they are meant to be institutions that don't change much, making them, to some degree, inherently conservative. The downside of that is fairly obvious. The upside is less obvious: universities (unlike, say, private corporations) are expected to last for centuries, and that creates a different sort of risk profile. The average age of a Fortune 500 company today is something like 15 years, by comparison. The amount of prestige and age of the university in my experience correlates with their conservatism — the top Ivies are absolutely the hardest ships to change, because they have centuries of \"tradition\" that has, in a broad sense, paid off for them. \n\n(Whereas a place that sees itself as up-and-coming, like where I'm at now, is willing to try just about anything if it thinks it will pay off in the short term.)",
                      "author": "restricteddata",
                      "created": 1504098509,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "dmcbijh": {
              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmcbijh/",
              "text": "One example: my medical school recently began a new curriculum which uses the flipped classroom model. Basically lots of pre-class prep, but classes spend less time on lectures and more time on discussion.\n\nThis was started by higher ranking med schools and has now been adopted by many others. The same thing tends to happen culturally, with the ideas in 'top tier' academia (particularly the humanities and social sciences) trickling down to the rest.",
              "author": "freet0",
              "created": 1504120415,
              "upvotes": 1,
              "replies": {
                "dmcchk9": {
                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmcchk9/",
                  "text": "I see. Thanks for replying. I don't think such things necessarily come from the Ivy League, as some SLACs innovate with teaching methods that are then adopted by the bigger players, but I get your meaning.",
                  "author": "AerosolHubris",
                  "created": 1504121445,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "dmaxrn2": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmaxrn2/",
      "text": "I think the problem is that a lot of people new to academia *do* care, and what needs to be explained is that the raw prestige of a university is largely unimportant. What is far more important is the quality of your research, the quality of your efforts in learning and growing, and the quality of the relationships you form along the way. I'd rather be at a bottom 10 program working with a nice adviser who is strong and passionate in their field (whatever that may be), making good friends and growing and struggling *appropriately*, than to be at a top X program stuck in research I might not 100% care about, with an arrogant adviser, classmates that bully and condescend, and drowning in work. You have to be honest with yourself.",
      "author": "iron_textbook",
      "created": 1504046842,
      "upvotes": 52,
      "replies": {
        "dmb2k9o": {
          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb2k9o/",
          "text": ">raw prestige of a university is largely unimportant.\n\nHell fucking no. \n\nBelieve me, I *want* and would LOVE to be with you on this.\n\nRaw fact is that raw prestige matters enormously. New funding initiatives courtesy Mellon, Ford, or some other big foundation? Yeah, check out which institutions get it. New exploratory collaboration across some universities for some hot new research thingy? Check out which institutions get it.\n\n\"Quality of research, quality of bullshit\" = ALL of this depends on MATERIAL resources. Resources that some universities and departments happen to have more than others. \"Quality of relationships\" = It sure doesn't hurt when half your department is on the editorial boards of half the top journals in the field! Or when they've supervised the dissertations of basically every leading member of the field!\n\nThe nicest, most passionate advisor in a bottom 10 program isn't going to get shit done when it comes to it.\n\nPrestige matters as much as we can all wish it doesn't. Suggesting otherwise is indulging in fanciful denial, which we can ill-afford.\n\n>You have to be honest with yourself.\n\nIndeed.",
          "author": "PhD_sock",
          "created": 1504052924,
          "upvotes": 112,
          "replies": {
            "dmb3zv7": {
              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb3zv7/",
              "text": "Yeah, I feel like this divide is content specific. I'm in children's literature, and our programs are small in number and scattered everywhere--a lot of people in our field are actually librarians/other types of field practitioners! I'd take any university or college that would hire me. My husband, on the other hand, is a genetics researcher, has been at R01 schools for his entire career, and would have a difficult time doing his research without the funding that comes with a school of that level, because in biology the biggest grants are awarded to the top schools. \n",
              "author": "stainedglassmoon",
              "created": 1504054728,
              "upvotes": 37,
              "replies": {
                "dmb4la7": {
                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb4la7/",
                  "text": "It's definitely not just in biology. I'd wager *most* fields would find the big resources going to a handful of institutions. There was a major recent study that pretty much established that very few institutions produce the research that dominates the top journals across various disciplines, or something along those lines. And I recall another one about the distribution of faculty across institutions and where they got their PhDs, etc.\n\nTLDR I absolutely do not buy that institutional prestige should be disregarded. Idealistically, sure. Pragmatically, do it if you don't care about your own career I guess. ",
                  "author": "PhD_sock",
                  "created": 1504055467,
                  "upvotes": 23,
                  "replies": {
                    "dmbsd6y": {
                      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbsd6y/",
                      "text": "I'm not suggesting that as professionals, or people in PhD programs-- especially those seeking employment in the world of academia-- these things can be discarded.\n\nMy OP relates solely to the tendency of people to post-- apropos of almost nothing-- that they're in a such-and-such tier program, before posting a question that really doesn't have much to do with program rankings.\n\nNow, if someone posted a question like, \"I'm submitting dozens of applications for post-docs or tenure-track jobs and not getting a single callback, I'm at/in a ___-tier university / program...\" then I think we would want to know that. It would potentially be relevant there.\n\nBut asking whether or not (or how) you could ask for more money as a grad assistant (which was the most recent example of this that I recall)? University ranking really doesn't matter, because it's not a question that really pertains to ranking.\n\nI just want folks to stop posting that by default, and consider when it might actually be appropriate. Because it's irrelevant to the questions posted here, more often than not.",
                      "author": "deaconblues99",
                      "created": 1504099905,
                      "upvotes": 14,
                      "replies": {
                        "dmbzs8i": {
                          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbzs8i/",
                          "text": "Oh, I can definitely get on board with that. That kind of thing seems as silly as the whole \"I go to school in Boston\" thing.",
                          "author": "PhD_sock",
                          "created": 1504108277,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "dmc4169": {
                          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmc4169/",
                          "text": "A university that owns all the land between the Thames and the Cam is far more likely to have money for TAs than the University of North-Northwest Moose Factory.\n\nMay not make a difference in whether you can ask.  But it's not irrelevant.",
                          "author": "WilyDoppelganger",
                          "created": 1504112627,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "dmb51qc": {
                      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb51qc/",
                      "text": "I obviously don't think that there's any point in \"aiming low\", but I had numerous friends commit suicide because they couldn't get into a top 10 in their field. So much lost potential over so little.\n\nI'm in mathematics, and I just haven't sensed the same pressure for prestige as others might experience, so I definitely think that this argument might be content-specific to some degree.",
                      "author": "iron_textbook",
                      "created": 1504056037,
                      "upvotes": 10,
                      "replies": {
                        "dmbbusm": {
                          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbbusm/",
                          "text": "Yeah, that's obviously taking things to an extreme (not unfamiliar with that kind of extreme BTW, as things can get crazy in certain countries). \n\nOf course I don't mean to imply that one should just give up if one can't get into a top 10 institution, but I do want to push back against the idea that reputation/ranking/prestige do not matter. They continue to matter rather a lot. ",
                          "author": "PhD_sock",
                          "created": 1504065104,
                          "upvotes": 6,
                          "replies": {}
                        }
                      }
                    },
                    "dmbnans": {
                      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbnans/",
                      "text": "I didn't mean to imply that it was just biology, but I do think there's a split between fields that need a ton of space/materials/specific tech to do their research (science/medicine/engineering) and fields where you more or less need library access and a laptop (literature, history, potentially math?, computer science). Even the library access matters less these days than it used to, because of the internet (although it's still important, it's a lot easier to go to your librarian and be like 'I need this book' and they can get it for you in some form, even at small schools). So I wouldn't say most fields depend on prestige of institution, just the ones with the money in them lol. For the rest of us, it's prestige of publication (and that applies to science, too!). ",
                      "author": "stainedglassmoon",
                      "created": 1504091519,
                      "upvotes": 4,
                      "replies": {
                        "dmbzzbt": {
                          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbzzbt/",
                          "text": "> library access and a laptop (literature, history\n\nAhem, no. It's a good bit more than that.\n\nArchival materials. Rare collections (of musical instruments at Yale, for example). Imagine the number of dissertations over the decades that had their genesis in the holdings of Yale's Beinecke Rare Books and Manuscripts library, for example. Point being, institutions that have access to impressive archival materials and other collections (typically donated by wealthy alumni), including rare books & manuscripts, are all-around better places at which to pursue dissertations across the humanities. And, of course, the smaller institutions can't do this.",
                          "author": "PhD_sock",
                          "created": 1504108479,
                          "upvotes": 4,
                          "replies": {
                            "dmcam4g": {
                              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmcam4g/",
                              "text": "Unless you study a specific object present in your home collection, wouldn't you often rather need the money to travel to the said archives and collections? I mean, if you're a historian at Yale, unless you're studying the history of Yale, wouldn't you rather go to archives in a lot of places with the materials relevant for your study, if you see what I am driving at? Or if you're a classicist and need to make an edition, you wouldn't just use the manuscript present in your own library, but travel to libraries all over Europe to consult the manuscripts.",
                              "author": "NuclearWarhead",
                              "created": 1504119456,
                              "upvotes": 3,
                              "replies": {
                                "dmcirca": {
                                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmcirca/",
                                  "text": "Not necessarily; for instance if someone wished to pursue a dissertation on the Voynich Manuscript and they are a Yale student, then it's right there. It doesn't have to do with the history of the institution itself. Of course you would not *only* rely on the materials at the home institution, but basically my point was just that a richer collection enables a greater range of projects to be launched.",
                                  "author": "PhD_sock",
                                  "created": 1504128091,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "dmc4ee6": {
                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmc4ee6/",
                  "text": "Yup, as a clinical researcher being at a \"top\" program/hospital means I have the resources I need (and for my specific research into \"rare patients\" also a significant enough number of people. If I was in a small hospital else where I might only rarely be able to see the people I am interested in studying). \n\nBut OP is right in that most of the times asking (or answering) questions here is pretty much the same whether you are at a top school or not. ",
                  "author": "Drbananabeak",
                  "created": 1504113016,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "dmb4mwh": {
              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb4mwh/",
              "text": "How does one even determine how prestigious a school is? The two \"top\" universities in Canada, Toronto and McGill, both claim to be the highest-ranked school in Canada by simply citing different rankings. I mean, both seem to have good research funding, but since the rankings are based on intangible things like \"academic and employer reputation\" and vary between different rankings, I'm not sure how we can measure such a thing accurately.",
              "author": "bike0121",
              "created": 1504055523,
              "upvotes": 4,
              "replies": {
                "dmbbt1i": {
                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbbt1i/",
                  "text": "NRC rankings [link](http://www.chronicle.com/article/NRC-Rankings-Overview-English/124728/) did a fairly reasonable job though those details are now 7 years old so take that into consideration.\n\nIt's true that this stuff is notoriously hard to rank discretely, which is why faculty often tend to group institutions into tiers (from what I've seen). Frankly, the tier system is fine by me. Obviously there's not much diff. between UChicago, Princeton, Harvard, MIT, Yale, etc. at the institutional level, though there will be differences at the program/department level.",
                  "author": "PhD_sock",
                  "created": 1504065028,
                  "upvotes": 3,
                  "replies": {}
                },
                "dmb6o32": {
                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb6o32/",
                  "text": "There's no single definitive ranking, and accordingly it's not entirely meaningful to say that a school is \"top X\" because for many values of X that depends entirely on what ranking system you choose. But they do tend to be _somewhat_ consistent, especially near the top. You won't often find a school that's ranked #5 in one system and #50 in another. So if you want to get a sense of an institution's prestige, you can't do a strict comparison of ranks and conclude that, say, a top 5 institution is more prestigious than a top 10 institution - but you could probably argue that a top 5 is more prestigious than one that comes in around the 50's.",
                  "author": "diazona",
                  "created": 1504058074,
                  "upvotes": 1,
                  "replies": {
                    "dmb812n": {
                      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb812n/",
                      "text": "I wonder how much this depends on the country. I feel like Canadian schools may be less \"prestigious\" than top American universities largely because of our culture placing less value on prestige (as well as our lack of many private universities). \n\nPerhaps it's the same issue with universities in Europe being underrated on the global rankings list, relative to American or British schools, where the culture values prestige more highly.",
                      "author": "bike0121",
                      "created": 1504059805,
                      "upvotes": 4,
                      "replies": {
                        "dmb92n2": {
                          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb92n2/",
                          "text": "Could be. It wouldn't surprise me to find out that ranking systems are biased toward factors that US universities consider important, or that US universities try a lot harder to \"chase\" high rank than those in other countries.",
                          "author": "diazona",
                          "created": 1504061198,
                          "upvotes": 6,
                          "replies": {}
                        },
                        "dmbqkfp": {
                          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbqkfp/",
                          "text": "The disparity among universities in the US is also much greater than in Canada--not all Canadian universities are equal, but most are relatively good in quality. The same cannot be said of universities in the US.",
                          "author": null,
                          "created": 1504097388,
                          "upvotes": 6,
                          "replies": {}
                        },
                        "dmbaf1s": {
                          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbaf1s/",
                          "text": "> I wonder how much this depends on the country. I feel like Canadian schools may be less \"prestigious\" than top American universities largely because of our culture placing less value on prestige (as well as our lack of many private universities). \n\n\nIn my experience, Canadians seem to care a *lot* less about university prestige, with the exception of law schools (and even there people care far less than in the US). While most people can still pick out what the 'top' schools in their field are (and they almost always include UofT and McGill), I don't get the sense that other schools are as much looked down upon here. ",
                          "author": "MWigg",
                          "created": 1504063039,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "dmb51ii": {
              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb51ii/",
              "text": "> \"Quality of research, quality of bullshit\" = ALL of this depends on MATERIAL resources. Resources that some universities and departments happen to have more than others. \"Quality of relationships\" = It sure doesn't hurt when half your department is on the editorial boards of half the top journals in the field! Or when they've supervised the dissertations of basically every leading member of the field!\n\nNone of these are synonymous with the institution's prestige. Whatever your field is, a university can be famous without having much going on in that specific area.",
              "author": "east_lisp_junk",
              "created": 1504056028,
              "upvotes": 4,
              "replies": {
                "dmbbojo": {
                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbbojo/",
                  "text": "I didn't say they are synonymous.",
                  "author": "PhD_sock",
                  "created": 1504064847,
                  "upvotes": 2,
                  "replies": {}
                },
                "dmbtowo": {
                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbtowo/",
                  "text": "Department prestige often matters more than institution prestige, but the broader point stands.",
                  "author": null,
                  "created": 1504101568,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "dmaymf3": {
          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmaymf3/",
          "text": "Agreed. And you're right, many of these people are obviously new to the world of academia.\n\nBut it's so damned gauche, and it's getting really old.",
          "author": "deaconblues99",
          "created": 1504047903,
          "upvotes": 9,
          "replies": {
            "dmbffit": {
              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbffit/",
              "text": "> it's so damned gauche\n\nThis is really the problem. And it applies to almost every use of the term \"prestigious.\" I cannot with that word. Motion to kill it. ",
              "author": null,
              "created": 1504071298,
              "upvotes": 5,
              "replies": {
                "dmclpjo": {
                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmclpjo/",
                  "text": "> Motion to kill it. \n\nSeconded.",
                  "author": "ProbabilisticWorld",
                  "created": 1504131415,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "dmbove1": {
              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbove1/",
              "text": "No more gauche than a name tag listing department affiliation.",
              "author": "ph0rk",
              "created": 1504094669,
              "upvotes": 1,
              "replies": {
                "dmbp2be": {
                  "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbp2be/",
                  "text": "I'm honestly not sure what you're referring to here.\n\nAre you talking about nametags at conferences?",
                  "author": "deaconblues99",
                  "created": 1504095002,
                  "upvotes": 1,
                  "replies": {
                    "dmbp5cz": {
                      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbp5cz/",
                      "text": "Yes. We're all pretty ridiculously status conscious; the behavior is reinforced everywhere so it shouldn't really be a surprise in a place like this.",
                      "author": "ph0rk",
                      "created": 1504095149,
                      "upvotes": 1,
                      "replies": {
                        "dmbrwwp": {
                          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbrwwp/",
                          "text": "I don't really understand. I have my university on my nametag at conferences so people know where I work, which is relevant to discussions. It also eases small-talk. \"Oh, WRU, huh? Does Phil Crumblebum still work there? I remember he worked on such and such.\" I've never seen a nametag affiliation that made me feel either superior or inferior.",
                          "author": "AerosolHubris",
                          "created": 1504099308,
                          "upvotes": 6,
                          "replies": {}
                        },
                        "dmbqq47": {
                          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbqq47/",
                          "text": "There's a difference between a nametag that you have to wear and which wasn't even made by you, and an internet forum where you can choose to stay as anonymous as you please and only share information about yourself that you find pertinent.\n\nThese people find the alleged prestige of their programs pertinent all the damn time.\n\n\"What pizza topping is your favorite?\"\n\n\"Well, as a candidate in history at a top university, I can tell you that pineapple pizza is *the* most reputed among the best and brightest of our world\"",
                          "author": "riggorous",
                          "created": 1504097628,
                          "upvotes": 9,
                          "replies": {}
                        },
                        "dmbqgd4": {
                          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbqgd4/",
                          "text": "I dunno, I never really think of departmental / university affiliations on conference badges as all that much of a status thing. Then again, the conferences I attend include people in industry, government, *and* academia. So maybe there's less of that going on...\n\nI mean, I guess we're all aware of it, but the university I'm at has basically no pre-existing program in the area where I do research-- and before that, I was in industry, and a graduate student before that-- and I've never felt anything weird about showing up at a conference with my affiliation on my badge.\n\nBut maybe some folks *do* think of things that way.",
                          "author": "deaconblues99",
                          "created": 1504097222,
                          "upvotes": 2,
                          "replies": {
                            "dmcuf4a": {
                              "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmcuf4a/",
                              "text": "I've been at places at the top, bottom, and middle of my field's status hierarchy, and I have watched people look down at the name tag and exit a conversation, or glance down and suggenly grow more engaged in it - depending on the school listed (I've seen people do this to others, too, not just me). \n\nI can see how a mixed conference would be different, of course. At the conferences I attend there is generally only one disciple there, so school name immediately signals department prestige. ",
                              "author": "ph0rk",
                              "created": 1504142237,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "dmb79rg": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb79rg/",
      "text": "Lol. I agree totally. That said, I DO think it is important to describe what *type* of school you work at when you comment (e.g. R1 university, liberal arts college, etc.). ",
      "author": "Aubenabee",
      "created": 1504058835,
      "upvotes": 9,
      "replies": {
        "dmbwmbu": {
          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbwmbu/",
          "text": "That too depends on the context. It isn't always relevant, but it is more often than the ranking...",
          "author": "ImaginationGeek",
          "created": 1504104920,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "dmcm7wr": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmcm7wr/",
      "text": "Thank you. 10/10",
      "author": "boozelover",
      "created": 1504132010,
      "upvotes": 3,
      "replies": {}
    },
    "dmb304j": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb304j/",
      "text": "Departmental prestige is discipline specific. \n\nBeing at an R1/RU-VH as compared to a SLAC as compared to a comprehensive regional school isn't, and is often useful context for both questions and answers. \n\nFor faculty, of course, less so for graduate students for obvious reasons. \n\nI don't really see what undergrads get out of this sub, but I expect their experiences are quite different at all three places. ",
      "author": "ph0rk",
      "created": 1504053481,
      "upvotes": 7,
      "replies": {}
    },
    "dmbvk9h": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbvk9h/",
      "text": "https://www.reddit.com/r/AskAcademia/comments/5keghh/metaish_why_does_everyone_say_theyre_in_a_top/",
      "author": "sb452",
      "created": 1504103749,
      "upvotes": 2,
      "replies": {
        "dmbzwkq": {
          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbzwkq/",
          "text": "Glad it's not only me that's noticed.",
          "author": "deaconblues99",
          "created": 1504108402,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "dmc0a8l": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmc0a8l/",
      "text": "I usually toss out a statement about how well known and \"top\" my institution is when making some point about why it's actually a shit program, so....\n\nI do agree with you, throwing out names emphasizes the whole who you know over what you know, and that used to really bother me. Unfortunately name dropping can work on some ppl. That said, back to my original statement - top school doesn't mean a good environment in any way imho.",
      "author": "IntriguinglyRandom",
      "created": 1504108790,
      "upvotes": 2,
      "replies": {}
    },
    "dmd1nps": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmd1nps/",
      "text": "Let's downvote posts that mention this crap especially when it's not germaine to the questions",
      "author": "Amursana",
      "created": 1504152387,
      "upvotes": 2,
      "replies": {}
    },
    "dmb230p": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmb230p/",
      "text": "This is something I noticed about university advertisements now. Every school seems to have some claim to fame, stating it is the top x program in y. Y could be some offshoot of a subset of a field which really holds no merit and might not offer you any better opportunities but in \"that one thing\" someone wrote the school was high caliber.\n\nSeriously, dont fall for this and especially dont use it in the way OP is suggesting.\n\nBut I imaging people on the internet are also exaggerating a lot just to sound impressive. It isnt about how good the school is, it is about how good you are at that school that will matter. If it is a low tier school but you stand out to your professors it might provide better opportunities than if you were just average at an elite school",
      "author": "Tibujon",
      "created": 1504052319,
      "upvotes": 2,
      "replies": {}
    },
    "dmbsj3y": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbsj3y/",
      "text": "As someone who studied at a top-ranking program as an Exchange student.... I was actually pretty surprised at how abysmally low their requirements were. \n\nI breezed through the entire year getting double the credits for half the work (their credit are apparently worth double, so 1credit=25 hrs of study at my home uni=12 hours of study there), and extremely high grades for barely decent papers and almost no study. My classmates were, simply put, ignorant. I am in reading heavy field (manuscript studies) and there is nothing that can make up for not having read enough background material. I also met some people who were there full time from my country and they admitted getting into that program because, in their words \"it's a lot more expensive, but a lot easier, and I don't want to risk not graduating\" (my country has a 70% dropout rate at uni). \n\nNow when anybody mentions studying at a \"top whatever\" institution, I am very skeptical and sometimes assume they literally bought their degree. ",
      "author": "alli_golightly",
      "created": 1504100122,
      "upvotes": -2,
      "replies": {}
    },
    "dmbdsif": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbdsif/",
      "text": "U jelly?",
      "author": "istuserIrishJude",
      "created": 1504068245,
      "upvotes": -11,
      "replies": {
        "dmbjds1": {
          "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbjds1/",
          "text": "Nope. Look at my flair.",
          "author": "deaconblues99",
          "created": 1504080662,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "dmbqjnu": {
      "link": "/r/AskAcademia/comments/6wuukw/im_at_a_top_x_university_program/dmbqjnu/",
      "text": "🔥🔥🔥\n\n",
      "author": "riggorous",
      "created": 1504097356,
      "upvotes": -3,
      "replies": {}
    }
  }
}