{
  "sid": "ovyuwg",
  "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/",
  "title:": "What is something you wished you knew earlier in your PhD?",
  "text": "Hi all!\n\nCurrently in the first month of my PhD (humanities) and it got me thinking. As the title says: people who are currently finishing their PhD/have finished their PhD already: what is something you wished you knew from the get-go of your academic position? Something you might have wanted to tell your younger self?\n\nLooking forward to your responses!",
  "author": "gdeklerk",
  "created": 1627847071,
  "updated": 1634080038,
  "over_18": false,
  "upvotes": 27,
  "upvote_ratio": 0.92,
  "comments": {
    "h7ckqs3": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7ckqs3/",
      "text": "Your dissertation is not the final goal...it is just the completion of a stage necessary to moving to the next level.\n\nIt is possible the next level may not happen though. Be fully aware of what lies after the PhD.",
      "author": "nevsdottir",
      "created": 1627847900,
      "upvotes": 46,
      "replies": {
        "h7cwsv3": {
          "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7cwsv3/",
          "text": "If the next level is an academic career then it is not only possible that it won’t happen, it is highly likely and almost certain in many subjects.",
          "author": "CaptainCornerCamper",
          "created": 1627853682,
          "upvotes": 13,
          "replies": {
            "h7d31ks": {
              "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7d31ks/",
              "text": "So if I am understanding, working in academia for a particular field is more like a dream job than something you can really count on?",
              "author": "le-toss",
              "created": 1627856761,
              "upvotes": 5,
              "replies": {
                "h7d5ljn": {
                  "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7d5ljn/",
                  "text": "Doing it for a few years as a postdoc is not so unreasonable. Such jobs can be very competitive but the chances of getting one are not so low. It’s the chances of getting a permanent position that are insanely low. I’m not saying people should not try, but they should count on not getting such jobs and plan accordingly.",
                  "author": "CaptainCornerCamper",
                  "created": 1627858054,
                  "upvotes": 5,
                  "replies": {
                    "h7eyi8s": {
                      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7eyi8s/",
                      "text": "I see, thank you for the response! I’ll start thinking of that back up plan.",
                      "author": "le-toss",
                      "created": 1627901105,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h7clqac": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7clqac/",
      "text": "[deleted]",
      "author": null,
      "created": 1627848366,
      "upvotes": 33,
      "replies": {
        "h7e7uvo": {
          "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7e7uvo/",
          "text": "And don't let fear guide you! :-)",
          "author": "PizzaKawaii",
          "created": 1627878945,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h7ecyib": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7ecyib/",
      "text": "Create a document for every single book and article you read, containing:\n\n* Author/title/publication info in proper bibliographic citation style (Chicago notes/bibliography might be best)\n* A summary of the argument\n* Your critique of the argument\n* Salient quotations, including page numbers\n* If it's a book, include citation information for (or links to) any particularly insightful reviews/critiques of that book. \n\nKeep all of these documents in a particular file, with subfiles if you think that will help you organize them. \n\nNot only will this help you tremendously when you are writing papers for your classes, but when you are studying for comps and writing your dissertation, this will be your most valuable file.",
      "author": "matthewsmugmanager",
      "created": 1627882553,
      "upvotes": 20,
      "replies": {
        "h7elgfm": {
          "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7elgfm/",
          "text": "Please do all of this, but in a citation manager (e.g, Zotero, EndNote) that integrates with word processing software (e.g., Microsoft Word, LaTeX, Google Docs). The manager can help you organize citations with keywords, often will populate reference information automatically including DOIs, and can better adjust if citation rules change over the time you’re in your program.",
          "author": "theesmartstallion",
          "created": 1627889501,
          "upvotes": 13,
          "replies": {}
        },
        "h8az9l8": {
          "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h8az9l8/",
          "text": "I'm starting my PhD this month and found this comment very insightful. Was wondering if you had a template you could share.",
          "author": "tadi_boi",
          "created": 1628527870,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7dynkh": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7dynkh/",
      "text": "You won’t be a professor and that’s ok. I was one out of a cohort of 7 in an excellent humanities PhD program who got a job and then made tenure. The other 6: are they starving? No. Do they hate their lives? No. Did I get an academic job because I’m the smartest and the most determined? I’d like to think so, but the answer is no. My former classmates are doing fine, but it was very hard for some of them to leave academia/accept that they would never land a TT job. I love my job, but a lot of actually being able to work in the field (in humanities, especially) is down to luck. By the way, this was a while ago and the odds are even worse now, no matter what humanities discipline you’re in.",
      "author": "BelaTarrd",
      "created": 1627873500,
      "upvotes": 20,
      "replies": {
        "h7e17tb": {
          "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7e17tb/",
          "text": ">I was one out of a cohort of 7 in an excellent humanities PhD program who got a job and then made tenure.\n\nThere were 40+ people in my first-year cohort in my humanities program (which was still in the top ten in the field at that point, barely). Only six ultimately finished, and I am the only one with a traditional academic career. I had no idea it would be anything like that at the outset. But it was the 90s, lots of people went to grad school-- many without any funding at all --and then quit because there were far better jobs in tech. Some of my classmates went to work for Amazon c. 1997 and I suspect are retired now.",
          "author": "SnowblindAlbino",
          "created": 1627874937,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "h7cv1sm": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7cv1sm/",
      "text": "[deleted]",
      "author": null,
      "created": 1627852818,
      "upvotes": 21,
      "replies": {
        "h7e0znx": {
          "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7e0znx/",
          "text": "100% agree. I worked in my library’s rare books dept and leaving with several years of actual work experience (especially rare books experience which is very hard to get outside of grad school) absolutely freed me from the feeling of “I *have* to get an academic job because I have literally nothing else to lean on as a developed skill or to put on my CV.”",
          "author": "Loimographia",
          "created": 1627874808,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "h7dgs2d": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7dgs2d/",
      "text": "1, don't do it. If you are doing it for the job, better career opportunities, pay, fame, whatever, don't do it. The only reason to stay is if you want to add just a tiny bit to science and you are willing to give years of your life to do so. Nothing else is worth the trade off, and there is no point going half in. It's the loneliest thing you can do. Be prepared. If you are not sure, don't walk, run.\n\n2, forgive yourself. There may be days you don't shower, there will be days you don't sleep. Your immunity will dip with stress, you will probably require glasses if you don't yet and you will probably hurt your knees and back in the years ahead if you haven't already. So minimise the damage, exercise where you can, take care of your body, sleep and eat as well as you can. This is not a sprint and burn out is real.\n\n3. Read an article every day. Just one. It gets you ready for writing and is like exercise for your brain, you'll be stronger for it by the time you need to write up\n\n4. Keep a file of all the instructions you get, though it's better done at the start of post-grad, so you can revert back to things you've forgotten years later\n\n5. Work on your thesis every day. No matter the occasion, even if you just read bits of it for an hour. It takes ages to find the thread again if you've lost it.\n\n6. Forgive your supervisor. Sometimes you might not agree but they want you to finish, they are human and you are not their only priority. You are the expert on your thesis, more than anyone in the world, that's your responsibility now. If you don't know, learn. Don't miss appointments and always listen to advice kindly. You are new at this, they know the way\n\n7. It doesn't have to be perfect the first time, it just has to be in. You will have countless revisions, don't get stuck.\n\nThat should help a little. I could write a book about this, but I need to go finish my thesis first.\n\nMay the odds be ever in your favour",
      "author": "no_Im_not_done_yet",
      "created": 1627863961,
      "upvotes": 16,
      "replies": {
        "h7dwtfn": {
          "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7dwtfn/",
          "text": "Thanks, this is super helpful.",
          "author": "mjsielerjr",
          "created": 1627872491,
          "upvotes": 2,
          "replies": {
            "h7el7ae": {
              "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7el7ae/",
              "text": "I forgot BACK UP everything. To a cloud. Google drive, whatever. Yeah its a hassle but I have worked with people who learnt that the hard way. A girl saved her work on her laptop, her boyfriends laptop and two hard drives to be safe, they got robbed and everything was stolen, all her data gone. She had to restart. \nThey tell you you can finish in two years minimum, three recommended, I think the average is 7 years. Things can go really wrong, and it doesn't have to be your fault. I've stood next to a tiny girl crying at the gates to university as her cultures burned to death inside because she couldn't get to them because there was a strike, my friend had to restart his linguistics D cause covid and red tape killed his sampling strategy. Fridges have failed, study leaders have gotten sick and passed away, no plan is ensured to survive a PhD. I am not trying to scare anyone off. No. I am. But most importantly I am trying to adequately arm and prepare the ones that stay. \n\nThat's not even getting started on impostor syndrome or attaching your self worth to a piece of paper with no save points in-between. Also if you work with humans or animals, get your ethics application done ASAP. It can easily take a year, know a guy whose took 3 years. Make friends, it helps to talk. You are no longer competing against class mates, this is a solo fight.",
              "author": "no_Im_not_done_yet",
              "created": 1627889277,
              "upvotes": 6,
              "replies": {}
            },
            "h7el9ig": {
              "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7el9ig/",
              "text": "Also, thank you for the validation, it means the world",
              "author": "no_Im_not_done_yet",
              "created": 1627889333,
              "upvotes": 2,
              "replies": {
                "h7ff9d6": {
                  "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7ff9d6/",
                  "text": "Np, can’t get enough of that in academia :)",
                  "author": "mjsielerjr",
                  "created": 1627911818,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h7dzobo": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7dzobo/",
      "text": "It’s okay to feel like you’re floundering, with both no idea and too many ideas at the same time, in your first year. The first year is all about reading, doing the thinking work you need to do in order to establish a reasonable scope for your research, and making sure your direction is consonant with what your supervisor/s are on board for. For context, I’m based in Australia so some of the language and structural requirements (curriculum, additional research methods coursework, etc.) may be very different in other parts of the world.",
      "author": "the-indigo-hour",
      "created": 1627874076,
      "upvotes": 4,
      "replies": {}
    },
    "h7ebi5v": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7ebi5v/",
      "text": "Have a Plan B and a Plan C.",
      "author": "g33ksc13nt1st",
      "created": 1627881481,
      "upvotes": 3,
      "replies": {}
    },
    "h7clfna": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7clfna/",
      "text": "Also, its first and foremost a political game. get over it, get good at it.",
      "author": "Kwilfar",
      "created": 1627848228,
      "upvotes": 18,
      "replies": {
        "h7cup34": {
          "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7cup34/",
          "text": "Any advice about getting good at the political side of academia?",
          "author": "TheBoscoBull",
          "created": 1627852650,
          "upvotes": 4,
          "replies": {
            "h7cx4f4": {
              "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7cx4f4/",
              "text": "Don’t fake results, but also don’t be overly worried about getting things correct too. Don’t teach badly, but don’t put more effort into teaching than absolutely necessary. \n\nI am not advocating the above behaviour but they are good career moves.",
              "author": "CaptainCornerCamper",
              "created": 1627853842,
              "upvotes": 9,
              "replies": {
                "h7dvuwj": {
                  "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7dvuwj/",
                  "text": "By getting things correct do you mean when publishing results? Or day to day when doing research? Could you elaborate? I know I spend too much time worrying my data is just wrong",
                  "author": "Shio-zhi",
                  "created": 1627871960,
                  "upvotes": 2,
                  "replies": {
                    "h7ejwve": {
                      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7ejwve/",
                      "text": "To be a good researcher you should worry that your data is wrong. What I mean is that academia does not reward good research and from a career perspective you are better off being sloppy. So really I meant both day to day research and when publishing.",
                      "author": "CaptainCornerCamper",
                      "created": 1627888150,
                      "upvotes": 2,
                      "replies": {
                        "h7enmgl": {
                          "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7enmgl/",
                          "text": "My boss does this actually. He'd rather us publish mediocre results, than chase after the high targets. I'm an undergrad in chem, I don't know how to feel about this.\n\nIs all of research like this? Should I fall into line instead of constantly trying for the high targets? Am I just too idealistic and naive? This is my first time working long term (7 months, full time), on experimental research, one project.",
                          "author": "Shio-zhi",
                          "created": 1627891443,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "h7e0w9u": {
              "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7e0w9u/",
              "text": ">Any advice about getting good at the political side of academia?\n\nListen more than you talk. Go to every public talk anyone in your department offers. Find a mentor, or ideally more than one, who you can trust to tell you the truth. Don't speak ill of anyone in your department, ever; try to avoid doing it at all as you never know who might be connected back to your department somehow. Join your professional organization, volunteer to be on committees, and go to the annual meeting if you can-- and when there, go to the luncheons, breakfast meetings, board meetings (if they are open), and the like. Put time into *watching and listening* to others do the politics. Read the headlines in the Chronicle and Inside Higher Ed at least weekly so you know what's going on outside your own school.\n\nI did all this from undergrad through grad school, mostly because I was really curious about how academia worked. I learned a lot and it paid off when I got my first faculty job.",
              "author": "SnowblindAlbino",
              "created": 1627874755,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "h7efg64": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7efg64/",
      "text": "Publish early results, go to academic conferences, but also industry conferences.",
      "author": "ColdEvenKeeled",
      "created": 1627884462,
      "upvotes": 3,
      "replies": {}
    },
    "h7f6gck": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7f6gck/",
      "text": "That even with a phd i will be poor, have bad working conditions and 0 recognition of my knowledge by the society in general...",
      "author": "Atomar_Villakoira",
      "created": 1627906865,
      "upvotes": 3,
      "replies": {}
    },
    "h7jlqc1": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7jlqc1/",
      "text": "The most important part of your degree is networking. Leverage the opportunities for funded travel, introductions to others from your advisor and department/committee. Find out who knows what events on campus have free food and subscribe to those email lists. Take full advantage of your campus resources (e.g., student health, counseling, food pantry if you need it). Serve on a graduate student association committee. Take full advantage of mentors, both in and outside of your department. Make friends with admins because they ultimately control now easy pretty much everything will be for you, from material acquisition to office space to paperwork.",
      "author": "insanityensues",
      "created": 1627992876,
      "upvotes": 2,
      "replies": {}
    },
    "h7jcp42": {
      "link": "/r/AskAcademia/comments/ovyuwg/what_is_something_you_wished_you_knew_earlier_in/h7jcp42/",
      "text": "You really have to publish, and you will be pressured to publish.\n\nAlso, depending on the field, the freadom of having your own work/time in yours hands is amazing at first, but will easily get you into a guilt-trip, resulting in you working more/less depending on your capacity to manage time.  \n\n\nHonestly, I like science a lot and that has been enough to keep me working on my PhD. But if I could go back in time, I would probably have picked a Theme/Research Project more closely related with my goals and tastes; instead, I decided to work with people I knew as I was too affraid to end up working with someone I couldn't get along with. This was a bad idea, let me tell you. But at least my Supervisors are ok and we have a positive/balanced relationship.",
      "author": "ThrowAwayResearch13",
      "created": 1627986442,
      "upvotes": 1,
      "replies": {}
    }
  }
}