{
  "sid": "p7ah3g",
  "link": "/r/AskAcademia/comments/p7ah3g/plagiarism_and_exclusion_from_a_masters_program/",
  "title:": "Plagiarism and exclusion from a master's program?",
  "text": "Hi all,\n\nI am an EU student studying for my MBA in Germany. I have been a top student throughout the year. However, my thesis (24%) and the last two assignments (55% and 56%) have resulted in plagiarism. The plagiarism has happened mainly because of self-plagiarism in my thesis, not citing common knowledge while being identically used, not citing page numbers, and not properly paraphrasing.\n\nI have cited everything, but the writing and paraphrasing have not been efficient, especially with the last two minor assignments. I did not do it on purpose, and it was all an unintentional mistake because of my own lack of knowledge of academic writing and lack of guidance from my professors.\n\nHowever, the university has given me two weeks to write an official statement, and a committee will decide on my temporary or permanent exclusion from the program. The permanent exclusion seems disproportionate punishment, and I want to get my statement right and avoid being excluded.\n\nCan anyone help me with tips on how I can approach my statement to improve my chances? I appreciate any opinions or previous experiences.",
  "author": "ZealousidealStar6007",
  "created": 1629359979,
  "updated": 1634079563,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "h9ieazz": {
      "link": "/r/AskAcademia/comments/p7ah3g/plagiarism_and_exclusion_from_a_masters_program/h9ieazz/",
      "text": "That's a standard procedure. Especially in the final stages of your Masters you should know these things, I find it crazy that you expected guidance from your prof on such basic things at that level. \nThese are your mistakes, dont blame anyone else.\n\nI recommend you make a table with each line that was plagiarized and then show how the full, correct citation looks like compared to the partial citation you gave. Argue that the source was always identifiable from the information you provided. \n\nFor instances where you didnt give a source  at all, argue that it is common knowledge, find and list articles/papers that also use these or similar enough statements without a citation.\n\nYou should go through each and every point that was criticised as being plagiarised and either defend it or apologize for your mistake, and in any case rewrite that section with proper references and add it to your argument. \n\nGood luck\n\n\nEdit: typo",
      "author": "DeepSeaDarkness",
      "created": 1629362324,
      "upvotes": 14,
      "replies": {}
    },
    "h9ihkxg": {
      "link": "/r/AskAcademia/comments/p7ah3g/plagiarism_and_exclusion_from_a_masters_program/h9ihkxg/",
      "text": "> I did not do it on purpose, and it was all an unintentional mistake because of my own lack of knowledge of academic writing and lack of guidance from my professors.\n\nYou're doing a graduate degree. Which implies that you have an undergraduate degree. Plagiarism (and how not to do it) is something you should have learned about years ago. Don't try and blame your professors for this now.\n\n> the writing and paraphrasing have not been efficient\n\nI'm always rather suspect when people talk about efficient/effective paraphrasing. Because it comes across as them trying to find the lowest effort route to rewording someone else's work, as opposed to trying to understand and convey the information themselves. The former can be done by an AI program, there is no academic merit there.\n\n> not citing common knowledge while being identically used\n\nWhat does this even mean? Have you copied actual sentences without paraphrasing because you figured it was common knowledge? If it is common knowledge you shouldn't even need to paraphrase since you'd be writing from your own knowledge, so I don't see how it would then get flagged as being identically used.\n\n> The permanent exclusion seems disproportionate punishment\n\nIt isn't. Academic dishonesty is a serious matter. If you were in your first year of undergrad and this was a one time offence *then* it would be. But you have multiple instances of plagiarism *including in your thesis*, and quite frankly if you've \"accidentally\" plagiarised now, I wouldn't be surprised if you didn't \"accidentally\" plagiarise all through your undergraduate degree, and it just wasn't picked up.\n\nNow, you might read all of that and think that I sound rather harsh and judgemental. But firstly, my points are all valid. And secondly, the people on your committee will likely have some (if not all) of the same thoughts. Do not approach this like you're a victim. Don't act like you don't deserve consequences. And don't blame your professors for not teaching you something you should have figured out years ago. None of these things will inspire sympathy in the committee, they will likely find those arguments as ridiculous and aggravating as I do. And that will not help your outcome.\n\nYou need to be honest about the fact that *you* screwed up, and make clear that you have learned from this experience and won't make the same mistakes again. Don't try and push for leniency (that would likely backfire), instead take responsibility.",
      "author": "foibleShmoible",
      "created": 1629365234,
      "upvotes": 19,
      "replies": {
        "h9ilmyw": {
          "link": "/r/AskAcademia/comments/p7ah3g/plagiarism_and_exclusion_from_a_masters_program/h9ilmyw/",
          "text": "> Now, you might read all of that and think that I sound rather harsh and judgemental. But firstly, my points are all valid. And secondly, the people on your committee will likely have some (if not all) of the same thoughts. Do not approach this like you're a victim. Don't act like you don't deserve consequences. And don't blame your professors for not teaching you something you should have figured out years ago. None of these things will inspire sympathy in the committee, they will likely find those arguments as ridiculous and aggravating as I do. And that will not help your outcome.\n\nExactly.",
          "author": "CheeseWheels38",
          "created": 1629368642,
          "upvotes": 9,
          "replies": {}
        },
        "h9k1vn7": {
          "link": "/r/AskAcademia/comments/p7ah3g/plagiarism_and_exclusion_from_a_masters_program/h9k1vn7/",
          "text": "> \nYou're doing a graduate degree. Which implies that you have an undergraduate degree. Plagiarism (and how not to do it) is something you should have learned about years ago. \n\nIt's possible that OP's undergraduate is from one of the many systems out there that don't care about plagiarism to the degree that the German system does. The practical definition of plagiarism largely varies from culture to culture.",
          "author": "thegreenaquarium",
          "created": 1629394007,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "h9j2zvs": {
      "link": "/r/AskAcademia/comments/p7ah3g/plagiarism_and_exclusion_from_a_masters_program/h9j2zvs/",
      "text": "The other commenters said it well, so I will not repeat their points. I will just add that a lot of what you said amounts to excuses, and you even tried to shift blame to your professors. That will not work, may anger the committee members, and will only prove that you deserve punishment. You are an adult earning a graduate degree in business. It is your responsibility to know what is and is not plagiarism.\n\nWhat may work is explaining how the standards were misapplied. Self-plagiarism is not something that I would apply to a thesis. Theses often incorporate a student’s prior writings. In my opinion experience, that is acceptable and even expected. It is not uncommon, for example, for a student to do a class project, turn that into a publication, and then turn that publication into a thesis or portion of a thesis. Unless explicitly disallowed, I would carefully challenge that one. Additionally, incomplete citation, such as a missing page number, is not plagiarism. Plagiarism is claiming someone else’s words or ideas as one’s own. If you cited them, you didn’t plagiarize.\n\nAt the same time, reusing someone else’s words or ideas is plagiarism. It doesn’t matter how common the knowledge is, nor whether you paraphrased slightly. Frankly, any time you write a sentence that expresses substantially the same thing as one in one of your sources, while looking at the source, you are plagiarizing, regardless of whether or not anyone could ever tell.\n\nI would also avoid whining about the severity of the possible punishment. Cheating one’s way through school should never be tolerated, and that is especially true in business school. I haven’t seen the details, so I don’t know whether the accusations are justified or not, but based on what you have said here, I suspect some of them are.",
      "author": "bigrottentuna",
      "created": 1629379307,
      "upvotes": 3,
      "replies": {}
    },
    "h9mnycz": {
      "link": "/r/AskAcademia/comments/p7ah3g/plagiarism_and_exclusion_from_a_masters_program/h9mnycz/",
      "text": "Don’t blame your professors for your mistakes. You should’ve known not to recycle your own work for multiple assignments.",
      "author": "eggplant_wizard12",
      "created": 1629437920,
      "upvotes": 1,
      "replies": {}
    }
  }
}