{
  "sid": "omcbl8",
  "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/",
  "title:": "PhD Stipend in each country",
  "text": " I'm a prospective PhD student from India. I want to do my PhD studies abroad. But my financial situation needs me to work. What are some countries and universities in which I can **save** a **MINIMUM of 300 USD a month** from the stipend I get apart from all my expenses so that I can support my family in India.",
  "author": "SivaMurugappan",
  "created": 1626554514,
  "updated": 1634082513,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "h5jyxi2": {
      "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5jyxi2/",
      "text": "This is a really complicated question that I'm not sure anyone can answer for you since stipends can vary within a country, even within an institution, and cost of living absolutely will vary. You'll have to look up stipend levels for every program you're interested in globally, compare to COL/your expenses, and see if saving $300/month is feasible.",
      "author": "mediocre-spice",
      "created": 1626554867,
      "upvotes": 19,
      "replies": {}
    },
    "h5k0g8z": {
      "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5k0g8z/",
      "text": "This depends a lot on your expenses too.\n\nMy lab-mate saved more than that each month. I saved $0 (yeah, my bad).",
      "author": null,
      "created": 1626555647,
      "upvotes": 13,
      "replies": {
        "h5k4dy4": {
          "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5k4dy4/",
          "text": "Don't beat yourself up.  When I closed my bank account at the end of my PhD, they waived the usual $2 fee.\n\nMy balance was $0.63",
          "author": "Spambot0",
          "created": 1626557685,
          "upvotes": 10,
          "replies": {
            "h5kryjc": {
              "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5kryjc/",
              "text": "Thanks :)\n\nI think in some ways my brain didn't have the capacity to manage both grad life stress and budgeting! :D",
              "author": null,
              "created": 1626570207,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h5k2lzd": {
      "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5k2lzd/",
      "text": "Even within the US, it varies a lot. I went to grad school in an expensive tech city, but my school had budget issues and could only offer like a $16k 9-month stipend (This was for social sciences in the mid-2000. Engineers at my school were getting double the stipend). Average rent alone was $1000 for a studio, making things very tight. I also got accepted by (and passed) schools  in the middle of nowhere (very cheap) offering $25k stipend that same year. So yes, depends a lot on the school and location. I'm sure if you choose a rural/college town school with an okay stipend, you'll totally be able to save $300 a month.",
      "author": "Overall_Designer7502",
      "created": 1626556763,
      "upvotes": 6,
      "replies": {}
    },
    "h5k3rtr": {
      "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5k3rtr/",
      "text": "I'm at a public university in the US and I stay on campus and save more than 300 a month. I however don't have a car which becomes an issue. I think it finally comes down to what you're willing to compromise on. If you are willing to share a room with someone off campus, you can save a lot more than what I'm saving right now.",
      "author": "yksjysjys",
      "created": 1626557364,
      "upvotes": 5,
      "replies": {}
    },
    "h5lwidp": {
      "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5lwidp/",
      "text": "Netherlands has a uniform PhD salary which applies across the entire country.  It's pretty reasonable for one person living off it to save $300/mth, depending of course on lifestyle choices.",
      "author": "polyphonal",
      "created": 1626595060,
      "upvotes": 4,
      "replies": {
        "h5m3dfr": {
          "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5m3dfr/",
          "text": "Thank you so much ! Will look into it :)",
          "author": "SivaMurugappan",
          "created": 1626600906,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "h5m7zem": {
      "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5m7zem/",
      "text": "In Germany it can vary a bit depending on research areas and funding agency. If you’re hired on a DFG project (one of the main funding agency) you can usually expect to get around 1,500€ at the start and about 1,700€ at the end (after taxes and after health insurance). How much you can save depends heavily on the city  you’re in. I’m in Munich and accommodation is expensive. But if you’re willing to share a house with others I think is doable",
      "author": "mkbs49",
      "created": 1626604783,
      "upvotes": 3,
      "replies": {}
    },
    "h5qok82": {
      "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5qok82/",
      "text": "Info on 2 countries:\n\nIn the US, this will vary between appx. $16,000 and $35,000 a year.  It would be technically possible to save $300 a month, but you'd probably be hard pressed. If this is your sole income you'll be living in poverty, especially considering that it can be difficult to make use of public transit in many, many places, meaning you may have to own a vehicle ($$$).\n\nIn Switzerland, a PhD student makes about 55,000 CHF, which isn't lucrative, but should certainly leave you with saving money if you're frugal.  Cost of living is very high, but it doesn't clearly outpace the pay difference.",
      "author": "thenaterator",
      "created": 1626693993,
      "upvotes": 3,
      "replies": {
        "h5quu2o": {
          "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5quu2o/",
          "text": "Thank you so much ! Will look into it :)",
          "author": "SivaMurugappan",
          "created": 1626698127,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h5n4abt": {
      "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5n4abt/",
      "text": "Denmark has a union for graduate students and post-doctoral workers.\n\nThe income is as thus pretty good (35-45K DKK), and I am not sure how it is post-covid, but they gave tax-breaks to immigrant researchers for a few years.\n\nBiggest issue would be commuting, as you will want to live outside the university town and ride a bike or take public transport to get there.",
      "author": "Hoihe",
      "created": 1626623156,
      "upvotes": 2,
      "replies": {
        "h5nzykg": {
          "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h5nzykg/",
          "text": "Thank you so much ! Will look into it.",
          "author": "SivaMurugappan",
          "created": 1626636594,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h669iv3": {
      "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h669iv3/",
      "text": "This depends on so many different things like your field, department, rent, standards of living, etc. \n\nIn my M.S., I had a $10,000 stipend and my fees each semester were $1200. My phd program I have a 20,000 stipend and my fees are about $400. It all just depends.",
      "author": "macearoni",
      "created": 1626988379,
      "upvotes": 2,
      "replies": {}
    },
    "h670fmy": {
      "link": "/r/AskAcademia/comments/omcbl8/phd_stipend_in_each_country/h670fmy/",
      "text": "USA edition: simple answer - **it depends on where you ended with and cheap you want to be.** \n\nFor stipends, the amount can vary significantly between programs, schools and location. I once was bored while waiting for a PCR reaction and i created a list of programs, universities and their announced stipend amounts. The disparity and level of financial acumen necessary to survive in different geographical location can be very remarkable. \n\nFor example, the graduate school in arts and sciences at columbia university reports $31,140 for 9 months academic year 2021-2022. That translates to $3460/month. Now consider the taxes, cost of living in NYC, you might need to be a bit frugal in your expenses. Even escaping the city and moving to new jersey is not a good option considering the closer the location to the city, the more expensive it can be.\n\nUmich's (Ann arbor) biomed program , on the other hand , offers 2810/month and my friends who lived there can save up more due to the relatively cheaper cost of living. \n\nStaying on campus vs off campus for international students who are starting a new chapter in a foreign country also represent a difference in the potential expenditure to be incurred.",
      "author": "overzealous_labgnome",
      "created": 1627001737,
      "upvotes": 2,
      "replies": {}
    }
  }
}