{
  "sid": "m9sb0f",
  "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/",
  "title:": "It really grinds my gears when companies don’t reference studies they’ve used in publicly available reports. Would you tell your fellow academics in the field?",
  "text": "I’ve been working on my PhD for the past 3.5 years (UK), where the end result of my thesis was to provide practical recommendations to governmental bodies, private bodies and local clubs, through the research I’ve done (nearly there, very close to submission!). I’ve been working my fingers to the bone, really trying to connect with lay audiences to do outreach over the last couple of years, and over the past few weeks, I’ve been getting some positive feedback from a few people about the work - so something’s working.\n\nOne national governing body whom I’ve approached in the past but they haven’t been so cooperative, have just put out a report in the last week, in the area. They’ve got a whole page in the report on “studies have shown that participation in [activity] reduces hypertension, etc...”. Yet nowhere in the paper, anywhere, have they cited or referenced the studies they are referring to. It’s a small field, so I know which papers they are referring to. To be honest, I can’t even tell for sure if they’ve used my work specifically, but I know for a fact that they’ve used studies from other fellow researchers in the field and they haven’t received the recognition they deserve.\n\nMan, it really grinds my gears that companies are allowed to do this and not cite or reference any papers, when we’ve worked so hard on research. If we did that in academia we would get so much hate thrown at us - why aren’t private companies held to account either? \n\nWould you make a point of telling the other academics whose work it’s using, or just leave it?\n\nTL;DR - private company uses loads of studies to make their point in a report, but doesn’t cite or reference any of the papers in the report. Would you notify the other academics?",
  "author": "staringspace",
  "created": 1616315526,
  "updated": 1634080189,
  "over_18": false,
  "upvotes": 291,
  "upvote_ratio": 0.98,
  "comments": {
    "gromtdd": {
      "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/gromtdd/",
      "text": "I was approached by a friend who ran a company and asked to review their statements. I editted their writings and added proper references. I was adamant that they would put the proper references in.\n\nJust doing my part to keep the standards up.",
      "author": "SmirkingImperialist",
      "created": 1616316944,
      "upvotes": 75,
      "replies": {}
    },
    "grospbe": {
      "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/grospbe/",
      "text": "Pretty sure that’s unethical on the part of the private company.",
      "author": "cat_vincent",
      "created": 1616322886,
      "upvotes": 48,
      "replies": {
        "grpg6na": {
          "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/grpg6na/",
          "text": "It absolutely is unethical, but it's a private entity privately funding a privately-published document. They're not bound by the social contract of taxpayer-funded research. It's essentially an advertisement and should be treated with a healthy amount of skepticism.\n\nThe only thing I trust a private company to publish are data sheets and engineering documents of their own products.",
          "author": "Verdris",
          "created": 1616339164,
          "upvotes": 29,
          "replies": {}
        }
      }
    },
    "grp7y6i": {
      "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/grp7y6i/",
      "text": "I was working for a company for some months and I was the main contributor to some projects they have published after I left the company. I am not even mentioned in the author list when all the figures on the paper were mine.\n\nAfter that I assume companies don't care at all about fairness or academic standards.",
      "author": "EGCCM",
      "created": 1616334515,
      "upvotes": 14,
      "replies": {
        "grqwo8t": {
          "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/grqwo8t/",
          "text": "Ugh, that sucks. Isn't there anything you can do to gain proper recognition?",
          "author": "It_is_Katy",
          "created": 1616364929,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "groqnnx": {
      "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/groqnnx/",
      "text": "Adding references is a hallmark of academic writing.  Not sure you can really expect non-academic reports to adhere to that standard.  It also very much depends upon the target audience.  It is probably enough for a lay audience to note that \"..studies have shown\".",
      "author": "Life_time_learner",
      "created": 1616320849,
      "upvotes": 23,
      "replies": {
        "grp30bf": {
          "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/grp30bf/",
          "text": "I write non academic research reports sometimes, and instead of in-text citations I just hyperlink to the sources. It's really not that hard. And builds a lot more credibility.",
          "author": "abandoningeden",
          "created": 1616331278,
          "upvotes": 23,
          "replies": {
            "grp9f0p": {
              "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/grp9f0p/",
              "text": "Agreed, this would be a step in the right direction! I don’t expect NGBs to know how to always professionally cite something - it’s a minefield in itself. Just a hyperlink to the work or paper, or a mention in an appendix or bibliography would go some way in recognising the work that the academics have done.",
              "author": "staringspace",
              "created": 1616335465,
              "upvotes": 7,
              "replies": {}
            },
            "grrlgds": {
              "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/grrlgds/",
              "text": "Exactly.\n\nAnd I think the general public deserves the respect of assuming that they can, in fact, understand and assess the literature.",
              "author": "pressed",
              "created": 1616377498,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "groswjp": {
          "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/groswjp/",
          "text": "I meant more as recognition/show they’ve sourced research at the end of the report, a bibliography of sorts. They don’t even show or mention that they’ve used other research to support their claims - I know plenty of other reports that will do this.",
          "author": "staringspace",
          "created": 1616323082,
          "upvotes": 22,
          "replies": {}
        },
        "groucxj": {
          "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/groucxj/",
          "text": "We can absolutely expect them to cite research they reference. It's not just an academic thing. And especially with a report from a national governing body I find it extremely unprofessional not to cite sources.",
          "author": "simoncolumbus",
          "created": 1616324461,
          "upvotes": 43,
          "replies": {
            "groxnfd": {
              "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/groxnfd/",
              "text": "It is an academic convention, not a law.",
              "author": "Life_time_learner",
              "created": 1616327322,
              "upvotes": -11,
              "replies": {}
            }
          }
        }
      }
    },
    "grqwu7b": {
      "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/grqwu7b/",
      "text": "Gave my usual final “lessons to take into the world” lecture this week to end term. I alexia’s include in this a version of “FFS reference your work and support any recommendations or conclusions with evidence!!!”\n\nI’ve worked in industry, government, and non-profit for years and it drove me NUTS to not be able to have references to verify information. Especially since the interpretations of these briefs and reports actually influence policy and practice. And practically, many of these documents had no author information or even a date, so I’d find something useful in our database and have no way to follow up with whoever wrote it.",
      "author": "tsuga-canadensis-",
      "created": 1616365014,
      "upvotes": 2,
      "replies": {}
    },
    "grp4cec": {
      "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/grp4cec/",
      "text": "Citing specific studies makes the claim easier to falsify: why would they ever do that?",
      "author": "Homomorphism",
      "created": 1616332176,
      "upvotes": 1,
      "replies": {}
    },
    "grolemw": {
      "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/grolemw/",
      "text": "*whom* I’ve approached",
      "author": "RossGellerBot",
      "created": 1616315559,
      "upvotes": -4,
      "replies": {
        "gromc04": {
          "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/gromc04/",
          "text": "Good old RossGellerBot being the first to comment",
          "author": "staringspace",
          "created": 1616316472,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "grp17vs": {
      "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/grp17vs/",
      "text": "Unless what they are claiming is incorrect, I’d leave it. Is it something that’s common knowledge in the field? If someone were to search the claims in a database or google scholar, would they easily be able to find studies that do claim that info?  If so, leave it.\n\nDid they lift whole sections of these studies verbatim and present it as their own work? Plagiarism should be flagged and the academics quoted should be told.\n\nUnless it’s blatantly false, or it’s in a patent document or a drug advertisement or another type of document that legally (depending upon your jurisdiction) requires the studies to be specified, I’d leave it. \n\nIs it bad form, sloppy, lazy,and possibly unethical to leave out citations? Yes. It’s not illegal, though.\n\nBut as someone who used to be a law firm librarian, I saw this type of reference all the time. Along with a request to “please find studies referenced within.”  I almost always could find them. The real issues started when I couldn’t.",
      "author": "CardboardChewingGum",
      "created": 1616330044,
      "upvotes": 0,
      "replies": {}
    },
    "grsahr4": {
      "link": "/r/AskAcademia/comments/m9sb0f/it_really_grinds_my_gears_when_companies_dont/grsahr4/",
      "text": "Before moving to academia, I worked for a “Big 4” firm. The amount of bullshitting and cherry picking in their reports was unreal. At the end of the day, they are just trying to sell their services / fulfill their agenda. They present themselves as the only experts - by not citing any other individuals or organizations. Plus, they do not really have to cite anyone - they are already legitimate in the eyes of the business world. That’s just my personal experience.",
      "author": "cpavlou",
      "created": 1616394519,
      "upvotes": 1,
      "replies": {}
    }
  }
}