{
  "sid": "cb1tbp",
  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/",
  "title:": "Grad School Professor Telling People Not to Hire Student",
  "text": "Hello, I am in a strange position and would like to have some help/advice/insight.\n\nI recently graduated from a Master's program.  While there, I did well in my classes (3.9 GPA) and was well regarded by students, faculty, and supervisors.  Except one staff member (the department chair) and for the reason I will explain.\n\nThere was an issue where I felt like the dean of the department needed to be brought in on a conversation.  EDIT (added for clarity): *I sent an email to the department chair and cc:ed the dean as I felt like it was important for the dean to know*.  A faculty member had made a mistake that reflected poorly on the school and I genuinely wanted to help correct the mistake.  That faculty has since been let go (for various balls dropped).\n\nAnother faculty, the department chair, felt like I had gone over his head.  He threatened to not let me proceed in the degree program because he believe it showed I wasn't mature enough.  He also said that he is well connected in the field and that I should be aware of that in the future.  He told me that if I didn't acknowledge my mistake, then I would not be able to continue in the program.\n\nAt the time, I took notes but didn't want to go any further with any complaint for fear or reprisal.  I kept my head down and finished the program in very good standing.\n\nUnfortunately now I am applying for jobs, and I have been made aware that a job offer was not made to me because of intervention by this professor.  I interviewed, the employer liked me, went to the stage of getting reference checks (the ones I provided were all positive), and... yes, the professor was connected to this employer and he was able to stop the offer from being made to me.\n\nDo I just chalk this up to how life works?  Is the professor within his rights to prevent me from employment based on what he has stated to me?  Thoughts?\n\n*Edit: A few more details that have come up in comments:*\n\n1. *I am not the only student that has been threatened by this professor.  Another student was threatened in a very similar situation.*\n2. *While this professor is connected, (being vague) my fiend isn't one where one person really can ruin a career.  It isn't a typical business type career (sorry to be vague).*  \n3. *I appreciate the feedback (keep it coming).  I have learned a lot from you all.  I think a few take aways for me:*\n   1. *Academia should be treated like a career.  I have always gone to small, liberal arts schools where students are encouraged to speak out and dialogue is appreciated.  I guess I became too \"comfortable\".*  \n   2. *I still believe, even if I did act \"unprofessionally\", the professor acted inappropriately by threatening me.* \n\n*I'm still processing this so feel free to keep comments coming.  I really am someone that wants to learn but I also believe in fairness.*",
  "author": "GumOnMySeatGUM",
  "created": 1562683602,
  "updated": 1634081892,
  "over_18": false,
  "upvotes": 108,
  "upvote_ratio": 0.92,
  "comments": {
    "etcla5k": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcla5k/",
      "text": "You may want to consider both long and short term solutions.  There may be some way for you to actually stop this professor from doing what he's doing, though it depends a bit on the situation at that institution and how entrenched he is (or perceives himself to be).\n\nIn the short-term, though, you need to figure out how to minimize his ability to do this to you later.  You might consider letting future probable employers know that this person exists and that they are trying to sink you.  This means you need a very clear (and simple) account of what you did and the degree to which you stand-by your prior decision and/or the degree to which you'd do it differently next time.\n\nIt's certainly possible that this person is having their way with you because they have some actual power, but, more likely, it's that people believe his accounting of your character - that you're the kind of person who has no respect for the chain of administrative responsibility.  This is especially true if there is even a loose way in which your move contributed to the firing of the other instructor you mention.  \n\nIn my experience, people in hiring chains get really uncomfortable when they discover something they didn't know before - even when the thing is quite small.  (I've seen a hire almost fall apart because of a misunderstanding caused by a typo on a CV.)  This story, when it rears its head, is not small.  It's the kind of thing which all hiring committees fear quite deeply - that a candidate has carefully curated their appearance around some serious problem which everyone is too polite or blinded to discuss.\n\nIn the long-term (if this person is influential today, they will be influential tomorrow), you need to decide whether or not you want to pressure this person to stop or whether you just try what they said in the first place - apologize to them and satisfy their ego.",
      "author": "mediaisdelicious",
      "created": 1562687314,
      "upvotes": 57,
      "replies": {
        "etco2vm": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etco2vm/",
          "text": "Thank you for this reply!  It is very helpful.",
          "author": "GumOnMySeatGUM",
          "created": 1562689065,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "etcglan": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcglan/",
      "text": "I'd complain above the professor's head. Academia is hard enough without someone actively trying to screw you over. Start with his head of department and escalate through to the dean upto more senior university officials demanding action. As an alumnus and graduate student of the university it's incredibly unprofessional for a professor to be actively undermining you.\n\nGather what proof you have about the professor screwing with you and reach out. What they're doing is certainly unethical and likely in violation of University codes of conduct.",
      "author": "boringhistoryfan",
      "created": 1562684279,
      "upvotes": 98,
      "replies": {
        "etcpngm": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcpngm/",
          "text": "The risk here is that reporting may not result in any improved job prospects but will almost certainly screw OP's relationship with the professor even further, and if they're that well-connected, that's bad.",
          "author": "thegreenaquarium",
          "created": 1562690015,
          "upvotes": 24,
          "replies": {
            "etctjv8": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etctjv8/",
              "text": ">and if they're that well-connected, that's bad.\n\nThe damage is already done, dude. The professor, of his own volition, decided to sabotage their own student.  \n\n\n\"oh no, someone is doing everything they can to attack me, I don't want to make it worse\"  \n\n\nIt literally can't get worse. It's time to fight back hard.",
              "author": "aelendel",
              "created": 1562692340,
              "upvotes": 9,
              "replies": {
                "etctlav": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etctlav/",
                  "text": "Oh it can get a lot worse. Dude.",
                  "author": "thegreenaquarium",
                  "created": 1562692365,
                  "upvotes": 29,
                  "replies": {
                    "etg2xb5": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etg2xb5/",
                      "text": "Dude.",
                      "author": null,
                      "created": 1562782760,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "etczfvu": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etczfvu/",
                  "text": "Yeah, I figure that bridge is beyond burned.  So crazy over one email that I thought the school would appreciate.  Feedback from a student -- it was very constructive too.",
                  "author": "GumOnMySeatGUM",
                  "created": 1562695888,
                  "upvotes": 1,
                  "replies": {
                    "etd0s29": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd0s29/",
                      "text": "I think you're being unduly flippant about this. I'm not saying this to take you down a notch (when you are already down, to be frank) - I and others are saying this because not understanding what went wrong here can legitimately harm you if you end up making this mistake again.\n\nFrom your account it does sound like the chair doesn't think highly of you, but consider that, even if they thought you were otherwise a great applicant but still mentioned this incident in their reference, it still would have at minimum given your prospective employer pause. Employees who CC upper management on stuff that isn't upper management business or that isn't their business to report to upper management are annoying, and in some industries (say, management consulting) a liability. And when you are a young specialist going for your first job in the field - i.e. you don't have much to recommend yourself - you can very easily be passed up in opportunities because of a small flaw, especially if you're in a field where everyone's a top student. By the way, this unfortunately goes likewise for situations where you're totally justified in going over a supervisor's head - if the supervisor was sexually harassing you, for example. People can and will ruin your career just because they can, and it's important to pick your battles and develop good relationships with as many people as you can, so that a prospective employer can encounter a critical mass of people they know testifying that you are a strong candidate even if this one weird dude doesn't like you. It's really tough when you're starting out. Good luck.",
                      "author": "thegreenaquarium",
                      "created": 1562696706,
                      "upvotes": 22,
                      "replies": {
                        "etd3p0z": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd3p0z/",
                          "text": "Thanks.  The career I am going in to is far from the business sector, but there is, of course, still hierarchies.  I've actually been a working professional for 14 years in a career (and a manager myself).  I wouldn't do this in my career field.  The mistake is that I was seeing the academic setting as a different beast, when many in this thread are saying that was a wrong assumption.",
                          "author": "GumOnMySeatGUM",
                          "created": 1562698462,
                          "upvotes": 6,
                          "replies": {}
                        }
                      }
                    },
                    "etczmza": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etczmza/",
                      "text": "You made a little breach of etiquette—the response says a lot more about them than you.",
                      "author": "aelendel",
                      "created": 1562696009,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "etcr20g": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcr20g/",
              "text": "Can’t be friends with everyone. The chair has people that probably hate him, I’m sure. No academic is universally loved. OP at least claims that other faculty and staff likes them. They might win some allies by knocking the chair down a notch.",
              "author": "One_Left_Shoe",
              "created": 1562690850,
              "upvotes": -4,
              "replies": {
                "etcr8tj": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcr8tj/",
                  "text": "> They might win some allies by knocking the chair down a notch.\n\nDude, OP is a fresh master's grad looking for his first job in the field. This is *not* the position from which knocking a well-connected department chair down a notch is a good idea, even if it wins you allies.",
                  "author": "thegreenaquarium",
                  "created": 1562690965,
                  "upvotes": 23,
                  "replies": {
                    "etcs426": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcs426/",
                      "text": "He can’t be connected to everyone and is probably not as liked as he thinks. \n\nThe whole “stay in your lane” BS in this thread is mind boggling.",
                      "author": "One_Left_Shoe",
                      "created": 1562691479,
                      "upvotes": -4,
                      "replies": {
                        "etcsqkz": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcsqkz/",
                          "text": "I think you're heavily underestimating the level of vulnerability one has as a young professional. I also don't think anyone here is giving any \"stay in your lane BS\", but rather people are urging OP to consider his actions in the context of his position and not act spherically in a vacuum. Like, I myself had someone out to screw me over when I was in my first job out of college because I also did something naive that pissed them off, and the only reason I'm still in the field is that they were fairly junior themselves and people with more clout stood up for me. That's firstly not OP's position, and secondly, in his position, rather than go to the dean, I would first go to all these professors who admire me so much, explain the situation and ask them for advice, because they know the lay of the land. ime people who advocate your type of scorched earth policy fall into two camps: inexperienced or lucky enough to never have been in this position, or exiled from the field due to a reputation as someone who is irrational and difficult to work with.",
                          "author": "thegreenaquarium",
                          "created": 1562691849,
                          "upvotes": 18,
                          "replies": {
                            "etctvy4": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etctvy4/",
                              "text": "And yet the top comment is to go around the chair. \n\nFiling a professional complaint to a higher up against a vindictive colleague is not being “irrational and difficult to work with.”",
                              "author": "One_Left_Shoe",
                              "created": 1562692543,
                              "upvotes": -2,
                              "replies": {
                                "etcu0fb": {
                                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcu0fb/",
                                  "text": "> Filing a professional complaint to a higher up against a vindictive colleague is not being “irrational and difficult to work with.”\n\nIt's great that you think that.\n\nAlso, the top comment is to complain to the dean.",
                                  "author": "thegreenaquarium",
                                  "created": 1562692617,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "etci02k": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etci02k/",
          "text": "Unfortunately this is the head of the department.  I believe next would be assistant dean.\n\nI'll also consult the code of conduct.",
          "author": "GumOnMySeatGUM",
          "created": 1562685218,
          "upvotes": 30,
          "replies": {
            "etci4x7": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etci4x7/",
              "text": "Then you should definitely escalate. Meanwhile if you know of any senior professors who you can trust to not spill your conversations to him, you should reach out to them for assistance as well. I'm really sorry you're going through this.",
              "author": "boringhistoryfan",
              "created": 1562685306,
              "upvotes": 43,
              "replies": {
                "etcikv2": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcikv2/",
                  "text": "When it all happened about a year ago, I did go to another professor I trusted and told him.  He agreed that the head of the department was being extremely unreasonable.  \n\nI also took notes at the time of the \"threat\" and emailed them to a friend just in case I had to show the notes later... I felt like I was being paranoid but now...",
                  "author": "GumOnMySeatGUM",
                  "created": 1562685598,
                  "upvotes": 23,
                  "replies": {}
                }
              }
            },
            "etcrpcz": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcrpcz/",
              "text": "i had something similar happen with a much less powerful professor. turns out, multiple people disliked the guy! \n\nIf you just need a job quick, try to figure out who else dislikes the department head. That will give you time and resources to plan next steps.\n\nAlso, good on you for doing the right thing.",
              "author": "imthestar",
              "created": 1562691240,
              "upvotes": 13,
              "replies": {
                "etcry0n": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcry0n/",
                  "text": "This right here is exactly what I’m saying. I doubt this chair is without his critics that can’t stand him.",
                  "author": "One_Left_Shoe",
                  "created": 1562691382,
                  "upvotes": 4,
                  "replies": {
                    "etcz5n6": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcz5n6/",
                      "text": "OH believe me, there are MANY who can't stand him.  I am one of the few that is willing to push back against him.  I guess there is a price to pay!",
                      "author": "GumOnMySeatGUM",
                      "created": 1562695713,
                      "upvotes": 1,
                      "replies": {
                        "etczim7": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etczim7/",
                          "text": "Despite the naysayers, I sincerely wish you luck and hope you end up on top. There are obviously risks, but I think you are in the right here and fighting the good fight.",
                          "author": "One_Left_Shoe",
                          "created": 1562695935,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "etczv1n": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etczv1n/",
              "text": "See also if your school has an ombudsman.\n\nFYI retaliation is considered a very serious misbehavior.",
              "author": "flipester",
              "created": 1562696146,
              "upvotes": 15,
              "replies": {
                "etdvuqy": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdvuqy/",
                  "text": "But OP screwed up and the prof is entitled to give negative recommendations and evaluations. How is this retaliation? They didn’t have a personal disagreement; they had a professional disagreement and now he’s tanking OP’s job prospects. Seems a bit bitchy, but totally legit.",
                  "author": null,
                  "created": 1562716522,
                  "upvotes": 5,
                  "replies": {
                    "etg3pw8": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etg3pw8/",
                      "text": "Punishing someone for making  a good faith complaint is retaliation. Going directly over the department head may have been poor judgment, but I believe it is protected poor judgment.",
                      "author": "flipester",
                      "created": 1562783209,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "etctzni": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etctzni/",
              "text": "[deleted]",
              "author": null,
              "created": 1562692604,
              "upvotes": 1,
              "replies": {
                "etczbar": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etczbar/",
                  "text": "I cc:ed the department chair as well as the assistant dean and dean of the school (within the university, if that makes sense).  Honestly I didn't exactly know who was involved where.  This is also a smaller school (not a big state university), if that makes any difference.",
                  "author": "GumOnMySeatGUM",
                  "created": 1562695810,
                  "upvotes": 0,
                  "replies": {
                    "eteg74n": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/eteg74n/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1562731842,
                      "upvotes": 2,
                      "replies": {
                        "etes7lz": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etes7lz/",
                          "text": "Got it, thank you!  And you are 100% correct.  He has some connections -- but not all.  To be honest, I already had some other job offers (turned them down, not the right position) so I know he can't stop me from working ;)",
                          "author": "GumOnMySeatGUM",
                          "created": 1562744494,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "etdq6kx": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdq6kx/",
      "text": "From his side:  He actively doesn't trust you and maybe the person you interviewed with was a friend.  If I don't trust someone and they are interviewing with a friend of mine, you bet I'm going to mention my distrust to them.  It's a small small world.  And oftentimes this is how it works.",
      "author": "printandpolish",
      "created": 1562712507,
      "upvotes": 11,
      "replies": {
        "etesr5s": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etesr5s/",
          "text": "I can see that.",
          "author": "GumOnMySeatGUM",
          "created": 1562745162,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "etcqe2t": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcqe2t/",
      "text": "Ignore everyone saying this is a fireable offense and you should go over the chair’s head (again) and complain about it. Some others have said it but it’s entirely possible the employer reached out and solicited the chair’s opinion in which case it’s no surprise he responded honestly. Such is life.\n\nMy advice would be to do what you can to mend fences with the chair. If he is actually as well-connected as he says he is, he sounds like someone you shouldn’t continue to anger. Set up a meeting, be apologetic, and tell the chair that you didn’t intend to go over his head and you’re very open to criticism. It might be too late to do so because you said this happened some time ago, but I would still try to leave on relatively good terms.",
      "author": null,
      "created": 1562690455,
      "upvotes": 14,
      "replies": {
        "etd17dr": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd17dr/",
          "text": "To clarify:\n\nYou believe I SHOULD report this to the dean?  \n\nYou also say I should mend fences.  Not sure.  \n\nIn my professional field; I'm honestly not too worried about his \"connectedness\".  It isn't like in tech or something where there are \"powerful\" people (sorry, trying to be intentionally vague).  Honestly, once I have a job, it won't matter if this professor has it in his mission to destroy me.",
          "author": "GumOnMySeatGUM",
          "created": 1562696960,
          "upvotes": -1,
          "replies": {
            "etd1eps": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd1eps/",
              "text": "No don’t report because that’s just going over the chair’s head a second time and could make your situation worse. If you’re going into industry maybe repairing the relationship is less important but in academia you might have to deal with this person in some fashion for a long time.",
              "author": null,
              "created": 1562697082,
              "upvotes": 6,
              "replies": {
                "etd4q6o": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd4q6o/",
                  "text": "Oh!  I re-read your comment.  Got it.  \n\nRelationship won't matter after I have a job to be honest.  It's just about getting the job.  (Sorry to be vague, but you'll have to trust me on that one)",
                  "author": "GumOnMySeatGUM",
                  "created": 1562699095,
                  "upvotes": 1,
                  "replies": {
                    "etd63uc": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd63uc/",
                      "text": "Hahaha ok fair enough",
                      "author": null,
                      "created": 1562699961,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "etd970k": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd970k/",
              "text": "Every field that employs humans has some level of connectedness and relationship-building that goes with it. So unless you work in a field that is mostly populated by robots, I'd be skeptical in thinking this professor's connectedness doesn't matter. You've already shared that he's been able to prevent you from getting at least one job that you know of. And there are other kinds of opportunities besides just getting a job.",
              "author": "roseofjuly",
              "created": 1562701843,
              "upvotes": 5,
              "replies": {
                "etd9nd8": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd9nd8/",
                  "text": "You are correct.  I should just say that I don't have any concerns about his influence on my career after I get a job.  The field I am going in to does not have promotions so once you have a job, you have that job as long as you want it (there is no climbing a ladder period).  I know that sounds crazy but it's true.  If I wanted to go back and teach at the university or something, that might be different.",
                  "author": "GumOnMySeatGUM",
                  "created": 1562702123,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "etcgxep": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcgxep/",
      "text": "> There was an issue where I felt like the dean of the department needed to be brought in on a conversation.\n\nYou went to a dean before the department head? Why? Also, why did they listen? You created something of a clusterfuck.\n\n> Do I just chalk this up to how life works? Is the professor within his rights to prevent me from employment based on what he has stated to me?\n\nThem stating it to you was the only weird thing - there are tons of back channels and informal networks related to hiring. People call other people up and ask them for unprepared statements about candidates - any one of these conversations can be damning. That's the way things are. \n\nThe private sector is no different from academia here.",
      "author": "ph0rk",
      "created": 1562684501,
      "upvotes": 39,
      "replies": {
        "etdtscg": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdtscg/",
          "text": ">You went to a dean before the department head? Why? Also, why did they listen? You created something of a clusterfuck.\n\nWhen I was a graduate student, there was a professor who was sexually harassing his students. It was common knowledge that he was doing so, and yet he faced no consequences. This would be a great example of a time to go over the head of the department -- who was enabling the sexual harassment -- to the dean. Which a colleague of mine did. She did ruin her career in the process, but she took her sexual harasser down with him and he was let go in disgrace. Plus, I believe she won a large settlement. \n\n&#x200B;\n\nIn this case, the sexual harasser created the clusterfuck. Not the student who appealed to help from above the head of the department. \n\n&#x200B;\n\nPerhaps the OP was dealing with a similarly serious situation.",
          "author": "episcopa",
          "created": 1562715042,
          "upvotes": 1,
          "replies": {
            "etdyogo": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdyogo/",
              "text": "Sure, harassment is possibly an exception, but I don’t think the dean is the one to contact, nor is doing so in an email cc’d to the chair the right move. There are other structures for that.\n\nI don’t control whether or not someone else’s chair or boss is a dick, but knowing whether or not they are and acting accordingly is *life*. OP should get used to it, because there are petty easily offended people everywhere.",
              "author": "ph0rk",
              "created": 1562718535,
              "upvotes": 3,
              "replies": {
                "ete040a": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ete040a/",
                  "text": ">Sure, harassment is possibly an exception, but I don’t think the dean is the one to contact, nor is doing so in an email cc’d to the chair the right move. There are other structures for that.\n\nWhat structures are there?",
                  "author": "episcopa",
                  "created": 1562719562,
                  "upvotes": 6,
                  "replies": {
                    "ete1z50": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ete1z50/",
                      "text": "Title IX, campus ombudsperson, Human Resources, public safety, Academic affairs... any or all of these would make more sense than the academic dean of a college for that issue.",
                      "author": "ph0rk",
                      "created": 1562720892,
                      "upvotes": 3,
                      "replies": {
                        "ete5ufp": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ete5ufp/",
                          "text": "> Title IX, campus ombudsperson, Human Resources, public safety, Academic affairs... any or all of these would make more sense than the academic dean of a college for that issue.\n\nIf you were made aware of how to navigate campus bureaucracy when you were in your masters program, consider yourself lucky because no one I know was.  In fact, when I was in my graduate program, I was not made aware that Title IX was anything other than a law governing women's sports. I certainly didn't know there was a rep on campus -- I only learned that there may have been one from this subreddit. \n\nHR wouldn't have applied either as grad students are not employees. \n\nAcademic Affairs was a building across campus full of bureaucrats who handled our transcripts. Why would they have anything to do with a professor harassing students?\n\nIn grad school, btw, I did have a colleague who reported an onging sexual harassment issue. When she did, the response she got wasn't one of horror that a professor was harassing his students but that she didn't approach the exact specific correct person when reporting it -- a person that she didn't know existed in a role that no one ever told her had authority over her advisor. \n\nI'm also still not clear why the Dean is not the right person to report to. Doesn't s/he oversee all the programs housed in a given department?",
                          "author": "episcopa",
                          "created": 1562723683,
                          "upvotes": 6,
                          "replies": {
                            "eteo5ml": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/eteo5ml/",
                              "text": "I see this all the time in my university. Professors who know the campus bureaucracy as the palm of their hands get annoyed at students who can't navigate it properly. It's not an innate ability, nobody is born with that knowledge.",
                              "author": "caatbox288",
                              "created": 1562739634,
                              "upvotes": 2,
                              "replies": {}
                            },
                            "etf2nmc": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etf2nmc/",
                              "text": "We need more detail, frankly, because it just looks to me like OP tried to play a power game and lost.\n\nIf they don't know or suspect that the department head of their master's program might have some sway when they look for jobs, they might not be all that clever and this is a valuable lesson.\n\nAnyway, whatever the details are there are almost certainly other steps to take before going to the academic dean - and that's why those other structures exist.",
                              "author": "ph0rk",
                              "created": 1562757922,
                              "upvotes": 2,
                              "replies": {
                                "etfonjv": {
                                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etfonjv/",
                                  "text": "I agree that we need more detail. And it is a valuable lesson. However, I would submit that those other structures are of no value if grad students are not aware that they exist. Hopefully my campus was anomalous and other campuses do a much better job educating students about appropriate and effective ways to report wrong doing.",
                                  "author": "episcopa",
                                  "created": 1562774334,
                                  "upvotes": 1,
                                  "replies": {
                                    "etfrixu": {
                                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etfrixu/",
                                      "text": "> I would submit that those other structures are of no value if grad students are not aware that they exist.\n\nIt isn't my fault if they don't pay attention to the orientation materials. I was made aware of all of this before day 1 at my program and we do the same here. Also, this is all in the required addenda to syllabi here. \n\nIf they don't read it, that's on them.",
                                      "author": "ph0rk",
                                      "created": 1562776089,
                                      "upvotes": 1,
                                      "replies": {
                                        "etlsl7h": {
                                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etlsl7h/",
                                          "text": "[deleted]",
                                          "author": null,
                                          "created": 1562944366,
                                          "upvotes": 1,
                                          "replies": {
                                            "etltcr1": {
                                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etltcr1/",
                                              "text": "> I'd also submit that it says a lot about the corrosive norms of academia that so many people here are more irritated with a potential victim of wrongdoing for failing to know norms\n\nWhy are you assuming OPs issue was sexual harassment? It is just as likely that they are an entitled student that thought they had a better idea of what the curriculum should be. Even if it *was*, they should have done the simplest of internet searches before roping in dean level administrators.\n\nIn any event, failure to understand how an org chart works is on them - and they could just as easily be *fired* in the private sector for the same sort of fuckup. Don't play passive aggressive power games with carbon copies unless one is prepared to burn a bridge, as happened in this case.\n\nPissed off people have pulled what strings they have available to fuck over other people since the dawn of political time. Fragile-egoed office holders have been pissed off when people violate bureaucratic rules since the dawn of the modern bureaucracy. Not knowing how any of that might play out in a given situation might be unfortunate, but it doesn't change the fact that it will play out that way. OP fucked up, whether or not they knew it at the time or understand now precisely how it was a fuckup.\n\n> thesis advisor\n\nDepartment chair. These details do matter.",
                                              "author": "ph0rk",
                                              "created": 1562944862,
                                              "upvotes": 1,
                                              "replies": {
                                                "etlwmzo": {
                                                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etlwmzo/",
                                                  "text": "[deleted]",
                                                  "author": null,
                                                  "created": 1562946965,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "etlx0u4": {
                                                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etlx0u4/",
                                                      "text": ">  taking the side of someone out to ruin someone's career over a single email.\n\nI never once said the head was justified - only that the student was a fool to expect otherwise. \n\n>  As grad students are not employees\n\nThey are employees in most R1 universities. They benefit from all of those rules - that they are clueless about them and don't pay attention to standard HR orientations is on them.\n\n> In other words: a private sector organization that operated using unwritten, unspoken rules and fired people for breaking them -- particularly when offenses were as small as putting the wrong person on cc-- would be unlikely to remain a very successful one for very long.\n\nWhich shows how much time you've spent in the private sector. It is no different there.",
                                                      "author": "ph0rk",
                                                      "created": 1562947204,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "etx1pfd": {
                                                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etx1pfd/",
                                                          "text": "I appreciate that you don't seem to like to acknowledge realities that you don't agree with. \n\nOnce again, and as I have stated several times, my cohort never received a standard orientation. \n\nMy cohort was never was told about the existence of an HR department. \n\nMy cohort was told about the existence of a Title IX rep. \n\nI asked another friend of mine at a different R1 about his orientation and his recollections line up with mine. My experience was not unique. You are assuming that everyone gets a thorough orientation about their rights and about the chain of command. So far, they do not line up with reality. \n\nAlso you are incorrect in your assertion that grad students status as \"employees\" is settled law. \n\nAs for private sector experience, I worked for many years in international finance and currently run a successful consulting firm. So yes, I have private sector experience that has allowed me to personally witness how high employee turnover can contribute to a toxic work environment, and alternatively, how clear, written rules and guidelines can contribute to success.",
                                                          "author": "episcopa",
                                                          "created": 1563289475,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "etx2pai": {
                                                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etx2pai/",
                                                              "text": "> my cohort never received a standard orientation.\n\nTough luck for you. If you'd have done what OP did, you'd have burned a bridge. If you can't realize this, then that's too bad for you. Whether or not you think it is *fair* for such an act to burn a bridge - the bridge is burned. Sometimes it's worth burning that bridge, sometimes it isn't. OP didn't even know that they were burning it. Whoopsie.\n\n> Also you are incorrect in your assertion that grad students status as \"employees\" is settled law.\n\nThey are here. They were in my grad program (state employees, even). But that's largely irrelevant because of the above. Also who fucking cares about duelling anecdata.\n\n> As for private sector experience, I worked for many years in international finance and currently run a successful consulting firm. \n\nAnd you don't understand how OP fucked up? Successful, eh?\n\nPart of functioning within a large bureaucracy is understanding which levers are safe to pull and which will open a trap door to a Mr. Burns-esque pit of alligators. Perhaps because you were at the top of a small bureaucracy you never figured this out - I don't know. I also don't care. Pull the wrong lever and you're fucked - whether or not you think it *ought* to work that way. Because it *does*.",
                                                              "author": "ph0rk",
                                                              "created": 1563290134,
                                                              "upvotes": 1,
                                                              "replies": {
                                                                "etygj43": {
                                                                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etygj43/",
                                                                  "text": "Please point out where I claimed that the OP did not make a mistake, or indicated that I didn't understand that he fucked up. You may wish reread my posts if you would like to continue engaging, as they were very clear and you seem not to have understood them.",
                                                                  "author": "episcopa",
                                                                  "created": 1563317718,
                                                                  "upvotes": 1,
                                                                  "replies": {}
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "etdw606": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdw606/",
              "text": "But this was the first email OP sent. You can’t copy a dean on this type of email until the chair has had a little tile to respond. \n\nIf it’s the sexual harassment issue you mention, you still don’t copy the dean. You email the chair and copy HR and/or your title IX rep.",
              "author": null,
              "created": 1562716743,
              "upvotes": 1,
              "replies": {
                "ete01kn": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ete01kn/",
                  "text": ">But this was the first email OP sent. You can’t copy a dean on this type of email until the chair has had a little tile to respond.  \n>  \n>If it’s the sexual harassment issue you mention, you still don’t copy the dean. You email the chair and copy HR and/or your title IX rep.\n\n&#x200B;\n\nI'm not sure if you, as a grad student, were given a detailed and specific set of instructions as to the chain of command and various layers of bureaucracy. I certainly wasn't, and this was five years ago at a very good R1. I was not told I had a Title IX rep. I didn't even know that such a person existed until very recently. We also didn't have HR since we were students, not employees. All we knew was that we should bring concerns to our advisors or to other faculty members we trusted. If our advisors and faculty members were enabling or causing serious problems, however, what then? No one knew. \n\n&#x200B;\n\nAnd btw, this was not only at my school. I have another friend who just finished her PhD another prestigious R1. Her advisor treated his female students differently from his male students, asking them to get his dry cleaning, pick him up from the airport, and make coffee. Did I mention that he was the department head? She told other faculty members she trusted; they shrugged their shoulders. She did not know that Title IX applied to this situation or that there was anyone to even report him to. \n\n&#x200B;\n\nIt's also interesting that your issue is not with the entire department enabling sexual harassment but rather that a sexually harassed grad student may have followed the wrong protocol in trying to address the situation?",
                  "author": "episcopa",
                  "created": 1562719515,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "etdbhla": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdbhla/",
          "text": "You can't expect a student to have that level of subtle understanding of the leadership structure of a university. Students shouldn't have to play politics. It should have been the dean and department head's responsibility to sort out what level the complaint should be addressed at, at first at least. If CCing the dean in an email causes this many problems, that indicates a major problem in the faculty that's hardly the student's fault.\n\nEspecially as a *master's* student, they are pretty junior, and are more served by the university than working for the university - they're not quite full employees, and you shouldn't expect them to behave like it.",
          "author": "Astrokiwi",
          "created": 1562703271,
          "upvotes": 3,
          "replies": {
            "etdbno0": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdbno0/",
              "text": "It isn't that subtle.",
              "author": "ph0rk",
              "created": 1562703378,
              "upvotes": 3,
              "replies": {
                "etdc607": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdc607/",
                  "text": "At that junior stage, students are closer to customers than employees. The management should be presenting a fairly united front to them. Anything else is unprofessional.",
                  "author": "Astrokiwi",
                  "created": 1562703685,
                  "upvotes": 3,
                  "replies": {
                    "etdc852": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdc852/",
                      "text": "OP is/was a graduate student. Wrong.\n\nBut it doesn't matter: I'm explaining how it *is*, not how it *ought* to be.",
                      "author": "ph0rk",
                      "created": 1562703718,
                      "upvotes": 4,
                      "replies": {
                        "etdcrfz": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdcrfz/",
                          "text": "Masters students are still very junior. But grad students in general shouldn't really need to be aware of any politics in the department at all. Their supervisor should be sorting all that out, unless something is very broken.\n\nEdit: they also say elsewhere in the thread that it's a course based masters with no research anyway.",
                          "author": "Astrokiwi",
                          "created": 1562704019,
                          "upvotes": 4,
                          "replies": {
                            "etdds20": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdds20/",
                              "text": "If what is essentially a fifth year undergraduate can't figure out that cc'ing a dean like that is liable to create a shitstorm I don't think I'd want to hire them, either.",
                              "author": "ph0rk",
                              "created": 1562704593,
                              "upvotes": 7,
                              "replies": {
                                "etdpq3f": {
                                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdpq3f/",
                                  "text": "Legit. A lot of people here (off of OP's post) are assuming that the chair said horrible things to intentionally torpedo OP's chances, when all it could've been was\n\nchair OP is a great applicant, but one time he did this thing with me and the dean one time that wasn't very opportune\n\nemployer: this other guy has the same credentials as OP but shows no sign of disrespecting professional norms or being difficult to work with, let's go with him instead",
                                  "author": "thegreenaquarium",
                                  "created": 1562712191,
                                  "upvotes": 5,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "ete7e4h": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ete7e4h/",
                          "text": "This is not how it was at my graduate university. If I had cc'd the dean I may have gotten a stern talking to but my advisor would not have set out to destroy my career 18 months later.",
                          "author": "episcopa",
                          "created": 1562724829,
                          "upvotes": 2,
                          "replies": {
                            "etf2lqy": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etf2lqy/",
                              "text": "It was the department head from OP's original post, but the point is you go outside the chain of command at your own risk. I don't care if people think the department head's reaction is absurd - he has the power to do it, and if he is feeling petty and slighted, he will.",
                              "author": "ph0rk",
                              "created": 1562757868,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "etchrkl": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etchrkl/",
          "text": "I should clarify.  I did go to department head first but cc:ed the dean as I thought they should be in the loop.  You can disagree with me on whether that was right or not; clearly the professor thought it was extremely wrong.",
          "author": "GumOnMySeatGUM",
          "created": 1562685062,
          "upvotes": -3,
          "replies": {
            "etci9pt": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etci9pt/",
              "text": "> I did go to department head first but cc:ed the dean as I thought they should be in the loop\n\nThat's pretty much the same thing as going to the dean, unfortunately.\n\nThis is something that is just as important in the private sector, if not more so - stepping out of the org chart can create vicious enemies that happen to be in positions of power over you. Don't do it.",
              "author": "ph0rk",
              "created": 1562685393,
              "upvotes": 43,
              "replies": {
                "etcirjt": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcirjt/",
                  "text": "It's too bad.  I would hope that people would want to better the program and be happy to have others in on the conversation.  In my work world (I work full time while going to school), I am always happy to have everyone in on the conversation.  I guess I am naive to think others also come from this same understanding.",
                  "author": "GumOnMySeatGUM",
                  "created": 1562685722,
                  "upvotes": -1,
                  "replies": {
                    "etcm6ww": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcm6ww/",
                      "text": "Part of the \"game\" is figuring out how to manage egos. Going over someone's head (or even [to the side](https://www.youtube.com/watch?v=oZoCmeXgE9U) ) can make people irrationally pissed off, and they take that out on you later.\n\n>  I am always happy to have everyone in on the conversation\n\nThey don't see this as *your* call to make - and they are the one in charge.",
                      "author": "ph0rk",
                      "created": 1562687891,
                      "upvotes": 41,
                      "replies": {
                        "etcmvzw": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcmvzw/",
                          "text": "Then the game is toxic and deserves to change or die.",
                          "author": "One_Left_Shoe",
                          "created": 1562688330,
                          "upvotes": -3,
                          "replies": {
                            "etcn35r": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcn35r/",
                              "text": "Good luck with that.\n\nYou have to win by the extant rules before you can propose new ones.",
                              "author": "ph0rk",
                              "created": 1562688451,
                              "upvotes": 24,
                              "replies": {}
                            },
                            "ete6sgl": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ete6sgl/",
                              "text": "not sure why you are getting so downvoted. Academia is incredibly toxic and full of people with precious egos. Not sure why that's something worth preserving.",
                              "author": "episcopa",
                              "created": 1562724379,
                              "upvotes": 5,
                              "replies": {
                                "etfi6i5": {
                                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etfi6i5/",
                                  "text": "Q: \"not sure why you are getting so downvoted.\"\n\nA: \"Academia is incredibly toxic and full of people with precious egos.\"\n\nEdit: Don't mean to be flippant or dismissive to you, but I expect that some of those precious egos post (or at least vote) here.",
                                  "author": "m_a_n_t_i_c_o_r_e",
                                  "created": 1562770225,
                                  "upvotes": 3,
                                  "replies": {
                                    "etfoguh": {
                                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etfoguh/",
                                      "text": "You make a solid point.",
                                      "author": "episcopa",
                                      "created": 1562774220,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                },
                                "etesiiz": {
                                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etesiiz/",
                                  "text": "Agreed, though I did post this in \"AskAcademia\", so I guess I should expect to get responses from people hoping to retain the status quo.",
                                  "author": "GumOnMySeatGUM",
                                  "created": 1562744872,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "etco6wh": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etco6wh/",
                              "text": "What game? This is true in any sector - academic or not. Are you suggesting we kill off capitalism? Sure, I'm down; now tell me how.",
                              "author": "WrestlingStuffGuy",
                              "created": 1562689133,
                              "upvotes": 13,
                              "replies": {
                                "etcpjhp": {
                                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcpjhp/",
                                  "text": "I don’t know if it’s capitalism or just human nature. I think people generally don’t like feeling as though they’ve been “stepped over”, or made to feel less important than they see themselves, regardless of the structure they’re working within.",
                                  "author": "heatherdunbar",
                                  "created": 1562689949,
                                  "upvotes": 7,
                                  "replies": {}
                                },
                                "etcperk": {
                                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcperk/",
                                  "text": "No, the game of managing egos. Something about this feels fishy. No mature adult should throw a petty fit because their boss was informed of a situation. If he knew the faculty being reported was “dropping the ball” numerous times, this should not have been an issue beyond a, “well, this was bound to happen.”  Ego or no, taking out a grudge long after the fact (let alone threatening a student, sheesh) should be heavily reprimanded. Maybe it’s because I’m not in the situation, but I would have gone straight to the dean (again) after the department chair made threats to derail their graduation and harm my future employment. \n\nThis isn’t a capitalism issue, but an if the game means someone being able to punish a student because they had a grudge or an ego trip, *they* should be the one getting a reprimand, not the student. \n\nI less there is a whole lot more to this story, the prof should not be chair in charge of students.",
                                  "author": "One_Left_Shoe",
                                  "created": 1562689870,
                                  "upvotes": 4,
                                  "replies": {
                                    "etcq2x6": {
                                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcq2x6/",
                                      "text": "With the caveat that we don't actually know the details of what happened, I'd say the dean overreacted, sure. And for that reason /u/ph0rk's advice is even more relevant. They're not saying that what the dean is doing is right or that this is a good situation or how things should go - they're saying that this is what often happens as a result of taking the sort of action OP did, and that OP should be aware of this in the future. Perhaps the dean is a vindictive asshole on a powertrip, or, given OP almost certainly didn't have the full picture of what was going on, perhaps OP inadvertently stepped in a hornet's nest. I've seen people's prospects in a career field destroyed for similar unintentional errors. It's really important that you think carefully about how you're going to speak truth to power when you are a person with no power yourself.",
                                      "author": "thegreenaquarium",
                                      "created": 1562690270,
                                      "upvotes": 8,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "etcowde": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcowde/",
                      "text": "Just as an FYI--if you're ever working somewhere and you witness serious issues (sexual misconduct, ethics violations, etc...not just something that \"makes you look bad\") you should absolutely report it. There are whistleblower laws in place to give some amount of protection.\n\nJust note that \"the boss\" isn't necessarily the right person to report it to.",
                      "author": "ProbabilisticWorld",
                      "created": 1562689561,
                      "upvotes": 9,
                      "replies": {
                        "etd1w74": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd1w74/",
                          "text": "This was what I came here to say. If the initial offense was really something major enough to get the dean involved right away, you'd be protected from retaliation by whistleblower laws and possibly internal university policies.\n\n&#x200B;\n\nThe OP sounds like it was not that type of thing, but nobody should be afraid to report things like Title IX violations or anything else that rises to that level.",
                          "author": "AgoRelative",
                          "created": 1562697375,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    },
                    "etd9md8": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd9md8/",
                      "text": "This is a flippant way of looking at it that isn't going to help you in the future. Without knowing what you reported it's hard to tell, but why is it that you couldn't \"better the program\" by talking to this faculty member directly without cc'ing the dean? This is the kind of thing that will piss off colleagues in the future, so you'd do well to really understand why this professor is so upset.",
                      "author": "roseofjuly",
                      "created": 1562702106,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                },
                "etcxn78": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcxn78/",
                  "text": "For you, /u/po2gdHaeKaYk , /u/WrestlingStuffGuy and /u/science_bia  , I really don't understand at all why what OP did is such a faux pas; can any of you explain it to me?",
                  "author": "jabberwockxeno",
                  "created": 1562694781,
                  "upvotes": 1,
                  "replies": {
                    "etcz4dt": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcz4dt/",
                      "text": "[Chain of command](http://www.businessdictionary.com/definition/chain-of-command.html).\n\nBureaucracies don't work if everyone contacts the dean for all their issues. People in middle management/administration do not like it when an underling goes around them and creates a new thing the dean can lord over them or be pissed at them about.\n\nEdit: I've worked in private sector orgs where this would be considered insubordination and a disciplinary offense.",
                      "author": "ph0rk",
                      "created": 1562695690,
                      "upvotes": 14,
                      "replies": {
                        "etduiui": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etduiui/",
                          "text": "\"not liking it,\" sure. But using it as an excuse to ruin someone's career? Months later? This speaks to serious mental issues that should maybe be addressed. How is this guy treating his grad students if he is behaving this way over one email?",
                          "author": "episcopa",
                          "created": 1562715564,
                          "upvotes": 1,
                          "replies": {
                            "etdyt1o": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdyt1o/",
                              "text": "People are assholes. Wishing they weren’t is a waste of effort.",
                              "author": "ph0rk",
                              "created": 1562718626,
                              "upvotes": 3,
                              "replies": {}
                            },
                            "etdup7a": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdup7a/",
                              "text": "This is how people are. It's all middle school all the life course long.",
                              "author": "ph0rk",
                              "created": 1562715691,
                              "upvotes": 3,
                              "replies": {
                                "ete6zjx": {
                                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ete6zjx/",
                                  "text": "No...it's really not. I'm  not surrounded by people like this, and never have been.   Also \"people\" who \"are\" like this should not be in charge of students.",
                                  "author": "episcopa",
                                  "created": 1562724526,
                                  "upvotes": 9,
                                  "replies": {
                                    "etf2mdv": {
                                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etf2mdv/",
                                      "text": "That's an ought, not an is.",
                                      "author": "ph0rk",
                                      "created": 1562757887,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "etd0b80": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd0b80/",
                          "text": "While I agree with the spirit of what you are saying there are also exceptions to the rule where the chain of command can and should be broken. Until we know what the offense was, can't really say, I suppose. If OP feels like the chair knew about and/or was protecting the person they were ratting out, they are within their right to break chain of command without suffering consequence.",
                          "author": "One_Left_Shoe",
                          "created": 1562696422,
                          "upvotes": -2,
                          "replies": {
                            "etd0kyb": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd0kyb/",
                              "text": "Even in those scenarios, the smartest thing to do most of the time is notify the head first - for CYA purposes just like this one. That OP isn't grokking this leads me to believe this was not one of those times where cutting out the department head was warranted.",
                              "author": "ph0rk",
                              "created": 1562696586,
                              "upvotes": 10,
                              "replies": {}
                            },
                            "etd9edd": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd9edd/",
                              "text": "The OP says they actually sent the email directly to the chair but cc'd the dean, so this doesn't fall into that category.",
                              "author": "roseofjuly",
                              "created": 1562701967,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "etd52xv": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd52xv/",
                      "text": "Get your supervisor, I'll explain it to them",
                      "author": "respeckKnuckles",
                      "created": 1562699317,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "etdudbu": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdudbu/",
                      "text": "In the real world, it likely would not have been. I work in the private sector now and did for many years before going to academia. In the event that someone had emailed me with my boss on cc to express a concern, I would have taken my boss off cc in my reply and that would be it. Would it have been annoying? Sure. Worth \\*ruining someones's career over and nursing my resentment over this for a period of months or years\\*? Absolutely not.",
                      "author": "episcopa",
                      "created": 1562715455,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "etcy0f4": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcy0f4/",
              "text": "By doing that, you are (unintentionally) implying to both the department head and the dean that you don't think the department head is competent enough to handle this on his own.",
              "author": "n23_",
              "created": 1562695005,
              "upvotes": 10,
              "replies": {}
            },
            "etdtxlm": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdtxlm/",
              "text": "Academia is particularly obsequious in its deference to and reverence of authority. It is cloaked in the discourse of inclusiveness and student centered whatever, so it's understandable that you didn't realize as such. Now you know. It's a hard lesson to have learned.",
              "author": "episcopa",
              "created": 1562715143,
              "upvotes": 2,
              "replies": {
                "eteskny": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/eteskny/",
                  "text": "Agreed.  Especially ironic considering this professor's area of study (has to do with empowerment).  A good reminder of what the field is like.  Glad I'm not going into academia.",
                  "author": "GumOnMySeatGUM",
                  "created": 1562744943,
                  "upvotes": 1,
                  "replies": {
                    "etfpx6p": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etfpx6p/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1562775121,
                      "upvotes": 1,
                      "replies": {
                        "ethxypb": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ethxypb/",
                          "text": "It's true.  I should also say that my program is VERY low investment in terms of time by both students and professors.  \n\nI had one meeting in 3 years with my advisor.  Until I read your post, I forgot I even had one!  It was a 45 minute meeting with the members of my cohort.  That was the only time I ever met with him.  \n\nMuch less involvement than in my undergrad experience where I actually got to know professors and my advisor.  \n\nMy program was: you go to class (mostly taught by adjuncts), do your work, turn it in.  During the third year you find yourself a place to do an internship.",
                          "author": "GumOnMySeatGUM",
                          "created": 1562830974,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "etcjpwv": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcjpwv/",
              "text": "I was taught that this is proper email form, just cc anyone who should be aware, but apparently not...",
              "author": "djingrain",
              "created": 1562686332,
              "upvotes": -1,
              "replies": {
                "etcpm6s": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcpm6s/",
                  "text": "Then, as someone who has been a manager in the private sector and is a professor in the academic, let me tell you that's **terrible** practice.\n\nIn this case, the student in question was jumping *at least* three levels up the org chart (student -> professor -> department head -> dean) for a *first informing* of an issue. **That's horrible practice** and is likely to upset everyone in said chain.\n\nThis isn't a comment on the department chair (allegedly) sinking this students long-term employment prospects, it's just advice on how to avoid such a situation.",
                  "author": "WrestlingStuffGuy",
                  "created": 1562689994,
                  "upvotes": 26,
                  "replies": {
                    "etcxwjc": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcxwjc/",
                      "text": "> the student in question was jumping at least three levels up the org chart\n\nThis is the key thing I think OP isn't getting here.\n\nProfessors are in charge of making sure students are doing their jobs. \n\nChairs are in charge of making sure professors are doing their jobs.\n\nDeans are in charge of making sure chairs are doing their jobs.\n\n&#x200B;\n\nBy a **student** bringing a matter concerning a **professor** to a **dean**, it implies that the chair either doesn't care or is incapable of solving the problem (if there even is a problem). \n\n&#x200B;\n\nHow would the CEO of a company react to finding out someone in the mail room was emailing the Board about things a vice president was doing? It wouldn't be pretty unless there was a ***REALLY*** good reason.\n\n&#x200B;\n\nu/GumOnMySeatGUM, your original intentions don't matter now. You have two basic options to directly address this: 1) Contact the chair and say whatever you need to in order to get them to consider the matter settled (apologize), or 2) try to bring them down so they can't hurt you any more. Do note that while it may feel satisfying, #2 is probably the worst thing you can try until you have a job. Even if you take them down, they can portray you to others as being vindictive, untrustworthy, and petty. As others have noted, this *can* still get worse.\n\nAlternatively, keep doing your job search and don't engage and hope they lose interest. I'd either apologize or ignore them myself UNTIL I had a job I planned to stay in for a long time. THEN I'd happily set about exposing how crappy this person is, and see if I can't return the favor.",
                      "author": "ouemt",
                      "created": 1562694939,
                      "upvotes": 16,
                      "replies": {
                        "etd0qgd": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd0qgd/",
                          "text": "Thank you for this thoughtful comment.  \n\nI have NO intention of doing anything until I have a job.  This all happened 18 months ago so I thought it was in the past, but apparently not.  \n\nI do plan on bringing this all to the assistant dean once I do have a job.  If I stepped on the department head's toes, so be it.  But the bullying/threats seems out of proportion.  I'll share it with the assistant dean and be done with it.  It'll be in his hands to do with it as he wants.",
                          "author": "GumOnMySeatGUM",
                          "created": 1562696678,
                          "upvotes": 0,
                          "replies": {
                            "etd0xko": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd0xko/",
                              "text": "To be clear, since I didn't address it in my original comment, what they're doing is WAY out of line.\n\nBest of luck.",
                              "author": "ouemt",
                              "created": 1562696797,
                              "upvotes": 1,
                              "replies": {
                                "etd47i3": {
                                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd47i3/",
                                  "text": "> what they're doing is WAY out of line\n\nYou sure about this?  I'm not seeing anything that can't be explained by Chair just mentioning 'oh, btw, this guy has had some difficulty in the past respecting institutional and professional norms.'",
                                  "author": "lucianbelew",
                                  "created": 1562698774,
                                  "upvotes": 8,
                                  "replies": {
                                    "etd4n8o": {
                                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd4n8o/",
                                      "text": "Three relevant questions:\n\n1) Is this in the US?\n\n2) What precisely did the chair say to the company?\n\n3) Did the chair contact the potential employer, or did the employer reach out to the chair?\n\n&#x200B;\n\nWe don't know the answers to these, so we can't say how bad it is, sure. However, if you're willing to burn down someone's career over a single gaff, you're a terrible person.\n\n&#x200B;\n\n...Which raises it's own set of questions, but I'm going off what's written here. :)",
                                      "author": "ouemt",
                                      "created": 1562699043,
                                      "upvotes": 5,
                                      "replies": {
                                        "etd4tby": {
                                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd4tby/",
                                          "text": "One relevant question:\n1) Are you sure there's just one single gaffe here?",
                                          "author": "lucianbelew",
                                          "created": 1562699151,
                                          "upvotes": 4,
                                          "replies": {
                                            "etd4x28": {
                                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd4x28/",
                                              "text": "That would be one of the questions mentioned at the end of my last post...",
                                              "author": "ouemt",
                                              "created": 1562699216,
                                              "upvotes": 2,
                                              "replies": {
                                                "etd56e8": {
                                                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd56e8/",
                                                  "text": "It just seems weird that you're willing to assert so confidently that what they're doing is \"WAY out of line\" when there are so many unanswered questions that are relevant to that claim.",
                                                  "author": "lucianbelew",
                                                  "created": 1562699377,
                                                  "upvotes": 3,
                                                  "replies": {
                                                    "etd5el7": {
                                                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd5el7/",
                                                      "text": "It’s reddit, not a court of law. Based off of the information I have, that’s my opinion, and it will continue to be my opinion unless I get more information. ¯\\\\\\_(ツ)\\_/¯",
                                                      "author": "ouemt",
                                                      "created": 1562699521,
                                                      "upvotes": 2,
                                                      "replies": {
                                                        "etd5nx9": {
                                                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd5nx9/",
                                                          "text": "Fair enough. I don't suppose we'll ever learn enough to know exactly what took this off the rails.",
                                                          "author": "lucianbelew",
                                                          "created": 1562699683,
                                                          "upvotes": 2,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "etcwqfu": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcwqfu/",
                      "text": "Dang lol. Well if there is one unanticipated benefit to this thread, a whole bunch of people (myself included) learned to cc with caution going forward. I had never thought about how it might be interpreted.",
                      "author": "AcrobaticOpinion",
                      "created": 1562694245,
                      "upvotes": 6,
                      "replies": {
                        "etd07jd": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd07jd/",
                          "text": "Heh, glad to have helped.\n\nAs /u/djingrain mentioned elsewhere, it's not like there's a manual on this, so I really do understand. I've also made mistakes like this in the past. This is something that takes time (and usually a few mistakes) to learn.",
                          "author": "WrestlingStuffGuy",
                          "created": 1562696359,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "etcpb1z": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcpb1z/",
      "text": "Since this conversation has really turned out to be about professional norms, you might like to check out the [Ask A Manager](http://www.askamanager.org) blog. It's a good resource for understanding and learning how to navigate a workplace. (There's also good job search/cover letter/resume/interview advice for when you get to that point.)",
      "author": "ProbabilisticWorld",
      "created": 1562689809,
      "upvotes": 6,
      "replies": {
        "etd0uav": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd0uav/",
          "text": "Thanks.\n\nBelieve it or not I'm actually a mid career professional and have been a manager for a number of years which is one reason why I was so shocked by his response.",
          "author": "GumOnMySeatGUM",
          "created": 1562696743,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "etcisvo": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcisvo/",
      "text": "I can see why the chair is pissed at you. I would be pissed too, and you would also be pissed if someone did this to you. Basically, you implied to the dean that the chair is ignoring a problem by cc'ing them. Sending an email and cc'ing someones boss is a move you make when the other person is not responding or performing their duties.",
      "author": null,
      "created": 1562685746,
      "upvotes": 28,
      "replies": {
        "etcjk5y": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcjk5y/",
          "text": "I was straight up taught that CCing was just for \"hey, just want to make sure that everyone is on the same page so we don't have to spend hours getting someone caught up down the road type things\" and if you were doing something like this, you would BCC them... There's not really a class on this stuff, and I feel like the HoD is being a total ass TBH",
          "author": "djingrain",
          "created": 1562686231,
          "upvotes": 4,
          "replies": {
            "etclfdu": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etclfdu/",
              "text": "There are times when CC'ing is appropriate. 1) This was not one of those times. There is big differences between: \"Someone is fucking up and making us look bad. CC: the dean\" and \"We are planning a industry student mixer and are looking to schedules times when faculty will be available. CC: the dean\".",
              "author": null,
              "created": 1562687405,
              "upvotes": 24,
              "replies": {}
            },
            "etck61j": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etck61j/",
              "text": "That was my intention (being completely honest).  I felt like the dean should know (I also am not super familiar with academia) to help improve the program.  I have definitely learned about the hierarchy (and egos...) in academia from this!!",
              "author": "GumOnMySeatGUM",
              "created": 1562686616,
              "upvotes": -3,
              "replies": {
                "etcluz0": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcluz0/",
                  "text": "This is not even an academia thing... this is an everywhere thing. You think executives at major companies don't have egos?",
                  "author": null,
                  "created": 1562687679,
                  "upvotes": 26,
                  "replies": {
                    "etco5x8": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etco5x8/",
                      "text": "Very true!",
                      "author": "GumOnMySeatGUM",
                      "created": 1562689116,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "etcjo0g": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcjo0g/",
          "text": "I wouldn't be upset if someone cc:ed my boss to be honest.  It has happened before to me.  I appreciate everyone being involved in the conversation.\n\nHowever, this is also different because it is in academia where I am a student.",
          "author": "GumOnMySeatGUM",
          "created": 1562686298,
          "upvotes": -2,
          "replies": {
            "etcvy4z": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcvy4z/",
              "text": "> it is in academia where I am a student.\n\nGrad students are basically apprentice-employees in academia. It's still a professional setting, not a strictly classroom one.",
              "author": "valryuu",
              "created": 1562693773,
              "upvotes": 8,
              "replies": {
                "etd4353": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd4353/",
                  "text": "A professional setting where you are paying tens of thousands of dollars to the people that have power over you.  Such a strange thing... I digress!\n\nAlso, the program I am in isn't at all research based (ie we don't work for the professors), but I get what you are saying.",
                  "author": "GumOnMySeatGUM",
                  "created": 1562698699,
                  "upvotes": 2,
                  "replies": {
                    "etdmtfh": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdmtfh/",
                      "text": "> paying tens of thousands of dollars to the people that have power over you\n\nTrade apprenticeships sometimes do the same thing.\n\nAlso, you're not paying the professor's directly. You're paying the university, who is them paying the professors. You're treating this like it's a business where you are a customer as a student, as if it is \"unfair\" that professors have power over you if you're a customer.\n\nHonestly, you need to suck things up. You say you're willing to learn, but you're not even accepting what anyone is telling you for such a small thing as academia being a career/job.\n\nEDIT: Didn't read the last half of your comment carefully. But my point still stands. You're not paying the professors as a customer.",
                      "author": "valryuu",
                      "created": 1562710200,
                      "upvotes": 6,
                      "replies": {}
                    },
                    "ete0a3n": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ete0a3n/",
                      "text": ">A professional setting where you are paying tens of thousands of dollars to the people that have power over you.\n\n... and where the people who have power over you operate within a series of unspoken, unwritten rules and norms and are basically accountable to no one. And can determine unilaterally, with no oversight, if you graduate, how long it takes you to graduate, and if you can get a job when you finish.",
                      "author": "episcopa",
                      "created": 1562719682,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "etd9yag": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd9yag/",
              "text": "It depends on why. I'd be upset if someone thought I'd dropped the ball and their FIRST response was to cc my boss while emailing me. Bring it to me first and let us handle it, and only then if I don't handle it go go my boss. (Excepting egregious things, of course).",
              "author": "roseofjuly",
              "created": 1562702311,
              "upvotes": 4,
              "replies": {}
            },
            "etcsd4e": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcsd4e/",
              "text": "[deleted]",
              "author": null,
              "created": 1562691626,
              "upvotes": 18,
              "replies": {
                "etczqb8": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etczqb8/",
                  "text": "Thank you for the feedback.  I'd be happy to share more details in direct message.",
                  "author": "GumOnMySeatGUM",
                  "created": 1562696066,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "etd08mk": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd08mk/",
          "text": "That may be, but he's going out of his way to sink his job opportunities. That's much worse in my mind.",
          "author": "Average650",
          "created": 1562696377,
          "upvotes": 0,
          "replies": {
            "etd803j": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd803j/",
              "text": "Unless he has proof that this occurred, it is all hearsay. If he is going out of his way to sink the student... he is going too far. If the company contacts him and asks what he thinks, he is well within his rights to state his thoughts. We also have no idea what this situation actually was/is.",
              "author": null,
              "created": 1562701111,
              "upvotes": 4,
              "replies": {
                "etdavrk": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdavrk/",
                  "text": "All of reddit is hearsay so that's all I'm going to go on. \n\nBut yes sure, if the company contacted him then yes nothing wrong with giving what you think. \n\nOf course, I'd be really surprised if companies were routinely contacting department heads when they hire students.",
                  "author": "Average650",
                  "created": 1562702894,
                  "upvotes": 2,
                  "replies": {
                    "etdffr4": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdffr4/",
                      "text": "I also never heard of department heads checking to see where a student is interviewing... Not sure how they would know that either.",
                      "author": null,
                      "created": 1562705501,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "etcmxok": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcmxok/",
      "text": "At this point people have brought up the reason why the chair is (rightfully) pissed at you.  That being said the chair is overstepping their role entirely and wasting a lot of time being an asshole (regardless of the cluster fuck that ensued behind the scenes). The way I see it there are two ways to move forward:\n\n1. Reach out to the chair and tell them that it was never your intent to jump the ladder. You apologize for any inconvenience it caused him with the dean (who when he received the email assumed the chair wasn’t doing his job). At this point you should mention that an employer has let you know that the chair (someone who is not listed as a reference) has effectively prevented you for gaining employment. (Side Note: this is an incredibly stupid move on his part because it reflects poorly on the school’s employment statistics. It’s also incredibly stupid because it opens him up to a lawsuit if he continues to prevent you from gaining employment.) Ask him why he has chosen to intentionally harm your ability to get a job at (name the place) and ask him how the two of you can resolve the matter without it escalating. \n\n2. Do all of the above in a meeting with you the dean and the department chair. \n\nSince this is a pretty serious issue, talk to a lawyer (family friends typically are willing to offer some advise  off the record). In addition keep records of absolutely everything - check if your state allows you to record conversations regardless of the other person’s consent (I think it’s a one party consent law or something along those lines) so that you would have records of your in person conversations. \n\nI’m sorry this has happened to you. This is completely beyond the pale and no one should waste their time by going out of their way to harm a student’s ability to succeed.",
      "author": "imjustbrowsing123",
      "created": 1562688358,
      "upvotes": 15,
      "replies": {
        "etdx5c5": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdx5c5/",
          "text": "I’m no expert in employment law, but if the chair is conveying what he believes is an honest account of OP’s indiscretion to a potential employer, he’s pretty well covered under free speech protections unless he’s knowing saying something untrue and heading into libel/slander territory. Maybe if the chair also says he won’t work with anyone that hires OP, then there’s a conspiracy case but a labor lawyer would have to weigh in.",
          "author": null,
          "created": 1562717435,
          "upvotes": 6,
          "replies": {}
        },
        "eteedr5": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/eteedr5/",
          "text": "It's not really clear if the department chair went out of their way. If a company has connections from that department that respect the chair, especially at a small company/startup, it's not certain that the department chair went out of their way to tank this job offer (or even likely, considering that this was apparently an interaction from a year and a half ago). If people from the company reached out to the chair, a lukewarm response or just the facts could just as easily have killed their chances of an offer. The company is well within their right to solicit feedback from other people in their industry/circle even if they aren't listed references. And I don't know how OP is convinced that they basically had the offer in hand.",
          "author": "AnimaLepton",
          "created": 1562730277,
          "upvotes": 4,
          "replies": {}
        },
        "etcoamb": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcoamb/",
          "text": "Thank you.  I appreciate your thoughtful response.",
          "author": "GumOnMySeatGUM",
          "created": 1562689196,
          "upvotes": 2,
          "replies": {}
        },
        "etcxw3y": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcxw3y/",
          "text": "> At this point people have brought up the reason why the chair is (rightfully) pissed at you.\n\nNot OP, obviously, but I see a lot of people saying \"it's bad don't do that\" without explain *why* it's seen as bad, which I'm still baffled by.",
          "author": "jabberwockxeno",
          "created": 1562694932,
          "upvotes": 3,
          "replies": {
            "etd1e28": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd1e28/",
              "text": "Think of it this way:\n\nThe role of a dean is to take care of the administrative functioning of a college (ex. The business school of a university), promote the faculty and hail their achievements, and fundraiser like hell.\n\nThe role of a department chair is to take care of some of the administrative stuff for the department, advocate for the faculty, serve as the second layer for student complaints (immediate professor is the first layer), and still handle all the normal responsibilities of a professor.\n\nTypically a dean is involved in student issues when there the department chair cannot handle the issue (based on university rules), or if the department chair is dragging their feet or is otherwise being ineffective. By CCing the dean before the chair has a chance to rectify the situation OP inadvertently creates anger and confusion. The dean is (should be) busy and will only know that there is a problem and the chair has not solved it. This results in the chair having a less than pleasant discussion with the dean. The dean wants the issue fixed, but the chair may still need to talk to the problem faculty member. This results in a cluster fuck of clueless anger - the dean doesn’t know why the chair hasn’t fixed the problem and the chair doesn’t have enough information to effectively enlist the support of the dean. As a result, the chair has to play defense for a faculty member that has a complaint out against him that the dean now knows about - this is a lose-lose situation for the chair. Now the dean is pissed and knows there’s an issue and can use it as a weapon in future discussions (exaggeration: Look Mike we all know you don’t know how to handle student problems maybe it’s time for a change in leadership within the department). \n\nBasically OP created a fuck ton of problems for the chair by CCing someone before they actually needed that person’s help. This translates into the business world as well in a much more extreme way. Faculty have tenure which provides some protection. In the business world OP’s boss would begin being an ass and try to get rid of him (to another team) ASAP. However, everyone knows OP doesn’t understand the role of a hierarchy and doesn’t want to deal with him anymore. This means that the only way up in the world would be out of the firm.",
              "author": "imjustbrowsing123",
              "created": 1562697070,
              "upvotes": 8,
              "replies": {
                "etd4fiz": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd4fiz/",
                  "text": "I follow your comment.  \n\nI still think that there is something different about this being a position where I am a student.  I am thinking that part over.  I would never do this (email my bosses boss) in a career situation, but in this position (as a student) it felt very different.  Let me stew on this for a bit.",
                  "author": "GumOnMySeatGUM",
                  "created": 1562698912,
                  "upvotes": -1,
                  "replies": {
                    "etd8194": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd8194/",
                      "text": "For your professor this is a career situation and this is the equivalent of emailing your bosses (problem professor) bosses (chair) boss (dean). While being a student allows you some leeway in many situations this is one where you inadvertently caused a problem in a real world career situation - this isn’t something people tell you at orientation (some students would take advantage of this type of info without understanding that it could land them in your situation). \n\nThe perception that this isn’t a career situation is a very incorrect understanding of the situation. Being a graduate student does not absolve you of being as ignorant as an undergraduate.",
                      "author": "imjustbrowsing123",
                      "created": 1562701131,
                      "upvotes": 14,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ete05yc": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ete05yc/",
              "text": "I too am baffled. You're not alone here.",
              "author": "episcopa",
              "created": 1562719600,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "etd73ia": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd73ia/",
      "text": "You went over your chair’s head before giving him a chance to address the situation.  In my observations of multiple workplaces, you are dead in the water when you do this.  Always follow the chain of command—in academia and in industry.\n\nThat being said, this chair is going to extreme lengths to get back at you.  You need to evaluate whether you should speak with the dean, or if you can break into the industry without further antagonizing the chair.",
      "author": "CyberJay7",
      "created": 1562700564,
      "upvotes": 5,
      "replies": {}
    },
    "etcj1h1": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcj1h1/",
      "text": "People can provide whatever kind of reference they want. It's well within their rights, even if the reference they provide doesn't match with your expectations. \n\nPersonally, I would have also been upset by your decision to go above that individual's head. It's bad form in any sort of professional situation to do this, and, I would agree with the individual. It does show a lack of maturity in work place problem solving to jump the queue. \n\nBe aware that negative references can come from everywhere for any number of reasons, and they are often a part of everyone's academic experience, or at least they were in mine. I had several faculty in my program outright tell me not to list them as references. It happens.",
      "author": "cdb3492",
      "created": 1562685900,
      "upvotes": 16,
      "replies": {
        "etck53g": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etck53g/",
          "text": "A lot of people (at least where I went to high school, idk about rest of the world) are taught that CCing anyone who could be impacted by something (and isn't necessarily supposed to be secret) should be Cc'ed in emails, and emails are directly sent to the people it's intended for, everyone else is just being kept in the loop. I feel like it's unreasonable to be upset about OP for not knowing the political implications of using an email feature for it's intended purpose",
          "author": "djingrain",
          "created": 1562686600,
          "upvotes": 4,
          "replies": {
            "etclcjc": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etclcjc/",
              "text": "OP cc'ed the dean in the same convo as the department chair, which is more less forcing the issue in a very unprofessional way. This is a classic example of abusing a CC. This is very different than CC'ing a bunch of people all working collaboratively on a project to keep people in the loop.",
              "author": "cdb3492",
              "created": 1562687357,
              "upvotes": 11,
              "replies": {
                "etcqjlc": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcqjlc/",
                  "text": "I used to think that the CC disasters I'd see (or hear about down the grapevine - yes, people, you look ridiculous enough for the entire office to gossip about you for years after) were drunk or sending the email under a big emotional impulse. From this thread I have understood that a large proportion of people have 0 clue about basic office etiquette!",
                  "author": "thegreenaquarium",
                  "created": 1562690546,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "etcxq1w": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcxq1w/",
          "text": "> Personally, I would have also been upset by your decision to go above that individual's head. It's bad form in any sort of professional situation to do this, and, I would agree with the individual. It does show a lack of maturity in work place problem solving to jump the queue. \n\nI don't see why this is seen as rude or problematic, can you explain?",
          "author": "jabberwockxeno",
          "created": 1562694829,
          "upvotes": 1,
          "replies": {
            "etcybez": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcybez/",
              "text": "If there is a problem in my academic unit, I should be the one to solve it. I manage 5 staff members during any semester, and it's just ludicrously inefficient to have my staff members contacting my superior to file complaints. I am the one that will ultimately manage the response, so my boss would simply deflect the complaints back to me. This happens **all** the time, and it essentially means multiple people have to deal with the same issue. \n\nOn a personal dimension, this CC move is often done to intentionally get people in trouble with superiors. It's a way of bypassing regular communication channels in an effort to shame some one, or make it look like some one isn't doing their job. It's annoying, and it's done because a person doesn't have good/mindful communication ability. I don't know about you, but I don't want to work with people that can't clearly articulate problems for us to collectively solve and would rather commit to a course of action intentionally designed to get some one in trouble.",
              "author": "cdb3492",
              "created": 1562695195,
              "upvotes": 7,
              "replies": {
                "etd4jbt": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd4jbt/",
                  "text": "But I am not one of your staff members.  I am one of your students.  Does that change your comment at all?  (honestly asking)",
                  "author": "GumOnMySeatGUM",
                  "created": 1562698977,
                  "upvotes": -2,
                  "replies": {
                    "etd4yuu": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd4yuu/",
                      "text": "Nope.",
                      "author": "lucianbelew",
                      "created": 1562699246,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "etd8hpa": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd8hpa/",
                      "text": "My staff are students, so no.",
                      "author": "cdb3492",
                      "created": 1562701412,
                      "upvotes": 4,
                      "replies": {
                        "etd9uae": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd9uae/",
                          "text": "Ah, got it.  Mine is a bit of a different situation.",
                          "author": "GumOnMySeatGUM",
                          "created": 1562702240,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "etcjyqs": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcjyqs/",
          "text": "I guess one of my issues is that this wasn't a professional situation.  I am a student, they are the professor that holds power over me.  \n\nI understand your perspective.  To be honest, I wouldn't do this in a professional setting.  I saw school as a different setting, but I guess that in some people's opinion that isn't the correct way to do it.  \n\nI did not provide this faculty as a reference.  I believe this was an unofficial conversation that he had with the person hiring.",
          "author": "GumOnMySeatGUM",
          "created": 1562686491,
          "upvotes": -2,
          "replies": {
            "etckoyu": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etckoyu/",
              "text": "> I wouldn't do this in a professional setting. I saw school as a different setting\n\nSchool is absolutely a professional setting.",
              "author": "lucianbelew",
              "created": 1562686947,
              "upvotes": 18,
              "replies": {
                "etcov0r": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcov0r/",
                  "text": "It is for sure, sorry, I may have misspoke.  I do think that there is a bit of a difference though -- being a student is different than being an employee.",
                  "author": "GumOnMySeatGUM",
                  "created": 1562689539,
                  "upvotes": -5,
                  "replies": {
                    "etcpez7": {
                      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcpez7/",
                      "text": "Sure, but being an employee isn't the only circumstance that means you're in a professional setting.  Regardless of the minor variations in subtype of professional setting, what you did was bad form for **any** professional setting.  \n\nYou might have set it to rights by acting like a student - making it clear to the chair that you hadn't realized the norm applied here, but now that you do, you'll learn, grow, evolve, whatever.  Doesn't sound like you did that, which to me sounds like you don't have a lot of respect for professional settings.  \n\nHas it occurred to you that perhaps the chair is just honestly communicating that, in their experience, you don't have a tendency to treat professional relationships as you might be expected to?",
                      "author": "lucianbelew",
                      "created": 1562689874,
                      "upvotes": 11,
                      "replies": {
                        "etd1y5c": {
                          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd1y5c/",
                          "text": "It's possible that, based on this one experience, that is what he is honestly communicating.  \n\nUnfortunately our conversation was very much \"I'm right, you are wrong. And if you don't admit that I'm going to take you down.\"  It was very much a bullying posture -- he had all the power in the situation and didn't want to hear anything of it -- including making it clear how well connected he was so I better be careful.  \n\nThe ironic thing is that in my career and professional life, I am one of the most boundaried and professional people you will find (I know a lot in this thread will find that hard to believe).  I guess I thought of myself as a student was a bit different.  I suppose in a way I was seeing it more as almost a \"customer\" position (I know that sounds privileged) but as a student, according to folks here, I should have been seeing myself as an inferior (for lack of a better term).  The issue was over the way a system was improperly set up and it was hurting students.  I thought it was important for those to know.  Hindsight 20/20?  I would NOT have cc:ed the dean (if nothing else but to avoid this mess).",
                          "author": "GumOnMySeatGUM",
                          "created": 1562697408,
                          "upvotes": -3,
                          "replies": {
                            "etd3he1": {
                              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd3he1/",
                              "text": "What you aren't getting is that your actions as a student are 100% part of your professional life.  You were extremely unprofessional in this instance, and it's quite clear that you don't have enough professional integrity to recognize that.  So, no, you aren't 'one of the most boundaried and professional people' I will find.  \n\n> I guess I thought of myself as a student was a bit different. I suppose in a way I was seeing it more as almost a \"customer\" position (I know that sounds privileged) but as a student, according to folks here, I should have been seeing myself as an inferior\n\nThe fact that the only two options you see are either customer or 'inferior' is extremely telling here.  Neither is remotely right.  You were supposed to see yourself as a professional colleague, and conduct yourself accordingly.  You didn't, which royally pissed this guy off, and if your posture here is anything to go on, it's pretty easy to see his side of things.  It's quite clear that you thought you didn't have to respect this venue.  Now you're reaping what you've sown on that.\n\nYour best bet is to reach out to the chair and see if you can make things right, but honestly, he's probably already got a pretty well formed understanding of who you are in relation to his program, and there won't be a lot you can do to change that.",
                              "author": "lucianbelew",
                              "created": 1562698332,
                              "upvotes": 9,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "etckx62": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etckx62/",
              "text": "This 100% is a professional situation. This is 100% the chair's profession. You were not discussing academic points; you were discussing faculty conduct.",
              "author": null,
              "created": 1562687088,
              "upvotes": 19,
              "replies": {}
            },
            "etclkg3": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etclkg3/",
              "text": "I'd also say that this isn't unique to academia. Every job that I've worked (as a professor, graduate student, and in the private sector) has had some degree of informal references at play. It's just the way all of this works, and school is not an a-professional space. \n\nReport issues directly up the chain of command in the future. Lesson learned.",
              "author": "cdb3492",
              "created": 1562687494,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "etdh5qe": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdh5qe/",
      "text": "What was your complaint about? I think there is a lot of background information missing that stops me from actually understanding the story. I normally do not find it normal what he/she is doing but I personally don't know what happened that made him want to do this and I think that is of great importance to know as well. You need to hear both sides in order to form a proper idea of the story and that way you we are able to give you proper advice.",
      "author": null,
      "created": 1562706546,
      "upvotes": 3,
      "replies": {}
    },
    "etcmihw": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcmihw/",
      "text": "Honestly the problem here is you applied to a position directly connected with the professor who you know wants to tank you.",
      "author": "pastaandpizza",
      "created": 1562688094,
      "upvotes": 5,
      "replies": {
        "etcn25q": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcn25q/",
          "text": "I’m fairly certain OP didn’t ask the chair if they were connected with the employer before applying.",
          "author": "imjustbrowsing123",
          "created": 1562688433,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ete9zko": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ete9zko/",
      "text": "For feedback, it's generally good not to give it in writing unless you've talked through it first. It's very easy to misconstrue how something is being said in writing vs. having it as a conversation, feeling like the tone of a message is accusatory, etc.\n\nWhile it's good to escalate situations before there's a firestorm, don't escalate to someone else's supervisor/boss lightly, especially before giving them a chance to correct whatever the issue is. If I have negative/needs improvement feedback for my boss, I absolutely want him to know about it personally rather than airing it to our co-workers/team, to other supervisors, or to his supervisor. I expect the same from my co-workers, or people who are indirect managers/supervise my work in other contexts. It's better that I get feedback from them directly. Wait to give it to my manager until it's a severe/repeated issue or if it's something good. Good feedback needs to be timely, actionable, and can't be anonymous. In this case, it's perfectly possible that you put the department chair in hot water with the Dean because you didn't give sufficient notice to resolve the situation before roping in his superior, and he's right to be upset about that.\n\n[A couple relevant AskReddit comments from today about similar situations.](https://www.reddit.com/r/AskReddit/comments/cb3ieh/what_bs_are_you_dealing_with_at_work_right_now/etd0i58/)\n\nOn the one hand, many companies don't even go through all your listed references. On the other, 'backdoor' reference checks aren't uncommon, depending on industry and your listed experience/education. More often than not (in industry), listed references are nice but not *extremely* valuable, since you'll only list references that have good things to say. It's normal to reach out to shared references even if they aren't listed. If I were to hire someone from my alma mater in my major, where the graduating class is in the ~50-70 range, it wouldn't be weird to give a passing call to my professors/academic advisors/references there. Or if I see they have past experience at a company where I have a friend/old work colleague that I trust, I'd reach out to that person to see what they think.\n\nFor an industry analogue, it's as if your boss did something bad, but rather than going to his manager about it, you jumped straight to the VP or CEO, which reflects very poorly on that manager.",
      "author": "AnimaLepton",
      "created": 1562726792,
      "upvotes": 2,
      "replies": {}
    },
    "eteik4z": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/eteik4z/",
      "text": "Talk to your university Ombudsman.  This kind of thing is their job.  They are supposed to be impartial and give advice to help solve conflicts.  This is obviously abusive behavior.",
      "author": "dampew",
      "created": 1562733923,
      "upvotes": 2,
      "replies": {}
    },
    "etf8fq8": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etf8fq8/",
      "text": "[deleted]",
      "author": null,
      "created": 1562763305,
      "upvotes": 2,
      "replies": {
        "ethxstt": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ethxstt/",
          "text": "I am not going into academia.  I got a masters' degree so I can work in a certain field.  I'm not sure what you are talking about with community colleges.\n\nI know I posted this in AskAcademia so I should expect answers about the life of Academia.  I was asking this, though, form a student perspective.",
          "author": "GumOnMySeatGUM",
          "created": 1562830811,
          "upvotes": 1,
          "replies": {}
        },
        "etfuy3q": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etfuy3q/",
          "text": "[deleted]",
          "author": null,
          "created": 1562778114,
          "upvotes": 1,
          "replies": {
            "etfwmb3": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etfwmb3/",
              "text": "[deleted]",
              "author": null,
              "created": 1562779099,
              "upvotes": 1,
              "replies": {
                "etfxjh0": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etfxjh0/",
                  "text": "> It seems like it was done with the intention to get the fired professor fired or reprimanded and to make the head of the department look bad.  \n  \nI suppose if you immediately ascribe malice to it then it might look that way. I guess I see it as someone who looped in the dean because they thought it was important, but didn't consult a flowchart of the chain of command first, which probably doesn't even exist.  \n  \n>Escalating without first speaking to the party to get a resolution is extreme.  \n  \nI guess I didn't see where that was said.  \n  \n>I just can't imagine a situation where someone would do this, with that level of education, without understanding it was wrong and would have repercussions. It seems like they thought it would benefit them at the time and then got upset when it did not.  \n  \nI can't imagine a situation where the \"repercussions\" of what is in reality an incredibly minor breach of of the nebulous chain-of-command by someone with precisely zero power to change anything would involve a lifetime of career punishment after that person has left the place where the breach occurred.  \n  \n>But for a graduate student to do this, who has that much education, has navigated grants, application processes, admissions, taken exit exams...as well as their tone and comments it seems like it was done to directly hurt someone.  \n  \nMaybe it varies by field, but I never encountered a grant application, admission form, or exit exam that included anything about office politics and borderline psychotic acts of retribution from administrators. But maybe that sort of thing should be included from now on.",
                  "author": null,
                  "created": 1562779641,
                  "upvotes": 1,
                  "replies": {}
                },
                "ethxolz": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ethxolz/",
                  "text": "I think you are making some huge assumptions -- including what is required of a grad student (grants, application processes, exit exams).",
                  "author": "GumOnMySeatGUM",
                  "created": 1562830687,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "etdtf8z": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdtf8z/",
      "text": "Academics tend to talk a good game about inclusiveness and liberalism, but when the rubber meets the road, they are generally extremely deferent to authority, in thrall to prestige and credentialism, and unwilling to break rank to openly criticize even the grossest of abuses. You may notice these tendencies at play throughout this comment thread, with the people herein chastising you for going over someone's head rather than taking issue with a tenured professor trying to ruin your life over \\*sending an email.\\*",
      "author": "episcopa",
      "created": 1562714785,
      "upvotes": 2,
      "replies": {}
    },
    "etfo95u": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etfo95u/",
      "text": "How bad was the thing you reported ? Like something that is illegal or something that goes against the school code of conduct.",
      "author": "Be_quiet_Im_thinking",
      "created": 1562774087,
      "upvotes": 1,
      "replies": {
        "ethy1cs": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ethy1cs/",
          "text": "Not illegal.",
          "author": "GumOnMySeatGUM",
          "created": 1562831045,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ete4mtu": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ete4mtu/",
      "text": "I have nothing great to add except it sounds like the department head is on a power trip. I work in a small office and many times the CEO is copied on emails with small issues at hand. My boss does not see it as a power play at all. She realizes that the CEO needs to be aware of what's happening.",
      "author": "thefaith1029",
      "created": 1562722809,
      "upvotes": 1,
      "replies": {
        "eteow92": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/eteow92/",
          "text": "Yeah, from outside academia this is nuts.",
          "author": "zap1000x",
          "created": 1562740441,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "etd7275": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd7275/",
      "text": "This is a really gray situation that is hard to judge. Yes you shouldn’t have jumped the chain of command at your university in your first email. You should only ever bring in your supervisor’s supervisor if your supervisor is not handling the issue. However, if this is the only thing that the department head has against you then he is being a bit too vindictive. We don’t know the full story so you could have done other negative stuff and this was just the icing on the cake. \n\nAssuming this was a one time incident and this person is just holding a grudge, I would try and contact him directly. Make it clear you are apologizing for going over his head and try and repair bridges wherever they are broken. Despite what other people are saying, you shouldn’t come in guns blazing with a team of lawyers. Only bring in the legal system if it becomes clear that this is directed unjust treatment. \n\nEven if you do hash things out you may still have to accept that it will be hard for you to find a job in your field. People talk so if negative information about you is already out there then there may not be much you can do. I personally wouldn’t include this story in any correspondence with potential employers unless they ask about it explicitly. Having something like this in an application almost guarantees that they will investigate the situation themselves.",
      "author": null,
      "created": 1562700542,
      "upvotes": 1,
      "replies": {}
    },
    "etdax6a": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdax6a/",
      "text": "Fuck that fucking power hungry asshole of a professor. There is no excuse for this except bullying and ego-driven bullshit. \n\nI don't know the specifics of the situation, but there is no condition under which this level of retribution is appropriate. Even if you did behave unprofessionally, YOU WERE A STUDENT who was still learning. You didn't assault anyone, commit fraud, or any really serious offense that would bring your character into question. \n\nThis is in no way normal. I would gather evidence of this professor interfering, and then take the complaint as high as you can. This kind of bullshit is overlooked all the time in academia which is why this is such as sick industry.",
      "author": "bomchikawowow",
      "created": 1562702919,
      "upvotes": -2,
      "replies": {}
    },
    "etcnk0m": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcnk0m/",
      "text": "The department chair was mad because someone else was acting in a way that reflected poorly on the school? Had this been addressed before? Sound sto me like your chair is having a power trip and was attempting to protect that other employee for whatever reason. Obviously this wasn’t the first offense if the faculty was let go. Did you report the faculty to anyone else before? I agree that going to the dean May have been a bit much the first go around, but your chair overreacted. \n\nIt might make things worse, but have you co texted the employer to defend yourself? You did say they liked you, so maybe they will be willing to listen. It may come down to a “is that why Bill is mad? He does have a temper about little things some times.”  Granted it could all go to pot and you poss them and their connections off, too.",
      "author": "One_Left_Shoe",
      "created": 1562688741,
      "upvotes": -2,
      "replies": {
        "etcojd1": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcojd1/",
          "text": "Thank you.  \n\nNo, not sure that my input had anything to do with the other faculty being let go.  He was clearly not doing his job, which is why I cc:ed the dean.  Hindsight 20/20, now I would go to the chair first.  I honestly didn't know the chain of command (if you will).  But I also think the dean should have been made aware (clearly, since the other professor was doing such a poor job that they let him go).",
          "author": "GumOnMySeatGUM",
          "created": 1562689343,
          "upvotes": 0,
          "replies": {
            "etcqeep": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcqeep/",
              "text": "Your chair is being a child.  Now, had you bcc’d the dean....yeah, ok, that could be a problem. \n\nUnless there is more to this story, dollars to donuts, I bet the chair knew about the behavior you reported and got in trouble with the Dean.",
              "author": "One_Left_Shoe",
              "created": 1562690460,
              "upvotes": 0,
              "replies": {
                "etd213v": {
                  "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd213v/",
                  "text": "Bingo.",
                  "author": "GumOnMySeatGUM",
                  "created": 1562697457,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "etcvez3": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcvez3/",
      "text": "[deleted]",
      "author": null,
      "created": 1562693451,
      "upvotes": -4,
      "replies": {
        "etd28pt": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd28pt/",
          "text": "That's not true, at least not in the US. Reference checkers can speak to anyone they want, and as long as the professor gave factual information, he's not doing anything that could lead to legal action.",
          "author": "AgoRelative",
          "created": 1562697582,
          "upvotes": 4,
          "replies": {
            "ete8krl": {
              "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/ete8krl/",
              "text": "Are you a lawyer?",
              "author": "episcopa",
              "created": 1562725724,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "etd26k4": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd26k4/",
          "text": "I was wondering about that.  I was a manager at my job (I was working full time as a student).  I got reference checks all the time and always had to be extremely careful with what I said for fear of lawsuit.",
          "author": "GumOnMySeatGUM",
          "created": 1562697546,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "etdcsbg": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdcsbg/",
      "text": "If I were you,I’d find a way to apply for jobs and not include him whatsoever. How did he get called? You used him as a reference?",
      "author": "Dorothy_Day",
      "created": 1562704033,
      "upvotes": 0,
      "replies": {}
    },
    "etctco1": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etctco1/",
      "text": "\\> Do I just chalk this up to how life works? Is the professor within his rights to prevent me from employment based on what he has stated to me? Thoughts? \n\n  \nBurn him to the ground. What he's done is incredibly stupid. People get degrees so that they can have jobs. By going out of his way to attack you, he has basically declared that his students aren't supported.   \n\n\nI would seriously consider checking with a lawyer. Call the school's ombudsman. Copy all the records you have. Get ready to post about it openly on twitter. His behavior is beyond the pale and completely not warranted.   \n\n\nHe's sabotaging a student because he thinks you made him look bad. Perfect--time to actually make him look bad for his very bad behavior.",
      "author": "aelendel",
      "created": 1562692220,
      "upvotes": -6,
      "replies": {}
    },
    "etcp3uz": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcp3uz/",
      "text": "I'm an undergrad student working through my bachelors and a military contract right now, with aspirations to head toward a graduate degree one day. Although I'm far behind you academically, I've had my fair share of lousy people try to interrupt my plans.\n\nI have to say, this sounds grossly unethical in any walk of life, be it academia, a minimum wage job, the military or wherever. If someone is actively trying to undeservingly sabotage your prospects in an already barren job market, I would have to act. \n\nFirstly, meet with them face to face and confront them directly, try to understand why they feel justified acting the way they're acting. Dont go in swinging, be reasonable. Try to level with them and let then know how this affects you. If it's something you can handle civily while looking them in the eye, that's the best way to cut the problem off at the start. I'd imagine another email chain would only infuriate them further at this point in time.\n\nSecondly, if the confrontation works, awesome! Case closed. If not, and you feel they're acting in a brash and unethical/immoral manner, tell them exactly who you're going to escalate this to. No one is the king of everything, everyone answers to some department chair, dean or supervisor of sorts. At the very least, they have a human resources department that forbids certain actions and behaviours. This may make them change their tone and want to settle it with you peacefully. Alternatively, it might peeve them of further. If it does, all the more reason to escalate. \n\nMost crucially, however, you need to assess the risk involved with all this. Is it worth it to go to such lengths to maybe get this professor reprimanded, or furthermore, fired? If this professor is a bull-headed, \"I'm always right and have no room to change\" type of person, confronting them may make their effort to ruin your prospects even more nefarious. Should you choose not to go after them and let it happen, can you live with the fact that you didnt stand up for yourself, or will it be a regret you carry into your later life?\n\nAll questions you need to ask and answer before proceeding. If it were me, I'd walk into that professors office and do as I suggested above. In a world where everyone's at each others throats, and in a job market where literally thousands of qualified applicants chase the same one job opening, you've gotta take a stand.",
      "author": "bucketbiz9429",
      "created": 1562689686,
      "upvotes": -7,
      "replies": {
        "etd2hqy": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etd2hqy/",
          "text": "Thank you for this thoughtful response.  \n\nI don't think I can live with not letting someone at the school know what happened -- for no other reason than I don't want this to happen to another student.\n\nHowever, I will for sure wait until I have a job to do it. \n\nHonestly, at this point I don't think a conversation with the department head will help.  I know that he has threatened another student in a nearly identical way.  I think that is just how he operates.",
          "author": "GumOnMySeatGUM",
          "created": 1562697730,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "etdo3xw": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdo3xw/",
      "text": "[deleted]",
      "author": null,
      "created": 1562711083,
      "upvotes": -5,
      "replies": {
        "etdxl5n": {
          "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etdxl5n/",
          "text": "Libel has to be knowingly false speech and OP just said that he usurped the hierarchy. There is no libel claim when you actually did the stupid thing that they are telling people you did.",
          "author": null,
          "created": 1562717746,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "etcgb8n": {
      "link": "/r/AskAcademia/comments/cb1tbp/grad_school_professor_telling_people_not_to_hire/etcgb8n/",
      "text": "[removed]",
      "author": null,
      "created": 1562684095,
      "upvotes": -28,
      "replies": {}
    }
  }
}