{
  "sid": "r2hvde",
  "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/",
  "title:": "A Student Is Asking Me for A Letter of Recommendation, But I'm...Just An Adjunct Professor...",
  "text": "This post is exactly what the title says.\n\nShe's an excellent student that I would write an absolutely great letter for, but...I'm only an Adjunct Professor with ONLY a master's degree (Master of Science in Immunology), and NO doctorate.\n\nShould I tell her to ask a higher-ranking Professor, or should I just write her letter, regardless??  \n\nAny opinions or suggestions would be greatly appreciated!",
  "author": "_Doctor_D",
  "created": 1637912379,
  "updated": 1638206310,
  "over_18": false,
  "upvotes": 167,
  "upvote_ratio": 0.96,
  "comments": {
    "hm4vhb5": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm4vhb5/",
      "text": "Write the letter.\n\nAlso, tell her that having multiple letters from different ranks may be advisable. Kinda depends on what the letter is for, honestly. \n\nBut don’t sell yourself short. It sounds like you’re in a great position to speak to the student’s strengths.",
      "author": "dr_police",
      "created": 1637915436,
      "upvotes": 366,
      "replies": {
        "hm8z11m": {
          "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm8z11m/",
          "text": "Yep: knowing the student and their capabilities trumps any particular academic rank.",
          "author": "halavais",
          "created": 1637996152,
          "upvotes": 4,
          "replies": {
            "hm93i7q": {
              "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm93i7q/",
              "text": "Ideally for the student, they’d have both, because there absolutely are some circumstances where rank/reputation of the letter writer matters. \n\nOP’s role in that is merely to tell the student this when agreeing to write the letter — it’s on the student to assemble the right mix of letter writers for the task at hand.",
              "author": "dr_police",
              "created": 1637999540,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hm5nrae": {
          "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm5nrae/",
          "text": "This",
          "author": "octaviousearl",
          "created": 1637936702,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "hm5o9wj": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm5o9wj/",
      "text": "I had a great relationship with my adjunct professor as an undergraduate. He wrote amazing letters on multiple occasions and got me to where I am now. I frequently speak to his classes and provide his students with career advice :) I recommend writing the letter since it will reflect your enthusiasm for this student.",
      "author": "Bearz34",
      "created": 1637936979,
      "upvotes": 112,
      "replies": {}
    },
    "hm5wsd4": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm5wsd4/",
      "text": "I'm a sessional lecturer.  No Ph.D.  No permanent contract.  I write letters of recommendation all the time.\n\nHaving taught for sixteen years probably helps my credibility.\n\nSome recommendation forms ask for information about research capability.  I have only limited information about this, and answer accordingly, but also provide my instincts (and state accordingly).\n\nI should also note that one of my two letters of recommendation for my own graduate program was from a fellow sessional lecturer.  Her class is the one in which I recorded my strongest academic result, so I thought she was in a good position to evaluate me, and she did so happily.  And, of course, I got in.",
      "author": "PhotoJim99",
      "created": 1637941219,
      "upvotes": 43,
      "replies": {}
    },
    "hm5u3zw": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm5u3zw/",
      "text": "Absolutely write the letter. I have read letters from Noble prized winners and letters from lecturers. What matters is you known the student and that will show in the letter. The student should get multiple letters, of course, but some maybe of the “I had the student and they got an A” variety, so your letter will matter.",
      "author": "econdoc67",
      "created": 1637939946,
      "upvotes": 23,
      "replies": {}
    },
    "hm5r8vh": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm5r8vh/",
      "text": "A great letter is a great letter, but I would encourage you not to mention your own educational background. That isn’t normally something you would go into anyway. The fact that you are an adjunct is not a big deal, but it will help if you provide some context for your assessment. The recipients cannot assume how much research and teaching you have done, nor how much experience you have with students, so, for example, “She’s the best student I have ever worked with,” can mean radically different things if this is your first time teaching vs. if you have been working with them for decades.",
      "author": "bigrottentuna",
      "created": 1637938528,
      "upvotes": 11,
      "replies": {}
    },
    "hm6opqz": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm6opqz/",
      "text": "If the letter is for an academic position then tell her what you told us: you think she is an excellent student and that you could write a great letter for you, but your letter might carry less weight because you have less experience than other profs. And encourage her to seek additional letters from people that can complement your letter (so most likely, folks who can focus on her research, etc?)\n\nIf the letter is for industry then it doesn't matter that you are an adjunct with a masters. Just write her that strong letter.",
      "author": "DevFRus",
      "created": 1637953706,
      "upvotes": 10,
      "replies": {
        "hm7n94g": {
          "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm7n94g/",
          "text": "First reasonable comment I have read here. \n\n&#x200B;\n\n>because you have less experience than other profs\n\nMaybe a good way to say it to the student, but in reality that is not the reason. Adjunct positions are low prestige positions in academia and prestige in the main currency that matters, if this letter is for an academic position.",
          "author": "CaptainCornerCamper",
          "created": 1637970005,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hm67rny": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm67rny/",
      "text": "Write the letter.  The chance that anyone will care what your position is is pretty small.  The chance that they'll check what degree(s) you have is even smaller.  It is still an academic reference.  The student asked because you can write a good letter, do it!  (I mean like, if you have the time).\n\nI've had this discussion with my wife before (who is an adjunct).  She has written letters and many of those people ended up in grad school/ law school etc.",
      "author": "dbrodbeck",
      "created": 1637946119,
      "upvotes": 10,
      "replies": {}
    },
    "hm4rr7i": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm4rr7i/",
      "text": "I think you're selling yourself short.  Write away! Do you use Microsoft word?",
      "author": "Int_traveller",
      "created": 1637912563,
      "upvotes": 29,
      "replies": {}
    },
    "hm6gsss": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm6gsss/",
      "text": "Wrote a letter of recommendation for a student when I was a TA in graduate school. Not sure if it helped, but they’re in pharmacy school now! I was able to say some good stuff about them and they had more one on one interaction with me than any of their actual professors, so I hope it read as sincere. I feel like that makes a bigger difference than your title.",
      "author": "DoctorSlim69",
      "created": 1637950096,
      "upvotes": 5,
      "replies": {}
    },
    "hm8ar1m": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm8ar1m/",
      "text": "Well, if it's for admission to a PhD program, then a letter from an adjunct without a PhD will be less compelling, but it still has the potential to add more value than a letter from a tenured full professor which only states that the student received a good grade in their class, if it is able to provide an in-depth perspective into the academic qualities of the student in question.\n\nHowever, at the end of the day, an offer of admission to a highly competitive PhD program with an offer of funding will still require at least one glowing letter of recommendation from a professor with an independent research reputation that understands the research expectations of a highly competitive PhD program.",
      "author": "mleok",
      "created": 1637981867,
      "upvotes": 4,
      "replies": {}
    },
    "hm5e0jv": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm5e0jv/",
      "text": "Write the letter. Post doc students also can write the letter. Adjunct professor for sure can write it.",
      "author": "casperbunny",
      "created": 1637930855,
      "upvotes": 16,
      "replies": {
        "hm7m9sw": {
          "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm7m9sw/",
          "text": "There is no such thing as a \"post doc student\".",
          "author": "CaptainCornerCamper",
          "created": 1637969533,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hm618ot": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm618ot/",
      "text": "The quality of the letter trumps the writers credentials. My best was from a B.S. I interned at in my undergrad",
      "author": "HappyHrHero",
      "created": 1637943250,
      "upvotes": 10,
      "replies": {}
    },
    "hm6dovw": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm6dovw/",
      "text": "I agree with others that you absolutely can write the letter. However, it depends a bit what the letter is for. When I was applying to PhD programs, I was advised by many people that my letter writers should have PhDs so they can best gauge whether I would be successful in a PhD program. \n\nThis was for top 10 schools in my field. If the letter is not for PhD admissions, or is for other sorts of programs, this probably wouldn’t matter. Not trying to dissuade you- maybe just let the student know!",
      "author": "oueslabibliotheque",
      "created": 1637948729,
      "upvotes": 3,
      "replies": {}
    },
    "hm7mnxc": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm7mnxc/",
      "text": "What is the recommendation letter for?\n\nIf it is for some kind of academic position then your student should absolutely look for letters from the highest status academics they can get letters from. This means full professors if possible. The other posters here are delusional if they think the social status of the letter writer is less important than your enthusiasm for and knowledge of the student. Social status and prestige is the main currency in academia.\n\nYou are right to be skeptical about it being a good idea for you to write this letter. Too many academics don't want to face the reality of how academia works and are willing to be irresponsible with the careers and futures of the people who depend on them. Good on you for trying to be realistic and responsible.",
      "author": "CaptainCornerCamper",
      "created": 1637969718,
      "upvotes": 4,
      "replies": {}
    },
    "hm6kc9o": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm6kc9o/",
      "text": "The best chemistry teacher I ever had in college only had a Master’s degree. Some people are just born to teach. Hope you had a great life Mr. Lehman.",
      "author": "Final_Maintenance319",
      "created": 1637951691,
      "upvotes": 2,
      "replies": {}
    },
    "hm6ofr8": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm6ofr8/",
      "text": "I had someone ask me for a letter of recommendation into an undergraduate degree program when I was still a grad student. I had them double-check that it was okay, although I don’t think you’d need to do that here. You should be fine. \n\nIn the letter, I mentioned that I’d worked closely with them in the lab I taught. I wanted it to be clear why it made sense for the letter to come from me. I was able to include specifics about their strengths that I don’t think most professors would have known about. \n\nIf you’re the best person to write this letter, it doesn’t matter if you’re an adjunct.",
      "author": "StringOfLights",
      "created": 1637953580,
      "upvotes": 2,
      "replies": {}
    },
    "hm6wkhc": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm6wkhc/",
      "text": "I would go for it, yeah. I’ve written letters for students even as a TA!",
      "author": "chuchinchichu",
      "created": 1637957401,
      "upvotes": 2,
      "replies": {}
    },
    "hm6yrec": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm6yrec/",
      "text": "Based on your post you sound like you suffer heavily from imposter syndrome.  It doesn't matter if you have a PhD or not, not whether you're full time. You teach at the collegiate level in a more difficult subject matter. Write them a damn good letter!",
      "author": "GriIIedCheesus",
      "created": 1637958451,
      "upvotes": 2,
      "replies": {}
    },
    "hm6zts1": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm6zts1/",
      "text": "Write the letter! It's more important the fact that you know the person, than the fact that you 'only' have a masters. You are a professor too!",
      "author": "juan4815",
      "created": 1637958952,
      "upvotes": 2,
      "replies": {}
    },
    "hm733vy": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm733vy/",
      "text": "I wrote several letters as a TA, just write the letter",
      "author": "tastytastylobster",
      "created": 1637960479,
      "upvotes": 2,
      "replies": {}
    },
    "hm7a229": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm7a229/",
      "text": "I got into my Ph.D. program with letters from an adjunct and a postdoc, in addition to the PI I was working with post-undergrad.",
      "author": "TurnsOutImAScientist",
      "created": 1637963688,
      "upvotes": 2,
      "replies": {}
    },
    "hm7apx7": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm7apx7/",
      "text": "I cant imagine a world where one would say \"only a masters degree\". In my family the equivalent is \"only dropped out of 11th grade\". ;)\n\nBtw write the letter man",
      "author": "DarthLeftist",
      "created": 1637964002,
      "upvotes": 2,
      "replies": {}
    },
    "hm7eim4": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm7eim4/",
      "text": "Not sure why you are knocking yourself down.\n1 do you know the student well?\n2 can you give a truthful, unbiased referral?\n3 are you an expert in the field of the student?\nOther than that, remember that Howard on the big bang theory only has a master but still designed an important part of the international space station and is an astronaut 😂",
      "author": "Meancvar",
      "created": 1637965798,
      "upvotes": 2,
      "replies": {}
    },
    "hm7hzwv": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm7hzwv/",
      "text": "Just in case it helps, I wrote a glowing letter of recommendation for a student looking to transfer from <average school> to Amherst College back when I was a grad student (pre-doc) and she got in. I don’t know if my letter was a help but it can’t have been much of a hindrance! Because I was young and it was one of my first LoRs, I put a lot of effort into it, whereas now I treat most LoRs like form letters (unless it’s a really exceptional student).\n\nBest advice I’ve gotten about this - be concrete with your examples. Don’t just say “this student is exceptionally dedicated”, say “this student finished the reading list for entire course by the midterm and was already tackling grad student level texts by the time we got to the final” (or similar incidents). The key thing is to be concrete and specific.",
      "author": "Doglatine",
      "created": 1637967460,
      "upvotes": 2,
      "replies": {}
    },
    "hm7mal3": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm7mal3/",
      "text": "I've had several students approach me for such letters, pre-PhD, just as their casual tutor, so not too weird imo",
      "author": "fractal_imagination",
      "created": 1637969539,
      "upvotes": 2,
      "replies": {}
    },
    "hm872m9": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm872m9/",
      "text": "Wow  \nThink more biggly of yourself  \n\n\nI am an adjust, nearly 40 years. I have a Masters degree.  \nI write letters all the time for students  \n\n\nI'm glad most people agree.",
      "author": "Elsbethe",
      "created": 1637979994,
      "upvotes": 2,
      "replies": {}
    },
    "hm8bx0n": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm8bx0n/",
      "text": "I'm also an adjunct professor with only a Master's degree, and recently had a student ask for a letter of recommendation. I figure, if I'm good enough for the university to trust me with educating my students, I'm good enough to give my students letters of recommendation.",
      "author": "rhyza99",
      "created": 1637982466,
      "upvotes": 2,
      "replies": {}
    },
    "hm8k3cu": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm8k3cu/",
      "text": "Just write it bro!",
      "author": "UnassumingReptilian",
      "created": 1637986868,
      "upvotes": 2,
      "replies": {}
    },
    "hm8m6ls": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm8m6ls/",
      "text": "Just because you're an adjunct, doesn't mean you're not an amazing teacher : )",
      "author": "garulous",
      "created": 1637988048,
      "upvotes": 2,
      "replies": {}
    },
    "hm8u70t": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm8u70t/",
      "text": "It really depends. I have a PhD and for my second post-PhD job, I had two referees – neither were my PhD supervisor (one had a PhD, the other was a BSc).",
      "author": "someth1ng_au",
      "created": 1637992879,
      "upvotes": 2,
      "replies": {}
    },
    "hm6l407": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm6l407/",
      "text": "The best letters come from those who know the candidates well, not rank or prestige. Sure, in an ideal world, perhaps a famous or well-known letter writer could be nice. But the specific examples and clear relationship are so much more important.",
      "author": "kennedon",
      "created": 1637952040,
      "upvotes": 3,
      "replies": {}
    },
    "hm6yr05": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm6yr05/",
      "text": "I used to write letters as an adjunct. Looking back on it now, though, it's one of the many ways we were asked (I'm tenured now) to do unpaid labor out of \"love\" for our job and students, and I wish the students we gladly write letters for were aware of the contingent nature of adjunct labor.",
      "author": "Lonely2LeggedCreatur",
      "created": 1637958446,
      "upvotes": 2,
      "replies": {}
    },
    "hm646im": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm646im/",
      "text": "Your letter will still be valuable, but if you think she should also ask for other people's letters then that is fine. You can have a conversation with her about your own doubts and still write the letter. These are not mutually exclusive activities. Also, when you write the letter, I'd avoid the unnecessary ellipses.",
      "author": "learningdesigner",
      "created": 1637944553,
      "upvotes": 1,
      "replies": {}
    },
    "hm74qgq": {
      "link": "/r/AskAcademia/comments/r2hvde/a_student_is_asking_me_for_a_letter_of/hm74qgq/",
      "text": "Write the letter * **IF** * you want to.\n\nIf you don't want to take the time to write a letter, which is entirely reasonable for many adjunct workloads, then feel free not to.  That kind of service is the responsibility of tenure-line faculty.",
      "author": "smapdiagesix",
      "created": 1637961231,
      "upvotes": 1,
      "replies": {}
    }
  }
}