{
  "sid": "dtmvrt",
  "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/",
  "title:": "I've just submitted my PhD thesis.",
  "text": "I really don't know what to feel. Is that it? I spent four years working towards this document, and now it's completely out of my hands.\n\nWhere do I go from here? Should I turn up at the office on Monday and start writing papers? \n\nHow did you all feel when you submitted?",
  "author": "Popeychops",
  "created": 1573251666,
  "updated": 1634081156,
  "over_18": false,
  "upvotes": 160,
  "upvote_ratio": 0.95,
  "comments": {
    "f6xocp4": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6xocp4/",
      "text": "Congratulations!\n\nI felt exactly as you describe.  It’s extremely common to feel that way when you reach a milestone you have been working toward so single-mindedly for so long.  I encourage you to take a break, if you can, and reconnect with yourself and the things that bring you joy.  Go sit in a park.  Go for a bicycle ride or a hike.  Watch a movie.  Go on a trip.  Hang out with a friend.  Do anything except work on the next paper, at least for a little while.",
      "author": "bigrottentuna",
      "created": 1573254098,
      "upvotes": 82,
      "replies": {
        "f6ycseg": {
          "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6ycseg/",
          "text": "Thanks, that's very good advice.",
          "author": "Popeychops",
          "created": 1573274935,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "f6xpi73": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6xpi73/",
      "text": "Congrats!  I think when I submitted mine, I went for a drink with my SO.  The anxiety took probably a day or two to go away since I had been so focused, it took awhile for the brain to realize it was done.  I didn't do much in the lab after that cause my paper had been submitted and I wasn't going to start a new project.  Other than helping out some lab mates, I just cleaned my area up in preparation of leaving.  But enjoy this time and take the time to relax and have some fun!  Congrats again!",
      "author": "AimanaCorts",
      "created": 1573254965,
      "upvotes": 23,
      "replies": {}
    },
    "f6xo3ec": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6xo3ec/",
      "text": "Congrats! What a great accomplishment! \n\nI don’t remember how I felt when I turned mine in honestly. Just wanted to say make sure you take some time for yourself this weekend!",
      "author": "innominata_name",
      "created": 1573253908,
      "upvotes": 14,
      "replies": {}
    },
    "f6xvx33": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6xvx33/",
      "text": "Right after I submitted my PhD dissertation, I was an unshowered, disheveled mess. At about 9pm, I immediately went to my local watering hole.\n\nThis was no ordinary watering hole. It was a back-alley speakeasy whose door looks like you might get your kidneys harvested. Upon entering, one's eyes are greeted with beautiful marble statues, sumptuous chairs, and the odd funk jazz band if you come on the right night. \n\nWhen I entered, there was almost no one there. I went to the bar, sat down and ordered a beer, and started surfing reddit. A tipsy man approached me, and within a few seconds he revealed himself as a local tech bro looking to elevator pitch his newest dumb idea. Given that I had just finished my PhD, I was able to intellectually disarm him, and not listen to his newest dumb idea. After some small talk, he left to go \"work the room\" - not that there was much room to work.\n\nA very not disheveled, good-looking man then came down and sat beside me. It was obvious he batted for the other team. After some discussion, it turned out we had a shared interest in Ancient Greek literature, although he was much more advanced than myself. Not only was I jealous of his long, dark-brown hair, he also understood all the references to Lucian's \"A True Story\", something I was never able to master - the oldest Western science fiction novel, complete with space whales, space wars, and parodies of contemporary literary works.\n\nA man and a woman then entered the speakeasy, and sat down beside us. The man was bald, and clearly on cocaine. The woman told us that it was his 30th birthday - an early mid-life crisis. She immediately picked up on the fact that I had not shaved in several days, nor had I done my hair up. I was also wearing a suede leather jacket that \"aged me\" (I was clearly 6-7 years her junior), and my blue pyjama shirt and sandpaper jeans. This did not go over well. She spent a considerable amount of the next 30 minutes trying to convince me to let her do me a makeover, speak poor French with the homosexual Ancient Greek fellow while telling me I could also not speak French, and ignore her mid-life-crisising friend who was bald and very self-conscious about it - he did look splendid without hair, though.\n\nThe bartender came by to refill my much-needed forgetful juice right as this woman was pointing out for the (n+1)th time that I needed a new sense of fashion. Her face was that of a beached whale. I ordered the most expensive drink on the menu.\n\nThen I found a typo in my dissertation.\n\nAt some point, I survived the night, went to piss in the urinal, and waddled back home. I think I arrived to the office on time the next day, but it's a bit unclear in my head.",
      "author": "notadoctor123",
      "created": 1573260076,
      "upvotes": 36,
      "replies": {
        "f6y5aih": {
          "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6y5aih/",
          "text": "Is this some weird copypasta? But if not, I’ll have what he’s having.",
          "author": "send_me_potatoes",
          "created": 1573268098,
          "upvotes": 17,
          "replies": {
            "f6ysp94": {
              "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6ysp94/",
              "text": "This was 100% a true story.",
              "author": "notadoctor123",
              "created": 1573295203,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "f6y4568": {
          "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6y4568/",
          "text": "!RedditBronze",
          "author": "Big_Boix_LaCroix",
          "created": 1573267094,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "f6y2hvs": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6y2hvs/",
      "text": "congrats!\n\nand here is a little tidbit you might not know.  They wouldn't have let you submit the thesis if you were not going to pass the defense of it.",
      "author": "arachnidtree",
      "created": 1573265684,
      "upvotes": 12,
      "replies": {
        "f6ycwdf": {
          "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6ycwdf/",
          "text": "I did already know that 😉",
          "author": "Popeychops",
          "created": 1573275050,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f6xtaie": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6xtaie/",
      "text": "After submitting, I just went on to do my teaching prep for next term, took a week off and had my viva, went back to teaching and then worked on my corrections, then waited ages for feedback on my corrections and then, suddenly (!), I became a Dr.",
      "author": "sollinatri",
      "created": 1573257914,
      "upvotes": 9,
      "replies": {}
    },
    "f6xxxby": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6xxxby/",
      "text": "For about a month afterward, I kept getting dissertation guilt. I kept thinking, *I really should be working on my dissert—no, wait!* That was a good feeling.",
      "author": "Repent2019",
      "created": 1573261785,
      "upvotes": 7,
      "replies": {
        "f6y3w3e": {
          "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6y3w3e/",
          "text": "Yep this is real. It took me 3 months to reprogram my brain not to feel guilt for watching TV or not doing anything at all! Now I’m in academia, the guilt is better but still there! *eyeroll*",
          "author": "creature-of-the-dark",
          "created": 1573266881,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "f6y6frx": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6y6frx/",
      "text": "I got blackout drunk after I turned mine in. Your mileage might vary.",
      "author": "Sariel007",
      "created": 1573269113,
      "upvotes": 5,
      "replies": {
        "f6ycz3z": {
          "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6ycz3z/",
          "text": "I can remember all of the night, but unfortunately I can't seem to sleep. It's currently 5AM here in London.",
          "author": "Popeychops",
          "created": 1573275129,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f6y1erv": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6y1erv/",
      "text": "I submitted mine to my committee today too. I have to go in for data collection tomorrow :/",
      "author": "WhoRipped",
      "created": 1573264760,
      "upvotes": 4,
      "replies": {}
    },
    "f6y4tln": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6y4tln/",
      "text": "I defended a month ago.\n\nBreathe.\n\nTake a day or a long weekend. You *deserve* to take a little time for yourself.\n\nShow up at work on Tuesday, ready to work. The days between document submission and defense can be some of the easiest productive days of your life.\n\nIf experiments work, great! More to talk about.\n\nIf experiments don't work, so what? You already have a defensible body of work!\n\nBe deliberate and take time to enjoy your last weeks/months, while still keeping projects on your plate. Don't languish without work to do, that can kill motivation for whatever follows. But don't obsess about work. Make it a 9-5 (or 12-5) job for the rest of your time and make yourself ready for the snake fight part of your defense.",
      "author": "atchemey",
      "created": 1573267684,
      "upvotes": 3,
      "replies": {}
    },
    "f6ymt49": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6ymt49/",
      "text": "After passing my PhD viva I took a week off to go hiking. Myself and my SO chose to spend a few days in the Lake District (UK) to hike Scafell Pike. He hurt his leg on the way down from the summit and had to slide down on his bum after refusing to let me call mountain rescue.\nThe other day we were looking through pictures of the trip on my phone and noticed the geotag said the picture was taken at Great Gabel. Turns out we climbed the wrong mountain. Alas, it was a memorable trip!",
      "author": "DollyDaydream19",
      "created": 1573287506,
      "upvotes": 3,
      "replies": {
        "f6ytc52": {
          "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6ytc52/",
          "text": "Poor SO! But well done on climbing a big object. I did the Yorkshire Dales three peaks about a decade ago when I was in better physical shape.",
          "author": "Popeychops",
          "created": 1573296301,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f6ynw3n": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6ynw3n/",
      "text": "Congrats. \n\nI felt so empty the day I submitted my thesis. So many things I had planned to do but as soon as you’re that free, nothing really fits the mood.\n\nEnjoy the moment. Exciting life awaits. :)",
      "author": "fiddler013",
      "created": 1573288698,
      "upvotes": 3,
      "replies": {}
    },
    "f72vnqg": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f72vnqg/",
      "text": "Congrats\n\nI also felt an empty void. But that's good, it means you have a hunger to continue. Too many people think that once they become \"Dr.\" that they are the bomb. To me, life is one long learning process, nor matter what title we have...\n\nThere's plenty more to come, so take some time out for yourself. Swim in a lake...",
      "author": "radionul",
      "created": 1573382270,
      "upvotes": 2,
      "replies": {}
    },
    "f6xohub": {
      "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6xohub/",
      "text": "If by submitting you mean you already defended and made necessary revisions, then congratulations are in order! \n\nI went out dancing with friends, then when my family came to visit went out and partied some more!",
      "author": "blue_suede_shoes77",
      "created": 1573254208,
      "upvotes": 1,
      "replies": {
        "f6ycqzx": {
          "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6ycqzx/",
          "text": "Submitted just means submitted, in a UK context. I've written a thesis that will be printed and delivered to my examiners.",
          "author": "Popeychops",
          "created": 1573274897,
          "upvotes": 4,
          "replies": {}
        },
        "f6y2r1m": {
          "link": "/r/AskAcademia/comments/dtmvrt/ive_just_submitted_my_phd_thesis/f6y2r1m/",
          "text": "\"out of my hands\" sounds like the examination and defense are forthcoming.",
          "author": "arachnidtree",
          "created": 1573265908,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}