{
  "sid": "r3hf2m",
  "link": "/r/AskAcademia/comments/r3hf2m/friends_phd_advisor_said_something_disturbing_and/",
  "title:": "Friend’s PhD advisor said something disturbing and need help",
  "text": "I first tried using a throwaway account but the post seems deleted immediately. So I post again in main.\n\nMy friend is 3rd year in his PhD in a lab heavy area in U.S.  His advisor recently came to chat with another student while his is away: “ I won’t be a bad guy to let them quit PhD directly. I’ll defer them.” And my friend is quite worried if the advisor is referring to him because their relationship is not in the good term. He often accused him not being motivated or knowing the big pic of his lab. \n\nI think this is a major red flag said by a PhD advisor. I’m a PhD student myself in a different school and my advisor never blames me or threats me anything.  He is very stressful since the beginning of the phd. Is there anything he can do? Do you have any suggestions? I’m very worried about his current and future mental health.\n\n\n\nEdit: I talked to his another friend. It seems that he has a preference to read things negatively. This time he interpreted as the advisor will delay his graduation until the student himself give up and quit. We are thinking about suggesting a therapist for him.\n\nThanks Reddit!",
  "author": "Macloft",
  "created": 1638031680,
  "updated": 1638206308,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.46,
  "comments": {
    "hmb061a": {
      "link": "/r/AskAcademia/comments/r3hf2m/friends_phd_advisor_said_something_disturbing_and/hmb061a/",
      "text": "As a native English speaker, I don't understand what the professor is saying. Are those his exact words? What does deferring mean in this context? It sounds like they're talking about a student who wants to quit. But the professor sounds like he's trying to help the student? None of this makes sense in American English.",
      "author": "MidnightSlinks",
      "created": 1638039916,
      "upvotes": 13,
      "replies": {
        "hmb52ze": {
          "link": "/r/AskAcademia/comments/r3hf2m/friends_phd_advisor_said_something_disturbing_and/hmb52ze/",
          "text": "My apology. I’m not a native speaker and he just translated in our native language. He interpreted as he will delay a student’s graduation until the student decide to quit so he doesn’t have to tell him directly. You made a good point though. There maybe some misunderstanding there.\n\nEdit: He indeed interpreted it in a negative way which actually is not. I really appreciate your reply! I’m suggesting therapy to him.",
          "author": "Macloft",
          "created": 1638041949,
          "upvotes": 5,
          "replies": {
            "hmeu1m9": {
              "link": "/r/AskAcademia/comments/r3hf2m/friends_phd_advisor_said_something_disturbing_and/hmeu1m9/",
              "text": "Are you a Chinese speaker by chance? You said “let them quit” when I think you meant “*make* them quit.” “Let” means “allow,” whereas “make” means “force.” Chinese speakers often miss the distinction because 让 can be either.\n\n“I won’t be the bad guy and make them quit. I’ll just defer them.”",
              "author": "sighing_sage",
              "created": 1638115048,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}