{
  "sid": "alcf7k",
  "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/",
  "title:": "Anyone doing a PhD without the goal of working in academia?",
  "text": "Having really enjoyed my past work in my industry makes me want to work for an NGO and not in academia. I do want to pursue a PhD though because I'm interested and generally enjoy being in academia. (Just don't want to work in it; I'd rather do other stuff!) I don't expect my paycheck to be higher as a result of the PhD. I just want to do it because it sounds interesting, I enjoy research, and a PhD is something I've always wanted to do. Is there anyone out there who did a PhD knowing from the start that you didn't want to work in academia? Is it a waste of effort/income-boosting years? Was it taboo to be open around professors about the fact that you didn't want to be in academia? Do you have regrets?",
  "author": null,
  "created": 1548853015,
  "updated": 1634081730,
  "over_18": false,
  "upvotes": 120,
  "upvote_ratio": 0.93,
  "comments": {
    "efcyr0p": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efcyr0p/",
      "text": "I’m a second year. I don’t publicize that I’m not going into academia. I do think it’s a waste of income making years. I enjoy research. But I knew when I started, a career in academia wasn’t for me. However, my colleagues all plan to go into academia and these connections will allow me to collaborate on research projects after the PhD. I hope to do clinical work as my career and some research as a hobby. I’m not getting richer by doing this, only gaining knowledge. But to me it’s worth it. ",
      "author": "Deadbeat_student",
      "created": 1548858776,
      "upvotes": 91,
      "replies": {
        "efdlje6": {
          "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdlje6/",
          "text": "Exactly this. I don’t broadcast my desire to work in industry because I’ve noticed that the ones who do get pushed to the back burner sometimes in the lab PI’s priority list. ",
          "author": "rugbybackliner",
          "created": 1548872475,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "efd0xne": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd0xne/",
      "text": "I started my biochemistry PhD with the intention of going into industry afterwords. Some PIs didn't really care, figured I would change my mind, were kind of supportive, or wouldn't touch me with a 10 foot pole if they knew I wanted to go into industry. You will probably run into a lot of professors that talk as if they know all about industry, but they really don't have a clue. I agree with the loss of income with postdoc positions. Even without an academic postdoc, I feel like I'm 10 years behind on my 401K.",
      "author": "kirby726",
      "created": 1548860049,
      "upvotes": 45,
      "replies": {
        "efd8eji": {
          "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd8eji/",
          "text": "I applied to several schools this cycle for a PhD in Chemistry, and I mentioned in my statement of purpose that I intended to enter industry for R&D in organometallic-type pharmaceuticals. None of these programs are the type where you apply directly to a lab, but rather decide after you are admitted. I’ve gotten into one school (my safety school) but am still waiting on responses from the other two (complete radio-silence so far from them). \n\n1) do you think this will affect my chances of admission?\n2) is this something you think I will need to consider when picking a lab?",
          "author": "pondscum682",
          "created": 1548864168,
          "upvotes": 7,
          "replies": {
            "efdd3v6": {
              "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdd3v6/",
              "text": "1) I don't think it would impact your admission but I can't really say for sure. Let me put it this way, if it does it's probably not the school you want to go to anyway. \n\n2) This is something you need to strongly consider when picking a lab. First, you want to make sure the work you'd be doing in lab will actually be applicable to the work in industry. Just because you have a PhD in organometallics won't necessarily make you qualified for industry jobs. Academic research can be very academic niche so keep that in mind. \n\nSecondly, you want to make sure your PI will support you. During grad school my roommate's PI would only act as a reference for them if they applied to academic jobs or post docs. They refused to help them in any way if they tried to apply for industry jobs. This PI was particularly horrible but there are some PIs out there who have similar views so, they aren't someone you want to work for. \n\nThirdly, if your PI has good contacts in industry it will help a lot. You can still get an industry job if they don't but it's *a lot* more work for yourself. ",
              "author": "stathicus",
              "created": 1548867035,
              "upvotes": 7,
              "replies": {
                "efezwwa": {
                  "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efezwwa/",
                  "text": "\"if they have good contacts\".. god i hate this world we live in.  I love how people can buy their way into good careers. ",
                  "author": "methnbeer",
                  "created": 1548908739,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "efegqbe": {
              "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efegqbe/",
              "text": "Chemistry is a little different than other disciplines because there is a lot of overlap with industry. I don’t have the stat offhand, but I remember seeing that a disproportionate of chemistry PhDs end up going into industry so I don’t think anyone would be bothered by it.",
              "author": "jwaves11",
              "created": 1548892907,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "efeznle": {
          "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efeznle/",
          "text": "You make me feel terrified that i will probably end  my life without over $10k having ever gone into a 401k. ",
          "author": "methnbeer",
          "created": 1548908506,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "efd4ctk": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd4ctk/",
      "text": "Yes, but I'm in engineering so it's fairly common for a large fraction (if not majority) to go into industry instead of academia.",
      "author": "ColickingSeahorse",
      "created": 1548861983,
      "upvotes": 32,
      "replies": {}
    },
    "efd6noa": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd6noa/",
      "text": "I only did a PhD because it was 3 years of stable employment and at the end it would support my clinical psychology application (DClinPsy), which is bonkers competitive in the UK. \n\nThen I did a postdoc because hey, you might as well get paid double for the same amount of work you've done, eh? And I've kinda got sucked along in academia, and here I am a tenured lecturer, probably for a long time. I think there's a degree of what you want in life: for me the pay's fine (above average, certainly), and I enjoy that I can mark whenever, and walk the dog at 4PM or whatever.\n\nHowever I would probably keep relatively quiet if you're not planning to stick around, as there is a degree of 'you are an investment' from a good PI. ",
      "author": "dl064",
      "created": 1548863229,
      "upvotes": 20,
      "replies": {
        "efdid3z": {
          "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdid3z/",
          "text": "[deleted]",
          "author": null,
          "created": 1548870469,
          "upvotes": 1,
          "replies": {
            "efdp4jw": {
              "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdp4jw/",
              "text": "Speaking as a PI, part of my interest in training PhD students is that they will continue to do work related to mine (and publish with me), that they will teach undergraduates and send the best and most promising to work with me, and that they will make my department look good by being outstanding teachers and researchers. \n\nOn the other hand, when my students go into industry, I encourage them to become tremendously successful then donate money to the department, and hope that they help other students find internships, etc. \n",
              "author": "quietlysitting",
              "created": 1548874649,
              "upvotes": 14,
              "replies": {}
            },
            "efdlcox": {
              "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdlcox/",
              "text": "A good one encourages folk to go learn techniques, visit labs, do career relevant stuff rather than just churning out papers. It'd be easy to just leave a PhD student to it and just fulfill your obligations. ",
              "author": "dl064",
              "created": 1548872360,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "efczm9x": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efczm9x/",
      "text": "I did my PhD expecting to work in academia but have worked with several people who wanted to leave academia. In my experience certain advisers and professors were extremely supportive of this and others essentially wrote the student off as soon as they found out the student’s plan. It just depends on the advisor. As for losing time, I know in my field (molecular biology) there have been several studies that have shown doing a postdoc, and especially multiple post docs, with the intent of leaving academia does result in a net loss of income and earning potential over your lifetime.",
      "author": "molbionerd",
      "created": 1548859306,
      "upvotes": 12,
      "replies": {}
    },
    "efd3o3x": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd3o3x/",
      "text": "Me! I came into my PhD after enjoying my undergrad degree (which had an integrated masters year) with a fully funded stipend for the duration of my PhD. I know this is rare in some countries and I count myself fortunate to be in such a position.\n\nI've always wanted to teach Physics, so at the time I was applying to the PhD, I also applied to a PGCE (the UK masters qualification needed to be a teacher). I was offered both, initially I was offered a PhD project that was not my first choice but thankfully there were new staff starting in the same year and I ended up working with one of them (honestly the best thing to happen tbh). This all happened before I knew if I had been accepted onto the PGCE course! So I made the decision to see what research was like full time because I could always go back to do the PGCE.\n\nMy supervisor asked me within the first few months what my plans were for after the PhD. I was fairly honest and said that I was either going to stay in academia or pursue teaching. She was super supportive and just wanted to know so that she could do the best she could to get me relevant experience. Even when she asked me more recently what my plans were, she was happy to hear that I was applying for the PGCE again.\n\nConsidering that academic jobs are so competitive, I really think more supervisors should be supportive of alternate careers to academia.",
      "author": "blizzardgirl13",
      "created": 1548861614,
      "upvotes": 8,
      "replies": {}
    },
    "efd9amv": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd9amv/",
      "text": "I'm surprised by categorical answers in this thread. I think as 90% of questions here, the answer kinda depends on the field. In some areas it's pretty much universal understanding that all PhD students will at least try to find academic job, in others it's perfectly normal to want to go to industry. For example, I teach industrial engineering, in an r1 department. I would say a minority of our PhD graduates want to/look for academic jobs. As far as I understand CS often has similar situation. \nSo, depending on your field, it may or may not be widespread",
      "author": "SirLoiso",
      "created": 1548864653,
      "upvotes": 10,
      "replies": {}
    },
    "efdf4tu": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdf4tu/",
      "text": "In chemistry, got a PhD 10 years ago and never wanted to go to academia.  Not to discourage anyone from achieving their goal of tenure in academia, but each new class at our institution every year had 50+ in it.  To put all of those into tt positions in academia would require far more professors to retire each year than actually do... \n\nYet there are still professors around (mostly at Research 1 institutions) who recruit PhD students with the expectation that  anything less than a TT position at a Research 1 institution is a failure.  It's just not sustainable as a business model!",
      "author": "Pythonas",
      "created": 1548868383,
      "upvotes": 6,
      "replies": {}
    },
    "efdgagg": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdgagg/",
      "text": "2nd year PhD student here. Went from high school to bachelors to masters to here without any job experience. I used to be interested in going into the academe, and then I saw that I was having a hard time getting scholarships and grants as someone who only holds a citizenship from the third world. My government have not, do not, and will never support scientific research. Everything else is competitive af. And there's the fact that you need to be sociable in the academe.\n\nI have two supervisors, both of which have a similar HS-BS-MS-PhD experience. One of them is supportive (her husband is in industry), the other one is not. \n\nI love my job, but I also love having money and not having to move countries every X years.",
      "author": "vardonir",
      "created": 1548869141,
      "upvotes": 6,
      "replies": {}
    },
    "efe0k8k": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efe0k8k/",
      "text": "Oh my god I thought I was the only one. I'm not in a rush to settle down so I don't really place much value on \"lost income\". What I'm losing in potential earnings I am gaining in pursuing my own goals and interests, so it's absolutely worth it to me.\n\nThank you for making me feel better about my decision.",
      "author": "The_Highlife",
      "created": 1548881771,
      "upvotes": 6,
      "replies": {}
    },
    "efd3fje": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd3fje/",
      "text": "1. Yes.  \n\n2. From a purely financial perspective maybe, but I enjoyed myself.  \n\n3. It wasn’t “taboo” but my advisor was in denial until the end.  \n\n4. I always have regrets but at a high level, I don’t regret pursuing the PhD.  I love where I am at now, and I couldn’t have this job without a PhD.  I might have had more regrets if I ended up somewhere where a PhD wasn’t required.",
      "author": "intirb",
      "created": 1548861480,
      "upvotes": 5,
      "replies": {}
    },
    "efd8x7t": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd8x7t/",
      "text": "I did not have the goal of going into academia. However, once I realized the flexibility of work hours (when I worked, where I worked), it seemed like academia was a good choice. I did go to grad school at a top research institution so that also shaped my vision of my professional career.\n\nI do think I would be very happy outside of academia....but I do love that I can take snow days with the kids when they are off.",
      "author": "DrKittens",
      "created": 1548864443,
      "upvotes": 6,
      "replies": {}
    },
    "efd8se0": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd8se0/",
      "text": "Yes, did mine in Materials/Chemical Engineering on industrial sponsored projects. I think it is more common in this area than others.",
      "author": "TexAgIllini",
      "created": 1548864370,
      "upvotes": 4,
      "replies": {}
    },
    "efd8ytn": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd8ytn/",
      "text": "1. Yes, Like 80% of my cohort were in the same boat. Keep in mind that I'm still only a first year.\n\n2. Waste of effort? Sort of. I could have pretty trivially gotten a similarly paying job straight out of undergrad that would have been significantly less stressful. Waste of money? Not really. Assuming a good but reasonable scenario, I would have ended up ahead if I went with the undergrad job, but I'll still be making 6 figures so it's not like I'll be hurting.\n\n3. No, but I'm also in a field with relatively good industry prospects and at a school where anything in Academia above a SLAC is pretty untenable as a career goal. The school isn't anywhere near as bad as it probably sounds based off that description, it's a clear R1, but it's also not Berkeley. The school is also just a bit industry slanted. For whatever reason the PIs have good DoD and industry connections. \n\n4. So far? No. It's a lot harder than I was expecting, but beyond that it's almost exactly what I expected. 5 years to basically become a bad optical engineer/electrical engineer that's good at math while getting to research really cool stuff. I may be singing a different tune by defense time, but for now I'm about as happy as I've ever been.",
      "author": "Mezmorizor",
      "created": 1548864467,
      "upvotes": 3,
      "replies": {}
    },
    "efd7zwp": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd7zwp/",
      "text": "Me. I finished up earlier last year and now work for a startup. It is only tangentially related to my field but the pay is good compared to what I would've got in a postdoc or as a professor. I don't know if my degree helped boost my pay, but it definitely made me a better engineer.",
      "author": "dranzerfu",
      "created": 1548863944,
      "upvotes": 3,
      "replies": {}
    },
    "efdbo7u": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdbo7u/",
      "text": "Field: Computer Science\n\n\\> a waste of effort/income-boosting years\n\nPer income, you can take a risk and become super good at something so niche that the industry drowns you in money compared to your peers. This is of course with the notion that you do and want to work hard. Academic setting exposes you to endless meetings and co-authoring possibilities, but you have to be able to say no and focus on your own thing.\n\nPer effort, academia allows you to undertake huge projects by your own. Anecdotally, I ran my own company before coming to academia, and I switched solely because venture capitalists did not want to fund my project, because it assumed so much basic research done. While venture capitalists see your effort as binary, a success or failure, academia on the other hand gets rewarded from progress towards the end goal and are as such, a lot more flexible with huge risks.\n\n\\> Was it taboo to be open around professors about the fact that you didn't want to be in academia? Do you have regrets?\n\nI am on my first year and I have said it openly. I do not work well with some postdocs. On the other hand, some really like me and give me a lot of freedom. I do not think it is a bad thing. There will be people from the both ends of the spectrum. Unless you are frank with people and thus fail to communicate your expectations, you are on the fast lane to losing focus and passion of your work, because some people think you like to work with them, when you really don't.",
      "author": "tawaywed30jan",
      "created": 1548866084,
      "upvotes": 3,
      "replies": {}
    },
    "efdto7s": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdto7s/",
      "text": "You certainly aren't the only one.  That said, I would highly recommend not telling people that's your intention.  It's one of those strange things in academia that everyone knows everyone who gets a PhD can't be a professor, and people recognize you should have PhDs in regular society, *but* if word gets out don't be surprised if people don't take you seriously. (And I don't just mean students, they won't be judgmental usually, it's the faculty you have to worry about.)",
      "author": "Andromeda321",
      "created": 1548877428,
      "upvotes": 3,
      "replies": {}
    },
    "efd1ll4": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd1ll4/",
      "text": "I was, but I realized how scarce jobs were in the field I wanted to work in outside academia, which is one of the major contributing factors to why I mastered out.",
      "author": "iammaxhailme",
      "created": 1548860434,
      "upvotes": 2,
      "replies": {}
    },
    "efd9uda": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd9uda/",
      "text": "As an engineer, I was in the vast minority of my department who actually wanted to go into academia. Out of about 40 students, 3-4 of us had intentions of pursuing academia (across approx 5 yr of cohorts.)",
      "author": "graygoohasinvadedme",
      "created": 1548864962,
      "upvotes": 2,
      "replies": {}
    },
    "efdb679": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdb679/",
      "text": "I'm going part-time so I can keep working, and I have no aspirations to pursue academia. I'm studying Statistics/Research Methods/Psychometrics. My program seems to be 50/50 on academia or industry.",
      "author": "scthoma4",
      "created": 1548865766,
      "upvotes": 2,
      "replies": {}
    },
    "efddepj": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efddepj/",
      "text": "There is one person in my cohort who intends to go straight into industry after his PhD, and the rest of us are undecided--though you can get really well-paying jobs with a PhD in our field.\n\nUltimately whether it's \"a waste of effort\" depends on your goals. Do you want to retire early? Probably don't do a PhD, if it won't increase your salary. Do you want to do research-related work (including R&D)? A PhD could open up opportunities, even outside academia.\n\nIn many programs, the implicit assumption is that students intend to stay in academia, but that's certainly not universal. A colleague of mine is focusing on getting lots of small papers out during his PhD instead of aiming for a Nature/Science publication because his advisor told him that would be more valuable for the kinds of industry jobs he wants.",
      "author": "Zhaligkeer318",
      "created": 1548867227,
      "upvotes": 2,
      "replies": {}
    },
    "efduq9k": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efduq9k/",
      "text": "Yes.  I am a school principal.  It was 100% NOT a waste.  Most of my supervisors were former superintendents.  It is always great to have experts provide you with new perspectives.  It also increased my capacity to do research in my own school and to apply research.  In my field, only about half wanted to work in academia.  Honestly, it bothered me when I had a professor that has never worked in a K-12 environment.  I believe that in most academics should have some experience working within the field.  The professors that come from the field were a cut above all of the other professors.  \n\nAbsolutely no regrets.  ",
      "author": "spaceman019",
      "created": 1548878084,
      "upvotes": 2,
      "replies": {}
    },
    "efdopvd": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdopvd/",
      "text": "I am near the end of the first year of my PhD in Europe, field could be vaguely described as environmental policy studies. I developed my own PhD research project and am funding it via a scholarship, as opposed to most PhD candidates here who apply for a PhD position within a funded research project at university. This is directly linked to my main motivation for doing the PhD: I am genuinely interested in the research I am doing and conducting it as a PhD research seemed to be the most suitable way.\n\nI could imagine staying in academia afterwards, but could also envision to start working for some international organisation involved with my field of research (very much related to international development etc, so there are quite some possibilities). Both my supervisor and the selection committee for the scholarship naturally asked about my plans for after the PhD, and I was quite honest with both of them: I don't know yet, both ways (academia / not academia) are possible, and please just ask me again in two years when I actually have some experience with proper academia and can evaluate whether I like it or not. Got the scholarship, so it was obviously not a problem there. I am also very fortunate to have (chosen) an awesome supervisor who is supporting me either way, making sure that I get ample opportunities to network both within and outside of academia.",
      "author": "Lelislazuli",
      "created": 1548874396,
      "upvotes": 1,
      "replies": {}
    },
    "efekllu": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efekllu/",
      "text": "I started my PhD a bit uncertain about academia to being with, but learnt very quickly that I absolutely do not want to work in academia. My primary aim is to work in visual science communication, visualisation and illustration - it's part of my illustration business outside of my PhD and I have been pretty successful with that. Ideally I'd like to freelance full time or work for a company in that field, but that will take more work to get to that stage. I am also happy to work in industry (i.e. marine biosecurity) or do teaching also.\n\nAs far as my supervisor's thoughts...not sure yet. She is supportive of my business outside my PhD but is definitely very academic inclined, and I have seen her say that she is disappointed about her PhD students who have gone into industry or elsewhere. I do regret some days where I feel the process has hindered me, but overall I would regret leaving my PhD more because I genuinely am passionate enough to see my research to the end. I also feel my PhD has benefited me and given me a foot in the door that I couldn't get otherwise. And it provided consistent salary for 3+ years (hard to get in the ecology field at any rate). \n\nI choose to keep my options quiet with -some- tenured professors just because I don't want anymore negativity or judgement about my career choices (copped that my whole life). At the end of the day: it's my choice to do a PhD, my choice to choose my career paths, and my choice to weigh up options between passion and what gets food on the table. And honestly, academia ain't it for me.",
      "author": "Neyface",
      "created": 1548895926,
      "upvotes": 1,
      "replies": {}
    },
    "efd8f5z": {
      "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd8f5z/",
      "text": "It is not only a waste of your time, but everyone elses. The amount of time that is put into a PhD by professors is enormous. I would not do this. If I were on a selection committee you'd have to lie to my face about your interest in research, or, there is no way I'd select you.",
      "author": "iamjacobsparticus",
      "created": 1548864178,
      "upvotes": -7,
      "replies": {
        "efd9ubz": {
          "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efd9ubz/",
          "text": "You do realize that depending on the field there is plenty of research done in industry, so \"interest in industry\" is not the same as \"no interest in research\", right? ",
          "author": "SirLoiso",
          "created": 1548864961,
          "upvotes": 11,
          "replies": {
            "efdg7sr": {
              "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdg7sr/",
              "text": "Yes, this is somewhat field dependent. In my field there are very few who move outside of industry and very little research done outside the field.\n\nStill, the OP makes it appear not that they have a set plan for what they'd do outside of academia with a PhD, but that they are interested in doing one for the sake of doing one. As such, my comment stands.",
              "author": "iamjacobsparticus",
              "created": 1548869094,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "efdg6d4": {
          "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdg6d4/",
          "text": "You don't own a PhD student's career after they finish their research. They decide what they want to do once granted the PhD. Not sure why it's so important to you that the student plan to stay in academia. Your time on their PhD is the same whether they stay or go to industry.",
          "author": "GeoHerod",
          "created": 1548869068,
          "upvotes": 6,
          "replies": {
            "efdh5zp": {
              "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efdh5zp/",
              "text": "Of course I don't. You only own the decision on who to select, and I would only select those interested in research / staying in academia (which in my field is nearly 1 to 1).\n\nThe reason you take on PhD students is to train researchers, to continue your academic lineage, to grant prestige to the university who granted the PhD through the success of the PhD student. Having students who don't follow through on their side of the bargain is an enormous waste of resources. Now, if after 5 years they don't want to stay, that's fine! People learn and move on with their lives, I don't begrudge that at all. But if you don't seem interested in staying in academia from the beginning, there's no way I'd select you.\n\nImagine you were on a hiring committee for NASA. Astronaut training is enormously expensive (time and money wise). Wouldn't you only hire people who actually then want to become astronauts and not just those would enjoy the super cool experience of astronaut training?\n\nOr for the analogy does not hold. Undergrad or masters education. For an undergrad or masters education, you are paying the university more than they spend on you (not including scholarships). Therefore the institution doesn't really need to bother caring about what your reasons are for the degree, it benefits either way. Therefore it selects primarily on merit. This is not the case for the PhD, most of the returns to the institution are intangible (reputation). Therefore it shouldn't just select on merit (test scores, grades, prior research experience etc.) but who actually aligns with the goals of the university (publish research, become professors at prestigious places etc.).",
              "author": "iamjacobsparticus",
              "created": 1548869699,
              "upvotes": 2,
              "replies": {
                "efec9k9": {
                  "link": "/r/AskAcademia/comments/alcf7k/anyone_doing_a_phd_without_the_goal_of_working_in/efec9k9/",
                  "text": "But there's far more to prestige than academic job placements, and let's be real,  if you're not a top 10 department you don't have much to hang your hat on when it comes to academia placements.",
                  "author": "Mezmorizor",
                  "created": 1548889500,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}