{
  "sid": "er2rdd",
  "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/",
  "title:": "Professor I am interested in working with has only ever worked with Chinese students and researchers. Is this a red flag?",
  "text": "There is a professor who is doing research in an area that I am very interested in but when looking at all his research I became a bit concerned. He has only worked with Chinese students and various Chinese researchers from industry and other universities. Looking through all his work, it doesn't seem that he has ever worked with a non Chinese person. Also, every summer he invites 5 students from various Chinese universities to work with him fully funded. As a non-Chinese student I feel like I may just be wasting my time contacting him.",
  "author": "Valuable_Doughnut",
  "created": 1579469877,
  "updated": 1634081327,
  "over_18": false,
  "upvotes": 136,
  "upvote_ratio": 0.93,
  "comments": {
    "ff0pqky": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff0pqky/",
      "text": "You may be overthinking this: if you're interested in his work, contact him and let him ignore you or turn you down.  Currently the Chinese government funds a bunch of students, which makes them a lot cheaper for PI's. If you do get an interview, though, talk to his current lab and see if it's one you'd like to join.",
      "author": "RusellsFromBrussels",
      "created": 1579471132,
      "upvotes": 212,
      "replies": {
        "ff1krau": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1krau/",
          "text": "I agree, likely just a funding thing.",
          "author": "GordyJiang",
          "created": 1579480767,
          "upvotes": 41,
          "replies": {}
        }
      }
    },
    "ff18iz6": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff18iz6/",
      "text": "It could be entirely random. It could be one of the followings: \n\n-\tThe faculty has a demanding supervising tendency that is not usual for graduate students from other (read: Western) countries. \n-\tThe faculty, while comfortable with writing, is not quite comfortable with communicating in English. To make their work goes faster, working with students from his native country is much more productive. \n-\tThe faculty is more likely to be able to obtain fundings from China, which requires (unofficially) them to supervise Chinese students only. \n-\tThese students come from specific training programs in China that make them uniquely suited to the faculty’ research.",
      "author": "Damark81",
      "created": 1579476302,
      "upvotes": 130,
      "replies": {
        "ff1r668": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1r668/",
          "text": "[removed]",
          "author": null,
          "created": 1579484375,
          "upvotes": -157,
          "replies": {}
        }
      }
    },
    "ff1unt1": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1unt1/",
      "text": "[deleted]",
      "author": null,
      "created": 1579486577,
      "upvotes": 40,
      "replies": {}
    },
    "ff0qed6": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff0qed6/",
      "text": "I'm actually the only white person (and non chinease person) in a research lab (in biochemistry). I would give it a try",
      "author": "helpreddit12345",
      "created": 1579471348,
      "upvotes": 66,
      "replies": {}
    },
    "ff1jk20": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1jk20/",
      "text": "Feel free to contact him. However when I see a professor who only has international students in his lab (his own race doesnt usually matter) I worry about abusive relationship between them. This is because with a US student/postdoc, usually you can leave the lab if you aren't happy. However with international students, if you decide to leave the lab, you also have to leave the country. So I have seen a lot of professors really abuse their international students because of this.",
      "author": "ThyZAD",
      "created": 1579480215,
      "upvotes": 89,
      "replies": {
        "ff25mbj": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff25mbj/",
          "text": "Not sure about OP’s field but I wouldn’t see it this way in engineering.  As someone who just started a TT position, we have virtually no domestic PhD applicants except the ones with NSF GFRP or an equally prestigious award.  So our labs end up almost always having international students only, or Masters students.",
          "author": null,
          "created": 1579494466,
          "upvotes": 12,
          "replies": {
            "ff2b3c7": {
              "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2b3c7/",
              "text": "It is just something I have noticed both in Biology and Chemical Engineering. In ChemE we had 100% international masters program, but the PhD program was around 50-50. And it didnt always happen this way (that labs with 100% international students were abusive), but it happened enough that multiple people had noticed the pattern. Also the most abusive labs at the institute were 100% international PhDs and postdocs.",
              "author": "ThyZAD",
              "created": 1579499277,
              "upvotes": 11,
              "replies": {
                "ff2vla5": {
                  "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2vla5/",
                  "text": "Ah yeah ChemE is an exception because the masters degree is functionally worthless unless you’re a foreign student using it as a springboard to look for jobs in the US.  In civil, it’s the exact opposite- foreign students come for PhDs, domestic students stop at masters unless they are trying to go to academia.",
                  "author": null,
                  "created": 1579525848,
                  "upvotes": 5,
                  "replies": {
                    "ff3fhka": {
                      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff3fhka/",
                      "text": "Super-senior (28) Civil undergrad here, about to graduate.  I have noticed the same thing.",
                      "author": "slukeo",
                      "created": 1579539993,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ff2kbz8": {
              "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2kbz8/",
              "text": "I'm in a different engineering field as you, and in a different country, but my friend was really abused by his supervisor. Two PhD students ended up leaving, too, with one going AWOL, I believe. I also had several panic attacks over having to leave the country if I left my grad program.\n\nedit: all students mentioned in this post are foreign students.",
              "author": "vardonir",
              "created": 1579510089,
              "upvotes": 6,
              "replies": {
                "ff2vg1c": {
                  "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2vg1c/",
                  "text": "Obviously it happens. I was just saying not to automatically assume any PI who only has foreign students has some nefarious purpose.",
                  "author": null,
                  "created": 1579525699,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "ff381j3": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff381j3/",
          "text": "> if you decide to leave the lab, you also have to leave the country\n\nYup. I had one professor (from Korea) tell me he needs 2-3 \"foreign\" students to produce what 1 American will, but that the American grad student knows they don't have to take his shit and can leave whenever they want.",
          "author": "k0np",
          "created": 1579535886,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ff1ip2m": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1ip2m/",
      "text": "It's definitely worth contacting him to learn more, but it's reasonable to consider this. For instance, if this is for a PhD and all of his successful students end up getting postdocs in China after graduating, it might indicate that his network is strongest there,  which you may not be able to take advantage of if you are interested in getting a job in your current country when you finish.",
      "author": "phsics",
      "created": 1579479840,
      "upvotes": 19,
      "replies": {
        "ff2dxg6": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2dxg6/",
          "text": "Successful Chinese students don't get postdocs in China - if they need/want to do a postdoc aiming at academic career, they almost always also need to do it in a more developed country, even more importantly than PhD (it's similar also for students from most other developing countries). Of course, their permanent positions such as tenure-track-equivalent positions (or industry positions) they indeed in vast majority of cases get in China, so your point is still valid.",
          "author": "AstraGlacialia",
          "created": 1579502186,
          "upvotes": 8,
          "replies": {
            "ff33i68": {
              "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff33i68/",
              "text": "Good correction!",
              "author": "phsics",
              "created": 1579532735,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ff1c3ed": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1c3ed/",
      "text": "[deleted]",
      "author": null,
      "created": 1579477363,
      "upvotes": 24,
      "replies": {
        "ff2qt2o": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2qt2o/",
          "text": "do you mean 说 haha, I had to look up. Weird how your keyboard suggested that over 说。",
          "author": "JCharante",
          "created": 1579519875,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ff1ldzb": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1ldzb/",
      "text": "In the institute I worked in as an RA, the two largest groups were staffed entirely with Indians and Koreans, respectively. The Koreans group absolutely nobody could work with, because the temperament of the Korean PI means only other Koreans can stand him (the superior-subordinate relation, etc ...). The Indian group is fine, I worked with many of them quite productively.\n\nThe PI I used to work for tend to hire Taiwanese and Chinese students and post-docs (he's Taiwanese); though some of his best were neither (they left).\n\nYou might find yourself in a meeting where they discuss something and couldn't find words to explain themselves and start arguing in Chinese. They have nothing against you personally. Make friend with someone a bit senior (lab manager, etc ...) and somewhat better at English and ask them what's going on.",
      "author": "SmirkingImperialist",
      "created": 1579481070,
      "upvotes": 18,
      "replies": {
        "ff2epjx": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2epjx/",
          "text": "The biggest differences are that Indians (or at least those who don't grow up very poor in an isolated village) typically learn English from an early age, and Indians from different parts of India often communicate also with each others in English, as they have vastly different native languages (and many speak English better than Hindi, or at least about scientific topics). \"All Indians\" in this sense often can be effectively the same as \"all Europeans\". So they won't accidentally linguistically isolate non-Indians - unless they all happen to be from the same part of India, having the same native language, in which case you usually will run into the same problem as with any other group with the same native language you don't understand. Maybe less if you are interesting/useful to them, as switching to English is likely to be less difficult for them than for Chinese, Taiwanese, Koreans etc.",
          "author": "AstraGlacialia",
          "created": 1579503050,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "ff2ddpd": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2ddpd/",
      "text": "It is a red flag mainly in the sense that almost certainly the actual everyday language in the lab/office - and quite likely at least partially even the language of group meetings etc. - is Chinese, so if you don't understand it, and you are in a research field where people normally work together or alongside each other in a lab/office, you would be extremely isolated in your work, which would be bad for your learning of the research techniques and process and would make you notably less likely to succeed (publish and/or get a strong recommendation letter)... and if you are a somewhat normal, sociable person, it'd also be socially isolating and bad for your mental health.\n\nIn such collaborative fields where students are supposed to learn from more senior groupmates more than directly from the professor (chemistry, biology...), never join a group where everyone except you has a common native language you don't understand and can't quickly learn to understand. (As someone already wrote, not because they'd want to isolate you or have something against you, but just because that's easier for them, speaking English is a huge effort for most of those Chinese people who didn't grow up bilingual, and as a student you are very unlikely to have something to contribute that would be worth that effort on a regular basis.)",
      "author": "AstraGlacialia",
      "created": 1579501600,
      "upvotes": 8,
      "replies": {}
    },
    "ff1siri": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1siri/",
      "text": "[deleted]",
      "author": null,
      "created": 1579485209,
      "upvotes": 6,
      "replies": {}
    },
    "ff2rq2i": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2rq2i/",
      "text": "Yes it is a red flag, especially if the PI is Chinese.\n\nYou are unlikely to receive the personal investment required of effective mentoring. Further cultural norms are different between the US and China. I would not work at a Chinese university due to the lack of creative freedom afforded to subordinates.\n\nI worked with a group that transitioned to mostly Chinese students as funding dried up. The PI was not Chinese.\n\n1. Quality of work went down across the lab as Chinese students treated graduate school more like a \"job\" rather than education\n2. For purely international students we got a lot of  \"I've done the minimal work for a paper in an IF factor of 1\", which is all I need to graduate so I'm not coming to work\n3. PI had a bad habit of disciplining students by reminding them they could easily be replaced by the \"dozens of students\" applying for jobs",
      "author": "lednakashim",
      "created": 1579521187,
      "upvotes": 6,
      "replies": {}
    },
    "ff17jti": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff17jti/",
      "text": "I don't know if it's a red flag per se, but it's something I would look into. It's definitely not a waste of your time to reach out, you should pretty quickly be able to tell if it's a good match for you. There are labs like this that pretty strictly follow only speaking English at work, others where that's not really the case.",
      "author": "mafematiks",
      "created": 1579476051,
      "upvotes": 13,
      "replies": {}
    },
    "ff2b4jk": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2b4jk/",
      "text": "It might be a red flag with yellow stars? 🇨🇳",
      "author": "dampew",
      "created": 1579499310,
      "upvotes": 12,
      "replies": {}
    },
    "ff17uvt": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff17uvt/",
      "text": "Is the professor himself Chinese?  I'm a white professor and all my students have been either white or Chinese.  Every Chinese student I've had has done well, while it's 50/50 for whites.  But of course each person is an individual and despite observing trends I give any individual a chance without stereotyping.",
      "author": "iyzie",
      "created": 1579476097,
      "upvotes": 14,
      "replies": {}
    },
    "ff2gze4": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2gze4/",
      "text": "I used to be in a research group that is run by an Italian professor, his group is loaded with Italian assistant professors, post docs, PhDs, and master students. Not exclusively Italian for the PhD or Masters, but else are Italian and we were not in Italy.\n\nLooking back it is indeed a red flag. They have the mentality that Italian is better. Most of the prof express themselves better and more comfortably in Italian as well. That drives a wedge between them and the non-italian students.\n\nWhile I wouldn't say for you it is a waste of time contacting the prof, I will highly suggest think twice if you are offered the position.",
      "author": "ASingleOlive",
      "created": 1579505718,
      "upvotes": 2,
      "replies": {}
    },
    "ff2h3ws": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2h3ws/",
      "text": "I was the white student in this situation. YMMV, but I was miserable. \n\nThe short of it is: everyone had good intentions, but I found myself on the outside. The students in my group were and are my friends, but not understanding a word at lunch, not getting invited on day trips, working on homework by myself, etc, it all really added up. And I had a frustrating relationship with my PI, likely due at least in part to the fact that he was used to working with Chinese students.\n\nIf you have a strong social life outside of lab you might do better than I did. You aren't committing to anything by inquiring, but I would tread extremely lightly. Even if everyone has the best intentions, being the only non-Chinese person in the group will have its challenges.",
      "author": "truthine55",
      "created": 1579505873,
      "upvotes": 4,
      "replies": {}
    },
    "ff1j23q": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1j23q/",
      "text": "China is probably funding these students. I know many faculty that take several Chinese PhD students and post-docs each year, specifically because they are free (and work hard). \nI do not take these students. I’ve had several Chinese-American post-docs, but I won’t take Chinese nationals for geopolitical reasons.",
      "author": null,
      "created": 1579479997,
      "upvotes": 6,
      "replies": {
        "ff2daa4": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2daa4/",
          "text": "This sounds illegal.",
          "author": "Sarojapr29",
          "created": 1579501500,
          "upvotes": 7,
          "replies": {
            "ff36iq8": {
              "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff36iq8/",
              "text": "Fortunately, employment law does not apply to these individuals because they are paid by the Chinese government and have a non-employee “research fellow” job title.",
              "author": null,
              "created": 1579534861,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "ff1i25w": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1i25w/",
      "text": "Yes, imo.",
      "author": "ub_biology",
      "created": 1579479555,
      "upvotes": 3,
      "replies": {}
    },
    "ff2753t": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2753t/",
      "text": "Short answer: yes\n\nLong answer: make sure you ask graduate students to get a feel both within his group and in other related groups at the same institution.  I've seen \"foreign\" students get shafted put of their degrees simply because the advisor has preference.",
      "author": "NoobMadeInChina",
      "created": 1579495727,
      "upvotes": 2,
      "replies": {}
    },
    "ff2k8nj": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2k8nj/",
      "text": "I would still get in touch with the professor. If you do decide to join the lab however, please check how your colleagues are ? \n\n1)Usually, people from foreign countries bunch up together and if they happen to speak a language other than yours and you are the only one, you might left out of several conversations. \n\n2)Laboratory equipment or work related notes might be in a language that you dont understand ( this sounds super ridiculous, I know but it is very common). \n\n3)Also, you need to understand your colleagues. If you do not speak a common language, it does not matter how good they are, you will not understand them. \n\nSource: I've worked in a lab where there is a critical mass of foreigners.",
      "author": "smartaxe21",
      "created": 1579509962,
      "upvotes": 2,
      "replies": {}
    },
    "ff1u9ah": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1u9ah/",
      "text": "Just contact him",
      "author": "NewCenturyNarratives",
      "created": 1579486317,
      "upvotes": 1,
      "replies": {}
    },
    "ff2jn5e": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2jn5e/",
      "text": "About the summer thing, sometimes universities have deals with each other, like students from uni A will do internships in uni B. So maybe his institution just has a deal with this Chinese institution",
      "author": null,
      "created": 1579509143,
      "upvotes": 1,
      "replies": {}
    },
    "ff2mg0g": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2mg0g/",
      "text": "Lol.\n\nI'm at a UK Russell group university and the university literally has money *going* if you can find a Chinese student willing to do a PhD with you. Their fees and a stipend are paid. It's an absolute winner for all concerned if you can find an able student.",
      "author": "dl064",
      "created": 1579513225,
      "upvotes": 1,
      "replies": {}
    },
    "ff2gyps": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2gyps/",
      "text": "I'd recommend against going there. Science is inherently international; if a lab is mono-ethnic (I'm referring to US universities), that is not a coincidence and should raise alarms. Find a lab that has a variety of nationalities working, it will be good for you.",
      "author": "Mugstotheceiling",
      "created": 1579505695,
      "upvotes": 1,
      "replies": {}
    },
    "ff0wm89": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff0wm89/",
      "text": "[deleted]",
      "author": null,
      "created": 1579472982,
      "upvotes": -41,
      "replies": {
        "ff1ikwf": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1ikwf/",
          "text": "In China, if there were a white professor who had only worked with white students, it would be a red flag.\n\nIn Africa, if there were an italian professor who had only ever worked with italian students, it would be a red flag.\n\nIf you seem to never work with the majority population in an area you work, and there are qualified candidates, clear red flag imo. Doesn’t have to be as nefarious as racism, could be cultural cohesion or language barriers, but almost all answers to that question are a red flag for someone from the outgroup.",
          "author": "ub_biology",
          "created": 1579479788,
          "upvotes": 23,
          "replies": {
            "ff1sio5": {
              "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1sio5/",
              "text": "Yes, I agree, but did OP say where he/she was working? \n\nThere are programs that attempt to promote research to minorities. This COULD be one of those programs, and even if it's not, it's **inappropriate** to call it a red flag simply because there are higher #s of Chinese people.",
              "author": "SilverArtichoke",
              "created": 1579485207,
              "upvotes": -5,
              "replies": {
                "ff1unsn": {
                  "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1unsn/",
                  "text": "I assumed it was not in China...\n\nI also agree it's inappropriate to call it a red flag simply because there are higher numbers of Chinese people, I don't think anyone is doing that. I'm certainly not.\n\n  \nAt some point, it becomes a red flag, I think you would agree. It depends on how long and how well established the professor is. If they've been around for 40 years, and have exclusively worked with chinese students, obviously something is going on. If it's only been 2 years, I would not say red flag at all.   \n\n\nI personally have seen several labs that are borderline exclusively chinese. I sympathize with wanting to associate with people you find it easiest to connect and communicate with, but this can become exclusionary to those outside the group very quickly, especially if other languages are spoken.",
                  "author": "ub_biology",
                  "created": 1579486577,
                  "upvotes": 4,
                  "replies": {
                    "ff1y6ei": {
                      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1y6ei/",
                      "text": "I guess what some may not understand is that in the past 2 years of political tensions, there has been increasingly *open* discrimination against Chinese people (not just the govt) and false accusations that Chinese people are shady.\n\nThe wording of this post made it seem that there was a problem with Chinese people.",
                      "author": "SilverArtichoke",
                      "created": 1579488885,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ff12jvr": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff12jvr/",
          "text": "[removed]",
          "author": null,
          "created": 1579474602,
          "upvotes": 36,
          "replies": {}
        },
        "ff1x3xc": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1x3xc/",
          "text": "> Is there something wrong with Chinese people?\n\nYes, they're all outlandishly loyal to one another.",
          "author": "KajikiaAudax",
          "created": 1579488172,
          "upvotes": 4,
          "replies": {
            "ff1z5d2": {
              "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1z5d2/",
              "text": "What are some \"outlandish\" examples then?",
              "author": "SilverArtichoke",
              "created": 1579489565,
              "upvotes": 0,
              "replies": {
                "ff1zhhy": {
                  "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1zhhy/",
                  "text": "My former Chinese Calc I professor doing a huge head-nod toward every Chinese student he passed in the hallways, and them doing a shit-eating grin back at him. I saw this dozens of times. He never once did it toward a white student (that I ever saw). I observed this for an entire semester. \n\nChinese professors/students have an understanding with one another, that is: \"We're not like these underachieving, fat, non-Confucian, American idiots. Keep working hard and you'll succeed!\"\n\nAnd especially with Trump in office, they kind of have a point.",
                  "author": "KajikiaAudax",
                  "created": 1579489809,
                  "upvotes": 2,
                  "replies": {
                    "ff213hy": {
                      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff213hy/",
                      "text": ">shit-eating grin\n\nprobably because the other white professors ignore them for their white students",
                      "author": "SilverArtichoke",
                      "created": 1579490976,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "ff209cj": {
                      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff209cj/",
                      "text": "I understand, but that's one person, and certainly not exclusive to Chinese people. I've seen white waiters initiate small talk with white customers and treat them with more enthusiasm, but they never did the same for Asian customers. I believe it goes both ways, unfortunately.",
                      "author": "SilverArtichoke",
                      "created": 1579490368,
                      "upvotes": 3,
                      "replies": {
                        "ff20prg": {
                          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff20prg/",
                          "text": "I also had a (let's say, Latvian, to protect identities) advisor who hired a bunch of Latvian professors into his department. Everyone at the school thought it was crazy that in our small town, 1/2 of the (shall not be named) department was made up of Latvian people. Even some professors mentioned it.\n\nBut you have to admit that Chinese nationalism is on the rise in a way that (pick a country in Eastern Europe), that nationalism on their part is not.",
                          "author": "KajikiaAudax",
                          "created": 1579490700,
                          "upvotes": 2,
                          "replies": {
                            "ff21wi0": {
                              "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff21wi0/",
                              "text": "true, but U.S. nationalism is also on the rise",
                              "author": "SilverArtichoke",
                              "created": 1579491574,
                              "upvotes": 4,
                              "replies": {
                                "ff2277s": {
                                  "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff2277s/",
                                  "text": "Sadly...\n\nI'll take a life-or-death emphasis on scholarship over NASCAR worship any day.",
                                  "author": "KajikiaAudax",
                                  "created": 1579491799,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ff12zf3": {
      "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff12zf3/",
      "text": "So the thing that concerns you was not the amount of retracted papers (if any) or sketchy track record (if any), but the skin colour/ethnicity/surname of him and his collaborators and students?\n\nI dare predict that in the not so far future that researchers around the world will be eager to collaborate with research groups in China with their bottomless funding and admirable work ethic. For example in recent news, Chinese scientists have succesfully sequenced the whole genome of a previously unknown virus after only 1 month since identified outbreak. Such is the speed they are traveling at. (Source: [https://www.statnews.com/2020/01/09/chinese-scientists-obtain-genetic-sequence-of-mysterious-virus-a-key-step-in-containment-efforts/](https://www.statnews.com/2020/01/09/chinese-scientists-obtain-genetic-sequence-of-mysterious-virus-a-key-step-in-containment-efforts/))",
      "author": null,
      "created": 1579474718,
      "upvotes": -38,
      "replies": {
        "ff1at02": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1at02/",
          "text": "I think OP has touched on a legitimate but poorly articulated concern. It is neither surprising nor inherently problematic that many non-white academics specifically choose to work with or end up working with members of their own cultural or language background. The many structural problems within academia often make this necessary. These groups support each other and create more secure environments in spaces that generally favor white scholars. As a non-white academic myself, I appreciate that these exist.\n\nI do not blame OP for wondering if he is intruding on a space that has been created perhaps unintentionally as a way of helping Chinese scholars succeed in a foreign environment. Describing this as a \"red flag\" and asking if he's \"wasting his time\" by contacting the professor — that makes the scenario I described above seem like a problem rather than simply a reality to be mindful of.\n\nI do think he should just treat the professor like any other professor and simply reach out to see if it's possible to work together.",
          "author": "Durendal_et_Joyeuse",
          "created": 1579476892,
          "upvotes": 27,
          "replies": {}
        },
        "ff1vd4s": {
          "link": "/r/AskAcademia/comments/er2rdd/professor_i_am_interested_in_working_with_has/ff1vd4s/",
          "text": "Agreed. Whether or not OP realizes it, this post gives an undertone that a group of Chinese researchers is shady.\n\nI don't understand why people are downvoting you; there's nothing wrong with your question.",
          "author": "SilverArtichoke",
          "created": 1579487016,
          "upvotes": -5,
          "replies": {}
        }
      }
    }
  }
}