{
  "sid": "93ez8m",
  "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/",
  "title:": "[UPDATE] failing my PhD - submitted my thesis today",
  "text": "Link to original post: [https://www.reddit.com/r/AskAcademia/comments/8vryht/failing\\_my\\_phd/](https://www.reddit.com/r/AskAcademia/comments/8vryht/failing_my_phd/)\n\nI posted about a month ago, in a panic, with just 4 weeks and 11k of my crap thesis left to write. This sub gave me a lot of reassuring advice and made me feel like I could do it! I re-read all your comments whenever I started to feel hopeless and it definitely helped. \n\nUnfortunately my request for an extension was not approved by the faculty, so that was not an option, meaning the final stages were quite rushed and I'm not as happy with it as I could have been.\n\nLuckily I was able to use all my remaining holiday allowance to take 2 weeks off work and I wrote the bulk of it during that time. It was an intense 2 weeks - I was living and breathing this thesis. After that, my supervisor returned it with many edits and wanted me to restructure it so that I had fewer, but longer, chapters. \n\nThis turned into another extremely miserable 10 days where I struggled to turn everything around whilst being back at work. My relationship with my supervisors just got worse and worse, we were all so miserable. I was scared to check my email because every time I had an angry email from one of them. I still thought about quitting the PhD every day and frequently thought 'how bad would it be if I just didn't submit?'. But somehow, I submitted today.\n\nI don't have a lot of confidence in my thesis. It's not as polished as I would have liked, and I'm pretty sure there are some formatting errors. The conclusion to my theoretical dissertation is very poor. Overall, it's not strictly finished - and I am only 126 words over the minimum word count threshold! I'm preparing myself for a revise & resubmit. I would be ecstatic to receive major corrections (and I'm not even going to entertain the notion of minor corrections!). Frankly, anything better than failing is more than I'm expecting.\n\nEither way, at least it's submitted and I don't have to think about it right now.\n\nThank you for all your advice and kind words. If I managed to get to this point, anyone can! But I urge anyone who is struggling to communicate with their advisers. Please! If I could go back in time and shake my previous self until she listened to me, I would tell her that! I never told them about the personal problems I was having or the grief I was experiencing because I was scared of their reaction. But they are people, and it's in their best interests for their supervisees to pass, so they would have helped me out. \n\nRight now I'm feeling underwhelmed with a strong vein of panic running through me. I don't think my thesis is good enough, and also I don't know what to do with myself. I'm just going to work really hard at my job and only do nice things in the evenings. ",
  "author": "Sadthrowaway667",
  "created": 1533047610,
  "updated": 1634081231,
  "over_18": false,
  "upvotes": 153,
  "upvote_ratio": 0.98,
  "comments": {
    "e3cpam7": {
      "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3cpam7/",
      "text": "[deleted]",
      "author": null,
      "created": 1533048116,
      "upvotes": 129,
      "replies": {
        "e3csfun": {
          "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3csfun/",
          "text": ">\"How To Finish\" is the last thing a student learns about research. \n\nWonderful point. ",
          "author": "Aubenabee",
          "created": 1533050823,
          "upvotes": 24,
          "replies": {
            "e3d1zav": {
              "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3d1zav/",
              "text": "Yep. Just had a paper published this week... after 22 revisions. Get used to it ;)",
              "author": "davidzet",
              "created": 1533058618,
              "upvotes": 16,
              "replies": {
                "e3dtuf0": {
                  "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3dtuf0/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1533082831,
                  "upvotes": 21,
                  "replies": {
                    "e3gptfl": {
                      "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3gptfl/",
                      "text": "I just published a paper (Zetland 2017) that I began in 2007, so yeah.",
                      "author": "davidzet",
                      "created": 1533202021,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "e3dpqhl": {
                  "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3dpqhl/",
                  "text": "Can you please elaborate?",
                  "author": "DemianMusic",
                  "created": 1533078890,
                  "upvotes": 1,
                  "replies": {
                    "e3e8128": {
                      "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3e8128/",
                      "text": "Hasn't he revised and explained enough already?  ;)",
                      "author": "meowcat187",
                      "created": 1533097568,
                      "upvotes": 8,
                      "replies": {
                        "e3gpv8n": {
                          "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3gpv8n/",
                          "text": "Hahahaha.... So [Demian](https://www.reddit.com/user/DemianMusic), the paper went thru 14 drafts with me and my co-author before we submitted it. Then we had another 8 drafts before it was published last week ;)",
                          "author": "davidzet",
                          "created": 1533202124,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e3d5hmk": {
          "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3d5hmk/",
          "text": "This video is from the perspective of an internet content creator but I have tried to remind myself of his 80% mentality (he starts talking about it around the 30 second mark) when I'm working on a particularly difficult thing. \n\nhttps://www.youtube.com/watch?v=1LAhHDEtTD0\n\nAlso, if you are asked to revise and resubmit, i am guessing you'll get some specific things your committee wants out of you which will be easier to fulfill than trying to do everything perfectly this submission. ",
          "author": "ms_frizzle_94",
          "created": 1533061490,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "e3csxxk": {
      "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3csxxk/",
      "text": "[deleted]",
      "author": null,
      "created": 1533051237,
      "upvotes": 19,
      "replies": {
        "e3cvp5t": {
          "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3cvp5t/",
          "text": "That is a fair question and it's one I have asked myself a lot! \n\nI didn't write the whole thing at the last minute, the bulk (80%) of the work was my novel, which I finished last year. The hard part for me was finishing the theoretical supporting dissertation. That involved some typical Lit-style research (reading a lot of books, visiting museums associated with my topic etc) and I really struggled to get back into the swing of academic writing. So that's what I finished at the last minute. Plus I procrastinated... a lot. ",
          "author": "Sadthrowaway667",
          "created": 1533053529,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "e3cscvy": {
      "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3cscvy/",
      "text": "Congratulations on submitting, many people don't even make it that far! The UK PhD system is a joke when it comes to time limitations and you're not alone in feeling its bite. The same is true for running out of funding for the fourth year. Oh yeah sure we can just keep on being full-time students whilst having zero income because it's so easy to build savings on the generous stipends they provide! /s\n\nI just wanted to let you know that you have inspired me. I have been writing my thesis for two months now (due to submit in less than two) and it is the most miserable thing I have ever done. \n\nI have a job lined up and don't need to finish this, but the idea of not finishing the thesis is something I can't deal with. I could deal with failing it, but not completing would always hang over my head.\n\nIf you have any sage words of advice on how to keep writing when it brings no joy I would love to hear them.",
      "author": "poundSound",
      "created": 1533050755,
      "upvotes": 17,
      "replies": {
        "e3cwc3o": {
          "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3cwc3o/",
          "text": "God yes, I could rant about this forever. The US system (in comparison) seems much better structured. Here you're expected to give everything in return for very little. \n\nI really sympathise with you, your post could have been written by me in the past! I hated it so much, especially since I started work, and I seriously envied all my colleagues who could go home and mess around while I had to go home and keep writing. I can't even explain why I didn't quit, but it just felt so wrong to do that - I had to finish! \n\nBut in some ways, the best time to write is when it brings no joy and you're totally dissociated with it. Remember, it only needs to be good enough - you don't need to reinvent the wheel. \n\nEveryone says this but breaking it down into sections *really* helps. Work out how many words you'll need to write per day in order to get done, and commit to doing that. If you have days where you write more, great! But if not, just aim for the minimum. At the end of the day I think that if it has to be finished, you will finish it (that was my motto) but it's better to be organised and feel happy with it than to finish everything in a rush. On the days when you're *really* not into it, just outline a chapter or focus on making sure your references are sorted. \n\nAlso try and reward yourself in other ways. Try not to give into the temptation to do late nighters. 2 months is plenty of time, you got this! ",
          "author": "Sadthrowaway667",
          "created": 1533054052,
          "upvotes": 7,
          "replies": {
            "e3d165f": {
              "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3d165f/",
              "text": "For planning how much to write every day,  I quite liked https://www.pacemaker.press\n\nAlso let’s you schedule specific periods or days of the week to be easier, harder, or completely taken off\n\nTo op: I’m so proud of you for finishing. It’s a massive achievement and I really admire you for sticking with it when it seemed so hard",
              "author": "BobbTheBuilder",
              "created": 1533057952,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "e3cqa2e": {
      "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3cqa2e/",
      "text": "If it's any consolation, I haven't even begun my PhD journey and I already look up to you. ",
      "author": "lightsnooze",
      "created": 1533048987,
      "upvotes": 18,
      "replies": {}
    },
    "e3crnnr": {
      "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3crnnr/",
      "text": "Hang in there! I know I'm a random internet stranger but I'm proud of you!",
      "author": "AaronKClark",
      "created": 1533050167,
      "upvotes": 6,
      "replies": {}
    },
    "e3edggu": {
      "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3edggu/",
      "text": "just rest up and take it easy for a while.\nIt sounds like you already know it will bounce back to you for revision, so maybe after a break start working on the parts you definitely know require changes",
      "author": "edubya15",
      "created": 1533105344,
      "upvotes": 3,
      "replies": {}
    },
    "e3efzzu": {
      "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3efzzu/",
      "text": "Congratulations and well done!!! You’ve shown tenacity and grit, which is one of the things a PhD is meant to test. Good luck for the next stage!",
      "author": "nsssusanna",
      "created": 1533109987,
      "upvotes": 3,
      "replies": {}
    },
    "e3cur1j": {
      "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e3cur1j/",
      "text": "An unfortunate username checks out",
      "author": null,
      "created": 1533052740,
      "upvotes": 2,
      "replies": {}
    },
    "e50odbw": {
      "link": "/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/e50odbw/",
      "text": "Update, OP? \n\nHow are you doing now? ",
      "author": "benjaminikuta",
      "created": 1535517009,
      "upvotes": 2,
      "replies": {}
    }
  }
}