{
  "sid": "9vbyhz",
  "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/",
  "title:": "How do we make people outside academia trust us?",
  "text": "Hi all,\n\nThis is a question of very general nature which has been bugging me for a while, and which I feel resonates very much with contemporary issues.\n\nThe question is very straightforward: how do we make people outside academia trust our opinion?\n\nSay I am a climatologist. When I talk about climate change with my colleagues, we all agree it's man made. Then I try to explain the issue to someone outside academia (a 'layman'), and suddenly I am questioned on very basic issues. Non relevant questions are asked, bogus information from tabloids and blogs is quoted to counter my explanation and so on. Our very reasonable, science-based explanations are met with disdain: we sound boring, we have a lecturing attitude, we want to change other people's opinion etc. We are 'that guy'.\n\nI love debating and discussing, but I also trust specialists to have the last word on their subjects. Yet, people seem to think they are always as qualified as you, as if the discussion is always among peers. This makes most interactions with other humans plainly annoying.\n\nSo, again: how to overcome this issue and make people understand that not every discussion is among peers?\n\nThis is obviously related to fake news, climate change, vaccines, cospiration theories and so on. Who has the right to speak, and who should stick to listening? How do we make them?\n\n***\n\nEdit after reading most comments, to clarify my stance & other issues:\n\n* I am not a climatologist, that was just an example. My bad for not being clear! My field is history of central asia, expertise on Iran & China. To be clear, this means dealing with sensitive issues such as a) religion, namely Islam, b) sensitive historical topics such as colonialism, crusades and whatnot, c) ethnicity and nation-building. Horrible! :)\n* Not doing outreach when I'm just bad at it is reasonable, but not an option to me for the following reasons: a) I am state funded, my job is to educate the people even if they do not want to, because money spent on me is money NOT spent on building roads, funding hospitals etc. b) I believe everyone has the potential to learn and listen. I just don't understand why humans do not behave rationally when it comes to learning and discussing. Yes, I know about most psychological explanations, BUT I also think people have a duty to try and overcome the basic, childish craving for external and internal validation described by Hegel (\"I must be right and I must be recognized by others as someone who is right, otherwise I won't exist anymore\"). To me, they CAN. They just don't want to.",
  "author": "Warahram",
  "created": 1541697869,
  "updated": 1634081848,
  "over_18": false,
  "upvotes": 115,
  "upvote_ratio": 0.93,
  "comments": {
    "e9axuux": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9axuux/",
      "text": "I don't think this issue is specific to Academia, I think general mistrust is everywhere and its probably due to the sheer amount of information thats out there now thanks to modern tech. \n\nIts difficult to processes everything that comes your way day-to-day and I think that often leads people to taking intellectual and mental short cuts, often guided by emotions and gut feelings, that often lead to them coming to false conclusions.\n\nI think the problem probably wont have a simple solution, one potential solution is that critical thinking skills need to be developed in kids as part of the curriculum from a young age \n\nI don't have any answers but I think about this issue a lot and I think it will get worse before it gets better",
      "author": "liamkun",
      "created": 1541699030,
      "upvotes": 65,
      "replies": {
        "e9ayfg6": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9ayfg6/",
          "text": "I feel like part of the problem is that appearing to not know something is considered a weakness and you can avoid that appearance by use of the rhetorical tactics you mentioned (gut feelings, short cuts, etc).  \n\nAlso, a persons social circle will ultimately determine what beliefs are acceptable.  Those beliefs aren't sacred cows, but you will need to identify them and work hard to challenge them constructively if you want to change them.  People learn new things and change their minds, but they won't if they feel like they're being attacked.",
          "author": "gunch",
          "created": 1541699461,
          "upvotes": 18,
          "replies": {}
        },
        "e9c54ue": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9c54ue/",
          "text": "[deleted]",
          "author": null,
          "created": 1541734987,
          "upvotes": 8,
          "replies": {
            "e9chxl1": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9chxl1/",
              "text": "Both your replies are extremely interesting. Thanks for taking the time.",
              "author": "Warahram",
              "created": 1541750808,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "e9aynie": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9aynie/",
      "text": "This is a topic near my heart and I am glad to see this brought up. My personal way to go about this has been less about getting more information but working on my conduct:\n\n- identifying and avoiding common logical and argumentative fallacies.\n\n- try to truly engage in a dialog along the rules of good form. Do not get upset. Take your time. Engage with your conversational partner rather than outright dismissing him/her.\n\n- test and be aware of your own personal biases.\n\n- be aware of major snake oil salesmen or their strategies and be prepared to refute them.\n\nIf you are looking for expert knowledge, you could check out the Committee for the Public Understanding of Science for example.",
      "author": "Flopsikin",
      "created": 1541699629,
      "upvotes": 11,
      "replies": {
        "e9b01er": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b01er/",
          "text": "Yes, I also think this is the only way. Yet, I find it very cumbersome and I don't really see why the one who has to the all the work is *the one who already did all the work*. You know what I mean?\n\n&#x200B;\n\nPersonally, I may stick to not talking to most people beyond basic interactions, which is my stance atm. Yet, it's a hard choice, and I am also against it because I believe people *do have* the means to be better, they are just very, very lazy.",
          "author": "Warahram",
          "created": 1541700671,
          "upvotes": 1,
          "replies": {
            "e9b16hg": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b16hg/",
              "text": "Well, for one science tends to be funded with public money. So being able to explain the value of your research to people who contribute to your funding is a valuable skill in general.\n\nOn the other hand, scientific language has very little overlap with how most people think and speak. It is a very methodical and unintuitive way of asking questions and posing problems.\n\nOn a personal level, I consider making an effort as a scientifically literate person to communicate what you are doing and to argue against major anti-intellectual strongholds like anti-vaccination and climate change denial at least on par to the actual work they do in terms of importance.",
              "author": "Flopsikin",
              "created": 1541701541,
              "upvotes": 6,
              "replies": {
                "e9b2rlj": {
                  "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b2rlj/",
                  "text": "Yes, I fully agree with you (see my reply below to another redditor). Public fundings = being a public servant, in some sense.",
                  "author": "Warahram",
                  "created": 1541702749,
                  "upvotes": 1,
                  "replies": {
                    "e9dwcla": {
                      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9dwcla/",
                      "text": "No, you are not a public servant. That is genuinely a whole other beast. It is however your responsibility to communicate the reason and value of your work and that can include the general public. After all, acquisition of funding is an important tasks for most scientists.\n\nI am honestly beginning to take issue with your understanding of your role and priorities. It seems ill-defined. It makes you seem inexperienced at best, misguided at worst.",
                      "author": "Flopsikin",
                      "created": 1541800809,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e9ay8i0": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9ay8i0/",
      "text": "More accessible communication.  Communication that doesn't make people feel dumb and therefore defensive.  \n\n>Who has the right to speak, and who should stick to listening? \n\nEveryone has the right to speak.  Who should listen?  Probably academics if they want to engage in a constructive way.\n\n>How do we make them?\n\nYou can't, and trying will only further alienate them.  \n\nIs it fair?  No.  But that's not what you're asking.",
      "author": "gunch",
      "created": 1541699314,
      "upvotes": 41,
      "replies": {
        "e9b4096": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b4096/",
          "text": "OP, I agree with this poster, and your attitude about who has the \"right\" to speak and who should be \"made\" to listen comes across as very authoritarian and it's not going to help you at all, especially in your day to day conversations. \n\nI think your question ultimately points towards persuasion.  There is a lot of writing and literature around this - google things like \"the science of persuasion,\" \"persuasive design,\" and also look for the books of Dr. Robert Cialdini.  That will get you pointers on how to frame your arguments and discussions on various topics so that they can be better heard.   \n\nAs to your larger point as to why YOU should have to do the work of crafting your argument so that others will understand you better, well, that's life I'm afraid.  If you want your message to be understood, it's incumbent upon you to phrase it in such a way that it can be received.  Or, you catch more flies with honey than you do with vinegar.",
          "author": "FlightyTwilighty",
          "created": 1541703690,
          "upvotes": 17,
          "replies": {}
        },
        "e9azujr": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9azujr/",
          "text": "More accessible communictaion: agree\n\n  \nEveryone has the right to speak: disagree, even though I understand where this comes from. IMO everyone has the right to speak *at the beginning*, then once an explanation is provided, you should be self-aware and reply if you actually have valuable inofs, otherwise eitehr a) ask more information or b) say thank you and appreciate learning something new.  \n\n\nAcademics should listen: yes, agree, and yes, it's unfair but that's the way it is",
          "author": "Warahram",
          "created": 1541700526,
          "upvotes": 4,
          "replies": {
            "e9cgv9u": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cgv9u/",
              "text": "The implication of your second answer is that any topic of discussion or question has a clear explanation that can be provided, possibly even by one person who has been educated enough. \n\n\nIn reality, the world isn't as simple as \"I studied this therefore I know everything entirely and factually, thus my explanation is without flaw and the only correct one\" - whether that conversation is between an academic and lay person or between two academics. \n\n\nThat has a knock on to your third response - if academics should listen, who should they listen to if lay persons are implicitly expected to agree with them by virtue? As somebody who is part Persian and has studied Iran extensively both from a Western and Persian perspective, I guarantee there are probably things about your specialization that I wholly disagree with. But is my viewpoint simply invalid because it wasn't my main formal education? Or what would happen if it was, and how would we agree on the correct explanation? The very point of discussion is to offer differing viewpoints and challenges and see a broader perspective, not necessarily to find one infallible explanation for any question - which oftentimes imo doesn't exist.\n\n\nWith that in mind, my personal response to your main question is that making scholarly research more accessible would go a fair way to reducing the about of misinterpration in the mainstream media, as fact-checking what a media outlet reports about a particular study versus what the study actually proposes would be easier. In time, the ability of non-academics to comprehend and have an appetite for research may rise, hopefully anyway. ",
              "author": "izvin",
              "created": 1541749004,
              "upvotes": 7,
              "replies": {
                "e9ciavi": {
                  "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9ciavi/",
                  "text": "\\> The implication of your second answer is  that any topic of discussion or question has a clear explanation that  can be provided, possibly even by one person who has been educated  enough.\n\nIn reality, the world isn't as  simple as \"I studied this therefore I know everything entirely and  factually, thus my explanation is without flaw and the only correct one\"  - whether that conversation is between an academic and lay person or  between two academics.\n\n&#x200B;\n\nYes, this is of course true. How to solve public debt? I have no clue, and economists may disagree on how to answer this questions. Complex problems require complex answers. On the other hand, we seldom ask non-specialists how to fix public spending. Most of the topics we discuss in public do have very clear-cut answers and explanations.  I am sure you would agree.\n\n&#x200B;\n\nIn connection with the other point you made, let me make an example to explain myself better. I'll choose Iran since you know it well.\n\n&#x200B;\n\nIf I am having a conference on Iranian history, I can understand why somebody may come out and say something like \"Arabs stole our contry and our religion and the current government does the same, we are the people of Cyrus, our religion is Zoroastrianism, stop saying that the religion of Iran is Islam!\". You can find tons of this crap if you go and scroll r/iran. Yet, once I provide this person with a well-rounded answer grounded in facts, he/she is required to step down and accept my expertise, whether I ate kashke bademjun for lunch or not. Being Iranian is not the same as being an expert of Iran: I am Italian, ask me about Italy in the XVII century. I know nothing, literally nothing. Can I argue with say a Canadian specialist of Italian history if she says something I dislike on the basis that I eat a lot of spaghetti? Are natives always right? In fact, we know they are almost always wrong. Which leads us to\n\n&#x200B;\n\n\\> But is my viewpoint simply invalid because it wasn't my main formal  education? Or what would happen if it was, and how would we agree on the  correct explanation?\n\n&#x200B;\n\nIt may or may not be invalid because of that: we can assess it together. If we're both honest, we'll solve the matter or agree on the fact that neither of us has a full explanation. This requires both people to listen. The problem is, that people just don't. A priori. A fortiori. Apparetly, people do not want to learn. They just want to be right.  \n\n\nEDIT: I messed up with quotes as you can see, sorry about that.",
                  "author": "Warahram",
                  "created": 1541751489,
                  "upvotes": -2,
                  "replies": {
                    "e9d6gqq": {
                      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9d6gqq/",
                      "text": "The fact that you just called the viewpoint of some Iranians on a culture and history that they are living through \"crap\", on top of everything else in this thread, solidifies how pompous and self-righteous your approach to discussions with people are.\n\n\nAnd for your information, as an economist working in government, most policy decisions we take involve public consultations where we specifically ask lay people and non-policy makers to give us their viewpoint, experiences, and opinions on issues like public spending, debt, etc so that we learn something from them despite us being the experts. Perhaps you too could try to practice a similar approach in your discussions in hopes that you might learn something from others.",
                      "author": "izvin",
                      "created": 1541780527,
                      "upvotes": 4,
                      "replies": {
                        "e9d7nu0": {
                          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9d7nu0/",
                          "text": "I am sorry, there is no viewpoint on history. Things either happened, or they didn't. National myths such as \"we are the origin of the world and the best of the best\" are crap, and I'll be happy to say that again. Fascist Italy was literally built on this crap and we saw how that ended. The same goes with 1939 Germany. And this stuff btw is still very much with us so yeah dismissing it is of the utmost importance for every historian if we want to avoid to get people dead. This is very dangerous crap and the fact that people believe in it is a tragedy for our species. Why this would be an unpopular opinion is beyond me.\n\nAs someone who is at least partly Iranian, you know more than many how dangerous the nationalist rhetoric is. Again, how you fail to agree with me on this puzzles me. You don't need to like me to agree with me. \n\nIf you don't, what can I say, keep respecting national crap, make America great again, rebuild the Roman empire. You'll surely have many followers. Innocents will pay the price, as always.\n\nOn the rest, of course you do ask, and you should. Your choices impact the life of the people. I deal in medieval history. Nothing to ask there, and if I would, you can guess what I'd find: crap on the crusaders freeing the world of bad muslims on the one hand, crap on Medieval European colonialism on the other, and so on. Better not to open this Pandora's box the content of which everybody seem to respect so much (the results are all around us, see Talibans among the many)",
                          "author": "Warahram",
                          "created": 1541781461,
                          "upvotes": -1,
                          "replies": {
                            "e9da8vd": {
                              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9da8vd/",
                              "text": "I never referenced fascism or nationalism. Why have you extrapolated that. \n\n\nYou have no right to tell people who have a government mostly full of non-nationals who have literally banned them from practicing their own cultural festivals, banned them from having their historic names, banned them from  having their own or any other religion, and who are facing prison, torture, and execution if they do so that they are *not* allowed to feel like their identity is being taken away from them. \n\n\nHow come your example of a policy maker was relevant when you wanted to draw similarities, but now is irrelevant because you're not a policy maker.. On the contrary, you too can actually benefit from asking others regardless of policy impact because if you take it upon yourself to teach others you should strive to always challenge your thoughts, engage other viewpoints, and strive to learn something. That is the very point of education on the first place, not getting a degree and then deciding you have nothing else to learn because you are a supposed expert.\n\n\nMate you should take a specialised academic course on how to have a relevant, respectful, and open discussion rather than thinking you are some omnipotent fountain of knowledge. ",
                              "author": "izvin",
                              "created": 1541783524,
                              "upvotes": 3,
                              "replies": {
                                "e9dcknv": {
                                  "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9dcknv/",
                                  "text": "The identity that is supposedly being \"taken away\" from them was built maybe a hundred years ago. It's fake, as is every other identity. It's a discourse, and a very dangerous one because it was specifically engineered and sold to the masses to build a nation-state. A bogus idea of \"arian purity\" lies at its core. This identity actually was built, among other things, to get along with Nazi Germany appealing to antisemitism (\"we're not filthy arabs, we are arians just like you\"). This is why I was referencing to nationalism: because it's a deeply nationalistic and intrinsecally racist narrative. I though you knew it and you would have understood the reference.\n\n&#x200B;\n\nNow, if you support this toxic narrative, that's on you. I hope you understand that as an historian and as a decent albeit apparently unlikable human being I have a duty to expose the falsity of these claims when I see them, at least if the person I am talking with is a cultured and intelligent one such as you who is (supposedly) open to questioning his/her beliefs.\n\n&#x200B;\n\nLast, the fact that many in Iran are suffering has nothing to do with the truth or lack thereof of said claims and does not justify them. It's another topic which I won't discuss here.\n\n&#x200B;\n\nIn conclusion, I must learn how to discuss. That's for sure. Yet, if you feel like doing some self-criticism, you too should perhaps try and be more critical and suspicious of the narratives you choose to support.",
                                  "author": "Warahram",
                                  "created": 1541785325,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e9azdgc": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9azdgc/",
      "text": "> I also trust specialists to have the last word on their subjects\n\nbecause you've spent a lot of time around specialists and you know how the sausage is made. The people you're talking to didn't have that luxury. They don't really understand what a specialist is and how they're different from Sam Harris or that guy downstairs ranting about socialism, so why should they trust a specialist?\n\n> Then I try to explain the issue to someone outside academia (a 'layman'), and suddenly I am questioned on very basic issues.\n\nI'm not outside academia, but I am a layman when it comes to climate science because I'm not in STEM. That word doesn't need quotation marks - you're not using it euphemistically, and I sure hope you're not using it derisively. You're a layman in my field, and in every other field besides yours, and there is nothing reprehensible about this because otherwise we wouldn't have specialists. Anyway, sometimes I need to ask very basic questions because the last time I took a lab science was in high school. I do this because I have a probably innate human desire to understand the why as well as the is. I also expect that speaking to a scientist will leave me with more intellectual satisfaction than speaking to a priest or my mother when I was 6. Is discussing the same basic ideas over and over annoying? Are the questions sometimes poorly worded and sometimes belligerent? I used to do this over on /r/AskEconomics - holy shit are both those things true. It's also part and parcel of the job. You don't have the bandwidth to deal with the hoi polloi? You know what, instead of half-assing this thing, why don't you full-ass something you *are* passionate about and leave this one for others?\n\nPeople have given you good suggestions about how to do outreach and why, but ultimately educating the uneducated is, like, the point of the exercise and trying to devise a solution where you're not dealing with the uneducated is a bit like the joke about the economist and the can opener. Congratulations, you have discovered that outreach is hard. That's why we need people who want to do outreach, and who care about doing outreach well.",
      "author": "thegreenaquarium",
      "created": 1541700157,
      "upvotes": 17,
      "replies": {
        "e9b13x5": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b13x5/",
          "text": ">you've spent a lot of time around specialists and you know how  the sausage is made. The people you're talking to didn't have that luxury\n\nYes, this is very true. On this, I'd also like to point out that I am European, I went to free public school and my family is certainly not a wealthy one. (Almost) everyone here can enjoy this luxury. Most, just don't want to.\n\nOn the other hand, maybe not everyone had such a supportive family/inquisitive mind/luck to being with, so this should also be considered. What I mean is that I was very lucky, but also, not *so* lucky.\n\n>That word doesn't need quotation marks - you're not using it euphemistically, and I sure hope you're not using it derisively\n\nAbsolutely not (also, not a climatologist: it was just an example). Outside my narrow field, I sure am a total layman. For example, I don't understand basic science! Yet I am very inquisitive (perhaps) by nature, and I tend to learn all I can even *outside* my field. I am an expert of Iran, yet I have quite a wide section of my library on the classical world, medieval history, and contemporary North Korea, to name a few fields. What I mean is that, the way I see it, you can't just use being a specialist in something as an excuse for being ignorant on the rest.\n\nEqually, you can't be excused for your ignorance for being in sales. Hell, my father is in sales, never went to high school, his mother is totally illitterate and yet he has an *enormous* amount of masterpieces of world literature I spent my childhood reading. There's no excuse for not pursuing knowledge in the first world (besides obvious cases of hardships etcetc). I feel this also should be considered.\n\n>You don't have the bandwidth to deal with the hoi polloi? You know  what, instead of half-assing this thing, why don't you full-ass  something you *are* passionate about and leave this one for others?\n\nYes, this is what I do atm. But I feel very conflicted about it, for the following reasons:\n\n* I respect people, so I can't stand to see them scammed and deceived all the time.\n* I am payed by the state, that is, the people. My job is to educate the community and I take this seriously: this money could have been spent on ambulances or firefighting, yet, it has been given to me.\n\nEdit: In other terms, elitism goes against my beliefs. I am horrible at doing outreach, yet I feel like I must to and I actually *want* to. I'm just horrible at it, because to me you should just be self-aware and know where your limits lie. It's ok: you are great at fixing cars, something I could never do, and I'm great at explaining you history, sociology or whatever. Why do I listen to you, and you *never* listen to me?!",
          "author": "Warahram",
          "created": 1541701488,
          "upvotes": 4,
          "replies": {
            "e9bh5bk": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bh5bk/",
              "text": "> (Almost) everyone here can enjoy this luxury. Most, just don't want to.\n\nI am also European. In the European countries I know, the quality of schools has wide geographic differences and not realizing that is a privileged mindset. But I'm not talking about K12 education.\n\nIn order to appreciate how science is done and what makes a specialist, most people need to go to grad school. Even those people who go to university (~30% in the EU28, I think) for the most part don't do anything beyond going to class, getting the degree, and getting a job. Case in point, the number of questions we get from undergrads who think that being a professor means teaching a couple classes per semester and relaxing the rest of the time. I suppose you could argue that they just don't want to, but I think this is flippant at the cost of being myopic. Most people don't care because they're doing other things. And this is good, for the economy, for society, and for you personally. We need mechanics, nurses, dancers and management consultants same as we need academics.\n\n> Absolutely not\n\ntbh judging by the rest of your post, you kinda do\n\n> There's no excuse for not pursuing knowledge in the first world\n\nOkay. How do you intend to operationalize this belief? It's not productive to talk about how the world should be while ignoring how it is.\n\n> \nEqually, you can't be excused for your ignorance for being in sales. Hell, my father is in sales, never went to high school, his mother is totally illitterate and yet he has an enormous amount of masterpieces of world literature I spent my childhood reading.\n\nYour personal narrative has nothing to do with how other people act or should act or will act.\n\nI think your position, that everyone should adopt your utility matrix because it is objectively superior, is pointless and yeah, blatantly elitist. Most importantly, it is probably the main obstacle towards you achieving the goal you set out in your OP. If someone started lecturing me on what books I should have been reading in childhood to be a worthwhile human being, my instinct would be to punch them, not listen to what they have to say.\n\nI don't understand why this is upvoted. This is terrible. And I'm like the snobbiest person on this sub.\n\n> I am horrible at doing outreach, yet I feel like I must to and I actually want to.\n\nMan, it's not gonna happen until you're prepared to respect differing views or at least not come across as a pedantic snob when disrespecting them. Treating people like equals is a prerequisite to them liking you, and them liking you is a prerequisite to you getting through to them.\n\n> you are great at fixing cars, something I could never do, and I'm great at explaining you history, sociology or whatever\n\nI mean, do you hear yourself? Elitism goes against your beliefs, are you sure?\n\nYou may be great at thinking about history etc, but it doesn't seem like you're great at explaining anything. Being a good explainer takes humility, maturity, ability to see another person's point of view. It's a communication skill. Communication skills rely on reading your audience and being able to change up your delivery to suit your audience's needs, not being enraptured by your own intellect or ego. Most people are terrible at this. ",
              "author": "thegreenaquarium",
              "created": 1541714024,
              "upvotes": 9,
              "replies": {
                "e9bko7e": {
                  "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bko7e/",
                  "text": "HEAVY EDIT of my previous comment, to give you a more articulate reply. Sorry!\n\n&#x200B;\n\n>Okay. How do you intend to operationalize this belief? It's not productive to talk about how the world should be while ignoring how it is.\n\n&#x200B;\n\nThis is easy: people should just buy some books, sometimes. It's not really hard and I fail to see what's wrong with this suggestion. I have many friends who never attended university, read a lot and are genuinely interested in learning new things. It's really not that hard, you just have to be a human being and follow the basic patterns describing our species, which dictate that we enjoy solving problems and actively learning new things.\n\n&#x200B;\n\n>I think your position, that everyone should adopt your utility matrix  because it is objectively superior, is pointless and yeah, blatantly  elitist. \n\n&#x200B;\n\nI can see why you say that. But I also think that humans should act rationally and pursue the best course of action. To me, the fact that willing to learn new things is objectively good for you as an individual & as a member of your species is self-evident. I genuinely don't understand why people don't realize that.\n\n&#x200B;\n\n>Man, it's not gonna happen until you're prepared to respect differing  views or at least not come across as a pedantic snob when disrespecting  them. Treating people like equals is a prerequisite to them liking you,  and them liking you is a prerequisite to you getting through to them.\n\n&#x200B;\n\nYes, this is surely true. But is also intrinsecally idiotic on many levels. \n\n* When we're discussing my subject, we're not equals, just as when my doctor is telling me why I should quit smoking. This is, again, self-evident. If I had a garden & a gardener would tell me not to plant my plants in a specific spot cause it's bad for them, I would listen. He's the gardener. I'm the historian. How is this wrong or elitist?\n* Also, it's very idiotic that people pay to create specialists, devote resources to their maintenance and then dismiss all they say. Again, is saying so elitist? Is logic elitist? Help me out here. My salary is literally paid by nurses and bartenders so I can explain them complex phenomena. This is my role in society. Why appoint me to do something, pay me and then ignore me? How can everyone fail to see how stupid this is?\n* People, including me, are not entitled to having a view on topics they have no grasp of. They can have tentative opinions, as we all do, but they must be open to changing them if they receive new information. I had and surely still have many stupid beliefs. I ask, learn, and change them if I can. Again, is asking the same of my fellow humans elitism? Elitism = I'm better. Egualitarism = You're like me. If I can do it, you can. I am egualitarian inasmuch as I hold everyone to the same standard: rational behaviour.\n\n&#x200B;\n\nLast, I invite you to consider that people vote and, as such, literally have a saying on who lives and who dies. If you doubt it, consider Afghanistan, Yemen, Syria. They must be held accountable. They can't get a free pass on everything including, again literally, genocide, just because they're not researchers. People have the duty of doing what they can to better understand the world. They own it to me, you and every other human on this planet. Is this elitism?\n\n&#x200B;\n\nIt seems to me that you are way more elitist than I am, because you hold people to different standards: us, the privileged researchers, and them, the commoners. We must understand them, suit our words to them, as if they were childrens. I, on the contrary, ask of them what I ask of me: being rational, realizing you have a duty towards other humans, realizing that you must be critical and vigilant always.\n\nI realized this at about 15. I'm sure everybody can realize the same quite soon. Most just decide not to act upon said knowledge, cause it's too hard. You seem to give them a free pass, cause to you, they are too stupid to be held accountable. I don't. To me, they have the same intellectual means and consequentially rights & duties I do. How am I elitist?\n\nThey can't change phone, car and boat every year, cause they know this totally destroyes the environment. They can't support politicians who drop bombs on countries they can't even spot on a map, cause they get people, very real people, dead. They can't be sexist and pretending it's ok, cause 99% of them actually knows it's horrible and still does it anyway, cause it suits them. And so on and on. We keep giving everyone free pass, and we'll all be dead in 100 years.",
                  "author": "Warahram",
                  "created": 1541716930,
                  "upvotes": -1,
                  "replies": {
                    "e9cuj1g": {
                      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cuj1g/",
                      "text": "> This is easy: people should just buy some books, sometimes. \n\nWell, they're apparently not doing that now, and how would you ensure that they do? If they buy books, how do you ensure that they read them? Understand them? Operationalizing your belief means putting it into practice. Doesn't sound easy to me /:\n\n> But I also think that humans should act rationally and pursue the best course of action.\n\nHumans already do that. You just disagree that the course of action they are pursuing is the best for them, which is a restatement of \"you think your utility matrix is objectively superior\".\n\n> To me, the fact that willing to learn new things is objectively good for you as an individual & as a member of your species is self-evident.\n\nThe way I read you, to you, willing to learn things *that you approve of* (Iran, classical literature, climate change, and whatever is taught at university) is good for you and others. This is a tiny portion of the spectrum of things that can be learned. Second, learning things takes time. I'm in grad school, so I'm always learning things. This means that I usually don't have time for going to the gym, seeing friends, or learning things that aren't part of my program. Everyone else performs the same opportunity cost calculus, and why must learning about Iran always win out over everything else? Third, keeping in mind the cost of learning things, do you still think learning them is universally beneficial? i.e. would your mechanic create more value for society by spending 2 hours a day learning about Iran, or by spending 2 more hours a day fixing cars?\n\nIt's true that learning things is on the margin probably better than not learning them, but we live in a 24 hour world in which we need to work, sleep, tend to our children, get a beer with friends, etc. Other people's preferences for budgeting their time are clearly different from yours (otherwise they would also be full-time academics studying Iran) - how do you account for that in your policy proposal? Please don't say \"they should just be more like me because I am a superior human being\".\n\n> But is also intrinsecally idiotic on many levels.\n\n*intrinsically\n\nTreating people like equals doesn't mean treating them like fellow experts. It means treating them like fellow human beings. It seems you may have a problem with that because you don't think that non-experts are human beings.\n\n> It seems to me that you are way more elitist than I am, because you hold people to different standards: us, the privileged researchers, and them, the commoners. We must understand them, suit our words to them, as if they were childrens.\n\nIt is not elitist to recognize that non-academics have different priorities than academics, and to recognize those priorities as just as valid, and to accommodate these priorities. Just as it is not elitist to recognize that women are disadvantaged vis a vis men, or that POC are disadvantaged vis a vis white people, and to enact segregationist measures to equalize them.\n\nI don't think you should be doing outreach work. Reason being, you approach it with an obvious non-solution (\"to improve communication, people should just magically become like me!\"), and when it inevitably fails, you throw up your hands in exasperation and call everyone worthless and stupid. Your behavior is harmful, and if you are (hopefully) better at research, you would benefit society more by doing more research and not engaging in this fruitless labor.\n\nThe reason I think this is happening (and also why I call you elitist) is that you bullishly refuse to consider any perspective that you disagree with, either from the people you are ostensibly trying to educate or from me. If people do something you don't like, it's because they're made wrong. If I disagree with something you say, it's because I'm elitist and stupid. You are perfect. You can do no wrong. How do you expect to create critical dialogue with others when you cannot stand to have critical dialogue with yourself?\n\nIf you think education is your role in society, get better or quit. Passion is not good enough. Nobody needs your passion. We need *professionals*: people who are good at their job, not just when they're passionate, but when they're tired, when they're frustrated, on Tuesdays, after a crazy night out, when their child is sick, when the world is collapsing around them. People who don't think that their \"passion\" absolves them from the responsibility of delivering an adequate service.\n\nI think, instead of going around calling people stupid, you should sit down and think about how people *do* act, not how you think they should act, and how you can modify your approach to better serve *them*, not your ego. Working with real life is difficult at first, and the uncertainty and the incorrigible way that shit sometimes goes wrong for apparently no reason is frustrating, but I think this is a great opportunity for personal and professional growth.\n\nI also think /u/noxiousquadrumvirate put this much more comprehensibly and implementation-readily than I did. It's almost like I know what I'm talking about when I say that communication takes a lot of concerted effort.",
                      "author": "thegreenaquarium",
                      "created": 1541769914,
                      "upvotes": 4,
                      "replies": {
                        "e9cwffc": {
                          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cwffc/",
                          "text": "I must indeed be a terrible communicator, or you must be biased against me, or both, because you keep misreading me.\n\nI will try to be more clear. But please, you too make an effort and try to be less aggressive and biased.\n\n1. I don't think you're stupid. I am discussing with you because I value your input and I am ready to change my ideas. Otherwise I would not be replying. Can we agree on this? Can I ask the same of you? Are you ready to actually discuss instead of preaching?\n\n2. I never said that everyone should quote Ovid in context while fishing or farming or fixing laptops. I am not stupid, despite you being so utterly sure that I am or trying to represent me as such. I said that people have a duty to make an effort and continuously improve their knowledge. I stand by this assertion. This lies at the very core of democracy and I really don't know how you fail to see this.\n\nIf a politican calls for invading Iraq, citizens have a DUTY towards knowing WHERE Iraq is and WHY it should or should not be bombed. Do you agree? If you don't, then the discussion is over, because we disagree at a fundamental level. The information is out there, there is no excuse.\n\n3) At a deeper level, it is also very reasonable that citizens consider what specialists in the field have to say. They appointed said specialists for this very purpose. This is logic. Please don't make it about me, because it's not. We exist in order to help non-specialists take better decisions. Do you agree? If you do, then you'll agree with me when I say that it is reasonable for people to consider what we have to say before taking a definitive stance. If you don't, then why are you there and how do you justify your job?\n\n4) At an even deeper level, consider statisics on literacy. How many people read ZERO books a year? In my country, they are a lot. Like really a lot. How many people suffer from funtional analphabetism? In my country, an impressive amount. These people can not UNDERSTAND a basic text. This is a major issue at every level, including political. Do you agree? They are easily maneuvered by bad actors, they are easily scammed, they are vulnerable. \n\nWhile I argue that there are structual causes for this (namely, the state is at fault, NOT \"stupidity\", which doesn't exist), I struggle at considering these people as peers in a discussion. It's not their fault, but also not mine.\n\nI don't know how to solve this situation. Critical thinking must be taught more and more, that's all I know.\n\nI hope I managed to explain myself a little better. Now, if in your opinion this is all false and everything is ok and people have the right of having a knowledge limited to writing their name, then I am out of arguments, we just disagree.\n\n\nMinor edit: please don't give me any more of that \"they don't have time\" or \"they have other interests\" bs, cause it's really... well, bs. Again, I'm not saying that people should study Iran or whatever I like, ffs. I am saying that exactly BECAUSE they have other things to do they should listen to us!\n\nIt's because I study Iran that I can't change a goddamn lightbulb. It's because they can change a goddamn lightbulb that they didn't study Iran. I need them and seek their expertise. They need me and they SHOULD seek my expertise, yet they DON'T. HERE lies the countercircuit that drives me mad and that somehow you fail to address. How is this wrong?",
                          "author": "Warahram",
                          "created": 1541771861,
                          "upvotes": 0,
                          "replies": {
                            "e9d0b3l": {
                              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9d0b3l/",
                              "text": "I think we're talking about different things. I don't disagree that people should learn, but I was under the impression that I was answering your question:\n\n> How do we make people outside academia trust us?\n\nSo here I am talking about why non-academics don't trust you, and you come at me with why they should, and why it's so wrong that they don't, and woe is you. I think you are under the impression that talking about how stupid people are for not trusting you is the same as talking about how to make them trust you, but it is not. I am trying to address the latter, and am profoundly disinterested in discussing the former in this context. And I am getting frustrated with you because I feel duped: I thought you were looking for actionable solutions, but it seems like all you want to do is rant.\n\n> I don't know how to solve this situation. Critical thinking must be taught more and more, that's all I know.\n\nIt's also difficult to discuss with someone who makes a statement that he immediately follows up with a contradictory statement: \"I don't know how to solve x; I only know that x will be solved with y\". In this discussion, I see a lot of parallels between you and the people you complain about. If you are insulted by this, please consider that the essence of our disagreement is that I believe that being bullish about one's incorrect priors is part of human nature and a bias that we must always be conscious of, no matter who we are. When I tell you to treat your interlocutors as equals, this is what I am referring to: not that you should treat them like fellow experts, but that you should treat yourself as a human just like them. If you recognized that you are fallible to bad logic and bad evidence, that you have prejudices, that you don't always pay attention to things you should because you don't have the attention span and all those other things you accuse the hoi polloi of, it would be much easier for you to express yourself in a way that non-experts can trust both verabally and non-verabally. The notion that educated people are less fallible to bad ideas is a rationalist fallacy and the social disasters of the 20th century have amply demonstrated as much. I suggest you read Bruno Latour.\n\n> Now, if in your opinion this is all false and everything is ok and people have the right of having a knowledge limited to writing their name\n\nTo what extent is it appropriate to compel people to read whatever you want them to read, and what use of force is just in achieving this goal?\n\n> It's because I study Iran that I can't change a goddamn lightbulb. It's because they can change a goddamn lightbulb that they didn't study Iran.\n\nIt is obvious that changing lightbulbs and studying Iran are very different endeavors. Why then do you assume that our trust in experts of these respective fields should develop identically?\n\n> We exist in order to help non-specialists take better decisions. Do you agree? If you do, then you'll agree with me when I say that it is reasonable for people to consider what we have to say before taking a definitive stance. If you don't, then why are you there and how do you justify your job?\n\nI agree. This whole time I've been saying that the way you're going about it is stupid because you are operating from your image of how the world should be, not how it is. If you are not willing to work within the constraints of reality, I don't care how passionate you are, you should not be doing this job.",
                              "author": "thegreenaquarium",
                              "created": 1541775370,
                              "upvotes": 3,
                              "replies": {
                                "e9d12gb": {
                                  "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9d12gb/",
                                  "text": "You are making this about me again when you say that I believe to be above mistakes, biases etc (which I never said, and which I don't believe). But let's skip this.\n\n&#x200B;\n\nI think you hit the core of the issue:\n\n&#x200B;\n\n\\> I think you are under the impression that talking about how stupid people are for not trusting you is the same as talking about how to make them trust you, but it is not.\n\n&#x200B;\n\nThe two things to me are intertwined. Operational knoweldge depends on the object we want to work on, in this case, human beings - which includes me, I'll stress it so you don't make it again about me.\n\n&#x200B;\n\nI don't want to rant. I want to understand why humans in most cases fail to assess the most convenient course of action and then pursue it. Why they build authority and trust in the terrible  way they do. Because they, we do. We saw it over and over. Mussolini and Hitler had the trust of the people. Why do we make such terrible choices. Why do we have confirmation bias. Why do we live in epistemic bubbles. INCLUDING ME. And how can we escape from the prison we build for ourselves.\n\n&#x200B;\n\n\\> If you are not willing to work within the constraints of reality, I  don't care how passionate you are, you should not be doing this job.\n\n&#x200B;\n\nReality is not a given. It's a product. It can be changed.\n\n&#x200B;\n\nEdit: since I don't want to frustrate you further, and also since you do not seem to have the answer to the questions I am trying to make (admittingly in a tentative way: I elaborate as I write) which are surely more philosophical than \"operational\", I thank you now so you can jump ship if you want to. Believe it or not I appreciated your contribution and will think about your words.\n\nOn the other hand, I don't think you can detach the \"operational\" side from the \"philosophical\" side. \"How to deal with humans\" requires \"what humans are and why\". What is a prejudice, how they are formed, how do they work, how to get rid of them, how communities are formed and how leaders elected, are leaders necessary or not, who speaks for whom. All these questions are very much \"operational\" to me.\n\nWe all give values to the things around us. This include you. Personally, I am forced to value negatively most of my (educated, first-world living) fellow humans, because I find them genuinely uninterested in the damage they cause to other humans & the world in general. They have the means to change, and they refuse to do so. I wanted and still want to understand why this is the case. Why, even when people have the means to choose carefully, which includes asking specialists, they refuse them. How this can be changed.\n\nAgain, I have no answers, only hypothesis. I think we are flawed because, in the end, we are just monkeys. We prefer tall over short, high over low, light over dark by nature. We follow the bigger, nastier ape. We are not built to live in communities of millions of individuals. We are also trapped by language, so much so that we believe in the symbolic more than in the material. Thus we develop weird stuff such as religion and nations and anthems. We're broken. If you are ever interested, you can find more on this in works on philosophical anthropology, linguistics and political philosophy, among others.\n\nFor the rest, lucky you, you seem to be blessed with optimism and not care for how shitty, flawed and stupid we are. Enjoy life! I mean it",
                                  "author": "Warahram",
                                  "created": 1541776047,
                                  "upvotes": 1,
                                  "replies": {
                                    "e9d1ots": {
                                      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9d1ots/",
                                      "text": "> You are making this about me\n\nIf you are an instrument designed to do a job and you are doing it poorly, it is about you. If you don't want it to be about you, you shouldn't be doing this job.\n\n> Reality is not a given. It's a product. It can be changed.\n\nthat constraints can be changed doesn't mean that they don't affect us in a real way. And you have the gall to say that you're not arrogant when you refuse to engage with anything I'm saying and spout this irrelevant pablum instead.\n\n> The two things to me are intertwined.\n\nthat two things are related doesn't mean they're the same thing, can be approached in the same way, or lead to the same outcome.\n\n> Why do we have confirmation bias. Why do we live in episthemic bubbles.\n\nThis isn't your original question and is not appropriate for this sub, so I'm going to leave this discussion and direct you to /r/askphilosophy",
                                      "author": "thegreenaquarium",
                                      "created": 1541776590,
                                      "upvotes": 2,
                                      "replies": {
                                        "e9d8vsq": {
                                          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9d8vsq/",
                                          "text": "Ok, as you want, keep with the ad hominem style. I do engage with what you say though, or at least I try. To me, you're the one that seems not to.\n\nPhenomena such as confirmation bias and epistemic bubbles are very relevant to my original question, and if you don't see it, you're the one who's bad at the job on a very basic level (you're right, ad hominem is so much easier than actually discussing!). Yet, differently from you I don't think you're stupid. I believe you do see the point and you just pretend not to.\n\nThis being said, all the best to you, and thanks for not teaching me anything besides the fact that I'm a bad guy, for some reason. You made some good points, and I appreciated it. On the other hand, rhetorics and a condescending attitude towards everything and everybody won't fix the world though. But I'm sure you are aware of this too. \"Good teachers\" such as you are doing a great job: Salvini, Orban and Le Pen just called to thank you for giving their supporters the possibility to spread their crap far and wide under the banner of \"freedom of expression\".\n\n\"We the people\" utterly suck. And apparently nobody cares.",
                                          "author": "Warahram",
                                          "created": 1541782444,
                                          "upvotes": 1,
                                          "replies": {
                                            "e9d9x7z": {
                                              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9d9x7z/",
                                              "text": "k",
                                              "author": "thegreenaquarium",
                                              "created": 1541783269,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e9bxgba": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bxgba/",
      "text": "I come from a very rural, isolated community and regularly travel back to tell them about my research. How I talk to those communities has to be different to how I'd talk in a city or university.\n\n - Don't dress up. If my audience is all wearing overalls, track pants, and flannelette shirts, I *do not* want to be standing on that stage wearing a suit and tie. That is the fastest way to identify yourself as an \"other\" who does not understand that community. The presenter maintains half a level of dress above audience; if the audience shifts levels, then so do you. \n\n - Be aware of language. Field-specific jargon is absolutely out, as is most mathematics. If you're going to use either, expect to spend 5 minutes just on that one word/equation, and to rehash it regularly throughout. Even terms like \"bachelors\", \"PhD\", \"major/minor\", \"GPA\" etc can be inaccessible to a community that does not salivate over the idea of higher education. \n\n - Don't treat people like idiots. Their lack of understanding of mathematics and jargon isn't because they're stupid, it's because they were never taught. You weren't born knowing calculus either. In many rural communities, a tertiary education is neither required nor useful. These are communities where the work is labour-intensive, like farming. Many are from a time where you could become a mechanic, nurse, or teacher without going to a 4-year university. The things we discuss in our Ivory Towers and the ways we discuss them are wholly separate from the issues/lifestyles of those outside of urban centres. They don't have time to care about a lot of these issues, they're too busy worrying about whether the ground is too soggy for any of their potatoes to take root or whether they'll have to close the only gas station within 50km. If you think that they should just read more books then you are wholly blind to how the world works for these communities, and they can obviously tell. Understand them and respect them. They are not stupid for not being deathly passionate about your topic. \n\n - If people don't understand, then explain. Give them the history of the topic, the key players (with pictures of them), and the overarching narrative. Don't dump facts on them. Unless they have paid you to teach them, your job is actually 50/50 entertainment *and* teaching. You need to present your work in a way that's engaging to them, not to you, your colleagues, or your students. How many images do you include? What about videos, interactive portions, and metaphor? ",
      "author": "NoxiousQuadrumvirate",
      "created": 1541728505,
      "upvotes": 8,
      "replies": {
        "e9chq0g": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9chq0g/",
          "text": "You absolutely make sense, and all the 'tactics' you suggest are valid. Some of them, I use when I'm asked to do presentations to the general public. I'll make treasure of the others.\n\nOn a deeper level, there are underlying problems I failed to mention in my question and which lie at the very heart of the issue. These are the ones that truly crucify me. I'll lie some here for you:\n\n* People seem to inherently dislike and oppose different points of view\n* People seem to stubbornly avoid evolving, changing their ideas and the way they see the world\n* People care about the immaterial and symbolic world more than how they care of the material and factual one\n* People seek immediate gains over long-term ones, be them symbolic or material. So, I won't listen to you even if I may learn something useful (long-term gain), because I care more about how I feel about myself (very short-term, symbolic) than about any matter of truth, logic and novelty\n* People want validation even when they know/suspect they are wrong, because it just feels good\n* People seem to be afraid of discussing\n\nIn general, while it seems natural to me that people should seek learning (for their own sake! There's profit to be made in learning) and avoid ignorance, they seem to systematically take the opposite course of action. As much I want to, I fail to understand why this is the case, why humans are so irrational, why I shouldn't blame them for being so and why the hell I am not like that.",
          "author": "Warahram",
          "created": 1541750447,
          "upvotes": 1,
          "replies": {
            "e9cvrsi": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cvrsi/",
              "text": "But why *should* they change their minds?\n\nPeople in these communities are often faced with two choices:\n\n1. Take the path that best suits their family/business/lifestyle. It may have larger impacts that they are uninformed on or that only occur in large urban centres. It may be the option that is worse for the climate. It may lead to greater tax cuts for the wealthy. But it also saves *them*. \n\n2. Go for whatever the urban population, with their yoga pants, kale, and desk jobs, say is the \"best\" thing. It'll save some esoteric group from some esoteric threat that no one ever really explained to them. But they'll go bankrupt, lose all of the land and business that they passed down the generations, or have to sacrifice some other critical part of their lifestyle. \n\n*Obviously* they're going to go with the thing that's in their best interest, or that appears to be. It's a hard sell to say that they'll eat a buffet in 10 years but they have to starve to death tomorrow for it. The things that benefit people in the cities often harm the people in rural communities, and so when you bring urban arguments to rural centres, it comes across as tone-deaf at best and moronic/evil at worst. People from universities or just cities are seen as slimy lizard men who only care about their own people. \n\nChanging their mind takes massive willpower, effort, and concession on their way of life. Sticking to what they believe, even if incorrect, does not harm them. And so they don't change their mind because there is no incentive to do so. \n\nI imagine you are not like them because you are a city kid. You grew up in or around a large urban centre. You attended university. You had easy access to libraries, and public transport to get there, and were surrounded by people who had *maybe* graduated high school. Few people in my hometown ever saw any of that. Many didn't even complete *primary school*. You can't understand because you're looking down on them from a frankly massive pillar of privilege. These people are not stupid, or evil, or worth less than you in absolutely *any* way. They are working hard and doing their best to survive in a game that you are not even playing and have never played in your life. If you want to connect with them, try talking to these people sometimes and ask them what they're concerned about in their local community. People don't have the luxury of being polymaths if they're living hand-to-mouth. They are being 100% rational for their circumstances and knowledge.",
              "author": "NoxiousQuadrumvirate",
              "created": 1541771199,
              "upvotes": 3,
              "replies": {
                "e9cyhbr": {
                  "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cyhbr/",
                  "text": "First, I never introduced the city/countriside divide you are building your argument on. It seems utter bs if applied to any country that is not in the league of Uganda, Laos and Nepal. Yes, if we were in Eritrea or talking about Eritrea I would agree. We're not. But still, I'll play your game and follow you:\n\n\n> Take the path that best suits their family/business/lifestyle. It may have larger impacts that they are uninformed on or that only occur in large urban centres. It may be the option that is worse for the climate. It may lead to greater tax cuts for the wealthy. But it also saves them. \n\n\nIf it leads to greater tax cuts for the wealthy, how does it save them? I'm sorry, is the survival of people living outside Paris and Berlin at stake here? Did I miss some major cataclysm? They just make the choices they are TOLD to made by powerful actors such as major corporations and corrupted politicians who have enough money to take advantage of the people's vulnerability to sell them overpriced crap/be elected for a second mandate. Nobody is starving here man.\n\nPeople don't buy Iphone after Iphone cause they \"have to survive\". They do it because they're told do, because they have no means to defend themselves from the massive power of advertising, fashion and tv. They are USED by bad actors, milked for all they're worth and then thrown away. How can you fail to see that this is a major issue for them and for society at large? Do we really need another 1939 to realize that maybe, just maybe, there's a problem here?\n\n> I imagine you are not like them because you are a city kid.\n\nAd personam, and also wrong. I was born in a shithole village outside a major city, where i went about three times because everything was (and still is) crazy expensive there. Then thank god I moved elsewhere to attend BA, MA and then moved again for the PhD.\n\n> People don't have the luxury of being polymaths if they're living hand-to-mouth\n\nAgain, we're not in Laos. I'm talking about everyone here, including \"city people\", not about some random farmer living in a remote province.\n\nThe issues here are the same ones I already raised and that, IMO, you failed to address. For example, the fact that the symbolic is more important than the material. Discourses are more important than reality. Therefore, I'll lease a SUV even if I struggle paying my mortgage. This makes absolutely. No. Sense. But it's also very true. Who buys Gucci bags? Insecure low to average income people do. Because they are maneuvered to do so. Because they're told that they're worth just as much as the stuff they own. And they believe it, because they lack the critical tools to have a saying in this process.\n\nWhere will you find more racism? Where literacy is lower. Why? Because, as everybody including you knows very well, ignorant people is easily maneuvered by bad actors to serve as cannon fodder in their wars.\n\nAnd so on and on. All these phenomena DO NOT profit the marginalized in any way. Actually, they profit the famous 1%. People only have one way to defend themselves: education.\n\nIn the digital era they everyone (except again your Nigerian countryside but we are not discussing that now) has a choice. People have access to information. And I'm not talking about reading Strabo here. I'm talking about learning where Afghanistan is before voting from someone who wants to invade it. Many of them refuse to do it. Many of my college educated peers refuse to do it. This is NOT explained by starvation or whatever. Yes people who are starving, who don't have a roof over their head and so on are fully justified. And the others?\n\nThe fact that very intelligent people such as you and others fail to see that the very survival of our democracy is at stake due to mass ignorance really confuses me. How can you justify everyone so easily when people are dying every day due to the horrible choices people take cause they're too lazy to learn something new? And again, this INCLUDES educated, city people.",
                  "author": "Warahram",
                  "created": 1541773756,
                  "upvotes": -1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e9b33pp": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b33pp/",
      "text": "Most people don't want to debate a topic, they want to have a conversation. You're not going to change someone's mind by telling them they're wrong and spewing a bunch of  facts at them. I've heard so many anecdotes that I know are wrong, but I have no way to tell a person that they're wrong (I can't guess as to what green bug bit them and gave them a necrotic wound when they were 8, because most likely it wasn't a bug bite that gave them the wound, but I don't know what did). I listen, and hopefully give them something they can recall fairly accurately. You're going to have to do a lot of listening yourself, and it's frustrating to listen to inaccurate (at best) stories, but you're not going to gain that rapport and trust if you don't listen first.  Learn how to present a narrative that a layperson can connect with. Learn how to tell a story.  Working as an entomologist, I'm lucky, because people think it's super weird (which, they're probably not wrong) and they want to engage. I get asked about a lot of controversial topics (GE mosquitoes was an especially popular topic when the releases were making the news a couple years ago), and I can get really excited about them. It's really fun to listen to someone talk about something they're excited about. You're not going to immediately change anyone's mind. I think it's very rare for someone to walk away from a conversation with a completely opposite point of view. You want to plant easily accessible ideas and tidbits they'll be able to pull up when faced with false narratives.\n\nThat's why fake news and conspiracy theories are so easy to get caught up in. You may know it's all bull shit, but it's still fun (in a mostly infuriating way) to get sucked into the rabbit hole.\n\nAnd eventually you'll find out that some people just aren't worth taking the time.",
      "author": null,
      "created": 1541703005,
      "upvotes": 7,
      "replies": {
        "e9b66z1": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b66z1/",
          "text": "Unfortunately, I often discuss very divisive topics: what should we do with Iran, \"East/West\" differences (bs), terrorism, Islam and christendom, colonialism. It's all linked to my research, as my field is middle east & Asian studies (focus on Iran).\n\nDiscussing these topics, most people just don't want to deal with facts. It's terrible...",
          "author": "Warahram",
          "created": 1541705380,
          "upvotes": 1,
          "replies": {}
        },
        "e9bjf82": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bjf82/",
          "text": ">GE mosquitoes was an especially popular topic when the releases were making the news a couple years ago\n\nAny sources or articles you’d recommend? Something at the level of “not in STEM but can handle a few sciency concepts”?",
          "author": "SnittingNexttoBorpo",
          "created": 1541715908,
          "upvotes": 1,
          "replies": {
            "e9cxjaw": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cxjaw/",
              "text": "I'll have to do some digging. I was lucky in that it was a popular topic while I was in grad school, so we got into it in some of my classes (it wasn't my direct area of study, but a professor in our department did some related work). I'll PM you if I can find anything on my old computers.",
              "author": null,
              "created": 1541772910,
              "upvotes": 1,
              "replies": {
                "e9d0kmc": {
                  "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9d0kmc/",
                  "text": "Oh that’s all right! I’m interested but I don’t want you to go to that much trouble!",
                  "author": "SnittingNexttoBorpo",
                  "created": 1541775606,
                  "upvotes": 1,
                  "replies": {
                    "e9d3u0v": {
                      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9d3u0v/",
                      "text": "It is really interesting! It might be worth checking out something like Scientific American for some good articles. I know they've had entomologists contribute over the years, so they might be a good place to start.",
                      "author": null,
                      "created": 1541778391,
                      "upvotes": 2,
                      "replies": {
                        "e9d5g7e": {
                          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9d5g7e/",
                          "text": "Okay, I’ll try that!",
                          "author": "SnittingNexttoBorpo",
                          "created": 1541779713,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e9btq0a": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9btq0a/",
      "text": "Your are going about it the wrong way. You cannot use the central route of persuasion(logic and facts) you use with well-educated collegues on individuals uneducated on the subject. Instead, you must use the peripheral route of persuasion, using their emotions, etc. Not only is the world full of idiots, but humans naturally are emotional creatures over logical. Would be nice if we did not have to change our techniques for delivering a message, but we always need to take into regard the audience. If they cannot understand it, the message will be lost",
      "author": "LilExtravert",
      "created": 1541725188,
      "upvotes": 2,
      "replies": {
        "e9ch5gz": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9ch5gz/",
          "text": "Yes, what you say is surely true. This part in particular\n\n>humans naturally are emotional creatures over logical\n\ndrives me mad. It's true of everyone, including me. Yet, some of us realize this and strive to at least set boundaries to the degree of influence of emotions over logic we deem acceptable, e.g. \"I will listen to you even if you seem to disagree with me/are shorter than I/are lower in rank/speak poorly/etc\"\n\nThe fact that most people totally skip this basic self-training really bugs me.",
          "author": "Warahram",
          "created": 1541749498,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e9azzxr": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9azzxr/",
      "text": "[deleted]",
      "author": null,
      "created": 1541700639,
      "upvotes": 7,
      "replies": {
        "e9bkavr": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bkavr/",
          "text": "Yeah, being a religion scholar has its challenges. Religion is something most people have strong opinions about, but it's also a topic about which a lot of people are spectacularly ignorant, especially since most people don't have any formal education in religious studies, biblical studies, theology, etc., at any level.\n\nI teach theology to college freshman, and part of my job is to get students to critically reflect on the viability of various religious/non-religious views, including their own. There's a lot of potential for conflict here. What I've found to be most crucial is an idea captured in the Jesuit pedagogical principle of *cura personalis*, or care for the whole person. Your audience has to trust you *as a person*, and they have to be convinced that you're concerned with their best interest *as persons.* It's easy for an academic to go into discussions hoping to be a champion of *truth*, but the first priority really needs to be building personal connections that allow your audience to know that you're not there to attack their deep convictions or wield truth like a weapon, but that you're there to share with them in the joy of questioning and learning. That means doing a lot of listening and showing sincere interest in understanding people's ideas, however uninformed, or even downright bonkers, those ideas might be. Listening allows you to use the Socratic method more effectively, to gently nudge them towards contradictions or oversights in their thinking in ways that don't come across as an attack on their values.\n\nAlso, this goes along with a bigger point: the audience needs to feel like they're being invited into a conversation, not lectured at. So one thing I never rush into is saying \"This is the truth,\" even in the case of something that's clear scholarly consensus. It works much better to alert them to a major historical debate on that topic and show them how truth gets worked out through dialogue, in a way that takes seriously the concerns of both sides. That sometimes means being willing to play devil's advocate for ideas that know to be fundamentally wrong.\n\nWhen it comes down to it, I think the most important thing is to realize that people are probably less interested in soaking up knowledge from experts as they are in *being taken seriously* by experts. If you show that you take their beliefs and their values seriously even when you don't agree with them, they'll probably take you more seriously as well.",
          "author": "Pinkfish_411",
          "created": 1541716626,
          "upvotes": 4,
          "replies": {}
        },
        "e9b44wb": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b44wb/",
          "text": "Hi there! As I wrote in the edit, unfortunately I often discuss religion :P  \n\n\nMay I ask you what your research topic are, just out of curiosity?  \n\n\nAs to the two strategies: great advice. When I manage to hold my horses, I also use the active approach, and I have to say it works quite fine. I'll also try the socratic one in the future... Most of the times I just feel annoyed though, so I agree with my discussant and quit ASAP. I'd like to learn and fix this. I'm also annoyed because I am deeply convinced that they *can* learn, they *know* they are wrong, and yet they don't want to say *thanks, you're right, I actually learned something*. This at times makes me experience honest to god hate.\n\n&#x200B;\n\nOn the rest, I fully agree on everything. Thank you for the suggestions!  \n",
          "author": "Warahram",
          "created": 1541703791,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e9ayzl4": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9ayzl4/",
      "text": "I'm not sure if it's so much about how accessible things are.  Math research is pretty inaccessible, I would say way more than research on climate change.  But I don't get the impression that people tend to distrust mathematicians as much as they distrust climatologists.  But I think the results of climate change research are more likely to make people feel attacked and that they have to give up things they want.",
      "author": "cwkid",
      "created": 1541699874,
      "upvotes": 3,
      "replies": {
        "e9bf8sm": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bf8sm/",
          "text": "I definitely agree with that last point. Any person who is being told that their way of life is in many ways unethical will feel compelled to resist. People generally think of themselves as “good”, so being told that they are contributing to suffering just by “existing” (how they would see it) goes against their deeply held beliefs.",
          "author": "rawrpandasaur",
          "created": 1541712511,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e9azjvv": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9azjvv/",
      "text": "I struggle with this question too. I think the next time I get questions on my expertise, or the expertise of academics in general, I am going to ask/state the following:\n\nMost people want their kids to go to college so they can get better jobs right? If you agree with that, you need to accept that the professors at the college are experts in their fields and can help your kids learn something new. If that is true, why do you not trust that the professors are experts in <add speciality like climate science> and know more than most people?\n\nThis argument can be refuted in two ways. First, they do not want their kids to go to school. I have no answer for that. Second, they don't believe that the professors their kids are learning from are experts; to which I will ask 'why would you want your kids to go to college to learn from non-experts?'.\n\nI have never used this argument 'in the field', but that is how I imagine I would approach the issue.\n\n",
      "author": "ShadeDelThor",
      "created": 1541700292,
      "upvotes": 3,
      "replies": {}
    },
    "e9bq58s": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bq58s/",
      "text": "I am a doctoral student that works in a disinvested community, and when we started our work a few years ago, how to build trust was a big issue. \n\nAs academics, we researched how trust in communities was built. Turns out there's a fair amount of evidence already out there, and my favorite example comes from public health. \n\nResearchers asked which medical professions were most trusted, and changed the variables around each time they asked (e.g. gender, doctor vs nurse, local or out of town, etc). Their conclusion was that trust in the community requires three things:\n\n1. Be present in the community. Face to face interactions are best. \n\n2. Be knowledgeable, but also accessible (e.g. avoid the ivory towers of academia). \n\n3. Get shit done. Don't just publish or talk about things; actually take real steps and do real things that people can touch or experience. \n\nWhen you think about it, so much distrust stems from violating one or more of these 'rules'. Government distrust is a perfect example: it's impossible to trust an absent bureaucrat that doesn't know what they're talking about and nothing they do impacts your life in a tangible way. \n\nSo now ask yourself: with those rules in mind, how might your profession be better trusted?",
      "author": "drarch",
      "created": 1541721839,
      "upvotes": 3,
      "replies": {}
    },
    "e9bcas6": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bcas6/",
      "text": "Below is a handbook dedicated to answering your questions. One key point from it: the more that you answer the question with technical language and facts, the more your opponent digs in, and you fail. \n\nhttps://www.skepticalscience.com/Debunking-Handbook-now-freely-available-download.html",
      "author": "WaylonWillie",
      "created": 1541710184,
      "upvotes": 2,
      "replies": {
        "e9bctuv": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bctuv/",
          "text": "I'll make sure to check it. Thanks!\n\nYes, for some reason people seem to actively oppose specialism, competence and intelligence, even when they fund them with their own money from taxes. It's particulary this last aspect that intrigues me. Why people seem to sistematically oppose competence and knowledge in general?",
          "author": "Warahram",
          "created": 1541710604,
          "upvotes": 1,
          "replies": {
            "e9bfpf8": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bfpf8/",
              "text": "If someone is a liar, and encourages their followers to believe lies and be hostile to truth, then that person is much more powerful than someone who makes decisions based on evidence. Lies and falsehoods are more powerful than truth, because lies and falsehoods are only limited by the imagination. Attacking specialists is easy and is a classic move in the political playbook; those who make that move of course go to a doctor when they are ill, or go to a mechanic when their car breaks, but those are times when specialists serve their self-interest.",
              "author": "WaylonWillie",
              "created": 1541712880,
              "upvotes": 1,
              "replies": {}
            },
            "e9bg0lz": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bg0lz/",
              "text": "Because to non-scientists, they feel unwelcome participating in science. They think that only really smart people can do science (which is untrue) and can’t understand scientific literature because of how much jargon there is.\n\nAlso consider that science regularly disproves itself. And while that is the point of science, it can lead people to be skeptical of new findings. Especially if they don’t understand how science works on even a basic level.\n\nAlso consider that scientists flip flop on a lot of issues. Are eggs good for you or bad for you? How about chocolate? Scientists were opposed to the use of GMOs originally, but now generally support the use of GMOs since extensive research has been conducted.",
              "author": "rawrpandasaur",
              "created": 1541713130,
              "upvotes": 1,
              "replies": {
                "e9bgke2": {
                  "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bgke2/",
                  "text": "I'll mark your paragraphs as a, b and c to answer more easily.\n\nA) if they thought so, they would always agree with us and listen to us, wouldn't they ? I sure listen to my doctor. However, the general population seem to do exactly the contrary when it comes to science.\n\nB) Yes, science can be confusing and seem incoherent. This, I understand. Yet, they should just suppose that this is how things are supposed to be and accept it, or ask for more information. Again, I don't understand why people hate to admit ignorance while this is a trait shared by literally every human on the planet.\n\nC) As b.\n\nI have to say that, overall, I have issues with lack of rationality.",
                  "author": "Warahram",
                  "created": 1541713573,
                  "upvotes": 0,
                  "replies": {
                    "e9bj5ct": {
                      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bj5ct/",
                      "text": "> A) if they thought so, they would always agree with us and listen to us, wouldn't they ? \n\nI disagree with this. Non-scientists generally do think that scientists are really smart. Just look at stereotypical scientist in pop culture. Scientists are generally respected. However, just because scientists are respected doesn't mean that they are trusted. Negative perceptions of scientists stem from a lack of understanding, which in my opinion, stems from scientist's lack of science communication skills in addition to the examples that I used previously.\n\n&#x200B;\n\n> I sure listen to my doctor.  \n\nI like this example a lot and think that it could be a great point in a discussion with someone who is distrustful of science (unless they are also already distrustful of medicine, in which case the argument should be re-calibrated). Almost everyone goes to the doctor, so it is very relatable to a large audience. The key would be to present the argument in a way that doesn't belittle the person for their beliefs. Also, being receptive to discussion in the form of questions (even basic, uneducated ones) and counter-arguments.\n\n&#x200B;\n\n>Yet, they should just suppose that this is how things are supposed to be and accept it, or ask for more information. \n\nOf course someone who doesn't understand and is skeptical of science isn't going to just accept it.  No one wants to be told what to think, and trying to tell someone what to think just won't work. And many people who don't understand simply won't care to try to seek information. This is something that science communicators need to think a lot about. How can I make someone interested in something that they normally wouldn't be interested in? Programs like Bill Nye the Science Guy, Cosmos, and Big Bang Theory are very good at exposing lay audiences to scientific concepts in a medium that they are interested in. Things like science festivals, citizen science projects, and science museums are also great tools for overcoming non-scientist's perceived barriers to scientific understanding.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
                      "author": "rawrpandasaur",
                      "created": 1541715686,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "e9bid48": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bid48/",
          "text": "> Below is a handbook\n\nGreat handbook, I just checked it. I'll read it asap, and also read the bibliography. I see it also quotes Oreskes. I loved her book (even though I'm a medievist & knew nothing about climate change!)",
          "author": "Warahram",
          "created": 1541715026,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e9be9ua": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9be9ua/",
      "text": "I think it boils down to learning how to be a better science communicator.\n\nThe deficit model (bombarding people with scientific facts to try to prove your point) has been proven not to work. Effective science communication is not a one-way street. You need to be open to and encourage dialogue from your audience. If you don’t, how can you hope to understand how their implicit biases are affecting their viewpoints?\n\nIt also helps to put your science into context. How does it help them and how is it relevant to their lives? In order to know the answer to this question, you need to pinpoint who exactly your audience is and adjust your tactic from there.\n\nDon’t alienate your audience by using a lot of jargon or speaking as if it’s a scientists v.s. non-scientists argument. Translate your science into terms that anyone can understand. Use anecdotes and real-life examples to help humanize science.",
      "author": "rawrpandasaur",
      "created": 1541711742,
      "upvotes": 2,
      "replies": {}
    },
    "e9bk3yx": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bk3yx/",
      "text": "Well, I'll start with we don't make people do anything. We encourage and approach non-researchers in a way that makes them feel included and comfortable in the conversation rather than immediately asserting ourselves as experts who know better. \n\nMany groups are inherently way of social scientists, and in my last few years of working with the military and veterans, I can tell you that there's a visible cringe when I meet a new contact and tell them I'm a researcher. Their experience with us in my field has largely been that we want to \"fix,\" them, use them for our research ends, and then cut and run. \n\nOne method I've found profoundly helpful for all parties is to thoroughly explain, as best I can, the full process and expected results, allow opportunity for comment and discussion (integrating that into the study), and then set a date to come back to said group and present what we've found for comment, in person if in any way feasible while asking for ways to improve the next round. It makes people feel like they're not lab rats; they're human beings engaging with folks who have theoretical knowledge that can be melded with personal experience to create something better, and impactful, in the long term. ",
      "author": "insanityensues",
      "created": 1541716468,
      "upvotes": 2,
      "replies": {
        "e9bky0o": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bky0o/",
          "text": "Thanks for your contribution. I don't work with people though, I just have a genuine problem understanding the thought process of someone listening to a doctor, wanting a house built by an architect, and then not listening to an historian or dismissing climatologists.\n\nIs it because people hate to question their beliefs? If so, why do people hate that?",
          "author": "Warahram",
          "created": 1541717156,
          "upvotes": 2,
          "replies": {
            "e9brhhv": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9brhhv/",
              "text": "Fair enough. \n\nAnd yes, people do hate for others to question their beliefs. We have a tendency to only seek out information that confirms our beliefs, while actively ignoring information that dispels them. It's called belief perseverance, and coincides with confidence bias in the cognitive component. \n\nThere are numerous reasons for it, but a lot of the reason is that we get trained from an early age that it's best to be \"right\" over everything else. Being wrong is a cardinal sin, so even if we are, we tend to grip onto that belief with vivid single cases and sources that confirm it. ",
              "author": "insanityensues",
              "created": 1541723111,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "e9cctrr": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cctrr/",
      "text": "Maybe stop being part of a reptilian sex cult you Zionist pedophiles. \n\nEdit: sorry, thought this was a different sub",
      "author": "Solo_Dev",
      "created": 1541743186,
      "upvotes": 2,
      "replies": {
        "e9cjrdz": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cjrdz/",
          "text": "Mmh pedo reptilian orgies... I wish they were a thing.\n\nNow I'll go and rub me over the paper I'm finishing :/",
          "author": "Warahram",
          "created": 1541754121,
          "upvotes": 1,
          "replies": {
            "e9cjs7s": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cjs7s/",
              "text": "They’re happening right now",
              "author": "Solo_Dev",
              "created": 1541754160,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "e9cj56j": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cj56j/",
      "text": "I'll note three issues:\n\n1. Academics tend to have extraordinarily narrow bodies of knowledge and experience. While not all academics spend their entire lives in academia, a large percentage do - and this tends to rob them of the context necessary for applying their core expertise to complex problems.\n\n2. Academics frequently fall prey to the problem of speaking outside of their expertise. Consider your own expertise on China. Now, if we're having a debate about who ruled China in 1600, you're undoubtably speaking from your expertise. However, if we're speaking about modern day Chinese foreign policy, your background in Chinese history is probably less useful than someone else's background in the economics of petroleum.\n\n3. Academics have a tendency to 'speak from expertise' rather than debate an opinion. Standing up in front of eager young minds 5 days/week can give the impression that you are the wise sage and the rest of the world is intended to listen. However, this simply isn't the case. Possessing a narrow expertise in a subject doesn't automatically make you wise or enlightened on every subject.\n\nOr, in the condensed version, you need to understand humility and your own limitations. You're not going to get anywhere by telling people \"you're wrong, because...\".\n\nA good way to think about this is to recognize that education really occurs when the student is talking, not the teacher. Letting the student draw the connections and then demonstrating where those connections fall apart tends to work better than just trying to force them to draw the same connections you do.",
      "author": "ViskerRatio",
      "created": 1541753048,
      "upvotes": 2,
      "replies": {
        "e9cjnqp": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cjnqp/",
          "text": "I'll answer point to point.\n\n1) Yes, this may be true. In humanities, less so, though: we are (or should be) trained to think critically before everything else. This means that even though we are hyperspecialized, at the same time we can apply our critical tools to everything, including stuff we know zero about. \"We know how to know\", if you will. A researcher without critical tools is just a walking dictionary to me. Useless.\n\n2) Yes, true. I'd say my background and his complement themselves: you can't really understand the present without understanding the past. A the same time, I sure know more than say my mother, who stopped learning at high-school. Yet, if something concerning China comes up, she debates me as if we were peers. This puzzles me and confuses me. As to the causes of this apparently irrational and surely conter-intuitive behaviour, I have read a lot, but I'd like to learn much more, which is why I made this post.\n\n3) Absolutely true. However, what I said concerning critical tools still applies. I know nothing about say... Contemporary American politics. But I'm reasonably sure 9/11 was not an inside job, because I apply Occam's razor and come out with many more reasonable explanations for this event. Again, as to why someone who thinks Occam is a barber has the same right I do to voice his opinions about 9/11 being an inside job, as well as to why this should be a good thing we should incentivate, I am very puzzled.\n\nEducating to me means teaching a student how to talk, not letting him talk from the beginning. If your students are already capable of talking, then what are we doing? Shouldn't we resign our posts and do something else? We don't put ideas in their minds. We give them the tools to shape their own ideas. But shaping ideas which are really yours is a long, painful process. Rome wasn't built in a day, and it was built by architects as well as masons, not by masons only.",
          "author": "Warahram",
          "created": 1541753952,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e9b34cv": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b34cv/",
      "text": "I think it is basically about values. People have different values, and people tend to distrust others whose value is very different. Being in academia means that we care about things, like statistical rigor, that lay people will find arcane, and thus, distrust.\n\nInstead, you have to figure out what they do care about, the values, and then appeal to those. For example, if you want American Republican to care more about climate change, you could say\n\n> In the 1950s, brave American scientists shunned by the climate establishment of the day discovered that the Earth was warming as a result of greenhouse gas emissions, leading to potentially devastating natural disasters that could destroy American agriculture and flood American cities. As a result, the country mobilized against the threat. Strong government action by the Bush administration outlawed the worst of these gases, and brilliant entrepreneurs were able to discover and manufacture new cleaner energy sources. As a result of these brave decisions, our emissions stabilized and are currently declining.\n\n> Unfortunately, even as we do our part, the authoritarian governments of Russia and China continue to industralize and militarize rapidly as part of their bid to challenge American supremacy. As a result, Communist China is now by far the world’s largest greenhouse gas producer, with the Russians close behind. Many analysts believe Putin secretly welcomes global warming as a way to gain access to frozen Siberian resources and weaken the more temperate United States at the same time. These countries blow off huge disgusting globs of toxic gas, which effortlessly cross American borders and disrupt the climate of the United States. Although we have asked them to stop several times, they refuse, perhaps egged on by major oil producers like Iran and Venezuela who have the most to gain by keeping the world dependent on the fossil fuels they produce and sell to prop up their dictatorships.\n\n> A giant poster of Mao looks approvingly at all the CO2 being produced…for Communism.\n\n> We need to take immediate action. While we cannot rule out the threat of military force, we should start by using our diplomatic muscle to push for firm action at top-level summits like the Kyoto Protocol. Second, we should fight back against the liberals who are trying to hold up this important work, from big government bureaucrats trying to regulate clean energy to celebrities accusing people who believe in global warming of being ‘racist’. Third, we need to continue working with American industries to set an example for the world by decreasing our own emissions in order to protect ourselves and our allies. Finally, we need to punish people and institutions who, instead of cleaning up their own carbon, try to parasitize off the rest of us and expect the federal government to do it for them.\n\n> Please join our brave men and women in uniform in pushing for an end to climate change now.\n\ntaken from http://slatestarcodex.com/2014/10/16/five-case-studies-on-politicization/",
      "author": "BeatriceBernardo",
      "created": 1541703019,
      "upvotes": 2,
      "replies": {
        "e9bjjtb": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bjjtb/",
          "text": "You’re joking, right?",
          "author": "SnittingNexttoBorpo",
          "created": 1541716013,
          "upvotes": 2,
          "replies": {
            "e9c82n0": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9c82n0/",
              "text": "Did I say something wrong?",
              "author": "BeatriceBernardo",
              "created": 1541737795,
              "upvotes": 1,
              "replies": {
                "e9c9ld0": {
                  "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9c9ld0/",
                  "text": "I’m asking whether that quotation is something you would seriously use on another person, or if it’s just a joke, since it’s so over-the-top condescending and bigoted. Your comment could be read either way. ",
                  "author": "SnittingNexttoBorpo",
                  "created": 1541739406,
                  "upvotes": 2,
                  "replies": {
                    "e9cbvas": {
                      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cbvas/",
                      "text": "Well, I wasn't joking, and I'm not American, so it doesn't come off as bigoted to me. I linked to the source, and it seems to me that it is not intended to be sounding bigoted either.\n\nWhy could it have come off as bigoted? Can you please bridge the cultural gap for me?",
                      "author": "BeatriceBernardo",
                      "created": 1541742003,
                      "upvotes": 1,
                      "replies": {
                        "e9cq667": {
                          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9cq667/",
                          "text": "I'm American and it doesn't read as bigoted to me at all. It's basically just saying: reframe the issue of global warming as a nationalist, economic issue, rather than the \"save the planet\" hippie-esque theme it sometimes is portrayed as having. ",
                          "author": "kiefer-reddit",
                          "created": 1541764751,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e9b1e03": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b1e03/",
      "text": "Explain the basic issues in basic terms, emphasize the repeatability and the sheer volume of the data collected by the scientists.\n\nMy father worked in a domain similar to yours and he never shied away from explaining everything on a very basic level then moving to progressively more complex questions.\n\nYou can read Richard Feynmann's lectures for inspiration or watch the seeker and sci channels.",
      "author": "TheYearOfThe_Rat",
      "created": 1541701698,
      "upvotes": 1,
      "replies": {}
    },
    "e9bzpye": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bzpye/",
      "text": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/u_theanoeticist] [How do we make people outside academia trust us?](https://www.reddit.com/r/u_theanoeticist/comments/9vgijz/how_do_we_make_people_outside_academia_trust_us/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
      "author": "TotesMessenger",
      "created": 1541730438,
      "upvotes": 1,
      "replies": {}
    },
    "e9f0wny": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9f0wny/",
      "text": "Reading your various responses here, I do notice something. Below is how your posts come across to me, I'm not saying that the interpretation below is what you intend to say. I want to explain how your posts come across and possibly, how you can improve them.\n\n> Discussing these topics, most people just don't want to deal with facts. It's terrible...\n\nIt doesn't seem like you want to discuss topics. A discussion is typically a two-way street, communication goes both ways. This seems to indicate you want to tell people your opinion and you will not tolerate any other interpretation. \n\nIf you are talking to someone about Iran, \"East/West\" differences (bs), terrorism, Islam and christendom, colonialism, say that you're the expert because you research them and indicate that the other person can't give you any new information/ideas/interpretation, you're not really having a discussion. That would be a lecture.\n\n> In the digital era they everyone (except again your Nigerian countryside but we are not discussing that now) has a choice. \n\nYou're not having a discussion. You're lecturing the other person, telling them why they are wrong. When you basically say \"I can't believe/understand how you can even think such a stupid idea is true\", you're shutting the conversation down. You're trying (in a poor way) to say that you're the expert with all the answers, other people simply need to listen.\n\nIn some situations, you may be the expert. Shutting people down isn't a good way to have people listen to you. This is due to emotions. Like it or not, understand it or not, emotions are important. \n\n> I love debating and discussing, but I also trust specialists to have the last word on their subjects. Yet, people seem to think they are always as qualified as you, as if the discussion is always among peers. \n\nThis comes across as really arrogant, regardless of the truth of the statement. \n\nPresenting in front of peers is completely different from presenting in front of a regular audience. \nDiscussing is different from lecturing. If you've ever seen TED or TEDx talks, you can find many good techniques to have people listen to you. One that is related to making people listen to you is \"How to speak so that people want to listen | Julian Treasure\". But just listening to different talks from experts from different fields can also give an idea how to present information in a way that people will listen to you\n\n\n\n\n",
      "author": "TheAxeC",
      "created": 1541855151,
      "upvotes": 1,
      "replies": {}
    },
    "e9ba0lg": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9ba0lg/",
      "text": "Anti-intellectualism and right-wing criticism of higher education (and expertise in general) have made this much harder than it was a generation ago. I do quite a bit of outreach, mostly speaking to adult audiences, and sometimes these self-appointed \"experts\" who get their news from Fox and their education from YouTube will show up and try to challenge you in public. I don't even try to engage them any more. Years ago I might have asked for sources, countered their falsehoods, corrected their errors, etc. but it's really not worth my time. Now I just say \"This is what the peer-reviewed literature says, here is the data, I'm not here to debate today\" and move on. Most others in the audiences tend to want them to shut up anyway.\n\nTo the larger issue, how do we build trust? I think it's really a matter of writing/speaking for lay audiences more often, vs speaking only to our own narrow professional peer groups. We need more academics to write for popular readers-- books, articles, blogs, interviews, whatever --and to put their work in terms that people without graduate degrees can understand. If we inform/educate more people they will be less vulnerable to misinformation and less tolerant of the whackadoodles who heard something about \\_\\_\\_\\_\\_ on Alex Jones and come out spoiling for a fight with some effete liberal academic they've imagined.\n\nBe confident, be clear, be honest about what you/we don't know, but don't let them push you around either. I have simply disengaged from some of these people in social settings, often with a \"it's really not worth my time to engage you on this because you are so poorly informed it would take hours to correct the errors in information, analysis, and conclusions you've been fed by biased or uninformed sources.\"",
      "author": "SnowblindAlbino",
      "created": 1541708384,
      "upvotes": 1,
      "replies": {}
    },
    "e9b0727": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b0727/",
      "text": "If you just look at the general populace where 50% believe the \"Mainstream Media is the enemy of the people\" I think you have to realize you can't fix stupid.",
      "author": "AaronKClark",
      "created": 1541700789,
      "upvotes": 0,
      "replies": {
        "e9bjwkb": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bjwkb/",
          "text": "If you think that poorly of half the population, you shouldn’t be surprised they don’t trust people like you. Disagreement, differing values, and even ignorance aren’t the same as stupidity. ",
          "author": "SnittingNexttoBorpo",
          "created": 1541716301,
          "upvotes": 3,
          "replies": {
            "e9bqi7b": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9bqi7b/",
              "text": "Actually, as I said above, I'm not even sure that stupidity as we commonly describe it actually exists. I was merely agreeing on the \"you can't fix stupid\" part.\n\nOn the other hand, I am astonished at how frequently people fail in assessing where their best interests lie and how to reach them. In other words, as much as we don't want to admit it and say it out loud, people often seem to act irrationally and even work against themselves for some reason. Why, I don't know.",
              "author": "Warahram",
              "created": 1541722182,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "e9b49xe": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b49xe/",
          "text": "> you can't fix stupid \n\nYeah I often think like this. On the other hand, I'd like to have conclusive proof of the fact that someone is stupid and someone is not. Is intelligence already there when you're born, or we are all the same, culture aside?",
          "author": "Warahram",
          "created": 1541703899,
          "upvotes": 2,
          "replies": {
            "e9b4uws": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b4uws/",
              "text": "So I think there are two different factors: Your capacity to learn, and your ability to take in and accept facts that contradict your existing worldview. I believe that studies have shown that the latter decreases with age and I believe education. ",
              "author": "AaronKClark",
              "created": 1541704346,
              "upvotes": 2,
              "replies": {
                "e9b5ye2": {
                  "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b5ye2/",
                  "text": "I also heard something about taking in facts and changing worldview has a link with education and age. I'd like to read studies on this. I'll ask some friends.",
                  "author": "Warahram",
                  "created": 1541705191,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e9axqib": {
      "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9axqib/",
      "text": "[removed]",
      "author": null,
      "created": 1541698938,
      "upvotes": -3,
      "replies": {
        "e9ayfpg": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9ayfpg/",
          "text": "the fuck does OP's post have to do with socialism? ",
          "author": "thegreenaquarium",
          "created": 1541699466,
          "upvotes": 3,
          "replies": {
            "e9b0txb": {
              "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b0txb/",
              "text": "Every proposed solution coming out of academia for addressing climate change is socialist and involves massive wealth redistribution. ",
              "author": null,
              "created": 1541701276,
              "upvotes": -3,
              "replies": {
                "e9b3bjo": {
                  "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9b3bjo/",
                  "text": "Not sure why the post was removed but it made a good point - learn how others think and try not to take such an adversarial approach that assumes your interlocutor is a cro-magnon. ",
                  "author": "Beau_Geste",
                  "created": 1541703171,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "e9aya8f": {
          "link": "/r/AskAcademia/comments/9vbyhz/how_do_we_make_people_outside_academia_trust_us/e9aya8f/",
          "text": "\\*cough\\*Nordic Model\\*cough\\*",
          "author": "peregrin5",
          "created": 1541699350,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}