{
  "sid": "pd6ikp",
  "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/",
  "title:": "Is it worth it to try and become a psychology professor?",
  "text": "I’m in high school, I love psychology and would love to become a professor. However, I’m worried that it’s not really realistic to try and become one. For psych, do you need to get a PhD to become a professor? I’m worried about spending a ton of time and money to get it, and then not being able to find a professor job afterwards.",
  "author": "GoldLion53",
  "created": 1630141603,
  "updated": 1634079467,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.67,
  "comments": {
    "hanwj2z": {
      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/hanwj2z/",
      "text": "Yes, you do need a PhD to become a professor. Is it worth it? In my opinion, this is up to you and what you wish to strive for. To start, I'll share a finding from a report published in the UK 11 years ago to give you a feel of the challenge. \n\nIn this report by the Royal Society in UK (titled \"The Scientific Century: securing our future prosperity\"), figure 1.6 illustrates that only 0.45% of scientifically-trained students following a PhD ends up making the grade as professor.\n\nYou may wish to follow-up for a more recent update to the psychology field.",
      "author": "HearingAdventurous53",
      "created": 1630142691,
      "upvotes": 21,
      "replies": {
        "hao0v1u": {
          "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/hao0v1u/",
          "text": "That's a really small percentage. I am shocked. I will see the report. But what else do other PhDs become then?",
          "author": "ioup568",
          "created": 1630146467,
          "upvotes": 5,
          "replies": {
            "hao4bm0": {
              "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/hao4bm0/",
              "text": "In the UK context, right after a PhD, more than half left to non-academic careers (not specified). Subsequent departures include remaining in research but in non-university environment.",
              "author": "HearingAdventurous53",
              "created": 1630149129,
              "upvotes": 14,
              "replies": {
                "hao8g11": {
                  "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/hao8g11/",
                  "text": "That's interesting. I might like to be in research but in non-university environment.",
                  "author": "ioup568",
                  "created": 1630152001,
                  "upvotes": 7,
                  "replies": {
                    "haoqyj0": {
                      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/haoqyj0/",
                      "text": "Yeah I think that many forget the diverse variety of opportunities that exist in the world today. Not everything is a definite, linear path, and I think that makes it more fun. But I am just a hopeful (physics) undergrad.",
                      "author": "le-toss",
                      "created": 1630161758,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "haokboy": {
      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/haokboy/",
      "text": "You don't need to decide this in high school. Go to college, take a few psych classes, get involved in a research lab. Learn skills that are broadly useful even if they aren't required for your psych major (coding, stats). Explore other fields and career paths. Think through lots of potential what if's. If you're still jazzed up and interested junior year of college, think about grad school and do the same thing (spend a few years doing lots of good research & gaining broad skills) *then* decide if you want to continue on to try to be a professor. \n\nAlso worth mentioning: you don't pay for a PhD. You'll make a small stipend (25-35k) and your tuition will be covered. It is 5 years of lost earning potential in your career though.",
      "author": "mediocre-spice",
      "created": 1630158676,
      "upvotes": 15,
      "replies": {}
    },
    "hanzudh": {
      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/hanzudh/",
      "text": "Hey, I'm a fourth year PhD candidate in Educational Psych. \n\nI wouldn't worry too much about realistic at this stage. A better starting point is to think about your interests and values, try to continue developing your understanding of what being a Psych prof entails, and then see how closely those two match. It's totally understandable that your interests and self-awareness will continue to develop, but I've been pleasantly surprised how well my attitude testing results from when I was 15 still hold true a decade later.\n\nRegarding \"realistic\", first, I'd recommend having 3-4 options, with backup plans in place. That way, even if getting a PhD doesn't work out you have other alternatives available.",
      "author": "Estus_Is_Life",
      "created": 1630145624,
      "upvotes": 23,
      "replies": {}
    },
    "hao7d8g": {
      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/hao7d8g/",
      "text": "With a PhD in psychology, it is more likely that you will not become a professor. That said, if you are interested in other things (private practice and therapy; data science; ux; stats), those jobs are also possible with a PhD.\n\nFor me, my goal was to become a professor, but I was also prepared to apply to industry jobs just in case.",
      "author": "GrimsnowII",
      "created": 1630151281,
      "upvotes": 12,
      "replies": {}
    },
    "haotvl0": {
      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/haotvl0/",
      "text": "Start with getting your bachelors in Psych and go from there. You’ll learn a lot about yourself and your ambitions in those undergrad years. If you still desire to become a psych prof, it’s probably worth it. No need to sink a lot of thought into it right now.\n\nAll the best!",
      "author": "stargrove88",
      "created": 1630163057,
      "upvotes": 3,
      "replies": {}
    },
    "hanvq7v": {
      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/hanvq7v/",
      "text": "Yes you do",
      "author": "b1c2n3",
      "created": 1630141973,
      "upvotes": 1,
      "replies": {}
    },
    "haoikyy": {
      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/haoikyy/",
      "text": "Sure, go for it.. You need a PhD, but don't let that bother you...live life one step at a time, and learn from the process. Major in psych as an undergrad. If you're happy and doing well, then you're on track...if not, that's life telling to adjust. Always have a goal, but always be willing to shift to a new goal when it seems to be in your best interest.",
      "author": "albertkaholic",
      "created": 1630157793,
      "upvotes": 1,
      "replies": {}
    },
    "haox0ws": {
      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/haox0ws/",
      "text": "First things first, you'll need a psychology undergraduate degree - so look at what the entry requirements for that are at universities and make sure you're picking the right subjects at highschool (not sure how this works in other countries, I'm in the UK).\n\nAlso be aware that psychology students DO need to know some basic maths and statistics (my degrees are in maths, and I was a maths tutor for other students at my uni; many of them were psych students who were struggling with their first real encounter with statistics - it was often their algebra skills letting them down, though). So don't skimp on maths!",
      "author": "sqwerewolf",
      "created": 1630164454,
      "upvotes": 1,
      "replies": {}
    },
    "hap95k7": {
      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/hap95k7/",
      "text": "Follow your dream, and have a plan B.",
      "author": "BAROCLINITY",
      "created": 1630169774,
      "upvotes": 1,
      "replies": {}
    },
    "hdwfnud": {
      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/hdwfnud/",
      "text": "Please note, you need to have a PhD to become a professor at a University.  If you want to teach at a community college, you only need a MS degree.  I have two MS degrees (including one in Psychology) and I have had offers with those degrees alone.",
      "author": "coursejunkie",
      "created": 1632353639,
      "upvotes": 1,
      "replies": {}
    },
    "hapuixl": {
      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/hapuixl/",
      "text": "Sadly, judging by the statistics we have, it's rather safe to say you won't make it. So, if becoming a professor is your only reason to do a PhD in psychology I'd say don't.",
      "author": "phenomenologist83",
      "created": 1630178899,
      "upvotes": 0,
      "replies": {}
    },
    "haq36z1": {
      "link": "/r/AskAcademia/comments/pd6ikp/is_it_worth_it_to_try_and_become_a_psychology/haq36z1/",
      "text": "Practicing psychology and being a Professor are two wholly distinct endeavors.\nEither require a PhD (or Psy.D in US) and the pursuit of that endeavor alone can suck your soul and pocket dry.\nSo ask yourself first why?\nWhat are the things that draw you about Psychology, practicing Psychology and Teaching.\nIf I had better understood how in the US Social Workers who obtain a Masters in Clinical work and are then Licensed practice Therapy...that is what I would have done instead of my Masters in Education. I still work in Mental Health but since I am not Licensed I practice under the supervision of an LCSW.",
      "author": "WmBBPR",
      "created": 1630182819,
      "upvotes": 0,
      "replies": {}
    }
  }
}