{
  "sid": "p66i1e",
  "link": "/r/AskAcademia/comments/p66i1e/might_not_get_a_lor_from_my_only_research/",
  "title:": "Might not get a LOR from my only research experience. Now what?",
  "text": " Hi, so for the past 3 months I was a part of a virtual research program under a prof from Canada. I have been working consistently for the past 3 months, and had good progress. However, the main deliverable that he expected from me was a final report summarizing all of my study. However, the week the report was due clashed with the reopening of my uni classes and a job interview. It's been a little over 2 weeks now and I still haven't been able to complete the report. My mental health has also been poor lately but I am trying my best. Today I received a reminder email from him and I feel so depressed like I let him down. Is this going to impact my recommendation, if he gives any at all since the project was virtual? This is the only research experience on my CV and not having a LOR from him is going to be a huge red flag IMO.",
  "author": "Fine_Economist_5321",
  "created": 1629215347,
  "updated": 1634079577,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.57,
  "comments": {
    "h9b9wg6": {
      "link": "/r/AskAcademia/comments/p66i1e/might_not_get_a_lor_from_my_only_research/h9b9wg6/",
      "text": "You are catastrophizing. There is no issue yet, you have only received a reminder email. Don't default to the worst-case scenario whenever you hit a bump in the road, people are generally understanding of small delays.",
      "author": "1vh1",
      "created": 1629221342,
      "upvotes": 13,
      "replies": {
        "h9bgx4s": {
          "link": "/r/AskAcademia/comments/p66i1e/might_not_get_a_lor_from_my_only_research/h9bgx4s/",
          "text": "Hard agree, plus often they're just checking in and asking how it's going. Asking if you're still planning to submit is not code for you're a total failure, you've let me down, you've let your cat down and most of all you've let yourself down, you big sad loser.",
          "author": "ACatGod",
          "created": 1629225461,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h9b12li": {
      "link": "/r/AskAcademia/comments/p66i1e/might_not_get_a_lor_from_my_only_research/h9b12li/",
      "text": "I'm sorry that it's been a difficult time. I hope that you get the support you need with your mental health.\n\nAs a lesson for the future: everyone experiences challenges that may affect their work at one point or another. (For example, mental health challenges, academics, family concerns, etc.) That's life. When you know you will not be able to complete something on time in the future, you can communicate that to whomever you are working for. (E.g., \"I have more on my plate than I anticipated this week. Would it be possible to have a few extra days to complete the report?\")\n\nAs for right now, respond to your supervisor today. Apologize for the delay in the report. I think it's OK to note that this has been a rough couple of weeks for you (without elaborating too much) and that you regret the poor communication. Such a statement can both help to explain where you're coming from and demonstrate self-awareness, i.e., that you know that your communication and timeliness has been less than ideal.\n\nI can't say whether or not this professor will write you a letter of recommendation. I can say that, personally, I would write any research student of mine a letter of recommendation unless I had serious concerns. (If they flat out didn't write the report that was the cornerstone of their research practicum, I would probably decline to write an LOR; if the report was late, I'd still write the letter.) Letters of recommendation are on a continuum, ranging from lukewarm to extremely strong. Being behind schedule and not communicating can affect the strength of the letter of recommendation you receive, but if you write a good report, resume communications, and convey a sense of humility and learning from your mistakes, hopefully your professor will still be willing to write you an LOR.",
      "author": "jogam",
      "created": 1629216934,
      "upvotes": 12,
      "replies": {
        "h9b34ou": {
          "link": "/r/AskAcademia/comments/p66i1e/might_not_get_a_lor_from_my_only_research/h9b34ou/",
          "text": "Thank you very much for your answer. It makes a lot of sense. I have already apologised to him. I had also emailed him before the interview saying that the report will be late by a week but I overstepped that limit. I hope that he will understand.",
          "author": "Fine_Economist_5321",
          "created": 1629217744,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h9b1ez5": {
      "link": "/r/AskAcademia/comments/p66i1e/might_not_get_a_lor_from_my_only_research/h9b1ez5/",
      "text": "Next time, don't try to finish the report in a single week.",
      "author": "IamRick_Deckard",
      "created": 1629217070,
      "upvotes": 1,
      "replies": {
        "h9b3jw0": {
          "link": "/r/AskAcademia/comments/p66i1e/might_not_get_a_lor_from_my_only_research/h9b3jw0/",
          "text": "Yes ofcourse. This is my first time working on a real research project and I mismanaged a few things. It's not like I wasn't working, I just kept the report for the last. It took longer than I expected to arrange and write it out in a presentable way.",
          "author": "Fine_Economist_5321",
          "created": 1629217910,
          "upvotes": 3,
          "replies": {
            "h9bgcii": {
              "link": "/r/AskAcademia/comments/p66i1e/might_not_get_a_lor_from_my_only_research/h9bgcii/",
              "text": "I think you're probably making this out to be a much bigger deal than it is. Yes you do need to finish the report but in the massive list of things your professor needs to get done this month your report is going to be fairly low down their list.\n\nI think the important thing now is to be professional about it. That means being proactive in communicating what is going on and also not apologising repeatedly. It's very difficult when you're dealing with someone who has made a mistake when they keep repeatedly apologising, because it doesn't help resolve the issue, it gives no indication of what the person is going to do to solve it and they're actually pushing it back on the person raising the issue to comfort them and reassure them. Taking ownership of the project and your behaviour is really important and you should try to match your PI's tone and energy level. If they're emailing to ask when you think you might be done, just respond with when you think it will be done. If they say they're frustrated or concerned, acknowledge their frustration/concern and tell them what you're going to do to fix it. Don't grovel. It's really tiring to deal with.",
              "author": "ACatGod",
              "created": 1629225216,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h9b0zal": {
      "link": "/r/AskAcademia/comments/p66i1e/might_not_get_a_lor_from_my_only_research/h9b0zal/",
      "text": "Could just finish the report?",
      "author": "rustyfinna",
      "created": 1629216899,
      "upvotes": 0,
      "replies": {
        "h9b2t2y": {
          "link": "/r/AskAcademia/comments/p66i1e/might_not_get_a_lor_from_my_only_research/h9b2t2y/",
          "text": "I am writing it as we speak. I just feel bad over the delay.",
          "author": "Fine_Economist_5321",
          "created": 1629217616,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}