{
  "sid": "gmc5uo",
  "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/",
  "title:": "I constantly have panic attack whenever I sit in my desk trying to get my PhD work and end up doing nothing for a month now. I cry every day and sleep it off as a coping mechanism. This pandemic has been affecting my mental health terribly. 😔",
  "text": "I am quarantining alone. I've always lived alone and it hasn't been much of a bother but it's been too long without any human contact since the lockdown. I do keep in contact with my family and friends but they started not picking up my calls. A friend of mine told me that she admitted that I've been draining her energy so I assume everyone is feeling the same way. I wanted to fly home and the university allows it, but my sponsor advised all sponsees to stay put or risk the fund being canceled. I have no choice but to continue isolating alone. However, it is beginning to take a serious toll on my mental health.\n\nI rarely go out except for grocery-shopping. Although the government allows one exercise a day, I haven't done so due to my paranoia of catching the virus. I have already fallen ill with COVID symptoms last month, which I learned later they could either be triggered by my anxiety, or I was just having seasonal flu. However, I lost two weeks of productivity as I spent two weeks just lying in bed. After recovering, I managed to get some re-draft work done but I submitted it two weeks after the deadline. I did speak to my supervisors about how this pandemic has affected my mental health and they have been understanding.\n\nI tried to stay sane by doing activities such as cooking, baking, Tik Tok or watch Netflix. I woke up every day for two weeks feeling excited to try out new recipes, learn new Tik Tok dance or watch new Kdramas but they never got me motivated to do my work. Then I realised that I was just simply trying to distract myself without actually resolving my mental issue. I was being in denial the whole time. I feel lonely and it suffocates me when I have no one to talk to and when I do, I won't be able to pour out my feelings fearing I'd be a burden and annoy them so I choose to bottle up. In turn, I started talking to the walls and furniture.\n\nWith my mental health declining, I continue on being unproductive. I have a panic attack every time I sit at my desk trying to get started on my work. I try to sleep it off with hope to feel better when I wake up but it makes me feel even worse. It triggers my anxiety when the sun rises and I’m gonna start panicking again so I keep the blinds closed all day. I have barely done anything for almost a month now. I was supposed to submit my redraft last week and have a supervision meeting this week but I asked my supervisors for another week when I know I still won’t be able to do anything. I think they are getting tired of my excuses.\n\nI took the time to respond to any emails and disabled the notifications as it makes me burst into tears from an episode of anxiety attack every time I get a work email. I dread video conferences with my supervisors. I feel like I no longer have the quality of being a Ph.D. student especially when my standard of work has been mediocre. I feel worthless and useless. I'm close to simply ending this vicious cycle but before I do so, I thought of sharing my issues with like-minded people to see if I could turn things around. My mental is really in a bad shape now and I’m seriously considering quitting Ph.D., pack my things and fly home. 😢",
  "author": "ConstantAide",
  "created": 1589842064,
  "updated": 1634080066,
  "over_18": false,
  "upvotes": 578,
  "upvote_ratio": 0.96,
  "comments": {
    "fr2xq4u": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr2xq4u/",
      "text": "I'm really sorry you are having such a rough time.  I have a few recommendations for you: \n\n1) Take it easy on yourself.  This is an unprecedented and very stressful situation.  It's ok if you aren't getting much done at the moment.\n\n2) When you are up for working, set really small goals.  When I was writing my dissertation, my goal each day was, \"Write something.\"  If all I could manage on a given day was the Table of Contents, then at least I achieved my goal.  More often than not, once I got rolling I was able to write a lot, but on those days when I just couldn't, it was still ok.\n\n3) Consider getting some therapy.  It sounds like it would be helpful.",
      "author": "bigrottentuna",
      "created": 1589845928,
      "upvotes": 206,
      "replies": {
        "fr2zkzx": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr2zkzx/",
          "text": "This is very good advice. Also for 2., one thing that really helped me get out of a similar situation was to set my small goals at the end of the day for the next one. It prevented me from thinking about it during the night and also gave me a moment to appreciate the accomplishment of the day before closing everything up. Also the next morning I was ready to go, with my objective already set.\n\nEdit: This was something that I learned in a support group for graduate students organized by the psychology service of the university. Perhaps there is one in yours, they might do Zoom meetings. It was very helpful to interact with people having similar struggles.",
          "author": "splashingseal",
          "created": 1589846968,
          "upvotes": 73,
          "replies": {
            "fr4lrvd": {
              "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4lrvd/",
              "text": "Hi. \n\nThank you for your comment. \n\nI tried taking things little by little before with goals set for the next day, but I always end up waking up feeling anxious. I’m going to give it another go and see how it goes.\n\nI have social anxiety as well so unless they are people I’m close with, I would avoid having video conference nor phone call. That’s why I come to Reddit. I feel comfortable sharing in writing. \n\nStay safe. xx",
              "author": "ConstantAide",
              "created": 1589891688,
              "upvotes": 7,
              "replies": {
                "fr5oip7": {
                  "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5oip7/",
                  "text": "That's great that you're figuring out what works best for you! You're on the right track!   \nDon't hesitate to start with the smallest possible goal. It can be something as small as writing a section title. Increase as you feel you're ready for it. Take the time to write down everything you have done at the end of the day and be kind to yourself about it, celebrate the smallest accomplishments. Know that a lot of us have been through this and that you can make it too.   \nTake care!",
                  "author": "splashingseal",
                  "created": 1589911994,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "fr3angz": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3angz/",
          "text": "All of this and I would also wouldn't rule out being honest with your supervisor. Depending on your relationship, obviously. I was here about a year ago when it was just blank screen staring back at me but data was collected, analyzed, and memo'd, so the work was there but the monograph was giving me mental strife. My advisor was understanding as 1) we had a positive relationship and 2) it wasn't the first time they'd seen such a thing. We discussed 1 and 2 because 3 was already happening.\n\nMy go-to small accomplishments are revising my outline to both reflect changes and anticipate new ones. This helped with writing a ton as I could just sort of fill in the important bits with the standard academic writing conventions. I probably should have included collating end citations because I didn't and now I'm stuck doing it all at once.",
          "author": "PeterCastiglione",
          "created": 1589853347,
          "upvotes": 27,
          "replies": {
            "fr4m3u4": {
              "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4m3u4/",
              "text": "Hi. \n\nThank you for your comment. \n\nI have spoken to them about my issues and they have been quite understanding. I have managed to extend my submission so I have the rest of this week to get my work done and hopefully I can really start doing it. \n\nI will try to take it little by little and hopefully it’ll be the start of writing tons like you did. \n\nStay safe. xx",
              "author": "ConstantAide",
              "created": 1589891925,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fr4jb05": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4jb05/",
          "text": "This is spot on advice. Another trick I used when writing my dissertation was to have a time that I was going to start working, and then promise myself that I would open the document and work for 10 minutes. \n\n10 minutes is a very survivable amount of time to write. Sometimes I would write 10 minutes (even if it was editing the table of contents or whatever my small goal was) and be done, and try to work 10 minutes again at the start of the next hour. Or not at all. Often, though, once I got over the hurdle of carving out time, opening the document, and starting on an achievable task, I would work for much much longer. \n\nThis is difficult in the best of times. Hang in there and good luck! Home stretch!",
          "author": "GeneticsSchemetics",
          "created": 1589889820,
          "upvotes": 9,
          "replies": {}
        },
        "fr3jyce": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3jyce/",
          "text": "[deleted]",
          "author": null,
          "created": 1589859045,
          "upvotes": 17,
          "replies": {
            "fr3p5ib": {
              "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3p5ib/",
              "text": "To expand of this, make the goals not based on quality.  So do not finish a section, but work on the section.  Just move forward basically so you do not feel like you failed on off days.  \n\nBut second being prepared to change things up.  I found if my writing was not coming, instead of forcing it to move onto something else like editing, checking references or fixing style issues.",
              "author": "engelthefallen",
              "created": 1589862569,
              "upvotes": 10,
              "replies": {
                "fr5j47h": {
                  "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5j47h/",
                  "text": "Your comment is comforting. I always focus on the quality but end up being heavily criticised by my three supervisors. Maybe I should just go easy and just do what you’re doing as a start. \n\nThank you for your kind words.\n\nStay safe. 💕",
                  "author": "ConstantAide",
                  "created": 1589909395,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "fr5iuyt": {
              "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5iuyt/",
              "text": "I can really write good couple of thousands of words in a day if I’m on the roll, but most days I’m just clueless, not only in writing but in everything else.\n\nI have a bad handwriting but I will try to follow your tips. Thank you for your kind words. \n\nStay safe. 💕",
              "author": "ConstantAide",
              "created": 1589909275,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fr4ldca": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4ldca/",
          "text": "Hi. \n\nThank you for your comment. \n\nI can go on writing for 12 hours non-stop some days but most days I just can’t get anything done, and the current one is the longest I’ve gone without being productive. Even having deadline couldn’t get me on the roll. \n\nI will try setting a small goal like you’ve suggested and see how it goes.\n\nI haven’t spoken to any therapist yet, but Reddit has been a mood-booster so far. At least I’m writing comments. \n\nStay safe. xx",
          "author": "ConstantAide",
          "created": 1589891395,
          "upvotes": 4,
          "replies": {
            "fr4x682": {
              "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4x682/",
              "text": "I read this book called The Writers Book of Hope and it helps with the bad days. It includes all sorts of little stories about the greatest writers struggling with exactly what you're dealing with. It's not a solution -- and it takes its own time to read -- but it helps you realize your not alone. Pulitzer prize winners, Nobel laureates, books that are taught as classics -- all their authors struggled. Many experienced despair. Writing is hard.",
              "author": "a_large_plant",
              "created": 1589898565,
              "upvotes": 3,
              "replies": {
                "fr5jcac": {
                  "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5jcac/",
                  "text": "I will try to look for that book. I don’t know if I’m able to get a hold of it or even read it but it will definitely be on my book-to-read list. \n\nThank you for your recommendation.\n\nStay safe. 💕",
                  "author": "ConstantAide",
                  "created": 1589909502,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fr4u9zu": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4u9zu/",
          "text": "I agree with all of this. And something that helped me was voice to text software when I felt totally overwhelmed while writing. It allowed me to just talk and not worry about whether it was perfect or not. I would just talk to my computer for a few minutes about whatever topic I was working on. 10 minutes later you have a bunch of craziness. But you accomplished a goal. Next goal is 20 minutes of editing. I highly suggest using something like the pomodoro method. You don't have to do 25/5 splits of work and rest. You can do 20/10 or 15/15. But if you set that timer it really seems to help get stuff down.",
          "author": "Pop_pop_pop",
          "created": 1589896997,
          "upvotes": 2,
          "replies": {
            "fr5jmi4": {
              "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5jmi4/",
              "text": "I have tried that before but I can’t really articulate my ideas in audio so I jot it down instead. At the moment I just don’t have the drive to do anything but I have been getting a lot of suggestions on Pomodoro method. I will look it up and try to do it. \n\nThank you for your kind words.\n\nStay safe. 💕",
              "author": "ConstantAide",
              "created": 1589909638,
              "upvotes": 2,
              "replies": {
                "fr5kizf": {
                  "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5kizf/",
                  "text": "No problem. I definitely get it. Take it easier on yourself. This period is wild and grad school is stressful without our lives being flipped upside down. And my suggestion is when you jot it down or speak it or whatever works for you dont try to edit it. Let all the typos and poor word choices stay. Writing and editing are two different things. A lot of times it is easy to get stuck on making a perfect sentence. Dont let that happen. Just write a shitty sentence and come back to it later. But set really simple goals. I believe in you. This is a really crumbly period but you are smart, and you can do this work! And I think looking at the options on campus for student counseling would be great. Most of my cohort went to the counseling center at least once.",
                  "author": "Pop_pop_pop",
                  "created": 1589910065,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fr5g2pz": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5g2pz/",
          "text": "Also I would add that people have found playing online games with people, be it friends or strangers, to be refreshing and somewhat scratches their social itch.",
          "author": "ncgunny",
          "created": 1589907980,
          "upvotes": 1,
          "replies": {}
        },
        "fr5ieya": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5ieya/",
          "text": "My goal for today was to write something like you have done. Although I haven’t started writing for my paper, but I have started writing again by responding to comments on here so I consider it as goal partially met. I will try to meet the goal again tomorrow.\n\nI’m considering therapy, but before I enroll into any sessions, I prefer to speak to like-minded people to understand my problem better. I don’t think I will be able to articulate my issues to the professionals unless I know what’s really going on in my head. After talking to some of you on here, I think I have clearer idea now. It’s also comforting to know that I’m not alone.\n\nI’m this close to giving up, but reading messages like yours have given me a new lease of life. I will put little to no expectation on the outcome but I’m just gonna try for now. \n\nThank you for your kind words.\n\nStay safe. 💕",
          "author": "ConstantAide",
          "created": 1589909069,
          "upvotes": 1,
          "replies": {
            "fr5scus": {
              "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5scus/",
              "text": "Fantastic!  I'm so glad that you found my small suggestions helpful.   And good job reaching out!  Communicating with others about the problems you are facing can be so helpful, especially in a crazy stressful situation like this one. The stress of doing a dissertation is more than enough for most people, as is sheltering in place alone during a global pandemic.  Doing both at the same is enough to push anyone over the edge.  But don't despair.  Just do what you can and keep inching forward.  You will get there.\n\nRegarding your paper, anything you can do is a success.  A rough outline.  A sketch of a figure.  A not-necessarily-complete list of key ideas that you want to include.  A list of figures you might include.  An abstract (often the hardest part to write).  A list of related work you need to mention.  Anything.\n\nFeel free to message me if you want some more encouragement.  I'm not a therapist and I don't have any magic words, but I'm happy to talk, I know the academic game well, and I'm pretty good at offering positivity.",
              "author": "bigrottentuna",
              "created": 1589913849,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fr2xx9y": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr2xx9y/",
      "text": "I want to give you a (virtual) hug. It's clear that you are really struggling right now. A Ph.D. is difficult under any circumstances, and it is especially difficult in the middle of a fucking pandemic.\n\nSome suggestions:\n\n1. Seek out counseling, if you have not already done so. Most universities have transferred their counseling to teletherapy, so you can still get support. You're aware of your mental health struggles, which is great. There are steps you can take with the help of a professional to manage your anxiety.\n\n2. I encourage you to have an honest conversation with your PI. You don't need to share the full extent of your mental health struggles, but I do think it is worth sharing that you've found it nearly impossible to get work done during the pandemic. I think your PI will appreciate an update on your deadline, and I imagine that you're fearing this communication with them. It may be like ripping off a band-aid, but I think you'll be in better shape having shared your struggle with your PI so that they have an idea of where you're at and, ideally, can support you academically. Perhaps the two of you can work on a revised timeline that feels genuinely realistic for you. Perhaps your PI has suggestions for navigating things. Perhaps your PI is struggling, too, and you will feel less alone. Perhaps your PI would even fully support you taking some time off. I encourage you to have this conversation in real time, if at all possible (i.e., via Zoom or phone).\n\n3. Based on what the degree of anxiety you're describing and your stated desire to go home with family, I think taking a leave of absence is an option worth seriously considering. It would be good to relieve some of the pressure and have the support of family. To be frank, if your anxiety is debilitating enough that you will get very little done, then you might as well get very little done without the daily pressure and feeling of failure from not getting things done, as well as with the in-person support of loved ones. You can always resume your Ph.D. after you've had some time to attend to your mental health and when the pandemic has been more thoroughly addressed.\n\n4. On that note, I encourage you to seek out social support. Talk with friends in your program. Talk with friends and family members in general. One of the challenges of the pandemic has been losing out on the kinds of day to day interactions we count on for support--catching up with a friend, or running into someone in the hallway and telling them about your day. If there are mentors you feel that you can turn to, I encourage you to talk with them, as well. You do not need to go through this alone.\n\n5. I want to encourage you to be kind to yourself. We are in the middle of a global emergency. It makes sense that you feel anxious. It makes sense that you are having trouble concentrating. And although your level of anxiety is higher than the average person's, the kinds of symptoms you're describing (frequent panic attacks, crying spells, difficulty sleeping) are not things you chose. To be sure, there are steps you can take to address these aspects of your mental well-being, but none of this is your fault. We are all struggling in different ways right now, and it's OK that you're anxious and OK that you're struggling. It doesn't make you any less worthy as a person or any less of a good Ph.D. student.\n\nI hope that you can get the support you need, and I wish you all of the best.",
      "author": "jogam",
      "created": 1589846037,
      "upvotes": 77,
      "replies": {
        "fr30ykl": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr30ykl/",
          "text": "This is very important advice too! It is really worth it to discuss this with your PI, even if it is always scary to do so. Perhaps you two can figure out a new timeline together, and it is indeed a very good idea to include a leave of absence in it. Take care of yourself.",
          "author": "splashingseal",
          "created": 1589847746,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "fr385e7": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr385e7/",
      "text": "You are not alone my friend! I know exactly what you mean and I am suffering under the same circumstances. I have read all the above advice and I am feeling like tomorrow is going to be my first good day as a PhD student since March 5, when I stopped rewriting my draft. I have kids and a spouse and the pandemic has me absolutely overwhelmed. I did stop crying eventually and I did seek the help of a therapist. Yes I have a Zoom therapy session. And that sucks too, but it's keeping me from a total meltdown. Small goals!\n\nThanks for posting your story. You speak for at least 2 of us. Best of luck to you and I hope to submit in August 2020. ((Hope)). I think it's all about small goals and steady progress.",
      "author": "agnosticrectitude",
      "created": 1589851887,
      "upvotes": 11,
      "replies": {}
    },
    "fr3zjh4": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3zjh4/",
      "text": "First of all, thanks for writing this. Great comments here. I would like to add a few points.\n\n1) I am a PhD student and i have spoken to other PhD students regarding this situaiton, they are more or less on the same boat. You are not alone in feeling this. So what you are feeling is a counter effect of this whole COVID-19 situation. Don't beat yourself up too much on it. I told my advisor about this and he has been supportive.\n\n2) Having said that, here are some things i do to make some progress. Some of them may seem trivial and Irrelevant so you can pick and choose.\n\n1. Use Pomodoro Technique ( [https://pomodoro-tracker.com/](https://pomodoro-tracker.com/) ), You would have heard of this before, the key idea is to use it effectively. The last paper i was writing, one of my pomodoro's was to just find a good photo to past for the biographical sketch. 25 mins of small work.\n2. Dress up for work. Whatever is your normal working time now or had been before corona virus. Take a shower, Shave, Brush your teeth, wear fresh clothes, wear shoes, get a coffee and then start working. \n3. Another thing that helps me focus is to watch a talk on the side, this is not for the times you have to do brain work but more like for boring work such as numbering the pages or making fonts consistent.\n4. Get better equipment :  2 monitors, chair, ergonomic stand, keyboard, mouse. Whatever helps you. After getting [this](https://www.amazon.co.uk/gp/product/B0007YB8NM/ref=ppx_yo_dt_b_asin_title_o01_s00?ie=UTF8&psc=1) ergonomic laptop stand, my productivity has increased at least 50%.\n5. Work when you like : You don't have to work 9-5, You don't have to work from inside your house. There are no set of rules regarding place and time to work, if working from park makes you more productive, do it. If working from bed at 11 PM makes you more productive, do it ( It's always good to stick to a schedule but if not ).",
      "author": "mlbatman",
      "created": 1589870865,
      "upvotes": 12,
      "replies": {}
    },
    "fr3bhux": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3bhux/",
      "text": "I am in the same boat as you. I could do very little during the first couple of weeks. Like some other folks suggested here, start off the day doing an small task and gradually you'll start to do more. I'm still not at my productivity levels pre-quarantine, but I have accepted that and just try to do what I can.\n\nEven so, I think talking to a counselor could really help. I'm actually going to call one tomorrow because I realized I can't do this alone and need help.",
      "author": null,
      "created": 1589853849,
      "upvotes": 9,
      "replies": {
        "fr3inf3": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3inf3/",
          "text": "I changed my classes to pass/fail (just graduated undergrad) this semester because of covid - it was impossible to motivate myself to the same standard I could alone, stressed, and depressed off-campus. This is a story you hear from students everywhere. I wish I had a counselor - it would have really helped.",
          "author": "future-latina-MD",
          "created": 1589858223,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fr3s88h": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3s88h/",
      "text": "hey, friend. \n\nIf there would be any chance to restart, it's better than feeling bad every day.\n\nA ph.D. is not more important than your life. Take care of yourself. Only you can do it.",
      "author": "himatshi",
      "created": 1589864847,
      "upvotes": 5,
      "replies": {}
    },
    "fr2yiyl": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr2yiyl/",
      "text": "Breathing exercises that you can find online have helped me. Box breathing specifically, but different versions work for different people. My box breathing is counting 4 seconds breathing in, hold for 4 seconds, release for 4 seconds, hold for 4 seconds, repeat for a few minutes. Just calming your mind and body. This is an extreme situation and how you are feeling is so normal. Write out everything you’re anxious about on paper and play devil’s advocate for worst case scenario and then circle back around to imagining a more realistic outcome. Reach out to coworkers in your lab, reach out the your university’s writing center if you have one, reach out to your university’s health services if you have one. Exercise if you can, it’s amazing for working out anxious thoughts. This is going to be okay. There is a way forward and we can do this!",
      "author": "scarycatdance",
      "created": 1589846370,
      "upvotes": 12,
      "replies": {}
    },
    "fr360qq": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr360qq/",
      "text": "I completely relate and this has been happening to me as well. I began using this really cool app called forest and it’s helping me to keep focused. I’m still not in perfect shape however. Just remember, the first sentence you read or write/ the first question you answer can sometimes get the ball rolling and imo is the hardest part of any project. Good luck!",
      "author": "ChristinaTryphena",
      "created": 1589850655,
      "upvotes": 6,
      "replies": {}
    },
    "fr3dpxk": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3dpxk/",
      "text": "Do you have a fairly good relationship with your mentor? (Or a grad program director?) If so, I would encourage you to let them know you are struggling. I mentor grad students and I’ve told them directly that their mental and physical health should be their priorities right now. If you were my student, I would hope you could let me know that things are this rough for you right now. A PhD is supposed to be hard, but not destructive! \n\nI also second the advice for you to seek out some counseling: there are lots of good online resources right now. The pandemic is affecting EVERYONE’S mental health and productivity! I’m a PI and I’ve been getting some online therapy through this! It’s helpful to have a neutral party (a) help you strategize ways to cope, and (b) reassure you that everyone is struggling right now. \n\nYou are having a normal response to a not-normal situation. Be gentle with yourself and treat yourself the way you would treat someone you love - with compassion and encouragement.",
      "author": null,
      "created": 1589855200,
      "upvotes": 5,
      "replies": {}
    },
    "fr3ovfg": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3ovfg/",
      "text": "This is actually not uncommon at all.  The problem is it is a vicious cycle.  You want to write, but are stressed out and trying to force yourself to write just stresses you out more.  Repeat this a few times and you now trained yourself to become stressed when you write or think about academics.  So many people fall victim to this cycle but grad school culture does not talk about it at all.  Breaking the cycle is not a one size fits all thing, but step one is to try to notice that you are getting stressed out based on habit at this point.\n \nFor your own mental health I do suggest talking with someone as they can help you with strategies that work to break the cycle.  There is a sky high suicide rate in academia from students who get into this place that we also do not talk about.  If you need to you can take a leave of absence until you feel you are able to continue your writing.  I had to take two of them.  One for a mental breakdown following a divorce and a second one from the psych treatment I was receiving being discontinued without warning.  Everyone in my department was super supportive of me taking the time off.",
      "author": "engelthefallen",
      "created": 1589862368,
      "upvotes": 5,
      "replies": {}
    },
    "fr386ek": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr386ek/",
      "text": "You need to seek out supports. This could be a professional, but you also need to come clean with your your advisors. The first few weeks the walls felt like they were closing in, I discussed with my advisor who informed me they were leaving town to quarantine with their family and actually needed someone to watch their pet. It has actually been win-win for both of us...they don't have to worry about someone random burgling their apartment, and I have somewhere to work with a four-legged friend to keep me company. It has also drawn us closer in terms of strengthening trust.\n\nMy point is that supports can come in very unusual form, and you never know what emerges. Almost certainly what you will not find is people calling you lazy or whatever that little voice of doubt in your head \"expects\" they will say. Oddly enough, by suffering alone you allow others to fill in the information vacuum with their own reasoning. Better to shed some light and give others insight into what's actually going on.",
      "author": null,
      "created": 1589851904,
      "upvotes": 10,
      "replies": {}
    },
    "fr3c1kw": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3c1kw/",
      "text": "Sending you a virtual hug! You can totally do this! \nI've been in exactly this situation. Here are some things that helped me: \n\n-watch YouTube videos about how to study with depression. https://youtu.be/w3EheJhCKAk is a good one\n\n- get into the habit of sitting at your desk and breathing calmly, even just for five minutes before taking a depressing nap. This will slowly break down the anxiety barrier of sitting there. \n\n- start your study session by sitting in your spot with your study stuff, and dancing to your favourite song. Get the good vibes and endorphins going! \n\n- make time with a therapist. Lots of uni student health centres have free counselling!\n\n- break it into pomodoro -25 minute time slots. Tell yourself you'll just get through that amount of time, not all day, not trying to do your whole thesis, just only that 25 minutes\n\n- be honest with your supervisor. They will have been in dark places at times, and are there to support you\n\n- consider applying for a health related extension, with a doctor's certificate for your mental health",
      "author": "synthetic_grape",
      "created": 1589854180,
      "upvotes": 10,
      "replies": {}
    },
    "fr3ixe3": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3ixe3/",
      "text": "I’m sorry you’re going through this right now. I’ve been there. Three things helped me. 1) make a to-do list but fill it with obvious things. I would add brush my teeth and pet my cat and other random stuff on it. Then when I crossed something off—even just petting my cat—I felt empowered to try something else. 2) break every thing down into very small chunks. And add those to your list. Instead of an entire rewrite aim for one page. Even one paragraph or one sentence. And then REWARD YOURSELF with something. For me it was painting my nails or watching crappy TV. 3) Look into professional help. Your university should offer counseling services. I never would have finished my degree without the support of a counselor helping me identify the root of my anxiety and then developing a plan for it. Medications also helped A LOT, but everyone is different. I hope this helps.",
      "author": "hathennie",
      "created": 1589858397,
      "upvotes": 4,
      "replies": {}
    },
    "fr3xwyg": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3xwyg/",
      "text": "Give yourself one realistic goal for today. Then, spend just today to meet that goal. That's all. No pressure to do anymore than that one goal. \n\nTomorrow, repeat.",
      "author": "Inner-Stay",
      "created": 1589869447,
      "upvotes": 4,
      "replies": {
        "fr5higu": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5higu/",
          "text": "My goal for today was to of course get back on work but I couldn’t meet that goal like always as it wasn’t realistic for now. However, I’ve started writing again by responding to comments so it is kind of giving me the writing vibe that’s been missing from my life for the last one month. I hope by doing this, it’d give me strength to start writing for my paper again. \n\nI will try again tomorrow.\n\nThank you for your kind words. \n\nStay safe. 💕",
          "author": "ConstantAide",
          "created": 1589908655,
          "upvotes": 2,
          "replies": {
            "fr5hvpa": {
              "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5hvpa/",
              "text": "Maybe be more specific with your goal. Like, today, just write only the introduction of your paper. \n\nOr, find five articles you should read and create a reference page from them. That's it. But it's specific. \n\nBe very specific and don't make it too big.",
              "author": "Inner-Stay",
              "created": 1589908823,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fr3npxy": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3npxy/",
      "text": "[deleted]",
      "author": null,
      "created": 1589861553,
      "upvotes": 3,
      "replies": {
        "fr3p9bl": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3p9bl/",
          "text": "Yeah, I went three months of forcing myself to write my thesis and getting nothing done before I realized this may be a serious problem.",
          "author": "engelthefallen",
          "created": 1589862646,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fr3rl8u": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3rl8u/",
      "text": "Exercise and meditation will be extremely helpful. Particularly exercise right now as when you're at a panic attack level of anxiety it probably will quite hard to meditate\n\nReduce some of the present moment pressure. If it is the pressure of meeting your own expectations, remind yourself it doesn't have to be perfect, just good. If it is the pressure of meeting your academic supervisor's expectations, talk to him and open up to him about this and you will likely find the support you received can naturally reduce that anxiety or remind yourself you're doing this for you and not for them\n\nRestore confidence in yourself and remind yourself you are intelligent and able to research complex topics and able to make good decisions\n\nOvercoming that initial anxiety and starting is the hardest part. Once you see yourself functioning well enough that anxiety relaxes and then eventually you naturally begin functioning, then functioning at a very high level. This should ebb and flow and with a massively difficult task it's not going to be high-level functioning off the bat if the stress of it is causing anxiety and that's alright\n\nRemind yourself you can function at a high-level even when stressed. You might even be a panic operator and eventually, the anxiety over the task will give you the energy to force yourself to meet the deadline. I wouldn't rely on this however and getting ahead of the task consistently and sooner rather than later will reduce the anxiety\n\nChannelling and \"using the anxiety\" and adrenaline you feel into the task can be a reframing of perspective. It's not physiologically what happens, but it seems to be a way to trick your brain into orienting on the task rather than ruminating on the anxiety you feel, which is what we want\n\nSleeping on difficult problems often resolves a lot of that anxiety as your brain processes the task during sleep as well as daytime\n\nFlow states are achieved with deliberate effort on a challenging task and involve overcoming initial anxiety and stress with an appropriately challenging task. There is an optimal level of challenge involved and right now the task is overwhelming but as you work through it eventually you will hit that sweet spot but it will require not just effort but sustained effort\n\nA vipassana meditation method where you view the thoughts and feelings associated with panic and anxiety as simply thoughts and feelings arising in consciousness and then exert executive control which overrides them can help\n\nBecause of the magnitude of a PhD project this is a much larger barrier to overcome and should take a lot longer to get into an optimal state but will involve some willpower and deliberate focus on the task",
      "author": "mpbarry46",
      "created": 1589864358,
      "upvotes": 3,
      "replies": {}
    },
    "fr4l3qc": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4l3qc/",
      "text": "I know it may sound simple, but taking a walk usually helps me. It's hard to get in to the mindset to write and I believe that taking a 10-30 min walk everyday has helped immensely.",
      "author": null,
      "created": 1589891199,
      "upvotes": 3,
      "replies": {
        "fr4mexy": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4mexy/",
          "text": "Hi. \n\nThank you for your comment.\n\nI’m thinking of doing that every day but I always end up having longer lie in to cope with my anxiety. I have only managed two walks so far during this whole lockdown period and I’m planning another one today. Let’s see how it goes.\n\nStay safe. xx",
          "author": "ConstantAide",
          "created": 1589892135,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fr4t8bf": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4t8bf/",
      "text": "I am going through the same thing now. What's helped me the most is the book \"[Eat That Frog](http://www.al-edu.com/wp-content/uploads/2014/05/Eat_That_Frog.pdf).\" I felt like this a few weeks ago, but I read the book one afternoon and the following two weeks were productive as it really motivated me. Now I am starting to slip again. Yesterday I didn't do anything. So I'm planning to skim through the book again today to gain the motivation and hopefully have another good week or two. Good luck! You will make it through this!!",
      "author": "ObiJuanita",
      "created": 1589896408,
      "upvotes": 2,
      "replies": {}
    },
    "fr5ba83": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5ba83/",
      "text": "I just wanted to comment to say I definitely know how you feel. I am in my first year teaching post PhD and have been having serious anxiety. I also think it’s getting to the point where my anxiety symptoms are looking like COVID symptoms making my anxiety even worse. I ended up getting tested and it was negative but that isn’t even really helping. Just trying to hang in there and get grades submitted. I don’t have much advice but seeing your post helped me a little since it shows me I’m not alone. I’ve started trying to do some yoga in my apartment (never done it before but giving it a chance). Hugs to you, I hope it gets better for you! Feel free to message me if you’re ever feeling really alone in your anxiety.",
      "author": "melync14",
      "created": 1589905702,
      "upvotes": 2,
      "replies": {}
    },
    "fr5ne0r": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5ne0r/",
      "text": "I've been struggling with this for a year now, even before the pandemic. My advice, is to schedule out your time on each task in one hour blocks in google calendar, or somewhere else that will give you alarms so you get a gentle reminder when you are off task for too long. Be sure to schedule time to be off task though, and it's okay if you start by working less than normal, even just a few hours a day is enough to get the ball rolling. Also, if you find yourself taking a an extra long break, or stress-breaking, I cant emphasize enough how important it is to get up, and walk away from the computer. Just take a brief walk, or go to the store, or go exercise for 20 minutes and I promise you will feel 1000x more refreshed than staring at reddit/facebook/youtube/etc.\n\nI will say, I tried the couseling/psychiatry route, but it honestly was unhelpful for me because our work *is unbearably stressful* sometimes,  but it *is also what we want to be doing* so, for me their advice seemed kind of unhelpful. You may find luck with some of the meds though, just be aware that they will almost exclusively prescribe you antidepressants no matter how many times you tell them you just want an anti-anxiety med since anti-anxiety meds are heavily regulated.",
      "author": "InfuriatingComma",
      "created": 1589911440,
      "upvotes": 2,
      "replies": {
        "fr5ohnr": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5ohnr/",
          "text": "I can relate with your comment the most. I have been experiencing a series of unfortunate events in my life since August 2018. This pandemic is just cherry on the cake. However, I really find this pandemic is worsening my mental health. I wanted to have a walk today but I ended up doing nothing as usual. I pretty much have lost my enthusiasm and zest in life. \n\nI somehow agree with you. Talking to therapist and taking meds don’t work for everyone. I was prescribed with anxiety meds once but they gave me gastric so I stopped taking them. I prefer talking to like-minded people who can actually relate. So far the comments on here have been uplifting and I’m gonna try to come here every now and then for moral support. \n\nThank you for your kind words.\n\nStay safe. 💕",
          "author": "ConstantAide",
          "created": 1589911979,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fr5o9dj": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5o9dj/",
      "text": "Hi so there have been a lot of really good comments here and I just wanted to add my two cents as a baby academic with mental health and productivity issues!! It’s almost impossible for me to do a lot of the suggestions that other people have done when I’m struggling with executive dysfunction, but what I’ve learned is that watching people be productive and find reward in their hard work gets me so inspired!\n\nI was really struggling to write my senior thesis a couple weeks ago and had no idea how to get myself in the mindset to go near it. I was the same way - too anxious to look at emails, too anxious to do anything academic but just kind of sit and wallow in my anxiety. Then I watched the Netflix documentary about women and women of color running for office in the US (I think it’s something like Tear Down the House?) and specifically seeing Alexandria Ocasio-Cortez put in so much hard work, research, and dedication to winning her congressional seat inspired me so much that the next day I started doing work. A month later and I finished my thesis and am now working on more research and not feeling as stuck as I was.\n\nLong story short, I think seeking counseling or some form of therapeutic support is crucial in trying to work through frustratingly ableist expectations of what productivity looks like and what is needed for PhD programs like yours, but I also know that sometimes the only thing you can do is sit and watch stuff or just kind of exist. I’ve put together some videos that help inspire me when I need to get out of a particularly rough episode, so let me know if you’d like me to send you some links that have helped me! If you also need an accountability buddy this summer I’m gonna be working on research for several months so feel free to DM me if you want somebody to check in with you, no judgement attached!\n\nTLDR AOC helped me get out of my executive dysfunction episode",
      "author": "jamieejamss",
      "created": 1589911869,
      "upvotes": 2,
      "replies": {}
    },
    "fruuf39": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fruuf39/",
      "text": "I'm so sorry for what you've been going through<3 I have also been quarantined alone and it's not fun!! What has helped me a little is to stay connected to people, friends, colleagues, family, or even strangers online. I started speaking my mind out loud even though I am the only person in the room. I feel calmer doing that and sometimes I feel as if I am presenting my ideas to some imagined audience. I recently started recording my \"speeches\" and am planning to share them somewhere. It's an extremely hard time for many people and please never blame yourself for not doing enough. Also try reaching out to counselors if there're resources available, even zoom calls could help.",
      "author": "JJLLXX",
      "created": 1590487038,
      "upvotes": 2,
      "replies": {
        "fruw0r0": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fruw0r0/",
          "text": "I’m glad that you’re coping well. You’re very strong, so proud of you. I wish I held out longer, but I’ve reached my threshold. \n\nI’ve pretty much done everything to stay sane; cooking, baking, Tik Tok, Netflix etc. but they worn me out as the calming effect didn’t last very long. I woke up feeling anxious and went to bed feeling the same. Sometimes it became overbearing I couldn’t breathe and cry. I talked to walls and furnitures, recorded myself but it made me feel sorry for myself and I’d start crying again.\n\nOne of the things that this pandemic and loneliness combination have done to me is I become disinterested in people. I reached out to my family and friends in the beginning of my quarantine but over time people starting to get tired of doing it and I become tired myself. Video conferencing makes me anxious, especially when talking to my supervisors or strangers. \n\nHowever, to strangers via writing puts my mind into ease which has given me the courage to send that email. I’ve had problem waking up in the morning and always had longer lie in since my mental health deteriorated, but after sending that email my sleep routine has slowly gone back to normal. All I need is some space from things that are aggravating my mental health issues. \n\nThank you for your kind words. \n\nStay safe and stay strong. 💕",
          "author": "ConstantAide",
          "created": 1590488614,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fr38fh5": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr38fh5/",
      "text": "You need to see a therapist and get accommodations for your work. I had this problem in grad school too.  Sometime we are pushed to a ace where we need medicine and/or therapy to function.",
      "author": "lnln8",
      "created": 1589852052,
      "upvotes": 3,
      "replies": {}
    },
    "fr3k6l5": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3k6l5/",
      "text": "Oof. This sucks. I myself have been going through something similar. Panic attacks and not working as much and then feeling guilty. I’m not back to my old self yet, but I started going to therapy as well as seeing a psychiatrist. The anxiety meds have helped a ton, and I wish I started them earlier tbh. He weekly therapy has done wonders for how I process things. I don’t know the best solution for you, but doing these things really helped. Getting a PHD is awesome and these issues shouldn’t stop you from your goals.",
      "author": "Sacuna9999",
      "created": 1589859190,
      "upvotes": 1,
      "replies": {}
    },
    "fr3vsvn": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3vsvn/",
      "text": "Talk to others and seek help! Do NOT leave it till too late. That was my mistake.",
      "author": "omgpop",
      "created": 1589867677,
      "upvotes": 1,
      "replies": {}
    },
    "fr3zfvn": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr3zfvn/",
      "text": "Consider \"adventure studying\". Take a laptop, or a notebook, and go for a brisk walk, away from your desk. Sit in a different environment. It may not be possible to go to a coffee shop or library right now, but see if you can just momentarily be outside, somewhere new. Open the laptop, and write down the smallest possible next thing you can do. \"Finish my chapter\" is a giant thing. That is not a good candidate as an actionable task.\n\nIt might be: write one sentence to start explaining the relevance of that person's quote. Or: fix the margins of the table on page 7. Or: insert a citation. Or: make a transition sentence between two paragraphs. Or: highlight some stuff in section 2.3.4 of an article.\n\nAnd that's it. Do the one sentence. Celebrate like crazy. Now you have a new sentence. It's incrementally better than before. Now try one more, if you can. Don't push. Let it come. Have food and sleep when you need to.\n\nThe deadlines? Screw em. You've though about them enough. Give yourself permission to let go of guilt, shame and pressure. You have spent enough energy on that. It doesn't exist right now. Only the tiny, tiny one thing.",
      "author": "somecuriousperson",
      "created": 1589870778,
      "upvotes": 1,
      "replies": {}
    },
    "fr429x2": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr429x2/",
      "text": "sounds like my burn out. you need medical help.",
      "author": "porraSV",
      "created": 1589873374,
      "upvotes": 1,
      "replies": {}
    },
    "fr4czqy": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4czqy/",
      "text": "Well if it makes you feel any better it could be worse. Imagine if everything was taken away from you almost instantly, in a week or in a month. You never know when but that it will happen. You have no choice. They’ve kicked you out. This is happening to me and I’m only a first year.",
      "author": "norar19",
      "created": 1589884196,
      "upvotes": 1,
      "replies": {}
    },
    "fr4oh0u": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4oh0u/",
      "text": "Sending virtual hugs. I haven't been through anything like this, so it would be silly of me to give advice. But there's always sunshine after rain! Hugs, and hope everything gets better ❤️",
      "author": "Cleon_I",
      "created": 1589893513,
      "upvotes": 1,
      "replies": {
        "fr4osej": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4osej/",
          "text": "Hi. \n\nThank you for your nice comment.\n\nI will try to keep your words in mine, although I enjoy the rain more. 😊\n\nStay safe. xx",
          "author": "ConstantAide",
          "created": 1589893717,
          "upvotes": 2,
          "replies": {
            "fr4tbn9": {
              "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4tbn9/",
              "text": "Very well, there's always rain after more boring meteorological phenomena! :)  You stay safe too, and don't listen to the hurtful nonsense at the bottom of the comments. You're going through something that sounds absolutely awful, and these are dire times, but everything will get better. It has to. Don't give up. You'll do great, I believe in you  😊\n\n(If there's anything I might offer to help, listening to the 2nd movements of Shostakovich's and Chopin's 2nd piano concertos always helps me when I'm feeling down - they're just oddly heartwarming and sad simultaneously)",
              "author": "Cleon_I",
              "created": 1589896461,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fr4zsnp": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4zsnp/",
      "text": "Hi!  \nI often had panic attacks whenever I tried to sit at my desk and work. I've always suffered from anxiety, but because of interpersonal problems with my supervisor, it just exploded like crazy. This also happened with mere reading as I was terrified of not learning enough and consequently of being smashed by my supervisor. This is hard to deal with because performance anxiety is related to something you love. I've seen that you talked to your PI and this was a wise choice. What I found out about me is that writing anxiety is mostly about the dread anticipation brings. Just writing a couple of words is very useful because it calms me a bit. The only way I can ease writing anxiety is by writing. Sure it takes effort but it works. Also, I would take it easy on myself, because a PhD is normally stressful, imagine during a pandemic.",
      "author": "Normal_Kaleidoscope",
      "created": 1589899940,
      "upvotes": 1,
      "replies": {}
    },
    "fr5f8cx": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5f8cx/",
      "text": "Before quitting, ask for the things you need. You're experiencing a mental health crisis, in terms of the disruption to your everyday work that you are experiencing. If you broke your leg and weren't able to get care for it, would you try walking on it every day? It sorta seems like that's what you're trying to do.\n\nIs there a process to take time off from your university for health reasons? Where I am, I could take a month of personal leave or a semester/year of medical leave. Your sponsor likely has no idea what they are inflicting on you. Ask and maybe you will receive.\n\nMy heart goes out to you, by the way. I have anxiety and medical-related PTSD and this has been a tough time for me. I spent a couple weeks essentially reading romance novels and doing no work before I got my medication, my meditation, my exercise, and my sleep in order. Or closer to being in order. I also started bullet journaling, which is apparently not about being artsy but is in fact a structured way to approach your goals. I am five years into a phd and was feeling very hopeless because I am so often unproductive for mental or physical health reasons, but bullet journaling has made me feel empowered again. I also was forgetting a lot of things and panicking about that, and now it's just all in one book and I can find it. Maybe some of these techniques can help you too? They're my recovery cocktail.",
      "author": "jenesaisquoi",
      "created": 1589907585,
      "upvotes": 1,
      "replies": {}
    },
    "fr5fayt": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5fayt/",
      "text": "I think anyone who has done a Ph.D. has felt some version of this at some point, so you are not alone. It's hard, but we're here for you. Most of my comment will be centered around advice that might help. A lot of good advice has already been shared, but I thought I'd add my two cents. \n\n1. Atmosphere can help\n2. Planning can help\n3. No tasks is too small\n4. Explore your options\n\n1.  Atmosphere\n\nWhen I was writing my dissertation, I did most of it from home, which was hard after being in the office for so long with other people. I would even go to the coffee shop just to be around other people. I like my alone time, but sometimes it's nice to be social, even when not directly interacting. Anyway, one of the things that helps me is watching TV that I have seen (many times) in the background of tasks that are not brain-intensive.  This was KEY for me making figures because otherwise, your mind can get away from you. One of my friends and I listen to epic movie soundtracks when we need to get things done. They're just inspiring sometimes. If there is something similar to this that works for you, give it a try. \n\n&#x200B;\n\n2 and 3. Planning and Details\n\nI used to plan a lot of things in my day in chunks that I now see as too large (e.g. \"write chapter 3\" or \"do XYZ experiment from start to finish\"). One thing that has helped me is to break things down into very small, digestible parts, just like individual steps in a protocol or recipe. For writing, I find outlines for each paragraph helpful. Keep going with details until eventually, you have a sentence. Then you can start stringing those together later when you feel good about it.   \n\n4. Options\n\nAt times like this, mental health can be hard to take care of. A friend of mine shared this video which I found oddly inspiring/comforting ([https://www.youtube.com/watch?v=snAhsXyO3Ck](https://www.youtube.com/watch?v=snAhsXyO3Ck)). It asks us to improve, which is hard, but it identified boundaries that we might need to carry through this pandemic into our lives after this. I have also found that regular counseling is really important to my continued well-being. I know that this can be expensive, but depending on circumstances with your country, university, family, or personal finances and health coverage, you might be able to benefit. I recently moved from North America to Europe and looked into different options. I have recently been continuing to zoom call with my counselor from my Ph.D. days, but I looked into alternatives when I first arrived. I found that [https://www.betterhelp.com/faq](https://www.betterhelp.com/) (FAQ listed here) offered a range of options, including unlimited messaging and schedules that work for you. The ability to communicate \"constantly\" through chat or to schedule phone/video calls might provide the outlet that works for you. I encourage you (and others) to look into all the options available for working on mental health. It's extremely important and often overlooked in our \"produce epic results all the time/right now\" kind of world. We need our downtime and to recharge, and we need to be allowed/encouraged to take care of ourselves and to have others help us when necessary. \n\n&#x200B;\n\nI encourage you to stick it out a little longer and to try  some of the things posted in this thread. See if something can work for you. Reach out to us (individually if preferred) if you need support/guidance/encouragement. The MOST important thing to do is take care of yourself, and the rest will come. \n\n&#x200B;\n\nStay safe and good luck!",
      "author": "CaptainChemistry",
      "created": 1589907618,
      "upvotes": 1,
      "replies": {}
    },
    "fr5gzfh": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5gzfh/",
      "text": "Ask yourself - What is the worst that could happen if you don’t get your PhD? Will life end? No. Once you get this monster of PhD that’s in your head as a life or death situation out of your head, then focus on really small goals with achieving small tasks and taking joy in your work, however small it may seem. Once you get the ball rolling it’s a snowball effect.\n\nThere is a joke:\nHow do you eat a whale?\n:\nOne bite at a time.\n\nPs. Don’t actually eat a whale. :-)\n\nThere also a wise saying:\nJourney of a thousand miles begins with a single step. Focus on the single step and enjoy the journey.",
      "author": "damnrite",
      "created": 1589908408,
      "upvotes": 1,
      "replies": {
        "fr5ktfj": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5ktfj/",
          "text": "Your comment makes me laugh and knocks some sense in me. I have been pondering on life a lot realising that PhD is draining my happiness. I also realised my real passion while filling up the time doing non-stressful things and I’m excited to give it a serious go. You’re right, losing this is not a life and death situation hence why I’m contemplating to leave but there’s this little voice in me telling me to give this just another shot which is why I’m here to get some advice. I will try again to again tomorrow. \n\nThank you for your kind words\n\nStay safe. 💕",
          "author": "ConstantAide",
          "created": 1589910199,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fr5h7e9": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5h7e9/",
      "text": "I’m really sorry. I have an SO to quarantine with and that had been hard, but I can’t imagine doing it completely alone. Even for introverts, it’s starting to be too long without seeing a face :(\n\nI think in your situation it might be worth it to discuss this issue with your advisor. If your work is being done remotely right now, what does it matter where you are as long has you have internet access and are not in a drastically different time zone? If you don’t have the sort of relationship with your advisor where you’d feel comfortable telling them this, you could just say you’re having “health issues” or “family issues” to skirt the details. \n\nIf you are already taking something for your anxiety, it might be worthwhile to ask about a temporary dosage increase and/or schedule more sessions with a therapist. \n\nWorst case, if you’ve got a friend in your current town, maybe one is willing to be quarantine buddies? You are each the only person the other will see in close proximity sort of thing. \n\nI hope you are able to find your way through this without leaving your program ♥️",
      "author": "botheorange",
      "created": 1589908512,
      "upvotes": 1,
      "replies": {}
    },
    "fr5izax": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5izax/",
      "text": "I’m in a similar position. PhD and anxiety. I suggest going to see a doctor. I just spoke to one today and now I have a prescription that will hopefully ease my symptoms (just in the short term) so I can a risky relax for once and get some work done. I also got a note saying I’m unfit for work so I can get 4 weeks sick leave.",
      "author": "RainbowsOnMyMind",
      "created": 1589909332,
      "upvotes": 1,
      "replies": {}
    },
    "fr5lcgq": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5lcgq/",
      "text": "I was a big procrastinator when writing my dissertation. I did finally finish in time. I do understand some of what you are going though I think. \n\nStarting to write is the hardest part of writing. Know this. Know that that is the biggest hurdle for you. There are so many ways to distract yourself.  Know that your big hurdle is going from a state of not writing to a state of writing. \n\nOne way I got over this hurdle was to just lower my expectations of the quality of my initial writing. I like to edit what I have already written much more than actually writing. So write in layers, in a way. Write minimal info in outline form to start. Then add onto it another day. It will probably be easier to edit and add onto what you’ve done compared to starting from scratch.  So start with outlines, fill in who you plan to cite, then write the statements that use those citations, edit for flow, edit for clarity, edit for conciseness. \n\nYou say you like watching Netflix. Set aside a favorite show that you will only allow yourself to watch if you have written that day. Or, if you want to make a better incentive, set aside Netflix entirely until you have written something that day.",
      "author": "ILoveCreatures",
      "created": 1589910445,
      "upvotes": 1,
      "replies": {
        "fr5nca2": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5nca2/",
          "text": "Congratulations on finishing your dissertation in time. That was a huge feat. \n\nI like your methods, and I will try to follow them. To be honest, I haven’t been watching much Netflix or even anything. I just sit and stare most of the time but I’m gonna try to find anything interesting to do as a goal after finishing my writing goal. \n\nThank you for your kind words.\n\nStay safe. 💕",
          "author": "ConstantAide",
          "created": 1589911416,
          "upvotes": 2,
          "replies": {
            "fr7b1p7": {
              "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr7b1p7/",
              "text": "Thanks for your comment...I was late to the party and down here near the bottom!!😀",
              "author": "ILoveCreatures",
              "created": 1589943308,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fr5nme0": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5nme0/",
      "text": "I can understand what you are going through. I would suggest you to not judge yourself too much for not doing any work in this situation. It is not at all easy to remain motivated under these circumstances. Give yourself some time, keep very small and doable targets for yourself and keep doing small tasks. Once you accomplish any small task, say reading one good article, you will get a sense of achievement which would motivate you further. I would also recommend that you engage in a hobby-cooking, painting etc., which can help you release your anxiety. Also do some stretching exercises whenever you feel too anxious.",
      "author": "asharma31",
      "created": 1589911558,
      "upvotes": 1,
      "replies": {
        "fr5pjug": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5pjug/",
          "text": "I’m can say that I’m now an uncertified masterchef since making cooking as my daily dose of happiness throughout lockdown. I thought that it could help in getting me motivated which it did, but to try out new recipes each day. It didn’t help to get me back on my work at all. \n\nWhenever I did try to sit at my desk to start working, I’d start having anxiety attack and terrible headache which would make me feel sleepy and spent the rest to the day sleeping. I can’t remember how many boxes of paracetamol have I consumed since the start of lockdown.\n\nI will again tomorrow and write at least few lines. I hope I could do more but I’m gonna take it one step at a time. \n\nThank you for your kind words.\n\nStay safe. 💕",
          "author": "ConstantAide",
          "created": 1589912495,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fr62za4": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr62za4/",
      "text": "I have found Susanna Harris and [her journey](https://vimeo.com/286214085) to be inspiring.",
      "author": "drarch",
      "created": 1589919012,
      "upvotes": 1,
      "replies": {}
    },
    "fr63957": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr63957/",
      "text": "Videos in this thread:\n\n[Watch Playlist &#9654;](http://subtletv.com/_rgmc5uo?feature=playlist&nline=1)\n\nVIDEO|COMMENT\n-|-\n[http://www.youtube.com/watch?v=w3EheJhCKAk](http://www.youtube.com/watch?v=w3EheJhCKAk)|[+9](https://www.reddit.com/r/AskAcademia/comments/gmc5uo/_/fr3c1kw?context=10#fr3c1kw) - Sending you a virtual hug! You can totally do this!  I've been in exactly this situation. Here are some things that helped me:   -watch YouTube videos about how to study with depression.   is a good one   get into the habit of sitting at your desk an...\n[http://www.youtube.com/watch?v=snAhsXyO3Ck](http://www.youtube.com/watch?v=snAhsXyO3Ck)|[+1](https://www.reddit.com/r/AskAcademia/comments/gmc5uo/_/fr5fayt?context=10#fr5fayt) - I think anyone who has done a Ph.D. has felt some version of this at some point, so you are not alone. It's hard, but we're here for you. Most of my comment will be centered around advice that might help. A lot of good advice has already been shared,...\n[The Monti Video Series: Susanna Harris](http://www.vimeo.com/286214085)|[+1](https://www.reddit.com/r/AskAcademia/comments/gmc5uo/_/fr62za4?context=10#fr62za4) - I have found Susanna Harris and her journey to be inspiring.\nI'm a bot working hard to help Redditors find related videos to watch. I'll keep this updated as long as I can.\n***\n[Play All](http://subtletv.com/_rgmc5uo?feature=playlist&ftrlnk=1) | [Info](https://np.reddit.com/r/SubtleTV/wiki/mentioned_videos) | Get me on [Chrome](https://chrome.google.com/webstore/detail/mentioned-videos-for-redd/fiimkmdalmgffhibfdjnhljpnigcmohf) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/mentioned-videos-for-reddit)",
      "author": "Mentioned_Videos",
      "created": 1589919150,
      "upvotes": 1,
      "replies": {}
    },
    "fr67jvq": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr67jvq/",
      "text": "I'm so sorry you're going through this. Though you're quarantining alone, you are definitely not alone in feeling this way or being in this situation\n\nThe other commenters have covered most of it, but I wanted to add a few things. \n\n1. Your mental health is your top and only priority right now. Set aside your Ph.D.  and any thoughts / concerns about it for now. It sounds like your advisor is really understanding, so they will support a mental health break. \n2. Please, please, please seek counseling. It will give you an outlet to talk about what you're feeling / experiencing that won't be 'burdening' someone else. That's their job. If you don't have access to remote counseling through your university or health provider, there are chat services and crisis numbers that you can use. Don't ever be afraid of calling a  crisis number just because it feels like you're not in crisis. You need someone to talk to, and that's their entire purpose. However, I do highly suggest you find someone who you can get to know and speak to on a consistent basis. It has been a saving grace for me during this time.\n3. Go outside. Even if its just on your front porch for 5 minutes. Work your way up to taking a walk around the block. Wear a mask if you're worried about it, but they are finding the rate of transmission outdoors is very low (see the [UC Davis website](https://health.ucdavis.edu/health-news/newsroom/tips-for-enjoying-the-great-outdoors-safely-during-covid-19/2020/04) for more info). Sunshine and a little bit of exercise (even just a short walk) are incredibly important when it comes to mental health.\n4. Once you find a more stable mental state, ease your way back in to working. I know it sounds counterintuitive, but the best way to defeat anxiety is to face the situations that make you anxious. Anxiety is a self-reinforcing system. When you avoid something you are afraid of, your anxiety takes that as a sign that you were right to be afraid of it. The more you avoid it, the scarier it becomes. The best way to break out of that cycle is to do small things to ease your fears. Someone else mentioned just sitting at your desk. That's a great way to start. Maybe do something fun (painting, eating lunch, knitting, etc) while sitting there so you associate good things with your desk.",
      "author": "banamana27",
      "created": 1589921286,
      "upvotes": 1,
      "replies": {}
    },
    "fr6cet5": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr6cet5/",
      "text": "You can dm me and we can chat, have conversations. I will free up some time for you.",
      "author": "accoustian",
      "created": 1589923740,
      "upvotes": 1,
      "replies": {}
    },
    "g18g26b": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/g18g26b/",
      "text": "Hi, same here. I lost my track of time in the last months of this pandemic. I am still strugling to work and to think on my study. Frankly, I feel fine when I do something fun except writing. I moved the workplace, talked to friends, asked for advices, tried Pomodoro technique, and even joined thesis camp. Those tricks helped a bit. But, when back to the writing then the attack is back! \n\nThen I trick my mind! I keep telling my mind that writing is fun! And it is! No matter what the other say coz I have my own pace!",
      "author": "jk3wbowo",
      "created": 1597253174,
      "upvotes": 1,
      "replies": {}
    },
    "fr4eknf": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4eknf/",
      "text": "Maybe you are in the wrong field.  True academics want isolation.",
      "author": "tonymaric",
      "created": 1589885712,
      "upvotes": -11,
      "replies": {
        "fr4s30c": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4s30c/",
          "text": "'True academics' collaborate. All the time. Please stop making others feel awful.",
          "author": "Cleon_I",
          "created": 1589895750,
          "upvotes": 3,
          "replies": {}
        },
        "fr4kv0b": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4kv0b/",
          "text": "😔",
          "author": "ConstantAide",
          "created": 1589891018,
          "upvotes": 1,
          "replies": {
            "fr5624i": {
              "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr5624i/",
              "text": "Ignore that comment, OP. Isolation is not normal for humans. And choosing to be isolated to work and focus is different than being forced to isolate due to a global pandemic. \n\nOne thought: any way you could take a brief leave of absence? Perhaps this would allow you to focus on getting your mental health back on track without the stress of the PhD for a bit. I had to do this at one point during my program (it was a 6-8 week break) and it helped a lot. I also suggest getting a therapist if you can - there are some virtual options out there right now. \n\nI’m sorry you are going through this. Good luck!",
              "author": "mirabelle7",
              "created": 1589903137,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fr4mxqa": {
      "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4mxqa/",
      "text": "[removed]",
      "author": null,
      "created": 1589892496,
      "upvotes": -11,
      "replies": {
        "fr4o4r3": {
          "link": "/r/AskAcademia/comments/gmc5uo/i_constantly_have_panic_attack_whenever_i_sit_in/fr4o4r3/",
          "text": "I never blamed anyone in my post. I moved away from everyone knowing that I’m draining them. I know I have issues, that’s why I’m here to seek help. I’m tired of being like this. \n\nMany comments here have been uplifting, but yours is not one of it. You may be right on few things, but having to put it so bluntly like that is making me feel even worse about myself. 😔\n\nNonetheless, I appreciate your honest comment. \n\nStay safe.",
          "author": "ConstantAide",
          "created": 1589893291,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}