{
  "sid": "pqd0rs",
  "link": "/r/AskAcademia/comments/pqd0rs/figures_in_research_statement/",
  "title:": "Figures in research statement",
  "text": "I am writing an application for an assistant professorship in the social sciences at an R1 and working on my research statement. I have a section about the main theoretical framework I use, but it's hard to describe it without including a diagram. Is it ok to make a diagram of the framework to include in the statement? This is a framework identified by a well-known author, so it would not be original work (I would of course cite everything)",
  "author": "hellokoalaa",
  "created": 1631928015,
  "updated": 1634078956,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hda6qsu": {
      "link": "/r/AskAcademia/comments/pqd0rs/figures_in_research_statement/hda6qsu/",
      "text": "I have seen figures in a research statement before and I don’t think it’s a problem per se. I would be more concerned about including something so complex in a research statement that it needs a figure to be explained. Research statements usually need to be broad enough so everyone in the department can follow along (more or less).",
      "author": "antonia90",
      "created": 1631930252,
      "upvotes": 5,
      "replies": {
        "hdad4il": {
          "link": "/r/AskAcademia/comments/pqd0rs/figures_in_research_statement/hdad4il/",
          "text": "That makes sense. I don't think framework itself is not that complex, it's just that it's not intuitive to understand from written description - the framework figure is essentially three boxes of generalized concepts feeding into another box and arrows between the three boxes showing how they connect.",
          "author": "hellokoalaa",
          "created": 1631933548,
          "upvotes": 2,
          "replies": {
            "hdd85bp": {
              "link": "/r/AskAcademia/comments/pqd0rs/figures_in_research_statement/hdd85bp/",
              "text": "I've seen lots of this kind of thing in research statements. I have also seen Venn diagrams showing how the researcher is doing work at the intersection of 2 fields, for instance-- e.g., paper A and B belong to field 1, paper C and D belong to field 2, and paper E belongs to both. This can help show a \"coherent\" research agenda for people whose work spans multiple fields.",
              "author": "DeskAccepted",
              "created": 1631992847,
              "upvotes": 3,
              "replies": {
                "hddaq8u": {
                  "link": "/r/AskAcademia/comments/pqd0rs/figures_in_research_statement/hddaq8u/",
                  "text": "Oh that is a great suggestion! My research is super interdisciplinary (science and policy phd program) so that would be perfect. Just need to figure out how many circles I can keep it to lol",
                  "author": "hellokoalaa",
                  "created": 1631993915,
                  "upvotes": 1,
                  "replies": {
                    "hddbnb6": {
                      "link": "/r/AskAcademia/comments/pqd0rs/figures_in_research_statement/hddbnb6/",
                      "text": "Three is the most you can reasonably show. I also tend to think that having more than 3 streams of research will make you seem unfocused, so even if there really are more than 3 you should find a way to consolodate.",
                      "author": "DeskAccepted",
                      "created": 1631994293,
                      "upvotes": 1,
                      "replies": {
                        "hddcpzj": {
                          "link": "/r/AskAcademia/comments/pqd0rs/figures_in_research_statement/hddcpzj/",
                          "text": "I was thinking the same. Thank you!",
                          "author": "hellokoalaa",
                          "created": 1631994739,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hda3eun": {
      "link": "/r/AskAcademia/comments/pqd0rs/figures_in_research_statement/hda3eun/",
      "text": "I have a figure in my research statement! None of the job apps I’ve applied for have closed yet but the internal people who reviewed my materials liked it. However, I would recommend heavily modifying the figure to make it clear about your own unique scholarship and contributions versus from another paper.",
      "author": "Advanced-Doughnut-61",
      "created": 1631928548,
      "upvotes": 2,
      "replies": {
        "hda606k": {
          "link": "/r/AskAcademia/comments/pqd0rs/figures_in_research_statement/hda606k/",
          "text": "Modifying the figure for my research is a great idea! I was already thinking of doing the same in my dissertation introduction but I didn't think to use it in the research statement. Thanks for the suggestion!",
          "author": "hellokoalaa",
          "created": 1631929878,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}