{
  "sid": "n85bzc",
  "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/",
  "title:": "Professors with ADHD: What made the difference for your success, versus those of your colleagues with ADHD who didn't end up making it somewhere? What advice and reassurance do you have for grad students with ADHD worried about their own future?",
  "text": "I'm  a grad student with ADHD who's in need of a little hope.  I'm  definitely not actually planning to go into academia, myself, but I see  professors as people who have been comparatively successful at taming  the beast that is academia in their own lives, and if I don't actually  have to close the door on academia I certainly would like to make sure  of that.  I'm not feeling super confident about my own ability to do so  right now; I'm medicated and have a therapist (I also have a lot of  trauma I'm working through), but I've had a terrible string of a couple  of small safety incidents in the lab that's left me rattled, I've  decided that I'm definitely not cut out for bench science though I know  I've got solid computational skills, and the energy it takes to manage  my ADHD saps my energy to do - well, my work, and live a full life.  The  pandemic is not helping by any means.  It has shot a massive hole in my  self-confidence and motivation, which I spent much of graduate school  trying to build after a pretty bad first few years and then switching to  an advisor who actually worked well with me, and there's a pretty good chance I think academia is more of a forbidding hellscape than it actually is at this point, because at this point it feels like a forbidding hellscape that I will never be smart or mentally agile enough or have enough executive functioning to contend with.\n\nI  know there are profs on here with ADHD and it always fills me with awe  that anyone with ADHD is able to manage to be a professor, because from  my position I feel I'm barely managing to keep up with even the middle  of the rest of the grad student pack, if I'm even doing that at all.\n\nThose  who've \"made it\" with ADHD, what do you think the biggest factors in  your success were, what do you see hindering the progress of students  who have ADHD who aren't successful, and what wise words of advice  and/or reassurance would you like to share?",
  "author": "scatterbrainedgrad",
  "created": 1620530690,
  "updated": 1634080615,
  "over_18": false,
  "upvotes": 236,
  "upvote_ratio": 0.97,
  "comments": {
    "gxgrovk": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgrovk/",
      "text": "I'm not sure I can answer this question as the answers I'd give are very tailored to my own experiences.\n\nBut, I'll try. The 'big breakthrough' for me was learning to work with, rather than against, my own rhythms. This took decades. But, a big part of it that you might begin is a system of scheduling that charts out 'big goals,' but leaves plenty of leeway on a moment to moment level. \n\nThe timeframe might not work for you, but I've found weekly schedules within larger projects works really well. So, if I know I want to submit an article in three months, I can chart backwards from there. I know how many words I want to average a day and how many total I want written by the end of the week. So long as I'm hitting those goals, I can take a day, an hour, or a week off as I need to. \n\nPlay to your strengths and build responsibility and accountability into your systems. For me, that's let me fuck up, be myself, and go off on the tangents *I need*, while still hitting the milestones my job *requires*.",
      "author": "WrestlingStuffGuy",
      "created": 1620534991,
      "upvotes": 82,
      "replies": {
        "gxh2tr9": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxh2tr9/",
          "text": "I've read this countless times but I can't never put this in practice. I've tried making checklists/plans using a large number of methods and apps but... I never read them. Even for writing a paper. I make an outline and... How am I supposed to use it? Stop writing every one line and re read what I'm supposed to be writing, stopping the flow?\n\nHow do people follow plans/checklines *exactly* in practice? Why don't they explain it?",
          "author": "tAway_552",
          "created": 1620543321,
          "upvotes": 12,
          "replies": {
            "gxh3mmv": {
              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxh3mmv/",
              "text": "> How do people follow plans/checklines exactly in practice?\n\nI don't know, I'm suggesting something very different.\n\nWhile stressing again that I can only speak from my own experiences, I'll repeat that my suggestion is to break big goals into *as-small-as-manageable* units for yourself and then allow yourself freedom within that structure to work *with* yourself, instead of against it.\n\nSo, for me, over the years, I've found that my 'bees buzzing in the brain' periods tend to last for a day or two and my periods of flow-like working last a half day on average, usually showing up in the afternoons. I have my 'big' goals (article submitted to X journal by Y date) and I build my 'structure' from there (1k words a week).\n\n*Within that week,* I might find myself working and writing 750 words in one day... then skipping three days to stare at paint drying, engage in intense bouts of self-loathing, and eat ice cream with my kids ... then I wrap up with 100 words a day the next three days to end up with... 1050 words for the week. Hurrah for me, I have accomplished my goals and will open a beer! *Or whatever*.\n\nThe point isn't that you follow a pattern like mine - perhaps your timelines only work out at months or maybe you need to do daily by the hour... I can't say. *Maybe none of this works for you*. But, what I can say is that the *best* tip I have is to learn the rhythms of your own work cycles and build up a system that holds you accountable *within those rhythms*.",
              "author": "WrestlingStuffGuy",
              "created": 1620544026,
              "upvotes": 28,
              "replies": {
                "gxh41cx": {
                  "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxh41cx/",
                  "text": "And how do you follow your \"write x words per day\" schedule then?",
                  "author": "tAway_552",
                  "created": 1620544387,
                  "upvotes": -2,
                  "replies": {
                    "gxh4qyy": {
                      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxh4qyy/",
                      "text": "I have edited my comment to explain my approach in detail. If that still doesn't make sense to you, I'm not sure what to say; I've made clear that this is *my experience* and I am not trying to generalize, perhaps it is just not of use to you. I wish you nothing but luck.",
                      "author": "WrestlingStuffGuy",
                      "created": 1620545029,
                      "upvotes": 17,
                      "replies": {}
                    },
                    "gxhg7zw": {
                      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhg7zw/",
                      "text": "Say today you want to write 50 words. This is your goal. You would like to have it done, but the catch is that you don't want to do it---Trap\n\nYou do not feel like doing it, you say you will start in another 10 minutes.--Trap.\n\nYou will think, today is gone so let me start tmw early and I will write 50 + 150 words to make up--Trap.\n\nTip: Learn about your traps.\n\nHow to write x words per day?  \nSit in front of your system. Take a deep breath. Think about what you have to write and then write. That's it.\n\nNo thinking about feeling to do or not. No thinking about oneself, think about what you have to write.",
                      "author": "Turbulent_Animator65",
                      "created": 1620556013,
                      "upvotes": 8,
                      "replies": {
                        "gxhizfo": {
                          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhizfo/",
                          "text": "But writing is different. You need to find out what you need to write. Which is what resulted in me starting at screen for a whole day without writing a single word after having blocked the Internet connection not to be distracted",
                          "author": "tAway_552",
                          "created": 1620558575,
                          "upvotes": 1,
                          "replies": {
                            "gxi0s17": {
                              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxi0s17/",
                              "text": "To \"find out what you need to write\" you can pre-write, outline, take notes, make a mind map, etc. There are tons of strategies for *thinking*, which is what finding out what you need to write is. If you don't know how to start thinking, then writing isn't something you need to worry about right now. When I don't know what to write, it usually signals to me that I haven't read enough, haven't spent enough time analyzing my data, or that I need to sit down with a friend and colleague and talk it out to put some of my errant thoughts into a coherent narrative. Once that's done, I pre-write. From pre-writing, I usually move pretty seamlessly (and often unconsciously) into free-writing my first draft. The rule of free-writing is no editing. Whatever comes into my head when I look at the pre-writing I did goes on the paper, whether it makes sense or is grammatically correct or feels slightly off-topic. Then I come back a few days later and revise my free-writing into a more formal draft and voila, first draft is finished and it was only a little bit painful.",
                              "author": "riotous_jocundity",
                              "created": 1620570614,
                              "upvotes": 9,
                              "replies": {
                                "gxq21pz": {
                                  "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxq21pz/",
                                  "text": "> There are tons of strategies for *thinking*\n\nI was wondering if you can share some tips, resources, or something that inspired you as a particular good strategy for thinking.",
                                  "author": "specific_account_",
                                  "created": 1620737656,
                                  "upvotes": 1,
                                  "replies": {}
                                },
                                "gxi3y7j": {
                                  "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxi3y7j/",
                                  "text": "Actually I can write methods and results decently enough and fast (almost) enough. Even if the flow, as in the logical order of the paragraphs is usually sub par. And after 4 or 5 rewrites I can even get that to work! \nIt's introduction and discussion that drive me crazy. And I mean that the last paper I wrote as a first author resulted in screaming with Co authors and in me saying \"if you really like that shit so much take first authorship and finish it yourself\". Which is how it ended. \n\n\"delve more into...\". \"give an overview about... \". \"contextualise your results in the light of the current research without repeating the introduction...\". That's what drives me crazy. All these fuzzy words that cannot be translated into actions. \"think like you were thinking differently\" wtf? Seriously?",
                                  "author": "tAway_552",
                                  "created": 1620572217,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            },
                            "gxhyart": {
                              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhyart/",
                              "text": "Also, if you are still unable to then you have to think about why you want to do something that is so difficult for you? Is it to get a degree to have financial stability? Or why do you do what you are doing?  \n\n\nPersonally, I like to remind myself that if I don't really really try and make it work, my chances of being not well off in the future are very high. That I might have a high probability of ending up having a mediocre life because of a lack of skills. And tell me that life is not fair. This is how I persist through things that are extremely difficult but have to be done.",
                              "author": "Turbulent_Animator65",
                              "created": 1620569287,
                              "upvotes": 5,
                              "replies": {
                                "gxi0h3d": {
                                  "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxi0h3d/",
                                  "text": "I don't! I never got a single grade that was even near passing in composition during high school. To my brain it does not make sense that you should be able to write about something that you cannot think about (I cannot spell it out exactly how it works... But it's like that).\n\nSo I got a PhD in a math-based topic. Swearing I would not waste a single other day of my life writing. And... For reasons universities require you to spend much, much more time writing than working.",
                                  "author": "tAway_552",
                                  "created": 1620570460,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "gxhxs97": {
                              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhxs97/",
                              "text": "You need to find out what you need to write  \n\n\nThat's the first step. Also you need to know what you are missing to finish the goal.\n\nNext time, do not move unless you write 10 words. Make a deal, I will sit here and stare at the screen or can write 10 words and get out.",
                              "author": "Turbulent_Animator65",
                              "created": 1620568996,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gxi91el": {
              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxi91el/",
              "text": "I learned to do what works for me, not what the internet says works. What worked for me in grad school was getting one of those palm-sized Field Notes softcover dot grid notebooks and keeping it with me at all times and literally putting everything, even things like “eat lunch” in it as a checklist. It was ugly and it didn’t follow any of the “bullet journaling” rules but it worked well for me. Now I’m at my desk all day so I just use Asana. \n\nTraditional outlines don’t work for me for writing. I write out my “outline” in chunks of paragraphs and then move things around to see what I think works best.",
              "author": "kayelar",
              "created": 1620574777,
              "upvotes": 3,
              "replies": {}
            },
            "gxkp17b": {
              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxkp17b/",
              "text": "For me, fighting ADHD is all about managing the battle between \"the urgent\" and \"the important\". Urgent things are whatever my brain is telling me need to be done RIGHT NOW. The problem with ADHD is that basically everything in your head becomes labeled URGENT, even though it's probably not. Important things tend to be larger and need to be broken down into smaller subtasks. It often doesn't really really feel like these subtasks are URGENT since they're just small pieces of something bigger.\n\nI have found that setting up a physical [Kanban board](https://en.wikipedia.org/wiki/Kanban_board) at my desk just above my monitors (really just sticky notes on the wall) seriously accelerated my ability to get the \"important\" stuff done. I think the reason for this is that the rhythm for my energy and the rhythm for my attention tend to be completely out of phase. Whenever I'm most fired up to work on something is precisely when I'm most likely to go off on a tangent or work on the first \"urgent\" issue I see rather than an \"important\" issue that might be at the back of my mind.\n\nThe Kanban board is the perfect way to hijack my brain's idiosyncrasies and I end up sitting down at my computer, looking at the board, and picking one of the tasks rather than coming up with what I want to do on the spot. This really helps me from going down rabbit-holes during my most productive times. Maybe it could work for you too!",
              "author": "johnnydaggers",
              "created": 1620621612,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gxgskbc": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgskbc/",
          "text": "I like this.  How would you approach managing a student of yours after finding out they have ADHD?  Also, how would you suggest I approach talking to an advisor who, although supportive, generally sees my tendency to go off on tangents as something I need to be gently herded away from (usually in the interest of getting the paper out ASAP, which is reasonable, but man does it run in the face of my needs for autonomy)?\n\nAlso, in general, what tips do you have for communicating with a professor who wants to be supportive and is in general an excellent mentor, but is absolutely most definitely neurotypical (and organized, efficient, and productive as hell) and does not have children with the condition as far as I know, so probably does not quite understand the beast that is ADHD?\n\nAdmittedly, probably the other huge problem I run into here is the idea of \"playing to my strengths\" when I've been brought so low by my experience with ADHD in grad school that I have a hard time grasping what my strengths actually are in the context of research (I asked my advisor this question once, and she said \"you're organized and communicate well\" - I'm absolutely not organized and I think my communication skills are dubious, and do I really suck at what I do scientifically?!).  What did you find some of your more general strengths were, and what strengths do you see researchers with ADHD in general having?",
          "author": "scatterbrainedgrad",
          "created": 1620535526,
          "upvotes": 7,
          "replies": {
            "gxh5jtf": {
              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxh5jtf/",
              "text": "I'll try to answer as honestly as possible.\n\n> How would you approach managing a student of yours after finding out they have ADHD?\n\nIt doesn't really affect me one way or another, I don't try to force my own views on others; so, as long as they're meeting my expectations, it's not an issue.\n\n>Also, how would you suggest I approach talking to an advisor who, although supportive, generally sees my tendency to go off on tangents as something I need to be gently herded away from (usually in the interest of getting the paper out ASAP, which is reasonable, but man does it run in the face of my needs for autonomy)?\n\nSo, this is a ***really hard*** question. With the knowledge I have, I can't answer it. *Because*, this could be *exactly* what your advisor should be doing - reminding you of big deadlines, keeping you 'focused,' etc. *Or*, it could be over-management that isn't allowing you to work in the ways you need. It's really impossible for me to say!\n\n> Also, in general, what tips do you have for communicating with a professor who...\n\nI don't know as I never encountered this. I was an older PhD student and while everyone who meets me *knows*, I had my systems in place and so performance was never an issue. That *and* my advisor had personal experience... Sorry, I just can't say!\n\nI *think* I'd highlight outcomes. I'd sort of point out 1. here is where I am. 2. here is how I work. 3. here is demonstrated evidence of how I'll meet what we need. 4. here are areas where I might get lost and you might help. By putting 3 ahead of 4, you don't let it become a piling on session.\n\n>What did you find some of your more general strengths were, and what strengths do you see researchers with ADHD in general having?\n\nIt made me really sad to hear that you've been brought \"low,\" by this. I get it. I truly do. But, I always try to view this as a gift of sorts. I can process information incredibly quickly, often along multiple axes at once. Not perfectly and I'll miss things, I'll make mistakes, I'll act 'rashly' and have intense emotions; that's a part of it. But, *still*, there's so much that's special about having ADHD - how you can focus, how you can leap between ideas, how you can change intellectual gears on a dime... *if* you can learn to work with how your mind works, there's so much there that you can harness.\n\nI know this sounds like some GOOP/MLM ad about essential oils and mystic self-realization, but I don't mean it like that. Your mind *works* in a certain way; instead of trying to force yourself to do so, figure out what matters, meet (exceed!) those standards with your gifts, and then fuck off and stare at a wall or spin around in circles till you fall over. You know, the good ADHD shit. :)\n\nSorry, I rarely talk about this, feel free to keep asking questions or DM me down the line. I can't promise I'll be able to answer all your questions, but I'll try.",
              "author": "WrestlingStuffGuy",
              "created": 1620545761,
              "upvotes": 12,
              "replies": {
                "gxk96bi": {
                  "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxk96bi/",
                  "text": ">Your mind works in a certain way; instead of trying to force yourself to do so, figure out what matters, meet (exceed!) those standards with your gifts, and then fuck off and stare at a wall or spin around in circles till you fall over. You know, the good ADHD shit. :)\n\nReading this felt reassuring.  Thanks.",
                  "author": "scatterbrainedgrad",
                  "created": 1620611768,
                  "upvotes": 1,
                  "replies": {}
                },
                "gxhnhz7": {
                  "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhnhz7/",
                  "text": "> and then fuck off and stare at a wall or spin around in circles till you fall over. You know, the good ADHD shit. :)\n\nThe more and more I read about ADHD, I am getting increasingly certain I have it too, as I definitely find these activities quite interesting too :)) Thanks for mentioning that.",
                  "author": "ImmanuelK2000",
                  "created": 1620562302,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gxgt1tc": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgt1tc/",
      "text": " r/ADHD would literally ban me for saying this because they don't allow you to reflect on ADHD positively, but honestly I sometimes feel like I don't know how people *without* ADHD do this job! So many different things pulling on your attention. It's nice to constantly have \"excuses\" to not do a specific task at that moment and do something else that is actually still legitimately productive at some level.\n\nThe worst days for me are when all I have to do is one experiment...I end up starting it at 4:30PM, it takes me two hours longer than I expected, I miss the last train home, and totally forgot I had scheduled a happy hour with a co-worker even though I had been looking forward to it all day somehow??? Those brought out the absolute worst of my ADHD, but those schedules are long gone as a professor. A schedule that keeps me bouncing around makes me much more productive.\n\nMy personal biggest ADHD issue is starting *anything*, but as I've gotten more responsibility people come to me now with tasks - hey how do I do this, what do you think of this data etc - so my day is no longer completely dictated by my own ability to reach out to someone or start every task \"from nothing\" which is how I felt as a grad student. \n\nNot everyone reacts like this, and it is certainly overwhelming, and I drop the ball all the time, but I've found adding layers to my day suits my ADHD more than competes with it.\n\nAlso, adderall.",
      "author": "pastaandpizza",
      "created": 1620535826,
      "upvotes": 124,
      "replies": {
        "gxgu5dn": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgu5dn/",
          "text": "One of the tough things that I'm contending with is that it takes SO MUCH EXECUTIVE FUNCTIONING to be a bench scientist - there are so many little moving parts to every experiment: lab safety, running the protocol properly (checklists are my friend), keeping your samples uncontaminated (if that's a significant hazard), making sure you've properly turned machines on and off...  I usually execute most of my tasks properly, but they screw up because I forgot one step, usually - and that step makes me need to scrap the entire protocol because I messed it up, or winds up with me being yelled at (which further damages my confidence).\n\nI've never had a problem starting anything, thankfully, but once I get anything started, especially if it's at the bench, I get incredibly anxious about making sure I've done everything right, because I've eaten it real hard in the past if I've forgotten even the slightest thing.  I have some pretty significant issues about this, actually.\n\nComputational work is definitely detail-oriented, no doubt, but you're not going to blow up the lab or waste expensive chemicals/parts or break a machine if you screw up.  Worst you could do is accidentally schedule a bazillion jobs or code an infinite loop and get an angry email from the cluster admin, and then you just have to kill the job, fix it, and start it over.  I have never been yelled at or gotten nervous over my computational work (although there was the time the cluster admin sent me an email about taking up a massive amount of cluster real estate with my data, but that was easily fixed and I have a good relationship with him).\n\nOne of the best decisions I made in grad school was teaching myself to program.",
          "author": "scatterbrainedgrad",
          "created": 1620536536,
          "upvotes": 29,
          "replies": {}
        },
        "gxic230": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxic230/",
          "text": "I think the key here is that ADHD is different for everyone and while you find it helpful (and only while medicated), other people with the exact same condition are not going to find it helpful.\n\nMy partner has pretty severe ADHD and is not currently medicated, and I don’t know how he lived to be this age. He has really serious difficulty reading things properly, so any time he needs to fill out a form or submit anything (including exams worth 100% of his grade!), he doesn’t get it right. Washing sits in the machine for days. Keys and wallets lost. Meetings and deadlines missed. If I distract him while he’s doing *anything* then he stops and completely forgets that task. Proofreading is kryptonite.\n\nI try to keep my finger on the pulse of the most important stuff and set reminders, but still, damn it must be a hellish mind to have. I can’t imagine he would thrive if he had multiple things pulling at his attention.",
          "author": "officially_anxious",
          "created": 1620576280,
          "upvotes": 7,
          "replies": {
            "gxipla6": {
              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxipla6/",
              "text": "Yes it is very individual! Mine is not as severe although I do suffer from almost everything you described and completely see how the same situation would be debilitating for someone else. For something like: \n\n> Proofreading is kryptonite.\n\nI 100% agree - either I don't proofread well enough and I say something completely nonsensical or writing a simple 3 line email could take me *hours* because I read and re-read and re-write and get hyper fixated on it. But now my position makes it much less awkward for me to just walk over to someone's office or give them a call instead of a writing an email which has saved me a lot of grief. As a grad student either of those things would have been inappropriate, and the unbalanced power dynamics made writing emails that much harder. So it's not like the problem is gone, but the position has provided release valves for a lot of my pressure points.",
              "author": "pastaandpizza",
              "created": 1620582942,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gxhkir4": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhkir4/",
          "text": "Wow, I never thought about it this way, but you’re absolutely right! The constant switching between tasks and the novelty of projects is what keeps me moving forward (albeit very slowly oftentimes).",
          "author": "CuriousCat9673",
          "created": 1620559932,
          "upvotes": 8,
          "replies": {}
        },
        "gxi8cdz": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxi8cdz/",
          "text": "I really dislike that sub. I have ADHD and I’m medicated but if you even *suggest*  that you had luck helping your symptoms with supplements or anything that isn’t amphetamine they act like that is physically impossible. It’s so frustrating because there have been times in my life I’ve done fairly well with very small doses of my meds and mostly supplements, like when my work loads were lighter.",
          "author": "kayelar",
          "created": 1620574426,
          "upvotes": 7,
          "replies": {
            "gxig6m4": {
              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxig6m4/",
              "text": "They also dislike people reporting bad experiences, or fear due to friends' bad experiences.\n\nClose friend was on Ritalin. She reported feeling emotionally vacant. We share a few other traits, which makes me afraid same would happen.",
              "author": "Hoihe",
              "created": 1620578322,
              "upvotes": 1,
              "replies": {
                "gximpoy": {
                  "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gximpoy/",
                  "text": "Worrying about the side effects of medication is totally justified. That being said, particularly with stimulant ADHD meds, you can notice the side effects very quickly and because the medication is short acting they don't last long, so you won't be stuck with any particular feeling for very long.",
                  "author": "pastaandpizza",
                  "created": 1620581534,
                  "upvotes": 4,
                  "replies": {}
                },
                "gxm4yb1": {
                  "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxm4yb1/",
                  "text": "As someone else replied, the great thing about ADHD meds is that you don't have to wait for very long to see the side effects. There are downsides to every ADHD med IMO, but for me, the one that's worked the best long-term is Zenzedi. But everyone is so different. For me, Ritalin made me extremely anxious, but didn't cause a crash at the end of the day. My husband refuses to go on any ADHD med ever again because he also got the \"emotionally vacant\" feeling, but I haven't had that experience. Dosage can also affect that particular feeling. \n\nI get the fear of medication due to friend's experiences. I have the same thing with SSRIs, particularly since they're so hard to come on/off. But if you have been diagnosed with ADHD, a very low dose stimulant may help you out. However, I've found that some supplements (Tyrosine, Dopa Mucuna, B vitamins, a few others) worked very well for me as an alternative to stimulants during certain lower-stress periods of my life.",
                  "author": "kayelar",
                  "created": 1620658770,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gxi9z7r": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxi9z7r/",
          "text": "I second each and every point made here.\n\nThe only thing I would add is to be completely open and honest with your advisees about your ADHD. For me, this encourages them to be less timid and give me extra reminders/prompts when needed. In a way, this makes the relationship more symbiotic.",
          "author": "Sodomy_J_Balltickle",
          "created": 1620575254,
          "upvotes": 3,
          "replies": {
            "gxiaod5": {
              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxiaod5/",
              "text": "I always felt like everyone thinks ADHD is made up and that everyone thinks they have it, but I’m in the workforce now and have learned this isn’t the case. I’ve had to tell my boss about this and she’s been great with creating extra checklists and giving me extra reminders to help me manage it.",
              "author": "kayelar",
              "created": 1620575598,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gxhuqby": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhuqby/",
          "text": "Nailed it.",
          "author": "disgruntledmuppett",
          "created": 1620567121,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gxgmt0o": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgmt0o/",
      "text": "Hi! I was diagnosed post tenure. I always knew I was different but didn't know why. The biggest factors in my success have been: being able to focus on what I care about, making my own schedule that works with my natural rythyms, and being able to work in hyperfocused states during the semester, and changing what I focus on during the breaks that we get intersemester. Being a professor has been ideal for me because i care about a lot of obscure things, and no other job in the world gives this level of time and energy flexibility. \n\nBest thing I can say is accept you're going to fuck up sometimes. You're going to be late to that meeting, or forget it completely. Youre going to miss some deadlines. Do your best, be apologetic, use the pomodoro method, and make sure anyone who sends you a meeting invitation puts it as a calendar appointment. In fact put everything important as a calendar appointment. Keep up with exercise and a good diet. Get plenty of rest. Sending my best, you got this!",
      "author": "yourmomdotbiz",
      "created": 1620532250,
      "upvotes": 86,
      "replies": {
        "gxgo4t7": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgo4t7/",
          "text": "Thanks!  Reading this helps me reframe my problems a little more as an issue of finding it increasingly more difficult to mask.  I think my ability to mask as neurotypical has already been slipping for a bit and my labmates have noticed what's up to some degree, and I've disclosed that I have working memory deficits to a few of them, and my advisor and our staff scientist are aware of my ADHD, though as far as I know everyone else in the lab appears to be neurotypical.\n\nI am definitely apologetic (to the point where I'm feeling like I look pretty pathetic from the amount of apologizing I'm doing, to be honest), use my calendar heavily, and actually do manage to hyperfocus on work pretty well so I'm able to do it for long stretches at a time, but this still doesn't seem to be enough just because of the volume of and nature of the work.  I've missed a few deadlines, though they're mostly self-imposed.  Exercise and a good diet have suffered in part because, as a mostly-computationalist, I do mostly work from home (although our offices are reopening and I'm hammering out a schedule with my officemates), and because I've very seldom found exercise enjoyable to any extent, combined with the near-complete lack of appetite from stimulants.\n\nI think I've now reached the point where I don't have enough energy to outrun my ADHD anymore, especially because it compounds, and is compounded by, other stressors.",
          "author": "scatterbrainedgrad",
          "created": 1620533000,
          "upvotes": 17,
          "replies": {
            "gxgpwiu": {
              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgpwiu/",
              "text": "I can totally relate to everything you're saying. Adderall has been a big help for me, but as you may have discovered they have their downsides and don't always work well. I'm a woman so hormones are a big issue in their effectiveness, plus my general mood.\n\nIf you find yourself not being able to outrun it anymore, you're doing way too much. It's ok to admit that, and cut out what needs to go (it could be work related, or personal, or whatever). You don't want to end up in a situation were you're able to give 25% effort to four different things and have a meltdown. I still have a tendency to fall into that trap though and I have to reign myself in. \n\nExercise is super important, but it doesn't have to be intense. Whatever you can do to get out of your head and do something physical and fun. I've recently taken up skating, which doesn't feel at all like exercise. Keeps me motivated! Or, just finding anything kinesthetic is really important. \n\nYou're not alone!",
              "author": "yourmomdotbiz",
              "created": 1620533977,
              "upvotes": 10,
              "replies": {
                "gxgr41o": {
                  "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgr41o/",
                  "text": "The funny thing is, when I take stock of what I'm doing, it doesn't really seem like it's that much - I'm working on pretty much just one project at the moment and have no other real obligations.  I have a few personal things, but they give me energy and help me stay connected with my friends, especially in this age of pandemic lockdown.  I'm consequently struggling to figure out exactly what it is that I need to pull back on, especially if it's something that actually bolsters my mental health.",
                  "author": "scatterbrainedgrad",
                  "created": 1620534663,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gxgxjkg": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgxjkg/",
          "text": "This. I mean, I came to academia because there was and is no way I could work the daily grind. So it was this, cult leader, criminal mastermind, or pro video games.\n\nI didn't realize the issue was ADHD until my kid and my Mom (also a prof) got diagnosed. \n\nThere are a lot of different kinds of ADHD, and especially in academia you see it often alongside autism spectrum stuff. But the hyperfocus is often a piece of it, along woth creative question-forming. If your work doesn't get you to hyperfocus, you may want yo change your work...",
          "author": "halavais",
          "created": 1620538964,
          "upvotes": 10,
          "replies": {}
        },
        "gxh2fzm": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxh2fzm/",
          "text": "And how do you manage to do things that you don't care about but are required?\nWhen I'm required to write a paper/report it might take me like 3 days per page",
          "author": "tAway_552",
          "created": 1620542990,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gxgvlho": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgvlho/",
      "text": "I'm a professor with ADD. I was diagnose pretty late so I finish my studies without any help of drugs (Now Aradix (Ritalin) is my copilot)\nBecause of that I developed a system for focus studying that my mother always thought was weird, but work for me. You need to find a method that works for you.\nAnd tell your professor, if you haven't done yet. If you can, explain to him your method for studying, so he can understand your process.\nIf he looks interested in helping, you can even give him information about teaching adults with adhd (there's a lot of resources on internet, you can look for some that make sense to you and givit to him)\nAnd don't be apologetic about adhd, is just something that you live with, and need to learn how to manage. \n\nI found this article and I like the approach \nhttps://www.weareteachers.com/teacher-with-adult-adhd/\n\nPS: My method for studying is to have some white noise on the background (for me was movies that I already have seen in spanish, is my first language so no distraction, or YouTube videos of streets with heavy rain) and a piece of paper and a pen to take notes, mostly questions or opinions about something, related or not what I reading... Generally I need to write the other thing that I'm y thinking of, to clean my head and focus on the task that I need to do. I also 'manage' my medicine, at least aradix let me use it when I needed the most, so I manage the hour of take it according to my schedule, if I don't have classes in the morning I just take the pills in the afternoon and concentrate the effect. I don't know if this can work with your medication, ask your doctor.",
      "author": "TheAndreaDonoso",
      "created": 1620537520,
      "upvotes": 13,
      "replies": {
        "gxgw3u3": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgw3u3/",
          "text": "I forgot to mention... The levels of stress have a huge impact on the adhd, so try to 'relax' a little when you are going to do a heavy task, do some breathing, listen music to calm you down, 'Baja las revoluciones'. If you go in to the lab with your stress by the roof, is probably more certain that you make a mistake. Do things at your own pace (when is possible)",
          "author": "TheAndreaDonoso",
          "created": 1620537886,
          "upvotes": 8,
          "replies": {}
        },
        "gxi9sna": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxi9sna/",
          "text": "I’m medicated but still very ADHD on the meds and I love the white noise/pen/paper method of brainstorming or writing.",
          "author": "kayelar",
          "created": 1620575161,
          "upvotes": 4,
          "replies": {
            "gxia6b6": {
              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxia6b6/",
              "text": "Oh yes... I even have a paper/pen combo when I'm watching a movie... And I'm almost panicking when I'm not able on the movie theater xD",
              "author": "TheAndreaDonoso",
              "created": 1620575352,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gxh7k5b": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxh7k5b/",
      "text": "Well, I wouldn't say I've \"made it,\" but I'm doing ok! \n\nEveryone's advice to work with your own rhythm is spot on.  \n\nI take my pomodoro method one step further and have an app that blocks certain apps on my computer while I'm working, I highly recommend that. Also, I have an email client that compiles all of my email into an app with minimal bells and whistles, and it also keeps me off our web-based email service.  \n\nI see my email at many points through the day, but I only answer three times a day.  Once in the morning, I spend ~30 minutes dealing with email.  Once around 2pm I'll respond to messages that have come in. And then once again around 7 (from home; it's unavoidable). Somedays I skip one (or even 2) of these email sessions, depending on what's in my inbox or how busy my day is. But this helps me massively, because I will go down an email rabbit hole, much in the same way I am writing you a novel now...\n\nAnd definitely find your work rhythm and productivity windows. \n\nMy work schedule is something like this: \n\nWake up and putz around my house talking to and watering my plants while I drink coffee. During this time I'm actually going through all the tings I want to do in the day in my head.  It seems like such a trivial part of the day, but on days where I can't have time to myself in the morning to think and talk to myself, I'm off.\n\nThen I start work, at home, in my PJs most of the time, but I have a dedicated work station at home. Emails always. Then some writing or lecture fixing; any work I need to get done but don't need to be on campus to do.  \n\nThen, I do need to get to campus at some point. So, I shower (sometimes exercise) get dressed and go to work. This is a good little break for me. (This also works out because the custodians who got to campus at like 2 am are now going home for the day, and are just leaving their primo parking spots). When I get to my office/lab I am ready to work again, hopefully.  I typically take a B vitamin (Floradix) here too; its totally anecdotal, but I feel like it helps me focus and to feel less tired. \n\nI try to force myself to take regular breaks for lunch, and I like to go for a walk to get coffee in the afternoons.  \n\nMy point being-- I have a weird work schedule, but it *works* for me. \n\nThe hardest part of productivity for me is that I really want to uni-task. I want to devote all of my time and attention to say, my paper revisions, but that can't really happen because there are classes to teach, and committees to snooze through. When I am struggling, I will look at my calendar and figure out if I can swing a day that I can block out to just devote to the one thing I want to really really delve into.",
      "author": "TourmalineTart",
      "created": 1620547631,
      "upvotes": 10,
      "replies": {}
    },
    "gxgm50u": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgm50u/",
      "text": "Adderall.",
      "author": "Worldly_Might420",
      "created": 1620531872,
      "upvotes": 20,
      "replies": {
        "gxgmrw8": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgmrw8/",
          "text": "I'm on 50 mg/day of Vyvanse, which is the third-highest dose available.",
          "author": "scatterbrainedgrad",
          "created": 1620532232,
          "upvotes": 6,
          "replies": {
            "gxi9kgo": {
              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxi9kgo/",
              "text": "This is just me, but sometimes I find that lowering my dose a bit actually helps. When I’m on too high of a dose I feel *more*  scattered... I think this is because there’s a point where the meds start squashing the “positive” aspects of my ADHD and I turn into a bit of a robot but that’s just not how I think. I now take Zenzedi, which is basically IR Vyvanse, so I can adjust my dose as needed rather than being stuck with one dose all the time.",
              "author": "kayelar",
              "created": 1620575046,
              "upvotes": 5,
              "replies": {}
            },
            "gxgsoxp": {
              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgsoxp/",
              "text": "Depending on your hours, you could take a second dose.",
              "author": "Nerak12158",
              "created": 1620535607,
              "upvotes": 0,
              "replies": {
                "gxgt4dq": {
                  "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgt4dq/",
                  "text": "I once took it at about 1 pm and did not sleep until about 1 am.  Probably not a good idea in my case.",
                  "author": "scatterbrainedgrad",
                  "created": 1620535869,
                  "upvotes": 6,
                  "replies": {
                    "gxgt8cy": {
                      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgt8cy/",
                      "text": "Ouch.  Maybe a dose of adderall or Ritalin in the early afternoon?  Or some extra coffee.",
                      "author": "Nerak12158",
                      "created": 1620535939,
                      "upvotes": 1,
                      "replies": {
                        "gxgtflw": {
                          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgtflw/",
                          "text": "Hmmmm.  I've got a bunch of caffeinated tea; maybe I'll brew some no later than about 2-4 pm if I need a pick-me-up.  When I was unmedicated it did nothing; on Vyvanse, it does make me wired, so that's a good idea.",
                          "author": "scatterbrainedgrad",
                          "created": 1620536064,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gxha7aw": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxha7aw/",
      "text": "Adderall and Outlook. I put everything into my schedule.\n\nI also love my Samsung watch because it is linked to Outlook and so when I get the 15 minute warnings they come through on my watch. They have saved my forgetful butt numerous times already and I've only had the watch for one semester!\n\nI saw in another comment that you are only on the third highest dose of Vyvanse. I'd bump that up to the next higher dose if you are still struggling at work.\n\nAlso, I found that Vyvanse lasted way too long for me--I'm probably deficient in whatever enzyme you need to \"unlock\" the med--but Adderall XR was perfect. There are some times when I'd love some Vyvanse now (long days) but it also gave me cystic acne so 🤷.",
      "author": "Purple_Chipmunk_",
      "created": 1620550163,
      "upvotes": 6,
      "replies": {}
    },
    "gxhi7wi": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhi7wi/",
      "text": "Hi! I'm not a professor but a starting grad student with ADHD so I'm not sure I'm allowed to get involved in this conversation. I don't think my ADHD is as impactful as it is in your case, so don't read this as a 'just do this, and you'll be fine' comment. This is just a little bit about my own experience, but who knows, maybe some of it is of help to you too.\n\n* Writing: I'm really bad at starting things and with finishing them on time. What helps me is to create deadlines artificially, because I do manage to do stuff when I'm under pressure and/or feel responsible towards other people.  How you can do this probably depends on the structure of your program and what you prefer, but I do this by letting my advisor know when I expect to finish chapters/writing/experiments and when I will send it to them. They don't need to do anything with this info but I've told them it helps me to feel a bit of pressure to keep my promises and they like being up to date. If it's something that doesn't involve my advisor, I buddy up with another student who has the same problem, and we give each other deadlines to send each other chapters to review. That way I feel like I would disappoint them if I don't send it without a good reason, and it makes the writing process less lonely and more productive.\n* Experiments: I have the same issue as you and I don't really have a solution. I'm scared all the time that me being chaotic will cause me to make mistakes and mess up my experiments. I talked about this with another student in my lab a while ago, and they mentioned that being scared to mess up is a sign that I care about the experiments, my work and the succes of the lab. While there is a point where worrying about this becomes very unproductive, try to remind yourself that you worry because you care and are serious about what you do, and also that it is normal to make mistakes as a grad student. \n\nFinally, it's already pretty great that you're aware of your ADHD and are taking it seriously, and it's a major accomplishment to be in grad school with ADHD. Even if you find that academia is not for you because of it, that doesn't mean that you failed as opposed to those who've 'made' it with ADHD. In any case, good luck!",
      "author": "HaircutRabbit",
      "created": 1620557882,
      "upvotes": 7,
      "replies": {
        "gxk9m6f": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxk9m6f/",
          "text": ">being scared to mess up is a sign that I care about the experiments, my work and the succes of the lab. While there is a point where worrying about this becomes very unproductive, try to remind yourself that you worry because you care and are serious about what you do, and also that it is normal to make mistakes as a grad student.\n\nI was thinking about how my graduate school experience has affected my attitudes about science so far, and reading this helped me a lot - I do care and am serious about what I do, and the ego blows I've taken have been because my disability has gotten in the way of me executing something I care about.",
          "author": "scatterbrainedgrad",
          "created": 1620612024,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gxhhpsq": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhhpsq/",
      "text": "For grad students - seek accomodations, it's not a failure. I was diagnosed as an adult and pushed myself through my masters without accomodations. It ended up being a traumatic experience. My first advisor was very toxic and cruel. \n\nI thought I could push through my doctorate program as well, but I had a very wise faculty member convince me otherwise. I confided to her about the stress I was experiencing, how it lead to anxiety. She really took away any stigma associated with my diagnosis and supported my requests for accomodations.\n\nAs I was going through the process of getting accomodations another professor threatened me. He said that if I was lying that it would be the end of my graduate career, and he'd make sure to that. He really changed his tone once the College started advocating for my accomodations in his class.",
      "author": "Ok-Refrigerator-2432",
      "created": 1620557413,
      "upvotes": 6,
      "replies": {
        "gxia2xa": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxia2xa/",
          "text": "Wish I would’ve done this. Was diagnosed in grad school, I still didn’t believe I actually had it and thought I was a pill seeker (now, I find that hilarious, because I’ve had multiple doctors and therapists tell me that I’ve probably had severe ADHD my whole life based on my stories) and then gave myself a mental breakdown trying to fit into the expectations of others. I wish that I’d found a therapist earlier on who could’ve given me advice about how to manage things or ask for help.",
          "author": "kayelar",
          "created": 1620575305,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gxhnw5j": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhnw5j/",
      "text": "Either you figure out a plan, for you, for how to get large, self-guided projects done or else you won't succeed in *any* field where large, self-guided projects are the norm.\n\nIt is a work habits question, and is thus very individual. For me it is easy, I can develop project-related tunnel vision so I use that to my advantage (the downside is if I think a paper is garbage there is no tunnel vision, but no great loss there in the long run).\n\nSo, if you're thinking of a way to succeed in academia *without* a plan to manage long term self-guided projects, stop right there. That's the wrong approach. What will help you (in or out of academia) is a method that works **for you** to tackle those sorts of projects.\n\nAnd, re-emphasizing self-directed here, because some advisor relationships result in work that is not self directed. You'll have to chart the course and make the schedule for work eventually, and if you've never done that before and never considered it, it can be a lot to tackle during your first job. I'd suggest contemplating it now.",
      "author": "ph0rk",
      "created": 1620562593,
      "upvotes": 6,
      "replies": {}
    },
    "gxiaj4l": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxiaj4l/",
      "text": "The biggest issue with having ADHD, from my perspective, is the impact it has on my ability to organize my thoughts and work life. So I've developed a set of coping skills that have been immensely helpful:\n\n1. I use my phone calendar religiously and link it to my work calendar. This means scheduling everything immediately when it comes up. In particular, meetings with students are made while I'm replying to their emails or talking to them directly.\n2. I write everything down and trust nothing to my memory.\n3. I use a corkboard with a tracking system for each paper letting me know where it is in among the stages of development so I can know where my effort needs to be placed over an extended period of time.\n4. I use EndNote to store my highlighted .pdf files and maintain notes about each paper I read.\n5. I store every word I write, even paragraphs that I eventually cut from a paper so that I don't have to remember if I decide to revert back to previous versions or rework some previous thought.\n6. I'm open about my \"disability\" (I recognize it is one, but it hasn't been so bad for me compared to what others deal with, thus the quotes) with my co-authors and students. I invite them to follow-up with me if something slips through the cracks. You'd think they'd resent having to monitor me, but I've found the opposite seems to happen...they recognize I'm doing my best and are willing to offer support (within reason). \n\nSomeone else here mentioned something that is really important for me: working with my personal rhythms. Writing a paper is a weird process for me - I'm scattered and appear unproductive until everything clicks, then I spit out a draft in a rapid burst of activity. This means I sometimes pull all-nighters and sleep late the next day. Other days, I read and reflect without much to show for it except jumbled internal thoughts. I've learned to be OK with that. I'll be even more OK with that as more papers get through the publication process (thankfully my teaching is quite good).",
      "author": "BlargAttack",
      "created": 1620575525,
      "upvotes": 5,
      "replies": {
        "gxk9t2c": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxk9t2c/",
          "text": "I like the message to work with my personal rhythms rather than against them.  One thing I've noticed is that I might be unnecessarily trying way too hard to act neurotypical.  I need to just let myself be ADHD as much as I can manage around my other obligations.",
          "author": "scatterbrainedgrad",
          "created": 1620612135,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gxhbe19": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhbe19/",
      "text": "I really appreciate you asking this question! Every time I mess up some stupid detail my advisor rags on me, and I know I have no control over it due to ADHD. So I’ve just figured academia isn’t for me. But it’s nice to see that others have made it work!",
      "author": "honor-",
      "created": 1620551307,
      "upvotes": 3,
      "replies": {}
    },
    "gxhnrmo": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhnrmo/",
      "text": "I'm not a prof but a senior PhD student. I'm commenting because I'm as if not more productive than my classmates.  I have found over the years that there are very specific things that help me stay organized. I dont question them, but will harness them for all their power! These can include: bullet journals, very spefici file storage systems. I can't write a document/section in one go so I need to consistently work but never binge work, which means I can't leave things to the last minute. \n\nI also schedule my time to have down time during the week. Not just evenings but sometimes will take wedensadys off and work the weekend.",
      "author": "frankie_prince164",
      "created": 1620562501,
      "upvotes": 3,
      "replies": {}
    },
    "gximcd5": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gximcd5/",
      "text": "I have ADD, not ADHD, so it's a little different. I am also not a professor because I don't teach, I am research only, so I just stay with research scientist. So a bit different again. Also, everyone has different coping mechanisms. I believe the ones who don't make it haven't found theirs.\n\nFor me, the difference that I notice is whether people end up doing the work or not. I may work one hour on, one hour off all day. It might be 12 hours one day and 4 the next. Maybe I will have one bad Wednesday and make up for it on the weekend. For me it's about getting the hours done, 40 (ish) hours of the week are for work, so as long as it gets done then it's fine.\n\nSo, my advice is find what works for you. It could be different from me, it could be different to everyone here, you just have to see what works. For me, my office desk was coding/writing only. If I got distracted, id walk away from it. Trying to associate my desk with work. My main issue is reading because I have ADD and dyslexia. I would read a paper one paragraph at a time, in different locations. You'd find me sitting on window ledges, in stairwells, in the cafeteria, on the stairs outside the front of the department... Etc. One time it was up a tree next to the university lake. I have even ventured to other departments. The psychology department was next door and I think they found it weird, but also because they were psychology, they were awesome about it. I just found it so hard to concentrate to read that moving helped a lot\n\nThis week, though I am no longer a postdoc or a PhD, I worked until 2-3am three days and did next to no work on Thursday or Friday. I made up for it Saturday and those three late nights. Also, with me, if I'm on a roll I shouldn't stop. Doesn't matter the time or anything, just keep going until that roll has stopped. I've done 20 hour days before followed by a day off because I was in the zone. With ADD, I can't let those times be wasted.\n\nSorry about the long wall of text. You'll find your coping skills! You could even talk to the disability office, they might have some things about it. (Side note: I hate that it's called the disability office. I consider dyslexia and ADD different ways of thinking, they are not disabilities. I honestly find it insulting)",
      "author": "PersonalZebra8993",
      "created": 1620581352,
      "upvotes": 3,
      "replies": {}
    },
    "gxin2yi": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxin2yi/",
      "text": "I hope you don't mind, but I'm another grad student with ADHD. \n\nSo far one of the biggest helps has been forming an accountability group with a few of my peers. We meet once a week and it helps me a. remember upcoming tasks that would otherwise be lost on a sticky note somewhere b. reminds me that even though I have unique challenges, I am far from the only one making mistakes, forgetting important tasks, and neglecting my inbox. COVID makes the detachment so much worse and it's easy to imagine everyone else being lightyears ahead of you, but the gap is smaller than it feels c. I have a support network that will encourage me to take breaks, advocate for myself, and remind me that it's okay to make mistakes.",
      "author": "loloopssorry",
      "created": 1620581713,
      "upvotes": 3,
      "replies": {}
    },
    "gxjhi6l": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxjhi6l/",
      "text": "Honestly, I do not think I have had “success” as a professor with my ADHD. I do great research and invest a lot in my students, but I think that academia may not be a great place for people like me. \n- Being a professor is like having three different jobs: research, teaching, and administrative (“service”) work\n  - Managing these three separate streams of tasks and deadlines is overwhelming\n  - Switching between streams is tough, and I lose track of important information during these transitions\n- Academics already tend to work constantly and lack work-life boundaries, which amplifies my anxiety over unfinished tasks \n- My publication record is abysmal. I have worked on the same four (good) papers for years.\n- I fail to meet deadlines for conference or grant application submissions all the time\n- Poor organization leads to poor student evaluations of teaching\n\nMy advice is to be sure that academia is really where you want to be.",
      "author": "alyosha3",
      "created": 1620596454,
      "upvotes": 3,
      "replies": {
        "gxk9z5g": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxk9z5g/",
          "text": "Oh, I've already decided I'm heading for industry, but I want to make sure I'm doing the best I can to succeed while I'm still in academia.",
          "author": "scatterbrainedgrad",
          "created": 1620612234,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gxgt4z8": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgt4z8/",
      "text": "It's not about you. Don't beat yourself up. You live in a collapsing economy. I made professor by going to a place that isn't. Nothing else mattered. Once I was in a place with a functioning economy, it didn't matter who I was, how I thought or what I thought. They were happy to have me. And I know that if I were back home, my personal issues would all of a sudden be so fucking important. But all that's just an excuse for the fact that there are no fucking jobs.\n\nSo stop asking yourself what's wrong with you that you can't make it in a place with no jobs, and go to where the jobs are.",
      "author": "slip-7",
      "created": 1620535880,
      "upvotes": 11,
      "replies": {
        "gxgwxmx": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgwxmx/",
          "text": "Where are you if I may ask?",
          "author": null,
          "created": 1620538499,
          "upvotes": 3,
          "replies": {
            "gxh2afr": {
              "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxh2afr/",
              "text": "China. I don't even have to ask where you are to tell you the economy is fucked there, because there's really only one place it isn't, and that goes triple for academia.\n\nAll I'm saying is, don't internalize an external problem. If you can get the degree, you should be able to be a professor. If you can get the degree, and you can't be a professor, that's not your fault. That's forces far beyond you that manifest themselves into your life as whatever personal criticism someone who is intentionally searching can make of you, and if it weren't ADHD, it would be something else. You can do whatever work you want on your own heart and mind for its own sake, but your ability to get a job has nothing to do with that.  Don't hate yourself. Hate capitalism.",
              "author": "slip-7",
              "created": 1620542861,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gxgyfp5": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxgyfp5/",
          "text": "So based on your experience, where are the jobs?",
          "author": null,
          "created": 1620539652,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gxiafto": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxiafto/",
      "text": "OP, make sure you find a good therapist! This is so important, even if you’re medicated (and for me, especially because I’m medicated). It’s a pain in the ass to find someone you click with who is also under your insurance but once you do it’s so worth it. I always felt like ADHD “strategies” I found online were unhelpful and nothing I didn’t already know, but I’ve found that having a therapist who affirms and explains things to me has really helped me drop a lot of the guilt associated with my diagnosis and has helped me see that the way my brain works means that I will need to approach things differently sometimes.",
      "author": "kayelar",
      "created": 1620575480,
      "upvotes": 2,
      "replies": {
        "gxka29d": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxka29d/",
          "text": "Fortunately, I have a great therapist.",
          "author": "scatterbrainedgrad",
          "created": 1620612283,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gxhwpts": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxhwpts/",
      "text": "You have to figure out how to manage and produce things and meet deadlines and choose options that will work for you and not against you.\n\nNobody really cares what you have or dont and in general academia is really more tolerant of “weirdness” than other worlds, but at the end of the day, you meet your goals or you don’t.  You probably have more autonomy and flexibility of how how ot do that in academia than in most other places also.\n\nIf you think that non academic jobs are not juggling competing deadlines and scheudles and dont require those kinds of skills you are also kind of wrong.",
      "author": "PersephoneIsNotHome",
      "created": 1620568332,
      "upvotes": 2,
      "replies": {}
    },
    "gxh2l1g": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxh2l1g/",
      "text": "(ABD not a prof just yet.)I believe my ADHD is a consequence of my trauma history. So I’ve done a lot of work in that area and now I research how trauma affects learning. My PhD program has been additionally traumatizing — no surprise to many I’m sure — but having a research subject that is so meaningful to me has helped beyond measure. I’m also pretty useless in class with my inability to pay attention well during lectures, so I relied a lot on my writing skill to carry the load of my academic burden. Qualitative coding has perhaps been the hardest part of my whole program because of the tedium. \n\nIt is always an option. There are plenty of tools you can use to adapt. If it’s something you choose to do, there is success to be had.",
      "author": null,
      "created": 1620543109,
      "upvotes": 1,
      "replies": {
        "gxh6xck": {
          "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxh6xck/",
          "text": "I wonder how many of these software tools were developed by similarly affected people that a normal office clerk would question his/her sanity and organizing skills.",
          "author": null,
          "created": 1620547044,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gxm4dzs": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/gxm4dzs/",
      "text": "It’s not easy, even now. But I have learned that I need to start my work before noon on free days or the day will pass me by. I make myself do a little work every day just to stay connected to things. I also use my Google calendar app for everything, including important deadlines. \n\nLastly, if you suffer from guilt from procrastinating (or distractinating, as I like to call it) try to ease the guilt by just doing a little work. It helped me to enjoy my time off and not compound the feelings that I’m not doing enough. Also, sometime I just cannot do much and I recognize it’s one of those days. I don’t fight it unless I am on crunch time. On the contrary, some days I hit major strides and I will keep working on those days. Follow your body’s instincts!",
      "author": "chakalakalakalaka1",
      "created": 1620658523,
      "upvotes": 1,
      "replies": {}
    },
    "hb6lxhu": {
      "link": "/r/AskAcademia/comments/n85bzc/professors_with_adhd_what_made_the_difference_for/hb6lxhu/",
      "text": "This is an amazing thread and I am so grateful to have found it. I am a supposed-to-be-finishing Ph.D. who has pushed her very lovely supervisors to serious grumpiness. I have recently been diagnosed with inattentive type after my teen son was diagnosed. Does anyone know of some good writing or studies about postgrads and academics with ADHD? I need some supporting evidence to make my case for support (formally) and understanding (informally). Thanks",
      "author": "Tamz11",
      "created": 1630501968,
      "upvotes": 1,
      "replies": {}
    }
  }
}