{
  "sid": "qc4o2t",
  "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/",
  "title:": "I don’t think I want to get my PhD anymore, but I don’t know what else to do.",
  "text": "\nI’m (22F) a first year PhD student in physics, and I kind of absolutely hate it. I know at least some of the problem is my mental health, adjusting to having moved across the country, and a bunch of non-school external stressors that I have been dealing with… I’m in therapy and I take meds. \n\nBut I wake up and dread my classes. I dread my research. I feel like a disappointment to my advisor who is so nice and puts so much faith in me. I’m skipping class and sleeping and I’m still so exhausted. I don’t think this is what I want to do, and academica was never something I planned on doing after my doctorate anyway. I think I just want it so everyone knows I’m smart. And it’s always been my plan. \n\nBut I don’t know what to do from here. I kind of want to teach. My mom was a teacher and she hated it, but I think I would enjoy teaching math, and it seems like that’s at least somewhat in demand. \n\nI don’t know what to do. Any advice from teachers, grad students, physicists, or anyone would be useful. Thank you.",
  "author": "FresaMalvada",
  "created": 1634746957,
  "updated": 1636169928,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhdpzts": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhdpzts/",
      "text": "As a Physics PhD student finishing my PhD in 3 months, my opinion is that if you don't enjoy your field and your research, and i mean truly and deeply enjoy, then you will have a seriously bad and depressing time while doing your PhD. I would say that it is not worth it. Also consider that PhD stipend is not very high and covers only your basic needs. You won't be able to save anything. Based on what you wrote, i strongly advise you to NOT do the PhD.\n\nPhD is generally a good option for people who are passionate about their research enough to sacrifice financial stability and almost all social life for 3+ years.\n\nYou mentioned that you'd be doing the PhD at least partly to show that you're smart. In my opinion, that would only show the oposite. It is not smart at all to sacrifice 3 years worth of savings, time with friends, relationships, etc., just to show the world that you're smart. I'd rather show the world that I'm the dumbest person alive and be relaxed, save money for a house and be happy spending time with my friends.",
      "author": "GreyLaser",
      "created": 1634748393,
      "upvotes": 3,
      "replies": {
        "hhds0gw": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhds0gw/",
          "text": "Thank you for this reply. I think you might be right. I reeeeeally want to save up for a house so you’ve hit the nail on the head there, too.",
          "author": "FresaMalvada",
          "created": 1634749178,
          "upvotes": 2,
          "replies": {
            "hhetyn9": {
              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhetyn9/",
              "text": "Will you be able to on a teacher’s salary? Scope out salary ranges in r/teachers and make sure you move to a state that pays teachers well.",
              "author": "Turbulent_Cranberry6",
              "created": 1634764221,
              "upvotes": 13,
              "replies": {}
            },
            "hhg37a5": {
              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhg37a5/",
              "text": "Oh yeah, I'll easily be approaching the 6-digit debt mark by the time I finish my PhD. But I love it so goddamn much that if this is the ONLY part of my life I get to do what I love, it'd still be worth it.\n\nIf that's not how you feel about it, then the only tough decision ahead of you is what you DO want to do. Quitting sounds like a no-brainer.",
              "author": "Whatifim80lol",
              "created": 1634784779,
              "upvotes": 3,
              "replies": {
                "hhhqr6y": {
                  "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhhqr6y/",
                  "text": "I hit 6-figures in student loan debt by the time I finished my PhD, and it’s only getting worse with interest!",
                  "author": "RedBeans-n-Ricely",
                  "created": 1634825470,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "hheb4nb": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hheb4nb/",
          "text": "3 years is a very optimistic timeline for a PhD. the average is 5+ years. That's half a decade of opportunity cost.\n\nEven if you love what you're studying, it can be very frustrating to watch all your friends start their lives while you're still in school.  They'll have jobs, families, houses, savings and retirement accounts, and you'll still be in school.   \nIf you loved physics, it might be worth it. Some people absolutely love the grad school life. But you don't seem to be one of those people.",
          "author": "apple-masher",
          "created": 1634756811,
          "upvotes": 59,
          "replies": {
            "hhejt7c": {
              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhejt7c/",
              "text": "[deleted]",
              "author": null,
              "created": 1634760197,
              "upvotes": 17,
              "replies": {
                "hhekaj2": {
                  "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhekaj2/",
                  "text": "It's not really odd - many countries consider PhD students to be employees, so it'd be strange for them to be doing classes. Plus master's are far more common over here than in the US, as are undergraduate dissertations (essentially required in many countries), so you're already expected to have a postgraduate level of understanding as well as experience with research.\n\nEdit: I do know of a few European universities that require PhD students to take taught modules, but those are generally restricted to the first 18 months of the programme and part of 4-5 year structured PhD programmes. Otherwise you're expected to take 3-4 years.",
                  "author": "theredwoman95",
                  "created": 1634760386,
                  "upvotes": 28,
                  "replies": {}
                },
                "hheyd0v": {
                  "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hheyd0v/",
                  "text": "Do European PhD programs accept students straight from undergrad or do they typically require a Master's degree? In the US, you can get into most PhD programs straight from undergrad so there's more need for your specialized classes in the first year or two.",
                  "author": "frameshifted",
                  "created": 1634766068,
                  "upvotes": 7,
                  "replies": {
                    "hhh4mh7": {
                      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhh4mh7/",
                      "text": "MSc is a requirement.\n\nTraditionally, BSc wasn't even a thing.\n\nYou applied out of HS and got an MSc in a 5 yr undergrad.\n\nTHEN applied for a PhD",
                      "author": "Hoihe",
                      "created": 1634812757,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                },
                "hhhlyg7": {
                  "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhhlyg7/",
                  "text": "Yes, it's like just that in France. Is it most European countries tho ? Does anyone have any numbers about PhD lenghts in the world ?",
                  "author": "Jtktomb",
                  "created": 1634823220,
                  "upvotes": 1,
                  "replies": {}
                },
                "hhxqfvf": {
                  "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhxqfvf/",
                  "text": "There are almost always taught or highly guided components to such programmes — even if only just for the sake of a class/seminar in research methods and one in a very niche area that the student will be using for their research topic. Aside from that, it’s not really necessary to have large taught components as it’s assumed that the necessary background will have already been achieved in an undergraduate degree and increasingly it’s less likely to get accepted to such phd programmes without a masters degree in hand already. So really, it makes quite a lot of sense. \n\nI’ve heard that a lot of American PhD programmes are open ended for the same reason that American undergrad programmes are typically 4 years rather than 3. That is, a fair amount of time is spent at the start getting candidates up to speed. I think (broadly speaking) that European candidates typically have higher levels of understanding going into both undergrad and PhD degrees, though American style PhDs they come out slightly more specialised in their particular research area. \n\nA European degree is not quite so demanding as a North American one in terms of expected published material either so there’s that too. Whether the American or European system is better is a whole other question (do we need to be hyper specialised at the start of a research career? Or is just better anyway because it necessarily involves more practice at all the soft skills of research?), but it’s definitely a gross oversimplification to think that a European PhD is an American PhD-lite. I know you didn’t quite say that, but it seemed to be the subtext (perhaps unintentionally).",
                  "author": "island_arc_badger",
                  "created": 1635126738,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hhejn5o": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhejn5o/",
          "text": "[deleted]",
          "author": null,
          "created": 1634760130,
          "upvotes": 17,
          "replies": {
            "hhiohnv": {
              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhiohnv/",
              "text": "Why do you hurt me like this?",
              "author": "laser_lights",
              "created": 1634839324,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "hhed814": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhed814/",
          "text": "Also, sometimes I think I'm doing a PhD because I'm NOT that smart. Smarter people could figure out great things to do without needing 5 extra years of schooling XD.",
          "author": "odesauria",
          "created": 1634757640,
          "upvotes": 14,
          "replies": {}
        },
        "hhgjx1u": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhgjx1u/",
          "text": "god i hate the characterization that you have to be willing to give up a social life, though I'll say there are definitely periods during the program where you might need to do this. don't know about doing it for a full three years though",
          "author": "knowuow",
          "created": 1634794755,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hhdqhiy": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhdqhiy/",
      "text": "Sounds like its time for a deep think. Change can be good but determining where you want to go from here can be a challenge. If the coursework etc is adding to your health dilemmas, Personally I don’t think it’s worth the hit to your mental health.",
      "author": "JBS676",
      "created": 1634748586,
      "upvotes": 2,
      "replies": {
        "hhds2r5": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhds2r5/",
          "text": "I think you’re probably right about that… thank you. :)",
          "author": "FresaMalvada",
          "created": 1634749202,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhdswe1": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhdswe1/",
      "text": "Your local fire and rescue may pay for you to become and EMT and paramedic if that interests you",
      "author": "UpstairsExchange2241",
      "created": 1634749522,
      "upvotes": 1,
      "replies": {}
    },
    "hhed6c1": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhed6c1/",
      "text": "Youre figuring this out in first year?  Good for you, quit.  Quit right away.  The sunk cost fallacy (which is less of a fallacy because you do only get your PhD at the end so you kinda get stuck gutting out out) gets worse with every passing year.  Run now.",
      "author": "bjos144",
      "created": 1634757622,
      "upvotes": 216,
      "replies": {
        "hhf8elj": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhf8elj/",
          "text": "One caveat to this advice: If you leave, it is best to do so in conversation with your advisor, department chair, and administration at your institution. Figure out an exit strategy with them that will not adversely affect you in the future. This could mean either finishing the semester out or withdrawing from courses without taking a grade. \n\nConsider applying for a formal leave of absence. The fact that youre in therapy means it should be easy to get the documentation you need. A leave of absence is temporary, usually a semester or two, so you will have a chance to return and pick up where you left off if you want to. Faculty and administrators are increasingly aware of the importance of mental health, especially in the pandemic, so they will understand and respect your decision. You will not be the first person to do this, and faculty/administrators would rather you take a well-planned absence than suddenly drop out. \n\nIn my opinion, you are young to be starting a PhD. That's not necessarily a bad thing; on the contrary, it means you will have plenty of time to do this at some point down the line if you decide you really want to. There is absolutely nothing wrong with leaving a PhD program, and it doesn't have to be a final decision. Quitting now does not mean you can't pursue one later, but that will be much easier if you manage your exit so as to minimize damage to your academic record or professional relationships.",
          "author": "MildManneredCat",
          "created": 1634770486,
          "upvotes": 104,
          "replies": {
            "hhfkc0w": {
              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhfkc0w/",
              "text": "Thank you for this- I am going to talk to administration tomorrow and see what I can do. \n\nMost of the people (45ish) in my cohort are 22-24. I think we’re pretty young, too, but I guess it’s normal.",
              "author": "FresaMalvada",
              "created": 1634776007,
              "upvotes": 29,
              "replies": {
                "hhhhfny": {
                  "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhhhfny/",
                  "text": ">Most of the people (45ish) in my cohort are 22-24. I think we’re pretty young, too, but I guess it’s normal.\n\nYou're totally right; I should have phrased it differently. I don't think *you* specifically are young, because that's a very typical age to start a PhD. Rather, I believe that starting a PhD fresh out of college, though normal, is a problematic norm. To \"make it\" in academia requires a massive emotional and mental commitment to a specific career path (not to mention time), and I just think it's unfair to people in their early 20s to expect them to commit to a career so soon. \n\nI started my PhD at 24 and in retrospect think that was too soon for me personally, given where I was in my life and how I would change over the next decade. I probably would have done the PhD anyway, but I would have been happier, more productive, and even finished sooner if I had started a little later in life (pre-kids but post-maturity).",
                  "author": "MildManneredCat",
                  "created": 1634820903,
                  "upvotes": 17,
                  "replies": {}
                },
                "hhgncul": {
                  "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhgncul/",
                  "text": "There’s 45 people in your cohort? You’re definitely at one of the bigger physics departments.",
                  "author": "TakeOffYourMask",
                  "created": 1634797391,
                  "upvotes": 16,
                  "replies": {}
                }
              }
            }
          }
        },
        "hherx8h": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hherx8h/",
          "text": "Totally agree with your point about the sunk cost fallacy and would add you can't live your life for other people. You can't spend years doing something that makes you miserable for someone else. However nice they are, it makes very little material difference to them. You're not making their life better by staying but you're making your life worse. And even if it was better for them that's not a good reason to continue. \n\nYou have to live your life on your own two feet and own it. Better to make your own mistakes than someone else's.",
          "author": "ACatGod",
          "created": 1634763398,
          "upvotes": 17,
          "replies": {}
        },
        "hheua6g": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hheua6g/",
          "text": "I second this dude's post. Every last word.\n\nRun now.",
          "author": "ActionXPotential",
          "created": 1634764355,
          "upvotes": 12,
          "replies": {}
        },
        "hhhq25b": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhhq25b/",
          "text": "You might want to check into how long do you have to be in your current program before they will give you a conciliatory masters degree. Of course, if this is your first year and you’ve only been in the program a couple months, it might not even be worth it. I know for my program, you had to be finished with all of the course work, which was at the end of your second year.\n\nIf I didn’t absolutely love what I do, I love my science, I would not have survived grad school. If you can’t find some part of the experience that brings you joy, it’s not worth it. I loved my research, and I still do! And that’s what gets me through the stress and the shitty days. Don’t waste your life doing some thing that makes you miserable. People say life is short, but it’s the longest thing you’re ever going to do, and it would be a damn shame to spend that time unhappy for no fucking reason.",
          "author": "RedBeans-n-Ricely",
          "created": 1634825153,
          "upvotes": 4,
          "replies": {}
        },
        "hhi3jex": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhi3jex/",
          "text": "Agreed and at 22, she has gone straight from high school, to university, right into grad school. \n\nOp, please allow yourself a break. Mental well-being comes first. Take a few years to work and explore yourself as an adult. You will find your interests change and you may no longer be interested in the things you were at 18. You will always have time to go back to school.",
          "author": "rainbowbunny09",
          "created": 1634830941,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhe59s0": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhe59s0/",
      "text": "I'm so glad that you are addressing your mental health, above all else.\n\nDon't be miserable for something you hate when you can be stressed (but not miserable) for something you love!\n\nAlso, you are so young, you have lots of years to change your mind again and again. Love to you :)",
      "author": "NN2coolforschool",
      "created": 1634754462,
      "upvotes": 24,
      "replies": {}
    },
    "hhedoh2": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhedoh2/",
      "text": "I'm in the process of dropping out of my PhD, best advice I can give is be transparent with your adviser. I pushed off talked to mine because I was afraid of how they would react, but they were super helpful and supportive. It's unlikely  you are the first student they've had quit and you definitely won't be the last. Also you should consider weather you need this position to pay your bills or not. If you do then you should start looking for a job, even if its just a temporary one.",
      "author": "casual-captain",
      "created": 1634757812,
      "upvotes": 18,
      "replies": {}
    },
    "hhefh3b": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhefh3b/",
      "text": "I’m a Department of Energy Staff Physicist (38F), so having gone through some of what you’re going through:\n\n1) In my experience, attending a physics PhD program is noticeably different than working as a physicist. Once you actually have your PhD you can move in all sorts of directions that may diverge wildly from what you studied as a student. I absolutely hated my PhD program, but I love working as a physicist; they were/are totally different experiences for a multitude of reasons. Also, academia is not the only place where physicists work. I would never want to work in academia (no slight to those who do of course, it’s a personal choice).\n\n2) A dirty secret about Physics PhDs is that a surprising number went this direction, partially, to feel or appear intelligent. A physics degree, especially if you are a woman, is seen as rare and special (regardless of if this perception is warranted or not), and while I am absolutely not suggesting that this is a good primary reason to pursue this career path, it doesn’t necessarily detract from the fact that you may also really love science, or experimental research, or physics overall. \n\nYou are allowed to have multiple reasons why you want to be a physicist, which could include: social status, financial benefits, personal interests, personal values, passion, etc. \n\nWhat I would strongly caution against is pursuing a physics PhD if you don’t actually like physics, or STEM in general. Note that this is different than disliking being a physics student, or disliking the way that physics is taught in your program. What I mean that if you actually loathe physics as an area of study, I would not recommend pursuing a physics PhD solely because you want to feel like an intellectual elite. Physics PhD programs in the US are grueling and many times painful, and absolutely not worth it if the only value that it has to you is as a vehicle to stroke your ego or mask your insecurities. Don’t do that to yourself or the profession, it’s not worth it.",
      "author": "Astro_Arctic",
      "created": 1634758509,
      "upvotes": 15,
      "replies": {}
    },
    "hhe0r2s": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhe0r2s/",
      "text": "> But I don’t know what to do from here. I kind of want to teach. My mom was a teacher and she hated it, but I think I would enjoy teaching math, and it seems like that’s at least somewhat in demand. \n\nI am not a teacher, but I would strongly encourage you to really look at negatives of being a teacher. The salary is usually pretty low vs what you could earn elsewhere, especially with a physics PhD. The instructors I've interacted with during my PhD were miserable, always grumpy and annoying to interact with. \n\nHave you ever taught students? I spent several years teaching during my graduate school so I feel I have some idea what it entails, and just how underpaid and not appreciated teaching positions are. If I really wanted to teach I'd rather learn how to make cool youtube videos. I could not in good faith advise anybody to work as a teacher, especially when they have really good quantitative skills (if you were admitted to a physics PhD program I'd say that puts you quite high). You could do a masters in data science if that is something that appeals to you. \n\nAnother option is to take a leave of absence (if available) to figure out what you'd like to do. I took it for 3 months, came back really fresh and with a more clear mind what I wanted to do.\n\nThat said, I had a similar experience my first/second year when I was taking classes and exams. I ended up working in a very small lab, on topics that I was really interested in, and with an adviser who gave me enormous freedom in types of projects I could work on. With a caveat that I'd need to be a TA to support myself. \n\n(FYI, I am in the US, PhD in physics, working in industry.)",
      "author": "Bhegruhmem",
      "created": 1634752638,
      "upvotes": 26,
      "replies": {
        "hhejwj8": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhejwj8/",
          "text": "The advice about salary is good. Just wanted to add that it depends heavily on the country where you live. You can check the average salary for teachers in your country [here](https://www.oecd-ilibrary.org/education/teachers-salaries/indicator/english_f689fb91-en) (OECD member countries).",
          "author": "NoNopeMelon",
          "created": 1634760233,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "hhedjf8": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhedjf8/",
      "text": "I dropped out of my PhD program with a Master's, and it was the best thing for me to do. In my field, a Master's is no better than a B.S., but I just wasn't passionate about my PhD work. I couldn't brute-force my way through the degree, and it just kept getting worse. Unless you really want a PhD, I would try looking for something else to do.\n\nTeaching in another field where you need the passion for it. You can get paid well in some places, but it really depends on where you want to live. \n\nReally think about what you want to do, and look into getting licenses if you need them. There are a lot of mathematics- heavy fields in businesses, which may not be physics, but your degree probably prepared you for them. But some, like becoming an actuary, take additional classes and licensing.",
      "author": "MulysaSemp",
      "created": 1634757758,
      "upvotes": 10,
      "replies": {}
    },
    "hheee58": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hheee58/",
      "text": "I was in the same boat. I struggle in my first year but somehow pass and made it to second year. I was depressed and stressed out in the beginning of my second year that I took academic leave to take a break. I realized I was not happy with my project and I lost interest and didn't want to be in a PhD for 4+ years in something I didn't love. I got a low paying lab tech job but after a year I used my work experience to land a job in my desired field. So now I'm working my way up but Im happier now than I was in a school. I would list the reasons why you want to leave. While it is harder to find a job in stem with just a BS, you might be able to find one depending on your location. If you're not 100% sure, then maybe ask for a semester off to have a break and reassess what you want.",
      "author": "DekuChan95",
      "created": 1634758099,
      "upvotes": 4,
      "replies": {}
    },
    "hheb9cg": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hheb9cg/",
      "text": "Sometimes it takes actually diving into something to make us realize what is and isn't for us. There's a big fucking difference between THINKING you want something and actually doing that thing. I just moved to another country and uprooted my life, just to have pretty much the exact same thought process you're having. I dropped out and am heading back to the states in a couple days. \n\nI'm not saying that's what you'll end up doing, or even recommending it (I just don't know enough about your situation), but really think about what makes you happy and what YOU want, not what other's expect out of you. Life is too short for anything else. And if you don't know what you want, or what makes you happy yet (that's totally normal), then perhaps a break for diving into a PhD would be a healthy choice as well. Seems to me you've made up your mind to give it a break though, and you're looking for some validation.",
      "author": "Askip96",
      "created": 1634756864,
      "upvotes": 4,
      "replies": {}
    },
    "hhealcx": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhealcx/",
      "text": ">But I don’t know what to do from here.\n\nI don't know what you want to do as a career but based the skills you've learned as a physics PhD students could be very valuable in different fields because you guys are part time data scientists, part time CS / electrical engineers, part time mathematicians, and part time experimentalists. The combination of skill sets that you have might land you a job in other industries. Good luck.",
      "author": "SubcooledBoiling",
      "created": 1634756594,
      "upvotes": 12,
      "replies": {
        "hhfgw62": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhfgw62/",
          "text": "But OP has only just started and is looking to drop out, so I don’t think they can lay claim to all the skills a full PhD would teach. If they can exit with a Masters then they’ll have that, but otherwise, I don’t think it’d be hugely beneficial for them to advertise that they started a PhD and dropped out in the first of 5+ years with nothing to show for it. Best to just skim over that fact and focus on things they actually spent a significant amount of time on. You don’t get to drop out of a Bachelors and claim you gained all the same skills as a graduate either.",
          "author": "officially_anxious",
          "created": 1634774432,
          "upvotes": 4,
          "replies": {
            "hhfi5ss": {
              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhfi5ss/",
              "text": "Ya I agree with what you're saying. As far as the tangible stuff maybe OP won't have a lot to show but these days many companies, especially those in the tech field, put a lot of emphasis on how well a candidate can pass their interviews and hire them based on that. So if OP has the relevant skill sets, for example, knows a bunch of languages, has experience with software engineering, or has data science related skills, or is proficient with AI/ML/RL/DL, etc, and can put these skills on their resume / LinkedIn, they could land an interview with these companies. But OP's performance in the interview is a different question.\n\nBut I am just speaking off my experience so things could be different for other people.",
              "author": "SubcooledBoiling",
              "created": 1634775011,
              "upvotes": 1,
              "replies": {
                "hhgy5eh": {
                  "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhgy5eh/",
                  "text": "If OP is in the US, it’s more likely than not that they went directly from a taught undergraduate degree to the PhD, and being in their first year they likely wouldn’t have done any research yet, just more classes. So unfortunately OP is very, very unlikely to have any of the skills you listed. Those are things that some people gain during the PhD if they do a project that involves them (and even that is a small number of people). \n\nStraight out of undergrad, OP likely has little to show. And if they focussed on research the whole time then they probably don’t even have work experience. OP simply does not have the skills of a physics PhD because they do not have a physics PhD.",
                  "author": "officially_anxious",
                  "created": 1634807050,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hheh3y2": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hheh3y2/",
      "text": "Life is too short to spend it doing things you dislike. Start actively applying to teaching jobs. Wish you the best.",
      "author": "Groundbreaking-Air73",
      "created": 1634759150,
      "upvotes": 5,
      "replies": {}
    },
    "hherljb": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hherljb/",
      "text": "It's good that you're realizing this now, while you're still in your first year! Don't keep doing something that makes you miserable.\n\nYour school probably has some sort of career counseling services. Explain your situation and talk to someone about different options you may have.",
      "author": "ProbabilisticWorld",
      "created": 1634763269,
      "upvotes": 4,
      "replies": {}
    },
    "hhetne5": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhetne5/",
      "text": "I cried a lot during the first 1-1.5 years of my PhD program. Especially when my college friends would post their vacations to Portugal while I was stuck in front of my work station on Friday nights and Saturdays. It’s a tough road. I really struggled with the work and with loneliness. I stuck it out because I didn’t have any better options and graduated. Someone who started with me in a neighboring department quit a year before graduation.\n\nOutcomes vary so much, and no one can predict which will be the case for you. As for teaching, just make sure you’re not idealizing it under Grass is Greener Syndrome.",
      "author": "Turbulent_Cranberry6",
      "created": 1634764099,
      "upvotes": 5,
      "replies": {}
    },
    "hhfyceq": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhfyceq/",
      "text": "I wish I'd never gotten mine, in ruined every aspect of my life.  Do you have someone trusted in the department or school you can talk to about this?  Not just other students, but faculty or staff, like a career counselor. It seems like you really don't want to be in a PhD, but not knowing what you want to do shouldn't keep you there.  Try finding a list of jobs you might be interested in and go from there.",
      "author": "UncommonPhoenix",
      "created": 1634782455,
      "upvotes": 4,
      "replies": {}
    },
    "hhg9kzl": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhg9kzl/",
      "text": "Don't do it if it makes you miserable. \n\nYou are 22! That's super young, I started my bachelor's degree at 22 :) so.... all your options are open.\nYou survived as an undergraduate in Physics, that is super impressive,  as it is one of the hardest fields to study. No wonder you are on the edge. It is HARD.\n\nOne thing that you can do is switch fields, to something that makes you less anxious, but is of interest to you. Math? Physical Chemistry or Chemical Physics? (You'll be a star there with your good Physics foundation). Computer Science? \n\nI love teaching too, but I wouldn't want to teach high school children or primary school children, since there are disciplinary issues to deal with and the money is not great (and you have to deal with anoying parents). I do enjoy teaching in the academy, college and university, as there is so much more freedom and the issues I mentioned above are non issues there. You might want to try and steer towards that.\n\nBest of luck",
      "author": "polarisol",
      "created": 1634788108,
      "upvotes": 5,
      "replies": {}
    },
    "hhgysj3": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhgysj3/",
      "text": "Postdoc here.\n\nI also started my phd as a 22f, with a large move to another far away city.\n\nMy post will probably be buried, but I want to just add another opinion. Everyone in this sub seems very anti-academia, which I totally get, but it’s not very nuanced. Sure mental health can be affected in grad school but it can be at other high powered jobs too. At least in academia you have time flexibility. Want to roll into the lab at 11am? No problem. You can’t do that at a 9-5.\n\nAnyway, my advice is talk to your supervisor. It sounds like you have a nice one. Be honest with them, and hopefully they can figure out a way to make parts of the experience more enjoyable. Maybe a different research project, or any change to make things a bit better. Classes suck, that’s true, but that’s just the first 2 years.\n\nI’m not saying that you need to stick to it and suffer but girl once you have a PhD no one can take that away from you. That is yours and yours forever. I think dropping out within a few weeks is a bit soon. Feel it out for a few more months, you owe that to yourself.\n\nAnd hot tip…you know how everyone else seems to have their shit together and is smart and doing well? Yea well they’re not. Don’t let others make you feel like an imposter. You deserve to be there and you’re just as smart and capable as the rest of them.",
      "author": "missdopamine",
      "created": 1634807664,
      "upvotes": 3,
      "replies": {}
    },
    "hhels3b": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhels3b/",
      "text": "I was in a similar position when I started my Experimental Physics PhD. I hated it. I knew the moment I started it wasn’t right, and I remember the instant I decided to quit was when I realised my job for the next three months was to sit and stare at an oscilliscope. I just didn’t care enough.\n\nI quit, did some temporary work for a few months and found a job doing government research as a civil servant. I loved it and eventually got my PhD in the field I was working in.\n\nEveryone is different and only you can decide what to do, but as others have said you really have to love what you’re doing to get through a PhD.\n\nTalk to your supervisor, and the wellbeing team at the uni. Maybe you can take a break and resume once you feel more up to it. But be honest - if it’s not for you it’s not for you. If that is the case it’s better for everyone to admit it.",
      "author": "dangerroo_2",
      "created": 1634760975,
      "upvotes": 3,
      "replies": {}
    },
    "hheod7w": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hheod7w/",
      "text": "My kids favorite math teacher was a former professor that started teaching on outschool dot com. I homeschooled but would get them into courses and programs with people that were smarter than me and taught neat stuff.  After they finished the four classes she offered, I retained her for 1 on 1 sessions to teach other math concepts that she could do a better job of. Their favorite finance and accounting teacher was a computer science grad student. This is all to say that there are a lot of options for teaching that don't have to be traditional and can be very rewarding, if you want to try it out.",
      "author": "SemanticBattle",
      "created": 1634762009,
      "upvotes": 3,
      "replies": {}
    },
    "hhf846g": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhf846g/",
      "text": "If you are feeling like this and you think you may want to teach then explore your options. There are a range of options open to you, from a PGCE to something like TeachFirst. Have a look and see what you think would suit you best. \n\nBUT! Be prepared. Contact a local school and arrange to go in and observe some classes.talk to students. Talk to teachers and school leaders. See if this is what you want. If you apply for a PGCE you will have to have spent some time in schools, anyway. \n\nIf you want some advice then please let me know. I’m happy to help. Good luck!",
      "author": "lianepl50",
      "created": 1634770354,
      "upvotes": 3,
      "replies": {
        "hhf8kuk": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhf8kuk/",
          "text": "Thank you for the advice. :)",
          "author": "FresaMalvada",
          "created": 1634770566,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhfetiw": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhfetiw/",
      "text": "Sounds like you should go get a master's degree and teach at the community college level. I really needed someone like you at my community college teaching math. Honestly if you want to teach below that - just go grab a teaching credential or try substitute teaching at your school district. Move back home and live off your parents for a bit. be honest with them. You are smart but school just is not for you at this time. Maybe in the future research will become important to you",
      "author": "Blinkinlincoln",
      "created": 1634773463,
      "upvotes": 3,
      "replies": {}
    },
    "hhg4z38": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhg4z38/",
      "text": "Get out.  Find something that lets you have a work life balance.  This is a perfect time to get out.",
      "author": "FawltyPython",
      "created": 1634785681,
      "upvotes": 3,
      "replies": {}
    },
    "hhggal1": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhggal1/",
      "text": "Go work and try other things, you're only 22. PhDs and academia will still be there years down the road if things lead you back to that. A key part of knowing what you want to do, is knowing what you don't want to do - so go have a bunch of new experiences and see where they lead you.",
      "author": "EVQuestioner",
      "created": 1634792211,
      "upvotes": 3,
      "replies": {}
    },
    "hhgn9l4": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhgn9l4/",
      "text": "No shame in leaving, but it might be worth seeing if this is just burnout first. Talk to your advisor ASAP.",
      "author": "TakeOffYourMask",
      "created": 1634797320,
      "upvotes": 3,
      "replies": {}
    },
    "hhfm3x6": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhfm3x6/",
      "text": "Chemist here.  I felt the same way through most of my PhD, I was totally lost.  I stayed because I didn't know what to do with myself immediately after quitting.",
      "author": "LLCoolJim_2020",
      "created": 1634776803,
      "upvotes": 2,
      "replies": {}
    },
    "hhgjnz3": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhgjnz3/",
      "text": "ah, not really words of advice but I'm (25F) a third year physics phd student and my first year was absolute absolute hell and i basically survived off of homework extensions (especially in the covid semester) -- and a ton of help from my friends, even into my second year but my health was pretty poor (both mental and physical due to basically not eating enough nutritious food). \n\nand that constant feeling that i was a huge disappointment to my adviser didn't really go away until a few months ago (and even periodically i expect it to pop up). \n\nA friend of mine left after her master's and got a data job so that's an option and I've been on the verge of quitting so often but really never had a clue what else to do lol. for now i think i can say I'm content to let things unfold in the program. I will say that a ton of people immediately advise quitting (and I was told the same at one point when i made a post as an undergrad going Through It) but for now I'm glad i stuck it out. the process of research and learning can be cool sometimes IF you're not a constant depressed and anxious fuck like i was my first two years\n\n(oh yeah and i don't plan on staying in academia long term and neither do a good deal of my friends -- but cool for us to be in ~academia for a few years)",
      "author": "knowuow",
      "created": 1634794566,
      "upvotes": 2,
      "replies": {}
    },
    "hhgoxan": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhgoxan/",
      "text": "get your MS and leave!",
      "author": "isaac-get-the-golem",
      "created": 1634798672,
      "upvotes": 2,
      "replies": {}
    },
    "hhgq5m2": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhgq5m2/",
      "text": "Then do the smart thing and quit. Seems like you’re miserable. There is nothing wrong with stopping something you hate. People change jobs all the time, that’s what this is. A job … and not worth your mental health !!!",
      "author": "Computer_says_nooo",
      "created": 1634799723,
      "upvotes": 2,
      "replies": {}
    },
    "hhgthba": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhgthba/",
      "text": "I’m in the same boat. I feel like I’m just going through the motions and not enjoying my life right now. Im away from all my friends and family and don’t like my new city. I just can’t tell if this means I should leave or if I should wait until I do get a better support system here",
      "author": "Remolacha_Azul",
      "created": 1634802664,
      "upvotes": 2,
      "replies": {}
    },
    "hhh6h15": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhh6h15/",
      "text": "Definitely quit and focus on your health and the next step on moving forward- specifically giving yourself time to figure out what that may be. You are obviously an intellectual, so I wouldn't worry about what any one else thinks. You are young. This is a time to give yourself room to process and move freely- without dread. There's enough unnecessary stress in daily life, so nip and better what you can for yourself now.",
      "author": "renebanae",
      "created": 1634814154,
      "upvotes": 2,
      "replies": {}
    },
    "hhh9ejy": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhh9ejy/",
      "text": "same.",
      "author": "porraSV",
      "created": 1634816150,
      "upvotes": 2,
      "replies": {}
    },
    "hhhlbvw": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhhlbvw/",
      "text": "The first thing that impressed my is that you're extremely young. As others have said, it is better if you decide you want to quit in the early stages, so if you really feel that way go ahead. You can still try many things and return to academia in a few years with a more solid understanding of what you want to do.",
      "author": "aNu2001",
      "created": 1634822911,
      "upvotes": 2,
      "replies": {}
    },
    "hhhlcr9": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhhlcr9/",
      "text": "The first thing that impressed my is that you're extremely young. As others have said, it is better if you decide you want to quit in the early stages, so if you really feel that way go ahead. You can still try many things and return to academia in a few years with a more solid understanding of what you want to do.",
      "author": "aNu2001",
      "created": 1634822923,
      "upvotes": 2,
      "replies": {}
    },
    "hhhlmcs": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhhlmcs/",
      "text": "I've been very hesitant to start mine after my master, thanks for the advice everyone",
      "author": "Jtktomb",
      "created": 1634823053,
      "upvotes": 2,
      "replies": {}
    },
    "hhhtadd": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhhtadd/",
      "text": "If you are 22, you are incredibly young for a PhD student (I hardly know anyone who ever did it before they were 30), so you should take the opportunity to rethink the career path. Many people don't start studying for what they want to do before mid-20s, so I would just reset and start afresh with whatever you have an interest or passion for.",
      "author": "Zaknafein2003",
      "created": 1634826588,
      "upvotes": 2,
      "replies": {}
    },
    "hhi33df": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhi33df/",
      "text": "You’re so young. Take 2-4 years off. Work. Find your passion and develop some of your life before beginning again.",
      "author": "doctorpolitik",
      "created": 1634830757,
      "upvotes": 2,
      "replies": {}
    },
    "hhi58tn": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhi58tn/",
      "text": "OP, as a young women in STEM I understand your need to feel smart. I work In neuroscience and still get imposter syndrome and that I don’t belong. I also feel I want my PhD partly for similar reasons- to prove I’m not a dumb blonde. I found that for me, the best move was to get a job in academia doing research (which I love), and that not having a degree doesn’t matter right now. \nI would suggest, like others have said, don’t do the PhD right now. You can go back at any time and try again- do not put that kind of pressure on yourself right now. And don’t worry about what your cohort or anyone else will think if you drop (because I can bet that’s on your mind as well). You are not a failure or anything, you are just taking the necessary steps to ensure that future You is in a better place mentally and doing something they find meaningful and enjoyable in life.",
      "author": "rainbowbunny09",
      "created": 1634831640,
      "upvotes": 2,
      "replies": {}
    },
    "hheozub": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hheozub/",
      "text": "well one thing is clear - you must quit your PhD and take it from there. Do something you truly like to do (if your mom hated being a teacher then .. why do it?). Life is short make it worthwhile.",
      "author": "hb15217",
      "created": 1634762254,
      "upvotes": 4,
      "replies": {}
    },
    "hhfip91": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhfip91/",
      "text": "High School math teaching can be tough. Physics may be a bit easier to teach in HS because it gets the seniors who want to learn.",
      "author": "TheBerensteinBear",
      "created": 1634775259,
      "upvotes": 2,
      "replies": {}
    },
    "hhfpq9d": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhfpq9d/",
      "text": "Honestly, if you hate it then why bother, at least right now? If you in therapy because of this, obviously it's not the right choice, if it's something else I would suggest dealing with that first instead of wasting money and sanity on something you don't even really want to do",
      "author": "CommanderMadness",
      "created": 1634778458,
      "upvotes": 2,
      "replies": {}
    },
    "hhetojj": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhetojj/",
      "text": "Do you think you can get through the rest of the year? You have 7 or so months between now and next summer where you can keep getting your stipend while making sure you don't want to stay in the PhD figuring out what's next. Use that time to think really deeply about what you want to do and talk to people in those alternate career paths. Try to tutor or do outreach to high schools to get a better sense of you'll like teaching before committing to that, etc.",
      "author": "mediocre-spice",
      "created": 1634764112,
      "upvotes": 1,
      "replies": {}
    },
    "hhha59q": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhha59q/",
      "text": "Quit. You can go find a job and work for a while. You can always go back to school. I am in my 30s and just finished my BS in physics last year. Take some time to figure out what you want to do.",
      "author": "diabolical_diarrhea",
      "created": 1634816616,
      "upvotes": 1,
      "replies": {}
    },
    "hhghgrp": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhghgrp/",
      "text": "I had the same issue in the first year of my chemistry PhD program. It was a nice program with lots of great people and great funding, but I had spent four years getting my bachelor's and two more getting my master's degree, and all six of those years I was in research labs busting my butt. Quite frankly, I had sat through enough classes about chemistry in the preceeding 6 years that the ones that they were making me take for my PhD were incredibly boring to me. \n\nThe idea of finishing my first semester and doing another semester of classes while attempting to get a foothold in research lab with covid happening while adjusting to a new place far away from my home.... While trying to move into my own place properly ( I was staying with my best friend) AND deal with some depression and my ADHD...\n\nSuffice to say that I spoke with some trusted people in my life and presented the situation to them and told them that I wanted to quit. These individuals said it was obvious I had thought it through and that I could always go to another PhD school in the future and that it was no wonder I was burned out after 6 years of academia. I decided that night that I was quitting, I think it was the beginning of October 2020. \n\nI politely emailed My department chair and research advisor (who had just accepted me into his research group, oops!) and informed them of my decision with a couple of reasons listed. I met with them and they talked with me and they were understanding. I emailed my supervisor for my teaching assistantship with my letter of resignation, which was basically just me saying that I was going to let my contract expire and continue teaching my classes I'd been assigned for the term. \n\nLess than two weeks after I made a decision I moved back home, stopped attending classes, and The only thing I did was to teach my remaining online classes (thankful that I managed to have my recitations online, woo).\n\n\nSo that's my experience. Now that I've had a year off to do other things and take my mind out of academia, I'm reapplying to PhD programs and hope to be attending next fall or thereabouts. As it turned out, I've just needed a break from it all, but I'm ready to give it one more try at another school closer to home!\n\nBest wishes, just remember to do what's best for you!",
      "author": "AmbassadorJJ",
      "created": 1634793008,
      "upvotes": 1,
      "replies": {}
    },
    "hhqdjsn": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhqdjsn/",
      "text": "wow your still so young . i started my bachelors degree at 23 . you can still do so much whether you quit now or later on . its actually a win win situation for  you",
      "author": "jesuscarl",
      "created": 1634989066,
      "upvotes": 1,
      "replies": {}
    },
    "hhfr4ij": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhfr4ij/",
      "text": "Not in the sense of being condescending or looking down on u but I experienced these exact same feelings when I first started my PhD, and my friend of 10 years committed suicide shortly at the start of my second term. Sure being in grad school isn’t for everyone, but to expect it to be sunshines is completely oblivious. It does get better, and the pride and accomplishments will come. But not being able to handle 2 months before considering giving up, I don’t respect that.",
      "author": "animelover9595",
      "created": 1634779104,
      "upvotes": -9,
      "replies": {
        "hhfrts9": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhfrts9/",
          "text": "I don’t really feel like this comment is appropriate, thanks for sharing your experience but like this is kind of shitty to say. You have no idea what I’m dealing with. \n\nI also just had a friend commit suicide and I was recently sexually assaulted. I’ve also dealt with mental health struggles since I was 8 years old. \n\nI share this because I think you should perhaps be more mindful of who you say you can’t respect. :/",
          "author": "FresaMalvada",
          "created": 1634779428,
          "upvotes": 5,
          "replies": {
            "hhfs2qo": {
              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhfs2qo/",
              "text": "But in retrospect everyone goes through challenges in life, isn’t it more fulfilling to overcome them instead of walking away? Like why even attempt doing a PhD in the first place?",
              "author": "animelover9595",
              "created": 1634779541,
              "upvotes": -8,
              "replies": {}
            }
          }
        },
        "hhgtsp1": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhgtsp1/",
          "text": "Oh no, animelover9595 doesn’t respect OP? :( should we call a press conference? Do you really think you can shame someone into doing something that might not be right for them? Weirdo.",
          "author": "Remolacha_Azul",
          "created": 1634802957,
          "upvotes": 3,
          "replies": {
            "hhiqv5y": {
              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhiqv5y/",
              "text": "Lol. Thank you for this. 😂",
              "author": "FresaMalvada",
              "created": 1634840296,
              "upvotes": 1,
              "replies": {
                "hhpnewr": {
                  "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhpnewr/",
                  "text": "Of course, of course. Strawberries and turnips have to stick together lol",
                  "author": "Remolacha_Azul",
                  "created": 1634966656,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hhh7qzx": {
              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhh7qzx/",
              "text": "Ok relax snowflake, I’m not shaming anyone and I never meant to come off as condescending. I am pro mental health and I know how hard a PhD is, I’ve been doing it if u haven’t noticed u illiterate. How are u any better berating me? Gtfo",
              "author": "animelover9595",
              "created": 1634815060,
              "upvotes": -1,
              "replies": {
                "hhpnacu": {
                  "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhpnacu/",
                  "text": "Your 8 downvotes and OPs reaction clearly show that your comment was neither helpful nor kind. And you seem to be projecting pretty strongly onto me. Your disproportionate reaction makes me think the only snowflake here is you 🤷🏻‍♀️",
                  "author": "Remolacha_Azul",
                  "created": 1634966561,
                  "upvotes": 1,
                  "replies": {
                    "hhqxktu": {
                      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhqxktu/",
                      "text": "Maybe we should call a press conference on how fucking retarded u are. I have a solid pub record, refs, and on track to graduating soon so kindly fuck off thxs",
                      "author": "animelover9595",
                      "created": 1635001576,
                      "upvotes": 0,
                      "replies": {
                        "hhxrp2d": {
                          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhxrp2d/",
                          "text": "You sure sound smart",
                          "author": "Iridium777",
                          "created": 1635127385,
                          "upvotes": 1,
                          "replies": {
                            "hhy07qb": {
                              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhy07qb/",
                              "text": "K",
                              "author": "animelover9595",
                              "created": 1635131915,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hhg5xl5": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhg5xl5/",
          "text": "This is all assuming that pursuing a PhD is right for anyone who tries. It’s not. Everyone is different. Everyone gets satisfaction and fulfillment from different things, and happiness is ultimately all that matters in life. Asserting that every smart person that is capable of completing a PhD program *should* complete the program at the risk of their own mental and physical health is exactly why academia is so fucking toxic.",
          "author": "howfreakingamazing",
          "created": 1634786170,
          "upvotes": 2,
          "replies": {
            "hhh7zq2": {
              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhh7zq2/",
              "text": "It’s not my assertion, but what’s the difference between pro-quitting culture and pro-mental heath if we encourage everyone to quit the first moment they experience something difficult? I do not know op’s circumstances, but I do know they’re considering quitting after 2 fucking months. 2 months isn’t even a term, and that’s my issue.",
              "author": "animelover9595",
              "created": 1634815227,
              "upvotes": -2,
              "replies": {
                "hhkwjer": {
                  "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhkwjer/",
                  "text": "I've never heard of \"pro-quitting\" culture. Is that when people stop doing things that make them absolutely miserable? Sounds ok to me.",
                  "author": null,
                  "created": 1634875348,
                  "upvotes": 2,
                  "replies": {
                    "hhmalnq": {
                      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhmalnq/",
                      "text": "I’m not dismissing mental health or how difficult a PhD is, I’ve experienced both. Imagine never walking because u fell down one time. Bunch of leftist snowflakes nowadays ig 😂",
                      "author": "animelover9595",
                      "created": 1634910171,
                      "upvotes": -1,
                      "replies": {
                        "hhminro": {
                          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhminro/",
                          "text": "You're just trying to make this political because you are clearly an angry person and see everything through your Republican lens. Left=bad.",
                          "author": null,
                          "created": 1634913521,
                          "upvotes": 1,
                          "replies": {
                            "hhmjn24": {
                              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhmjn24/",
                              "text": "Op should have quit on day 1 then. It doesn’t change the fact that I will attain my PhD and op doesn’t. No it doesn’t make me happy, if anything I’m angry that op gave up so easily.",
                              "author": "animelover9595",
                              "created": 1634913913,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhf7jav": {
      "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhf7jav/",
      "text": "Think again, I don’t think teaching math is in demand. I am close to graduation as a Math PhD and most teaching jobs at small colleges are insanely competitive.",
      "author": "Wild_Sir8813",
      "created": 1634770098,
      "upvotes": 0,
      "replies": {
        "hhf8j76": {
          "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhf8j76/",
          "text": "I was thinking more middle/high school… are those as bad? From the postings around my area it seemed like there was a lot of availability.",
          "author": "FresaMalvada",
          "created": 1634770544,
          "upvotes": 4,
          "replies": {
            "hhfbrmv": {
              "link": "/r/AskAcademia/comments/qc4o2t/i_dont_think_i_want_to_get_my_phd_anymore_but_i/hhfbrmv/",
              "text": "There is definitely demand for secondary level math teachers (and physics, and science in general, if you'd be open to teaching any of those).  That said, K-12 teaching is HARD (I'm saying this as someone who taught middle school science for a few years; I decided to go back for my PhD in a science field instead of continuing to teach).  \n\nYou should have no problem finding a job if you go for a teaching certificate, but if you want to be a good teacher it will take up a LOT of your time and can be very physically, mentally and emotionally draining.  Depending on where you teach, you may also deal with low pay, terrible admin, adversarial parents, students who are not having their basic needs met at home, and a whole host of other problems (and this is before you add in the effects of a global pandemic that severely stunted kids' emotional and academic growth).  I'm not saying this to discourage you, just consider really carefully before you commit the time, money and effort to pursue public school teaching.",
              "author": "tectonic_fever",
              "created": 1634772035,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}