{
  "sid": "pbfth4",
  "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/",
  "title:": "Almost 70% of Orgo class faked their lab assignments?",
  "text": "I am a TA for Organic Chemistry 2 lab. This is the first in-person lab session since COVID brought everything online. I also was the TA for Orgo 1 lab before COVID. A new issue came up when I was checking the students' results for their first lab. \n\nI started spot-checking melt temps of their samples vs notebooks and noticed that NONE of them matched. I went through and pulled all of their samples and 28/40 of them were completely made up. Like the melt temps were 20*C off of what they wrote in the notebook. It seems like they just looked up the melt temp of their synthesis on Wikipedia and wrote that down instead of reporting their result.  I have never had this problem before. Actually, every time I have checked their results previously, there was no discrepancy. \n\nShould I remind the class to accurately report their results, or go to the section lead?",
  "author": "DevinC0peland",
  "created": 1629911982,
  "updated": 1634079486,
  "over_18": false,
  "upvotes": 47,
  "upvote_ratio": 0.92,
  "comments": {
    "haca3ra": {
      "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/haca3ra/",
      "text": "Go to the section lead. It's not your job to make up class policy on the fly.",
      "author": "bigrottentuna",
      "created": 1629924872,
      "upvotes": 84,
      "replies": {}
    },
    "hacxyt9": {
      "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hacxyt9/",
      "text": "I TAed a micro lab for a few years, but was the lead the last 2 years. My first year, I noticed data falsification in the lab report. The student had a very strange result for a biochemical test, and I have a very good memory when it comes to things like that. Instead of discussing the strange result, the student just reported what they should have gotten. I took them aside, explained that it was an issue and why, and then let them know that future violations could be considered academic misconduct. This past year, I made a big deal about data falsification at the beginning of the semester, including that I wasn’t going to take off points for “incorrect” data as long as the students were following instructions. Labs are supposed to be learning opportunities. You won’t be perfect at everything. This seemed to help the students be more comfortable with coming to me with questions or issues they were having too. \n\nI’d definitely reach out to the lead before doing anything, but the above seemed to work really well for me.",
      "author": "2Black_Cats",
      "created": 1629935276,
      "upvotes": 28,
      "replies": {
        "hahjlkg": {
          "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hahjlkg/",
          "text": "I'd recommend against doing this. I understand the good intention behind it and it might've worked out in this case, but a TA isn't supposed to make up class policy on-the-fly. The TA is just opening themselves to claims of bias and unfairness, if they choose to penalize someone else for the same or worse offence. Just report it and let those who are equipped to deal with these things deal with them.",
          "author": null,
          "created": 1630019279,
          "upvotes": 4,
          "replies": {
            "hahv553": {
              "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hahv553/",
              "text": "Well, in my case, I was the lead instructor and had full control over class policies. I was probably too naïve my first year as lead, so I didn’t even realize it would be an issue. As soon as I did realize it was a problem, I let the student know individually and then discussed it with all of the students so everyone was on the same page. I learned my lesson though, and added it to my syllabus as well as discussed it on the first day of class my second year. OP should absolutely discuss it with the lead, as I said, before deciding to do anything.",
              "author": "2Black_Cats",
              "created": 1630024695,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "had2xhr": {
      "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/had2xhr/",
      "text": "As an undergrad who always did more work because I accurately reported results, please go to the section lead. It shows the students who care about the work that you care about their efforts.",
      "author": "Shio-zhi",
      "created": 1629937539,
      "upvotes": 8,
      "replies": {}
    },
    "hadbtun": {
      "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hadbtun/",
      "text": "God, I remember teaching separate labs for physics majors, engineers, and pre med.  The pre med students constantly cheated and tried to sabotage other people's experiments.  Never had any trouble with the others.",
      "author": "bedknobsandbroomstix",
      "created": 1629941544,
      "upvotes": 6,
      "replies": {
        "hadenpk": {
          "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hadenpk/",
          "text": "It's honestly disturbing how much academic dishonesty there is among a group where the stakes couldn't be higher.",
          "author": "rkgk13",
          "created": 1629942809,
          "upvotes": 5,
          "replies": {
            "haf2841": {
              "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/haf2841/",
              "text": "Isn't that why there would be so much cheating? When the stakes are so high and the competition so intense that people feel like they have to cheat in order to make it?",
              "author": "salsadad",
              "created": 1629982160,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hafm3el": {
          "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hafm3el/",
          "text": "Pre meds truly are the scum of the earth",
          "author": "CptS2T",
          "created": 1629990919,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hac5uil": {
      "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hac5uil/",
      "text": "Hhhmmm tough call. Reporting it is important but so is warning the students. Can you think of an idea to have them fix it, and then take the problem + solution to the Lead for approval of your choice of action?",
      "author": "Blippii",
      "created": 1629923170,
      "upvotes": 16,
      "replies": {
        "had9uf8": {
          "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/had9uf8/",
          "text": "He could tell them that he spot checked the results - they have 24h to submit updated results, and any incorrect results still pending will be reported to the section head. Depending on how involved/helpful the section head is, they could run it by them first. \n\nI think this is a tough situation too - as an undergrad student, I lost marks in orgo because my accurately reported results were not close enough to the expected results, but people in my section who fudged their data got full marks, and this left a really bitter taste in my mouth. As a grad student now, my first instinct was to take it straight to the section head (but I also generally have a good/casual relationship with my supervisors).",
          "author": "meddwannabe",
          "created": 1629940648,
          "upvotes": 24,
          "replies": {
            "hadage0": {
              "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hadage0/",
              "text": "I've had this experience too. Good on you for reporting the data as it was.",
              "author": "IHTFPhD",
              "created": 1629940923,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hacut7j": {
      "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hacut7j/",
      "text": "I'd do both. This was a huge pet peeve of mine in undergrad. I got points taken off because I used my data to identify a chemical formula. I acknowledged that it was wrong and why it was wrong. My classmates fudged their numbers and got it correct.  \n\n\nAcademic integrity is important and if they're willing to cheat like this in a lab class, I'd hate to see what they'd do in an actual research lab/if they're treating patients.",
      "author": "RoyalEagle0408",
      "created": 1629933816,
      "upvotes": 23,
      "replies": {
        "hadvwm6": {
          "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hadvwm6/",
          "text": "I agree with talking to his section lead and all of that. Obviously the students following the rules shouldn't be at a disadvantage.\n\nBut I think the hand-wringing over \"oh what will they do to their patients?\" or what not is pretty unreasonable. People will behave differently when their actions have consequences that matter, and lying on some random ochem lab assignment doesn't mean they're going to lack empathy for another human's health.",
          "author": "freet0",
          "created": 1629951575,
          "upvotes": 4,
          "replies": {
            "hae55j8": {
              "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hae55j8/",
              "text": "This is not true: the research repeatedly shows people who cheat in school are more likely to cheat in real life when actions have consequences.\n\nOne example found quickly by Googling:\n\n\"People who cheat on exams in high school are three times more likely to lie to a customer or inflate an insurance claim compared with those who never cheated. High school cheaters are also twice as likely to lie to or deceive their boss and one-and-a-half times more likely to lie to a significant other or cheat on their taxes.\"\n\nhttps://www.apa.org/monitor/2011/06/cheat\n\nThere are other negative effects. I cannot find it now but remember reading students who plagiarize are less able to tell reliable from unreliable sources. I think we've all seen over the last two years how important that is in real life.",
              "author": "radams78",
              "created": 1629957621,
              "upvotes": 6,
              "replies": {
                "hae7vex": {
                  "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hae7vex/",
                  "text": "I'm sure that [Massachusetts chemist who faked positive drug test results](https://www.npr.org/sections/thetwo-way/2017/04/20/524894955/massachusetts-throws-out-more-than-21-000-convictions-in-drug-testing-scandal) was probably doing the same things in college, too.",
                  "author": "set_null",
                  "created": 1629959635,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hadx855": {
              "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hadx855/",
              "text": "“Some random ochem assignment” may not be on par with someone’s life, but it’s good to teach people that actions have consequences. Also I never said “oh what will they do to their patients”. My point was that if they’re willing to fudge stuff, are they really cut from the proper ethical cloth to be a doctor? Sorry that I, as a researcher, take academic integrity seriously.if you’re willing to cheat when the stakes are incredibly low, what do you do when they are high? That is what concerns me.",
              "author": "RoyalEagle0408",
              "created": 1629952337,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hadncd9": {
      "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/hadncd9/",
      "text": "I know someone who got his master's dissertation from Google scholar and got t highest grade for it. He was offered a PhD because of it but left while he was ahead. He copied nearly all coursework through undergrad and masters (we'd all work together and he'd put in no input), and he'd remember previous year exam answers in hope for repeat questions, and he got lucky.\n\nThe luckiest cheater I've ever heard of. Managed to get a degree and masters in maths without knowing the difference between partial differential and normal differential...",
      "author": "PersonalZebra8993",
      "created": 1629946931,
      "upvotes": 3,
      "replies": {}
    },
    "had9p6u": {
      "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/had9p6u/",
      "text": "Against all other opinions here, I would like to point out that this is Organic Chem Lab 2 where students still probably don't know how to accurately determine melting point in a compound that may be impure. Honestly, a 20 degree spread with those considerations in mind is nothing.",
      "author": "heliumagency",
      "created": 1629940582,
      "upvotes": 6,
      "replies": {
        "haeqh05": {
          "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/haeqh05/",
          "text": "It says 20°C off from the number the students wrote down in their notes during the experiment compared to the value they reported. NOT 20°C between reported and correct value",
          "author": "DeepSeaDarkness",
          "created": 1629975047,
          "upvotes": 5,
          "replies": {
            "haezvhv": {
              "link": "/r/AskAcademia/comments/pbfth4/almost_70_of_orgo_class_faked_their_lab/haezvhv/",
              "text": "OP notes that he was comparing \"sample\" to vs notebook value, which does not suggest he was comparing notebook values to reported values as you suggested.",
              "author": "heliumagency",
              "created": 1629980927,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}