{
  "sid": "p3syog",
  "link": "/r/AskAcademia/comments/p3syog/pushing_through_overwork/",
  "title:": "Pushing through overwork",
  "text": "Hi everyone,\n\nJust want to ask that why is overworking celebrated? It really bothers me that everyone shoves as much work as they can down your throat, till you burn out. A new student will mostly likely in all possible scenarios will never say no to anything that their advisor/collaborator ask them in a hope of proving themselves. Hell, it took me 3-4 years well into my PhD to stop caring about things in general and focus on what you really want which in long term is pathetic because I was so burnt out by then that there was no coming back. The same is true everywhere (also in industry). Why just can't people ask whether you already have a lot on your plate rather than just assuming you can do it. \n\nThis really scares me off because they way I see it it's getting worse everyday, and I am glad that there are more and more studies are coming out with a focus on more work life balance. \n\nAlso, work is a very recent phenomenon (may be 400-500 years). It seems like a propaganda to me that everywhere I look people seems to pushing this propaganda that work defines you and all that crap. I don't think Adam and Eve was born just to work their life out. I understand that human beings are explorers but selling it as work propaganda disguise is pushing it way too much.",
  "author": "AtmosphereSingle6533",
  "created": 1628885097,
  "updated": 1634079630,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.8,
  "comments": {
    "h8u83x4": {
      "link": "/r/AskAcademia/comments/p3syog/pushing_through_overwork/h8u83x4/",
      "text": "[deleted]",
      "author": null,
      "created": 1628892636,
      "upvotes": 7,
      "replies": {
        "h8ufgf0": {
          "link": "/r/AskAcademia/comments/p3syog/pushing_through_overwork/h8ufgf0/",
          "text": "I totally agree on working in a lab that treats it like a business rather than glorified slavery. Another perspective is giving so much power to a human being that you feel helpless most of the times, and the only way out is forcing your way out. I feel sorry for those who are in this environment and still have the energy to continue. Kudos to them, really!\n\nAs of now, I am trying hard to finish with almost an industry offer at hand, but their goals just keep getting pushed farther and farther everyday. It use to bother me a lot, I use to get emotional and angry but slowly and steadily, I have accepted that I don't have a control in anything and the only thing I can do is to negotiate my way out smartly and slyly.",
          "author": "AtmosphereSingle6533",
          "created": 1628895914,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}