{
  "sid": "r0spck",
  "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/",
  "title:": "Unsure of how to incorporate indigenous ontologies",
  "text": "I'm a graduate student working at the intersection of art and technology, examining how various ontologies can inform our relationship with artificial intelligence.  I'm not native american (latinx), yet want to incorporate various first nations and indigenous ontologies into my research.  I'm  unsure of how to best approach doing so with sensitivity, respect, and care.  The last thing I want to do is appropriate cultural beliefs or misrepresent them.  Has anyone experience this in their research or otherwise have advice?  I thought about broadening the themes at play to be fairly non-specific and more universal (i.e. reciprocity with nature,  the notion that the sacred, spirit, power, or something akin moves in all things ( though not equally), animism, et cetera.)",
  "author": "anoddlittlebird",
  "created": 1637716893,
  "updated": 1639839471,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.73,
  "comments": {
    "hluwi1r": {
      "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hluwi1r/",
      "text": "Have you delved into cultural anthropology at all? You might try researching the \"ontological turn in anthropology\" if you're not familiar with it. Also, careful with applying monolithic, universal stereotypes - you mention \"first nations and indigenous ontologies\" and this is correct - there is no one, single indigenous ontology, there are ontologies, plural, as you note. I would be cautious with any argument about universal elements of indigenous ontologies such as reciprocity with nature, etc. Many do make the case for these universals, but you will also find pushback against it.",
      "author": "Various-Grapefruit12",
      "created": 1637725615,
      "upvotes": 16,
      "replies": {
        "hluy2d3": {
          "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hluy2d3/",
          "text": "I haven't, but will begin investigating such.  Admittedly, I'm quite new to this thread of research (and research in general.)     \n\n\nWell cautioned / said on monoliths.  100% trying to avoid.    \n\n\nIt's a new space for me to navigate; I feel there's validity in bringing in non-western perspectives, particularly indigeneity, but not being of any such group, I'm just not sure how to approach this.",
          "author": "anoddlittlebird",
          "created": 1637726403,
          "upvotes": 4,
          "replies": {
            "hlv0ji8": {
              "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlv0ji8/",
              "text": ">I feel there's validity in bringing in non-western perspectives\n\nI definitely agree and I think your project sounds super fascinating! I'm sure you'll start figuring things out the longer you stick with it. Best of luck, and I'd definitely recommend taking some (cultural) anthropology courses if you're able to!",
              "author": "Various-Grapefruit12",
              "created": 1637727682,
              "upvotes": 5,
              "replies": {
                "hlv0r9k": {
                  "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlv0r9k/",
                  "text": "Thank you so much!  Sounds silly, but a little encouragement goes a long way!",
                  "author": "anoddlittlebird",
                  "created": 1637727793,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hluvx6y": {
      "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hluvx6y/",
      "text": "There is a growing body of lit on this issue.  Here are a couple of resources:\n\n[http://www.indigenous-ai.net/](http://www.indigenous-ai.net/)\n\n[https://jods.mitpress.mit.edu/pub/lewis-arista-pechawis-kite/release/1](https://jods.mitpress.mit.edu/pub/lewis-arista-pechawis-kite/release/1)\n\n[https://policyoptions.irpp.org/magazines/february-2018/how-can-indigenous-knowledge-shape-our-view-of-ai/](https://policyoptions.irpp.org/magazines/february-2018/how-can-indigenous-knowledge-shape-our-view-of-ai/)",
      "author": "matthewsmugmanager",
      "created": 1637725328,
      "upvotes": 7,
      "replies": {
        "hluwrdl": {
          "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hluwrdl/",
          "text": "I appreciate that and I'm aware of the growing body of lit, particularly Kite's work.  My question is more about how to appropriately cite and use these ontologies in my work.  That is something that is new to me and, in some respects, more general.",
          "author": "anoddlittlebird",
          "created": 1637725747,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlwtxvi": {
      "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlwtxvi/",
      "text": "Like the other commenter said, I would be careful of homogenizing \"Indigenous ontologies.\"\n\nImho, \\[anthropology PhD candidate here\\], this is a really trendy move in academia these days, but it's rarely done well. There's a tendency to use \"Indigenous ontology\" (or knowledge, or whatever) as bookends to an otherwise totally conventional project, or to position it as a sort of deus ex machina that will solve all the problems of \"Western\" ontology. \n\nIf I were you, I'd start by thinking about why you want to do this. And not just in a \"Academia has been steamrolling Indigenous thought for a few centuries and maybe we should stop,\" kind of way, but one that's specific to your project. Why is this a good/interesting/necessary approach to the specific questions that you're asking? & this may necessitate more detailed research about actual specific Indigenous ontolog*ies*. \n\nI'd also caution against thinking about ontologies in the way that some academic fields think about theories - like they're sets of propositions that you can adopt and put down at will, or \"persectives\" one can step into and out of with ease. In many cases, they are not. Further, taking other (viz. academia) ontologies seriously may actually entail direct conflict with the goals and assumptions of Western academia. If/when this becomes this case, what will you do? To whom do you see yourself as accountable?",
      "author": "parsleybutter",
      "created": 1637768588,
      "upvotes": 8,
      "replies": {
        "hlxes74": {
          "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlxes74/",
          "text": "This is an amazing comment and, in many respects, addresses the heart of why I broached the subject in the first place.  I'm acutely aware of the trend and want to avoid association with it, as much as any one researcher can while not being native.  To be clear, this isn't a reaction to the noted trend or an ill-advised effort to shoe-horn in indigeneity: my research interests are born from a decade's+ personal and professional experience with puebloan culture in the american southwest.  Moreover, the composition of contested and linked understandings of life and balance have shaped my own personal philosophies - I'd like to formalize that interest as a scholar and bring it into concert with my work as an artist.   If you're familiar with the film 80's avant-garde film \"koyaanisqatsi\", and the Hopi origins of the phrase as well, the notion of an imbalance related to our increasingly technologized age is central.\n\nYour last paragraph is deserving of deeper consideration and, if I fully go down this road, something I will have to grapple with again and again.  I already feel a tension, even if I don't feel the need to resolve it (yet.)\n\nthank you for your note.",
          "author": "anoddlittlebird",
          "created": 1637776814,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlupsbw": {
      "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlupsbw/",
      "text": "The Faculty of Native Studies at the University of Alberta has a research specialization in Indigenous Science, Technology and Society that might be of interest: https://www.ualberta.ca/native-studies/research/indigenous-sts.html",
      "author": "litonotus",
      "created": 1637722370,
      "upvotes": 9,
      "replies": {}
    },
    "hlvaw5k": {
      "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlvaw5k/",
      "text": "What is latinx?",
      "author": "grandpassacaglia",
      "created": 1637733543,
      "upvotes": 2,
      "replies": {
        "hmbduju": {
          "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hmbduju/",
          "text": "A shitty attempt a a gender neutral word for \"latino/latina\"\n\nThing is, its an english \"word\" invented by sheltered americans. So its pretty much considered a slur to most hispanics and latinos. Since it not only insults the spanish language, but also insults the identity of the people from spanish speaking countries",
          "author": "CruzTheSasquatch",
          "created": 1638045549,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlv4izg": {
      "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlv4izg/",
      "text": "[removed]",
      "author": null,
      "created": 1637729824,
      "upvotes": 1,
      "replies": {
        "hlv4s82": {
          "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlv4s82/",
          "text": "A gender-neutral American English neologism :)",
          "author": "anoddlittlebird",
          "created": 1637729970,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlx0ykj": {
      "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlx0ykj/",
      "text": "Why would you want to? We have science now, we dont need to worry about myths and superstition from backwards people, unless you are specifically doing anthropology and documenting folk beliefs.\n\nYou might as well ask how belief in dragons and fairies can inform our relationship with artificial intelligence. In a world beset with anti-vax and climate change denial, is this really the time to start pretending that random unscientific woo deserves to be taken seriously?\n\n> the notion that the sacred, spirit, power, or something akin moves in all things \n\nspoiler: it doesnt",
      "author": "MoneyPrize2283",
      "created": 1637771411,
      "upvotes": -6,
      "replies": {
        "hlxavow": {
          "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlxavow/",
          "text": "What an ignorant comment, not only of indigenous thought but science too",
          "author": "meanmissusmustard86",
          "created": 1637775296,
          "upvotes": 4,
          "replies": {
            "hlxcbtl": {
              "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlxcbtl/",
              "text": "To the extent that \"indigenous thought\" is true, its easily incorporated into science (e.g. traditional folk beliefs about the medicinal properties of herbs/etc that turned out to be accurate). The remainder is just religion and doesnt really have any place in the modern world. You wouldnt start trying to incorporate stories from the Bible into science or asking about what Genesis can teach us about evolution; theres no reason to treat \"indigenous\" beliefs as any more deserving of respect, just because of post-colonial guilt.\n\nReligion and mythology have no place in a scientific understanding of the world, full stop. If you actually want to help indigenous people in the modern world then helping them to learn about and trust science is a much better approach than pretending that silly folk beliefs about animism/dreamtime/whatever have any validity.\n\nIts concerning how much the public trust in science has deteriotated over the last few decades, and this sort of nonsense helps noone.",
              "author": "MoneyPrize2283",
              "created": 1637775859,
              "upvotes": -1,
              "replies": {
                "hlxfmv9": {
                  "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlxfmv9/",
                  "text": "here you are, with your own faith in a narrow view of the broad field of science.    \n\n\nthere is room for debate and to incorporate distinct views, full stop.",
                  "author": "anoddlittlebird",
                  "created": 1637777147,
                  "upvotes": 2,
                  "replies": {
                    "hlxgl2c": {
                      "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlxgl2c/",
                      "text": "So are you a climate change denier/anti-vaxxer/creationist? How much \"debate and distinct views\" should be incorporated into those discussions? Or is unscientific nonsense only worthy of respect when it comes from \"indigenous people\"?\n\nAlternative perspectives are welcome if they have some kind of empirical content (indigenous views on medicinal herbs, and traditional practices such as acupuncture that can be RCTed, are classic examples). But the idea that artificial intelligence should be sensitive to random primitive woo about evil spirits living up mountains or trees having souls is just beyond stupid. You know as well as I do that none of that stuff is actually true, why pretend otherwise?\n\nThere is legitimate debate about the extent to which artificial intelligence research has accidentally incorporated incorrect philosophical beliefs about epistemology/metaphysics and whether different perspectives can be useful and enlightening (Hubert Dreyfus' famous [critique](https://en.wikipedia.org/wiki/Hubert_Dreyfus%27s_views_on_artificial_intelligence) of GOFAI on connectionist/Heideggarian grounds is the classic example, along with the longstanding debates over embodied/embedded cognition) but the point is that these discussions are based around actual rational arguments, rather than baseless spiritual/religious beliefs. Its certainly possible that aspects of religious belief systems can form the basis for philosophical frameworks if they can be supplemented with rational arguments (several Western philosophers have been influenced by non-Western religions for example) but the idea that religious nonsense should be taken seriously at face value because of \"cultural sensitivity\" has no place in the modern world.",
                      "author": "MoneyPrize2283",
                      "created": 1637777523,
                      "upvotes": 0,
                      "replies": {
                        "hlxhexd": {
                          "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlxhexd/",
                          "text": "[Something for you to jump to](https://www.google.com/search?q=conclusions&rlz=1C5CHFA_enUS791US791&sxsrf=AOaemvIfEm9tklY9Adm4gc3FYOxCuCOqxQ:1637777642181&source=lnms&tbm=isch&sa=X&ved=2ahUKEwjbxNSUzbH0AhW5DzQIHc1UCacQ_AUoAXoECAEQAw&biw=1415&bih=767&dpr=2)\n\nAI is a field informed by ethics.  Ethical frameworks are artifacts of the societies they come from.  Non-western/non-dominant frameworks are valid.",
                          "author": "anoddlittlebird",
                          "created": 1637777852,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hlxfd1o": {
          "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hlxfd1o/",
          "text": "Within the \"academy\" there are various soft sciences, social sciences, and practice-based fields of inquiry - all legitimate.  Your belittling of those fields - as well as \"backwards people\" (like, WTF?) - is not necessary, welcome, or helpful.    \n\n\nTo put it another way, \"that’s the whole problem with science. You’ve got a bunch of empiricists trying to describe things of unimaginable wonder\"",
          "author": "anoddlittlebird",
          "created": 1637777042,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmbapt9": {
      "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hmbapt9/",
      "text": "If you want to respect latin american culture, avoid using the word \"latinx\". Its literally a slur and even worse than calling black people the n word. Especially since it shits on the spanish language and isnt even accepted by the majority of hispanic and latino communities",
      "author": "CruzTheSasquatch",
      "created": 1638044270,
      "upvotes": 0,
      "replies": {}
    },
    "hnnxwat": {
      "link": "/r/AskAcademia/comments/r0spck/unsure_of_how_to_incorporate_indigenous_ontologies/hnnxwat/",
      "text": "You can avoid generalizing by being specific: pick a few Amerindigenous groups to learn about their traditional \"ontology.\"  \n\nIt might help to organize your search by lifestyle: nomadism, horticultural, low scale tribal, chiefdom, complex state etc.",
      "author": "Beebeeleen",
      "created": 1638926545,
      "upvotes": 2,
      "replies": {}
    }
  }
}