{
  "sid": "pqy4lm",
  "link": "/r/AskAcademia/comments/pqy4lm/what_does_a_doctoral_advisor_do_and_what_makes_a/",
  "title:": "What does a doctoral advisor do? And what makes a good doctoral advisor?",
  "text": "What does it look like to have an advisor supervise your research? What are some characteristics of a good advisor?",
  "author": "clubhagios",
  "created": 1632012565,
  "updated": 1634078940,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hdfu38e": {
      "link": "/r/AskAcademia/comments/pqy4lm/what_does_a_doctoral_advisor_do_and_what_makes_a/hdfu38e/",
      "text": "I had two. One got me funding to actually work - through other projects. Gave me all the equipment I needed, we met maybe Three Times a year to speak. \"Advertised\" me and built me up in the networks. But. In terms of help and knowledge, I got more help from my colleagues. Other advisor - Minimal input. It was a very one way flow of information - I shared results and ideas. I pitched my ideas for future research and she turned them into research projects. Under her name.",
      "author": "istamarioh",
      "created": 1632039079,
      "upvotes": 2,
      "replies": {}
    },
    "hdgbmtt": {
      "link": "/r/AskAcademia/comments/pqy4lm/what_does_a_doctoral_advisor_do_and_what_makes_a/hdgbmtt/",
      "text": "The simplest way to think of a PhD is as an apprenticeship. Your advisor is the expert who guides you with the tools to develop good research 'taste' and skills. This isn't always straightforward—they have to let you stumble around on your own to really figure out what research entails. Since nobody knows research outcomes in advance, your mentor can only advise you on the most promising steps to take (because they have done their fair share of stumbling around already). In other words, a good one will be able to light the path for you though so that you don't stray too far.\n\nOn the practical side, they shield you from the administrative hurdles of getting funding and might give you some professional connections.",
      "author": "amoeba_grand",
      "created": 1632052592,
      "upvotes": 1,
      "replies": {}
    }
  }
}