{
  "sid": "mlkqru",
  "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/",
  "title:": "Should prof intervene with sexism between students?",
  "text": "I’m in a super small department where there are about 40 students the departments upper year cohort right now (most people take the courses as electives). Including myself, only 3 of the students in my cohort are women. I’m a mature student who had a career before returning to school in my 30s and I often feel as if I have an obligation to speak up as the other women are in their early 20s and they sometimes seem uncomfortable rocking the boat. \n\nA course this term was almost entirely group work and our grade was a split between a group project and participation. The groups were assigned and I later learned the prof intentional put one of the women in each group because he didn’t want it to seem like he thought the women could only work together. \n\nMost of the department (students and profs) is wonderful but there are a few men in their early 20s who seem to still have the opinion that our discipline is “men’s work.”  I had one of these men in my group. \n\nI’m near the top of our class and am fairly confident in my abilities so I don’t pretend to be incompetent but I also work to be inclusive and am happy to follow follow someone else when they take the lead on something. When our group got together I tried to do some team building by asking people what they wanted to work/their area of interest and said it would be great to see if there was any over lap between us. \n\nTwo of the men engaged with me in this conversation but the third guy shut me down and said it wasn’t important to talk about this. Over the next couple days he either disagreed with everything I said or out right ignored that I was talking. He didn’t do this with the other men. He also stated that “men just intuitively  got [our discipline] in a way women didn’t. \n\nWe had due date deadline and divided the work. I said that if anyone needed help I had some free time. The rest of us committed to a time when our section would be done and this guy just said he was busy but he’d get around to it. I did my section and didn’t hear back from him so I did his in case he flaked. \n\nNot hearing from him the group submitted a few hours early with the stuff I did. He got pissed the next day saying he had done it only to see we had submitted it already. He only addressed this to me and not the other members who were part of the group chat convo. \n\nThe drop date was the next day and I figured I didn’t want to have to deal with him all term so I dropped the class. The prof is a sessional but he seems to be sticking around and I’ll probably have him again so I sent him an email basically saying it’s not you it’s me. \n\nI explained what went on and how I didn’t feel like it was my responsibility as one of the few female students to teach young men that women are people. I also said that as he can view the group communications and the grade is heavily weighted to participation he could considered looking at how the male students interact with the female students when making his assessment. \n\nHe responded that he looked at the chats and agreed that the student had treated me differently and poorly. However, he told me that there really wasn’t anything he could do. Basically some guys are like that and hopefully they’ll group out if it. He also mentioned that as a sessional he was more vulnerable to bad course evaluations and he wanted to make sure he was well like so his courses would continue to get good enrolment. \n\nI feel that that’s a bit of a cop out and I do think that male instructors have a responsibility to teach male students to respectfully work with their female peers. Are my expectations out of line here? I not saying he should fail the guy or call him out in front of people but I do think it’s reasonable that he would have a word with him privately or even vaguely talk to the class about dealing with biases.",
  "author": "Contemporaneous-cat",
  "created": 1617740355,
  "updated": 1634081317,
  "over_18": false,
  "upvotes": 137,
  "upvote_ratio": 0.93,
  "comments": {
    "gtm3tfd": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtm3tfd/",
      "text": " I wish you would have communicated with the prof before you dropped the class.\n\nOf course he should have talked with the young man. I think the instructor has an obligation to help students learn to work respectfully with others--male or female.\n\nSince you've already communicated with the instructor and he agreed with you about the young man treating you differently and poorly but he either wasn't interested or able to do anything about it, I think you need to go upstairs. I was a chair and I would want to know about this. Since there is chat evidence of how the student treated you, I'd have a conversation with the young man about appropriate and inappropriate behavior toward other students. I'd also have a conversation with the adjunct about his response to you and point out to him that if he didn't think he was able to deal with a disruptive student he could always talk with me and I'd help him out. I'd also point out that positive student evaluations don't trump expectations about his professional behavior. If it was the first time this kind of thing happened, I'd likely continue to hire him but if it occurred before, we'd be done. This is one reason why I'd want to know--to be sure it's not an ongoing pattern of behavior in the adjunct.\n\nI'm sorry this occurred.",
      "author": "rockyfaceprof",
      "created": 1617742414,
      "upvotes": 143,
      "replies": {
        "gtm55wm": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtm55wm/",
          "text": "Thank you. Normally I would have had a conversation first.  I noticed it was the last day to drop without having to pay for the course and really didn’t want to pay for the pleasure of the experience. \n\nI go back and forth on saying something. I know how little support new instructors are given by my institution and I really don’t want heads to roll. \n\nMy honours supervisor oversees the undergrad program and in the past has been a bit over zealous in having my back on things. \n\nI don’t want to be in a situation where I’m taking a class with the instructor again and he gets overly defensive towards me because he thinks I’m going to go running to my supervisor to complain.",
          "author": "Contemporaneous-cat",
          "created": 1617743010,
          "upvotes": 36,
          "replies": {
            "gtns8rd": {
              "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtns8rd/",
              "text": "I'm just a grad student but maybe communicate that you want this solved either by him or a level up? If you want to minimize the probability that he feels like you \"sneaked away to the supervisor.\" \n\nIf he really agrees with you on sexism not being acceptable, he'll understand that you want this solved one way or the other.",
              "author": "fuckwatergivemewine",
              "created": 1617776137,
              "upvotes": 17,
              "replies": {}
            }
          }
        }
      }
    },
    "gtnmsak": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtnmsak/",
      "text": "Personally I wouldn't have dropped the class, I would just tell my mind to that guy every time he's a dick.\n\n\"men understand this easier than women\"\n\n-\"Well, I have an A in this subject so what you believe all other women in this world understand of this topic doesn't really apply here\"\n\n\nIf you just drop the course because he's a dick he'll just continue to be a dick because nobody is brave enough to talk against him. A professor telling him off won't change his mind, only a strong woman who fuck him over a few times with bad grades will",
      "author": "idk7643",
      "created": 1617771705,
      "upvotes": 42,
      "replies": {}
    },
    "gtm39d3": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtm39d3/",
      "text": "As faculty, I have a \"don't be a dick\" clause in my syllabus that explicitly says I can knock their grade down one letter per instance of, amongst other things, being sexist or racist. I call it \"professionalism\". I've had to deal with one student violating it, they tried to challenge it but then dropped the class before the meeting I had to discuss it with admin. So... Looks like it stays.",
      "author": "downsideleft",
      "created": 1617742170,
      "upvotes": 97,
      "replies": {
        "gtni20j": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtni20j/",
          "text": "In all of my grad courses, we have a zero discrimination clause in every syllabus, so you can automatically get removed from the class if you behave that way.",
          "author": "notjennyschecter",
          "created": 1617768459,
          "upvotes": 24,
          "replies": {}
        },
        "gtm3zx7": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtm3zx7/",
          "text": "I’m a fairly involved student (student union roles, senate, policy committees) and I’ve sat in meetings where we debate the meaning of policy language. Don’t be a dick is pretty much how I view this. We have a student code of conduct policy and I feel like it’s not unreasonable to consider this unprofessional.",
          "author": "Contemporaneous-cat",
          "created": 1617742492,
          "upvotes": 37,
          "replies": {}
        },
        "gtnfy7b": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtnfy7b/",
          "text": "Same. I do not tolerate sexism, racism, or homophobia (haven’t had to deal with transphobia yet, but I’d include it) in my classes. I tell students upfront that in college, as in life, you have to learn to get along with people, so deal. Or get docked points.",
          "author": "missoularedhead",
          "created": 1617767117,
          "upvotes": 11,
          "replies": {}
        },
        "gtn5fmn": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtn5fmn/",
          "text": "Wow- judge, jury and executioner.",
          "author": "TSIDATSI",
          "created": 1617761153,
          "upvotes": -28,
          "replies": {
            "gtn9toa": {
              "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtn9toa/",
              "text": "I mean... That's pretty much a professors job description from a student perspective.",
              "author": "downsideleft",
              "created": 1617763530,
              "upvotes": 43,
              "replies": {
                "gto164f": {
                  "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gto164f/",
                  "text": "Also, not even true, because every school has an actual judge/jury/committee in place that you can go to with your complaint. The prof just states the rules. And most people who really want to be a dick in class drop their case before taking it to school-court, as soon as they are reminded that they were actually breaking the rules.",
                  "author": "18puppies",
                  "created": 1617784474,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "gtn8rvg": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtn8rvg/",
          "text": "[deleted]",
          "author": null,
          "created": 1617762949,
          "upvotes": -47,
          "replies": {
            "gtn9rfc": {
              "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtn9rfc/",
              "text": "Participation, professionalism, attendance, are all standard grading practices.",
              "author": "downsideleft",
              "created": 1617763494,
              "upvotes": 50,
              "replies": {}
            },
            "gtnt8ep": {
              "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtnt8ep/",
              "text": "Not showing up to classes with mandatory attendance is not an academic reason for failing a class, and yet we still do it in top universities.\n\nNot being a piece of shit is on the same level as showing up when you're required. If it's behavior that would get you fired from a job, it should impact your grades.",
              "author": "Mikomics",
              "created": 1617776989,
              "upvotes": 16,
              "replies": {}
            },
            "gto5oyk": {
              "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gto5oyk/",
              "text": "You've got a fairly limited imagination then",
              "author": "IntLawprof",
              "created": 1617788944,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gtm3267": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtm3267/",
      "text": "This is absolutely the instructor’s responsibility.",
      "author": "mmilthomasn",
      "created": 1617742085,
      "upvotes": 24,
      "replies": {}
    },
    "gtnwqfp": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtnwqfp/",
      "text": "It was definitely within your professor’s jurisdiction to comment on his behavior. I understand how important course reviews are at the end of the semester, but coming from someone who routinely takes courses with less than ten people, one bad review out of forty isn’t going to get the prof fired or even disciplined. \n\nI’m in a field largely dominated by women which creates a bit of the inverse problem— there will occasionally be men in courses I take within my department who feel as if they are the highest performers simply because our course is mostly comprised of women. Fortunately, I have a very “take no shit, do no harm” personality and will happily counter that mentality. \n\nThere have been moments in my time in academia where a student has been blatantly sexist towards me and I cannot think of a single time in which the Professor hasn’t made a comment about their behavior. \n\nI understand why people are saying “why did you drop the class? You should have stayed and made his life a living hell!” I completely understand that perspective in theory. \n\nI’m, actually, in full support of your decision to drop the course, not because of the other student but because of the Professor. I’m sure the Professor wasn’t being malicious in his decision, but being in a class with a sexist student is already hard enough— being in a class with a sexist student who isn’t checked for his behavior by the Professor is a whole other can of worms. In my experience, even staying in classes in which the sexist person is reprimanded is already hard. You likely saved yourself a good deal of frustration.",
      "author": "GlutenKid",
      "created": 1617780135,
      "upvotes": 9,
      "replies": {}
    },
    "gtn24wu": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtn24wu/",
      "text": ">super small department\n\n>40 people\n\n>stares at my department of 18",
      "author": "MrLegilimens",
      "created": 1617759449,
      "upvotes": 15,
      "replies": {
        "gtn5vtp": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtn5vtp/",
          "text": "You got me there! Honestly, I could be a bit off because a lot of people take our departments course as their upper year electives (it’s a fun area but a lot of people treat it like it’s too niche for a full degree). I’m just going by the people I’ve taken at least 3+ courses with at the third and fourth year level/come to department events. Also we have fairly large uni population. Some of the departments seem like they have a mind numbing number of students. Friends in other programs wouldn’t recognize half of the people in their year.",
          "author": "Contemporaneous-cat",
          "created": 1617761391,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gtlzgn4": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtlzgn4/",
      "text": "This is bigger than the professor. I would hope that your institution is actively anti-sexist and that there would be a place where you could discuss your concerns, like a title IX office.\n\nETA: Title IX if you’re in America\n\nETA2: I should say US, not America",
      "author": null,
      "created": 1617740523,
      "upvotes": 28,
      "replies": {
        "gtm1g2k": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtm1g2k/",
          "text": "No title IX here, unfortunately. The overall administration is a mess at the uni. This department is generally wonderful and really an abnormality here. The tenure track/tenured profs are fantastic. \n\nIt’s not an area where you would expect a lot of anti oppression work but they’ve built it in and are doing a lot to address some problematic parts of the discipline. \n\nOne prof was teaching a course and the the topic really centred on “great men.” He actively made a majority of the readings the work of female identified academics to balance it out. \n\nI think that’s actually why I find this so weird. The established profs seem to be doing actual work and I can’t imagine getting this response from anyone else. I’ve deliberately not told this to a prof I have a close working relationship with because I don’t want to cause an issue with the sessional.",
          "author": "Contemporaneous-cat",
          "created": 1617741380,
          "upvotes": 20,
          "replies": {
            "gtomtql": {
              "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtomtql/",
              "text": "This behavior is not just prohibited by [Title IX](https://www2.ed.gov/about/offices/list/ocr/docs/tix_dis.html), this is also prohibited under [Title VII](https://www.eeoc.gov/statutes/title-vii-civil-rights-act-1964). Title VII of the Civil Rights Act of 1964 prohibits discrimination for many reasons including sex. The Affirmative Action Office at your university (assuming you are in the US) handles these complaints in addition to Title IX (which is often used as a blanket term). \n\nI'm not advocating a course of action here, but I want to be clear, this student's behavior is a clear violation of both IX and VII. Additionally, your instructor likely had a duty to report this (there were some changes to mandatory reporters in 2020, check your school's guidance to be sure, many schools chose to keep stronger reporting requirements than the federal minimum, just because mandatory reporting requirements were changed, the fact that this is prohibited behavior did not). Once you brought the situation to the instructor they likely had a responsibility to bring it to either the DH or your AAO. They failed spectacularly, in that they didn't follow through and that they acknowledged inappropriate behavior and directly told you they would not report it. While I understand the terrible position adjuncts are often in, I still find their behavior here inappropriate. I know it is hard to square, but your needs are as important as theirs. Further, it sounds like your DH may handle this well. If the instructor won't act, it is not at all inappropriate to take it to the DH if you'd like. \n\nThere are a number of potential actions once the behavior is reported, including you declining to pursue the matter, but you've just described a classic scenario that these laws were designed to prevent. If you'd like to talk further, feel free to ask questions here or DM me. Also, it may be useful to search \"Your University's Name Affirmative Action Office\" for more info. Again, I'm not advocating one way or the other for you to take action, or not, on this, but having been on the receiving end (starting over 20 years ago and lessening but not entirely stopped today) and on the responsible end (as a prof who saw or was told about this sort of behavior, not as one who perpetrated it) what you describe makes my blood boil.\n\n*edit* to correct roman numerals and clarify",
              "author": "RealRockets",
              "created": 1617800938,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "gto5gfr": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gto5gfr/",
      "text": "Not putting 1 woman in a group with all men is like 101-level planning for instructors assigning group work in a class. \n\nThere are numerous websites that can help instructors form class groups while specifically avoiding groups with undesirable demographics - like the one you were in. \n\nI mention this so you can use it as evidence of this prof’s incompetence if you decide to pursue a meeting w your department chair or whoever else about your experience. Responding on mobil but can try to find links to the websites on my computer tomorrow.",
      "author": "knottajotta",
      "created": 1617788719,
      "upvotes": 4,
      "replies": {}
    },
    "gtnx3jm": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtnx3jm/",
      "text": "You should go to the institution’s counsellor. Professor cannot do anything unless something explicitly happens.",
      "author": "Revolutionary_Buddha",
      "created": 1617780473,
      "upvotes": 3,
      "replies": {}
    },
    "gtoffzv": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtoffzv/",
      "text": "Just wanted to note it’s against best practice for the Professor to divide the women with such few numbers. They should know better.\n\nSorry you dropped the class and agree that toxic environment needs to be confronted by the Professor. It doesn’t always take much, a single statement by the Professor would help... \n\nI encountered one of these kids in high school who said women thought electricity was magic. This kid had no idea what electricity was and I’m sure learned this from his father... it was so disappointing. \n\nThank you for rocking the boat. I validate women students in my class when they have experienced this and make it clear they shouldn’t be dealing with that.",
      "author": "GetCookin",
      "created": 1617796681,
      "upvotes": 3,
      "replies": {
        "gtpm0og": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtpm0og/",
          "text": "I shouldn’t laugh but I actually said that about electricity the other day. I obviously don’t believe that but a guy I  tutored in a symbolic logic course messaged me to ask if I could help him understand something about electric currents for his physics class (I think it was some entry level thing). It’s so not even remotely my area. He said, “Hey you’re smart. What does this mean?” I just said “I don’t know man. Electricity is magic.” I should probably clarify with him that I don’t literally think it’s magic...",
          "author": "Contemporaneous-cat",
          "created": 1617816740,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gtnhsep": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtnhsep/",
      "text": ">He responded that he looked at the chats and agreed that the student had treated me differently and poorly. However, he told me that there really wasn’t anything he could do. Basically some guys are like that and hopefully they’ll group out if it. He also mentioned that as a sessional he was more vulnerable to bad course evaluations and he wanted to make sure he was well like so his courses would continue to get good enrolment\n\nThis is unacceptable. I think you need to explain to him that, guess what, *that actually is part of your job*, buddy! If I were you, I wouldn't feel comfortable with profs like this in my department. Have you talked to your PI/advisor and explained what happened? If I were you, I wouldn't have dropped the class- is there a way to add it back? You definitely need to talk to someone, may it be your PI or head of your department. Maybe you can even get put back into the class. This is really upsetting to me. I am in STEM and thankfully have never gone through this.",
      "author": "notjennyschecter",
      "created": 1617768287,
      "upvotes": 11,
      "replies": {}
    },
    "gtogs16": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtogs16/",
      "text": "Don't have any specific advice, but the big about putting the women in separate groups stood out to me.\n\nThis is a bad idea. I can see where they were coming from, but putting women by themselves in a group of men (or any other minority in a group by themselves) is known to make those people perform worse. I think it's called \"stereotype threat\" (I always get the name of this one mixed up). Don't have the refs on me right now, but there's been a fair bit of research into it. Even just having eg 2 women in a group instead of 1 reduces the effect and the women perform better than if they were the only one.",
      "author": "drvictoriosa",
      "created": 1617797535,
      "upvotes": 2,
      "replies": {}
    },
    "gtoi3b3": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtoi3b3/",
      "text": "Yes absolutely. I've experienced the same thing with the course I'm TA'ing this semester and if it continues to happen I'll be speaking to the professor. \n\nBefore the midterm none of the students had seen my face and I have a distinctly male name - all emails were polite, I got asked regular questions about the course material, students agreed with me on my marking decisions and assignment solutions...\n\nProctored the midterm, all the students saw my face. Immediately during the midterm (me being the only non-male TA) I got no questions where the other TA's got 20-30. Afterwards, no more questions about the assignments, when I had questions about my marking of the midterm the students were argumentative and rude, and after posting the solutions to an assignment yesterday I've already received several rude and angry emails about my solutions down to a single negative sign that completely depends on choice of axis and would be correct in either the + or - result... and I haven't even started marking the assignment yet. \n\nI've never experienced this before as my department (physics) is fairly evenly split between men and women, but now that I'm TA'ing an engineering department course it's jarring. I hate it. I applied to TA this course again in the summer and if I get the job I'll likely tell the professor I won't be showing my face while proctoring because of the difference in attitude.",
      "author": "Quiinton",
      "created": 1617798326,
      "upvotes": 2,
      "replies": {
        "gtpphml": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtpphml/",
          "text": "I feel for you on that one. Four of my family members are engineers so I don’t mean this to sound like I think engineers/engineering student are universally difficult but boy some of the stories I’ve heard from a friend studying that are wild. Just the level of infallibility expressed by some of the guys in her program is next level. They’re undergrads but will challenge their TAs and profs as if they’re the authority. \n\nI really feel for one of our TAs. She was TA’ing another class with this prof a while ago. It was a 200+ student second year course and it was completely out of control. People were heckling and calling out really consistently. It the point where a few of us were just meeting for coffee instead of going to the lectures because there was no point. The prof didn’t have control of the class and didn’t even try to bring it back together. He’d say thing like “you guys are so spirited today.” Establishing any sort of order was left up to the TA. She’d have to get up and raise her voice and tell people off. Any sort of email reminding people that they needed to be considerate came from her. At evaluation time the prof gave us time in a lecture to do them and I over heard a couple guys talking about how they couldn’t forget to add what a bitch she was. The irony is that she was one of the most understanding and compassion people and would tons spend extra time out of class helping people if they were confused. These guys weren’t in the department so I don’t the department and it was just an elective for them so thankfully none of the other courses have been that bad.",
          "author": "Contemporaneous-cat",
          "created": 1617818229,
          "upvotes": 1,
          "replies": {
            "gtqzfli": {
              "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtqzfli/",
              "text": "Hahaha don't worry my dad and brother are also engineers, and I actually work in civil engineering during the summers. But yeah that's absolutely what they're like, it's horrible. Absolutely nothing is accepted on my authority, it has to come from the prof or even one of the male TAs - one of the students who challenged my solutions yesterday cc'd one of the male TA's in the email he sent me! \n\nI've applied for only marking positions for this course over the summer, I said I wasn't willing to teach discussion groups or labs. \n\nIn the physics and maths departments (for classes not split with engineering students, anyway) it's fine since they're small departments and collaboration is encouraged to prepare people for research (which at our uni has a very close male:female ratio), but the engineering students are just horrific. Can't wait until I go to industry full time and this is my every day life... (not...)",
              "author": "Quiinton",
              "created": 1617839119,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gtm2w0b": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtm2w0b/",
      "text": "The research on this is clear: don’t split up the underrepresented students. Let them work together to support one another.",
      "author": "mmilthomasn",
      "created": 1617742010,
      "upvotes": 9,
      "replies": {
        "gtm39x3": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtm39x3/",
          "text": "I don’t necessarily have a problem with him breaking us up. We know each other but are not particularly close. I think it’s more interesting because it shows he was at least aware that there are dynamics to consider when the department has a big gender imbalance.",
          "author": "Contemporaneous-cat",
          "created": 1617742176,
          "upvotes": 15,
          "replies": {}
        },
        "gtokwmz": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtokwmz/",
          "text": "Do you happen to have some work on this you can suggest to read? I think I never gave this much thought but I feel like I definitely should and I'd be interested in some good resources on this matter!",
          "author": "flunschlik",
          "created": 1617799917,
          "upvotes": 4,
          "replies": {}
        },
        "gtnmky1": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtnmky1/",
          "text": "I don't know why you're getting downvoted. I tend to let my students pick their own groups and I well remember the relief of making my own student group of other queer kids plus a few misfits.",
          "author": "WDersUnite",
          "created": 1617771559,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gtlzin9": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtlzin9/",
      "text": "Can you paragraph this?",
      "author": "thegreenaquarium",
      "created": 1617740546,
      "upvotes": 3,
      "replies": {
        "gtlzoiq": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtlzoiq/",
          "text": "Will do! I’m on my phone and being painfully lazy.",
          "author": "Contemporaneous-cat",
          "created": 1617740614,
          "upvotes": 2,
          "replies": {
            "gtm49af": {
              "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtm49af/",
              "text": "[deleted]",
              "author": null,
              "created": 1617742604,
              "upvotes": 3,
              "replies": {
                "gtm7lxr": {
                  "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtm7lxr/",
                  "text": "Yes, I did totally go for the nuclear option first. Not normally my go to move. It was the last day to drop and not have to pay for the course (our tuition per course and we have a certain periods to drop and not pay). I’ll add it’s a very small department so even if you haven’t worked with a person you’ve been in a few seminars with them. \n\nI did tell my prof that had the deadline already past, I would have tried a bit longer but considering it had been like this from our first meeting I didn’t want to risk paying for a situation I might need to leave later. I’m also in an honours program that requires my departmental grades to be over a certain threshold and I was anxious that if the dynamic didn’t improve we wouldn’t do well. \n\nThe work I did for him was a bit peculiar. We had a twelve hour clock from when we were given the details and when it was due. It was assigned as a race and the first group to submit everything done properly received as advantage (weird, I know). The fear of him flaking came from him saying he couldn’t do it now but he’d get around to it. I get people not being able to drop everything which is partly why I offered to everyone that I could pick bits up if they weren’t available. \n\nYes, I agree that a prof can’t force a student to be better but I do think they can do some expectation setting. I think that’s a big part of my frustration. I wasn’t saying make him stop behaving like this. I was asking that he make it clear what is expected from students. I feel that his response was sure he shouldn’t do that but I’m not going to set the tone for the class.",
                  "author": "Contemporaneous-cat",
                  "created": 1617744131,
                  "upvotes": 13,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gtmou2k": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtmou2k/",
      "text": "There are only two things in this post that are sexist:\n\n> He also stated that “men just intuitively got \\[our discipline\\] in a way women didn’t. \n\nObviously he is a dick. But after, him ignoring you could be because he just didn't like you (for whatever reason), this is the problem. With sexism cases, you have to prove that things are sexism. Obviously what I quoted is sexist, and we all can tell he is a twat from that, but him ignoring you and doing no work can be independant from this. Since your group seems like it was 4 people, 3 men and 1 woman, him not doing any work also affects the other men. So his quote is sexist, him doing no work is just being a dick.\n\n>he could considered looking at how the male students interact with the female students when making his assessment. \n\nThis is also sexist. Considering how male students interact with female students would be sexist unless they also see how everyone interacts with everyone. Just one way is pure sexism by definition.\n\nI'd say your professor could look into it, but it would depend if things are \"no doubt sexism\". The student being a dick could be because he is a dick, and that can't be tackled from a sexism point of view. Even if he was being a dick to your whole group because he is sexist, it would be hard to prove since his actions affected men more than women (2:1).\n\nI am quite harsh at people in my classes who are sexist, racist, homophobic... anything. I once kicked someone out of my class because she called someone a f\\*gg\\*t. I've given a couple of warnings to people for \"low level\" things too. In my experience, sexism in academia happens quite often (I have experienced it as a man in STEM), and it only really gets tackled if it's blatent and exteme. This example wouldn't even be looked at imo. I wouldn't and I am pretty tough on it in my classes and I wouldn't touch it because there isn't much to go on (even if it's obvious to you, it's not obvious to anyone who wasn't there)",
      "author": "PersonalZebra8993",
      "created": 1617752668,
      "upvotes": -22,
      "replies": {
        "gtneg18": {
          "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtneg18/",
          "text": "I take your point re my comment. Honestly, wouldn’t have an issue if a prof also looked at how female students interacted with male students, especially in the case of historically female dominated areas (I used to work as a student advocate we had to deal with a male nursing student being targeted for “taking up a spot” and several other things because it was a “women’s profession”). In the case of this area it has historically been a boys club. It is culturally shifting the department demographics aren’t moving that fast so while it man only be a few guys making comments the silence makes them easy to hear.  \n\nThat’s not the only comment he’s ever made but it was an already long post. There have been plenty of comments about what is and isn’t a “serious” or “legitimate” area of research (anything that wasn’t stereotypically associated heterosexual or masculinity was “frivolous”). He also taken a very similar position with the types of primary sources we use. As in material culture is “frivolous” evidence but written sources are infallible. Then there are the comments about which scholarly works and academics are logical (male authors) and which are too emotionally driven (female authors). In one discussion the first name was ambiguous and he praised the author’s ability to reason and addressed her with male pronouns. When prof pointed out that the author was a woman he asked “are you sure?” \n\nTo clarify what I made a bit ambiguous, when I say he shot down what I said what I mean is I would state something verbatim from the textbook or lecture slides and he would respond “no that’s wrong.” Then when it would come up later in the conversation and one of the other guys would pull up the same section and say the same thing he would say “yeah that’s it.” He would disagree with me even on zoom calls while I was holding a book to quote from it and say I think you’re reading that wrong. \n\nIn terms of ignoring me there were a couple things. The standard cutting me off while I was speaking and the cutting me off to say what I was already saying. However, the weirdest one that happened a few times was that I would make a post about something that we needed to cover or account for in our project components and other people would be replying directly to it and then about five minutes later he would then post the same question copied and pasted and add something like, “what do you think?” He never did any of that with the other guys and I would even say he was very respectful of them. This also isn’t an issue of established group dynamics as we all had the same passing familiarity with each other. We know each other from the department but have never worked together. When I mentioned to one of the other guys that I was about to drop the course his response was “yeah... I get that.”\nIf it were just the occasional cut off in a zoom call I’d probably assume just awkward tech problems but there was never that “oops sorry you were lagging for me” moment.",
          "author": "Contemporaneous-cat",
          "created": 1617766193,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "gtpxi7t": {
      "link": "/r/AskAcademia/comments/mlkqru/should_prof_intervene_with_sexism_between_students/gtpxi7t/",
      "text": "Your stupid. They are acting sus, obviosly they are imposter. Vote them off",
      "author": "athathathathathatha",
      "created": 1617821649,
      "upvotes": 1,
      "replies": {}
    }
  }
}