{
  "sid": "p97013",
  "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/",
  "title:": "What do you think about the new Netflix show The Chair?",
  "text": "It's about all/most of us. Thoughts?",
  "author": "gggggggggggfff",
  "created": 1629611059,
  "updated": 1634079525,
  "over_18": false,
  "upvotes": 31,
  "upvote_ratio": 0.94,
  "comments": {
    "h9xf0b7": {
      "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9xf0b7/",
      "text": "I've only watched the first episode and got quite irritated at how dysfunctional, lacking in self awareness and disorganised most of the characters were, which probably means it's a fairly accurate portrayal of your average university department.",
      "author": "ACatGod",
      "created": 1629651220,
      "upvotes": 42,
      "replies": {}
    },
    "h9zb0o0": {
      "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9zb0o0/",
      "text": "I’m a professor at a small public institution that couldn’t really be more different from the Pembroke University that is portrayed— and yet I thought it was great and definitely gets more right about humanities academia than it gets wrong. Maybe in my case it helps that I was also raised in the setting of a small liberal arts college and then went to one, too. \n\nBut I really think the show is very, very good and I hope it gets another run of episodes. Honestly I wish Netflix had released it week to week. The water cooler (or virtual water cooler) conversations would have been amazing. As it is it’ll be forgotten in a couple weeks.",
      "author": "Ecualung",
      "created": 1629682201,
      "upvotes": 11,
      "replies": {
        "h9zdxqp": {
          "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9zdxqp/",
          "text": "Yes, it does get a lot right. But, they never seem to do much work. It makes their job look like they have no teaching prep, very little grading, and virtually no research in the works.\n\nAlso, it says it's an \"Ivy League\" but it seems like a liberal arts college. Yet there is one, and only one, Ph.D. student/T.A.",
          "author": "gggggggggggfff",
          "created": 1629683655,
          "upvotes": 3,
          "replies": {
            "h9zmq5h": {
              "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9zmq5h/",
              "text": "Given that the show takes place over the span of only a few days, I didn’t feel like those elements were missing.",
              "author": "Ecualung",
              "created": 1629688182,
              "upvotes": 2,
              "replies": {}
            },
            "ha5fo3e": {
              "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/ha5fo3e/",
              "text": "Eh, tv people never seem to do any work, and most of the time it'd be super boring to watch",
              "author": "IntLawprof",
              "created": 1629805754,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h9zjp0n": {
      "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9zjp0n/",
      "text": "Entertaining, well-made.\n\nClose to home in some areas, miles apart in others.\n\nWorth the three hours that I'd otherwise spend preparing for the semester.",
      "author": "jus_undatus",
      "created": 1629686562,
      "upvotes": 9,
      "replies": {
        "h9zrnhu": {
          "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9zrnhu/",
          "text": "A few addenda in the form of a gratuitous self-reply:\n\nKiller soundtrack.\n\nA bit ham-fisted in a few areas, but closer to the truth than any other popular representations of this corner of life.\n\nThis could be something that varies substantially between fields, departments, and institutions. But my experience is that our department chair is a faculty representative to the administration- not a supervisor.\n\nThe utter cowardice and mediocrity of the dean and his sycophants was shocking, but not surprising.\n\nI'm grateful that vector calculus has nothing to do with fascism.",
          "author": "jus_undatus",
          "created": 1629690963,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h9x7vn1": {
      "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9x7vn1/",
      "text": "Well, it's about TT/tenured literature professors at a private institution. That may not really be all or most of us, and I say that as someone in an English dept.",
      "author": "herennius",
      "created": 1629648204,
      "upvotes": 16,
      "replies": {}
    },
    "h9zck11": {
      "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9zck11/",
      "text": "I enjoyed it so much! I’m a PhD in an English department though, so that might have something to do with it. I feel like I saw a lot of my professors in the characters!",
      "author": "stevienicksfix",
      "created": 1629682966,
      "upvotes": 4,
      "replies": {}
    },
    "h9zgmyd": {
      "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9zgmyd/",
      "text": "I refuse to watch anything even tangentially related to my job; tv is me time not work time",
      "author": "RomanBrickWins",
      "created": 1629685003,
      "upvotes": 5,
      "replies": {
        "h9zh400": {
          "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9zh400/",
          "text": "I can respect that.",
          "author": "gggggggggggfff",
          "created": 1629685240,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9zl3pt": {
      "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9zl3pt/",
      "text": "Loved the satire. My husband and I are both professors and watched it together. We laughed at many of the plot points.",
      "author": "the-asian-carp",
      "created": 1629687302,
      "upvotes": 4,
      "replies": {}
    },
    "h9xqecj": {
      "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9xqecj/",
      "text": "As a female in the hard sciences, I'm avoiding that show. I'm worried it will make me irrationally angry. I'm interested to hear if this is not likely to be the case.",
      "author": "nanuq905",
      "created": 1629656106,
      "upvotes": 8,
      "replies": {
        "h9xv52z": {
          "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9xv52z/",
          "text": "It was completely fine. It focused more on institutional corruption than academia life in general. As a fellow female in the hard sciences, I felt a bit disconnected with it emotionally, because maybe the issues we face in our departments are a bit different than the literature department. There is no mention of grants/funding/PIs grinding students which are all my personal nightmares, so all good!",
          "author": "Deeha911",
          "created": 1629658156,
          "upvotes": 16,
          "replies": {
            "h9ygq7n": {
              "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/h9ygq7n/",
              "text": "PhD Comics The Movie was my grad experience spot on.",
              "author": "nanuq905",
              "created": 1629667711,
              "upvotes": 7,
              "replies": {}
            },
            "ha23t49": {
              "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/ha23t49/",
              "text": "One can imagine… most English departments don’t run on grants. When they get grants, they are often quite tiny…like in the tens of thousands. Revenue mainly comes from teaching so unsurprising, they have a hard time reproducing themselves. That said, I didn’t see a single adjunct featured which was quite curious given that most English departments these days run on almost 50% adjunct labor?",
              "author": "Overall_Designer7502",
              "created": 1629740883,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ha23enc": {
          "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/ha23enc/",
          "text": "I watched it and didn’t like it. It wasn’t bad and my partner (who works in higher ed admim) enjoyed it. But I felt really frustrated watching it. Most of the decline and dysfunctions portrayed are quite accurate, maybe a bit too much, and I (a tenure track AP, woc in a predominantly white, heavily male department) just didnt find it funny at all.",
          "author": "Overall_Designer7502",
          "created": 1629740721,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ha1l6gj": {
      "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/ha1l6gj/",
      "text": "i'll watch this show just to have something in the background and because Sandra Oh is fun, but honestly i don't care about these extraordinarily insular people who make up an about 1% of humans actually inside of academia, lol. these types of instructors are part of why i am so darn glad to not actually be a paid academic any longer. I would so much rather watch a \"realistic\" show about a graduate teaching assistant, broke MFA student of color, 6th-year PhD candidate, etc. To me this show paints such a vivid portrait of how absolutely BORING most of the corruption in academia is--and how easy it would be to dismantle it if the people at the bottom hadn't been tricked into competing for crumbs for so long.",
      "author": "blueberries______",
      "created": 1629733255,
      "upvotes": 2,
      "replies": {}
    },
    "he22wqa": {
      "link": "/r/AskAcademia/comments/p97013/what_do_you_think_about_the_new_netflix_show_the/he22wqa/",
      "text": "It is sort of \"Who's Afraid of Virginia Woolf\"+Twitter; It's a caricature that maybe was closer to reality a long, long time ago even if in very, very broad strokes some of the dynamics still strike a chord.",
      "author": "AugustaSpearman",
      "created": 1632460805,
      "upvotes": 1,
      "replies": {}
    }
  }
}