{
  "sid": "ozcr04",
  "link": "/r/AskAcademia/comments/ozcr04/realistic_expectation_submit_review_paper_small/",
  "title:": "Realistic Expectation? : Submit Review Paper / Small Work Paper in 5 months",
  "text": "Mental Health challenges and unacknowledged Neurodivergence as a 33 year old PhD (Female) student in Materials Chemistry living mostly in isolation far away from the family and friends I have (with limited understanding of me) in a different culture while I navigate having social phobia, non existent self esteem and confidence, has been a big hurdle to my PhD. However I am trying. This Fall I am asking for reduced enrollment so I can focus on health (all) and make some milestone progress without added stress. One milestone I am aiming is a paper by year end. This will be my independent first paper. But I have been in academia for a bit to know how it works and have been published as a coauthor although with minimum writing participation especially. It’s just I haven’t finished one on my own. I want to ask will I be able to accomplish this? Is it a realistic goal? I will be doing this in addition to more research objectives. I don’t (can’t as well) have a job, so less responsibilities! But I have to spend more time on health, taking care of life things for my partner too and my partner in his startup endeavors. I would love to know tips and tricks. Please help. 👩‍🔬🤓🧐🙁👩‍💻🙏🎓",
  "author": "heidirc",
  "created": 1628275191,
  "updated": 1634079996,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "h7zqem4": {
      "link": "/r/AskAcademia/comments/ozcr04/realistic_expectation_submit_review_paper_small/h7zqem4/",
      "text": "My PI says academic writing is like running, both in that most can do it and in that you get better and faster the more and more regularly you do it. You’re asking if you can write a paper, and the answer is yes! How well/how fast? You’ll know when you’ve tried! But that’ll be like your first 5k. And everyone improves their first 5k ;)",
      "author": "LowCommercial9845",
      "created": 1628290304,
      "upvotes": 4,
      "replies": {}
    },
    "h7yvycm": {
      "link": "/r/AskAcademia/comments/ozcr04/realistic_expectation_submit_review_paper_small/h7yvycm/",
      "text": "Possible? Sure. But a lot of this is going to depend on how experienced you are at writing papers, if you have already collected the data,  if not what type of data, if the area is your field of expertise, and if (or how many) coauthors you have. A lot of these factors can slow down or speed up the process. \n\nI would focus on narrow scope,  with a minimum number of motivated coauthors, with some or all data already collected.  Be really clear on the topic, and try not to get distracted by secondary questions. And give yourself some grace and go for submitted instead of published since you have no control over the review process. \n\nI would be worried about being too involved in the start up. If you are taking time to focus on you/ your career then it would be disingenuous to use this time solely to support others.",
      "author": "grounded_out",
      "created": 1628276574,
      "upvotes": 4,
      "replies": {}
    },
    "h81ht80": {
      "link": "/r/AskAcademia/comments/ozcr04/realistic_expectation_submit_review_paper_small/h81ht80/",
      "text": "I recently took on a post-doc who was PhD  trained in a different field.  We got hammered by covid-19 lock downs, so I suggested they write a review on the subject of their (wet lab) project (that way we can at least give something to the fellowship agency in terms of output).  Took them around 5 to 6 months (new field), and the draft manuscript they recently sent me blew my socks off.  Absolutely outstanding.\n\nSo, can you do it?  Yes.  Go for it.",
      "author": "Life_time_learner",
      "created": 1628331449,
      "upvotes": 2,
      "replies": {}
    }
  }
}