{
  "sid": "jwli3q",
  "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/",
  "title:": "Neurodivergent Academics",
  "text": "EDITED to include update on progress and links (see below).\n\nHi all,\n\nI hope this is OK to post.\n\nI am doing my PhD in evolutionary psychology and have recently been diagnosed with ADHD. It has made everything make SO MUCH MORE SENSE. It explains how even the tiniest normal life tasks feel so difficult, but I can still somehow manage to get accepted onto a PhD. I feel like an idiot all the time, probably because my only references are neurotypical people living in a system built for them.\n\nI want to find my people, and I want to do the same for others who are feeling as alienated as I do.\n\nI have made a discord server for neurodivergent academics in the UK, because I think it is quite a unique experience in terms of being so differently wired and trying to exist, let alone flourish, within the structure/expectations of UK academia.\n\nIf you're interested, the link is here: [https://discord.gg/69uennSq](https://discord.gg/69uennSq)\n\nTo clarify, I don't care about diagnoses. If you feel like you struggle with feeling like you're just 'wired differently' then that's good enough for me. Whether you think you have ADHD, ASD, plain ol' executive dysfunction related to other things, or something else... if you think this is probably your people, it probably is.\n\nI look forward to meeting you.\n\n\\---------------------------------------------------------------------------------------------------------------------------------------------\n\nEDITED: 27/02/21\n\nHello all,\n\nI have JUST seen all of these posts!!!!!! I am very sorry, I am not a regular reddit user! I will admit that although there was an influx when I first advertised it, with me being a discord noob, and of course, having ADHD, I don't think that I am facilitating its use sufficiently, so it hasn't really taken off at all. I am posting an updated link. I am happy for people to volunteer to join like a moderating team so we can share responsibilities to some degree. It would be particularly great if we could get some more diversity on board.\n\nUpdated link: [https://discord.gg/GFeczVAAPq](https://discord.gg/GFeczVAAPq)\n\nServer name: UK Neurodivergent Academics",
  "author": "Boggis90",
  "created": 1605724797,
  "updated": 1634080652,
  "over_18": false,
  "upvotes": 216,
  "upvote_ratio": 0.92,
  "comments": {
    "gcr0lf4": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcr0lf4/",
      "text": "Hi! Didn't know I had ADHD until post tenure. I'm in the states though! I don't feel alienated per se, but I'm happy I can at least put a name to my ridiculousness.\n\nIf I've learned anything, \"neurotypical\" is way more rare than you think.",
      "author": "yourmomdotbiz",
      "created": 1605728199,
      "upvotes": 69,
      "replies": {
        "gcrjmmi": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcrjmmi/",
          "text": "If you don't mind sharing, what strategies have you used to help manage the condition and promote productivity? I'm recently diagnosed and everything makes more sense, but I'm still searching for best practices.",
          "author": "zjur",
          "created": 1605737241,
          "upvotes": 11,
          "replies": {
            "gcry2jj": {
              "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcry2jj/",
              "text": "I recommend Russel Barkley's [30 essential ideas you should know about ADHD](https://www.youtube.com/watch?v=BzhbAK1pdPM&list=PLzBixSjmbc8eFl6UX5_wWGP8i0mAs-cvY) talk on Youtube. He explains that it's a *performance* disorder and so interventions need to be *at the point of performance*. Teaching skills doesn't work, because we already know the skills. It's *using* them that's the problem. So he says what you need is more deadlines, more accountability, more structure. You need tasks broken into tiny pieces and use timers as a deadline to work towards.\n\nedit. I forgot to add: give yourself instant rewards. They can't be delayed, they have to be *now*. I haven't got a good idea of how to do this to be honest.",
              "author": "flagondry",
              "created": 1605743883,
              "upvotes": 26,
              "replies": {
                "gcselrk": {
                  "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcselrk/",
                  "text": "TL;DR: Yes! I fully agree. Break tasks into tiny, discrete pieces and use timers!!\n\nAlso a TT person with ADHD. Timers are essential for me getting stuff done/not letting myself get (too) distracted. I'll set alarms and give myself set amounts of time to do a task. Like if I'm taking notes on an article, I'll set a timer for five minutes and write it all up within that time frame and then move on. Or when I read, I'll break it into pieces and set timers for each section. \n\nSometimes just setting multiple timers while I'm doing a \"long\" task is helpful because it reminds me to keep working (also it makes it easy for me to \"gamify\"). Plus, it's easy to build in little \"mini-breaks\" for me to \"decompress\" that way.",
                  "author": "Brumal42",
                  "created": 1605752921,
                  "upvotes": 12,
                  "replies": {
                    "gcsujn9": {
                      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcsujn9/",
                      "text": "I am struggling with timers and time allocation. I have a hard time figuring the amount of time I need to complete a task. Sometimes I'd allocate double the time but I'd either need more or inevitably get distracted 😔 Do you have any advice for me?",
                      "author": "instacandywhut",
                      "created": 1605762464,
                      "upvotes": 7,
                      "replies": {
                        "gcsyqqw": {
                          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcsyqqw/",
                          "text": "Break each task into smaller subtasks - I'm assuming that your tasks are too big and complex which is why you find it difficult to know how much time to allocate?",
                          "author": "satellitevagabond",
                          "created": 1605765590,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "gcuhcaq": {
                          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcuhcaq/",
                          "text": "I have a couple pieces of advice, but the TL;DR version: really the timer is just there are an external pressure mostly. Sometimes, I just use it to have some thing that keeps reminding me that I'm supposed to be doing something.\n\n-you might see how long it takes you to actively read a page (like without getting distracted). Use this as a guide. So if it takes you 1 minute per page, and you have an article that 35 pages. I'd probably set a timer for 7 minutes and try to read 7 pages in that time (which I probably won't but that's okay). I immediately hit repeat timer, and keep going. The timer is really just there as an external pressure.\n\nSo also, sometimes if I need to write, I'll just make up goals as I go. Like \"Can I write five really good sentences in ten minutes?\" Then I try to do that. Again, I don't measure my success by if I was actually able to do that, but if I was able to keep myself on task with minimal distraction. I'll basically just repeat that 3-4 times and take a ten minute break.\n\nIt's also important to set different levels of expectations and goals. If I set goals too high, then I just feel overwhelmed and can't focus, or I'll get really frustrated. Also, this is kind why I don't think giving double time is helpful for this work. Doubling my time just gives me more time to get distracted. I've found that shortening my time frames helps me avoid distraction the most because I don't give myself any slack time to do it.  \n\nFYI, I wrote all this with timer going because this is one of my writing breaks. I went over, but it's okay because it's just a guide for your time. Hope this helps even a little. Good luck and godspeed! :)",
                          "author": "Brumal42",
                          "created": 1605805983,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gcsj7jk": {
                  "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcsj7jk/",
                  "text": "Thank you. I've just found out I have ADHD and so many things are making sense to me now.",
                  "author": "WDersUnite",
                  "created": 1605755457,
                  "upvotes": 1,
                  "replies": {}
                },
                "gctakqa": {
                  "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gctakqa/",
                  "text": "That makes sense! Thank you, I'll definitely look into it.",
                  "author": "zjur",
                  "created": 1605776468,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gcv0u0g": {
              "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcv0u0g/",
              "text": "The biggest thing for me is to always try to do something, even if it's small and menial, and to make small motivation loops.\n\nWhen I was writing my dissertation and my brain sometimes felt like a deflated balloon, I would say just do SOMETHING. So I'd format citations, or organize the really menial stuff when my brain was overwhelmed. Good music helps a lot to get through that sort of task.\n\nSo for example, I might not want to tackle that big overwhelming project, so I'll answer a few emails, and then wash dishes or something. Then maybe lift some weights. Then go back to my email. Try to answer them all, and when my brain feels \"ready\", then I'll turn on a pomodoro timer, and say, ok, just grade for 15 minutes. By then hyperfocus usually kicks in and I can keep rolling. \n\nOn days when it's harder to keep myself at my desk, I'll do things like paint my nails and answer emails between coats. It forces me to stay at my desk when I don't want to. Another thing I do with emails sometimes is use diction on my ipad. I can get through more that way.\n\nAs long as I'm doing something, it can help with a positive feedback loop.",
              "author": "yourmomdotbiz",
              "created": 1605815062,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gcry7te": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcry7te/",
          "text": "As a first year PhD with ADHD, I’m really glad to know that you can get tenure despite ADHD!",
          "author": "macrophone",
          "created": 1605743963,
          "upvotes": 9,
          "replies": {
            "gcv03rj": {
              "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcv03rj/",
              "text": "Sometimes I think it might have helped. Hyperfocus when it happens has carried through most of my career",
              "author": "yourmomdotbiz",
              "created": 1605814714,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gct3713": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gct3713/",
          "text": "How did this actually manifest for you? \n\nI ask because while I'm pretty 'high functioning' (as I suspect a lot of academics are), I have trouble focusing, procrastinate, have loads of unfinished projects, and stimulants often 'normalize'/help me concentrate. \n\nI'm worried if I go to my primary doc they will just think I'm asking for drugs, since this is something I've waited until my 30's to address. Did you get any pushback? How did you frame it? I can manage without medication but I'm beginning to think I could be a lot more normal with help.",
          "author": "what_wereallthinking",
          "created": 1605769344,
          "upvotes": 5,
          "replies": {
            "gcuzzlz": {
              "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcuzzlz/",
              "text": "So I didn't really have a clue at all that my brain was \"different\" until a few people close with me were really irritated with my forgetfulness. They thought that I was being that way on purpose, and I kept explaining that my memory just kind of wipes stuff away sometimes and gets overwhelmed. It was definitely a process and I got really depressed realizing that I had this condition. I read everything I could and I really felt awful about myself having gone my whole life like this without ever knowing it wasn't normal. I kept thinking, what could I have accomplished if I had proper treatment/awareness? I went through a major self-loathing funk about it and was resentful nobody noticed for my whole life.\n\nI ended up forcing myself to a psychiatrist for their opinion and explained to her what was going on. She gave me an assessment, I was off the charts, and was given an rx immediately for adderall. The first time I took it, I had euphoria and was very emotional experiencing what a properly functioning brain felt like. I still tear up thinking about it. I have a love hate relationship with the drug, and sometimes the side effects are a bit jarring and I take breaks. If you're in the UK though I'm aware they don't prescribe adderall, but there are five other stimulants available that work similarly.\n\nI didn't get any pushback at all. I think being mid 30s without any history of controlled substance use helps in terms of the drug seeking thing. Don't worry too much about that. If you need medication, you need it. It's made such a difference for me overall. It's not a silver bullet though. The meds are like a fire hose - depending on where you put your attention is where you'll focus. I've definitely lost days totally focused and absorbed in things that weren't a priority.",
              "author": "yourmomdotbiz",
              "created": 1605814658,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gcrr40f": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcrr40f/",
          "text": "I have ADHD as well and some days are really hard :/",
          "author": "Guy_2701",
          "created": 1605740655,
          "upvotes": 4,
          "replies": {
            "gcv058j": {
              "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcv058j/",
              "text": "I feel you on this.",
              "author": "yourmomdotbiz",
              "created": 1605814733,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gcrp3n7": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcrp3n7/",
      "text": "I’m glad to know I’m not the only one! I’m a PhD student in the US and despite academic success, I always felt like I was lazy and stupid compared to my peers. \n\nCovid lockdowns and working from home pretty much highlighted all of my issues to the point that I hated life and myself and had to get help. Was quickly diagnosed with ADHD. Now that I’ve learned about it, it feels like my entire life suddenly makes sense. It feels even better knowing there are others out there with similar experiences!",
      "author": "elliecot",
      "created": 1605739809,
      "upvotes": 24,
      "replies": {
        "gcryh9h": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcryh9h/",
          "text": "Me too! Meditating everyday and working with a therapist to build a habit of living a structured life have definitely helped me during this lockdown. Now I even appreciate this lockdown period as a great opportunity for building good habits from scratch",
          "author": "macrophone",
          "created": 1605744104,
          "upvotes": 9,
          "replies": {}
        },
        "gctfig1": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gctfig1/",
          "text": "This is exactly what happened to me! Final year of my PhD, got a diagnosis just a few months ago. Fingers crossed I’m not already too far behind",
          "author": "sexy_bellsprout",
          "created": 1605781770,
          "upvotes": 1,
          "replies": {
            "gcuc07x": {
              "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcuc07x/",
              "text": "I've struggled with the feeling of it being \"too late\" as well, and I wonder where I would be now if I had learned about this sooner. However, I choose to look at it this way - look at how far we've come despite working at a serious disadvantage relative to our peers. I think that is a testament to our abilities and we should be proud of ourselves!",
              "author": "elliecot",
              "created": 1605803470,
              "upvotes": 4,
              "replies": {
                "gcv1z7o": {
                  "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcv1z7o/",
                  "text": "This is the first time I've seen anyone articulate this in an academic context. I feel exactly the same way",
                  "author": "yourmomdotbiz",
                  "created": 1605815605,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gcrs2vu": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcrs2vu/",
      "text": "Hi there. I'm in the US, but this is a great idea. I was diagnosed with ADHD  while in a postdoc position (and I suspect I may be on the spectrum as well). Looking back, it does explain a lot of difficulty I've had with abstract thinking and organizing ideas. It's made me feel so stupid in comparison to others who, for example, seem to be able to concentrate and follow seminars while absorbing all the information and connecting it to their own work (the info goes by too quickly for me, unless it's a subject I already know well). Plus a million other little things like that that made me feel \"different\".",
      "author": "tokyoro",
      "created": 1605741063,
      "upvotes": 19,
      "replies": {
        "gctrpx1": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gctrpx1/",
          "text": "This is so interesting to me - I have so much trouble following seminars, and feel like I just bluff my way through so often, mainly by staying quiet and in the background. For years I've wondered if I have some kind of auditory processing problem, because I understand written language so much better. Then I started wondering if it was ADHD and that maybe my reading comprehension is simply better beacuse I can re-read bits.",
          "author": "Trexlights",
          "created": 1605792492,
          "upvotes": 4,
          "replies": {
            "gctypou": {
              "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gctypou/",
              "text": "Yeah I think I do have auditory processing problems, because I cannot take in large amounts of information that way at all. And how does my field mainly communicate science? Seminars, lectures, poster presentations, meetings, etc. Give me an article that I can take my time with and re-read and it's no problem.",
              "author": "tokyoro",
              "created": 1605796707,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gct2t1w": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gct2t1w/",
          "text": "Interesting. I have ADHD and suspect also ASD but I don’t have problems with abstract thinking, planning, following seminars, etc. my problem is getting distracted while doing tasks, and not communicating well/constantly worrying that I’ve communicated in a weird way and don’t know it (or missed some important nonverbal cue) which makes it even harder to concentrate on tasks and communication.",
          "author": "shytheearnestdryad",
          "created": 1605768997,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gcrvync": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcrvync/",
      "text": "Always thought of myself as \"high functioning\" ADHD. Except, of course, when I'm not. :) Honestly, in cognitive psychology, I'd say most of us are divergent in some way.  Or, at the very least, most of the rest of psychology treats us that way.",
      "author": "Der_Kommissar73",
      "created": 1605742763,
      "upvotes": 18,
      "replies": {}
    },
    "gcrz00f": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcrz00f/",
      "text": "Glad you're doing this.\n\nYou might consider opening it up to individuals with depression or anxiety, as well. I'm sure they're covered under the \"something else\" but can imagine many of them would self-select out unless they see something explicit.",
      "author": "adlaiking",
      "created": 1605744385,
      "upvotes": 6,
      "replies": {}
    },
    "gct1jrw": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gct1jrw/",
      "text": "There’s a bunch of us! ADHD and probably also autism here.\n\nEdit: I’m a postdoc",
      "author": "shytheearnestdryad",
      "created": 1605767905,
      "upvotes": 5,
      "replies": {}
    },
    "gcsnpa5": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcsnpa5/",
      "text": "Would it be alright if I join as a *hopeful* academic? I’m applying to PhD’s for next fall in the UK and the process has been...awful for me (ADHD bulimic over here whoop whoop)",
      "author": "heywhatsupitsyahboi",
      "created": 1605758068,
      "upvotes": 3,
      "replies": {
        "gp0beex": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gp0beex/",
          "text": "Absolutely! Please do!",
          "author": "Boggis90",
          "created": 1614435858,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gctqs1p": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gctqs1p/",
      "text": "I feel exactly the same way. How you just feel so inferior because the world wasn’t made to accommodate people like you.",
      "author": "saturn-ium",
      "created": 1605791853,
      "upvotes": 3,
      "replies": {}
    },
    "gcv512v": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcv512v/",
      "text": "Hi, I am interested in joining the community but the link is now 'invalid'? Would you be able to send another or tell me the servers name so I can join? \n\nI have yet to be officially diagnosed with ASD, but am very confident that I am neurodivergent. A lifetime of comments referring to me as 'odd', 'strange' and 'eccentric' have cemented my conclusions. I am therefore currently seeking a diagnosis but unless I want to fork out over 2k I will have to wait a good long while yet.    \n\nWhilst I have taken pride in being a bit different from the norm, the alienation I have felt has seriously taken its toll. This was especially felt during my undergrad and postgrad years. I was never able to develop any long term and especially close friendships or connections with other students. Even with those who I share common interests with. As much as I hate to say it, I have felt alone sometimes and have found myself worrying about things simply because I don't know how 'normal' students deal with them. \n\nUnfortunately, the ASD groups I have joined on FB have let me down a little bit. There are very few people on there who have done, are doing, or are looking into doing a PhD and going on into academia. They are therefore not really that helpful in offering support or advise relevant to myself. I am therefore very excited to see a group such as this. \n\nI hope to joint the community!",
      "author": "Colonel_C",
      "created": 1605817061,
      "upvotes": 2,
      "replies": {}
    },
    "gd5l08u": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gd5l08u/",
      "text": "Hey I'm interested but the link is expired",
      "author": null,
      "created": 1606016073,
      "upvotes": 2,
      "replies": {}
    },
    "gcsve2g": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcsve2g/",
      "text": "Honestly, I think we'll find out soon as science advances that there is no such thing as neurotypical.\n\nI believe it is an illusion that most people don't experience the\" mundane hardships\" most of us experience.",
      "author": null,
      "created": 1605763065,
      "upvotes": 4,
      "replies": {
        "gcsxjaz": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcsxjaz/",
          "text": "While I think there's *some* truth to that (which perhaps strikes at how the language around neurodivergence vs. disability can be somewhat fraught), I think it's a tad invalidating to the folks who have been ostracized for being different their whole lives to say \"but the people who ostracized you are different, too, just like you!\" \n\nI knew I was different as a kid, and the kids around me knew it, too, and they weren't kind about it. \n\nThe impacts ADHD/ASD have on people's lives, both social and professional, have the potential to be debilitating, and language implying we don't have different needs from everyone else is less likely to result in a society-wide acceptance of people's differences, and instead be put back on divergent/disabled people as \"well, everyone's a little neurodivergent, why can't you manage?\" (At least in my context, I'm from the US, and spending decades trying to \"bootstrap\" my ADHD was not productive.)",
          "author": "herrschmetterling",
          "created": 1605764650,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "gcs77rm": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcs77rm/",
      "text": "I was diagnosed with ADHD and borderline bipolar in my masters program. I felt shame, and hid it at the start of my doctorate program. By the 2nd year the procrastination was terrible, and I ended up seeking support services. While program coordinator was supportive, some faculty didn't believe me when I advised them I needed accomodations and.was in the process of working it out with the disabilities office. The threatened to kick me.out of the program if I was found to be untruthful. \n\nWhen the disabilities office called them to discuss my accomodations they acted as if nothing happened. I do know they looked down at me towards the end of the program.  I was less than, not bright enough. But I passed and that's all that matters.\n\nI know now what I need to focus without Adderall.",
      "author": "lnln8",
      "created": 1605748946,
      "upvotes": 4,
      "replies": {}
    },
    "gcthmey": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcthmey/",
      "text": "I am \"neurotypical\" but working with ADHD coauthor. Do you guys have any tips to make the working relationship as fulfilling as possible for them? I just want to be mindful and avoid making assumptions that could make their lives potentially harder.\n\nI had zero clue of what ADHD implied until recently. I did some research on my own, reading articles or blogs to understand better their day-to-day experience. They were useful, but it is clear that these were not written with the academic expectations in mind...",
      "author": "elisewinn",
      "created": 1605784011,
      "upvotes": 1,
      "replies": {
        "gctqt6k": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gctqt6k/",
          "text": "If you want to avoid making assumptions then the best thing to do is ask them directly.",
          "author": "wantonyak",
          "created": 1605791875,
          "upvotes": 5,
          "replies": {}
        },
        "gcv287o": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcv287o/",
          "text": "Follow up often, or just ask them what they need from you directly.",
          "author": "yourmomdotbiz",
          "created": 1605815724,
          "upvotes": 3,
          "replies": {}
        },
        "gcvbk0s": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcvbk0s/",
          "text": "For the most part, just treat them like any other academic; if they've made it this far, they've figured out how to manage their condition at least reasonably well.\n\nBeyond that, don't judge them as stupid for making small errors more often than average (typos, showing up at the wrong time, forgetting to reply to an email, an incomplete sentence in a draft because they were going to go back and finish it but then forgot and then blazed right past it when proofreading, over-performing on a task that should have been quick and simple). \n\nAppreciate their creativity but also reign it in and provide structure when needed (\"That weird idea is actually brilliant, let's do it; but that other thing sounds like another paper, so let's stick to doing x\"). \n\nOffer to take on more of the tasks that require a lot of executive functioning (planning/organizing/keeping track of small details) for your research project. Specifically, there is probably one little task that should be easy but always feels overwhelming (usually some administrative/paperwork type thing - I can't think of a good research example right now but the \"what course do you want to teach and what day/time\" email fills me with an inexplicable mental exhaustion that results in two weeks of procrastination, every single fucking semester).",
          "author": "ExplainsSocialNorms",
          "created": 1605819920,
          "upvotes": 3,
          "replies": {
            "gcxif3j": {
              "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcxif3j/",
              "text": "Thank you so much for taking the time, I appreciate and treasure all of these suggestions!",
              "author": "elisewinn",
              "created": 1605869541,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gcrsqg3": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcrsqg3/",
      "text": "[deleted]",
      "author": null,
      "created": 1605741346,
      "upvotes": -3,
      "replies": {
        "gcrzlf8": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcrzlf8/",
          "text": "There’s a big difference between struggling to have enough emotional and mental energy to get small tasks done some of the time, and actually struggling to muster that energy every single time. Enough of a difference that we might even think about it as the difference between normal human experience and a neurological disorder...\n\nHonestly, what were you hoping to do with that comment, besides make people with an actual diagnosed disorder feel like they aren’t trying hard enough?",
          "author": "monsieurragnar",
          "created": 1605744708,
          "upvotes": 16,
          "replies": {}
        },
        "gcryad7": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcryad7/",
          "text": "I understand you mean well, but telling people with ADHD that the problems they have are actually just problems that everyone experiences is really invalidating and is something that people with ADHD hear very often from people who don't understand it. ADHD is a massive disability in achieving the most basic of life tasks. Yes everybody has bad days but it's in no way the same.",
          "author": "flagondry",
          "created": 1605744002,
          "upvotes": 18,
          "replies": {}
        },
        "gcs0zaj": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcs0zaj/",
          "text": "[removed]",
          "author": null,
          "created": 1605745481,
          "upvotes": -6,
          "replies": {
            "gcsc9kc": {
              "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcsc9kc/",
              "text": "Lol, people don’t read Ian Hacking? I teach Ian Hacking, and so did every grad student in my program. Is ADHD a social construct? Sure. The differences in peoples ability to pay attention aren’t, but the fact is that we live in a society that assumes you have certain attentional capabilities. Since our world is structured for people whose brains work in a particular way, those whose don’t are considered to be disordered. Obviously, we could change our society to make adhd behavior not seem “disordered,” but other comments in this thread make it clear how much some people will push back against that. \n\nAny good historian of science will tell you that you can call something a social construct all the live long day, but there comes a point that although things could work differently, they don’t. And in this case, academia really is stacked against neurodivergent people. Moreover, regardless of whether or not you want to call it “disordered,” some people really do have a significantly harder time finding the motivation to do small tasks.",
              "author": "monsieurragnar",
              "created": 1605751648,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "gcrm93w": {
      "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcrm93w/",
      "text": "[removed]",
      "author": null,
      "created": 1605738556,
      "upvotes": -16,
      "replies": {
        "gcrqdj5": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcrqdj5/",
          "text": "Or, we could all recognize that the metrics for \"getting shit done\" are designed with neurotypical people in mind, and actively work to exclude neurodiverse people who still have a great deal to contribute, even if they work slightly differently than others.",
          "author": "monsieurragnar",
          "created": 1605740343,
          "upvotes": 14,
          "replies": {
            "gcrrilg": {
              "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcrrilg/",
              "text": "How would you propose that the metrics be changed to accommodate neurodiverse people?",
              "author": "notadoctor123",
              "created": 1605740828,
              "upvotes": 6,
              "replies": {
                "gcrt13h": {
                  "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcrt13h/",
                  "text": "Well, that's going to depend a lot on the field, and the nature of the difference. For example, I'm in a book field, and if we were able to shift towards valuing research presented through large-scale digital executions and or quantitative data analysis, it would benefit people with writing disabilities who struggle to complete monographs but still do excellent research.",
                  "author": "monsieurragnar",
                  "created": 1605741470,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "gcshwun": {
          "link": "/r/AskAcademia/comments/jwli3q/neurodivergent_academics/gcshwun/",
          "text": "Ha. I had an advisor use this same reasoning when she refused to let me take notes with a computer or tablet and said that if i tried hard enough, i could just write notes because written notes were more efficient \n\nI have a neurological disorder that makes it difficult to use my hands. But by both of your logics, that neurodivergence doesn’t matter",
          "author": "MinervaMinkMink",
          "created": 1605754735,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}