{
  "sid": "qgqjq8",
  "link": "/r/AskAcademia/comments/qgqjq8/how_to_be_a_good_supervisor/",
  "title:": "How to be a good supervisor?",
  "text": "Hello everyone, \n\nI have just started my PhD in a STEM field and will probably start supervising interns and student projects within the next year. I've personally had some mixed experiences with my own supervisors in the past and would like to become the best possible supervisor to my students. I think gaining some leadership and management skills would be very helpful, as that's not something that is usually being taught to researchers. \n\nDoes anyone have a good resource for people management in academic research? What is a supervision philosophy that you follow?",
  "author": "SleeplessInSparta",
  "created": 1635317455,
  "updated": 1635456595,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.82,
  "comments": {
    "hi8dlm2": {
      "link": "/r/AskAcademia/comments/qgqjq8/how_to_be_a_good_supervisor/hi8dlm2/",
      "text": "I'm also a PhD student who is responsible for supervising a team of students/interns and have been doing so since before my PhD as the more senior RA in my lab. I think there are two main things I emphasise to the students: \n\n1) it's always better to ask questions if you are unsure or stuck. I tell them that it's better to ask questions even if they think it's a stupid one (it rarely is) than having to repeat all the work again when it could have been preventable\n\n2) the experience should be mutually beneficial. Of course, the students are there to help us with the research but they should also feel that they are gaining useful skills and experience. Whilst they might start with more boring repetitive tasks, there are opportunities for progression in our lab and that they can tell me if a task is really not a good fit for them. I also ask about their goals for after university and offer them some advice for reaching those if I can. Some of our students are first gens interested in academia so I take extra time to talk to them about my path to PhD student as a fellow first generation student and tell them about the processes that they are unlikely to know. \n\nBehind the scenes, I work with my own supervisor to have a document for potential tasks and a spreadsheet to keep track of what each student has been working on. We work with quite difficult to reach populations so the reputation of our lab is especially important so students work up from more behind the scenes tasks to being able to have more contact with our participants with time and experience",
      "author": "s1148",
      "created": 1635332220,
      "upvotes": 7,
      "replies": {}
    },
    "hicujkr": {
      "link": "/r/AskAcademia/comments/qgqjq8/how_to_be_a_good_supervisor/hicujkr/",
      "text": "My whole philosophy of supervision is based on NOT doing anything that my PhD supervisor did to me.  If you had mixed experience, keep the good, and make sure you avoid doing what you found bad when others supervised you.\n\nRemember there is no shame in not knowing something if asked.  The best answer to a question you do not know is: \"No idea.  Lets find out\"...",
      "author": "Life_time_learner",
      "created": 1635408486,
      "upvotes": 1,
      "replies": {}
    }
  }
}