{
  "sid": "d6aaes",
  "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/",
  "title:": "I left academia after grad school because I was bad at it, but now I’m heartbroken. Please tell me I shouldn’t try to go back.",
  "text": "I just finished my master’s degree in literature in May. At the time I was burned out, though not from coursework, but from teaching. I really, really don’t like teaching. I’m a very shy person and teaching almost every day drained me so bad I thought I was going to have a nervous breakdown around March or so. You can’t move forward in the humanities in academia without teaching, right? And the job market is so bad anyways I figured there was no use in continuing. \n\nFurthermore, when it came to coursework, I just wasn’t that great at it. I’m not being humble — I tried really hard all the time, but I was still one of the weakest students in almost every class I was in. Did all my reading, put in the time to really try and grasp some critical theory concepts, but often I just couldn’t get a handle on anything well enough to discuss it. I was raised in a really strange community that often discouraged any kind of critical thought, so as an adult I usually feel like I’m always trying to play catch-up. \n\nThe thing is, I’m heartbroken that I’m not studying literature anymore and working through it in grad seminars or in essays. I feel like a rudderless ship. I’ve been applying to jobs I’m vaguely qualified for, which are primarily administrative assistant jobs and copy editing (though if no one bites soon I’m going to have to take it back down to customer service jobs again). Reading through these job descriptions and thinking that that’s what I’m going to be doing 40 hours a week for years literally makes me cry at night. I even enrolled in a library science MS program and withdrew at the last minute because I had a big, weeping breakdown at the thought of working that hard in school for something I don’t love and then getting poor pay on the other side of it to boot. \n\nI feel stuck. The one thing I’ve always loved and grown up feeling I was meant to do turns out to be something I’m not good out or cut out for in the end. Does it sound like I made the right choice? It doesn’t make sense to try and go back, does it? I know I can’t be a student forever. \n\nIf anyone has left humanities for industry and ended up happy with the decision, what did you do?",
  "author": "teddy_vedder",
  "created": 1568875881,
  "updated": 1634081805,
  "over_18": false,
  "upvotes": 117,
  "upvote_ratio": 0.94,
  "comments": {
    "f0s33xf": {
      "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0s33xf/",
      "text": "I have a few thoughts for you.  First, literature is something that anyone can access at any time, in whatever way they want.  I haven’t taken a literature class since high school, but I made it a part of my life and have read many classics on my own over the years.  Leaving academia does not mean leaving literature.\n\nSecond, have you considered therapy to address your anxiety and performance issues?  It sounds like those things are holding you back from doing what you love.  With some work, you may find that you can work through them in a way that will allow you to resume pursuing an academic career.\n\nThird, don’t give up.  Working a job you don’t love is a rite of passage.  Sometimes you have do that to live while you continue working toward what you really want.  It’s not a dead end for your hopes and dreams, it is just a waypoint on your journey.  Keep moving forward and things will work out.",
      "author": "bigrottentuna",
      "created": 1568897993,
      "upvotes": 87,
      "replies": {
        "f0t3hl3": {
          "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0t3hl3/",
          "text": "Just wanted to second this as the first point is really important. Some fields are fairly arcane and not easily explored without the aid of a research institution + very expensive equipment. Fortunately, literature is on the opposite end of the spectrum - there are many free resources, classes, groups and seminars that one could attend/utilize to continue their pursuit, so a change in trajectory doesn’t have to spell the end of something you’re passionate about.",
          "author": "GearAffinity",
          "created": 1568915296,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "f0sdubt": {
      "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0sdubt/",
      "text": "One thing to consider is: if you return to graduate study in literature, you will most likely have that study subsidized with a TAship. If you absolutely hate teaching, that's something you'd almost certainly have to contend with again.",
      "author": "herennius",
      "created": 1568903294,
      "upvotes": 20,
      "replies": {}
    },
    "f0rq5mq": {
      "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0rq5mq/",
      "text": "How comfortable are you with coding? Digital humanities is huge. And needs people who understand both content and coding. Look at Hathi Trust. Which library science school were you enrolled in? Some are better than others at preparing for data science careers. You do need to teach , but it’s normally workshops or as specific days in some classes. Take a look at some data viz, Programming in R, programming in Python classes on  Coursera and see how comfortable you are with it. Pay as an academic librarian is pretty decent at R1 institutions and some even have tenure systems.",
      "author": "CardboardChewingGum",
      "created": 1568890253,
      "upvotes": 59,
      "replies": {
        "f0ub6r4": {
          "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0ub6r4/",
          "text": "Is Hathi Trust hiring or do you know where those sweet sweet DigHum jobs hide? I'm a post-MFA, current MSc Data Science candidate with a portfolio of projects for literanalysis and algorithmic art who's been trying to figure out how to break into the DigHum industry.\n\nEdit: Oop, sorry, this was an impulsive and selfish comment which I blame on desperation, loneliness, and natural-born cringe; I'll post my own askademia or findapathiche.",
          "author": "vvaynetomas",
          "created": 1568937246,
          "upvotes": 5,
          "replies": {}
        },
        "f0srdm1": {
          "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0srdm1/",
          "text": "Digital humanities?",
          "author": "echoGroot",
          "created": 1568909430,
          "upvotes": -11,
          "replies": {
            "f0tj849": {
              "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0tj849/",
              "text": "[Click.](https://lmgtfy.com/?q=digital+humanities&iie=1)",
              "author": "tardarsource",
              "created": 1568923105,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "f0rc7h5": {
      "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0rc7h5/",
      "text": "This is not a direct answer to your question, but in a group of people, some people will be weaker compared to others. Everyone has a different skill set and that's really OK. Additionally, you'd be surprised how many people feel like \"catching-up\" constantly. I don't know if you made the right choice, but I think it's important to clarify a couple of things. Do you enjoy studying or do you feel like \"it's meant to be?\" Overall, it comes down to whether \"you want to but can't\" or \"don't want to and can't really.\" If it's the latter followed by \"but really should,\" I think pursue a different option. \n\nAcademia is something you can endure only if you actually enjoy it. I don't think it's doable if you are not attached to it on some level, because the imposter syndrome is very real and I don't think it ever goes away. I deal with it by telling myself that I only need to be good enough because I love the idea of \"raising speculative problems for the sole pleasure of resolving them\" as Bourdieu put it very nicely. If you love it but can't enjoy it because you feel you're not good at it, I think you might consider going back. If not, then find something you love because life is hard as is. \n\nIn case it's the former (you love it, but feel like you're not good enough) in my cohort (social anthropology, phd), we had this dude who seemed like he knew it all. He'd name drop like there's no tomorrow. And I wouldn't understand a word he said. Despite having read those people. Over time, I came to realize I didn't understand a thing because what he said didn't make sense. He wasn't able to answer a single question when asked what he meant. During the first year, he convinced everyone that he was going to be a superstar, after the second year, he just dropped out.\n\nAnd teaching is hard. And yes, you probably can't exist without it in the humanities. But you can get help. You can identify what it is that makes it a torture for you. Is it that students will challenge you? Is it that you feel you yourself haven't gotten an enough grasp to be able to convey it to students? Is it that you have a difficulty in engaging students? I know it's hard, but it's also OK to ask for help. If you have close relations with a professor, you might also talk to them.",
      "author": "akrasuk",
      "created": 1568879699,
      "upvotes": 27,
      "replies": {
        "f0tpd38": {
          "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0tpd38/",
          "text": "I am a second year PhD student and we had this amazing relatively young professor teaching our first year core class. Met a fifth year PhD student who did the same class in her first year which also happened to be the professor’s first year teaching the course. She thought he was terrible. The professor is pretty socially awkward (although very nice and helpful) in one to one meetings but he taught himself how to teach over the years. The point is teaching is not just about talent - you can certainly learn to teach.",
          "author": "maps1122",
          "created": 1568926464,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "f0su5c5": {
      "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0su5c5/",
      "text": "You said you considered an MS in library science and dropped out? I am a book worm and literature lover as well. I can also relate to your issues, I am very introverted and have had to tackle that when teaching, I am very shy, but I have somehow made it work, because I ended up teaching and doing research, but I always could see myself as a librarian too. Teaching institutions and specialized libraries need people who are knowledgeable about specific subjects, some librarians do research, not much teaching involved but definitely service-oriented, so you need to talk to people quite a bit. I know it's not working with literature directly, it's also a tough job market, but it's worth thinking about. Here's an interview with a librarian, she talks about how the profession can be very different from what we were used to before regarding librarians. Hope any of this helps and good luck.\n\n[https://www.theatlantic.com/business/archive/2016/07/research-librarian/492911/](https://www.theatlantic.com/business/archive/2016/07/research-librarian/492911/)",
      "author": "minominino",
      "created": 1568910646,
      "upvotes": 9,
      "replies": {}
    },
    "f0snwdj": {
      "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0snwdj/",
      "text": "As someone else said, literature is always accessible.  Find a good book club to scratch that itch.  And if you hate teaching, this is a hard area to remain in academics. \n\nWith your master's in literature, you can look for jobs in anything that requires writing, editing, or content creation.  Public relations, marketing, website creation, journalism, etc.  Of course, working for publishing houses and the like is also an option (not just copy editing, there is content creation).  I had a friend with a literature degree that worked for an appliance company writing instruction books.  She actually liked it.  I had another friend that worked with a non-profit that created free educational materials for under-served schools. \n\nYou also have a master's degree which can open you up to jobs at colleges and universities in academic advising, student life, career services, residence life, course development, etc.  It also opens up jobs working for all levels of government.  There are intern programs you probably qualify for that would get your foot in the door of government.  I'm on a search committee for a lead IT person at my university and the CV's have degrees from computer science to biology to MFAs, so you don't have to necessarily have a particular masters for all jobs.  For example, many of the grant proposal writers I have worked with had master's in literature or similar degrees, and they have generally been better to work with than those with science degrees. \n\nBe very open with the type jobs you look for.  I knew a guy with a masters in ancient literature that got a job at a tech startup developing some type of language processing technology and they needed an expert in language stuff to work with the people doing the technical stuff.  \n\nYou can also do a 180 and do something very different.  A friend of mine with an undergrad in literature went to med school.  Law school is another good option with your degree.  As someone else said, computer programing is another option to retrain in. \n\nBest of luck!",
      "author": "manova",
      "created": 1568907900,
      "upvotes": 10,
      "replies": {
        "f0to770": {
          "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0to770/",
          "text": "> As someone else said, literature is always accessible.  Find a good book club to scratch that itch.\n\nHave you found any book clubs that would scratch the itch of someone who misses Master's-level literary analysis?",
          "author": "Gaufridus_David",
          "created": 1568925839,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "f0uw7l8": {
      "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0uw7l8/",
      "text": ">If anyone has left humanities for industry and ended up happy with the decision, what did you do?\n\n90+% of people with an MA in Literature are not working as academics. Some are adjuncts, I suppose, and a fraction went on to do a PhD, however the numbers hardly improve much, even with an Ivy degree. \n\nI have an MA in English. It has enriched my life beyond my profession (I teach university abroad). \n\n>I had a big, weeping breakdown at the thought of working that hard in school for something I don’t love and then getting poor pay on the other side of it to boot.\n\nSo you don't like teaching, you don't like coursework, but you like writing essays...this isn't really the profile of a successful academic in the humanities....\n\nMy advice is to find a profession that you can tolerate and write in your spare time.",
      "author": "legitrev",
      "created": 1568952901,
      "upvotes": 2,
      "replies": {
        "f0uww54": {
          "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0uww54/",
          "text": "I actually liked the coursework a lot, I just felt like I wasn’t good enough at it. The breakdown over doing something I don’t love was over enrolling in a library science master’s program, not more literature. \n\nYou’re right, of course. I just need to somehow figure it out what it is professionally that I can tolerate.",
          "author": "teddy_vedder",
          "created": 1568953624,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f0siu90": {
      "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0siu90/",
      "text": "This is why I try to tell people to be so careful about the majors you choose.\n\nI'm \"old\" and god, the job market, even for grad degrees, has changed so much in the past 30 years. The college sells you that more degrees always leads to a bigger paycheck, That's total bullshit now. It's not true. They're just selling degrees so they won't have to close down departments. \n\nIf you didn't like your subject and you hated teaching, you need to talk to some people at the college, some counselors, and ask then what you can do now? \n\nThat's the very least they can provide - some career counseling, Many colleges DO NOT provide that, and those universities should be shut down, IMO, but you have to ask and see what they have.\n\nToo many colleges have become like f-ing mafias now. They take your money and then the government comes after you for repayment for something worthless. The gov't. is their hit man. It's a wicked little partnership. \n\nHave you looked into any practical professional programs at a community college?",
      "author": null,
      "created": 1568905634,
      "upvotes": 5,
      "replies": {}
    },
    "f0sp1ru": {
      "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0sp1ru/",
      "text": "My MA in literature was very light on the literature, very heavy on the theory. I loved this, but some people were disappointed and/or frustrated. Don't beat yourself up. It sounds like you just weren't in the right lit program for you. Personally, I would encourage you to become an academic librarian. Your background would be so helpful when working with faculty.",
      "author": "catnamedpants",
      "created": 1568908396,
      "upvotes": 3,
      "replies": {
        "f0stzgb": {
          "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0stzgb/",
          "text": "I would suggest OP look very hard at the academic librarian job market before pursuing this. MLS +MA in humanities combinations are very easily found in librarian searches.\n\nOP, if you consider doing this, do your research before considering going back for a master's in library science (which you will almost definitely have to have. Libraries are sometimes flexible on that requirement for things like science librarians, but almost never for liaison positions in the humanities).   Come talk to us over in r/librarians about the realities of the work.  And look at the skills we're asking for in our job ads. [joblist.ala.org](https://joblist.ala.org) is a good resource to browse through.\n\n&#x200B;\n\n(ETA: I see you were enrolled in a program and changed your mind. That's ok - and it's ok if you decide to do it. But talk to folks doing the work before you go back).",
          "author": "ellbeecee",
          "created": 1568910568,
          "upvotes": 7,
          "replies": {
            "f0thpz8": {
              "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0thpz8/",
              "text": "I actually have followed the librarians sub for a long time. I honestly got really discouraged about job prospects after the degree — seeing horror story after horror story of taking years to find full time work in the field, and seeing job listings with such low pay. Turns out I just didn’t have it in me to bite the bullet and go through with the degree, especially since I’m really passionate about the content of historical and academic texts but slightly turned off by things like metadata and document encoding and data science in general.\n\nIt just felt like a really big risk to take when I might end up stuck in a low paying job afterward working with something like...law office or hospital records or something. I also feel I am at a bit of a disadvantage already when it comes to employability because I only have a few months of experience volunteering in a special collections department of a public library thus far. \n\nThanks for being real with me in your response, though. A lot of people have suggested libraries to me without having much knowledge of what the job search is currently like.",
              "author": "teddy_vedder",
              "created": 1568922325,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f0stt1a": {
      "link": "/r/AskAcademia/comments/d6aaes/i_left_academia_after_grad_school_because_i_was/f0stt1a/",
      "text": "You like poverty you should definitely come back and join the club of the poor but satisfied.",
      "author": "iNcorruptibly",
      "created": 1568910484,
      "upvotes": 2,
      "replies": {}
    }
  }
}