{
  "sid": "r5iink",
  "link": "/r/AskAcademia/comments/r5iink/salary_postdoc_position_in_germany/",
  "title:": "Salary postdoc position in Germany",
  "text": "Hi! :)   \nCan you give me a rough estimation of the net salary (after taxes and after paying the healt insurance) does a postdoc in  E13-TV L  (stufe 1) get per month?",
  "author": "Tabunamok",
  "created": 1638260159,
  "updated": 1638479852,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hmn6ozn": {
      "link": "/r/AskAcademia/comments/r5iink/salary_postdoc_position_in_germany/hmn6ozn/",
      "text": "This website has a very accurate calculator:\n\n[https://oeffentlicher-dienst.info/tvoed/bund/](https://oeffentlicher-dienst.info/tvoed/bund/)\n\nThis is a calculation for your case:\n\n[https://oeffentlicher-dienst.info/c/t/rechner/tvoed/bund?id=tvoed-bund-2021&g=E\\_13&s=1&f=&z=&zv=&r=&awz=&zulage=&kk=&kkz=&zkf=&stkl=](https://oeffentlicher-dienst.info/c/t/rechner/tvoed/bund?id=tvoed-bund-2021&g=E_13&s=1&f=&z=&zv=&r=&awz=&zulage=&kk=&kkz=&zkf=&stkl=)\n\nHaving said this, they should acknowledge the years of experience of your PhD and give you Stufe 3, everything else is a scam.\n\nEdit: Depending on if your institute is a federal or a state owned institute, the base salary is a bit different.",
      "author": "territrades",
      "created": 1638263511,
      "upvotes": 6,
      "replies": {
        "hmne6wj": {
          "link": "/r/AskAcademia/comments/r5iink/salary_postdoc_position_in_germany/hmne6wj/",
          "text": "They won't acknowledge them unless you did your PhD in Germany. And, even if they say they will, it's no guarantee that they will. In the contract, there is normally a clause that says that the salary they are promising when you sign is only an estimate and is up for approval. You'll find out what your real salary is in your first pay slip. If you don't like it, you can move back to your country and lose rent deposits +flights+relocation expenses. (great deal eh - sarcasm)",
          "author": "MeneerPotato",
          "created": 1638270068,
          "upvotes": 2,
          "replies": {
            "hmnl183": {
              "link": "/r/AskAcademia/comments/r5iink/salary_postdoc_position_in_germany/hmnl183/",
              "text": "One of my friends did his PhD in England, and they not only acknowledged the years of his PhD there, but they also counted the time he worked as a student aid during his Master's, so that he started out with Stufe 4 in his first Postdoc.\n\nI applied for a Postdoc position in a different institute and the HR people told me that they would count a PhD as 3 years of experience, no matter how many years it really took you.\n\nIt's true they can't really tell you what your net income will be as they are many factors, such as the retirement plan you choose, you being married or having kids, the health insurance you choose, you being a member of the Christian church or not, etc.",
              "author": "territrades",
              "created": 1638275086,
              "upvotes": 1,
              "replies": {
                "hmnlr1i": {
                  "link": "/r/AskAcademia/comments/r5iink/salary_postdoc_position_in_germany/hmnlr1i/",
                  "text": "Read the paper \"Demographics and employment of Max Planck Society's postdocs\" Vallier 2020. There you see the starting salary of postdocs and the enourmos difference between people who obtained their PhD in or outside of Germany. People who obtained their PhD from other countries are typically counted 0 years of experience. So they barely make more than a PhD candidate. \n\nWhat the HR people told you is subject to approval.",
                  "author": "MeneerPotato",
                  "created": 1638275543,
                  "upvotes": 3,
                  "replies": {
                    "hmq0rc4": {
                      "link": "/r/AskAcademia/comments/r5iink/salary_postdoc_position_in_germany/hmq0rc4/",
                      "text": "This paper is interesting, thanks. The Max Planck Society has been at the center of public debates lately regarding their work culture, discussions reaching even the general newspapers in Germany.\n\nAll I can say is that contracts can be negotiated, and if you believable say that you won't come if certain terms are not met there is some leverage. In the public sector there is the \"Werbungsbonus\", a monthly additional salary you can negotiate for starting a position. The thing is, it can only be negotiated before you sign the initial contract. Of course the success depends on the number of qualified candidates they have in their pool, but I have seen a number of hiring rounds with 0 or 1 qualified candidates in the last years.",
                      "author": "territrades",
                      "created": 1638312476,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmn3wmc": {
      "link": "/r/AskAcademia/comments/r5iink/salary_postdoc_position_in_germany/hmn3wmc/",
      "text": "2600",
      "author": "Hapankaali",
      "created": 1638261080,
      "upvotes": 1,
      "replies": {}
    }
  }
}