{
  "sid": "nyxfmg",
  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/",
  "title:": "Trying to change toxicity in Academia",
  "text": "Hello all.\n\nMyself and a group of faculty and students are trying to get together a group of signatures from faculty, postdocs and trainees in multiple institutions in the USA. \nOur goal is to ask NIH to make public the names of PIs that have been found guilty and fired (or asked to retire) after being found guilty of harassment (sexual or not). \n\nThere are too many stories where PIs move from institutions, repeating the toxic behaviors and maintaining their reputation and ability to keep NIH dollars. \n\nIt's time the NIH takes a bold approach at stoping toxic environmemts. \n\nIf you want to be part of this movement, please send me a private message. \n\nWe plan to make calls for media attention, get in contact with NIH leadership (we have already started this), make a web page and use social media. \n\nWe need as many signatures as possible to make our voices heard. \n\nWe look forward to hear from you!",
  "author": "jo_mom",
  "created": 1623594362,
  "updated": 1634080347,
  "over_18": false,
  "upvotes": 283,
  "upvote_ratio": 0.81,
  "comments": {
    "h1motsn": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1motsn/",
      "text": "how would the NIH know this? the government isn't all seeing and all knowing. these things happen behind closed doors at the unviversity",
      "author": "dabeezmane",
      "created": 1623597954,
      "upvotes": 130,
      "replies": {
        "h1muj2j": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1muj2j/",
          "text": "Yeah, I'm not sure the NIH has this info already.\n\nI guess they could make a rule that universities are required to disclose any disciplinary actions taken against PIs (and the reason for those actions).",
          "author": "pb-pretzels",
          "created": 1623600849,
          "upvotes": 52,
          "replies": {
            "h1n4566": {
              "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1n4566/",
              "text": "It is required. Institutions need to inform NIH when a PI has been under HR investigation. This is required during the grant application process. \nMany institutions, however, downplay their findings in their final report to NIH. We plan to propose mechanism to avoid institutions protecting guilty PIs.\n\nWe gotta start somewhere!",
              "author": "jo_mom",
              "created": 1623605573,
              "upvotes": 73,
              "replies": {
                "h1n4umn": {
                  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1n4umn/",
                  "text": "Oh wow, cool! I had no idea it was already required. Maybe this will make it easier, if the process already exists but just needs major updating/tweaking.",
                  "author": "pb-pretzels",
                  "created": 1623605908,
                  "upvotes": 17,
                  "replies": {}
                },
                "h1n622v": {
                  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1n622v/",
                  "text": "That's probably worth outlining in your post, because as it's written, the implication is that you'd like the NIH to enforce university policies and make the outcomes public.",
                  "author": "secretlizardperson",
                  "created": 1623606509,
                  "upvotes": 42,
                  "replies": {}
                },
                "h1nklfy": {
                  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nklfy/",
                  "text": "> Many institutions, however, downplay their findings in their final report to NIH.\n\nI have no doubt this is true, but how does having NIH publicize lists of those found guilty help with this? It would be downplayed before it ever got to NIH, ie the only guilty reports will be those whose institutions weren’t downplaying it anyway... unless you’re proposing publicizing those who have ever been under an investigation, which sounds illegal and also just not like a good idea at all.",
                  "author": "moosedogmonkey12",
                  "created": 1623613613,
                  "upvotes": 12,
                  "replies": {}
                },
                "h1p4gl3": {
                  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1p4gl3/",
                  "text": "Do you have any more info on this? Why would these situations need to be reported to the NIH? Do you just mean pertaining to NIH-funded projects?",
                  "author": "truthofmasks",
                  "created": 1623644906,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h1qseen": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1qseen/",
          "text": "https://www.sciencemag.org/news/2021/06/nih-removed-more-70-lab-heads-grants-after-harassment-complaints",
          "author": "lalochezia1",
          "created": 1623686843,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h1ol0zn": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1ol0zn/",
      "text": "Even if this would work, it wouldn't tackle the problem because OP assumes only PIs are toxic.\n\nMoreover, it assumes universities care about toxicity versus, for example, grant funding.,\n\nThis is like making drug dealers' names public. Sure, they might be part of the problem but doing that doesn't solve the problem as long as there is a need for them.",
      "author": "ourldyofnoassumption",
      "created": 1623632974,
      "upvotes": 12,
      "replies": {}
    },
    "h1mq1mj": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mq1mj/",
      "text": "uh why/how would the NIH even know this?",
      "author": "VanillaRaccoon",
      "created": 1623598580,
      "upvotes": 43,
      "replies": {
        "h1msiz5": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1msiz5/",
          "text": "Perhaps OP means that the NIH would operate as an independent third party between faculty, students, and teaching institutions? But the post (as it's phrased) seems to assume that the NIH is operating as a university policy enforcement agency, so I'm a bit confused by this too.",
          "author": "secretlizardperson",
          "created": 1623599842,
          "upvotes": 12,
          "replies": {}
        },
        "h1mu5s6": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mu5s6/",
          "text": "This was my first thought. They’d maybe know if it directly affected a grantee, but even then, the whole problem with “asked to step down/transfer/retire” is that it gives that person an out so I’m sure the perpetrator would just tell the funding agency they had personal reasons for the transition. \n\nWhatever this post is pushing for sounds like a job for a totally separate oversight agency or something. Not that I think that would be successful in the slightest.",
          "author": "moosedogmonkey12",
          "created": 1623600660,
          "upvotes": 8,
          "replies": {
            "h1nemxm": {
              "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nemxm/",
              "text": "Also I bet the institute would just agree to stay quiet if they transfer",
              "author": "Cupcakequeen789",
              "created": 1623610685,
              "upvotes": 5,
              "replies": {
                "h1nk7df": {
                  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nk7df/",
                  "text": "Yeah sounds like more paperwork and bureaucracy to end up in the same place lol. It’s not that hard to cover something up if the institution wants to. \n\nOP’s subsequent comments also aren’t super clear if they want NIH publicizing guilty findings (fair, sounds good) or investigations. I’m as anti-harassment as everyone else here, but IMO there really is a reason why “innocent until proven guilty” exists...",
                  "author": "moosedogmonkey12",
                  "created": 1623613421,
                  "upvotes": 6,
                  "replies": {
                    "h1ntlmr": {
                      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1ntlmr/",
                      "text": "Yea, I mean if it’s something egregious they will hopefully be fired anyway. If it’s not, I’m sure they won’t be found “guilty”. \n\nI also always chose mentors who were not blantantly toxic, but know many who were. Every lab has its faults and PIs are human, even in the best labs. \nI’ve used micro aggressions in the past I didn’t realize were what they were and I’m not proud and I’m actively trying to improve. \n\nAlso, I’m confident NIH has some culture issues of its own… \n\nI’m much more on the side of elevate the good mentors. Much easier to find than a sour apple.",
                      "author": "Cupcakequeen789",
                      "created": 1623617952,
                      "upvotes": 3,
                      "replies": {
                        "h1nuzko": {
                          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nuzko/",
                          "text": "Yep, I’ve also seen starting investigations weaponized against people who are NOT problematic. I’ve seen it come from students or RAs with a bone to pick or with a misunderstanding of where their problems were coming from, and also from those in supervisory positions trying to run someone off or diminish someone. \n\nThese investigations always turn out fruitless, but already that impacts a persons career and people know that. If simply being investigated became a massively publicized deal, this would create soooooo many new problems.",
                          "author": "moosedogmonkey12",
                          "created": 1623618648,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "h1qsdw3": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1qsdw3/",
          "text": "https://www.sciencemag.org/news/2021/06/nih-removed-more-70-lab-heads-grants-after-harassment-complaints",
          "author": "lalochezia1",
          "created": 1623686836,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h1ndogf": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1ndogf/",
      "text": "I see your point, but I would ensure this is carefully crafted.\nThey could theoretically post reports of this through the office of research integrity. \n\nThe issue is I’ve found that people are less likely to report something that will have an impact on someone’s future. They are too likely to give a benefit of a doubt. So if you’re publicly reporting this, I bet people will be less likely to report it at the institutional level. And what level of harassment will constitute discipline? Theoretically any, but truly there’s a difference between someone who has implicit bias they need to work on and someone who routinely harasses trainees and young faculty. Harassment is too often ignored or swept under the rug in the “faculty club”. \n\nThat being said hiring institutions could potentially be able to ask NIH if there’s reports against a faculty member.\n\nMaybe the NIH could bar any PI accused of certain types/levels of harassment from obtaining a trainee supplement to an R01 or an R35? They should also just incentivize great mentoring. So often the good mentors can’t make it to the top because great mentoring is not incentivized in granting R01s.\n\nAt the end of the day institutions are there to pay the bills and if their reporting will chase off a high grant earning PI, I bet they are less likely to do that. If the NIH prohibits those PIs from obtaining certain types of funds like R35s, maybe that puts the pressure on. \n\nI just saw NINDS has a mentoring award that comes with an 100k supplement! What a great start at lifting up the good mentors.",
      "author": "Cupcakequeen789",
      "created": 1623610218,
      "upvotes": 8,
      "replies": {}
    },
    "h1nnjgc": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nnjgc/",
      "text": "IMO one thing should be taken into seriously consideration is how to improve the efficiency of reporting and investigating misconduct without the students fearing that they will have retribution or that the matter will not be taken seriously because the prof is tenured or famous or something",
      "author": "VivreSaVie1982",
      "created": 1623615028,
      "upvotes": 8,
      "replies": {}
    },
    "h1mof86": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mof86/",
      "text": "This is a terrible idea. The NIH will not defame PIs who have never been convicted of anything in a court of law. \n\nYou may as well ask them to make public the names of students who have been found guilty of academic honesty or conduct violations so that PIs know to avoid them.",
      "author": "nevernotdating",
      "created": 1623597743,
      "upvotes": 154,
      "replies": {
        "h1mrjq3": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mrjq3/",
          "text": "> You may as well ask them to make public the names of students who have been found guilty of academic honesty or conduct violations so that PIs know to avoid them.\n\ndoesn't this happen though?",
          "author": "ezluckyfreeeeee",
          "created": 1623599351,
          "upvotes": 19,
          "replies": {
            "h1ms2f9": {
              "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1ms2f9/",
              "text": "I don’t think so. Student behavior trials are typically private, especially across schools. A PI probably wouldn’t be informed unless they are directly affected by the student’s misconduct (e.g., cheating in a class taught by the PI).",
              "author": "nevernotdating",
              "created": 1623599610,
              "upvotes": 33,
              "replies": {
                "h1mt0h5": {
                  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mt0h5/",
                  "text": "~~As far as I know, at my undergrad institution in Canada, an academic offense (cheating, plagarism, etc.) would go on your transcript, which any grad school you apply to would see. Even employers would see it if they are the type to ask for your transcript.~~\n\nEdit: could be mistaken here, I think it might just be academic probation thay goes on the transcript, which has a few other causes.\n\nEdit 2: It is actually disciplinary probation, which does not go on the transcript. So, this is wrong please disregard.",
                  "author": "ezluckyfreeeeee",
                  "created": 1623600083,
                  "upvotes": 26,
                  "replies": {
                    "h1mws0v": {
                      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mws0v/",
                      "text": "I’m an undergrad at a U.S. institution but I know that academic offenses that are upheld by a panel (I think it’s called the honor counsel) go on your transcript and therefore are available to any grad school or employer who requires a transcript. That said, as far as I know, it’s exceptionally rare for an academic violation to go that far. It would have to be pretty bad and would carry some other serious consequences that would probably hurt worse than the transcript.",
                      "author": "MrPotato2753",
                      "created": 1623601961,
                      "upvotes": 11,
                      "replies": {
                        "h1myc1l": {
                          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1myc1l/",
                          "text": "Edit 2: This is wrong please disregard.",
                          "author": "ezluckyfreeeeee",
                          "created": 1623602722,
                          "upvotes": 7,
                          "replies": {
                            "h1nextz": {
                              "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nextz/",
                              "text": "This makes sense. I think what I meant that academic violations rarely get reported… at least at my college, cheating on exams seems to be vastly underreported. It’s really frustrating as a student watching people get away with it. I don’t know if the professor’s don’t notice it, or if it is too hard to prove if they were to report it? I’m not sure.",
                              "author": "MrPotato2753",
                              "created": 1623610831,
                              "upvotes": 1,
                              "replies": {
                                "h1nhci0": {
                                  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nhci0/",
                                  "text": "Yeah it's is absolutely vastly under reported as far as I can tell from my 5 years being a TA. It's difficult to get proof, and very annoying to go through the paperwork for professors who are constantly overworked.\n\nI think that is the reason that when students are do get caught they really bring down the metaphorical hammer on them. The problem with this is that punishments are far too harsh. Attempts to mitigate cheating are also a bit draconian in my opinion. Students' mental health is bad enough without the staff antagonizing them at every turn.\n\nIt's really all a consequence of the severely mismanaged incentive structures of post-secondary education, but that is another conversation.",
                                  "author": "ezluckyfreeeeee",
                                  "created": 1623612014,
                                  "upvotes": 7,
                                  "replies": {
                                    "h1nj0qt": {
                                      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nj0qt/",
                                      "text": "From an undergrad perspective, it’s a tricky balance. It’s really frustrating that people who cheat will get the same or better grades as a result, without putting in the work. At this point, the people in my classes are the people I’m going to be competing with on applications for grad school. So knowing that people cheat and get away with it is honestly a little crushing. \n\nThat said, I agree that the punishments are harsh. In a way, they seem to punish a few people hard to make up for the rest that don’t get punished at all, and I agree that that’s a problem. It also doesn’t seem to be an effective deterrent.",
                                      "author": "MrPotato2753",
                                      "created": 1623612843,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "h1ot59t": {
                              "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1ot59t/",
                              "text": ">If you are formally accused of academic misconduct I think it's almost guaranteed that it will go on your transcript.\n\nNot at the University of Waterloo -- it's extremely rare there (and most other universities in Canada that I'm familiar with).\n\n[This is U of W's policy](https://uwaterloo.ca/secretariat/policies-procedures-guidelines/policy-71) that outlines what happens when an academic integrity violation occurs, and [here is the recommended list of penalties](https://uwaterloo.ca/secretariat/guidelines/guidelines-assessment-penalties) for different types of offenses.\n\nThings like plagiarism or cheating on assignments don't get recorded on a transcript unless it's a 2nd offense, and even then it's not permanent (you're also suspended, and the note is removed from your transcript when the suspension is lifted after a few semesters). Premeditated cheating on an exam goes straight to a suspension on a 1st offense, but again that isn't a permanent mark on your transcript.\n\nThe only way to get a \\*permanent\\* mark on your transcript is to get expelled, at which point your transcript is pretty much worthless anyway.",
                              "author": "plumpvirgin",
                              "created": 1623637605,
                              "upvotes": 1,
                              "replies": {
                                "h1r8wki": {
                                  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1r8wki/",
                                  "text": "You are right yeah. I thought \"disciplinary probation\", which appears to be quite common based on [student appeals cases](https://uwaterloo.ca/secretariat/sites/ca.secretariat/files/uploads/files/ucsa_report_2018-19.pdf), went on your transcript but it does not. \n\nI will edit my previous comments.",
                                  "author": "ezluckyfreeeeee",
                                  "created": 1623694134,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "h1nfjh2": {
                      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nfjh2/",
                      "text": "At the two institutions in the US I’ve worked at, one public one private, academic misconduct is tracked internally and is visible on the student and advisor copies of the transcript, but transcripts sent out don’t show it.",
                      "author": "WoodwardHoffmannRule",
                      "created": 1623611123,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "h1ms4by": {
              "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1ms4by/",
              "text": "Does it? I'm sure people talk and everything, but no institution I've been a part of maintained a public list of this kind to my knowledge. Even the lists that are maintained are for administrative use only (again, to my limited knowledge).",
              "author": "secretlizardperson",
              "created": 1623599637,
              "upvotes": 8,
              "replies": {
                "h1mt0ao": {
                  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mt0ao/",
                  "text": "~~As far as I know, at my undergrad institution in Canada, an academic offense (cheating, plagarism, etc.) would go on your transcript, which any grad school you apply to would see. Even employers would see it if they are the type to ask for your transcript.~~\n\nEdit: It is actually disciplinary probation, which does not go on the transcript. So, this is wrong please disregard.",
                  "author": "ezluckyfreeeeee",
                  "created": 1623600080,
                  "upvotes": 2,
                  "replies": {
                    "h1mvpux": {
                      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mvpux/",
                      "text": "Oh, I see. Yes, I believe we have something similar here, but I think that's substantially different from the open-to-read list that OP is suggesting.",
                      "author": "secretlizardperson",
                      "created": 1623601443,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                },
                "h1nfn73": {
                  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nfn73/",
                  "text": "Every school I’ve taught at or been a student of is the same way. They are tracked internally but not sent out on official transcripts.",
                  "author": "WoodwardHoffmannRule",
                  "created": 1623611173,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "h1ngxx8": {
              "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1ngxx8/",
              "text": "Im pretty sure that the system you describe bellow for Canada would be a FERPA violation here in the US. Basically student's transcripts and other records are very seriously protected and I'm not sure you could just get access to a student's file like that. AFAIK the only things that appear on official transcripts are the student's formal letter grades. And at my institution there is no 'Failed for Cheating' grade, they just get a regular F. So unless the University decides to actually expel a student, I dont know that they can or would divulge information like that. It would be on the PI to ask a prospective student *why* they received an F in a class and take it from there.",
              "author": "BeondTheGrave",
              "created": 1623611812,
              "upvotes": 2,
              "replies": {}
            },
            "h1nergy": {
              "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nergy/",
              "text": "Only when funded on PI grants when it’s research related I think.",
              "author": "Cupcakequeen789",
              "created": 1623610746,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h1n5emm": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1n5emm/",
          "text": "Institutions need to know about these cases before they hire PIs that have been fired from their current institutions. \nA form could be a formal inquiry by the hiring institution to the NIH about that PI. \n\nAlthough there is no conviction, because being a bully is not illegal, the use of NIH dollars to maintain such labs should be limited.",
          "author": "jo_mom",
          "created": 1623606181,
          "upvotes": -10,
          "replies": {
            "h1n79zn": {
              "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1n79zn/",
              "text": "No, your idea runs afoul of all fair hiring and funding laws. List of ‘bad’ individuals who have not been convicted of any crime cannot be maintained by employers or the government.\n\nAlso, the NIH knows about bullying and toxicity - their decision to fund many grad students and post docs at low wages, while funding few PIs enables these environments. They do not care. Lobby Republicans to support increased science funding if you want anything to change.",
              "author": "nevernotdating",
              "created": 1623607102,
              "upvotes": 20,
              "replies": {
                "h1nfst5": {
                  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nfst5/",
                  "text": "I’m not saying you’re wrong, but calling out a specific political party is not going to help your cause.",
                  "author": "WoodwardHoffmannRule",
                  "created": 1623611250,
                  "upvotes": -4,
                  "replies": {
                    "h1noe74": {
                      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1noe74/",
                      "text": "Why? The US Republicans are a lot more opposed than the US Democrats.",
                      "author": "doornroosje",
                      "created": 1623615442,
                      "upvotes": 7,
                      "replies": {
                        "h1nrutg": {
                          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nrutg/",
                          "text": "Because there is no realistic scenario that gives Democrats anything close to a filibuster-proof majority in the Senate in the foreseeable future, and any real change will need to go through legislation.",
                          "author": "WoodwardHoffmannRule",
                          "created": 1623617100,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "h1mv1gj": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mv1gj/",
          "text": "The last part happens already..............",
          "author": "fireguyV2",
          "created": 1623601104,
          "upvotes": -5,
          "replies": {}
        }
      }
    },
    "h1paa26": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1paa26/",
      "text": "This has a potential to turn into a vector for mob justice. But even ignoring the moral aspect, you're trying to have institutions retaliate against people who haven't been found guilty in a court of law. This is a shitstorm of defamation lawsuits in the making. No institution will open itself to that kind of risk.",
      "author": "Ofbearsandmen",
      "created": 1623649304,
      "upvotes": 7,
      "replies": {
        "h1qsj67": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1qsj67/",
          "text": "https://www.sciencemag.org/news/2021/06/nih-removed-more-70-lab-heads-grants-after-harassment-complaints",
          "author": "lalochezia1",
          "created": 1623686905,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h1mqds8": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mqds8/",
      "text": "I've upvoted because I'd like to get this more visibility and conversation around this, but I have to admit I have a handful of concerns with this approach:\n\n* You mention \"it's time the NIH takes a bold approach\"-- why? Why the NIH out of all of the funding agencies out there?\n* If they've been found guilty and removed from their position, isn't that the problem solved? Why taking this extra step?\n* What steps are taken to ensure (to the extent that that's possible) that this doesn't become a mechanism to enable witch-hunts?\n\nI would also point out that I would view \"found guilty of sexual harassment\" as being very different from what I would consider \"toxicity in academia\": the difference coming down to competitiveness versus an actual crime.\n\nThis feels like a problem better solved on an institution-by-institution level. Of course, there already are policies at that level, but it sounds like in your view these aren't sufficient. What makes them insufficient? I'm asking that more as a general trying-to-understand-the-problem thing. Perhaps putting together a more universal set of policies, and then pushing an initiative to have institutions get on board to enact them, might end up being more effective?",
      "author": "secretlizardperson",
      "created": 1623598756,
      "upvotes": 39,
      "replies": {
        "h1n9me7": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1n9me7/",
          "text": "Not OP, and not necessarily advocating their proposal, but the main problem with the institution-by-institution solution (which is essentially what we currently have) is that there is no incentive for institutions to do anything other than *help* harassers find new jobs at other institutions who are not informed of the history of harassment. From the first institution's perspective, this solves their problem and there is no incentive to actually remove these folks from academia. There's many documented cases where this has happened, many are linked by others above or a quick google search could find you more.\n\nSo OP's proposal is one potential way for a body that gives money to many institutions to monitor the situation. If a serial harasser was \"blacklisted\" by NIH (or any funding body) it's unlikely they would be able to find a cushy high-profile place to land after being pushed out of their first institution. I think there's probably better ways to do this (link it to Title IX, maybe?) but, like you said, this is a good way to start the conversation.",
          "author": "boilerlashes",
          "created": 1623608256,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "h1mpkkq": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mpkkq/",
      "text": "No thanks. Keeping lists of harassers (accused or otherwise) unless they’ve actually been found guilty in a court of law is a really bad idea. Something like this could easily be abused by trainees that think they were treated unfairly from their perspective but just maybe didn’t gel with a PI who is highly motivated and a bit pushy. \n\nIf a PI is victimizing people, let the institution and authorities deal with it rather than keeping a list like some vigilante.",
      "author": "WhoCaresWhyBother",
      "created": 1623598342,
      "upvotes": 75,
      "replies": {
        "h1mwqpn": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mwqpn/",
          "text": "A few years ago, my own field had an 'anonymous' list where people could name abusers for a bit. On it were some truly horrific stories about some very powerful people; but, so too were claims like \"The PI said I should join their lab and when I said no, tried to convince me\" and \"Sat at the same table as me at a conference and asked me questions about my research goals when I wanted to be alone.\"\n\nIt's a really tricky situation because, obviously, abuse should be driven out; but, when *everything* gets lumped together and *nothing* is adjudicated formally, things gets real messy, real quick.",
          "author": "WrestlingStuffGuy",
          "created": 1623601944,
          "upvotes": 48,
          "replies": {
            "h1mxn46": {
              "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mxn46/",
              "text": "Strong student and postgraduate unions would allow people who have legitimate concerns about a PI’s behavior to speak to someone about it, without fear of losing their job completely. I think this is a much better way of ensuring trainees in abusive situations can safely voice concerns while also giving PI’s the benefit of the doubt until evidence is brought forward. But, yeah, a list solves neither issue.",
              "author": "WhoCaresWhyBother",
              "created": 1623602383,
              "upvotes": 19,
              "replies": {}
            }
          }
        },
        "h1npxem": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1npxem/",
          "text": "Do you live in another universe? Schools will do literally anything to protect harassers and have, repeatedly, it made the news.",
          "author": "kinderdemon",
          "created": 1623616179,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h1mo9gp": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mo9gp/",
      "text": "If they already got fired or forced to retire, then they won’t be making the environment toxic. Am I missing the point?\n\nI’m not pro harassment, of course. I just don’t know if this will achieve anything. \n\nIf any of these cases went to court, you can access the court files and publish the names if you want to. However, if the person was accused but the case never went to court, there are no records and for all practical purposes, the harassment didn’t happen or it’s hearsay.",
      "author": "ThatProfessor3301",
      "created": 1623597661,
      "upvotes": 32,
      "replies": {
        "h1piubm": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1piubm/",
          "text": "They move to another school and do it again.",
          "author": "RainBoxRed",
          "created": 1623656785,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h1mpkny": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mpkny/",
      "text": "Just sharing this since it is relevant to the post:\n\nhttps://academic-sexual-misconduct-database.org/incidents",
      "author": "IAmTrident",
      "created": 1623598343,
      "upvotes": 18,
      "replies": {}
    },
    "h1mrx1p": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mrx1p/",
      "text": ">Our goal is to ask NIH to make public the names of PIs that have been found guilty and fired (or asked to retire) after being found guilty of harassment (sexual or not).\n\nWhat makes you think the NIH has such information?",
      "author": "r3dl3g",
      "created": 1623599535,
      "upvotes": 17,
      "replies": {}
    },
    "h1muq0m": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1muq0m/",
      "text": "[deleted]",
      "author": null,
      "created": 1623600946,
      "upvotes": 19,
      "replies": {
        "h1mzs8a": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1mzs8a/",
          "text": "I'd imagine such evidence is hard to come by (other than anecdotal), but what OP is proposing would make gathering such evidence actually possible.\n\nETA: This reads like an endorsement of OP's idea; I'm not making a judgement call either way, but having strong evidence on a topic that may be underreported/actively suppressed is always going to be difficult.",
          "author": "foibleShmoible",
          "created": 1623603436,
          "upvotes": 7,
          "replies": {
            "h1n0i6n": {
              "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1n0i6n/",
              "text": "[deleted]",
              "author": null,
              "created": 1623603792,
              "upvotes": 2,
              "replies": {
                "h1n0y7s": {
                  "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1n0y7s/",
                  "text": "Oh, on that I'm sure there are. I know that the astrophysics community has had to take quite a few measures in recent years because of issues in their field; I'm not at a proper computer right now so I can't efficiently search, but if you wanted to have a google yourself that would be a solid place to start.\n\nEdit: I did it anyway. A good example is [Christian Ott](http://live.iop-pp01.agh.sleek.net/2018/02/23/job-offer-for-disgraced-astrophysicist-revoked/) who resigned from his professorship at the California Institute of Technology following a suspension for harassing two female graduate students, and got a new post at the University of Turku in Finland. This was revoked after backlash from people in the astro community who knew about his situation. I think what OP is proposing is a way of making that kind of information more formally available.\n\nAlso [Timothy Slater](https://www.buzzfeednews.com/article/tylerkingkade/a-professors-sexual-harassment-case-came-out-in-congress) is an example of someone whose career flourished elsewhere after being found guilty of violating the sexual harassment policy of his university. The same article mentions Geoff Marcy who didn't have to move institutions because his harassment of students was never taken seriously, until a few years ago. He was (I think) really the case that kicked off the most recent push in the astro community to address harassment.",
                  "author": "foibleShmoible",
                  "created": 1623604011,
                  "upvotes": 9,
                  "replies": {
                    "h1pio2w": {
                      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1pio2w/",
                      "text": "Just read through the story about Slater and that’s pretty gross. I suppose OP is trying to effect some change, otherwise it’s status quo and that sounds pretty miserable if there are people like Slater bouncing between institutions never feeling real consequences.",
                      "author": "RainBoxRed",
                      "created": 1623656618,
                      "upvotes": 2,
                      "replies": {
                        "h1pj6v0": {
                          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1pj6v0/",
                          "text": "Exactly. I can't say that I think OP's stated approach would/should work, it is an absolutely logistical/legal nightmare.\n\nBut I can see why, if there was a way to do it right, we should do it. I agree with the sentiment/purpose.",
                          "author": "foibleShmoible",
                          "created": 1623657116,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h1ne1iu": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1ne1iu/",
      "text": "Why do you think NIH has a list of faculty who have been “found guilty” of harassment? \n\nEven if they do have information about which faculty have been found by their institutions to have committed harassment, NIH would never publicize it because they’d get their asses sued for defamation. The faculty in question haven’t been “found guilty” in a legal sense, and a government agency declaring them guilty without a trial is clearly not going to hold up in court.\nThat’s pretty unrealistic.",
      "author": "WoodwardHoffmannRule",
      "created": 1623610394,
      "upvotes": 8,
      "replies": {
        "h1qscad": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1qscad/",
          "text": "https://www.sciencemag.org/news/2021/06/nih-removed-more-70-lab-heads-grants-after-harassment-complaints",
          "author": "lalochezia1",
          "created": 1623686815,
          "upvotes": 1,
          "replies": {
            "h1qt6r2": {
              "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1qt6r2/",
              "text": "Neat. But my bigger point is that they still aren’t going to publicly name the people they removed.",
              "author": "WoodwardHoffmannRule",
              "created": 1623687205,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h1msxnp": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1msxnp/",
      "text": "You should think deeply about hte implications of what you are trying to do here.\n\nThere is a reason one cannot be tried twice for the same crime: you already got what the justice system considers fair punishment. A continuous record very much goes against this principle, basically giving people a live sentence to second rate employment chances/opportunities.\n\nThe justice system and disciplinary commitees from individual organizations give out punishments that they believe are just. If you disagree with what specifically is just, I recommend you contact your legal representatives or the AAU or something about changing those punishments, but a life sentence is something I would always be very careful with, especially as just a categorical tool.",
      "author": "creedofsouls",
      "created": 1623600043,
      "upvotes": 28,
      "replies": {}
    },
    "h1nu3ub": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nu3ub/",
      "text": "The NIH is a highly regulated federal institution. It's not gonna happen.",
      "author": "pontiferouspenguin",
      "created": 1623618204,
      "upvotes": 3,
      "replies": {}
    },
    "h1nofmv": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nofmv/",
      "text": "We all learned about Nassar not too long ago. Forgive me for not completely trusting institutions to keep people safe while they are busy saving face. There is a database already of public information. Thanks for the other comment or for posting the link here!",
      "author": "sambernadino",
      "created": 1623615463,
      "upvotes": 4,
      "replies": {}
    },
    "h1n9jsl": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1n9jsl/",
      "text": "I’d use a different word than toxic since that can mean things as small as being rude to coworkers or more broadly a competitive, up or out atmosphere, you are clearly interested in different stuff.\n\nThat said, I don’t know if moving to a trial by the court of public opinion is a great idea long term.",
      "author": "ph0rk",
      "created": 1623608219,
      "upvotes": 6,
      "replies": {}
    },
    "h1pskrj": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1pskrj/",
      "text": "Regarding toxic PIs moving institutions, there is a mechanism in the hiring process that can prevent this. The HR department of the new institution can call the HR department of the former institution and inquire if the candidate is under ‘ongoing investigation’. Though the nature of why won’t be disclosed, the uni has to answer yes or no. That is usually enough for a new institution to think twice and move on to another qualified candidate especially since faculty jobs often get 100+ applications from exceptional people. However, it doesn’t seem like this is standard practice in most faculty hires so toxic folks can move.",
      "author": "ScientistLiz",
      "created": 1623666351,
      "upvotes": 2,
      "replies": {}
    },
    "h1qsakp": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1qsakp/",
      "text": "https://www.sciencemag.org/news/2021/06/nih-removed-more-70-lab-heads-grants-after-harassment-complaints",
      "author": "lalochezia1",
      "created": 1623686792,
      "upvotes": 2,
      "replies": {}
    },
    "h1nm2q8": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1nm2q8/",
      "text": "What would this do to Scientific progress and academic freedom? Why would the NIH know about these people? Are you suggesting a reporting requirement and punishment from the Federal Government? This would have to go through a judicial process at the National level. Are you talking about people who were convicted of crimes? We already have a process for trying and convicting criminals!",
      "author": "erice3r",
      "created": 1623614327,
      "upvotes": 3,
      "replies": {}
    },
    "h1ovacl": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1ovacl/",
      "text": "Nice way to intensify an already unnecessarily intense shit show. As an early career researcher with a few very lazy PhD students who are both likely to graduate without publications _through no fault of my own_ I can see me being put on a list like this as retaliation when they inevitably find themselves not getting postdocs due to competition with people who have several publications after their seven year American style PhDs.",
      "author": "ImeldasManolos",
      "created": 1623638872,
      "upvotes": 3,
      "replies": {}
    },
    "h1n0jqr": {
      "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1n0jqr/",
      "text": "won't somebody think of all the fired rapists",
      "author": "lalochezia1",
      "created": 1623603814,
      "upvotes": -24,
      "replies": {
        "h1n3ln7": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1n3ln7/",
          "text": "nuance shaming. That's what we can call your comment.",
          "author": "respeckKnuckles",
          "created": 1623605312,
          "upvotes": 13,
          "replies": {}
        },
        "h1n6pyw": {
          "link": "/r/AskAcademia/comments/nyxfmg/trying_to_change_toxicity_in_academia/h1n6pyw/",
          "text": "I think all of the criticism here has been constructive, and point out legitimate issues with the proposed implementation.  This comment uses hyperbole to distract from a productive conversation.",
          "author": "secretlizardperson",
          "created": 1623606829,
          "upvotes": 11,
          "replies": {}
        }
      }
    }
  }
}