{
  "sid": "r0zbpv",
  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/",
  "title:": "How do you feel about your papers not being cited?",
  "text": "I'm finishing my PhD in a field related to sociology. I recently reached my tenth accepted publication and I'm really proud of it. However, none of my publications is cited by anyone and that is really putting me off.",
  "author": "nudist_bro",
  "created": 1637738406,
  "updated": 1638206339,
  "over_18": false,
  "upvotes": 87,
  "upvote_ratio": 0.95,
  "comments": {
    "hlvjjb8": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlvjjb8/",
      "text": "Citation is highly dependent on your field of study. The more niche it is, the less likely for it to get cited. It may be that your field of research is not commonly studied.",
      "author": "MarkZelVitch",
      "created": 1637739316,
      "upvotes": 84,
      "replies": {}
    },
    "hlvug0x": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlvug0x/",
      "text": "It crushes my soul whenever people publish papers on things I've published about without citing me.",
      "author": "cat-head",
      "created": 1637748118,
      "upvotes": 66,
      "replies": {
        "hlwhaik": {
          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwhaik/",
          "text": "I'm with you on that",
          "author": "nudist_bro",
          "created": 1637763090,
          "upvotes": 14,
          "replies": {}
        },
        "hlzbbem": {
          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlzbbem/",
          "text": "When I first started grad school I thought that to be responsible you had to cite everything on the topic, even people who do crappy research or who are assholes. Once I realized that citations are selective don't have to be comprehensive for most things (other than acknowledging any really specific findings), I found that I could almost always find a solid, collegial researcher to cite instead of an asshole for the same point. I will no longer inflate the citation numbers of some of these \"important\" researchers who refuse to acknowledge up-and-coming researchers that might threaten their egos by challenging them with new ideas. I also try to cite women and people of color instead of white men like me when possible. There is nothing neutral or automatic about citation, and we make a lot of meaningful choices when we do it.",
          "author": "encom-mcp",
          "created": 1637805225,
          "upvotes": 13,
          "replies": {
            "hlzz1od": {
              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlzz1od/",
              "text": "I agree with you on all that.",
              "author": "nudist_bro",
              "created": 1637816722,
              "upvotes": 3,
              "replies": {
                "hm0nlxp": {
                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm0nlxp/",
                  "text": "So I guess my point is: If someone conspicuously does not cite your work, then you should put them on your list of assholes never to be cited again (unless it is in a devastating critique pointing out the fatal flaws in their highly misguided and failed attempts at research, of course).",
                  "author": "encom-mcp",
                  "created": 1637833311,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hm0px2g": {
              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm0px2g/",
              "text": "Kinda agreed with you on most things except where you mentioned you select citations based on peoples race and gender. Ridiculous. Personal grievances or personality differences shouldn’t really come into it either. I feel the merit of the work should speak for itself, the researcher is irrelevant. You should cite whats most relevant and of the highest quality regardless.",
              "author": "NoPut2550",
              "created": 1637835197,
              "upvotes": -2,
              "replies": {
                "hm16b2o": {
                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm16b2o/",
                  "text": "In my experience, in academia the language of \"merit\" is habitually used to explain why women and people of color are excluded.",
                  "author": "encom-mcp",
                  "created": 1637847283,
                  "upvotes": 4,
                  "replies": {
                    "hm66z21": {
                      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm66z21/",
                      "text": "Really don’t understand what you mean. I work with all kinds of people. People get their work done, and they go to publish it. Some are better than others, or prefer different research areas. Not once has anyone brought up race or gender as a reason they weren’t recognized at my university’s department, nor would they without some craziness happening. We are all kind of like too busy working, improving, and looking for the next thing to do.",
                      "author": "NoPut2550",
                      "created": 1637945777,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlw3hsu": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlw3hsu/",
      "text": "Citation rates in sociology are generally quite low. If you're not getting cited at all, that sounds like a visibility problem, though. It helps to make your work visible. Make sure there is an open access version of your paper available---you can always upload a preprint on a server such as SocArXiv. (In general, it's a good idea to preprint your paper early---preprinted papers get cited significantly more than ones that aren't). I also do a short Twitter thread about my papers when they're out to give them some visibility.",
      "author": "simoncolumbus",
      "created": 1637755141,
      "upvotes": 28,
      "replies": {
        "hlwh8xo": {
          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwh8xo/",
          "text": "By mandate from my university (in the Nordic countries), everything is published in open access journals.",
          "author": "nudist_bro",
          "created": 1637763069,
          "upvotes": 18,
          "replies": {
            "hlx29wu": {
              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlx29wu/",
              "text": "this might be your problem, most open access journals are 5th tier trash and noone is going to read or cite them\n\nPublish in good journals and get your university to pay for gold open access if they care that much about it. Papers in top journals actually get read. If your university is literally forbidding you from publishing in good journals then leave ASAP before your career is destroyed.",
              "author": "MoneyPrize2283",
              "created": 1637771929,
              "upvotes": -12,
              "replies": {
                "hlx8dsz": {
                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlx8dsz/",
                  "text": "> Publish in good journals and get your university to pay for gold open access if they care that much about it.\n\nI'm pretty sure this is what the person you're replying to meant. There's a push by the EU for gold open access, and a lot of institutions are willing to pay for the publications costs on behalf of the researchers. You're actually not supposed to submit papers to predatory open access journals.",
                  "author": "notadoctor123",
                  "created": 1637774330,
                  "upvotes": 20,
                  "replies": {
                    "hlx9rw1": {
                      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlx9rw1/",
                      "text": "Where I'm based (Norway) there are agreements covering the APCs of most of the big publishers (Elsevier, Springer, Taylor and Francis, Sage), so it is Golden Access pretty much by default.",
                      "author": "nudist_bro",
                      "created": 1637774871,
                      "upvotes": 16,
                      "replies": {}
                    }
                  }
                },
                "hlxipz5": {
                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlxipz5/",
                  "text": "You are clearly utterly clueless if you think 'most open access journals are 5th tier trash'. I'm no fan of paying large sums in APCs to publishers, but the reality is very much that you can publish OA almost everywhere if you have the money.",
                  "author": "simoncolumbus",
                  "created": 1637778363,
                  "upvotes": 18,
                  "replies": {
                    "hlxkjdl": {
                      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlxkjdl/",
                      "text": "It might be a terminology issue; I interpreted \"open access journals\" to mean journals that were entirely open access (MDPI, PLOS, etc) rather than normal journals which allowed for optional open access.\n\nMany/most purely open access journals are bad, yes (there are a handful of exceptions).",
                      "author": "MoneyPrize2283",
                      "created": 1637779067,
                      "upvotes": -3,
                      "replies": {
                        "hlz7rxd": {
                          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlz7rxd/",
                          "text": "Can you make a few examples for “trash” journals?",
                          "author": "captainforkforever",
                          "created": 1637803652,
                          "upvotes": 5,
                          "replies": {
                            "hm1oz4w": {
                              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm1oz4w/",
                              "text": "Your advisor should be able to help you with this, otherwise just look at the journals that academics from top universities in your field publish in (these will be the good ones). You can also look at the editorial board; if most of the editors and AEs are from well known (maybe top 100 worldwide) universities then the journal is probably reasonable.\n\nmany predatory open access journals are literal trash but even among \"respected\" non-OA peer reviewed journals there are huge quality differences, and many journals which arent really worth publishing in (in the sense that if your research is only good enough for one of those journals, then why did you even bother doing it? Although this doesnt really apply if you are an early grad student snd still learning how to do research).\n\nno, citing bad journals doesnt make you look unprofessional, you can occasionally get good papers in bad journals. It also depends why the journals are \"bad\" -- you get predatory journals that will pubiish literally anything regardless of quality/correctness, but you also get respectable low tier journals that publish work that is mostly correct, its just boring and unimaginative. Citing from the latter is totally fine, and some \"boring\" papers will have useful content (eg technical lemmas, etc).\n\nNote: the above is only really true for \"normal\" scientific fields; things will be a lot more complicated in fields which have weird political/methodlogical schisms where you get research frameworks/themes/etc which get systematically excluded from top journals/universities and end up publishing in separate venues which get looked down on by the mainstream.",
                              "author": "MoneyPrize2283",
                              "created": 1637856457,
                              "upvotes": 2,
                              "replies": {
                                "hm3d03x": {
                                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm3d03x/",
                                  "text": "Thanks for taking the time to explain! Very useful info!",
                                  "author": "captainforkforever",
                                  "created": 1637883330,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "hm1gmw5": {
                              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm1gmw5/",
                              "text": "Journals published by MDPI or Frontiers and many 'multidisciplinary' OA journals like Sage Open clearly fall into this bracket. On PLoS I'd disagree; it's at least decent.",
                              "author": "simoncolumbus",
                              "created": 1637852658,
                              "upvotes": 1,
                              "replies": {
                                "hm1jat9": {
                                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm1jat9/",
                                  "text": "So if I cite from these journals, does that make me look unprofessional? Also, what makes them “trash”? Sorry, Im new to this, trying to get a feel!",
                                  "author": "captainforkforever",
                                  "created": 1637853916,
                                  "upvotes": 1,
                                  "replies": {
                                    "hm1ykcu": {
                                      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm1ykcu/",
                                      "text": "I think it's important to make a distinction between two kinds of problematic journals. \n\nFirst, you have the typically predatory journal: these are pay-to-publish and don't involve any peer review at all. You'll typically encounter them because they solicit submissions with spam email. Often easy to spot by their overly broad names, sketchy-looking website, promises of very short turn around times, claims about being indexed by in all sorts of databases, etc. They also typically won't be indexed by Web of Science (but that is not a perfect criterion: some decent journals are not indexed by WoS; this varies quite a bit by discipline). Don't publish there, don't cite work published there.\n\nSecond, you have journals that in many ways function like regular journals in that they involve peer review and there is technically a chance that submission are rejected, but which engage in problematic practices. For example, Frontiers makes it difficult for guest editors to reject submissions. MDPI solicits enormous numbers of special issues (almost 3,000 at the same time at one of their journals alone)---and we all know that rejection rates for special issues are typically low. These journals have very high acceptable rates, and frequently publishing there is increasingly recognised as problematic. I don't think it's problematic citing papers in such journals---plenty of good scholars have been lured in by these publishers---but I wouldn't publish there at this point.\n\nUltimately, you should develop a sense of what journals are reputable in your field/subfield as you progress through grad school. A good supervisor should be able to provide guidance; I also think it's really helpful to follow debates on Twitter. That's where I often learn about problematic practices at different journals/publishers.",
                                      "author": "simoncolumbus",
                                      "created": 1637860575,
                                      "upvotes": 2,
                                      "replies": {
                                        "hm3d76e": {
                                          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm3d76e/",
                                          "text": "Thank you! Any specific twitters you would recommend?",
                                          "author": "captainforkforever",
                                          "created": 1637883428,
                                          "upvotes": 1,
                                          "replies": {
                                            "hm50kq3": {
                                              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm50kq3/",
                                              "text": "Really depends on your discipline. I'd start by following some people whose work you like and some of your peers, then branch out from there. Twitter is quite good still at making it easy to discover people who talk about interesting things.",
                                              "author": "simoncolumbus",
                                              "created": 1637919689,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hlxj9it": {
                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlxj9it/",
                  "text": "Sounds like this guy hasn’t done much reading or publishing",
                  "author": "ohnoyoudin",
                  "created": 1637778572,
                  "upvotes": -1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlwcfv2": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwcfv2/",
      "text": "Are you active on Twitter? At least in ecology, it can have a meaningful impact on the citation rate of papers.",
      "author": "TacoCult",
      "created": 1637760644,
      "upvotes": 12,
      "replies": {
        "hlwh5h2": {
          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwh5h2/",
          "text": "You are right about that, I find many good work there. I usually avoid talking about my own work, but maybe I should.",
          "author": "nudist_bro",
          "created": 1637763022,
          "upvotes": 6,
          "replies": {
            "hlwt3p5": {
              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwt3p5/",
              "text": "I can’t speak from a publication perspective, but it seems to me that learning to talk about your own work in these casual ways is important for networking and gaining reputation in academia more generally. If people aren’t finding it, help them find it!",
              "author": "schilke30",
              "created": 1637768242,
              "upvotes": 8,
              "replies": {
                "hlxnioi": {
                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlxnioi/",
                  "text": "Easy access and word-of-mouth are valuable and often overlooked. On more than one occasion my mother, an academic in a very different field, has forwarded me something interesting that she saw randomly and I had somehow missed.",
                  "author": "TacoCult",
                  "created": 1637780214,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "hlyo3i8": {
          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlyo3i8/",
          "text": "The journal should also be promoting each paper on platforms like Twitter.",
          "author": "JEZTURNER",
          "created": 1637794848,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlvqv5d": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlvqv5d/",
      "text": "I read that about 50% of papers are never cited.  But with ten you would be pretty high on the curve.\n\nOut of interest - do you cite your own prior studies?",
      "author": "Life_time_learner",
      "created": 1637745066,
      "upvotes": 24,
      "replies": {
        "hlw9zbm": {
          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlw9zbm/",
          "text": "Agreed. If the papers built on themselves or were in the same area they should have cited each other.  I know some folks don't like self citing, but that is if 75% of the citations are from the authors.  Citing your previous work in the same area would be helpful to your readers.  \n\nAlso, like everything nowadays, academic search engines run off algorithms. One or two initial (and possibly self) citations can make a paper rise to the top of the pile on Google Scholar or some such website.",
          "author": "grounded_out",
          "created": 1637759265,
          "upvotes": 9,
          "replies": {
            "hlwhhtt": {
              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwhhtt/",
              "text": "Yes, I have self citations, but I don't count those. I usually avoid citing my own work as much as possible.",
              "author": "nudist_bro",
              "created": 1637763188,
              "upvotes": 1,
              "replies": {
                "hlwkb3p": {
                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwkb3p/",
                  "text": "I don’t think you should avoid it.",
                  "author": "ThePhysicistIsIn",
                  "created": 1637764499,
                  "upvotes": 38,
                  "replies": {
                    "hlwms5k": {
                      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwms5k/",
                      "text": "Agreed",
                      "author": "octaviousearl",
                      "created": 1637765597,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                },
                "hlxzwso": {
                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlxzwso/",
                  "text": "You should be sure to cite your own papers if they're relevant or show a logical progression. I'm in a different field, but it's often very useful to be able to easily dig back to the original papers where a technique was introduced or a line of investigation started.\n\nIt'll also make it easier for your readers to find your other papers. Often I'll look at something because it's close to what I care about, but not quite. If I see they cite another of their own papers it might lead me to something I'll actually cite.",
                  "author": "racinreaver",
                  "created": 1637785098,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlvj8rd": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlvj8rd/",
      "text": "I have no advice or expertise. Just curious what your publications are about specifically. Others responding might want to know too.",
      "author": "Ok_Name_2220",
      "created": 1637739102,
      "upvotes": 7,
      "replies": {
        "hlvjdjh": {
          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlvjdjh/",
          "text": "Mostly discourse analysis on issues about sustainability and social well-being.",
          "author": "nudist_bro",
          "created": 1637739200,
          "upvotes": 6,
          "replies": {
            "hlvurso": {
              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlvurso/",
              "text": "I hope you're not publishing in any MDPI journal.",
              "author": "Bhatti_778",
              "created": 1637748393,
              "upvotes": 7,
              "replies": {
                "hlwhri4": {
                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwhri4/",
                  "text": "Nope, no MDPI or Frontiers for my work.",
                  "author": "nudist_bro",
                  "created": 1637763318,
                  "upvotes": 6,
                  "replies": {}
                },
                "hlw9z1v": {
                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlw9z1v/",
                  "text": "What's wrong with MDPI journals?",
                  "author": "ardula99",
                  "created": 1637759261,
                  "upvotes": 2,
                  "replies": {
                    "hlwfa9k": {
                      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwfa9k/",
                      "text": "They are very spammy when it comes to asking you to review and submit etc., but MDPI journals also contain frustratingly good papers as well, at least in my field. Their publication model is built upon getting stuff out quickly (as in, paper received, reviewed in 2 weeks, published in 3 from submission). I can appreciate that - really - because some journals love to take their time. And MDPI is open access, 100%, also... mostly good. I've done special issues for them and reviewed and published.\n\nMDPI has its place but I would never go there as my first stop for \"real\" publications - the \"right\" people won't read them in my field.\n\n  \n[If you really want to go down the rabbit hole.](https://scholarlykitchen.sspnet.org/2020/08/10/guest-post-mdpis-remarkable-growth/)..",
                      "author": "__x0x__",
                      "created": 1637762115,
                      "upvotes": 13,
                      "replies": {}
                    },
                    "hlwfcvk": {
                      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwfcvk/",
                      "text": "They're predatory (or many of them are) on top of tons of other issues. I've heard of them saying someone is an editor or guest editor for a special issue without that person being aware of it.",
                      "author": "rosealyd",
                      "created": 1637762150,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlvkvyv": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlvkvyv/",
      "text": "Where are publishing? You need to publish in journals people are reading and citing. \n\nAlso what are you or your institution doing to \"advertise\" your work? Present your work at conferences, get your university to issue press releases and publicise them on social media. \n\nFinally, 10 publications from a PhD is quite a lot. Are you slicing the salami a bit too thinly and each paper is not impactful enough?",
      "author": "Kiss_It_Goodbyeee",
      "created": 1637740320,
      "upvotes": 31,
      "replies": {
        "hlvlsgc": {
          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlvlsgc/",
          "text": "I have published in Q1 and Q2 journals according to Clarivate rankings. I'm not doing salami slicing. In social sciences it is common to write about the same topic from different conceptual perspectives. Also, I have co-authors from other fields (I'm the first author in only five of the papers).",
          "author": "nudist_bro",
          "created": 1637740988,
          "upvotes": 9,
          "replies": {
            "hlvum9s": {
              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlvum9s/",
              "text": "If you're publishing in Q1 and Q2 journals then it means you're doing a very good job. I have observed that normally citations of one's paper start appearing after a year of publication.",
              "author": "Bhatti_778",
              "created": 1637748264,
              "upvotes": 21,
              "replies": {}
            },
            "hlw30sq": {
              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlw30sq/",
              "text": "That's great. \n\nWhat's the citation rate for other articles in the journals you published in? Don't forget that the majority of papers are never cited, but also it can take a couple of years for papers to start getting cited. \n\nYou need to be careful regarding too much self-citation but I'm surprised you've not cited any of your work yourself. Do these papers not build on each other or cover similar questions?",
              "author": "Kiss_It_Goodbyeee",
              "created": 1637754811,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "hlwk5gj": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwk5gj/",
      "text": "Easy to solve, do more peer reviews and shoehorn all your papers in! \n\n(Mostly joking)",
      "author": "Pr0gr3s",
      "created": 1637764427,
      "upvotes": 6,
      "replies": {}
    },
    "hlxxs7j": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlxxs7j/",
      "text": "I’m in English, and I don’t even know if I’ve been cited most of the time. Once, though, I was reading a book that mentioned a scholar’s work. I thought, “That’s weird—someone else that has the same name as me!” It took an embarrassingly long time before I realized that I was the one being cited. Otherwise, no idea. That could be my only citation as far as I know.",
      "author": "MagScaoil",
      "created": 1637784249,
      "upvotes": 4,
      "replies": {}
    },
    "hlynydz": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlynydz/",
      "text": "10 publications at that career stage is impressive regardless.",
      "author": "JEZTURNER",
      "created": 1637794787,
      "upvotes": 3,
      "replies": {}
    },
    "hly1ovr": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hly1ovr/",
      "text": "It might just take time.  Think about the time from submission to publication, in addition to the time for other researchers to read your work and finish conducting their own studies.  \n\nLots of good suggestions on here, but it is a positive feedback loop, i.e. the more your paper gets cited the more it gets cited.  You just need to get those first few citations and the paper's readership will grow.  \n\nGood luck!",
      "author": "RBARBAd",
      "created": 1637785807,
      "upvotes": 2,
      "replies": {}
    },
    "hlvtj6e": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlvtj6e/",
      "text": "Why don't we all just cite eachother. Stick it to the man",
      "author": "Bubbly-Bat-7869",
      "created": 1637747344,
      "upvotes": 4,
      "replies": {
        "hlwdw6g": {
          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwdw6g/",
          "text": "Give me some pmids I'll try to work it into my next paper on neuroregeneration, what's the topic, could be quite comical to try and fit!",
          "author": "ActionXPotential",
          "created": 1637761411,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hlx5k8a": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlx5k8a/",
      "text": "Honestly, I wish there was more research available out there, like a mega-search engine of all academic work. I’m tired of using a combination of Google scholar, my school’s academic data base, my friend’s school academic data base to find reliable literature. \n\nThis would benefit both authors and student researchers alike. \n\nFor example, I did a paper on “gamer gate” and ethnographic research into physical and digital spaces. The research I did yielded maybe 5-8 relevant articles/publications, even with help from two librarians at two different institutions. Only two of the articles were relatable to my research, and one of which called gamer gate a “misunderstanding of video games” by unfairly stereotyping the video gaming community “a boys club.” (That statement aged poorly.) Literally a year later after I put the paper to rest, I found out my a media studies professor ON MY CAMPUS specializes in ethnographic research in digital spaces/video games, and did a paper on a similar topic AND a contemporary analysis of gamer gate YEARS PRIOR TO MY RESEARCH!\n\nWhat the heck! \n\nI’m doing a research paper currently on a very contemporary topic in the news, and I’m afraid my limited analysis of the literature in the field thus far is only due to the limitation of the search engines and phrases I use. Seriously, even with the help of multiple librarians and my academic advisor, finding GOOD, useful literature on contemporary topics in social sciences could be made easier.",
      "author": "SecretSnowww",
      "created": 1637773225,
      "upvotes": 3,
      "replies": {
        "hly0x1r": {
          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hly0x1r/",
          "text": "I'm curious, do you really find many papers that are not present on google scholar?",
          "author": "RBARBAd",
          "created": 1637785500,
          "upvotes": 3,
          "replies": {
            "hly776n": {
              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hly776n/",
              "text": "Yes. I don’t think I’ve ever found what I was looking for from Google scholar, or ever cited a source I found from there. I’m an American social science under graduate (political science) who of instead of exams, we write 20-30 page original research papers instead.",
              "author": "SecretSnowww",
              "created": 1637787983,
              "upvotes": 0,
              "replies": {
                "hlymsfc": {
                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlymsfc/",
                  "text": "Wow, so different.  I'm in a different field but I can exclusively use Google Scholar... thanks for your perspective!",
                  "author": "RBARBAd",
                  "created": 1637794279,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlx2c8j": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlx2c8j/",
      "text": "Even my collaborator always forgets to cite my paper after building their new study on the formalism that I developed. This is after multiple zoom meetings with the student and postdoc to help them develop my code. They still cite later works by more popular groups on the same line of studies. Now I have accepted the fact that when you are not from the US people tend to forget you.",
      "author": "verokzo",
      "created": 1637771955,
      "upvotes": 2,
      "replies": {}
    },
    "hlwdyfb": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwdyfb/",
      "text": "I’m in life science, and time to time I see papers from female PIs were left out and similar papers from male PI were cited. Besides, some competitors don’t cite your papers for the similar works, they cite their own works instead.",
      "author": "serotonin2020",
      "created": 1637761444,
      "upvotes": 1,
      "replies": {
        "hlwh14i": {
          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwh14i/",
          "text": "I'm not female, but my name reveals that I'm from Latin America and I have published mainly with female colleagues.",
          "author": "nudist_bro",
          "created": 1637762964,
          "upvotes": 2,
          "replies": {
            "hlxi58k": {
              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlxi58k/",
              "text": "It's tempting to blame on sexism/racism, but I think the truth is simpler. People cite stuff they know, they don't typically put a lot of efforts into finding what has been done in the field through systematic google searches. Main ways you get your first citations is: \n\n- researchers you know (ex colleagues, friends etc)\n- advertising at conferences\n- advertising on social media\n- actively try to get press coverage\n- collaborations with people who are already famous and followed by the community\n\nThen you need to snowball: having some initial recognition and citations brings more, because people copy each other, and search engines show first the most cited papers matching the search. Little by little, you need to make an impression, people need to know your name and associate it with your work. You need to be the person people think of when thinking of a topic. When you have reached that, sit back and enjoy the citations \\^_^",
              "author": "Thog78",
              "created": 1637778138,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hlwi02a": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlwi02a/",
      "text": "Same. I have 7 papers, and only one citation. Really demoralizing when I see papers published within the last year have 5+ citations. That said, my area is beyond niche, and I really don't expect any citations. The most important reference that I used is a paper that only has 2 citations (from 2017), so if that's how few people value that guy's work, I can't really complain when I have zero.",
      "author": "goatsnboots",
      "created": 1637763433,
      "upvotes": 1,
      "replies": {
        "hlww9l2": {
          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlww9l2/",
          "text": "In my work I try to be generous with citations, particular to authors with low citation and those outside Europe and USA (at least as research examples).",
          "author": "nudist_bro",
          "created": 1637769528,
          "upvotes": 1,
          "replies": {
            "hlx1sxq": {
              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlx1sxq/",
              "text": "I started doing that this year as well. I don't see a reason not to unless you're trying to make a page limit.",
              "author": "goatsnboots",
              "created": 1637771745,
              "upvotes": 3,
              "replies": {}
            },
            "hlx2yxr": {
              "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlx2yxr/",
              "text": "deliberately citing/not-citing people based on irrelevant demographic factors like nationality/etc is scientific misconduct, and you shouldnt be doing this.\n\nYou should be citing the papers that your work actually depends on, not treating it as some kind of charity to go to \"deserving\"recipients. Its really not any different to only citing your friends or refusing to cite Jews or whatever.",
              "author": "MoneyPrize2283",
              "created": 1637772204,
              "upvotes": 4,
              "replies": {
                "hlx9460": {
                  "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlx9460/",
                  "text": "It is a political issue, and it is not deliberately, if I find to pieces of research on the same topic and getting to similar conclusions, I will cite the one that is from outside the Global North. It is very different, most people cite whatever they find just because it is written by an Oxford professor.",
                  "author": "nudist_bro",
                  "created": 1637774615,
                  "upvotes": 7,
                  "replies": {
                    "hlx9wzy": {
                      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlx9wzy/",
                      "text": "> I will cite the one that is from outside the Global North\n\nYou mean you'd rather cite an Australian than an American? Why?\n\nLooking up irrelevant demographic information about authors and using it to determine citations seems like blatent misconduct; how is this any different from choosing to cite/not cite people based on their religion, sex, whatever?  I have no idea what institution the authors of most papers I cite are at, why is this information you would actively seek out, let alone use to determine your citations?",
                      "author": "MoneyPrize2283",
                      "created": 1637774927,
                      "upvotes": -2,
                      "replies": {
                        "hlxbagm": {
                          "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlxbagm/",
                          "text": "You have no idea what Global North or Global South refers to? This conversation cannot go on. You truly have no idea about the politics of academia and I don't have time for your trolling.",
                          "author": "nudist_bro",
                          "created": 1637775452,
                          "upvotes": 8,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlytxot": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlytxot/",
      "text": "Beyond getting the publication out, there’s actually a marketing component that may be necessary. Present results of the work at conferences and to practitioners, have a website to share it to a lay audience, etc.",
      "author": "Frogmarsh",
      "created": 1637797466,
      "upvotes": 1,
      "replies": {}
    },
    "hlz9l2z": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlz9l2z/",
      "text": "Give it some time. Also try to increase the visibility of your work by uploading preprints.",
      "author": "Groundbreaking-Air73",
      "created": 1637804459,
      "upvotes": 1,
      "replies": {}
    },
    "hlzlz02": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlzlz02/",
      "text": "Do you go to conferences? Do you network with scholars you admire on Twitter? A lot of citation politics are simply clique politics — if you reach out to people that you cite to let them know about your work, they’ll be aware of it when they write their next lit review. Even then I think it’s normal for this kind of thing to take time.",
      "author": "isaac-get-the-golem",
      "created": 1637810072,
      "upvotes": 1,
      "replies": {}
    },
    "hm0bqt7": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm0bqt7/",
      "text": "It should put off you off how you're currently operating, and that's OK. If your papers are consistently not getting cited it means that your work is not part of the conversation. \n\nThis doesn't mean it's bad work or isn't useful, but it does mean that it isn't getting noticed ... which is a terrible return on all the hard work you invested. \n\nGet out there and promote yourself at conferences, blog/tweet about your work, and try to publish in higher impact journals. The life academic is one of self promotion. Always has been.",
      "author": "DrinkingAtQuarks",
      "created": 1637824387,
      "upvotes": 1,
      "replies": {}
    },
    "hm182tc": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hm182tc/",
      "text": "Feels bad man.",
      "author": "MercuriousPhantasm",
      "created": 1637848284,
      "upvotes": 1,
      "replies": {}
    },
    "hlxmbch": {
      "link": "/r/AskAcademia/comments/r0zbpv/how_do_you_feel_about_your_papers_not_being_cited/hlxmbch/",
      "text": "Don't care, so long you can get a job with the paper. Citations are just a popularity contest that do not judge the findings themselves, only whether people like the paper (not even the finding). Mendel was forgotten then rediscovered, Fleming's penicillin was forgotten then rediscovered, etc.\n\nThere are an awful lot of papers that are very sound, but are incorrect of lacking in proof / data that corroborate them.. but because they are sound they are still popular and cited (particularly in biology).",
      "author": "g33ksc13nt1st",
      "created": 1637779754,
      "upvotes": 0,
      "replies": {}
    }
  }
}