{
  "sid": "m1lumw",
  "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/",
  "title:": "I had a mild brain injury during my PhD program ... Now unsure about my future",
  "text": "My fiance suggested I create this account to talk about this issue, new to this community and just hoping to get some thoughts and perspective... \n\nSo, a little background.... As I was going through my masters (and even before that) I felt like I would be really happy going the academic job route. There were a lot of things that I liked about it, so I decided to pursue a PhD (in natural resources/fisheries/ecology). All was going well enough, and I was preparing myself to one day enter the academic job market. About 3.5 years in to my program, and after passing my comprehensive exams, I got a concussion from a mild injury. Most people the symptoms pass within a few weeks, but unfortunately I became one of about 30% of people that get post concussion syndrome. I continued to deal with headaches, dizziness, extreme fatigue, etc.... Had to take some time off for an unofficial medical leave, and then came back to finish my degree. I continued with my concussion rehab for the past almost 2 years while writing my thesis, and I'm proud to say that I made it through all of this and will be defending in a few weeks.\n\nThat brings me to the point of this post.... Prior to my injury, I was preparing myself for an academic position. It's all I've considered for so long, but with my current health status and the outlook for improvements, I no longer think it's the right path for me. I just can't realistically push my brain and body for 50-60 hour weeks to get through the application process and getting tenure. \n\nWhich leaves me thinking .... what kind of career paths could I consider ? How could I use the skills I learned during graduate school in fisheries ? Has anyone else gone through a career change after their PhD? Thanks in advance!",
  "author": "viennawaits4you1003",
  "created": 1615339553,
  "updated": 1634080532,
  "over_18": false,
  "upvotes": 262,
  "upvote_ratio": 0.99,
  "comments": {
    "gqeljxu": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqeljxu/",
      "text": "I don’t have any advice but I also had a concussion and am dealing with long term effects that I expect will limit my options after grad school. I’m sorry you had to go through that, I know how tough and exhausting it is",
      "author": "Contntlbreakfst",
      "created": 1615344781,
      "upvotes": 123,
      "replies": {
        "gqgd43x": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgd43x/",
          "text": "I'm sorry that you had to go through that too. It is very exhausting, physically but also emotionally. I wish you the best with your recovery and what you decide to do next. I keep trying to tell myself that maybe this is putting me on the path that I'm meant to be on? I hope that is true for you as well.",
          "author": "viennawaits4you1003",
          "created": 1615390062,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "gqf454k": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqf454k/",
      "text": "The selection process can be a bit tough but you can look at positions related to your field in government at USAjobs.gov.  You would qualify at the GS-11 level and be eligible for the \"recent graduate\" filter and \"pathways\" programs. You could find work in research or more policy/administrative/regulatory capacities.\n\nThe work/life balance in government is much better than academia. But the work is stable, career growth is fairly structured and to my knowledge,  government employees are somewhat discouraged from working more than 40 hr/week unless necessary. I believe that the general trend for research roles is that you have a much better work life balance but less autonomy over what you are researching (You study what your job details and supervisor/management request).\n\nYou can look at the US Forest Service, state departments of fish and wildlife, departments of natural resources, the EPA, USGS, etc.",
      "author": "Javelin901",
      "created": 1615356870,
      "upvotes": 113,
      "replies": {
        "gqfxqi6": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfxqi6/",
          "text": "To add, if OP is having as significant challenges as they mention, they may want to look into a Schedule A letter as well if they and their doctor believe their condition would meet the disability criteria set out by OPM.",
          "author": "okamzikprosim",
          "created": 1615382418,
          "upvotes": 15,
          "replies": {
            "gqgnzpc": {
              "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgnzpc/",
              "text": "You want to be a bit careful about this.  \n\nCognitive disabilities in particular are murky and problematic areas. Once that is official, it is hard to get that off your record and you have to remember that   you don't get all accommodations , only reasonable ones.  \n\nSo you can wind up with a thing that says you have such problems without qualifying for disability benefits.\n\nYou should really , really think carefully about going that  route",
              "author": "PersephoneIsNotHome",
              "created": 1615394454,
              "upvotes": 23,
              "replies": {
                "gqgqbot": {
                  "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgqbot/",
                  "text": "very very good point, I don't really think I would qualify for disability benefits because I am somewhat \"functional\". I've been reading a bit about when to disclose disabilities to your employer and what can that do for you and it really seems like \"it depends\". Very complicated for sure.",
                  "author": "viennawaits4you1003",
                  "created": 1615395366,
                  "upvotes": 5,
                  "replies": {
                    "gqhirs7": {
                      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqhirs7/",
                      "text": "Disability benefits may be quite a bit broader than you might guess. First of all, benefits in this sense mean accommodations for you to be able to do your job - and accommodations can mean something like an adjusted work schedule, additional time off or more understanding when you need to take off from work with shorter notice.\n\nBut secondly, *most* people with disabilities are functional. You can still be 'functional' and get disability benefits, if you need them.",
                      "author": "roseofjuly",
                      "created": 1615406384,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "gqi100j": {
                      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqi100j/",
                      "text": "Schedule A does not have to do with accommodations from my understanding and is rather a non-competitive hiring option for applicants. It's probably not disability benefits in the sense you are thinking of most likely either. It's essentially up to your doctor to decide if you are eligible.\n\n[Here is more info.](https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/individuals-with-disabilities/)",
                      "author": "okamzikprosim",
                      "created": 1615414297,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gqgdc7d": {
              "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgdc7d/",
              "text": "I've been wondering about this too - thanks for the tip about the Schedule A letter. All the language around disability is still pretty confusing to me.",
              "author": "viennawaits4you1003",
              "created": 1615390163,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gqfxtwg": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfxtwg/",
          "text": "If you have a diagnosis, you'll also likely qualify for fast track hiring. Basically, a manager can hire someone who is qualified instead of going through the entire competitive selection process.",
          "author": "Matterials",
          "created": 1615382476,
          "upvotes": 8,
          "replies": {}
        },
        "gqgd8xb": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgd8xb/",
          "text": "Moving into the gov sector is definitely something I'm considering, it's nice to hear that the work life balance seems to be better there, thanks for the advice!",
          "author": "viennawaits4you1003",
          "created": 1615390122,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gqfavqd": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfavqd/",
      "text": "Im so sorry to hear about your accident. My PhD happens to be on dizziness in post-concussion syndrome, and as a physician I see a number of patients completely distraught by not being able to get help. You are most certainly not alone, because this is far more common than most realize. My experience is that almost everyone can see improvements with the right rehabilitation, but the issue is reaching that first clinical contact who recognizes the phenomenon. Kenneth Ciuffreda has published several papers on how rehabilitation can look, if the dizziness or light sensitivity is your main concern. Most of my patients get some help from +1 glasses with +2 inward-prisms, possibly some coloured filter as well, to ease symptoms to start visual rehabilitation therapy. \nI have seen this work on so many patients, and while I dont know you, dont give up! There is help to get!",
      "author": "Xeked",
      "created": 1615362767,
      "upvotes": 66,
      "replies": {
        "gqgdhc4": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgdhc4/",
          "text": "I just want to say that it makes me so happy that people are pursuing PhDs on topics like this. The work you do will be so helpful for so many people. Thank you!",
          "author": "viennawaits4you1003",
          "created": 1615390227,
          "upvotes": 16,
          "replies": {
            "gqgggqa": {
              "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgggqa/",
              "text": "Being on my final year with all the struggles that entails, that means a lot, thank you so much!",
              "author": "Xeked",
              "created": 1615391516,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gqhmqh3": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqhmqh3/",
          "text": "What's the thought process behind the +1 glasses with +2 inward-prisms? I'm two years post TBI with mostly recovered 4th nerve palsy from how large my blood clot was. I've have been considering reading glasses in the hopes I can read for longer periods of time.",
          "author": "FucksPlants",
          "created": 1615408097,
          "upvotes": 2,
          "replies": {
            "gqhv0pn": {
              "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqhv0pn/",
              "text": "We honestly have no proven physiological mechanism, but we believe it relieves a subclinical accommodation insufficiency. It doesnt always work, but when it does it can be quite remarkable in relieving some of the hypersensitivity to visual stimuli many experience. Optometry exams are generally based on 20th century working conditions, and today we have so much more near-distance work that those parameters are obsolete. We often see what we call a \"forced head tilt\" with a trochlear palsy, to adjust for the eye position. I'm venturing a guess that you may experience some double vision after reading for a bit, which prisms may relieve by forcing the eyes together. I would certainly recommend seeing an optometrist and asking to test some out.",
              "author": "Xeked",
              "created": 1615411655,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gqepdsb": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqepdsb/",
      "text": "I happy that you strive forward despite your condition and is about to close a chapter in your Phd journey. \n\nI was just curious if there's some sort of desk-oriented careers that you might be able to enjoy such as scientific writing/communication or an editor position instead that does not require a lot of physical exertion.",
      "author": "overzealous_labgnome",
      "created": 1615346948,
      "upvotes": 21,
      "replies": {}
    },
    "gqflwng": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqflwng/",
      "text": "I don’t have much to offer, but my wife got her first concussion during pharmacy school. She ended up hitting her head another four times within pharmacy school. Her GP thinks she has some depth perception issues. \n\nShe went from top of her class to a C student. She developed chronic headaches, depression, anxiety, and ADD. The fatigue and dizziness were there, too. She went to a bunch of different doctors, including neurologists, and all she got were meds for pain management. \n\nI can’t offer insight into your situation, but your post is such a comfort to read because it makes me feel a bit less alone. No one at her university, including some of her friends, seemed to take her situation seriously. It got laughed off because she just hit her head on a door—not like she was a football player, right? She kept getting written off as lazy by both her peers and preceptors. This went on during three years of pharmacy school, and it’s been two years since graduation. She’s still dealing with symptoms. \n\nAnyway, I just wanted to say that I’m so sorry that this happened to you. She went through a whole identity crisis given that, like you, she had to reevaluate her goals. She barely made it through school, and she knew she’d never be able to do a residency. Luckily, she ended up with a good job that hasn’t exacerbated her health issues too much. I hope your situation has a better outlook than hers, but even she’s flourishing—just not in the way we planned. I also hope that our story helps you feel less alone with such an insidious injury.",
      "author": "nerdhappyjq",
      "created": 1615373408,
      "upvotes": 20,
      "replies": {
        "gqfvkct": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfvkct/",
          "text": "As faculty in a pharmacy school, I am so sorry. I can’t believe this happened. The lack of empathy is absolutely atrocious.",
          "author": "tiensij",
          "created": 1615381057,
          "upvotes": 13,
          "replies": {
            "gqfzvjt": {
              "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfzvjt/",
              "text": "I appreciate the empathy. I’m not sure what was going on with her school. It’s one of the top pharmacy schools in the country and her cohort was in the middle of a complete restructure of the curriculum, so I’m not sure if she just got lost in the cracks. \n\nProbably the worst part was when she had to take a break from a rotation. They scheduled her to retake it in July without telling us that it was then considered the summer semester. We were stuck with the inability to take out loans and a $2,000 bill for the credit hour while struggling to pay rent for a couple of extra months that we hadn’t planned on. Just awful -.- glad we’re past it.",
              "author": "nerdhappyjq",
              "created": 1615383662,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gqgdw7w": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgdw7w/",
          "text": "I'm so sorry this happened to your wife! I actually also \"just hit my head on a door\". I've since learned that the severity of the injury does not correlate with the severity or duration of prolonged symptoms, and it's really sad that people don't understand that. I'm glad your wife has found something that works for her. Thank you for sharing, it really does help to know I'm not alone in this.",
          "author": "viennawaits4you1003",
          "created": 1615390413,
          "upvotes": 5,
          "replies": {
            "gqgibtu": {
              "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgibtu/",
              "text": "Pesky doors :( I’m glad our story could help. I’m also glad that you’re in a headspace where you’re able to focus on taking care of yourself in your new normal instead of trying to “power through.” Getting to that point took a couple of years for my wife.",
              "author": "nerdhappyjq",
              "created": 1615392253,
              "upvotes": 1,
              "replies": {
                "gqgiyc9": {
                  "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgiyc9/",
                  "text": "I feel that. I sometimes to back to the \"power through\" mindset (which is actually what started this career crisis, I realized if I got offered a certain type of position I wouldn't take it because of my health). It's a tough one to battle",
                  "author": "viennawaits4you1003",
                  "created": 1615392511,
                  "upvotes": 2,
                  "replies": {
                    "gqgjq6m": {
                      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgjq6m/",
                      "text": "It also doesn’t help that there’s (I’m assuming, from experience) a bunch of guilt behind not being able to perform in the same way. In my wife’s case, we worked to rethink the situation as one that let her be more empathetic to her patients.",
                      "author": "nerdhappyjq",
                      "created": 1615392802,
                      "upvotes": 1,
                      "replies": {
                        "gqgqgvp": {
                          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgqgvp/",
                          "text": "yes exactly! \n\nthat's a really good way to reframe the situation, I'm glad that is how she is thinking about things now :)",
                          "author": "viennawaits4you1003",
                          "created": 1615395426,
                          "upvotes": 2,
                          "replies": {
                            "gqgqknz": {
                              "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgqknz/",
                              "text": "Same :) I hope you find your own way of doing so. Good luck with everything.",
                              "author": "nerdhappyjq",
                              "created": 1615395468,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gqhe5yc": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqhe5yc/",
          "text": "This post and the comments make me feel so much less alone. I got COVID back in March last year and have been dealing with long hauler symptoms ever since. The lack of empathy has been striking, to the point of ignoring it could be impacting my performance. \"I don't understand, you used to be so much faster. How do we get your passion back?\" Passion has not been the issue...",
          "author": "jmill2",
          "created": 1615404432,
          "upvotes": 6,
          "replies": {
            "gqidn9s": {
              "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqidn9s/",
              "text": "I'm so sorry! Long haul COVID seems to have similar symptoms to part of the issues I have with my nervous system that started after my concussion (it's called postural orthostatic tachycardia syndrome if you've ever come across that). There seems to be a lot of new research going in to long haul COVID, so I hope you find some relief soon! \n\nNot being believed/being perceived as \"lazy\" or not caring anymore is the worst. I feel ya.",
              "author": "viennawaits4you1003",
              "created": 1615420559,
              "upvotes": 5,
              "replies": {}
            },
            "gqjdq9z": {
              "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqjdq9z/",
              "text": "Oh man, I’m so sorry you’re dealing with this. I guess there’s really no escape from the Publish or Perish mindset. The only thing I can say is that you have to remind yourself to do things the right way instead of trying to rush to put out subpar work. I hate that that mindset is confused with laziness :|",
              "author": "nerdhappyjq",
              "created": 1615440720,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gqfqjex": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfqjex/",
      "text": "> I just can't realistically push my brain and body for 50-60 hour weeks to get through the application process and getting tenure. \n\nThere are academic positions out there do not require this kind of workload.  Less selective liberal arts colleges and regional public universities will have a higher teaching load and reduced research expectations.  At my current institution, one publication a year is enough for tenure, and at a previous liberal arts college, one publication every two years was fine.  Both were 3/3 teaching loads.  You do not need 50-60 hours weeks to do that.  In fact, to be honest about my present place, unless they are teaching a night class, you never see any faculty member in their office late and probably only 25% show up on Fridays.  Not all places have the stress of research universities.",
      "author": "manova",
      "created": 1615377451,
      "upvotes": 12,
      "replies": {
        "gqge211": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqge211/",
          "text": "That's a really good point - I think I've been surrounded by the crazy work all the time academics for so long that I forget there may be other avenues that put less pressure on their faculty.",
          "author": "viennawaits4you1003",
          "created": 1615390486,
          "upvotes": 4,
          "replies": {
            "gqhti53": {
              "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqhti53/",
              "text": "You have to be VIGILANT about work-life balance at R1s, but I know really accomplished professors even at R1s who claim to put in fewer than 40 hours per week, just by working very efficiently when they are working. (However, I don't know if your injury also makes it difficult to work efficiently--requires high concentration.)",
              "author": "anonybss",
              "created": 1615410991,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gqf9mra": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqf9mra/",
      "text": "Is there any way you can take an academic medical leave? Is there a way that you might recover to your former self after a year or so of a medical leave? \n\nThat said, my friend's ex boyfriend studied fisheries PhD and he ended up leading some research for the state natural resources department. I know somebody else who also works for either the USDA or another organization like the US Fish and Wildlife Service. What about working at a teaching university?",
      "author": "notjennyschecter",
      "created": 1615361596,
      "upvotes": 6,
      "replies": {
        "gqgedgt": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgedgt/",
          "text": "Those are good points, thank you! \n\nAnd I am considering taking some time off to do some treatments that I had been putting off during my PhD program because I just didn't have enough energy. Trying to balance the how much do I need to keep working/making money vs the value of focusing just on my health for a bit and maybe being better in the long run. I go back and forth with myself all the time about it haha.",
          "author": "viennawaits4you1003",
          "created": 1615390626,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gqfmr3n": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfmr3n/",
      "text": "Recent PhD grad here - I’ve had many (>8) head injuries over a number of years, post-concussive symptoms w all of them. My most recent was about 18 months ago, I’m still suffering the after effects (memory problems, fatigue, coordination/motor control issues, loss of balance, migraines, etc) \nI have been fortunate enough to land a permanent position in a teaching and research role (Australia) and have been here since my last concussion - I got it about a month after starting, which of course made all of my symptoms flare up again, and many of them are worse/lasting longer than in previous issues. \nI don’t necessarily have any advice except to listen to your body, which I’m sure you’re doing. If you’d like to chat about how I’m surviving academia with my current (and likely worsening) symptoms, please DM me!",
      "author": "arobenator",
      "created": 1615374189,
      "upvotes": 6,
      "replies": {}
    },
    "gqfobm3": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfobm3/",
      "text": "Nothing to add I’m afraid, other than I wanted to let you know you aren’t alone re: your realization about academia. I don’t have a brain injury but I do have Lupus and other health issues. I am a grad student now and this year came to the very difficult conclusion that, like yourself, my body cannot handle more than a 40 hr work week. And it can barely even handle that! I am so sorry that you are going through this. It has been the first time in my life I’ve felt like my disability has genuinely, seriously prevented me from doing something I want, and that has been devastating. Good luck <3",
      "author": "pony987",
      "created": 1615375600,
      "upvotes": 5,
      "replies": {
        "gqget9y": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqget9y/",
          "text": "Thank you! Good luck to you as well <3 \n\nThrough dealing with my PCS I've \"met\" others dealing with chronic illnesses, and I know they each come with their own challenges, both physical and mental health wise. I wish you all the best, I know how hard it can be emotionally.",
          "author": "viennawaits4you1003",
          "created": 1615390821,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gqf8vqg": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqf8vqg/",
      "text": "There's a woman that suffered similarly that gave a TED talk [https://www.ted.com/talks/jill\\_bolte\\_taylor\\_my\\_stroke\\_of\\_insight?language=en](https://www.ted.com/talks/jill_bolte_taylor_my_stroke_of_insight?language=en)",
      "author": "Yidam",
      "created": 1615360920,
      "upvotes": 9,
      "replies": {}
    },
    "gqfcpzh": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfcpzh/",
      "text": "If you've worked with data during your PhD there are plenty of jobs out there in various types of data analysis (data scientist, data analyst, etc) that may require only modest amounts of quantitative ability and would be happy to hire you.  I'm not sure if you're looking to switch fields entirely or if you'd find those kinds of jobs interesting, but there are plenty of people who do it.\n\nI hope you don't mind a joke but I think you probably still have too much cognitive function for a career in politics :)",
      "author": "dampew",
      "created": 1615364541,
      "upvotes": 5,
      "replies": {
        "gqgel7n": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgel7n/",
          "text": "hahaha I very much appreciate that joke actually, thank you :)",
          "author": "viennawaits4you1003",
          "created": 1615390722,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gqfgm5w": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfgm5w/",
      "text": "I also had a concussion and experienced some malfunctions of my brain for a few months. (Such as forgetting things often, not being able to type as fast as I did before, etc.) But they eventually went away (at least I think they did). I'm not a medical doctor and I don't know what your doctor said but it could be possible that your symptoms are not permanent.",
      "author": "bahasasastra",
      "created": 1615368270,
      "upvotes": 2,
      "replies": {}
    },
    "gqfqeza": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfqeza/",
      "text": "I am not sure if this site is helpful, but I have decided to search outside academia because I don't think my mental health can handle trying to get tenure https://www.insidehighered.com/blogs/gradhacker/going-alt-ac-how-begin",
      "author": "dangerprone35",
      "created": 1615377350,
      "upvotes": 2,
      "replies": {}
    },
    "gqgnxlj": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgnxlj/",
      "text": "With your background it seems like a job working for a state DEC would be be a great fit. I don't know where you are located or if you are thinking about moving for work, but here in NYS ecology/fisheries management is a big deal. Most people thinking if NYS as just the city, but the Adirondack wilderness preserve is the largest state-run park/conservation area in the country. The principal of \"forever wild\" is actually part of our state constitution. Plus state jobs have great benefits and after 20-25 years you can collect pension. \n\nAlso sorry to hear about your struggles. About 5 years ago I had a TIA that causes me to totally lose hearing in one ear and gave me crazy vertigo for a long time. Months of vestibular therapy. That's a big reason why I left the workforce and started my PhD. I couldn't drive around NYC for 6 hours a day and talk to people in busy medical offices (many of whom spoke English as a second language). So I know what it's like to have injury or illness utterly change ones career plans\n\nCongrats making it almost to the end! Be sure to update this thread inches you defend so we can congratulate a new doctor!",
      "author": "Pr0gr3s",
      "created": 1615394437,
      "upvotes": 2,
      "replies": {
        "gqgr0b9": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgr0b9/",
          "text": "I'm very sorry about your TIA, that must have been so tough! Anything that messes up the vestibular system is so miserable and takes a lot of time to rehab. I hope you are feeling better now! Thank you for the advice! And I can update when I finish, most days I really can't believe that I actually will be a doctor :-P",
          "author": "viennawaits4you1003",
          "created": 1615395642,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gqitsl1": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqitsl1/",
      "text": "No great advice here, but it's more common than you would think. I personally know 1 tenured prof, 1 assistant prof, 1 lecturer, 1 private sector former grad student and 2 current grad students who had concussions of various sorts, at least two of whom had prolonged post-concussive syndrome - and I'm sure it was underreported.\n\nIf you've been in rehab for two years, you already know the drill. Things can take years to resolve themselves. They may still continue to improve (though I don't want to give false hope in case they don't). But regardless, the timing might not work out with the timelines expected in academia (academia doesn't usually look well upon career gaps).\n\nMaybe consider lecturing, if you like it? Lecturing is at least somewhat flexible, and it does not have as demanding an application process. Community college teaching? SLAC?\n\nOr, I highly agree with the other poster that recommended government. Government is strictly 35-40 hours a week - and often less if you can get away with it (long lunch breaks... but of course it depends where you work).\n\nBest of luck.",
      "author": "uniadminthrowaway",
      "created": 1615429046,
      "upvotes": 2,
      "replies": {
        "gqixywx": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqixywx/",
          "text": "Wow, it still amazes me how common post concussion symptoms are, but people do definitely downplay or hide them from most people I think. Thank you for your advice !",
          "author": "viennawaits4you1003",
          "created": 1615431269,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gqfyggq": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfyggq/",
      "text": "My father in law had serious brain injury from a car accident at age 19. Had to learn to walk, talk, wipe is ass again and everything in between. Had to have a piece of his brain removed in order to survive. He's a lead cardiopulmonary Doctor now, after putting himself through school after his injury. I say all of this to let you know, with time and perseverance, you can achieve anything you have the time and patience for. Chase that dream buddy, you didn't come this far just to come this far.\n\nEdit: I apologize if this comes off rude in any way, not intended to provoke negative feelings.",
      "author": "emptybottleofdrank",
      "created": 1615382855,
      "upvotes": 3,
      "replies": {
        "gqgf130": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgf130/",
          "text": "Thank you for sharing, I always appreciate stories of healing!",
          "author": "viennawaits4you1003",
          "created": 1615390915,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqfzybh": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfzybh/",
      "text": "Just wanted to say that in addition to this type of academic advice, I’d also suggest talking to others with your condition and see what has worked for them, either on Reddit or elsewhere.",
      "author": "Depressaccount",
      "created": 1615383704,
      "upvotes": 1,
      "replies": {}
    },
    "gqgb0zi": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgb0zi/",
      "text": "I dont know much about your degree but with the generalities that you have mentioned,\n\n you can try working as a consultant from different businesses that may afford your services. \n\nOr, you can also start your own business with your partner. You can get some hands, im sure you have a thing or two with managing people.\n\n Or you can take some academic position if u still long for academic works but as a part time, i guess.\n\nI hope this general answer will help you sort out what you want to do while not taking too much tax on your health.\n\nGoodluck on your journey!!",
      "author": "Extension_Olive_2116",
      "created": 1615389164,
      "upvotes": 1,
      "replies": {
        "gqgf3jc": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgf3jc/",
          "text": "Thank you!",
          "author": "viennawaits4you1003",
          "created": 1615390943,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqgngz6": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgngz6/",
      "text": "please consider well that u/Javelin901 says,\n\nCan I add that I truly wish I had done something like that instead of the entire academic path.  There are really satisfying and interesting options, it is not a failure path or a disability path, it is a really viable career path.",
      "author": "PersephoneIsNotHome",
      "created": 1615394264,
      "upvotes": 1,
      "replies": {}
    },
    "gqgxa0y": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqgxa0y/",
      "text": "What!? This is a huge wake up call, can this be tested for? Is it treatable? I thought I was \"healed\" after the memory loss and dizziness stopped, but I didn't know symptoms could persist. When trying to figure out my current symptoms neither my  GP nor my neurologist asked about previous TBIs. I'm going to bring this up at my next appointment. \n\nSorry for your struggles but you may have just helped me for what it's worth!",
      "author": "goatsandhoes101115",
      "created": 1615397960,
      "upvotes": 1,
      "replies": {
        "gqh1256": {
          "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqh1256/",
          "text": "From the TBI communities I've joined, there are many people that don't connect current symptoms to past injuries, including doctors! The testing for thing is a bit murky to me - I was diagnosed with it about a month after my injury since I had such severe remaining symptoms, but I think yes it should be able to be tested for? In terms of treatment, YES, it is treatable! It all depends on where your symptoms are coming from, concussions can be pretty complex and cause issues in many different systems. Feel free to DM me if you have any questions!",
          "author": "viennawaits4you1003",
          "created": 1615399206,
          "upvotes": 2,
          "replies": {
            "gqh1xs5": {
              "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqh1xs5/",
              "text": "Thank you!",
              "author": "goatsandhoes101115",
              "created": 1615399535,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gqhit6o": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqhit6o/",
      "text": "One of my former coworkers (and now friend) went through this exact same thing, though I think her head trauma was pretty severe and happened while doing field work. \n\nWe had a lot of talks about how she had to shift a lot of her life goals because she just can’t do math like she used to and needed a job that could be accommodating to taking time off as needed. \n\nShe worked for the state, then the city, and finally works for the EPA, now. Frankly, many government jobs do really really well when it comes to accommodations for just about anything (within reason). \n\nI know the forest service and our state (and I assume others) both have a wide variety of fish related jobs.",
      "author": "missus_pteranodon",
      "created": 1615406401,
      "upvotes": 1,
      "replies": {}
    },
    "gqerq4c": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqerq4c/",
      "text": "I would look into neurofeedback as a treatment for brain injury. It's considered quite effective for a variety of forms of trauma. Good luck!",
      "author": null,
      "created": 1615348314,
      "upvotes": -1,
      "replies": {}
    },
    "gqfgrf8": {
      "link": "/r/AskAcademia/comments/m1lumw/i_had_a_mild_brain_injury_during_my_phd_program/gqfgrf8/",
      "text": ">I just can't realistically push my brain and body for 50-60 hour weeks  to get through the application process and getting tenure.\n\nThe chances of a new PhD getting tenure these days are anyway almost indistinguishable from zero. If you want to push yourself and go for this then do it. There is still a chance of success. If you think it is too much for you and you having doubts if you want to do it then maybe it is not a good idea. The chances of success are maybe just too small.",
      "author": "CaptainCornerCamper",
      "created": 1615368402,
      "upvotes": 0,
      "replies": {}
    }
  }
}