{
  "sid": "oze54d",
  "link": "/r/AskAcademia/comments/oze54d/offers_to_collaborate_with_industry_during_phd/",
  "title:": "Offers to Collaborate with Industry During PhD",
  "text": "Hello r/AskAcademia,\n\nI was recently contacted by a few companies who want to hire me as an employee while I pursue my engineering PhD. They would sponsor my research and introduce a level of separation between my academic research and their R&D. \n\nMy PI/advisor has expressed that she is open to me working during my degree program, and this situation would allow me to focus solely on my research while providing each party with certain concessions (what is published, who owns IP, patenting, etc.)\n\nI spoke with a few professionals I know in the industry and they say I should go for it, with the caveat I have a larger discussion with my PI.\n\nCan any of you think of other considerations I might need to think of before proceeding with these?",
  "author": "CellGenesis",
  "created": 1628279473,
  "updated": 1634079990,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 1.0,
  "comments": {
    "h7zve4p": {
      "link": "/r/AskAcademia/comments/oze54d/offers_to_collaborate_with_industry_during_phd/h7zve4p/",
      "text": "I'm unclear what you mean by sponsor your research but also provide a level of separation between your research and their R&D. I'm not clear what's being separated or why. Why would a company sponsor a PhD and then not have it related to their work and why would you take on a separate research job that doesn't relate to your PhD?\n\nIn terms of considerations you need to have some kind of agreement in place between the university and the company covering IP ownership. You also need to discuss roles and responsibilities and expectations regarding hours, balancing competing interests, supervision etc. You also need to consider that you may not be able to publish if IP is involved - especially if they wish to take out a patent as publication will count as prior art. You may also need to sign an NDA and this may prevent you from presenting at conferences. However, most of this paragraph is dependent on what the relationship between your PhD and this job is.",
      "author": "ACatGod",
      "created": 1628292781,
      "upvotes": 7,
      "replies": {
        "h81o08l": {
          "link": "/r/AskAcademia/comments/oze54d/offers_to_collaborate_with_industry_during_phd/h81o08l/",
          "text": "Essentially they would pay me a salary as an employee and they would provide me funding for the work that I do for their R&D. They are looking to have me develop new technologies that they can add to their portfolio, but are less involved in patenting and owning how the new technology works with cells, tissues, etc.\n\nMy PI is more interested in my basic biological and chemical research which seems like it could be the work that is publishable and presentable in this scenario. It looks good for the company to have public information that demonstrates the feasibility  of the technology while having ownership of the hardware aspect of the platform.\n\nThese companies have also already been on a streak of working with labs in academia and sponsoring studrnts so they already have good contracts for dividing up responsibilities and ownership.\n\nThanks again for your response! I appreciate any and all help 😀",
          "author": "CellGenesis",
          "created": 1628336506,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h7zcxuh": {
      "link": "/r/AskAcademia/comments/oze54d/offers_to_collaborate_with_industry_during_phd/h7zcxuh/",
      "text": "What is your motivation for doing this. Is it to make industry connections, do you get more money? Your goals and benefits will help better determine if this is a worthwhile endevor",
      "author": "NeuroscienceNerd",
      "created": 1628284049,
      "upvotes": 6,
      "replies": {
        "h81ouhb": {
          "link": "/r/AskAcademia/comments/oze54d/offers_to_collaborate_with_industry_during_phd/h81ouhb/",
          "text": "My motivation is to get job experience with some of my favorite companies, make connections and learn really cutting edge techniques that would set me apart in the long run. I would be getting quite a good salary as well on top of my grant money. \n\nMy end goal would be to work with one of these companies upon graduation or try to spin out a startup (if possible). \n\nThese opportunities are incredibly rare and I think I'm being approached because of my multidisciplinary background. I think I've been insanely lucky to even be in this situation and I am grateful for the consideration.\n\nMy biggest concern is committing enough time to my PI. It seems like my thesis could be the sponsored work, with publications and presentations that are carefully crafted to not disclose certain information, and my other time could be spent on my PIs projects.\n\nThanks for any advice you might have!",
          "author": "CellGenesis",
          "created": 1628337109,
          "upvotes": 1,
          "replies": {
            "h81paxx": {
              "link": "/r/AskAcademia/comments/oze54d/offers_to_collaborate_with_industry_during_phd/h81paxx/",
              "text": "Excellent, sounds like a perfect opportunity then. I think the biggest thing to do is speak with your PI about what you need to graduate and ensure you can fulfill that with this position. And keep checking in to make sure you are on track.",
              "author": "NeuroscienceNerd",
              "created": 1628337435,
              "upvotes": 2,
              "replies": {
                "h838qxf": {
                  "link": "/r/AskAcademia/comments/oze54d/offers_to_collaborate_with_industry_during_phd/h838qxf/",
                  "text": "Thank you!! This is great to keep in mind going forward and I appreciate the feedback:)",
                  "author": "CellGenesis",
                  "created": 1628365411,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h80hp3y": {
      "link": "/r/AskAcademia/comments/oze54d/offers_to_collaborate_with_industry_during_phd/h80hp3y/",
      "text": "You should talk to whoever at your university handles conflicts of interest in research. Some universities would require a conflict management plan for this situation, or at minimum require some sort of disclosure to be on file.",
      "author": "Amaranthesque",
      "created": 1628304832,
      "upvotes": 3,
      "replies": {
        "h81p02j": {
          "link": "/r/AskAcademia/comments/oze54d/offers_to_collaborate_with_industry_during_phd/h81p02j/",
          "text": "This is top advice. That is really going to determine whether this will work or not. As soon as I get back on campus I'll start asking around. Thank you!",
          "author": "CellGenesis",
          "created": 1628337221,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h834dkv": {
      "link": "/r/AskAcademia/comments/oze54d/offers_to_collaborate_with_industry_during_phd/h834dkv/",
      "text": "The issue would be if folks start fighting over IP.  Then the lawsuits start flying...",
      "author": "DaisyBookrose",
      "created": 1628363307,
      "upvotes": 1,
      "replies": {}
    }
  }
}