{
  "sid": "qk62zv",
  "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/",
  "title:": "How soon to follow up after a non-urgent email to an old professor?",
  "text": "Context:\n\nI graduated 5 years ago (B.S. in Geography) and had originally planned on starting a Master's after a 2 year break of working and living abroad. Things changed and I'm still living in another country, but I'll be moving home within a couple years and plan to start my Master's by Fall 2024.\n\nI emailed my old professor, who likely would've been my advisor, two weeks back with an apology for not keeping in touch as intended, and a brief explanation on what I've done the past 5 years, and I also expressed that I'm considering returning for my Master's in a few years.\n\nThis was definitely a non-urgent email and I didn't expect to get a quick response, but I'm a little worried after 2 weeks that it'll get buried in the neverending flurry of emails that professor's receive, so how long should I wait before following up and more strongly indicating that I'd like to return and work with him? One of my biggest anxieties is coming across as annoying or pushy so I have a hard time gauging this sort of stuff.\n\nThanks everyone!",
  "author": "OtisVN",
  "created": 1635739755,
  "updated": 1635779275,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiv3ozz": {
      "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/hiv3ozz/",
      "text": "Two weeks is long enough, you can follow up now.",
      "author": "foibleShmoible",
      "created": 1635756198,
      "upvotes": 2,
      "replies": {
        "hiv5ind": {
          "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/hiv5ind/",
          "text": "Appreciate the reply, thank you!",
          "author": "OtisVN",
          "created": 1635758006,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiv4hdh": {
      "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/hiv4hdh/",
      "text": "Can you clarify what you asked from the professor? What kind of response are you expecting?",
      "author": "Enchiridion5",
      "created": 1635756976,
      "upvotes": 2,
      "replies": {
        "hiv5dhf": {
          "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/hiv5dhf/",
          "text": "I didn't ask anything directly, so I'm not expecting much more than him acknowledging my email and plans, and leaving the door open for further communication as we get closer to me putting application materials together down the line.",
          "author": "OtisVN",
          "created": 1635757863,
          "upvotes": 0,
          "replies": {
            "hiv8n1f": {
              "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/hiv8n1f/",
              "text": "To be honest, I would not expect him to respond to that e-mail. Professors are very busy and most only reply to e-mails if there is an action they need to take. I'd assume he read it, didn't feel a need to respond, and leave it at that. I'd not send a reminder, as there is a strong possibility that that will come across as you low-key accusing him of being rude for not responding to an e-mail that didn't really need a response. From your messages, I understand that that is not your intention, so I'd just leave it. \n\nI recommend contacting him again only when you're starting to put together your application materials.",
              "author": "Enchiridion5",
              "created": 1635760949,
              "upvotes": 6,
              "replies": {
                "hiva8d3": {
                  "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/hiva8d3/",
                  "text": "Fair enough, appreciate the reply!",
                  "author": "OtisVN",
                  "created": 1635762320,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "hiv8rgo": {
              "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/hiv8rgo/",
              "text": "How well did you know this professor?\n\nHow big were your class groups? Is there a reason you would stand out to them?\n\nWithout asking any direct questions, and if they can't clearly remember you from 5 years ago, the chances of you getting a response certainly drops off if they're not willing to write the \"Hi, sorry - I can't remember you so I'm not sure I can really offer any guidance\" email.\n\nI'll be honest, if a student from 5 years ago emailed me, then unless I was their dissertation supervisor or personal tutor, or they were particularly stand-out in the class, the odds of me remembering who they were, let alone their capabilities and performance are really pretty low.",
              "author": "OrbitalPete",
              "created": 1635761059,
              "upvotes": 3,
              "replies": {
                "hiva5bu": {
                  "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/hiva5bu/",
                  "text": "I know him rather well. Took several classes with him including one that had an overnight field trip, chatted in office hours often, communicated both before and after graduation about my long-term plans and my desire to study my Master's with him as my advisor. \n\nI suppose there's always a chance he's forgotten about me but that'd be surprising.",
                  "author": "OtisVN",
                  "created": 1635762250,
                  "upvotes": 1,
                  "replies": {
                    "hivabst": {
                      "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/hivabst/",
                      "text": "OK, in which case I see no benefit in writing a follow up. Simply wait until there is an actual action you want from them, and email again then.",
                      "author": "OrbitalPete",
                      "created": 1635762398,
                      "upvotes": 3,
                      "replies": {
                        "hivaklz": {
                          "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/hivaklz/",
                          "text": "Sounds good, thanks! That's what I'll do then. I think I'm just over-eager to get started on things when there's really no point yet.",
                          "author": "OtisVN",
                          "created": 1635762599,
                          "upvotes": 2,
                          "replies": {
                            "hivz4cq": {
                              "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/hivz4cq/",
                              "text": "I definitely get the enthusiasm! It's nice to share your excitement with someone who is familiar with the program. From what you write, I'm sure he'll be happy to see you again when you decide to apply. Good luck with the preparation!",
                              "author": "Enchiridion5",
                              "created": 1635777314,
                              "upvotes": 2,
                              "replies": {
                                "hivzafg": {
                                  "link": "/r/AskAcademia/comments/qk62zv/how_soon_to_follow_up_after_a_nonurgent_email_to/hivzafg/",
                                  "text": "Thank you! Cheers!",
                                  "author": "OtisVN",
                                  "created": 1635777390,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}