{
  "sid": "p4pl24",
  "link": "/r/AskAcademia/comments/p4pl24/is_research_really_for_me_if_i_dont_enjoy_the/",
  "title:": "Is research really for me if I don't enjoy the theory?",
  "text": "I am a Physics student and I will graduate with my BS+MS degree next year. I chose this subject as I genuinely liked it and wanted to go into research. I performed well in classes and enjoyed most stuff. As things started getting more theoretically heavy, I somehow lost the initial interest. I still worked hard and scored well in exams. I tried gaining some experience via internships. I realized in 2nd year that I don't have the aptitude for pure theoretical research. I enjoyed programming and explored robotics. I tried going for astronomy internships because I liked the subject. It was a way to combine both programming and physics as astro usually entails dealing with lots of data. I like it. I love working with data. I like implementing new things and playing around with data. I have recently realized I don't enjoy the theory though.\n\nI thought I should go for PhD after a break (due to family reasons) but now I'm having doubts. I hated my 4th year of college due to online classes. Didn't like most subjects. Didn't really put in the effort. Got decent grades but I feel like I learnt nothing. And this has been happening for a while. I have been studying because I am supposed to, not because I like it. I forget everything once exams are done. I know I don't necessarily want to stay in academia. I thought of taking industry roles or a scientific staff role after PhD, but I always wanted to pursue PhD. I was so sure. This feeling of doubt is very sudden and I'm not sure. \n\nWill I be able to do good in PhD if I don't necessarily like the theoretical aspects of the work? Yes, astro will have data but that's just a preliminary thing which I worked with in my internships. A PhD will require me to do everything for the project and I'm wondering if I'll be able to do it. I don't enjoy instrumentation or theoretical modelling at all. I feel like I ended up going down this path because of good marks and programming skills but I am not cut out for research. Any insight?",
  "author": "lostneedhelp7",
  "created": 1629015087,
  "updated": 1634079596,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "h90ms69": {
      "link": "/r/AskAcademia/comments/p4pl24/is_research_really_for_me_if_i_dont_enjoy_the/h90ms69/",
      "text": "If you don’t enjoy theory, instrumentation, or modelling then you are probably going to run into trouble doing a physics PhD (whether in astro or another subfield). The emphasis will vary depending on your project, but most physics research will involve some combination of most of these things plus data analysis. If you like programming and analyzing data then observational astronomy might be a good fit for you, but you’d still have to put up with learning a lot of theory. A PhD is a long slog so the more aspects of it you enjoy / tolerate, the better your experience will be. You might want to look at fields like data science instead of physics, or maybe an engineering field since you mentioned you liked robotics as well. For either of these fields you’ll need to do some research to see if a PhD would really be worth it, or if it would be better to apply for jobs instead.",
      "author": "CootaCoo",
      "created": 1629024333,
      "upvotes": 8,
      "replies": {
        "h90z1h6": {
          "link": "/r/AskAcademia/comments/p4pl24/is_research_really_for_me_if_i_dont_enjoy_the/h90z1h6/",
          "text": "Burnout can definitely make it harder to make decisions like this. I was pretty burnt out after I finished my bachelor’s degree and it took me a while to get back into the swing of things once I started my PhD. I enjoy what I do now but I was definitely feeling pretty demotivated and uninterested at first. Definitely take some time to recover if you can, and don’t feel like you need to rush this decision. Lots of people take some time to work or do other things before starting a PhD.",
          "author": "CootaCoo",
          "created": 1629032816,
          "upvotes": 3,
          "replies": {
            "h944kv9": {
              "link": "/r/AskAcademia/comments/p4pl24/is_research_really_for_me_if_i_dont_enjoy_the/h944kv9/",
              "text": "Thank you for your advice! That's what I have somehow decided. I know I'm going to take a break and not apply this cycle. I think I'll focus on finishing my projects and gain some clarity after trying to recover from this. The pandemic makes it harder, which is why I think taking time would be the best thing right now",
              "author": "lostneedhelp7",
              "created": 1629084854,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h90nngz": {
          "link": "/r/AskAcademia/comments/p4pl24/is_research_really_for_me_if_i_dont_enjoy_the/h90nngz/",
          "text": "Thank you for your response! I planned on going for observational astronomy. I sometimes feel like this sudden change in heart could also be due to the online classes this pandemic and the multiple projects I did over the summer. I feel almost burnt out. But it's true that I have been tolerating theory for the past 1-1.5 years and not really enjoying it. Just doing what needs to be done. It feels like this realization came pretty late when I'm already in my final year with research experience in astro but not much in other things. It feels scary to switch directions right now which is why I need clarity I think",
          "author": "lostneedhelp7",
          "created": 1629025048,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}