{
  "sid": "b97832",
  "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/",
  "title:": "How/When should I disclose my disability?",
  "text": "*Throwaway for reasons that are about to be pretty obvious*\n\n&#x200B;\n\n**TLDR: If you have schizophrenia or another highly-stigmatised condition, how do you manage to keep it private/secret while also getting accommodations that are actually useful for you in the workplace?**\n\n&#x200B;\n\nI was diagnosed with schizophrenia back in early 2014 and in a few months, I'll be starting my PhD (in a non-lab STEM field), supported by the Gates-Cambridge scholarship. I honestly never planned to get this far, and now I'm lost when it comes to navigating the whole disability thing.\n\n&#x200B;\n\nI did disclose my condition in my university application where they asked about disabilities, and I've submitted all of my paperwork to the disability office, but I'm not sure just how that information moves around. I know the department and college are informed (in case they need to offer e.g. access accommodations), but I don't know if they see the word \"schizophrenia\" or not. I don't know if my supervisor knows. I also have no idea if Gates knows about my condition.\n\n&#x200B;\n\nI can operate pretty normally 95+% of the time, it's just the occasional thing I need some flexibility on. Sharing an office with over 10 people won't be a good idea, for example. The intensive 4-day hiking and kayaking trip that the new Gates scholars have to do isn't going to be feasible either.\n\n&#x200B;\n\nSo I don't know how much people already know, or if I should disclose it, or who I should disclose it to.\n\n&#x200B;\n\nI asked my medical team but they just told me to ask the disability services at my current university. I asked disability services but they told me to ask my medical team. Basically, people with schizophrenia just drop out of university, so no one has any advice on how to manage this well. The disability accommodations you can get tend to be very limited and are really focussed on undergrad stuff like exams and note-taking, which I don't need or want. If I mention my condition, they just kinda look dumbfounded and then shove note-taking services in my face.",
  "author": null,
  "created": 1554345491,
  "updated": 1634081384,
  "over_18": false,
  "upvotes": 129,
  "upvote_ratio": 0.98,
  "comments": {
    "ek2ur53": {
      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek2ur53/",
      "text": "As someone who attended Cambridge as a postgraduate, I don't want to scare you or cause any undue stress, but... proceed with caution.\n\nIt is a world class institution in many ways, but also quite behind the times in others, particularly around issues relating to student wellness. (If you're expecting American-style student wellness infrastructure, you'll be sorely disappointed.) \n\nI would consult with your medical team again. (\"My university wasn't very helpful. I'd really appreciate some best practices if you have any.\") Maybe they could draw up a simple list of things they'd recommend (\"Quiet study space\") on doctor office letterhead and you can provide that to supervisors or whoever.\n\nAnd reach out to the disabilities office and ask them what specifically they will be able to offer you insofar as remedial assistance. Although I assume their help is pretty much restricted to extra exam time, note-taking assistance, and the like.\n\nThe people you'll be interacting with most will mean well. Cambridge is full of lovely people. But the infrastructure isn't always where you'd expect or hope it would be in terms of support. The concept of self-study sort of permeates everything: you're smart enough to get in, and they expect you to be smart enough to solve most your problems yourself (which obviously isn't feasible or realistic in every context).\n\nP.s. Which college? They each have varying levels of facilities -- with more or less space in the libraries depending on which you've landed in.",
      "author": "Impune",
      "created": 1554350670,
      "upvotes": 51,
      "replies": {
        "ek2vsj3": {
          "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek2vsj3/",
          "text": ">If you're expecting American-style student wellness infrastructure, you'll be sorely disappointed.\n\nNot American, but from what I've read, the systems at Cambridge are actually better than the ones I'm used to. But my supervisor is from the US and is very open about supporting students like myself, so I'm not too concerned that they'd react awfully. I definitely won't be leading any conversations with the schizo bombshell, though. I know to let people form their opinion of me first and *then* disclose the condition, and I waited 3 years to tell my undergrad supervisor. But I'm worried that there's no good guidance on how to disclose stuff beyond the ADHD/depression level, even from disability services or my mental health team. I'm just trying to figure it out for myself and hope I don't make a massive blunder along the way.\n\n>I would consult with your medical team again.\n\nI have asked them repeatedly, but it eventually got to the stage where they said that they had no idea how to manage it, and that they thought I should drop out and move into a group home. The stigma is exceptional for schizophrenia, and for some good reasons. They've never had a patient who's lived wholly independently. And I had to do quite a lot of shopping around before I settled on the team I have.\n\n>And reach out to the disabilities office and ask them what specifically they will be able to offer you insofar as remedial assistance.\n\nI'm not really sure how to go about this one, if you don't mind. I already contacted them and they already provided me with the list of possible accommodations, but none are appropriate. Basically, I just need the space to decompress and be alone for a few hours a day, but I'm not sure how that could be worded into a concrete accommodation. They can maybe give me something for an office (still unofficially), but that won't apply to these lengthy trips the Gates scholars take. \n\n>The concept of self-study sort of permeates everything: you're smart enough to get in, and they expect you to be smart enough to solve most your problems yourself\n\nOh, I'm fine for the learning aspect of things. I completed my degree in the normal timeframe and handed every assignment in on-time. I don't \"lead\" with my condition because I've honestly never needed to explain away any gaps or poor performances, and aside from the disclosure, I don't mention any kind of disability in any applications for anything. I figure things out for myself mostly, but I doubt I've ever met another person in my situation. There's loads of resources on how to manage depression and higher education, but really nothing for schizophrenia, and disability support workers will suggest things to people with depression, but they generally have no idea what to do for me. It'd be useful to know what accommodations have helped people with similar conditions. ",
          "author": null,
          "created": 1554351750,
          "upvotes": 13,
          "replies": {
            "ek3r1m4": {
              "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek3r1m4/",
              "text": "> They've never had a patient who's lived wholly independently. \n\nI have, you're not alone! I've also worked inpatient and seen plenty on the more serious side of things, but there definitely are folks with a schizophrenia diagnosis that can live independently, have jobs, and all the rest. \n\nIs it possible for you to find an additional talk therapist to speak with about coping skills and stress management? This is what I did for a few patients (clients, technically) who had these histories, and a weekly meeting can make a world of difference, even just to have another safety net if things start to be overwhelming. If you shop around and you can probably find someone who has experience working with bipolar, schizophrenia, or other dx's that require solid med management on top of talk therapy.\n\nI'm in the US and don't know as much about the UK and their services, but there must be a talk therapist (psychologist, psychotherapist, not sure their terms) out there that would be a good match.",
              "author": "arrrrr_won",
              "created": 1554389019,
              "upvotes": 7,
              "replies": {
                "ek5amyg": {
                  "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek5amyg/",
                  "text": "My medical team consists of a psychologist, psychiatrist, and GP. The psychologist is definitely the best when it comes to advice beyond medication, but he's still lost on this one. At the moment he just has me keeping a journal. He doesn't think it'll necessarily help, but it's something for me to do, and he doesn't know what else to suggest. \n\nA lot of the resources available are focussed on getting people minimum-wage, casual jobs and helping them to buy groceries. So it's really focussed on helping people survive, but not thrive. Once you're surviving okay, they just kinda abandon you to figure the rest out yourself. ",
                  "author": null,
                  "created": 1554428359,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "ek47a3s": {
              "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek47a3s/",
              "text": "[deleted]",
              "author": null,
              "created": 1554399787,
              "upvotes": 7,
              "replies": {
                "ek5c37s": {
                  "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek5c37s/",
                  "text": "Well, there was someone in recent history in the department who had a psychotic episode, became quite violent, and has since been diagnosed with schizophrenia. That was probably their first interaction with someone with schizophrenia, so I can understand why they might be apprehensive about anyone with the condition. If I disclose my condition openly, my name becomes attached to that other person and what they did. \n\nPeople who aren't properly in-touch with reality scare others. Even if we're not violent (which most aren't, even when threatened), it's an unknown that few people are trained to deal with. Most academics have absolutely no idea how they should behave if a student seems to be hallucinating. Any university website has *heaps* of resources explaining depression and anxiety and how to manage both, but disorders with psychosis rarely get more than a couple of sentences. And it's partly because a lot of people with those conditions do drop out and so the universities have never had to work around it. \n\nI think a lot of stigma is based on fear. I don't hate people for being afraid of me any more than I'd hate a dog that nips when it's cornered. ",
                  "author": null,
                  "created": 1554429540,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "ek3scnw": {
          "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek3scnw/",
          "text": "I hate to say but I agree. I’m autistic, another stigmatised condition, and the support I received during undergrad at Cam was really terrible. I’ve attended/worked at 4 universities since, in the U.K. and abroad, and I keep being surprised at the accommodations I get offered - Cambridge instilled in me a sense that I just wasn’t good enough and couldn’t keep up.\n\nOP, I disclosed my disability to the disability service but not to my supervisor or my group as I didn’t want to - but I know it is disclosed to the uni which means it’s on the record.",
          "author": "ayeayefitlike",
          "created": 1554389922,
          "upvotes": 7,
          "replies": {
            "ek6owlx": {
              "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek6owlx/",
              "text": "I've seen another autistic person who was an undergrad at Cambridge say that the disability services weren't very helpful in that regard too, I would've thought that russel group universities would do better. As an autistic student too I'm not sure if I would want to disclose, though I was told to for DSA purposes. ",
              "author": "femroot",
              "created": 1554481277,
              "upvotes": 2,
              "replies": {
                "ek6phw9": {
                  "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek6phw9/",
                  "text": ">  I would've thought that russel group universities would do better\n\nOh god no. I've attended two RG's, one ex-poly and a research intensive non-RG university, and whilst Cambridge was far and away the worst the ex-poly was the clear best and the other RG was a trailing 3rd. The RG are IME quite secure in their ability to attract students, so they don't bend over backwards for student welfare the way other universities do.\n\n>though I was told to for DSA purposes\n\nYeah, I disclosed to the disabilities centre for DSA support, but made it clear in person and writing that I didn't want any details of my disability past my accommodations to be disclosed further. Not had any problems with that.  ",
                  "author": "ayeayefitlike",
                  "created": 1554481681,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ek2sl5x": {
      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek2sl5x/",
      "text": "When I have a student who requires accommodation(s), I receive an email from the disability services office describing the accommodations necessary.  Causality is never mentioned, nor do I inquire.  \n\nI have had students who apparently needed accommodations without documentation.  I do my best to work with them within the classroom structure and the discretions allowed to me.  \n\nHave you tried having a heart-to-heart with the disability services personnel about what accommodations you feel would best serve you?  Our disabilities administrators are so large-hearted that I would have a hard time imagining someone in that position \\*not\\* trying to make it work; one way or another.  \n\nI hope you are able to find the solutions you need. ",
      "author": "GrandOpening",
      "created": 1554348574,
      "upvotes": 62,
      "replies": {
        "ek2u775": {
          "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek2u775/",
          "text": ">Have you tried having a heart-to-heart with the disability services personnel about what accommodations you feel would best serve you?\n\nI did ask my undergrad disability services group about accommodations, but they just had a set list of possible accommodations you could ask for, and if it wasn't on the list, you couldn't be granted it. I never had problems handing work in on time or keeping up with the lectures, so most of the available accommodations were just worthless. I did sit my exams in a separate room, but that's not really going to be applicable for a PhD in the UK, and doesn't really help me on a daily basis. \n\nSo I've mostly relied on informal understandings, like having a smaller office and pushing meetings into the afternoon. But asking for that kind of concession feels odd if they have no idea why you need it or how it could possible help you. \n\nI'm definitely not lazy and I don't use my condition as an excuse for anything. I manage it fine on my own, it just helps me to manage things if I have e.g. a quiet work environment. So if I'm doing a good job, no one can tell I have a disability and will think I'm getting unfair perks, and if I do a bad job, I'll fall into psychosis and be humiliated. ",
          "author": null,
          "created": 1554350109,
          "upvotes": 27,
          "replies": {
            "ek2uwtm": {
              "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek2uwtm/",
              "text": "The college I teach at has private study rooms available in the library.  I could imagine it wouldn't be difficult to set a regular time reservation for one - assuming your uni has some - for completing your PhD requirements.  \nJust a hopeful shot in the dark.",
              "author": "GrandOpening",
              "created": 1554350831,
              "upvotes": 15,
              "replies": {
                "ek2w5ps": {
                  "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek2w5ps/",
                  "text": "Thanks for the tip! I'll ask them about that. I'm sure Cam has heaps of spaces I could use, it's just about finding something that isn't 50 minutes away from the rest of my life. Because then it'd probably be better for me to just work in my room, since it's relatively close to my department. ",
                  "author": null,
                  "created": 1554352139,
                  "upvotes": 13,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ek391bv": {
      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek391bv/",
      "text": "In regards to the four day trip, find out who organizes it, email and say you have a medical condition that means its not feasible for you to do it, and you should get an idea of how to proceed. Try to write positively and say that if circumstances were different, etc, but being what they are it's not possible. Your issue is not visible so some people who are less educated/compassionate/aware might judge but it will not the first time that they've encountered this. How would someone with balance issues kayak or a mobility problems hike? \n\nYou're not novel in needing accommodations, it's just talking to the right person. Finding the right person could be a challenge, but it's doable. ",
      "author": "snackcakex07",
      "created": 1554370893,
      "upvotes": 17,
      "replies": {}
    },
    "ek384kx": {
      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek384kx/",
      "text": "I am not at Cambridge but in the ‘other place’ so it should be similar. In the Oxbridge system as a grad student you really have three levels you can go to for help:\n\n- University-level disability service : it seems you already asked them, but they should be your first try if not\n- College-level : I know my College has its own Disability Officer. They could also be the ones in charge of your accommodation for your first year, so you can ask them directly concerning this topic. Colleges are big and you can also try and see if you can get an office/some space with them to work quietly if your Department is unable to help\n- Department-level : depending on its size they may not have a Disability Officer but there is a few persons you can go first and talk in confidence before you talk to your supervisor (in my case it would be the graduate office)\n\nEven without disclosing anything you can just ask them first for some sign-posting on who to contact and they should be able to point you to the right person ",
      "author": "Shigaa",
      "created": 1554369339,
      "upvotes": 11,
      "replies": {}
    },
    "ek3avdg": {
      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek3avdg/",
      "text": "How much are you willing to reveal to your advisor? Honestly, it sounds like your disability accommodations are things that could fall well within needs for a variety of mental illnesses. Your need for a quiet office, meeting flexibility, and inability to go on a hike with 100 strangers could sound like accommodations for someone with anxiety/panic disorder to someone who doesn’t know your diagnosis, and, at least here in the US, anxiety is the most common mental health issue. Has your advisor spent any time in American academia recently? If so, there should be an awareness of accommodating students with mental illness as there has been a sharp increase in diagnosed college student mental illness in the US.\n\nIf you’re willing to at least tell your advisor you have “diagnosed mental health issues,” without giving your full diagnosis, you could then request something like, “Due to diagnosed mental health issues, I need a quiet place to work, experience an increased need for personal space, and may require flexibility in meeting times, with my preference being that most meetings are held in the afternoon, as this is when my health is at its best. I am also unable to attend the Gates hike, as four days of strenuous activity with strangers and no personal space will be very bad for my health.”\n\nOr, better yet, get your doctor to write that out. It sounds to me like you know what you need, you’re just nervous about asserting yourself to ask for it because you can’t offer a full explanation for fear of how it will be perceived. So yeah, if you’re willing to at least mention that it’s a mental health issue, you can word it in a vague enough way that they won’t know what it is, just that it is a diagnosed mental health condition.",
      "author": "lumabugg",
      "created": 1554373834,
      "upvotes": 11,
      "replies": {
        "ek3clco": {
          "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek3clco/",
          "text": ">How much are you willing to reveal to your advisor?\n\nI'm not sure yet. I'm leaning towards disclosing the condition, but I think I'd want to wait at least ~6 months to make sure. We'll see how a generic \"diagnosed mental health issues\" goes down first.",
          "author": null,
          "created": 1554376159,
          "upvotes": 4,
          "replies": {
            "ek3d5d1": {
              "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek3d5d1/",
              "text": "I think that’s a reasonable approach. Unfortunately, schizophrenia is still highly stigmatized, and like most mental illnesses, people don’t always realize that there are varying degrees of severity (like you said, your own health team wasn’t even sure how to handle someone capable of living independently). Once your supervisor gets to know you and sees you are capable of quality work, then you can explain your diagnosis more clearly. ",
              "author": "lumabugg",
              "created": 1554376837,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "ek323c4": {
      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek323c4/",
      "text": "If you’re comfortable sharing: what have you found helpful/needed?\n\nHigh functioning schizophrenics I infer are not often open about such things.\n\nI’m curious how one dies accommodate. And how general the accommodations might be to different persons.\n\ne.g. why is the 4-day hike an issue?  The busy office?",
      "author": "OphioukhosUnbound",
      "created": 1554359406,
      "upvotes": 8,
      "replies": {
        "ek33mvi": {
          "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek33mvi/",
          "text": ">If you’re comfortable sharing: what have you found helpful/needed?\n\nI've only ever needed flexibility, mostly with meeting times. I really need lots of sleep and sometimes it's hard to get to sleep early enough, so I try to keep my morning schedule clear. I do *insanely* better if I start at 10am instead of 9. But I never had much of a problem with that because I've never had a class with mandatory attendance, so I just didn't go to the few 8am lectures I had. \n\nSitting exams in a separate room helped too, I think, but I did that from my first semester, so I have nothing to compare it to. \n\n>High functioning schizophrenics I infer are not often open about such things.\n\nWell, my diagnosis isn't public, so I imagine others are private with things too. Not even my parents know, because I was just over 18 when officially diagnosed. They just think that I used to have depression but that I'm over it now.\n\n>why is the 4-day hike an issue?\n\nIt's 4 days in a country I've never been to before, far away from any space I might call my own, with 100 people I've never met, spending all of our waking and sleeping hours together, doing challenging and somewhat confronting tasks. \n\nI'll be socially fatigued within an hour and I'll be desperate to leave by the 4th hour. If I'm fatigued and stressed and anxious, I'll get ill. This isn't a problem for things like conferences because I can just take a few minutes alone to chill, but there's nowhere to retreat to when you're climbing up a cliff face. Otherwise I need to be constantly plied with coffee to keep my energy up, which isn't good in general, and also isn't possible on a cliff face. \n\n>The busy office?\n\n10 people tend to make a lot of noise even when they're working quietly. It's hard enough to focus as it is. I can manage the occasional disruption, but when you share an office with 10 people, it's constant and I can't do any work.",
          "author": null,
          "created": 1554361691,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "ek39yct": {
      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek39yct/",
      "text": "Hey OP! I worked under the disability services coordinator at my college and have schizoaffective bipolar I.\n\nSome colleges will want to see an IEP, if you have one from your high school days. You will need documentation of your condition also.\n\nAs for what to ask for- in a college setting, I’ve known that adjusted attendance expectations was an accommodation that we could offer, so that a person could take mental health days or whatever they needed. If you’re an American, you would be covered by the ADA and you may be able to request a certain block of time off on a weekday to accommodate therapy and doctor’s appointments. Of course, “reasonable accommodations” is the buzzword and you’ll probably have to do some tap dancing to get to a compromise.\n\nHonestly, you may benefit from meeting with a psychologist and discussing what supports they have recommended to patients in the past with your disability.\n\nI hope that helps!",
      "author": "psychic_mudkip",
      "created": 1554372402,
      "upvotes": 7,
      "replies": {
        "ek3ctc5": {
          "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek3ctc5/",
          "text": "I'm not entering undergrad, I've already graduated with my degree. I'm starting a PhD at Cambridge",
          "author": null,
          "created": 1554376431,
          "upvotes": 2,
          "replies": {
            "ek3cxzg": {
              "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek3cxzg/",
              "text": "The ADA accommodations would apply as long as you are in the United States, whether it’s work or school.\n\nI’m unfamiliar with the conventions in the UK. I would think they would have a similar process, but that could be ignorance talking.",
              "author": "psychic_mudkip",
              "created": 1554376590,
              "upvotes": 1,
              "replies": {
                "ek3d4eb": {
                  "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek3d4eb/",
                  "text": "I'm not in the US, but it doesn't really matter anyway. The laws in my home country won't apply in the UK, and my accommodations from undergrad are worthless because they're based on the idea of having actual classes, which I won't have anymore. ",
                  "author": null,
                  "created": 1554376806,
                  "upvotes": 1,
                  "replies": {
                    "ek3fsyb": {
                      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek3fsyb/",
                      "text": "You should still be able to ask for things like flexible deadlines for thesis things, and things like that. I don’t know if they will give it to you, but yeah.",
                      "author": "psychic_mudkip",
                      "created": 1554379754,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ek39ym8": {
          "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek39ym8/",
          "text": "Is this a... what day is this?",
          "author": "BigLebowskiBot",
          "created": 1554372413,
          "upvotes": -5,
          "replies": {}
        }
      }
    },
    "ek37wpk": {
      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek37wpk/",
      "text": "Hi \n\nWhere I teach, we receive forms from the disability office with the students accommodations listed, not the actual disability.  Could you start by having someone on your medical team, such as a psychiatrist or psychologist write a list of accommodations that you may require, such as extra testing time in a quite testing area, 1-2 days extra for out of class assignments, preferential seating -meaning your seated close to the front to avoid distraction and optimize hearing the lecture, use of a tape recorder vs. taking notes.   Often these accommodations are ones that most students have when they transition from high school; however, if you are newly diagnosed it would not be out of the blue to request them from whoever diagnosed you so that you can be successful in academia.  Best of luck to you!",
      "author": "ma-ccc-slp",
      "created": 1554368962,
      "upvotes": 2,
      "replies": {
        "ek38r96": {
          "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek38r96/",
          "text": "I've already finished undergrad, and now I'm going into a PhD that has no classes. None of the accommodations you listed would really apply to me, or at least, there's no way for me to utilise them without lectures, assignments, or exams. \n\nThat's the problem: the only accommodations available are ones that apply to classes, which I've never really needed help with. I supplied copies of my old accommodation sheets for reference, but again, none of it would be applicable anymore. So I have to organise these informal accommodations within my department and college, but that means disclosing my condition to people who otherwise might not know (e.g. my supervisor). ",
          "author": null,
          "created": 1554370424,
          "upvotes": 6,
          "replies": {
            "ek6qagu": {
              "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek6qagu/",
              "text": "Just want to jump in on this comment so you see my reply, OP. \n\nAsk the DRC for a new needs assessment: it sounds like your old accommodations won't apply in the new setting (ie a PhD) so get them to sit and do a needs assessment with you. All the things you need to function should then come out, and they can extract the accommodations they can request from that assessment.\n\nAs you have a disorder that isn't so common in HE, and you know yourself and your condition well, this is a straightforward way of getting this done. Take any written support from your medical team that will help back up your requests as well. ",
              "author": "ayeayefitlike",
              "created": 1554482223,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ek3gbqe": {
      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek3gbqe/",
      "text": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/antipsychiatry] [How\\/When should I disclose my disability?](https://www.reddit.com/r/Antipsychiatry/comments/b9bydf/howwhen_should_i_disclose_my_disability/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
      "author": "TotesMessenger",
      "created": 1554380274,
      "upvotes": 1,
      "replies": {}
    },
    "ek3szmi": {
      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek3szmi/",
      "text": "Thanks for sharing. It's given me some encouragement to disclose on apps. I'd say you can certainly put something more general on your app. Doctors have written notes that really don't give much details. I'd say maybe focus on the issues regarding your accommodation. Something to justify that isolation and too much socialization are harmful for your condition. I was diagnosed as bipolar so sometimes i say i have a mood disorder instead.\n\n&#x200B;\n\n\\> I asked my medical team but they just told me to ask the disability services at my current university. I asked disability services but they told me to ask my medical team. Basically, people with schizophrenia just drop out of university, so no one has any advice on how to manage this well.  \n\n&#x200B;\n\nSuch is life, sorry. Professionals don't know the rules and it seems like a unique situation to them. It's a learning curve for both of you.",
      "author": "somegenerichandle",
      "created": 1554390370,
      "upvotes": 1,
      "replies": {}
    },
    "ek3x16v": {
      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek3x16v/",
      "text": "Fast note:  Advice here is assuming protections against discrimination due to disability.  \n\nThis seems like something you may want to let your supervisor know about before you start so it is not a surprise.  Assuming you have protection from discrimination and the right to reasonable accommodations I would lay out your condition and how it affects you.  Also ask about the accommodations you think you will need.  \n\nFor new teachers, I would let them know the first day of class.  If you may need accommodations they will be informed from the school, so it is best to just give them a fast heads up on what is going on with you and what you may need.\n\nYou will get stuck doing a lot informing on schizophrenia, and the differences between treated and untreated schizophrenia, so few people realize that it can be controlled reasonably well with medication.  \n\nFor what it is worth I did this for my issues, bipolar disorder with chronic fatigue and it worked out very well.  Everyone was very accommodating despite the fact I did not have full documentation.  I am an education student though, and every student was required to take a class about accommodations and the history of the Americans with Disability Act, so my experience may have been skewed.",
      "author": "engelthefallen",
      "created": 1554393086,
      "upvotes": 1,
      "replies": {}
    },
    "ek51827": {
      "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek51827/",
      "text": "OK, maybe something I know about, although not at Cambridge and not schizo. I am not sure what the UK version of the ADA is, but it might be worth reading up on the limitations and rights assured by whatever that is.\n\n&#x200B;\n\nYou know what you need (quiet time and space), and with a good conversational partner who understands the academic setting you'll be in, I think you can figure out who needs to know what and what kinds of \"official accommodations\" you may want to ask for. For me, because my disability office is great, this meant that I set up a face to face appt when I arrived on campus, told them what kinds of accomodations I was looking for (extended time on exams, someone to vouch for me if I have an episode and need an extension, etc.) and they told me how they could make that work. Now, I rarely take a class with exams anymore, so I now ignore the accomodations letter email every semester. For you, that might look like talking through your class schedule, any required long periods in class/group work, asking what happens if you need an extension, and figuring out things like trips, lab meetings, office settings, etc. Figure out from someone what problems will likely arise, make plans for those things, and then lay the groundwork to have institutional support if you need unexpected help. Your disability office should not be disclosing anything (nor is admissions except maybe to your adviser, but even that I doubt) without your consent. A face to face meeting should hopefully make your options and plans clearer--and you should run the show. Demand access to your education. If it's like the ADA, they're required to provide it if they can. They may also be able to help you get tech like noise canceling headphones, for example. \n\n&#x200B;\n\nAnother office to look for (and maybe to have this conversation with, if your disability services office sucks) is the ombuds office. They're confidential and trained in conflict management and are also very looped into all the kinds of services available on a campus. \n\n&#x200B;\n\nI noticed that you are having issues with all the accommodations being about coursework. Does a PhD in Cambridge really have no classes? No qualifying exams? Weird place. Anyway, just because the system is set up more for undergrads, and they have more formulaic ways of doing it, doesn't mean those are the only accomodations available. I've gotten a whiteboard instead of a blackboard due to chronic pain. I have a friend who was allowed to listen to music while prepping for an oral exam. I got an extension on a final project when it caused me distress. If you know what is helpful to you in the scenarios you're likely to find, you should have legal standing to push for the things that you need as long as they are reasonable. You seem to know what you need, and that is the hardest part for most people.\n\n&#x200B;",
      "author": "jenesaisquoi",
      "created": 1554420802,
      "upvotes": 1,
      "replies": {
        "ek6qflr": {
          "link": "/r/AskAcademia/comments/b97832/howwhen_should_i_disclose_my_disability/ek6qflr/",
          "text": "> Does a PhD in Cambridge really have no classes? No qualifying exams? Weird place.\n\nThis is standard for the UK - research degrees don't have classes, they are pure research.",
          "author": "ayeayefitlike",
          "created": 1554482321,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}