{
  "sid": "r01ey6",
  "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/",
  "title:": "How do you find people to talk to about your subfield?",
  "text": "I'm in my fifth year of my Ph.D. I know OF a lot of people in my field, but there aren't really conferences for my specific subfield. I don't know how to talk to them in a way that feels normal. Do other people find this frustrating? \n\nI'm at the point where I want to build a new social media platform for academia to find ppl based on my endnote library lol",
  "author": "dancedance__",
  "created": 1637630775,
  "updated": 1639843188,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hlpphay": {
      "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hlpphay/",
      "text": "This is how new conferences start. Reach out to paper authors in your sub field and see if you can pull a little symposium together",
      "author": "Sad-Dot9620",
      "created": 1637631035,
      "upvotes": 9,
      "replies": {}
    },
    "hlpzvwl": {
      "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hlpzvwl/",
      "text": "In my field, it's how a new section at an existing conference starts.",
      "author": "CruxAveSpesUnica",
      "created": 1637635882,
      "upvotes": 5,
      "replies": {}
    },
    "hlrf14f": {
      "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hlrf14f/",
      "text": "Cold emailing for a quick zoom chat costs almost nothing, and academics generally LOVE any attention to our respective work. \n\nTo argue the other side though, I would like to see more interdisciplinary points of connection. My PhD is in education, and I recently spent some years with engineers. I learned loads of things, and I was also struck by what was obvious in my field but not in theirs. Seems academia needs more of that and less of folks thinking their phd in X makes them qualified for ABCDEF, and G.",
      "author": "octaviousearl",
      "created": 1637671259,
      "upvotes": 2,
      "replies": {
        "hlrujce": {
          "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hlrujce/",
          "text": "Yessss! I love the idea of being able to visualize all the people I’m vaguely related to. My field is very interdisciplinary and I’ve gone down rabbit holes to a ton of different sub fields and I’d love to be able to casually chat about ideas to ppl in them",
          "author": "dancedance__",
          "created": 1637679236,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlrlxcy": {
      "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hlrlxcy/",
      "text": "Umm my field has a twitter hashtag and I totally interact with people on there.",
      "author": "maps1122",
      "created": 1637675143,
      "upvotes": 1,
      "replies": {
        "hlrorat": {
          "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hlrorat/",
          "text": "Have you met grad students from labs you don’t know that way?",
          "author": "dancedance__",
          "created": 1637676579,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hm0ss3q": {
      "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hm0ss3q/",
      "text": "Not sure if this is exactly what you're looking for, but here's the standard advice that I give PhD students and early career researchers (which is basically a version of what someone told me shortly after I finished my PhD, and which I have found useful):\n\n1) Use google to find the university profile pages of people working in your subfield(s). \n\n2)  Study their profiles carefully. *Where* are they publishing? *Who* are they collaborating with (if relevant)? *Which* conferences are they presenting at? \n\n3) Look for patterns in the profiles of others. It may turn out that there are certain conferences where your subfield is well represented but not always in a way that's super visible to newbies or outsiders, for instance. This could help you to plot upcoming conferences where you are most likely to come into contact with those whose interests are similar to your own. Alternatively, this kind of research may help you to identify the best journals for submitting your own future work.\n\n4) If you (and they) have Twitter accounts or similar, follow people working in your subfield(s) there. There may be opportunities for low-stakes online interactions on social media that can help grease the wheels for more natural in-person conversations when you intersect in real life.",
      "author": "LookingOutFromDia",
      "created": 1637837540,
      "upvotes": 1,
      "replies": {}
    }
  }
}