{
  "sid": "or4y5r",
  "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/",
  "title:": "two job offers - would taking the lower rank hurt me?",
  "text": "I have two offers and need help…\n\nOffer #1 - Lecturer at the same R1 where I got\nMy PhD. More money. May not be renewable next year.\n\nOffer #2 - Teaching Asst Prof (TAP) at an R2. 1 hour-long commute. Very likely renewable. \n\nIf my eventual goal is to be a TAP (or Professor of the Practice), would taking the Lecturer position be a bad move for my career?\n\nIt seems like Offer #1 is better for my family.",
  "author": "nononsensecatlady",
  "created": 1627187286,
  "updated": 1634082442,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "h6fz9og": {
      "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6fz9og/",
      "text": "[deleted]",
      "author": null,
      "created": 1627189121,
      "upvotes": 8,
      "replies": {
        "h6gxcv2": {
          "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6gxcv2/",
          "text": "My husband has a very secure job and we’re good financially so I think we’d be okay. We want more kids and fixing to buy a house so I would go back on the job market again next year to be safe.",
          "author": "nononsensecatlady",
          "created": 1627218079,
          "upvotes": 2,
          "replies": {
            "h6hiw4l": {
              "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6hiw4l/",
              "text": "[deleted]",
              "author": null,
              "created": 1627229746,
              "upvotes": 2,
              "replies": {
                "h6hjyi7": {
                  "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6hjyi7/",
                  "text": "The R1 is better location for us. The R2 is the worst location because it’s an hour away from where we want to be.",
                  "author": "nononsensecatlady",
                  "created": 1627230262,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h6g2x02": {
      "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6g2x02/",
      "text": "It’s a toss-up. TAP is better, but the institution is lower-level and the circumstances are not as good for you. If the TAP position were long-term, I think you would have a harder decision.",
      "author": "bigrottentuna",
      "created": 1627191838,
      "upvotes": 4,
      "replies": {
        "h6gxl69": {
          "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6gxl69/",
          "text": "The TAP is informally long term. They are fixed term contracts but it’s very rare they don’t get renewed. That’s why I’m stuck! 😩",
          "author": "nononsensecatlady",
          "created": 1627218227,
          "upvotes": 2,
          "replies": {
            "h6gzxrb": {
              "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6gzxrb/",
              "text": "I see. That's a tough decision, especially if your husband's position isn't mobile.\n\nHave you tried negotiating with Institution 1 for more assurances? Ask them to be honest about the prospects. In my experience, even if they can't make any commitments, Chairs have a pretty good idea about what kind of lecturer pool they need to teach the curriculum.",
              "author": "bigrottentuna",
              "created": 1627219715,
              "upvotes": 4,
              "replies": {
                "h6hfoj3": {
                  "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6hfoj3/",
                  "text": "No, I haven’t. Not sure how. I know them very well since I did my degree there and I don’t think they want to make me promises because they like me. I’m going to reach out to other lecturers there.",
                  "author": "nononsensecatlady",
                  "created": 1627228185,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h6gabij": {
      "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6gabij/",
      "text": "What field?",
      "author": "TrashyCereal1",
      "created": 1627197992,
      "upvotes": 2,
      "replies": {
        "h6gxhnb": {
          "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6gxhnb/",
          "text": "Math 🥸",
          "author": "nononsensecatlady",
          "created": 1627218165,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h6h5qev": {
      "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6h5qev/",
      "text": "Is the 1 hour away place a place you and your family would consider moving to? I’ve been commuting an hour each way for my teaching job and it’s no picnic. \n\nIf you were able to get two job offers with no experience, maybe you’re likely to get a decent offer if you don’t get renewed at option 1.",
      "author": "schwza",
      "created": 1627223020,
      "upvotes": 2,
      "replies": {
        "h6hcjxr": {
          "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6hcjxr/",
          "text": "No, the hour commute is non negotiable so that we are still close to family. I have two years experience as an assistant professor elsewhere, but we’re moving because we’re far from family now.\n\nEdit: my two years experience is at a small private teaching college.",
          "author": "nononsensecatlady",
          "created": 1627226604,
          "upvotes": 3,
          "replies": {
            "h6hokr6": {
              "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6hokr6/",
              "text": "Hmm, this seems close. Suppose you took option 1 and did not get renewed after a year and you could not find another academic position. Is your next best option (private sector, teach high school, etc.) a decent option, horrible, or somewhere in between? If non-academia is decent, I'd take option 1. If it's horrible, I'd take option 2.\n\nAlso, is there someone you could talk to at option 1? Sometimes schools hire someone to work for a year or two while there are a lot of sabbaticals, and sometimes they want someone longer term (even if the contract is for one year). No one will give you a guarantee but they may be able to give you their impression.",
              "author": "schwza",
              "created": 1627232490,
              "upvotes": 1,
              "replies": {
                "h6hq651": {
                  "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6hq651/",
                  "text": "Option 1 is close to an area with lots of jobs and schools. My background is pure math, though, so if I want industry then I need to do more training in programming probably.\n\nThe problem with option 1 is I know them well so my contact doesn’t want to make promises. Not sure what sort of info I would get from someone else, but I do have lots of people I could email since I know a lot of faculty there.\n\nThe contact I have been talking to wasn’t very confident in renewal. But I’m not sure if she was like that because it’s likely a no or she’s being careful because she knows me.",
                  "author": "nononsensecatlady",
                  "created": 1627233261,
                  "upvotes": 1,
                  "replies": {
                    "h6hz3b6": {
                      "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6hz3b6/",
                      "text": "I'm risk averse I guess, but I would take option 2. You can keep applying for jobs every year to try to find a TAP job in the location of option 1. Hopefully you would find a great job in a great location next year, but either way you have a very good chance of doing your entire career in academia at option 2. \n\nIf you do option 1 you'll probably be able to keep finding jobs in the city you want to be in, but there's a risk that you won't and that you'll have to leave academia.",
                      "author": "schwza",
                      "created": 1627237539,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h6fwwvq": {
      "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6fwwvq/",
      "text": "TAP and lecturer are pretty equivalent ranks everywhere I’ve seen? \n\nThe only issue would be long term stability of the position, but that’s a different thing to consider.",
      "author": "Eigengrad",
      "created": 1627187479,
      "upvotes": 3,
      "replies": {
        "h6fxlqv": {
          "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6fxlqv/",
          "text": "My understanding is that TAPs have required service (advising, curriculum design, sometimes education research, etc) to the department and are usually more stable positions.",
          "author": "nononsensecatlady",
          "created": 1627187955,
          "upvotes": 1,
          "replies": {
            "h6g5kps": {
              "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6g5kps/",
              "text": "This depends a lot on the institution, from my experience.\n\nAt my current school, Instructor would be the higher rank out of the two and indicates a permanent non-TT hire.\n\nBut yeah, sounds like based on the job descriptions the TAP would be a better step towards a TT position. But only if the other responsibilities don’t cut down on your research.",
              "author": "Eigengrad",
              "created": 1627193980,
              "upvotes": 2,
              "replies": {
                "h6gxh02": {
                  "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6gxh02/",
                  "text": "I don’t want a TT research position. I want a TAP which is a teaching position with education related research, activities, and service! TAPs are never TT.",
                  "author": "nononsensecatlady",
                  "created": 1627218153,
                  "upvotes": 3,
                  "replies": {
                    "h6gzg1i": {
                      "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6gzg1i/",
                      "text": "At my institution, TAPs are as you describe and can receive something that is functionally equivalent to tenure.",
                      "author": "bigrottentuna",
                      "created": 1627219405,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h6kt0td": {
      "link": "/r/AskAcademia/comments/or4y5r/two_job_offers_would_taking_the_lower_rank_hurt_me/h6kt0td/",
      "text": "The first seems like the better job. Find out how that institution uses permanent NTT teaching faculty. If they do a serious job with it (some job security, competitive salary, responsibility for curriculum), then find out whether this Lecturer position has any likelihood of becoming a TAP (perhaps by a different name) or would make you competitive for such a position covering different courses.",
      "author": "IkeRoberts",
      "created": 1627300957,
      "upvotes": 1,
      "replies": {}
    }
  }
}