{
  "sid": "q3kd8n",
  "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/",
  "title:": "I gave an interview about a paper I have not first authored",
  "text": "Hello fellow redditors. \n\nDON'T USE THIS INFORMATION ANYWHERE\n\nNon-native here\nSo here is the situation: I am in the last year of my PhD in a European country, and up until now my supervisor has been mostly a excellent person and professional.\n\nLast year some of my lab colleges started preparing a paper about a topic that would greatly benefit my homecountry. I helped them very little, because it wasn't a part of my PhD. In spite of that, and without me asking whatsoever, my supervisor decided that she would put my name in the paper as one of the authors (3rd author).\nI proposed to my supervisor that I could write a small press release to homecountry media, so that the information is more reachable to the public in there. I sent the press release to the media and also to a academic news journal. When it was released, I sent the link to my supervisor which seemed happy. \n\nWell, after that happen, a journalist contacted me to know more about the article. She called and we talked for nearly 25mn about that research, my thesis, and personal insights. Please note that when asked about the research paper I would always talk using impersonal terms, in plural and referring the team. We ended the conversation with her saying that she would later send me an email asking for more info. \n\nSo you can imagine my suprise when, I see a  news article about that same interview. When I opened the article I saw that she wrote as if I was the main author or the leader of the research. This news article went \"viral\" and in just a couple days important journals from both my home country and the country I live in, started replicating the news, some of them even using photos of me that were in the website of my university. The news did not mention my supervisors or any of my collegues names, the name of the involved institutions or the sponsors, which I was planning to send to the journalist at the complementary email she would send me to ask me for more info. \nPeople from my research group called me absolutely outraged, saying how could I have done that and put myself as a protagonist of a paper in which they let me in \"as a favor\", and that I was not even truly a researcher because didn't yet have my doctorate. I desperately tried to explaining to them that:\n- I never said to the journalist that I was leading the investigation ot that I was the main author;\n- According to the conversation and emails exchanged with the journalist, the interview wasn't over, as she was supposed to contact me later to ask for more info. \n\nI immediately called the journalist that admitted that she thought that she had enough information and just assumed that, as the research was about my home country and I was the one writing the press release, I was the main author of the research paper. \nI also sent to my supervisors the copy of all the emails I exchanged with the journalist. The editor of the news agency and the journalist sent an email to my supervisors apologizing and proposing that they could make another news article interviewing my suppervisor  in which she could go more in depth about the group projects, objectives and the work developed up until now. \nI also sent a long and detailed apology email explaining everything. \nMy supervisor, however, responded to the email basically saying \"shut up, we don't care and don't wanna hear anything you have to say\" (not with this exact words, obviously). She thinks that I did this deliberately and that I intentionally omitted information so I can be the protagonist of the news. \nWas I really that bad in this situation? Was I an AH for agreeing to give the interview at the first place?\n\nETA: The journalist email me and asked if I could give her my phone number so she could speak with me. She then called me and started to ask about the research paper, and I naively just kept answering and talking. She than asked me about my life, how I grew up, my experiences and the theme of my thesis. I ended up talking much more about this last subjects than the paper. At the end she told me that she would call me again about that. One month passed and she didn't, I email her and asked her if she still intended to know more about the research. She assured me that she would contact again. She didn't.\nMy intention was to, after talking more with her and understanding what she really wanted to focused on, to forward her to my supervisor and team leader, but I never got the chance. \nWhen the news came, it was something along the line: poor girl from country X makes it life and leads a research that will help her country.\nI email the journalist and she and her editor profusely apologized and offered to do another news piece in which they would interview the team leader. Team leader declined. I email the all team explaining the situation, even shared the emails I exchanged with the journalist, and apologized. Team leader responded saying that she believes I did it intentionally and she does not want anyone to respond my email or discussing this issue with me. \n\nThank you for your comments, I understand I was in the wrong here and this will be a lesson I'll carry all my life",
  "author": "Anysessoh",
  "created": 1633645904,
  "updated": 1634078604,
  "over_18": false,
  "upvotes": 43,
  "upvote_ratio": 0.93,
  "comments": {
    "hftnfg8": {
      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hftnfg8/",
      "text": "Just as a general rule of thumb, if you're explaining collaborative work in any professional settings, mention the other authors and your role. It honestly seems odd you got through a whole interview without mentioning it and that might be why they think it was intentional.",
      "author": "mediocre-spice",
      "created": 1633672059,
      "upvotes": 35,
      "replies": {}
    },
    "hfuumty": {
      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfuumty/",
      "text": "> DON'T USE THIS INFORMATION ANYWHERE\n\nYou're posting a detailed account on a global public forum but want to stop others from referring to it? That's ridiculous. \n\nFigure out what you want and act accordingly. Including *not* posting sometimes.",
      "author": "iugameprof",
      "created": 1633702673,
      "upvotes": 12,
      "replies": {
        "hfwea95": {
          "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfwea95/",
          "text": "I am glad I posted it here. I might take the post out later. But I've received great advice and was nice to hear different points of views. Cheers",
          "author": "Anysessoh",
          "created": 1633725963,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfsdipa": {
      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfsdipa/",
      "text": "As a minimally contributing author on the paper, you should have not have given an interview without inviting your coauthors (or at least the 1st author) to join you.\n\nAs a student, you should not have given an interview on your work without telling your supervisor.\n\nAs someone who seems interested in having your work in the press, you should know that it's incumbent upon you to make sure you proactively give the journalist everything you want to appear in the article.\n\nYes, the journalist and outlet fucked up by clearly not reading the article, but many mistakes were made by you before it ever got to that point, even if they're not what you're being accused of by your colleagues.",
      "author": "MidnightSlinks",
      "created": 1633647446,
      "upvotes": 81,
      "replies": {
        "hfse7gd": {
          "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfse7gd/",
          "text": "Thanks for the honesty. I am feeling so so bad over this, and very stressed out. Probably my relationship with both my suppervisor and my team will never be the same again. Living and learning...",
          "author": "Anysessoh",
          "created": 1633647780,
          "upvotes": 17,
          "replies": {
            "hfubqql": {
              "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfubqql/",
              "text": "I have been in the mainstream news a couple of times, and exactly all of those instances contained serious factual errors. Their job isn't to be correct. Their job is to spew out texts at a pace most academics would find insane.\n\nJust write a message to all involved and explain that you didn't misrepresent yourself and that what followed should be chalked up as \"shit happens\".",
              "author": "molobodd",
              "created": 1633692529,
              "upvotes": 13,
              "replies": {}
            },
            "hfu0lcx": {
              "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfu0lcx/",
              "text": "Seems like an over reaction to me. Sit and talk with them, they should hopefully understand. You could ask the journo for a correction though likely they’ll ignore that. But send an email to the journo and your supervisor so they can see you are trying to make amends.\n\nEdit: something similar happened to me once, minor author on a big paper. Colleagues not even involved were sticking their hands up for interviews about the research because ‘media’. Helps with promotion and stuff here. Stupid if you ask me. I hate media",
              "author": "drmickmorrison",
              "created": 1633683217,
              "upvotes": 12,
              "replies": {}
            }
          }
        },
        "hfw5gwd": {
          "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfw5gwd/",
          "text": "I've given many interviews and not once, ever, more than one person was interviewed at the same time. Interviews are usually over the phone, now likely on Zoom/Teams, and it's always a personal thing. If the journalist wants to talk to more than one author, they always call them separately.",
          "author": "WhoMeNoMe",
          "created": 1633722288,
          "upvotes": 3,
          "replies": {
            "hfwhgyh": {
              "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfwhgyh/",
              "text": "And I've only ever done joint interviews. The point isn't that they should have been physically in the same interview with OP but that they should have been looped in by OP given OP's position as basically non contributing to the article.",
              "author": "MidnightSlinks",
              "created": 1633727313,
              "upvotes": 1,
              "replies": {
                "hfyemmw": {
                  "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfyemmw/",
                  "text": "I think you and OP's supervisor are overreacting. OP is a PhD student who could never know that journalists often get these things wrong. It seems the paper only had any visibility because of OP's links with his own country. If it wasn't for him, paper would have never gone viral. If that paper is that important to their outputs, they should have been doing the press release from the get go, and they should have been asking OP to contact media in his country. And I can even understand their frustration but not their irritation. They are being petty and immature.",
                  "author": "WhoMeNoMe",
                  "created": 1633763547,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hfub72t": {
          "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfub72t/",
          "text": "Totally disagree. If OP is native to the country in question, it isn't unreasonable for a journalist to reach out, and is definitely not unreasonable to comply.",
          "author": "molobodd",
          "created": 1633692146,
          "upvotes": 8,
          "replies": {
            "hfud6z9": {
              "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfud6z9/",
              "text": "I never said OP shouldn't have done the interview. Just that their co authors, including their PI/boss, should have been invited to join or at least informed and mentioned by OP by name in the interview.",
              "author": "MidnightSlinks",
              "created": 1633693494,
              "upvotes": 9,
              "replies": {}
            },
            "hfuflew": {
              "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfuflew/",
              "text": "The unreasonable part is not mentioning it to collaborators/main authors and not mentioning to the journalist who the main authors was and that op's own contribution was small",
              "author": "mediocre-spice",
              "created": 1633695014,
              "upvotes": 6,
              "replies": {
                "hfuh3nr": {
                  "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfuh3nr/",
                  "text": "Non-academics don't understand first- last authorship. OP is just a source. The journalist didn't care. Their readers don't care. I assume the topic was the content, not who did what, i.e. the stuff that matter in academia only.",
                  "author": "molobodd",
                  "created": 1633695899,
                  "upvotes": 6,
                  "replies": {
                    "hfuhsc2": {
                      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfuhsc2/",
                      "text": "It's on OP to make it clear to the journalist that it would be incorrect to print that they're the lead of the study and to make it clear to collaborators *before* it's printed that this interview is happening",
                      "author": "mediocre-spice",
                      "created": 1633696291,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfsfpeo": {
      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfsfpeo/",
      "text": "I think this is a situation in which everyone screwed up.\n\nYou:\n\n-I do think it is somewhat assumptive to give an interview about a research project you were minimally involved in. A few contexts in which this would be more understandable include if it happened spontaneously (e.g., the journalist calls you and you start talking, rather than a planned interview) or if you are the only person on the research team who speaks the language in your home country. Still, it would have been good for the lead researcher to have a heads up. I know you said you used plural language to refer to the team, but working with a team isn't inconsistent with leading a research project. If you did not very explicitly say that the research was being headed by the people who were heading it and that you were involved but had a comparatively small role, I do think that's on you.\n\nThe Journalist:\n\n-Clearly the journalist did not look at the article to see who was heading up the research, and they did not follow up with you after the interview like they said they were going to. It sounds like they misrepresented what you said by making it sound like you headed up a research study when you never claimed to do so.\n\nYour Supervisor:\n\n-Maybe there's some backstory? If you've done other things before where it appeared that you were self-centered or appearing more involved in something than you were, than her response makes sense. Otherwise, I think she's overreacting. I understand why she's upset--she's not receiving credit for her leading the project--and at the same time, I think this was an honest mistake. There's no substantial harm caused by the mistake.\n\nTreat this as a lesson about being on the same page in the future, and the ways in which--as much as I support the work that journalists do--journalists sometimes mischaracterize what they are reporting on.",
      "author": "jogam",
      "created": 1633648510,
      "upvotes": 23,
      "replies": {
        "hfsikg7": {
          "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfsikg7/",
          "text": "Thank you for your kind words. It was really an honest mistake. The journalist just email me and asked if I could give her my phone number so she could speak with me. She then called me and started to ask about the research paper, and I naively just gave her the answers I knew, that's why she told me that she would contact me again about that. She than asked me about my life, how I grew up, my experiences and the theme of my thesis. I ended up talking much more about this last subjects than the paper. When the news came, it was something along the line: poor girl from country X makes it life and leads a research that will help her country. \nMy country shares the language of the country I am now in. \nAbout the supervisor, I really thought that we have a great relationship but I starting to see now that once again I was naive. Yhe country I am studing in has very unstable conditions for researchearsbso the competition is real, and anyone from which you \"steal\" protagonism will come hard after you. That's one of the reasons I do not want to continue working in there after my PhD. I would never expect a reaction of such proportions. At the end, the paper's impact and visibility was huge and she ended up being invited for an international radio interview and to for an interview in the main news station of my country.",
          "author": "Anysessoh",
          "created": 1633649921,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "hfvb8tt": {
      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfvb8tt/",
      "text": ">DON'T USE THIS INFORMATION ANYWHERE\n  \nProceeds to post on the internet.",
      "author": "tryatriassic",
      "created": 1633709752,
      "upvotes": 3,
      "replies": {}
    },
    "hfw4mds": {
      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfw4mds/",
      "text": "I agree with others that your supervisor is being immature. It's very rare that scientific information is properly retold by journalists. I've given quite a few interviews and almost always, journalists will get something wrong. Good journalists will run the story past you so you can check for inaccuracies, but most won't. I've given an interview for the NY Times once for a paper in which I was the 4th author, and the journalist almost put it as if it had been my research. Despite the fact that I repeatedly told him I was not the main author! I've also published stuff as main author to then see some news mostly focusing on one author who happened to be interviewed. What i think your supervisor is particularly wrong is that, the paper is about your country,  you contacted a journalist from your country (I'm assuming you're the only one from there). You might have even spoken in your own language, so really you opened a door that was entirely shut to the rest of the team. They should be thankful the paper got attention and not petty.\n\nAnd yes, I've also been the 4th author on another  paper with mostly Europeans  but because of my connection to journalists in my own country the paper got picked by different media. Not my problem if others can't speak my language. \n\nThe best story though was my husband, who is also an academic, got a full page on a major newspaper, except that they got his nationality wrong (which was important to the story).\n\nBottom line is: journalists are on a tight budget and time and many won't care, so expect inaccuracies.",
      "author": "WhoMeNoMe",
      "created": 1633721942,
      "upvotes": 3,
      "replies": {}
    },
    "hg1wnsl": {
      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hg1wnsl/",
      "text": "Journalists decide who they want to interview, and what to write. Neither decision is your responsibility. \n\nWhen being interviewed by a journalist, it's important to be accurate and not to claim things that are beyond your responsibility. After that it is really out of your hands. If you don't want to take that risk, just don't do the interview.",
      "author": "DrTonyTiger",
      "created": 1633830139,
      "upvotes": 3,
      "replies": {}
    },
    "hfsgzjf": {
      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfsgzjf/",
      "text": "It's not a big deal and your supervisor sounds immature/unprofessional. Journalists are almost always wrong, especially when reporting on research, and any academic with media experience will know this. The fact that they seem caught up in the fight over the dubious glory of a random spat of reporting on research suggests that they're not used to the limelight and it's mostly egotism at play here. \n\nUnless you've signed some sort of PR contract, your supervisor doesn't own you or get to decide who you talk to about things you know. If they want you to behave in a particular way the burden for making that request falls on them - not on you to psychically guess how they'd react.\n\nA good supervisor would see this as part of your academic growth. They'd chuckle about the mistake, tell you that academic etiquette/cultural norms in their lab are to ask collaborators before talking with press, and congratulate you on the well-delivered and well-received interview. What your colleagues are doing is more befitting of a highschool drama clique who's grumpy about someone else getting picked for the lead role in a musical.",
      "author": "Radiant-Tax",
      "created": 1633649142,
      "upvotes": 17,
      "replies": {
        "hfteio7": {
          "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfteio7/",
          "text": "I believe that this is the right answer.",
          "author": "weightedflowtime",
          "created": 1633666073,
          "upvotes": 9,
          "replies": {}
        },
        "hfsji1g": {
          "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfsji1g/",
          "text": "I was thinking about the same. I am part of a group of first phd students my supervisor has; it would be an excellent opportunity to clarify how our intervention to the press, and/or anything regarding paper promotion, should be. What is strange is that my master and phd student colleagues did not seem that upset and they were very understanding. The main outrageous response came from team leaders and tenure professors that have more than a hundred publications and decades of research experience.",
          "author": "Anysessoh",
          "created": 1633650379,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfsxuk7": {
      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfsxuk7/",
      "text": "I do not blame them for being upset. You did not have the right to give the interview about the paper without letting the first and corresponding authors know. It may seem like a small deal to you, but this must have felt like a slap in the face to the actual leaders of the paper, no matter how innocent your mistake was. Researchers are highly protective of their publications because so much time and effort is put in, so I would probably feel similarly if someone on my team did this to one of my first author papers considering I put in the majority of the work. Plus the media *always* misconstrues scientific work so they were possibly also worried that your quotes would be taken out of context and potentially harm further projects and publications down the road. At this point you have to acknowledge that you will not have a smooth relationship with your PI or the first author moving forward, probably will not be invited to collaborate on more of their papers in the future, and that life moves on and you know not to do it again. Any time you speak to the media make sure you have the consent of the main authors. Period.",
      "author": "SassynWhimsical",
      "created": 1633657408,
      "upvotes": 10,
      "replies": {}
    },
    "hg2x282": {
      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hg2x282/",
      "text": "In my experience, media outlets will always exaggerate the contributions of whoever they interview. They are meant for the general public: they neither know what a 'first author' is nor want to appear that they were talking to someone who just wrote a couple of lines.  The fact that you wrote the press release and you are from the same country as the journalist may have increased that perception that you were a vital member of the research team. As you said, the story of 'poor girl...' also sells better than 'random researchers did X'. This is not on you.\n\nWhat is on you is not demanding that the media mention the sponsors, university, and project's PI. Also, giving the interview without telling the rest of the team —and at least giving them the opportunity to turn down sitting on the interview.",
      "author": "RecklessCoding",
      "created": 1633852833,
      "upvotes": 2,
      "replies": {}
    },
    "hfsupsr": {
      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfsupsr/",
      "text": "The first author and corresponding author hold the intellectual property rights and you infringed upon them by granting an interview on a work that you don’t own.",
      "author": "Human-Firefighter755",
      "created": 1633655890,
      "upvotes": 3,
      "replies": {
        "hftfpzm": {
          "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hftfpzm/",
          "text": "All authors collectively own the intellectual property rights of the article, and are responsible for the intellectual content therein. Else they wouldn't be authors.",
          "author": "ThePhysicistIsIn",
          "created": 1633666822,
          "upvotes": 17,
          "replies": {
            "hfthpst": {
              "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfthpst/",
              "text": "Collectively. But you misunderstood my comment. The co authors hold intellectual property rights over their respective contributions, but the first author and corresponding authors hold the intellectual rights for the study as a whole. And now that I think about it, this would also include senior authors as well. The op had every right to discuss her own contribution to the paper but not to speak for the works of others. By doing this, she infringed on their rights.",
              "author": "Human-Firefighter755",
              "created": 1633668078,
              "upvotes": -4,
              "replies": {}
            },
            "hfv87c8": {
              "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfv87c8/",
              "text": "This is from Johns Hopkins: “The basic difference between inventorship and authorship is that inventorship is legally defined and authorship is subjectively decided. Authors are added to research publications sometimes out of professional courtesy or deference with no fear of invalidation of the science presented. If the inventors listed on a patent are not correct, or left off, the patent can be deemed invalid; a very serious consequence resulting in loss of intellectual property rights…When does an author qualify as an inventor? An inventor is someone who contributes to the conception of the invention. Someone who merely reduces the invention to practice or only makes a financial contribution is by law not an inventor. That is, if a person (for example, a lab technician) demonstrated that the invention actually works or carries out the tests which reduced it to practice, without making a contribution to the conception of the invention, then he or she is not an inventor. However, such a person would usually be included as an author on a research paper resulting from the work, along with all the other people who contributed to the work. “",
              "author": "Human-Firefighter755",
              "created": 1633708477,
              "upvotes": 1,
              "replies": {
                "hfvak9j": {
                  "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfvak9j/",
                  "text": "Absolutely. Thanks for sharing the differences between authorship and patents.",
                  "author": "ThePhysicistIsIn",
                  "created": 1633709466,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hg1w6r8": {
          "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hg1w6r8/",
          "text": "That statement has several factual errors.",
          "author": "DrTonyTiger",
          "created": 1633829908,
          "upvotes": 0,
          "replies": {
            "hg1zwsz": {
              "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hg1zwsz/",
              "text": "You’re writing out of turn. A worker who cuts slides, or does physical, menial tasks, does not legally take credit for the concept that funded the investigation and gave birth to the manuscript. The law is very clear about concept rights and if that concept is developed into a patent, it’s not owned by all authors. Not even close. It’s the first author and the corresponding author, and in my experience, this also included the senior author. The law is very specific about protecting the parties who are responsible for creating the concept.\n\nOn the other hand, all authors are responsible for what they contribute, and all must agree that the manuscript can be published. Even after it’s publication, if one author has a reason to reject the manuscript, it may be retracted.",
              "author": "Human-Firefighter755",
              "created": 1633831781,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfwkcal": {
      "link": "/r/AskAcademia/comments/q3kd8n/i_gave_an_interview_about_a_paper_i_have_not/hfwkcal/",
      "text": "Honestly it seems like your supervisor used your name in the paper as a prominent author to leverage your connection to your homecountry for the benefit of their research. Your advisor seriously overstepped by doing that.\n\nYour decision to forward the (albeit approved) press release to an academic paper seems like overstepping to me as well, since reaching out to academic journals should be a team decision but being called for an interview and answering questions that you weren’t prepared to answer was just something that you could only have navigated appropriately with guidance or experience, and you’re gaining some. \n\nThe paper clearly wanted to center your nationality as well... to do the poor girl from this place aspirational blah blah piece on you in spite of what you said so I’m going to be the one to point out that you were used by both camps. \n\nI think that the paper wasn’t interested in accuracy. They did the same thing twice, and then so did you, so I can see why your colleagues feel that you did this on purpose. \n\nI honestly don’t know that you can convince them of your sincerity. I’ve certainly been disbelieved when telling saying I didn’t do something, and it hurts. This affects you in a number of other ways besides hurt feelings though, and I’m not sure how to advise navigating that.",
      "author": "olecountryfuck",
      "created": 1633728535,
      "upvotes": 1,
      "replies": {}
    }
  }
}