{
  "sid": "qsqs01",
  "link": "/r/AskAcademia/comments/qsqs01/starting_an_academic_position_with_a_young_family/",
  "title:": "Starting an academic position with a young family",
  "text": "I will be defending my PhD dissertation in a STEM field in about a month and have found a faculty position to which I'll be applying, set to start in August, 2022. I'm being realistic and not just assuming I'll get the job, but have been thinking a lot about how the work/family balance will work, regardless of where I get hired.\n\nI just had my first baby this year (6 months old now). We're not planning on another one yet, but will be down the line. I know that tenure track is an intense time, especially the first few years. Would maternity and parental leave cut into the tenure requirements? I live in Canada, but am near the border with the US and my academic options include several American universities. Canadian maternity leave is 12 months, but I know that in the US it's generally a lot shorter.\n\nI do enjoy teaching and research and would love a career in academia, but I'm also open to working in industry if a good opportunity comes up. \n\nI would appreciate any advice or personal experience that speaks to this.",
  "author": "gee_madz",
  "created": 1636769130,
  "updated": 1637180916,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.91,
  "comments": {
    "hkgaocs": {
      "link": "/r/AskAcademia/comments/qsqs01/starting_an_academic_position_with_a_young_family/hkgaocs/",
      "text": "I had my first as a postdoc and my second as a TT assistant professor. \n\nMy take on things is that academia is sort of unique when it comes to kids. I didn’t take long leaves with my kids, being that I didn’t have paid leave other than my accrued sick time. But I also haven’t felt that much difficulty with work life balance in non-pandemic times (more on that in a moment). My kids go to school at 8 am daily, I leave for work shortly after that and stay until 5. My husband and I trade pick up, with me doing it more often because he has a commute.\n\nSo we’re in school 8-5. During the pandemic, there weren’t after school activities and we had to get the kids by 3. My husband and I were scrambling. It was really hard. I often worked 5-7:30 am just to get all my time in. I still do this, so that I can hit the gym for an hour between when the kids go to school and I go to work. But we’re not out of the woods yet … hopefully this time with the kids getting vaccinated, school lasts.\n\nBeing faculty, I have a private office for breastfeeding. I’m a dry lab, so if my kids need to come to school with me, they can sit in my lab and color or watch cartoons.\n\nI by and large try to only work during my working hours (5:00-7:30, 9:30-5). It’s by and large fine. I get some crunch times where I’m working weekends. But I make an agenda for every day before bed and stick to it. I have a weekly and monthly agenda of the priorities and stretch goals. I think a lot of people don’t appreciate how much time they waste throughout the day and how much time is lost to being poorly rested or burnt out. So when I’m off, I try to be off. I might think about work, but the fun science stuff or the good stuff I’ll write in a letter, but not the frustrating things. I have sort of a reputation for being strict with my time, but no one is going to manage your time for you.\n\nMy husband isn’t an academic. He doesn’t have nearly the flexibility and ownership over his schedule that I do. So I end up tending a lot of sick kid days and that sort of thing. But the trade off is I travel more, in normal times, which leaves him as the solo parent for extended periods more often.",
      "author": "StorageRecess",
      "created": 1636808221,
      "upvotes": 7,
      "replies": {}
    },
    "hkhbkx8": {
      "link": "/r/AskAcademia/comments/qsqs01/starting_an_academic_position_with_a_young_family/hkhbkx8/",
      "text": "I find it really hard. I got my TT position when my son was under 1yo. He will be 3yo in a couple months. The first year was insane, specially with the pandemic making everything so difficult. I was in a new city, with no resources, no family, and I was meeting new colleagues through Zoom meetings. After 2yo, it gets a bit better, but I see that I can’t have the same schedule as my colleagues. It’s slowly getting better, but I have to work when my son is sleeping so most days I get around 5 hours of sleep. It is not enough. Anxiety is intense, and so is the guilt of not doing enough for my family. It is doable, but it has consequences. \nI wish you the best.",
      "author": "dsilesius",
      "created": 1636826089,
      "upvotes": 3,
      "replies": {}
    },
    "hkg8yus": {
      "link": "/r/AskAcademia/comments/qsqs01/starting_an_academic_position_with_a_young_family/hkg8yus/",
      "text": "Typically at American universities, maternity/parental leave falls under FMLA leave. Every public university I’ve been at grants a year extension for pre-tenure faculty who take FMLA leave (which can include childbirth and having a baby). This adds a year to the tenure clock.\n\nMy first position out of grad school was in industry when my first was born, and the benefits are much cushier. Better insurance (I hardly paid anything for care during my first pregnancy), 10 weeks of paid leave, in addition to using vacation, sick leave, and other PTO to add up to 4 months of paid leave. My second was born last year in my second year as a TT assistant professor at a research university and it was much more expensive (worse insurance), in addition to no paid leave other than short-term disability for the first 6 weeks. Baby’s arrival was timed well so I did not have to return until the very end of the academic year for a short time. \n\nThe flexibility of working in academia is a huge benefit with kids because of the sheer amount of sickness in the first year. We moved across the country and started as TT assistant professors when my first was 5 months and in daycare, and it seemed like baby was sick every other week. We also caught anything and everything that baby did, including a variety of colds and viruses, stomach bugs, and hand foot and mouth (incredibly painful for adults). \n\nGood luck on the job market!",
      "author": "the-asian-carp",
      "created": 1636807043,
      "upvotes": 4,
      "replies": {}
    },
    "hkhcac0": {
      "link": "/r/AskAcademia/comments/qsqs01/starting_an_academic_position_with_a_young_family/hkhcac0/",
      "text": "If you're at an American university, you may need to actively file for a tenure clock stop/extension (it's not automatic) which is a mild administrative burden, but is usually an option. \n\nIt may be the same in Canada.\n\nThe thing about tenure extensions though is that even if you get the extension... It's still a calendar year (or whatever) that goes by. If you can make a tenure eligible package without the extension, you can be promoted sooner, through the grasp-and-grind sooner, and have the security of putting that behind you sooner. Academic work will always fill the time you give it, and there's always an argument that 'one more year of work' produces a better package than today. 'Better' being the enemy of 'enough'.\n\nMy suggestion is to know what your tenure requirements are, take a focused approach to satisfying them, give yourself the option of the extension, but don't automatically take the extra time as the best option for you unless it truly is.\n\nIf it's obviously the right choice for you - do take it without any guilt of course. I'm just pointing out that \"extensions\" are equity band-aids with time costs.",
      "author": "IAmAQuailBiologist",
      "created": 1636826391,
      "upvotes": 2,
      "replies": {}
    },
    "hkg4n89": {
      "link": "/r/AskAcademia/comments/qsqs01/starting_an_academic_position_with_a_young_family/hkg4n89/",
      "text": "NB: I'm a father, so I didn't have to deal with any of the physical aspects of being pregnant and giving birth.\n\nMy first kid was born a few days after I took my quals; I've got several more kids now.\n\nI'm not going to lie: it is no fucking joke trying to raise kids and grind tenure track.\n\nThat said, I'm personally doing fine. Tons of papers, awards, grants, etc. I also personally think that it helped drive a lot of my effort; gotta get tenure so my kids can have a stable life.\n\nI've got another kid coming, and, at my university at least, I get a semester of reduced teaching load (i.e., I don't teach), but I'm still expected to do research.\n\nOn the other hand, I've got several very close collaborators that don't have kids, and it's pretty obvious that things are easier for them than they are for me. But, I think that's true in general, not just academia.\n\nThere are some awesome upsides to being in academia and having kids though. For example, my schedule is flexible enough that I get to spend time with my kids. Of course this means that I'm often working after midnight to make up for lost time, but it's worth it for me.\n\nAnd one last NB: I have an unhealthy \"work ethic\" to begin with. This is the first time I'll be taking parental leave (and I have more kids than any sane person should have). I've got 15+ papers this year and I intend to have more next year when I'm on leave. Years ago, my wife decided that she would be supportive of this idiotic behavior; it would not be possible without her full support. You should make sure that you and your spouse/partner are 100% on the same page with things. Even with me and my wife being on the same page there were extremely rough periods of time, especially earlier in my career when I was not nearly as successful as I am now.",
      "author": "worst",
      "created": 1636803730,
      "upvotes": 1,
      "replies": {
        "hkhf3tq": {
          "link": "/r/AskAcademia/comments/qsqs01/starting_an_academic_position_with_a_young_family/hkhf3tq/",
          "text": "I don’t mean to be rude, but it sounds like the family burden is on your wife’s shoulders, so it’s not exactly an healthy solution for most people.",
          "author": "dsilesius",
          "created": 1636827591,
          "upvotes": 1,
          "replies": {
            "hkhj2dv": {
              "link": "/r/AskAcademia/comments/qsqs01/starting_an_academic_position_with_a_young_family/hkhj2dv/",
              "text": "I'm not sure where you got this idea from.\n\nMy wife does a lot of things, I do a lot of things.\n\nShe is not a professor, so our work lives are different. She forgoes me having a normal sleep schedule and living in a city of her choice in favor of giving me the opportunities to have a successful academic career.\n\nI don't see it as particularly different from having a family where one spouse is say, an MD and the other is not.",
              "author": "worst",
              "created": 1636829307,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    }
  }
}