{
  "sid": "idwbsk",
  "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/",
  "title:": "Was fired for having a criminal record. Am I barred from academia forever?",
  "text": "After an altercation with a cop, I was arrested for \"battery on a law enforcement officer.\" It was a trumped-up charge and I eventually pled guilty to \"resisting an officer with violence.\"\n\nI hold two MA degrees, and was planning on applying to PhD programs next year. \n\nIn March, I was hired to be an adjunct at a community college, for both Humanities and English classes in the fall. I was told that they would call within a month to fill out the paperwork. Then COVID hit, and the campus shut down. I did hear from the English department lady on occasion, and was sent the books that I needed for my classes. \n\nIn July, after not hearing from anyone for two months, I contacted both the people in the English and Humanities departments who had hired me. The English lady didn't reply, and the Humanities guy informed me that the English lady was no longer there and though there were some Humanities courses, the department no longer existed. He told me who to contact, if I still wanted to be an adjunct.\n\nThis was particularly disheartening because I turned down another job because it was in conflict with my planned teaching schedule.\n\nA week later, I was contacted about teaching an Intro to Humanities course online. I was subsequently sent training online stuff (which I did), got a school email address, attended a Zoom adjuncts meeting, and made a syllabus, which was approved. \n\nOn August 17, I was contacted by the English department, offering me two classes. I could only take one, because they were in different cities, and I would have to drive 40 miles to the other after finishing the first one. \n\nOn the 18th, I filled out the paperwork, submitted stuff for a background check, went to an in-person faulty meeting.\n\nI was also informed that day that I would be teaching no Humanities courses. I was also offered a position of a classroom proctor, which I accepted.\n\nOn the 19th, I taught my first class.\n\nOn the 20th, I was informed by HR that I was fired due to \"things that came up in\" my background check. That is my ONLY arrest, unless you count the single speeding ticket that I got and payed off. I told them that I had been arrested for resisting in my application, but didn't mention the \"violence\" part. In fact, I wasn't aware that there were two types of \"resisting\" charges until yesterday. \n\nI was surprised because my record wasn't an issue in graduate school, though I'm guessing that it might be because the community college has dual enrollment with local high schools, as well as a collegiate high school.\n\nWill prevent me from ANY academic jobs? I CAN get my record expunged since it was over 5 years ago and haven't been arrested since (that was in the plea agreement), but I'm not sure if that would prevent it from showing up in background checks.",
  "author": "haloarh",
  "created": 1598015068,
  "updated": 1634080708,
  "over_18": false,
  "upvotes": 197,
  "upvote_ratio": 0.97,
  "comments": {
    "g2bnczf": {
      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2bnczf/",
      "text": "Were you fired for having a criminal record or failing to disclouse the whole truth about your criminal record? (I appreciate that you didn't understand the distinction between the resisting charges, but the rationale for your firing could make a difference). The main reason I ask is I wonder whether the 'violence' is the root of the problem, as I'd be surprised if a university was bothered about a criminal record per se (though I know the UK and US have rather different attitudes), and then 'lying' on an application is usually a sacking offense no matter what the lie actually is.",
      "author": "tc1991",
      "created": 1598016682,
      "upvotes": 142,
      "replies": {
        "g2bp0an": {
          "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2bp0an/",
          "text": "I said I had been arrested for \"resisting a law enforcement officer\" on my application. They hired me anyway. Then after the background check fired me.",
          "author": "haloarh",
          "created": 1598017653,
          "upvotes": 50,
          "replies": {
            "g2btvps": {
              "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2btvps/",
              "text": "You’re missing the point of this comment. Did they specify you were fired for resisting or not fully disclosing the “violence” part? I would follow up to clarify. If it’s the latter, then you know to be more forthcoming on future applications.",
              "author": "PhD4Hire",
              "created": 1598020307,
              "upvotes": 99,
              "replies": {
                "g2bu5ke": {
                  "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2bu5ke/",
                  "text": "They said only, \"things that came up in your background check.\" I assumed it was the \"violence\" part because I disclosed that I was arrested, but no, they didn't specifically mention it.",
                  "author": "haloarh",
                  "created": 1598020450,
                  "upvotes": 29,
                  "replies": {
                    "g2bu8o5": {
                      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2bu8o5/",
                      "text": "Like I said, follow up to clarify.\n\nAlso, try to get it expunged.",
                      "author": "PhD4Hire",
                      "created": 1598020497,
                      "upvotes": 105,
                      "replies": {}
                    },
                    "g2c40u1": {
                      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2c40u1/",
                      "text": "yeah, I'd make sure, if it was that you didn't disclose the full thing then you know for next time to disclose it, however it was the fact of 'violence' and not the lack of disclosure then you will have problems in the future. Either way if you can get it expunged then do, sure it may still show up on a deeper background check but its not going to make things worse to get it expunged.\n\nEDIT: FWIW you've got my sympathy mate, the whole point of our 'criminal justice system' is supposed to be to rehabilitate people to be able to rejoin society so this stupid nonsense that hinders peoples employment potentially for the rest of their lives is just vindictive and shortshighted, I'm a big supporter of the 'ban the box' campaign, where employers only ask for criminal record disclosure *after* they offered someone the job and only if its actually relevant",
                      "author": "tc1991",
                      "created": 1598025289,
                      "upvotes": 48,
                      "replies": {
                        "g2p2ac4": {
                          "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2p2ac4/",
                          "text": "I called the school today and was told that I \"misrepresented\" myself even though I disclosed my arrested. I asked the person that I spoke to if she could be \"specific\" about but she kept repeating that I  \"misrepresented\" myself.",
                          "author": "haloarh",
                          "created": 1598280441,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g2bscuy": {
      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2bscuy/",
      "text": "Get it expunged, it will NOT show up on a general employment background check. I did this in 2010 for a charge I got in 05. Another thing, you don't need to pay a ton to a lawyer to do it. It is extremely easy to file the paperwork yourself. Then just go in front of the judge, explain why you need it expunged (professional reasons, I lost a job due to this, etc.). I called two lawyers and they wanted to charged between $600 and $800 to do it. It took me 3 trips to the court house, and very little time. Worth doing for sure.\n\n\n\nEdit: unless you go into the military or take a fed job, or something requiring a security clearance of course...in these cases it never goes away",
      "author": "SheedWallace",
      "created": 1598019499,
      "upvotes": 112,
      "replies": {
        "g2bu96p": {
          "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2bu96p/",
          "text": "Do you mind sharing how much it cost you?",
          "author": "haloarh",
          "created": 1598020505,
          "upvotes": 23,
          "replies": {
            "g2bwguo": {
              "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2bwguo/",
              "text": "This was 10 years ago so my memory is realllly shakey, but I had just gotten out of the army and needed to get it expunged to qualify for a security clearance for a defense contracting job overseas. I was unemployed for months and super broke. All it cost was the court fees to file the paperwork since I did everything myself, so it was well under $100 and if my memory is correct it was closer to $50. That may have changed but it still would be far less than the hourly cost of an attorney.\n\n\nI remember there were several forms I had to fill out basically explaining why I needed to have it expunged. Picked them up, went home and filled them out, went back and dropped them off the next day and had a court date a couple weeks later. Then I spoke in front of the judge and he asked me questions and I explained how this would help improve my job prospects and how I had improved my life since the conviction (incidently it was the same judge who sentenced me, he sent me to jail for a month for selling weed). Then he said he will approve and I got a document in the mail a week later saying my conviction was expunged. The court part was over in like 5 minutes, it was between normal circuit court cases though so it was awkward having to talk with all of these families in the room who were awaiting more serious hearings.\n\n\nIt was a quick process and very cheap. I was very broke then and don't remember the cost being an inconvenience.\n\n\nEdit: a word",
              "author": "SheedWallace",
              "created": 1598021654,
              "upvotes": 33,
              "replies": {
                "g2e9oh3": {
                  "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2e9oh3/",
                  "text": "You shouldn't generalize so much. Expungement costs and procedures vary from state to state. I did it without a lawyer but it was still a costly headache with numerous steps that dragged out over 8 months. First I had to have my fingerprints taken (at cost), and send an application and processing fee of like $100 to the state's criminal investigation bureau. Then 6 months later the state office sent me a certificate that said I was qualified for expungement (not an actual expungement order). I had to send that to the county where I was arrested, along with like 6 separate sets of paperwork. They reviewed my case and finally granted my expungement request. But I had to buy copies of the expungement order. Then I had to mail those copies back to the state's office and the district attorney's office. The combined cost along with postage (because I handled everything by mail) was over $300.",
                  "author": "xatero",
                  "created": 1598063909,
                  "upvotes": 2,
                  "replies": {
                    "g2emywu": {
                      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2emywu/",
                      "text": "Well to be fair I did say it was 10 years ago and in front of the same judge who sentenced me. If you did everything back and forth by mail from a different state I can see how that would be a different process with longer time frame. I know I was never finger printed or anything like that, so yeah it appears it is different in different states. To clarify, mine was in Michigan. \n\n\nWhy did it cost money to have your fingerprints taken? Was it some sort of private lab? I have had to have my fingerprints taken on my own before for contracting gigs, and I just walked into a police station with the forms and asked to have them fingerprint me, sign and seal, and it cost nothing.",
                      "author": "SheedWallace",
                      "created": 1598068954,
                      "upvotes": 1,
                      "replies": {
                        "g2gussb": {
                          "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2gussb/",
                          "text": "It was a local sherrif's office and they charged for their fingerprinting services. Only $10, but still all those little fees add up.",
                          "author": "xatero",
                          "created": 1598104533,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g2p44l0": {
                  "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2p44l0/",
                  "text": "I called the courthouse at it's only $62 here!",
                  "author": "haloarh",
                  "created": 1598281361,
                  "upvotes": 1,
                  "replies": {
                    "g2paks3": {
                      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2paks3/",
                      "text": "Hell yeah! Glad it is about the same as here. It will be a huge relief to not have to worry about that burdening your job search later on down the line.",
                      "author": "SheedWallace",
                      "created": 1598284505,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g2bvyl2": {
      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2bvyl2/",
      "text": "Many schools-- including mine since 2010 --require background checks of all employees before a job offer is made. When our policy was imposed on us by HR the faculty demanded to know what exactly would be a disqualifying record-- traffic tickets? civil disobedience? minor possession charges? domestic violence?  Nobody would ever give us a straight answer, we were just told \"it will be handled on a case-by-case basis and confidentially.\"  So all I can tell OP is that 1) we WILL find out if you have a record, and 2) someone in HR is likely going to have a secret list of disqualifying things. I imagine the word \"violence\" could be on it.\n\nGet it expunged asap.",
      "author": "SnowblindAlbino",
      "created": 1598021394,
      "upvotes": 35,
      "replies": {}
    },
    "g2c3jge": {
      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2c3jge/",
      "text": "The legal details of expungement vary form state to state — a lot. Your best bet here is to consult with an attorney about expungement, how it works in your state, and the extent to which employment-based checks will surface your history. \n\nNote, however, that in at least some states employers can still ask if you’ve ever been arrested or convicted, regardless of expungement — and they can fire your for falsifying your application. \n\nThere are *a lot* of tricky details on this, which is why you should pay an attorney to explain them and to work on your behalf.",
      "author": "dr_police",
      "created": 1598025090,
      "upvotes": 15,
      "replies": {
        "g2cqt42": {
          "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2cqt42/",
          "text": "Right. Violent offenses have different stipulations in Texas, for example. A felony non-disclosure (no such thing as expunction of a felony here) takes 7 years after the case is disposed.\n\nOP can look up the eligibility requirements through state websites/Google search.\n\nSource: personal experience",
          "author": "Antikythera22",
          "created": 1598035601,
          "upvotes": 3,
          "replies": {
            "g2d4chv": {
              "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2d4chv/",
              "text": ">\tOP can look up the eligibility requirements through state websites/Google search.\n\nAs a person with a PhD in criminal justice myself, let me emphatically state that while you can Google all you want, *hire an attorney when you interact with the legal system.*\n\nThere are a lot of practical implications here that a plain-reading of statute wouldn’t make obvious — and local court rules can shape how expungements happen in the real world. You want an attorney with relevant experience who can help you navigate the complexity. \n\nFor something like this, we’re talking about a few hundred dollars for a consult and (perhaps) filing paperwork.",
              "author": "dr_police",
              "created": 1598042134,
              "upvotes": 7,
              "replies": {
                "g2d4rk5": {
                  "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2d4rk5/",
                  "text": "Of course they should seek legal help if the process is difficult or confusing but there is (at least in Texas) an eligibility checklist to help you rule out/in whether it's a possibility at all. Given that OP holds two advanced degrees, I thought it would be manageable for them. I hold only a BA and I managed just fine. Not to negate your advice at all- in fact with a violent offense involving a police officer, your advice totally warranted.\n\nAnd Abbott has pardoned about 6 people in his history as Governor.",
                  "author": "Antikythera22",
                  "created": 1598042343,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "g2dd11y": {
          "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2dd11y/",
          "text": "It was part of my plea agreement that I could get it expunged after 5 years.",
          "author": "haloarh",
          "created": 1598046578,
          "upvotes": 3,
          "replies": {
            "g2dg1gv": {
              "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2dg1gv/",
              "text": "\n\n>\tpart of my plea agreement\n\nSure. But exactly how that works is subject to state statue (and sometimes local court rules as well). \n\nHire an attorney, listen to their advice. None of us will be able to give you legal advice here. \n\nOn employment in higher ed with a criminal background more generally.... that depends on the school, department, and job description. \n\nWhen I hire data analysts for my criminal justice research unit, for example, I need them to have a clean background so they can access criminal justice information. When I hire an office managers, I need them to have a clean background because they’ve got access to finances. \n\nWhen I hire faculty, they don’t need to pass a background check, because the job description does not require it. \n\nBut that’s at my institution, in my state. Your state or institution may vary, especially if there are high school students taking college courses. In general, if the position requires a background check, it should be in the position description or job announcement. If the institution does backgrounds routinely, it should be in their HR/hiring policy. \n\nEvery bit of this stuff depends so much on the particulars of several aspects of your situation that you’re unlikely to get usable information from any Redditor. \n\ntl;dr: some jobs in academia require clean backgrounds some of the time, but not all jobs all of the time, and not everywhere.",
              "author": "dr_police",
              "created": 1598048179,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "g2bo3la": {
      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2bo3la/",
      "text": "get it expunged I don't believe they show up in background checks ftp",
      "author": "Onion-Fart",
      "created": 1598017121,
      "upvotes": 36,
      "replies": {
        "g2bp5wt": {
          "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2bp5wt/",
          "text": "this is the way to go.  education jobs tend to take checks fairly seriously imo, so as long as this is showing up it will be a big problem for you.  it won't show up in a background check if it is expunged.",
          "author": "justiredditor",
          "created": 1598017744,
          "upvotes": 13,
          "replies": {}
        },
        "g2bqi5i": {
          "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2bqi5i/",
          "text": "When I was in law school (which I did not finish), we were told that even expunged and sealed arrests show up when they do a background check for your bar application, so I'm worried about the same thing.",
          "author": "haloarh",
          "created": 1598018493,
          "upvotes": 15,
          "replies": {
            "g2bwy03": {
              "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2bwy03/",
              "text": "Bar examination background checks are different.\n\nYou should consult with a lawyer. There are many who specialize in expungement cases.",
              "author": "MrFordization",
              "created": 1598021895,
              "upvotes": 27,
              "replies": {}
            }
          }
        }
      }
    },
    "g2dfxsg": {
      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2dfxsg/",
      "text": "At my university (state school in a red state, but a very liberal university) there are at least two faculty with felonies that I personally know of. One was accessory to murder. So it’s definitely not impossible, but it seems like trying to get it expunged would still be a good idea.",
      "author": "SvenTheAngryBarman",
      "created": 1598048124,
      "upvotes": 6,
      "replies": {}
    },
    "g2czgw3": {
      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2czgw3/",
      "text": "My chair (who probably could tell I used to be shady af) said, we're going to do a background check in a week, so please make sure you've expunged anything you may or may not need to expunge.",
      "author": "scintor",
      "created": 1598039708,
      "upvotes": 5,
      "replies": {}
    },
    "g2d0bk1": {
      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2d0bk1/",
      "text": "Everything you have said is very sad. I believe in reinsertion and the issue seem not too serious. My only and best conclusion about your story is: «go ahead, you can do it». I wouldn't keep in mind or be worried by legal issues. I would apply in other positions. Kind regards.",
      "author": "Antonio-Cansinos",
      "created": 1598040125,
      "upvotes": 2,
      "replies": {}
    },
    "g2da97a": {
      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2da97a/",
      "text": "I know two faculty members with criminal backgrounds that did not get in the way of their hire. And I know a tenure-track person who got fired for getting a DUI. I don’t think it will necessarily stop you from getting a job. If you can expunge it that’s best or you want to be very up front about it in your applications. Good luck!",
      "author": "buthowdoweknow",
      "created": 1598045122,
      "upvotes": 2,
      "replies": {}
    },
    "g2cqheb": {
      "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2cqheb/",
      "text": "Is this U.S. or UK? EU?",
      "author": "Antikythera22",
      "created": 1598035443,
      "upvotes": 1,
      "replies": {
        "g2crs54": {
          "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2crs54/",
          "text": "US",
          "author": "haloarh",
          "created": 1598036070,
          "upvotes": 3,
          "replies": {
            "g2cty30": {
              "link": "/r/AskAcademia/comments/idwbsk/was_fired_for_having_a_criminal_record_am_i/g2cty30/",
              "text": "Felony or misdemeanor? I'm assuming felony.",
              "author": "Antikythera22",
              "created": 1598037128,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}