{
  "sid": "qv83mx",
  "link": "/r/AskAcademia/comments/qv83mx/choice_of_my_academic_path/",
  "title:": "Choice of my academic path",
  "text": "I got opportunities in 3 fields that I love but can't choose between them:\n\n\\- Signal processing and Wireless Communications Systems. (Pros: there is a lot of investment in this field, so I have a lot of opportunity in long term)\n\n\\- Neuromorphic engineering (algorithms and hardware) (Pros: It's a promising concept but still in its beginning, I may not find a lot of opportunities)\n\n\\- Computer architecture (processors and microcontrollers).\n\nComputer architecture is not my top choice, I am more confused about the others, I know that they are not related to each other, but can't choose the right path, I need help and advice.\n\n&#x200B;\n\nAnother question: Do think about remote research experience with a good advisor VS a research experience in prestigious university, but the advisor isn't really excellent in his field.\n\n&#x200B;\n\nThank you !",
  "author": "StartFinancial5917",
  "created": 1637070317,
  "updated": 1637180878,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hkva9lm": {
      "link": "/r/AskAcademia/comments/qv83mx/choice_of_my_academic_path/hkva9lm/",
      "text": "Personally, I’d choose the Signal processing and communication field. It has a lot more opportunities. \n\nAlways go for the good advisor. They’ll make your life easier. The good research experience is good if you can provide your own advising. It’ll be hard once you get stuck (and you will). So you’ll need someone who’s capable of advising even if they’re not an expert. I am currently stuck with a terrible advisor. They don’t provide me with any help and it’s frustrating.",
      "author": "gradAunderachiever",
      "created": 1637079686,
      "upvotes": 3,
      "replies": {
        "hkvqkmd": {
          "link": "/r/AskAcademia/comments/qv83mx/choice_of_my_academic_path/hkvqkmd/",
          "text": "Thank you for your reply, signal processing is always in the expansion so yes there are a lot of funds in this field.",
          "author": "StartFinancial5917",
          "created": 1637086026,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkv6j1c": {
      "link": "/r/AskAcademia/comments/qv83mx/choice_of_my_academic_path/hkv6j1c/",
      "text": "[deleted]",
      "author": null,
      "created": 1637078175,
      "upvotes": 2,
      "replies": {
        "hkv79us": {
          "link": "/r/AskAcademia/comments/qv83mx/choice_of_my_academic_path/hkv79us/",
          "text": "It's about PhD opportunities, thank you for your help !",
          "author": "StartFinancial5917",
          "created": 1637078476,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}