{
  "sid": "rdnwdp",
  "link": "/r/AskAcademia/comments/rdnwdp/authorship_issue_for_journal_article_with/",
  "title:": "Authorship issue for journal article with supervisor",
  "text": "Hi all, \n\nIn a lil pickle right now.\n\nI recently had to stop working on publishing my master's thesis in a journal due to starting a phd full time. As it stands, the project currently needs a huge redesign on the experimental methods, which I would not be able to do alongside my thesis and coursework. My masters supervisor suggested that they could take over the project and have me as a co author instead. \n\nMy question is- how do I bring up that I'd like to be second author? I won't be working on it anymore, and the project will need a large overhaul, but it is still based on my thesis and using the stimuli I designed. It seems like she wants to work on it with another academic, which might mean I get pushed to third author onwards. \n\nWhat should I do/tell them in this case? \n\nThanks!",
  "author": "eggyeggygoo",
  "created": 1639185253,
  "updated": 1639515521,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "ho2vp3z": {
      "link": "/r/AskAcademia/comments/rdnwdp/authorship_issue_for_journal_article_with/ho2vp3z/",
      "text": "My policy is that authorship order is not determined until the project is done and written up. It is very easy to underestimate the amount of work needed to finish a study and write the paper. So I wait until it's done to figure out the order. Keep in mind, it's possible that nobody will want to finish this project for you, especially if they are not going to get 1st or 2nd author. I see this a lot. Students much prefer their own project over finishing up someone else's project. Being third author on a nice paper is a whole lot better than getting nothing.",
      "author": "Carb-ivore",
      "created": 1639195508,
      "upvotes": 7,
      "replies": {}
    },
    "ho2iv13": {
      "link": "/r/AskAcademia/comments/rdnwdp/authorship_issue_for_journal_article_with/ho2iv13/",
      "text": "I think you could discuss it but unfortunately this happens (at least in STEM). It’s not uncommon to be pushed down, especially if there is a lot of work to be redone.",
      "author": "adnamanda",
      "created": 1639189448,
      "upvotes": 3,
      "replies": {}
    },
    "ho4gkuq": {
      "link": "/r/AskAcademia/comments/rdnwdp/authorship_issue_for_journal_article_with/ho4gkuq/",
      "text": "My advice is to always talk about the first. But I see In these comments this is not the same for everyone.\n\nOne thing to keep in mind is if you prefer a 3th authorship position over not getting it published at all.\n\nAnyway good luck with this.",
      "author": "preeepa",
      "created": 1639232767,
      "upvotes": 1,
      "replies": {}
    }
  }
}