{
  "sid": "7ippb4",
  "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/",
  "title:": "Crowdsourced survey on sexual harassment in academia. 2,000+ responses already.",
  "text": "[The Professor Is In](https://theprofessorisin.com/2017/12/01/a-crowdsourced-survey-of-sexual-harassment-in-the-academy/) has crowdsourced a survey collecting reports of sexual harassment and assault experiences in academia [here](https://docs.google.com/forms/d/e/1FAIpQLSeqWdpDxVRc-i8OiiClJPluIpjMlM41aUlU2E0rrQ4br_rQmA/viewform#responses). You can read through the 2,000+ responses at [this](https://docs.google.com/spreadsheets/d/1S9KShDLvU7C-KkgEevYTHXr3F6InTenrBsS9yk-8C5M/edit#gid=1530077352) google spreadsheet. I personally recognize a tenured individual reported on that survey who is STILL harassing graduate students, despite a mandatory leave of absence following a sexual harassment case.\n\nIf you have your own story to share, add it there, or feel free to discuss related issues here.",
  "author": "rhetoricetc",
  "created": 1512856550,
  "updated": 1634081884,
  "over_18": false,
  "upvotes": 105,
  "upvote_ratio": 0.9,
  "comments": {
    "dr0ph48": {
      "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr0ph48/",
      "text": "Thank you for posting this. It's very important and I have a lot of time for Karen's work in general.\n\nThere's plenty I could put down in that document but I shouldn't be the one deciding to share them. I will send this around though.",
      "author": "DunkeyKung",
      "created": 1512868308,
      "upvotes": 15,
      "replies": {
        "dr0qnvt": {
          "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr0qnvt/",
          "text": "Thank you!",
          "author": "rhetoricetc",
          "created": 1512869890,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "dr285js": {
      "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr285js/",
      "text": "I think some of the criticisms of this project miss the point. Yes, it's true that the survey methodology is not as rigorous as would be required to satisfy the standards of academic social science, nor does it subject the reports to journalistic or legal standards of verification. However, it was never intended to comply with those standards, because the point is not to enable scientifically-valid specific inferences or to prove the case against a specific target for a particular incident or set of incidents. The purposes of the survey are (1) to enable victims to collectively speak out about their experiences while protected from retribution by anonymity, and (2) to make a prima facie case that this is a ubiquitous problem which merits further, more sustained inquiry and action.\n\nIf you want better data so that you can make better inferences about the problem of sexual harassment in the academy, well...then go conduct that research! A few of the social science disciplines have already started to do this, actually. Some political science researchers are currently working on a big ongoing project aimed at comprehensively and rigorously studying - as well as developing policy responses to - inequality, discrimination, and harassment within the discipline. There have been a few publications in anthropology regarding the climate in fieldwork settings specifically (see the comments on Kelsky's blog post linked in the OP for cites). There's a whole saga of controversy in philosophy departments concerning diversity and harassment issues (particularly with regard to Brian Leiter's blog, Linda Alcoff's climate survey, and the ranking of graduate programs).Some individual departments in various fields have also brought in external experts to conduct climate evaluations. We have a long way to go, clearly, but there are some early models in some fields that have begun systematic efforts to identify and resolve these problems.\n\nSo yeah...if you don't like the survey as either a study or a solution, then treat it as a pilot, and as a provocation to pursue further research and systematic institutional/cultural reform.",
      "author": null,
      "created": 1512950380,
      "upvotes": 7,
      "replies": {}
    },
    "dr13yf9": {
      "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr13yf9/",
      "text": "An important way for people to be heard - thank you. ",
      "author": "Retro21",
      "created": 1512890953,
      "upvotes": 5,
      "replies": {}
    },
    "dr1wxy5": {
      "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr1wxy5/",
      "text": "This is absolutely mortifying. You can tell even before reading any of the stories - the document made Chrome crash on my laptop because it's so big. \n\nThanks for posting",
      "author": "thelinttrap",
      "created": 1512938552,
      "upvotes": 5,
      "replies": {}
    },
    "dr1u4jy": {
      "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr1u4jy/",
      "text": "This is important, but I don’t think collecting hearsay (events or goings on the person filling out the survey is not a first party witness to) is a good idea. \n\nAt the least, if something is to made from the survey, hearsay should be coded as such - it is entirely different from first hand accounts. It isn’t as if there will be few first hand accounts. ",
      "author": "ph0rk",
      "created": 1512935744,
      "upvotes": 2,
      "replies": {}
    },
    "dr0z69k": {
      "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr0z69k/",
      "text": "[removed]",
      "author": null,
      "created": 1512882049,
      "upvotes": -12,
      "replies": {
        "dr16ckl": {
          "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr16ckl/",
          "text": "I'm not sure that accuracy is the chief concern here...",
          "author": "riggorous",
          "created": 1512897176,
          "upvotes": 11,
          "replies": {}
        },
        "dr11ao8": {
          "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr11ao8/",
          "text": "[deleted]",
          "author": null,
          "created": 1512885526,
          "upvotes": 3,
          "replies": {
            "dr11vtm": {
              "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr11vtm/",
              "text": "No, you can't because it's open sourced.  You aren't looking at a specific discipline, institution type, or stage of career because you have no way to know if more than a few of each even knew the survey existed, let alone responded.  If no one reports bring harassed in English 101 did that mean no one was harassed? No. Because you didn't target them.  You didn't target anyone.",
              "author": "yuppperz",
              "created": 1512886569,
              "upvotes": -1,
              "replies": {
                "dr27ea2": {
                  "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr27ea2/",
                  "text": "I feel like you're missing the point.",
                  "author": "rhetoricetc",
                  "created": 1512949557,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "dr131wf": {
          "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr131wf/",
          "text": "[deleted]",
          "author": null,
          "created": 1512888927,
          "upvotes": 1,
          "replies": {
            "dr1cs6y": {
              "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr1cs6y/",
              "text": "Can't speak to their background, but their point is pretty spot-on.\n\nEdit: on re-reading, I see it's a survey, not research. Anything's game, I guess.",
              "author": "Glaselar",
              "created": 1512914613,
              "upvotes": 6,
              "replies": {
                "dr27ipc": {
                  "link": "/r/AskAcademia/comments/7ippb4/crowdsourced_survey_on_sexual_harassment_in/dr27ipc/",
                  "text": "It's not an academic project. It's about visibility of sexual harassment in academia.",
                  "author": "rhetoricetc",
                  "created": 1512949689,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}