{
  "sid": "irah9t",
  "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/",
  "title:": "Starting a PhD in 2 weeks time - how do I protect my mental health long term?",
  "text": "I'm starting a PhD in two weeks time and found previously in my Masters write up period that my mental health went a bit downhill. I know that PhD is a long and hard period of time with lots of challenges and that PhD students have a tough time with their mental health. Does anyone have any tips/advice on how to go into the programme with a good set of skills to maintain my mental health for the duration of the 3-4 years?\n\n*Edit: Thank you for all the advice and tips, I massively appreciate it.",
  "author": "Major-Ostrich",
  "created": 1599907776,
  "updated": 1634081212,
  "over_18": false,
  "upvotes": 152,
  "upvote_ratio": 0.95,
  "comments": {
    "g4xgllw": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xgllw/",
      "text": "Good sleep hygiene is my number one recommendation. Go to bed at a reasonable hour every night and wake up 8 hours later. Good sleep is one of the best things you can do for your mental health. \n\nThen there's taking care of your body in other ways. Hydration, vitamins, healthy food, exercise. A PhD is emotionally and physically brutal - you spend all your time indoors hunched over a laptop. You have to take care of your body. Make sure to get out for short (or long!) walks, get some fresh air and sunlight.\n\nStart therapy now so you're already seeing someone you like when your first Very Stressful Event happens. It will happen.\n\nMake friends with other grad students. These are your people now. They're your battle buddies. They get what you're going through and commiseration will help tremendously. \n\nBuild into your schedule dedicated off-screen time. No screens at all. It's best if this is what you do right before bed (better for healthy sleep). \n\nDevelop a routine and maintain those boundaries whenever possible. For example, I have email notifications turn off on my phone at 7pm and I don't work weekends unless I have a big project. \n\nGood luck and have fun!",
      "author": "wantonyak",
      "created": 1599918858,
      "upvotes": 102,
      "replies": {}
    },
    "g4x6u2o": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4x6u2o/",
      "text": "I would say managing expectations from your supervisor(s)/PI so that you don’t put unnecessary stress/pressure on yourself is a good starting point. If you know what is expected and required of you then you can tailor your time accordingly. \n\nI also think that it’s important to pace yourself and if you’re able to, try to maintain a proper work/life balance because a PhD is essentially a marathon. Overworking yourself in the beginning will lead to a burnout and will not do you any good (personally learned this the hard way). Breaks are GOOD and don’t let anyone in academia try to convince you otherwise. You don’t always have to be productive and there will be times when you will be busy and other times when your workload will be lighter. \n\nALSO for managing imposter syndrome, I’ve come to realise that putting people on pedestals makes it so much worse. Everyone is just trying to survive—even your PI. After coming to the realisation that everyone is just human and no one knows everything, it made my life so much easier. And if you pay close attention, you’ll see that even the best ask dumb questions that you can answer as a PhD student ;)",
      "author": "dirtynip",
      "created": 1599911394,
      "upvotes": 78,
      "replies": {}
    },
    "g4xkt2s": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xkt2s/",
      "text": "Don't go into the PhD with the expectation that things have to be difficult all the time for any reason. I'm almost at the end of second year and when I talk to my friends I feel like either I'm not doing enough or I'm doing something wrong because I don't hate my life. I'm not up at night crying or feeling like shit or hating my bosses. Not everyone has the same experiences and don't expect life to be hard for you just because it is for someone else.",
      "author": "yako678",
      "created": 1599921309,
      "upvotes": 23,
      "replies": {
        "g4ze6td": {
          "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4ze6td/",
          "text": "Jesus, this hit home. I've had a pretty great PhD experience, where my wife's was horrifying. I always felt guilty that things were going so well for me.",
          "author": "Verdris",
          "created": 1599946072,
          "upvotes": 6,
          "replies": {}
        },
        "g502fjc": {
          "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g502fjc/",
          "text": "This is the same as me - I went into a PhD with no expectations (didn't know anyone who had done one and I barely understood how it worked, no idea what imposter syndrome was, didn't know what impact factor was etc.) had a great time and because I was so happy I did well for myself and knew what to look for in a post-doc to keep me happy, whereas I know people who started in the same department with the expectation that it was going to be awful and every toxic thing that happened in academia was going to happen to them. Their preconceived negativity of PhD was so strong that the things they complained about were things that would be difficult in any job. I certainly noticed clusters of groups in the department who complain, and people who get on with it.",
          "author": "princetonkotsu",
          "created": 1599954390,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4xh2f6": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xh2f6/",
      "text": "One thing I notice from people who get really bad is they can start to isolate themselves because they feel bad about being depressed. \n\nFor example a post like \"I'm about to quit, all I do is cry all the time, I try to keep going, I'm so scared about what my supervisor or parents would say if they knew the truth etc\" shows the extent of the isolation.\n\nIMO work out your support points before you need them. Make sure you know about your universities mental health services and go there if you get a little low, don't wait until you're really bad. Maybe get a private therapist if you can afford it. Talk to your parents and friends about how some people have mental health challenges during a PhD and ask them to keep track of you.\n\nIf your supervisor is unreasonable or puts too much work on you tell them that immediately. Say stuff like \"the amount you gave me last week made me feel overwhelmed and it was a real struggle trying to work on it.\" Sometimes a good and caring supervisor can think everything is fine until the blowup happens.\n\nSo I guess that's the main thing, if you have a support network it's way easier.",
      "author": "parkway_parkway",
      "created": 1599919164,
      "upvotes": 24,
      "replies": {
        "g4z554y": {
          "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4z554y/",
          "text": "I really wish there were more reasonable supervisors. But also if you find yourself in a situation where your PI or advisor is trying to control your life with work, get out fast. This is my biggest regret. I have destroyed my life and mental health over a toxic advisor. It’s not worth it.",
          "author": null,
          "created": 1599943181,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "g4x4hyp": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4x4hyp/",
      "text": "In the long run that is life, I’ve learned there is bound to be something that will eventually trip you up and inevitably send you spiralling down the dark drain of depression or the unremitting throes of anxiety. For you it might be this PhD, but it may not. For me it wasn’t the PhD, although I had fully expected it to. I could go on about protective factors against mental health issues such as developing and maintaining a social support system, identifying a mentor, being aware of mental health resources available in your university and not being afraid to reach out. What worked for me was to brace myself for it. Expect a mental health crisis at some point, and build a contingency for it. If you never need to use it, it might come in handy should any of your fellow students be in need, in which case you would be prepared to help them. At the end of the day, there is much you cannot control. But what you can do is to control your perception and expectation of the future. Think of this doctoral journey in terms of it being only one small step in a series of life challenges that are bound to arrive and will test your mettle. The struggle itself will help you build resillience and will come to define who you are, and hopefully shed greater clarity into your purpose in life. Good luck!",
      "author": "Tourandocte",
      "created": 1599909110,
      "upvotes": 30,
      "replies": {}
    },
    "g4xnchg": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xnchg/",
      "text": "Remember it is a marathon. Try to find and make good friends in your program but, maybe more importantly, outside of it. I am in my 4th year and I can tell you that Qual exams are probably the hardest I have been pushed in my academic career. Enjoy coursework and try to make it work toward other long term goals (sections of your dissertation, maybe use it for publications) if that is how it works in your field. \n\nI would set up a system to take notes and streamline how you study and set up. I am in the humanities so I use things like Zotero, note apps (Evernote), resource organizer (Devonthink. I bought it with my first paycheck), and a word processor (Scrivener). Having a structure that you adhere to is better than racing to finish things constantly. \n\nTake mental health days. Everyone acts as though you need to work at least 8 hours everyday. Don't do this. I couldn't because I have a family but I watched cohort mates burn out in 8 months doing this. Most switched to 5 days at 8-10 hours or 6 days at 6-9 hours. \n\nBuild a committee that gets along with one another. Also, know that your advisor can be a dick sometimes. I just get past it. My relationship with my advisor is at an arms length because my MA advisor was such a total asshole.",
      "author": "Chiquye",
      "created": 1599922509,
      "upvotes": 9,
      "replies": {}
    },
    "g4y2dtz": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4y2dtz/",
      "text": "I agree with everything else that has been said. My suggestion is maybe a little more silly, however I have found it beneficial to take up a hobby that has absolutely nothing to do with your PhD. During my graduate experience I got very good at doing tricks with a yo-yo. My wife (who is still in it) got very good at gardening. It’s important that you prioritize your relaxing time. And having something in your life completely unrelated to your scholarship can help with this.",
      "author": "tkerby101",
      "created": 1599929109,
      "upvotes": 9,
      "replies": {
        "g501cdj": {
          "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g501cdj/",
          "text": "I was looking for someone to say this. Hobbies are super important. \n\nI realized about a year and a half into my PhD that I no longer have a hobby. I slowly dropped everything I liked to do since they were distractions. When I was less busy I never thought to pick them back up again. \n\nThis is something I am still struggling with, especially since my real passion (seeing and obsessing over live theatre) is something I can’t do during covid. I’ve started listening to musicals while I’m really busy to keep the passion alive. \n\nI’ve gotten back into relaxing video games (paper mario and animal crossing are current favorites) and started replanting a patio garden (the old ones died over the summer with the extreme heat/humidity and I didn’t both getting more). \n\nIt’s ok to have a few weeks of hard work when there is a paper deadline but please take time off afterward to return to normal before the next deadline comes along. Normal is not the workload when working towards the deadlines. Please remember that OP",
          "author": "madisel",
          "created": 1599953981,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g4xj28s": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xj28s/",
      "text": "Make sure your sleep is normal. Read the book why we sleep by Matt walker.",
      "author": "Traveler-58",
      "created": 1599920441,
      "upvotes": 9,
      "replies": {}
    },
    "g4y7mhx": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4y7mhx/",
      "text": "A lot of great advice here, but if I can expand on the “marathon” bit: I think what often messes with grad students’ mental health is the expectation of immediate over delayed gratification. In so much of our culture, we’re taught to expect frequent congratulations and plaudits. It’s typically meaningless and hollow (employee of the month type shit), but between that and hoping for more likes on social media, it’s how our brains are wired. In academic life, any outcome or achievement takes a lot of time. If you can keep your personal life for simple gratification, perfect (I had a cat and biked to and from campus; I looked forward, every day, to biking home regardless of weather, and sitting with my cat to watch TV). Theses and dissertations take years; journal rejections will be numerous. Keep your eye on longterm goals and don’t get impatient. Also, totally get a cat.",
      "author": "mljohnson119",
      "created": 1599931360,
      "upvotes": 7,
      "replies": {}
    },
    "g4xhtny": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xhtny/",
      "text": "This differs based on the type of program you're in, but one of the best pieces of advice I got was to treat it like a job. Even if you don't need to go in 8-5 M-F, go in 8-5 and use down time to keep on top of your other tasks. It's not that you'll never need to go outside of that (you will) but it can be easy to to let yourself veg entirely during down time and this can snowball into having tasks built up, especially those outside of your direct duties (lab work, teaching responsibilities, etc).",
      "author": "crunkbash",
      "created": 1599919652,
      "upvotes": 7,
      "replies": {}
    },
    "g4xqivo": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xqivo/",
      "text": "I think the best thing to do is have clear boundaries, and have a sense of what your life ideally will look like.  For me, it was really important that I relax on my weekends, that I don't work nights unless I feel like it, that I spend time volunteering, etc., so I did.  I might not have published as prolifically as peers, but I lived a life I enjoyed, and that was very important to me.\n\nI think the other thing that helped me was to take more ownership of my work.  I think when you've been a student your entire life, it's very easy to depend on your professors and evaluations from other people to decide how you feel about what you've done.  But part of being an independent researcher is allowing yourself to evaluate yourself.  So in the end, I didn't really care what my advisor thought, if I was happy with what I had accomplished, that was good enough for me.  (Of course, I wasn't always happy, but then I got to decide if my expectations were reasonable, or I needed to work harder, rather than having to worry about the same for my advisor.)",
      "author": "cwkid",
      "created": 1599924054,
      "upvotes": 12,
      "replies": {}
    },
    "g4xpvs2": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xpvs2/",
      "text": "There is no escape, be ready for depression! (Half jokingly)",
      "author": "overlapping_gen",
      "created": 1599923740,
      "upvotes": 6,
      "replies": {
        "g4y22n3": {
          "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4y22n3/",
          "text": "Accurate because roughly a little over half of graduate students experience depressive episodes according to the journal report I read. Worse if you are a minority or underprivileged group.",
          "author": "riricide",
          "created": 1599928947,
          "upvotes": 2,
          "replies": {
            "g4yio0o": {
              "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4yio0o/",
              "text": "Does Asian counts as minority?",
              "author": "overlapping_gen",
              "created": 1599935461,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g52mb90": {
          "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g52mb90/",
          "text": "Amen to that. Most of the graduate students I know have had to take time off for depression in one way or form or another, myself included. I’m closer to the bitter end - 7 years in the Humanities",
          "author": "Vintage_IKEA1918",
          "created": 1599986484,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4xqism": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xqism/",
      "text": "Start a prophylactic course of Prozac!\n\n&#x200B;\n\nOn a more serious note, I would say two things helped me a lot:\n\n1) Sleep;\n\n2) Define schedules - it is easy to lose yourself when you do not have clearly defined schedules. A lot of motivation and self control is needed. \n\nOne more piece of advice: don't demand too much from yourself. It is a marathon and not a sprint. If things don't work out at the first couple of tries, don't discourage. You will get there eventually.",
      "author": "BlinkPT",
      "created": 1599924054,
      "upvotes": 5,
      "replies": {}
    },
    "g4yv3hh": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4yv3hh/",
      "text": "First: you need a therapist. Chances are your university will pay for it.\n\nSecond: never ever ever let yourself get isolated. Going out with friends once a week, even for just a beer, is essential to your wellbeing, and work should never get in the way of that.\n\nThird: research is hit or miss. At your level, luck plays a huge role. Don’t set expectations too high. You’re here to learn.\n\nFourth: if you can, and if that’s not already done, choose an advisor who cares.",
      "author": "p1mplem0usse",
      "created": 1599939774,
      "upvotes": 7,
      "replies": {
        "g52mw8q": {
          "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g52mw8q/",
          "text": "Great stuff here. My program takes about an average of 7 years - it’s getting hardest now (final year) and I was very careful about “choosing an advisor who cares,” but so many relationships change over that many years. Stay tuned into the institutional support - if your advisor and committee and cohort fails you at time it is good to have friends on the inside.",
          "author": "Vintage_IKEA1918",
          "created": 1599986718,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g4xi760": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xi760/",
      "text": "I agree with the previous posters about valuing your physical and mental health. When I was writing my dissertation, I had to schedule my time very carefully. I always put kickboxing and yoga on my schedule each week, and, when things inevitably had to budge, I protected my physical activities over literally everything else. That is how I survived the process.\n\nImportantly, I had (and still have) a great relationship with my advisor. She's communicative and kind. The effort I put into building and maintaining that relationship was worth it, and I still value it.",
      "author": "LucyQZ",
      "created": 1599919894,
      "upvotes": 4,
      "replies": {
        "g4xy1p3": {
          "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xy1p3/",
          "text": "Maybe it is because I'm in public health, but my advisor and supervisor have been super supportive and respectful of the time I set aside for exercise. When I first signed up for yoga classes, I was assertive about it. I let them know my availability was \"if need be\" at those times because the class was important to me and I had already paid for it. It has never been an issue and they will actually bring it up and offer to try other times, in situations where I would have been quite willing to skip a class.\n\nHaving been through my PhD mental health crisis, exercise was the single most important thing I did to make my therapy more effective, and it's the most important thing I do for myself now to hopefully avoid needing therapy again. Quitting exercise to have more time for my PhD would be about as effective as getting rid of my computer.",
          "author": "epieee",
          "created": 1599927291,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "g4xeev4": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xeev4/",
      "text": "Hey guy - applied bio-scientist here...The most helpful thing I could offer, is to recommend active stress management. i.e. adopt a set of habits that increase your stress threshold, and your ability to shrug stress off after it has happened. For me this came down to:\n\n1. Eating a daily probiotic - gut health man!!! Keeps the mind clear!\n2. Moderate daily exercise - like 30 minutes walking + some calisthenics.\n3. Vitamin D3 - supplement this if you are getting less than 4 hrs full sun per week.\n\nThe above three things, helped me stay sane when things were at their worst. More importantly, it helped keep my sleep regular.\n\nLast thing - don't work late night. There is no part of this journey that you can fix with one or two late nights. Rather, instead of working intensively, focus on working consistently. In my experience, you only have 4 to 6 hrs of real hardcore research energy in you each day anyway. Learn how to make this count, rather than pushing late hours.",
      "author": "scromboidfish",
      "created": 1599917370,
      "upvotes": 13,
      "replies": {
        "g4yacnp": {
          "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4yacnp/",
          "text": "i'm taking this advice. thank youuuuu, this is gold",
          "author": "Ok_Cranberry8872",
          "created": 1599932420,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4yohqs": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4yohqs/",
      "text": "This is fairly trivial but keep a journal and write down your moods. A small A6 will do. But it will help you identify trends in your mental state! It will also help you realize what triggers there are in your life and give you more tangible ways to help deal.\n\nAlso, get a SAD lamp. You’re going to be in doors a lot and missing out on sunshine. A SAD lamp can really help with that! A lot of ppl think that they are only necessary for seasonal depression but that isn’t true. The sun helps everyone’s mood especially if you have a desk job. I suggest using a SAD lamp instead of a regular lamp when working in the mornings.\n\nFinally, make sure that you talk about everything with your peers. Sometimes outside perspectives are really really needed.\n\noh, oh. always have ibuprofen and water with you. \n\n Congratulations and good luck!",
      "author": "MinervaMinkMink",
      "created": 1599937572,
      "upvotes": 4,
      "replies": {}
    },
    "g4ywlp4": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4ywlp4/",
      "text": "[Detox Your Writing](https://www.amazon.co.uk/Detox-Your-Writing-Pat-Thomson/dp/0415820847)\n\nI cannot recommend this book enough. When the going gets tough, this book is great for putting your head back on.",
      "author": "nnomadic",
      "created": 1599940334,
      "upvotes": 3,
      "replies": {}
    },
    "g4z3ml8": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4z3ml8/",
      "text": "Exercise. Nothing like pushing you body to give your mind a break. I spent my entire PhD powerlifting. There is something about dead lifting 500 lbs that gives you confidence to crush all challenges in your life.",
      "author": "trailblazery",
      "created": 1599942698,
      "upvotes": 5,
      "replies": {}
    },
    "g4z4c3v": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4z4c3v/",
      "text": "I foster the mindset that I may never finish my thesis. This radical thought forces me to enjoy the progress. Make it a habit to enjoy work and live a healthy life.\n\n*\"Let us prepare our minds as if we’d come to the very end of life. Let us postpone nothing. Let us balance life’s books each day … The one who puts the finishing touches on their life each day is never short of time.\" - Seneca*",
      "author": "blu3r4y",
      "created": 1599942921,
      "upvotes": 4,
      "replies": {}
    },
    "g4xnalb": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xnalb/",
      "text": "I went to therapy! Mental illness was really not focused on in my program (super problematic), but I made it a point to see my therapist every three weeks. It was nice to talk to someone who was outside of academia and could provide their own insight. My program was really toxic, so I’m glad I had the resources to do this. \nIt’s also important to get out of the realm of academia and have others outside of that that you can talk to. It’s easy to just stay in school and not know others outside of your program. So I also joined on-campus cultural clubs (I’m Asian), so I didn’t feel as alone in my program. It was a great way to make friends.\nI also started working out. I took fitness classes at the in-campus gym and off-campus yoga classes. Although I didn’t make friends besides the instructors, it was great to have something to look forward to so often.",
      "author": "Bookkeeper-Imaginary",
      "created": 1599922478,
      "upvotes": 7,
      "replies": {}
    },
    "g4xtsb2": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xtsb2/",
      "text": "Build a community around yourself intentionally. There are lots of opportunities for this when you’re starting out, but make sure to maintain it as you go as well. Hang out with your cohort, find postdocs and undergrads to connect to, join sports clubs and service activities. Invite people you don’t know that well to do stuff together, and find time to accept other people’s invites. Early on especially everyone is looking for new friends. \n\nCovid makes this harder, but for me it has been the most important buffer around my mental health. My grad school friends have helped each other navigate the university system, co-authored papers together, helped each other through breakups and deaths, commiserated over shared struggles, given pep talks around exams and defenses, and just generally made the gauntlet of a PhD more bearable and enjoyable all around.",
      "author": "plantsmakemehappy",
      "created": 1599925443,
      "upvotes": 3,
      "replies": {}
    },
    "g4xzf1w": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xzf1w/",
      "text": "Develop a support group outside of academia. I found that having a strong social group or close friends outside of academia really grounded me and gave me much needed reality checks. It also made me realize that I was hired to complete a job--to get a PhD and TA/teach while doing it--and that every job comes with some tension and drama. \n\nIn terms of work: set a schedule for work hours and stick to it. Give yourself breaks, but stick to the schedule. Begin building your CV from day one. \n\nGood luck!",
      "author": "gggggggggggfff",
      "created": 1599927855,
      "upvotes": 3,
      "replies": {}
    },
    "g4ythig": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4ythig/",
      "text": "get a pet!",
      "author": "juladaa",
      "created": 1599939249,
      "upvotes": 3,
      "replies": {}
    },
    "g4yzwir": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4yzwir/",
      "text": "Make friends!\n\nIt is a lonely, lonely time. Your loved ones will support you but they can't really understand. You need friends who are \"in\" it. \n\nOther PhD students. Ideally in your department. Even better if the have the same supervisor (help deciphering handwritten feedback?!). Make a regular date to get together for coffee. The stronger the community you build, the better you will cope.",
      "author": "SuperficialGloworm",
      "created": 1599941625,
      "upvotes": 3,
      "replies": {}
    },
    "g4x3gvm": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4x3gvm/",
      "text": "Try not to spend much time with the whiners on r/AskAcademia ;-)",
      "author": "Aubenabee",
      "created": 1599908006,
      "upvotes": 9,
      "replies": {
        "g4x4qc1": {
          "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4x4qc1/",
          "text": "Or /r/gradschool who want to be congratulated for doing the bare minimum.",
          "author": null,
          "created": 1599909354,
          "upvotes": 0,
          "replies": {
            "g4x7cwe": {
              "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4x7cwe/",
              "text": "Lol. Yup.",
              "author": "Aubenabee",
              "created": 1599911868,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g4ykr9n": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4ykr9n/",
      "text": "This thread is the best. Everyone always talks about how hard it will be, without showing this level of support. Thanks to OP for asking and to everyone who responded. This is super helpful!",
      "author": "flyingkittens123",
      "created": 1599936272,
      "upvotes": 2,
      "replies": {}
    },
    "g4z4t42": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4z4t42/",
      "text": "Make one or two close friends and actively make that into a healthy relationship. For example I always try to have lunch with one of my close friends from my cohort. We joke about our weekly struggles.",
      "author": null,
      "created": 1599943071,
      "upvotes": 2,
      "replies": {}
    },
    "g4zdmhb": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4zdmhb/",
      "text": "Set boundaries.\n\nMake sure you and your advisor come to an early understanding about your expectations of each other. Learn what your advisor expects of you as a student with regards to work output and time commitment, and ask them what you can expect of them as an advisor. If they have seemingly unrealistic expectations, it's likely that you'll be able to manage them effectively without overworking yourself. \n\nCodify work hours and stick to them. Grad school is a job. Once you've put in your hours for the day, stop work and go be a person. Working more hours does not mean you produce better work, in fact research shows the opposite is true.\n\nTake weekends off.\n\nThere will be exceptions to the above, of course, for example your advisor might need a few paragraphs for a proposal, you may have a deadline suddenly change, or your experiment stopped working one week before a conference. There will be times when you need to crunch in a heroic effort in a short amount of time. Once you push through these times, take a three-day weekend. \n\nThe Pomodoro method and instrumental music work wonders for productivity, as long as you respect the breaks. Read up on this method and you'll understand what I mean. \n\nHave an exercise routine, even if it's just walking around the block three times a week. You don't need to get swole, you just need to stay active.\n\nEat well. Drink water. I mean it. \n\nTalk to people as often as you can, especially during pandemic times. I used to dread lab meetings, but now it's a time to catch up with friends. If your meetings are all \"camera on\", put on some nice clothes. \n\nGet a good ergonomic chair and do your work at a desk. Don't just slump into the couch with a laptop for 8 hours a day, you'll wreck your back. \n\nIt's okay to take a mental health day once in a while. You don't even have to take a full day off.\n\nA day wasn't wasted as long as you accomplish *something*. Anything like \"I responded to emails\" or \"I gathered the papers I need to read this week\" are good, actionable tasks that you could check off from a list.\n\nIf you make to-do lists for work, make them achievable and detailed. Don't put \"write journal article\", instead break it down into the individual steps required. You'll get to tick off more boxes as you go, and it'll be more satisfying to progress. \n\nMake to-do lists for real life, too.\n\nMultiply your predicted time frame for any deliverable by 3.\n\nNetwork, and take advantage of any career resources your university offers. Make connections that will serve you well when you graduate. I've seen several colleagues go through their PhD staying laser focused on work, and when they graduate, they have a useless piece of paper and no leads on a job. \n\nPick up a hobby that requires some sort of investment. I know money is tight as a grad student, but by investing money into something, you'll naturally want to spend more time with it. Cooking is a good one, you need to eat anyway so why not throw a few extra dollars into better ingredients and some cookware and make excellent meals? It's important to have hobbies because my biggest piece of advice is...\n\nYOU MUST GROW AS A PERSON OUTSIDE OF GRAD SCHOOL. It's easy to fall in to the trap of making grad school your only personality trait. This is probably the worst thing you can do while you're in school.",
      "author": "Verdris",
      "created": 1599945841,
      "upvotes": 2,
      "replies": {}
    },
    "g4zj5iz": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4zj5iz/",
      "text": "Drop out of your PHD program and pursue a career. Getting a PHD is an astounding achievement, but you'll find more happiness in fast forwarding your career track to a job you probably would get with one anyway, and saving the money + time. Just on investment, the years of lost wages and tuition costs make it hard to get any return off a PHD unless you want to find yourself trapped forever in the college academic circle-jerk.\n\nTL-DR: Drop out, anything beyond a bachelor's is only useful if you plan to work at the degree-mill you got it from. Even then...",
      "author": null,
      "created": 1599947652,
      "upvotes": 2,
      "replies": {
        "g52ogvr": {
          "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g52ogvr/",
          "text": "Another way to say the same thing: don’t do this for any reason other than you are passionate about the work that you are doing and you feel deeply called and inspired to do it. There reward is the work and the journey and it will cost you a great deal, you will sacrifice things you didn’t realize you are sacrificing. I’ve been doing it alone though. I see people who are not in any financial stress with family money or spouses who support this process. You need to think seriously about your bigger picture. Don’t get stuck in the fence on year 2, just dig in our get out and don’t look back. I’ve wanted to quit every day (or at least once a week) for the past 6 years. Most people I know have a painful recovery period after when they are transitioning back to non PhD life. It’s ok to quit",
          "author": "Vintage_IKEA1918",
          "created": 1599987338,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4zl04w": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4zl04w/",
      "text": "I'd say don't tie yourself too rigidly to any specific career goal. Not to be defeatist -- I primarily want an academic job at a research institution after I graduate, and I'm working hard/smart to get there. That said, those jobs are crazy competitive and you aren't guaranteed one even if you do everything perfectly during your PhD. With that in mind, explore some other career options and talk to people who have taken a variety of paths after their PhD programs for perspective. Make sure that you're building the skills to veer off into different fields after you graduate.",
      "author": "iliveinsalt",
      "created": 1599948312,
      "upvotes": 2,
      "replies": {}
    },
    "g4zv6mg": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4zv6mg/",
      "text": "You must make sure your committee is providing clear expectations and not deviating from them. There must be no doubt in your mind that these people are on your side. There must be transparency in terms of what they are putting in their letters when it comes time for your job and fellowship applications.\n\nDon’t forget to enjoy yourself as much as you can, either. It’s a great honour and privilege to do a PhD and it should be enjoyed. There are great times during the program, too. Best of luck!",
      "author": "blueflood",
      "created": 1599951615,
      "upvotes": 2,
      "replies": {}
    },
    "g52dohs": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g52dohs/",
      "text": "I wish I had known sooner, but get a therapist before things get bad. There are resources available on campus, but if you are remote, then consider services like BetterHelp or TalkSpace.  \n\n\nMany therapists have gone through doctoral programs, so they understand how agonizing and financially distressing the process is, and they give you a space to talk it out and work out solutions for yourself. Even under the most ideal situations, each Ph.D graduate felt like the dissertation was an outrageous hazing process where our careers were being held for ransom unless we produced results. So, utilize therapists and counselors before things get stressful.",
      "author": "Silus-Uppercut",
      "created": 1599982878,
      "upvotes": 2,
      "replies": {}
    },
    "g4xr7ma": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4xr7ma/",
      "text": "First of all, it's so great that you are aware of potential concerns with mental health in your Ph.D. program, because there is so much you can do proactively to both protect your mental health and increase your feeling of well-being. My suggestions to you:\n\n* During this transition period to your Ph.D. program, focus on becoming adjusted to your new program, people, and surroundings. Yes, there will be plenty of work and there can be some learning curves. At the same time, this is an opportunity to establish friendships among your new peers and get to know your new city, if you're moving. Some of that is harder in the pandemic, making it more important for you to be intentional in your efforts to reach out and build connections. Ultimately, having these connections is both good in its own right, and builds a network of social support for when you experience challenges during your program down the line.\n\n* Know what makes you tick. Maybe it's exercise and fresh air, maybe it's cooking special meals, maybe it's artwork or another hobby. Whatever it is that makes you tick, make sure you make room for it still. It can be easy for a Ph.D. program to feel all encompassing, but these are years of your life, too, and it is important to make room for your full self.\n\n* Know when you've done enough and that pushing harder will not help. There is always more that you can be doing, and finding the line to stop at can be difficult in my experience. But sometimes, staying up later to crank out some more work leads to sleep deprivation, which leads to feeling tired and having difficulty focusing the next day. Have priorities (e.g., what must be done now, what can wait) and find a balance between getting your hands involved in the kinds of experiences you want and that will help you to develop your career, while also being open to saying \"no\" when you have enough on your plate.\n\n* Seek out therapy. Notably, you don't have to wait until you're experiencing a mental health crisis to go to therapy. The transition to your program--which, while a good thing, of course--is inherently stressful, and that is reason enough. You can work with your therapist to have a place to process what happens in your grad program and build skills that help you to cope with the ups and downs of your program.\n\nCongratulations on beginning your new program, and good luck!",
      "author": "jogam",
      "created": 1599924315,
      "upvotes": 2,
      "replies": {}
    },
    "g4y74lu": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4y74lu/",
      "text": "MD here, many friends PhD in life sciences and chemistry.  Have worked in about 6 labs myself, masters not PhD.\n\n1. It's cool to followup with a psychiatrist or psychologist as a preventative measure, sort of like an annual physical\n2. Set boundaries on work and home, with personal goals that are separate from work goals (e.g. train for half-marathon, body-building, etc)\n3. Socialize.  If you're a socially sensitive person (e.g. rejection hypersensitivity, social anxiety, dependent traits) take it slow and set realistic expectations.  But continue to explore and seek understanding of yourself as a social being.\n4. Don't do drugs or drink daily.  Happens to the best of us, drugs become a proxy for more sustainable sources of positive feelings, or an escape from negative feelings.  This kind of short cut inevitably backfires.\n5. Check-in with yourself daily.  Ask questions about how things are affecting you.  Connect with feelings rather than sequestering them outside of awareness\n6. Understand yourself as complex, with many parts\n7. Pride yourself on mental flexibility.  Be the kind of person who recognizes that what you believe is dependent on your exposure and experience, and who further understands that your exposure has necessarily been limited\n8.  Study the world outside your primary area of study.  The most successful academics and intellectuals have interests outside of their field; they allow themselves to nurture their other interests with the same seriousness that they bring to their principal work.\n9. Last for now: go easy on yourself.  Look for humor in setbacks.  Expect greater and greater experience of the bright side of life",
      "author": "sadpsychiatrist",
      "created": 1599931176,
      "upvotes": 2,
      "replies": {}
    },
    "g4ykhto": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4ykhto/",
      "text": "Sometimes you have whole months where you do no work, have no idea what your research even is, and feel like you have absolutely no business being a PhD student.\n\nThat’s normal. November 2014 to October 2015 was pretty much a write-off for me.",
      "author": "nashx90",
      "created": 1599936155,
      "upvotes": 1,
      "replies": {}
    },
    "g4z1kiz": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g4z1kiz/",
      "text": "Its all about your committee and modest research expectations. You need to have the majority, say 2 of 3 members, firmly in your corner and focused on you completing your degree. If there is ego based in fighting (there will be), you could be their pawn in a larger game you want no part of. If you bite off a “save the world/star researcher” project, you’re equally f ing yourself. Choose your squad and your dissertation project wisely and then heads down suck it up this too shall pass mentality. You don’t graduate, you endure.",
      "author": "rboller",
      "created": 1599942105,
      "upvotes": 1,
      "replies": {}
    },
    "g50bkmo": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g50bkmo/",
      "text": "Schedule everything possible - work, sleep, food, sex, study, teaching, writing, reading and 'me time' and make sure to stick to the schedule.\n\nAfter about a week, you will realize that keeping to a schedule is almost impossible.\n\nThen adjust your schedule as needed, but never skip the 'me time'. \n\nSeriously, make sure to take time off for yourself and never let that part of the schedule slip. The rest of the schedule can fall by the wayside, but keeping yourself sane (no matter how you do it) is the most important thing there is.\n\nFor me it is a photo walk or going fishing for an hour every Saturday morning.",
      "author": "avflinsch",
      "created": 1599957353,
      "upvotes": 1,
      "replies": {}
    },
    "g51225i": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g51225i/",
      "text": "Find a outlet, going a CrossFit gym, a fencing or climbing gym, (I now own a CrossFit gym so hey I’m biased), a pottery class, something that isn’t work and takes you away from you’re every day, where you aren’t doctor so and so but just some\nJoe with other joes taking about other things having a good time and escaping while having fun, but it needs to be regular and something you prioritize. I am a huge advocate for fitness obviously. But I spent 16 years in college and my mental health suffered during parts, and looking back those were the parts where I didn’t exercise my body like I was my mind. Even if you are new to fitness don’t be intermediated. \n\nHappy to talk more and even help you find a gym/community that would be a good fit for you if you want. \n\nYes the workload is a lot. But I have seen people with three kids get multiple terminal degrees from Harvard while pursing their own hobbies and passions too. It’s doable. Again happy to talk with you about how. \n\nBe multifaceted and live multidimensional life, don’t JUST be a PhD student.",
      "author": "Zhao5280",
      "created": 1599965423,
      "upvotes": 1,
      "replies": {}
    },
    "g52e31r": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g52e31r/",
      "text": "By dropping out right now and getting a job or an MBA.\n\nDid you see X-men?  You remember how Wolverine said \"You don't want what I've got?\"  Well.  You don't want what I've got.",
      "author": "Hermetic_Wisdom",
      "created": 1599983101,
      "upvotes": 1,
      "replies": {}
    },
    "g5691nr": {
      "link": "/r/AskAcademia/comments/irah9t/starting_a_phd_in_2_weeks_time_how_do_i_protect/g5691nr/",
      "text": "If you can afford it, save some money and see a consultant psychiatrist for an assessment and see him/her a couple of times a year.",
      "author": "Interesting_Craft_94",
      "created": 1600036765,
      "upvotes": 1,
      "replies": {}
    }
  }
}