{
  "sid": "fx0cr5",
  "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/",
  "title:": "PI requests I come into lab during COVID-19/Shelter-In-Place Order",
  "text": "Asking for advice of how to navigate this from other PIs?\n\nField: Physics\n\nTitle: Lab Tech\n\nCountry: USA\n\nBackground Information:\n\nPI alluded to, then straight up asked me (in private, over zoom), to come into the lab to resume the experiments during the COVID-19/shelter in place order in California. In the area I'm in, we're weeks out before the peak.\n\nI asked if we were even allowed, despite the order to *not* come in by the university president, but they respond with \"yeah, there are 'other' professors (cited only one) still coming in to do their work. They are just telling anyone that checks that it's \"essential maintenance\" of the lab\". They know I have a building key to get in.\n\nPersonally, I feel uncomfortable given that there's an active p a n d e m i c and the risk of exposure to my family/at-risk parents. I also feel like they are using my motivation and commitment to get data to publish/have publications for upcoming PhD applications.\n\nOn the other hand, I understand where PI is coming from, but only because they are pressured to have/present results in an upcoming meeting for federal funding. Given the track record of actions I've observed working with them over the past year, unfortunately, they seem driven by slight ego to prove their place in the field, since we're not at an R1 institution.\n\nAny tips to address this? I don't want to be completely blunt in my response because I do need their letter of recommendation later on/need them to have a positive view on my work before I leave.\n\nThanks in advance for reading this/replying(if you do) :)\n\n**TL;DR:** PI asking me to go to lab during pandemic, via loop holes, when I shouldn't. Tips?\n\n&#x200B;\n\n**EDIT:** Wow! Thanks again for all who are responding. Judging by how my PI is more focused on data right now, I think I have time to draft up response in writing. \n\nAlso, to clarify, the university has given out notices that the campus is closed, but is extremely vague when it comes to research personnel. It only states \"PIs should consider the necessity of on-campus research and implements plans to operate remotely to the greatest extent possible. Essential access, limited to sustaining research capability, will be authorized by the Office of the Provost in coordination with Deans.\" \n\nMy PI *says* that they have pushed for a clearer explaination, but haven't gotten any. Also they have said that the Department Chair and Dean have been working to determine essential employees, but haven't made the list available to everyone. On top of that, my PI alluded that they could get our lab and names on the list to make it easier to come to campus. \n\nLastly, to those who say to make sure I look for better PIs in grad school, I am definitely using this experience as a learning lesson haha Let this be a lesson for anyone reading this ",
  "author": "bbv27",
  "created": 1586323018,
  "updated": 1634081657,
  "over_18": false,
  "upvotes": 120,
  "upvote_ratio": 0.96,
  "comments": {
    "fmrmlgc": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmrmlgc/",
      "text": "You are a lab tech. I hope you don't plan on even thinking about joining this lab as a grad student as the PI puts work above your own life and well-being. how legal is it to go out there during the stay at home order and what the university president said? at my school no research is allowed unless it's COVID related (must be approved can't just be like \"oh ye my lab started this project\" no the whole department and school must know). This is an R1 in the US. \n\nBe completely honest and say you worry about your own health. just be kind about it. \"hello dr xxx, I'm sorry but I'm unable to perform the tasks assigned as I worry about the health and well-being of my family as well as myself during these trying times.\" something along those lines.",
      "author": "helpreddit12345",
      "created": 1586327950,
      "upvotes": 177,
      "replies": {
        "fmrprv5": {
          "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmrprv5/",
          "text": "This! OP, the reason your PI asked you in zoom was so that there would be no paper trail. When you email them with your concerns about the request and the conversation you had, see how quickly they will not respond to the email and call you about you \"misunderstanding\" their very reasonable request.",
          "author": "cat_barista",
          "created": 1586331030,
          "upvotes": 147,
          "replies": {
            "fms46nd": {
              "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms46nd/",
              "text": "Absolutely. PI will shit themselves by email and then probably chew you out via zoom afterwards, since they seem to be an absolute douche.",
              "author": "ardbeg",
              "created": 1586346014,
              "upvotes": 60,
              "replies": {}
            }
          }
        },
        "fmrxa8k": {
          "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmrxa8k/",
          "text": "This is the way to go. If your PI gives you a hard time after being polite and honest about your situation, I would write an email about this asshole and send it to the department chair, the head of HR at the university, and your dean/provost all at once so each other knows they received the email.   I am pretty sure that they would collectively deal with it.",
          "author": "TheProfessorO",
          "created": 1586338890,
          "upvotes": 29,
          "replies": {}
        },
        "fmsff4y": {
          "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmsff4y/",
          "text": "Yeah. Not a lab based science, but a fieldwork based one and everyone is at home. My professors are pushing back projects, negotiating with grant funders about timelines, and checking in on their students mental health. I’m still working because I do remote data collection over the phone, but all field work and travel related to work has been out to a stop and my department head has been emailing us every week to remind us we are not supposed to be on campus.",
          "author": "pepperonirollss",
          "created": 1586354335,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "fms5xja": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms5xja/",
      "text": "[deleted]",
      "author": null,
      "created": 1586347574,
      "upvotes": 98,
      "replies": {
        "fmslv4k": {
          "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmslv4k/",
          "text": "YES. Reference the Zoom call in writing.  Bring that shit back into the game because your PI was intentional in not wanting a paper trail. You're smarter than that.",
          "author": "kangarookarate",
          "created": 1586357980,
          "upvotes": 44,
          "replies": {}
        },
        "fmshagd": {
          "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmshagd/",
          "text": "This is a great way to handle it!",
          "author": "chameleonnz",
          "created": 1586355452,
          "upvotes": 10,
          "replies": {}
        },
        "fmsynau": {
          "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmsynau/",
          "text": "Thank you! I really appreciate the email template",
          "author": "bbv27",
          "created": 1586364056,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fms2202": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms2202/",
      "text": "Your PI's request is illegal. I think you have a responsibility to alert the department chair as well as perhaps the Human Resources office at your university.  I imagine the department chair would be able to give you good advice about whether to contact HR.\n\n**Edit:** Reading your post more carefully, am I to understand that your PI suggested that you can tell \"anyone that checks\" that you are performing essential lab maintenance?  Who does your PI think might check, exactly?  The only possibilities that occur to me are (1) university officials who notice activity in the lab, or (2) police who might stop you on the way to campus, so it seems to me that your PI has either encouraged you to lie to the university or encouraged you to lie to the police.",
      "author": "jimbelk",
      "created": 1586343917,
      "upvotes": 61,
      "replies": {
        "fms8cfx": {
          "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms8cfx/",
          "text": "This. The PI knows it's wrong.",
          "author": null,
          "created": 1586349520,
          "upvotes": 19,
          "replies": {}
        },
        "fmtd2v1": {
          "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmtd2v1/",
          "text": "My department gave me a letter to show to building security if they question my presence on site. However, my university has very clear guidelines and my chair is actively discouraging research and in-person activities and I haven't needed to use it.",
          "author": "alexa-488",
          "created": 1586370699,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fms71yb": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms71yb/",
      "text": ">\nOn the other hand, I understand where PI is coming from, but only because they are pressured to have/present results in an upcoming meeting for federal funding.\n\n**Everyone's in the same boat! NO ONE EXPECTS PRODUCTIVITY NOW, including agencies**. It's on him that he didnt get where he needed to be.  Fuck this guy for putting your health and societies needs  under his selfish career ambitions. In fact, he's using the competitive disadvantage of others.  Stay the fuck home.",
      "author": "lalochezia1",
      "created": 1586348508,
      "upvotes": 31,
      "replies": {
        "fmt3z0t": {
          "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmt3z0t/",
          "text": "100% this. I work for the feds, and we've been shut down for three weeks. All work has to be remote. Most of the projects I run are lab-based, and we all recognize progress has ground to a halt on them. What we do expect is for people to be writing papers, creating models, etc from home as long as they're being paid. Expectations are not of 100% effectiveness they would have had if they were working regularly, as well, since we're all stressed out and dealing with problems of our own.\n\nFor example, I have 6 hours of WebEx today compared to what would usually be 4 hours of meetings. They're also way more draining than a regular meeting (everyone please invest in a good microphone and don't use speakers to reduce echo for your meeting participants). This means I'm supposed to have 3 hours to do my own work, but I'm going to be so wiped out I'll be lucky if 1 of them is effective.",
          "author": "racinreaver",
          "created": 1586366492,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fms1xi5": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms1xi5/",
      "text": "Hard no. Your university has likely sent out letters for those considered essential and graduate students/lab personnel should be addressed.\n\nSend an email to the dean or department head and ask what the rules are — you should not go in.",
      "author": "franklikethehotdog",
      "created": 1586343787,
      "upvotes": 21,
      "replies": {}
    },
    "fms5vmd": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms5vmd/",
      "text": "This is fucking dispicable and a black mark on the profession.",
      "author": "Dr_Marxist",
      "created": 1586347527,
      "upvotes": 18,
      "replies": {}
    },
    "fmrpxrg": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmrpxrg/",
      "text": "Yeah, no. Tell him you've developed a cough and are worried you are already sick. He can drive to yours, collect the key and risk his own life.",
      "author": "nosleeptill8",
      "created": 1586331201,
      "upvotes": 28,
      "replies": {}
    },
    "fmrz0zo": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmrz0zo/",
      "text": "Have the order in writing.\n\nI am sure that as he is your boss, he can order you. Will he?\n\nOne important tell of an unlawful or unethical order is something the man who makes the order will not do himself, or he is reluctant to put it in writing.",
      "author": "lunaticneko",
      "created": 1586340760,
      "upvotes": 25,
      "replies": {}
    },
    "fms1olf": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms1olf/",
      "text": ">>Personally, I feel uncomfortable given that there's an active p a n d e m i c and the risk of exposure to my family/at-risk parents.\n\nWhat did he say in response to that?",
      "author": "bennyandthef16s",
      "created": 1586343538,
      "upvotes": 10,
      "replies": {
        "fmt83wj": {
          "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmt83wj/",
          "text": "Before the shelter in place order, but after other universities required research to stop, I expressed that I was uncomfortable coming in. (During that my PI wasn't even coming in bc their spouse came back from overseas and had to do self-isolation.) \n\nWhen I expressed that I shouldn't be coming in, they stated they understand and repeatedly said, \"You don't have to come in if don't want to.\" But still reiterated that we need the data for the upcoming meeting. So there still an underlying pressure to report to the lab",
          "author": "bbv27",
          "created": 1586368379,
          "upvotes": 5,
          "replies": {
            "fmt9rig": {
              "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmt9rig/",
              "text": "Ah, the classic \"I'm not telling you to but it would be great if you did\"\n\nTough spot. Sorry I don't really have advice for how you can get out of it.",
              "author": "bennyandthef16s",
              "created": 1586369143,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fmscv7c": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmscv7c/",
      "text": "This really pisses me off, and your PI is part of the problem with academia today.  This sounds like a typical psychopathic PI request - putting his/her own research ahead of the people who make it happen.  I think there are several things wrong with this request.\n\nThe first is the ethical and legality of the request.  A stay at home order in many states (California included, I believe) is an executive order, which means it's effectively law.  Is your PI willing to pay your fine if you get caught?  Is your PI willing to bail you out of jail if you get caught?  In my state, these are the consequences of getting caught, and it's not hard to get caught either.  If a cop pulls you over because of a broken tail light, and you're not supposed to be out, you could go to jail.\n\nI would also worry about working for any PI who places the health and welfare of his research team in such a low position.   On ANY research team, the most important resource is people.  Is your PI willing to sacrifice your life so that he/she can get another abstract at some conference that probably won't even happen?\n\nFinally, the whole idea of federal funding risk is overblown. The funding agencies are currently being quite flexible with the PIs at this time.  The NSF policy, for example, provides a tremendous amount of flexibility in terms of extensions, salaries, etc.  The NSF is even letting us charge cancelled trips to our grants.   If your PI is pressuring you with this, then I believe you are being mislead.\n\nIt's terrible when PI's abuse their people like this.  I would seriously consider finding another PI to work for.",
      "author": null,
      "created": 1586352725,
      "upvotes": 10,
      "replies": {}
    },
    "fms4z0w": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms4z0w/",
      "text": " In our uni researchers have been told to stop coming to campus unless there is critical maintenance organized at the department level. Labs freezers etc are being checked to maintain key supplies. I get the impact on grant and contract work as this will severly hurt a lot of research programs.  My concern here is the verbal ask without context of the university or department approach to research continuation.\n\n Are you an essential employee required to come to campus? Do you have a letter indicating it? Regardless you should express your concern in writing and concerns over the health of you and  your family.  If you are essential this could be very tricky... Follow up in writing with your concerns. If you get push back, I would look at uni policy and talk to HR for clarification on policies. There are some scenarios that make the ask reasonable, but I suspect your uni hasn't given clear orders to cease onsite research completely. Continuation of research right now is a bit ridiculous for non COVID projects if you can't do the work off site... If they have and the PI is ignoring orders, I would not risk my health or the ire of campus police to go in... If you get found you would need more than a Dr. So and so told me to come in...\n\nGood luck OP.",
      "author": "designchaos",
      "created": 1586346733,
      "upvotes": 7,
      "replies": {}
    },
    "fmsfk8m": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmsfk8m/",
      "text": "Obviously this is shady and you shouldn't go in.\n\nBut I'd suggest approaching this constructively. If the research really is that critical, then your PI should have no trouble coming up with an open, written plan to justify it, right? You shouldn't have to lie.\n\nMy lab stands to lose tens or even hundreds of thousands of dollars, especially if this is handled poorly. My PI actually takes safety seriously, though, so we shut down all lab operations a few weeks ago except for bare minimum equipment upkeep. Even for that, we wrote to the administration justifying why it needed to be done, and explaining how we would minimize the risk. There's a paper trail, and campus security knows who's allowed to be there, when, and why.\n\nWe hope to restart some of our research at some point, but we're not just doing it in the dark. My PI is working together with other PIs to put together a concrete plan. They're working on documentation to discuss the risks and come up with reasonable policies so that the most critical research can be done without unduly endangering students. The key is that this is all being done in the open, so they're genuinely weighing the risks and coming up with real plans to keep people safe.\n\nMy point is, if your research is critical and there's a way for you to continue it safely, then your PI should have no trouble justifying it to third parties, like your school's administration. Check if your school has some process in place for approving critical work. You could even offer to help your PI come up with a plan to do things safely.\n\nIf your supervisor refuses to even try to do this openly, then I would think you have even stronger grounds to refuse to go in.",
      "author": "xozorada92",
      "created": 1586354419,
      "upvotes": 7,
      "replies": {}
    },
    "fmsc6fx": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmsc6fx/",
      "text": "No letter is worth your personal safety. He is trying to exploit you and it is never worth it to accommodate this behavior because it will just escalate from here on out. \n\nI would email him a response citing that while you would very much like to work and be productive you cannot do so in good conscience for fear of infecting your elderly parents. Apologize and nope out. Assume this letter will be read by the Dean or department head and write it to show yourself in the best light. Once you have it in writing he is more liable and there isn't an easy way for him to push you into it. \n\nWhat's important here is do not concede to coming in _at all_. Not even for 1 day a week or \"just this week until we get this data\". No means no. Stand your ground. Once you cede even a little bit, it will be very difficult to say no to more.",
      "author": "riricide",
      "created": 1586352266,
      "upvotes": 6,
      "replies": {}
    },
    "fmsgs68": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmsgs68/",
      "text": "In our state, \"critical research\" is exempt from the lockdown, so essentially all research personnels have been deemed essential by the university and we have letters from the university in case we get stopped by the police. So literally we're all going in to work, albeit at part time and staggering shifts. As a grad student who's afraid of having my research delayed, this is definitely nice, but no one should be pressured to do something they're not comfortable with.",
      "author": "PumpkinCrumpet",
      "created": 1586355154,
      "upvotes": 6,
      "replies": {}
    },
    "fms5uba": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms5uba/",
      "text": "Several PIs are doing this. They dont belive people can work from home and are threatening sal cuts.\n\nHow I feel about this? I donno.",
      "author": "metaltemujin",
      "created": 1586347495,
      "upvotes": 3,
      "replies": {}
    },
    "fms98od": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms98od/",
      "text": "So no, they can't make you - call HR or a dean or whatever structures exist for that at your institution. Some operations will be deemed essential or whatever term they use, and if that lab work isn't, you don't have to go.\n\nOn the other hand, they can still be a shit about it afterwards.\n\nAll of this is assuming you aren't caring for animals as part of your work; though I know a lot of animal researchers that were planning to kill their subjects have been told to do it early.",
      "author": "ph0rk",
      "created": 1586350192,
      "upvotes": 3,
      "replies": {}
    },
    "fmsdmuo": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmsdmuo/",
      "text": "Fuck. That.\n\nBut be courteous and regretfully decline citing the potential danger to your vulnerable parents and yourself. And, when the opportunity arises, seek a better advisor/PI who cares about you.",
      "author": "WildlifePhysics",
      "created": 1586353223,
      "upvotes": 3,
      "replies": {}
    },
    "fmsiwke": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmsiwke/",
      "text": "I think you've gotten plenty of responses here telling you to say no, I would just add that the easiest way around this is probably simply to say you have at-risk family at home. I've had people try to push me to do things and the second I say I live with my immunocompromised elderly mother they drop it.",
      "author": "eta_carinae_311",
      "created": 1586356372,
      "upvotes": 3,
      "replies": {}
    },
    "fmsz1b1": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmsz1b1/",
      "text": "Honestly I doubt they are getting pressure for that Federal funding meeting? I've already heard from fed funders about covid delays and OMB has issued guidance on extending awards. It seems like if anything the feds are actually being somewhat understanding about research delays during all this. Just my experience tho maybe other agencies are functioning differently.\n\nEven besides this it's a stupid and potentially illegal request. Take care of yourself and tell your PI to pound sand.",
      "author": "a_large_plant",
      "created": 1586364234,
      "upvotes": 3,
      "replies": {}
    },
    "fmt0s3l": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmt0s3l/",
      "text": "I'm in a similar boat. My PI expects me a graduate student to go in and work under staggered schedules. The grad students had a meeting with our faculty rep where we asked for her to push for some top down direction regarding research during shelter in place but she kept pivoting. \n\nMy PI has barely even said anything to my lab during this time. I know other labs have completely shutdown and our rep even suggested that that was the norm and if any PI is \"forcing\" us to go in we should say something. While we aren't being forced we are operating under normal output expectations or so ot feels from my PI.",
      "author": "Pagi101",
      "created": 1586365029,
      "upvotes": 3,
      "replies": {}
    },
    "fmtark1": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmtark1/",
      "text": "I don't know about your university, but mine has made it clear that all non-essential research on campus (R1 USA university) was to halt until this has passed. Essential work had to get clearance from the University itself.\n\nI actually joined a zoom call with graduate college administrators detailing the resources available to grad students right now. I asked during that call what resources were available for those students who, inevitably, would have a PI who \"asks\" that they go in anyway. Their advice was to reach out to either the graduate college, provost, or office of research and they can put a stop to it. I'd imagine similar resources are available to you.",
      "author": "VortexLine",
      "created": 1586369611,
      "upvotes": 3,
      "replies": {}
    },
    "fmsxe8u": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmsxe8u/",
      "text": "I was asked to do the same by one of our PI's (citing that our research is \"essential\"-- it isn't, and definitely hasn't gotten approval). Luckily I have 2 PIs, and the other one stepped in. \n\nI would try talking to them about it first, but if that doesn't work and there's someone else you can reach out to in your lab who's \"second in command\" (e.g., a postdoc, affiliated professor, etc) talk to them about it.",
      "author": "kodakrat74",
      "created": 1586363490,
      "upvotes": 2,
      "replies": {}
    },
    "fmtb0rp": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmtb0rp/",
      "text": "You're a physicist... You're not viral at all",
      "author": null,
      "created": 1586369731,
      "upvotes": 2,
      "replies": {}
    },
    "fmt3vg5": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmt3vg5/",
      "text": "Unless something in the lab is going to be a safety hazard unless it's addressed, or you have animals or something to keep alive or something like that, then this does not seem to be reasonable. I would politely refuse (politely as in, be polite in how you state it, but do not come in) and send an email to the department or graduate office giving them a heads up.",
      "author": "Average650",
      "created": 1586366447,
      "upvotes": 1,
      "replies": {}
    },
    "fmtcone": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmtcone/",
      "text": "Fuck your PI lol",
      "author": null,
      "created": 1586370515,
      "upvotes": 1,
      "replies": {}
    },
    "fmublhn": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmublhn/",
      "text": "\"In view of the circumstances, fuck you, no.\" \n\nThis is ridiculous, entitled behavior from the PI, and not something you should put up with.",
      "author": "psstein",
      "created": 1586388205,
      "upvotes": 1,
      "replies": {}
    },
    "fmy7ng7": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmy7ng7/",
      "text": "This exact same thing happened to me! My pi kept suggesting I go to lab to work on things over text and would send me ideas and kind of say it’s ok if you don’t but still pressure me.. so I just started ignoring her texts and only communicating over email and she won’t say anything like that w a paper trail so she is off my back for now but it’s made me really question academia and also sad that she views her experiments > my life. Planning on leaving this lab as soon as this pandemic is over hopefully I can get another job though...\nGood luck to you and keep it on email!",
      "author": "isacademiaforme",
      "created": 1586479887,
      "upvotes": 1,
      "replies": {}
    },
    "fmrr6os": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmrr6os/",
      "text": "The situation isn't black and white.  Would you be alone in the lab?  Does the messagee from your university president discourage or forbid you from entering?  The exact wording is important here.  \n\nMy institute is *closed*: we can't even get in without an excemption letter.  However, I have colleagues in other countries in Europe whose labs aren't shut - they're almost all working from home, but they're allowed to go into the lab if it's important, as long as they can get there safely and remain isolated in their own area while there.  \n\nYou'll have to figure out for yourself whether this contravenes the regulations of your university and/or applicable laws, and whether it actually exposes you to more risk.  You should feel free to say no, if the answer to any of that is \"yes\".  \n\n\n> they are pressured to have/present results in an upcoming meeting for federal funding... they seem driven by slight ego to prove their place \n\nObviously I don't know you or your boss, but suggesting that it's ego-driven to want results for a funding meeting seems pretty out of line.  You're a lab tech: if your PI doesn't get funding in and publications out, then you don't have a job.  If it's important *and permitted* for this work to happen, then work with the PI to make sure the work happens.  If it can't be done by you, can he or someone else come into the lab and move things along with you directing them over the phone?",
      "author": "polyphonal",
      "created": 1586332493,
      "upvotes": -17,
      "replies": {
        "fmrrscv": {
          "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmrrscv/",
          "text": "being alone in the lab has nothing to do with it. the virus stays in the air. Look that up yourself if u don't believe me. It goes against everything I learnt really (a virus needs a host etc). It stays on surfaces for a relatively long time. Is OP just going to trust cleaning staff or a grad student wasnt there in the past 24 hours or pray they don't have COVID?\n\n&#x200B;\n\nsecond point, yea, that's great for your damn collegues, good for them. Guess what? There's a stay at home order. Guess what? when lives are on the line, we don't need physics research that isn't going to solve corona right now if it can't be done from home. It's actually illegal (jail and a fine) to work a non essential business right now. \n\n&#x200B;\n\neveryone doing experimental research right now is kinda on a pause. There's only so much you can write. Everyone that was doing that is probably done by now. If OP goes and risks himself, hey, he might not have a job, but at least he will be alive. \n\n&#x200B;\n\nOP don't listen to this person and dont worry. Even my PI (I'm just an undergrad so I only worked on average 10hrs/week) went to work every day even sunday 12 hours a day and even hes been home for over 2 weeks. Get it in an email please.",
          "author": "helpreddit12345",
          "created": 1586333120,
          "upvotes": 4,
          "replies": {
            "fmscbwm": {
              "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmscbwm/",
              "text": "OP shouldn't go in, but it is much a riskier choice if the university/govt hasn't taken the appropriate steps in shutting everything down, closing the buildings, and banning non essential personnel. Some universities are being wishy washy and leaving decisions for staff up to supervisors. OP has a lot less leverage to escalate the situation and a lot more risk to their job and income if that's the case. It's easy to say \"so what if I lose my job\" and walk away as  a part time undergrad, but OP might need that money for rent, food, etc (techs don't get paid much).",
              "author": "mediocre-spice",
              "created": 1586352366,
              "upvotes": 2,
              "replies": {}
            },
            "fmrsitt": {
              "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmrsitt/",
              "text": "If you read my comment, you'll notice I didn't say \"go in\".  I said: \n\n> You'll have to figure out for yourself whether this contravenes the regulations of your university and/or applicable laws, and whether it actually exposes you to more risk. You should feel free to say no, if the answer to any of that is \"yes\". \n\n\nIt's not just a matter of the personal opinion of OP, or random strangers on the internet.  It's up to the applicable regulations and laws.  If it is illegal or forbidden for OP to go in, then *that's* what OP's response to their boss needs to be based on.",
              "author": "polyphonal",
              "created": 1586333879,
              "upvotes": -6,
              "replies": {
                "fmrsvmp": {
                  "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fmrsvmp/",
                  "text": "nope. It isn't because of the personal opinion of OP or even the law actually. It has been declared that we have a pandemic. There is no vaccine. We don't even have a drug. The medical facts rule. Thus, it is not safe for OP to conduct what he/she is being asked to do.",
                  "author": "helpreddit12345",
                  "created": 1586334246,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fms21fp": {
          "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms21fp/",
          "text": "This. The real risk is nuanced.",
          "author": "bennyandthef16s",
          "created": 1586343901,
          "upvotes": -4,
          "replies": {}
        }
      }
    },
    "fms2vke": {
      "link": "/r/AskAcademia/comments/fx0cr5/pi_requests_i_come_into_lab_during/fms2vke/",
      "text": "Ask HR.",
      "author": null,
      "created": 1586344746,
      "upvotes": -4,
      "replies": {}
    }
  }
}