{
  "sid": "bdcrlv",
  "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/",
  "title:": "Academics on twitter, has social media benefited or damaged your writing in any way?",
  "text": "I used to read a lot of books, but I seem to spend a lot more time on twitter these days. Consequently, I'm now used to digesting information in small bites. And sometimes without context. \n\nSo, I'd like to know if social media has impacted your focus or writing in any way. I ask because I feel as though my attention span is suffering, and I'm very concerned it's because of my time spent online.",
  "author": "crashedhermit",
  "created": 1555309144,
  "updated": 1634081565,
  "over_18": false,
  "upvotes": 127,
  "upvote_ratio": 0.98,
  "comments": {
    "ekxdjcr": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxdjcr/",
      "text": "Immensely damaged. At first I thought it was my assigned readings and papers that were killing my desire and ability to read and write for pleasure, but now I think it’s social media. I have NO attention span compared to just five years ago, and though I barely post I spend a lot of time scrolling, and now struggle with something like a book that doesn’t jump from topic to topic every few seconds. I’m still trying to find a way out that gives me my brain back but doesn’t leave me totally disconnected from the internet/news/world.",
      "author": "NotMyPotOfTea",
      "created": 1555313668,
      "upvotes": 135,
      "replies": {
        "ekxhqil": {
          "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxhqil/",
          "text": "I have the same feeling about my own intellectual development.  In a way, I'm glad to see that this feeling is shared by others.  Makes me wonder if academic production *itself* will evolve as more of us find ourselves with shorter attention spans.  \nThat would, I suppose, be nothing more than the continued evolution of the scientific \"work\" from monograph to journal article...to tweet...to emoji  :O",
          "author": "McDoof",
          "created": 1555321448,
          "upvotes": 34,
          "replies": {}
        },
        "ekxqpiw": {
          "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxqpiw/",
          "text": "I can't hear you over the sound of my loud redditing.",
          "author": "makemeking706",
          "created": 1555333072,
          "upvotes": 24,
          "replies": {}
        },
        "ekxrkr2": {
          "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxrkr2/",
          "text": "I put myself into rehab for that. Found that I couldn’t even pay attention to a full news article anymore. So I progressed from reading things online that required the brainpower of a fruit fly, to reading actual books on a kindle, and finally back to reading real books. For me, that meant reading fan fiction, which lead to me finally being able to concentrate through a serious online article (I think because I simply got used to reading online in long format again), then graduating to fiction and non-fiction, and now I’m reading torturous legal texts for school.",
          "author": "larkscope",
          "created": 1555333860,
          "upvotes": 15,
          "replies": {
            "ekxu89d": {
              "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxu89d/",
              "text": "I think I need to do this. I literally cannot concentrate for more than 5 - 10 mins when I'm trying to revise notes for school becuase I just want the important information, NOW. never even occured to me that it was because I had trained myself to digest information in 140 character bytes. Did you quit social media cold turkey? I have been thinking of trying to go social - media free this summer, this may be the push I need to do it.",
              "author": "vector_detector",
              "created": 1555336041,
              "upvotes": 8,
              "replies": {
                "ekxuea5": {
                  "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxuea5/",
                  "text": "I did... but obviously I’m back now. Haven’t found it’s made things more difficult now I use it again. Probably because I regularly read 100+ pgs a week for classes.",
                  "author": "larkscope",
                  "created": 1555336171,
                  "upvotes": 5,
                  "replies": {
                    "ekxukzl": {
                      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxukzl/",
                      "text": "Awesome, thanks for the insight. Considering I am on reddit right now rather than preparing for the final I have in two hours, I think this is the reality check I needed.",
                      "author": "vector_detector",
                      "created": 1555336316,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ekxuv8z": {
          "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxuv8z/",
          "text": "I think Reddit provides me the same issue.",
          "author": "PM_MOI_TA_PHILO",
          "created": 1555336540,
          "upvotes": 9,
          "replies": {
            "ekxwg0p": {
              "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxwg0p/",
              "text": "I was thinking the same thing as I skipped over the longer comments on this thread.",
              "author": "Argos_the_Dog",
              "created": 1555337748,
              "upvotes": 7,
              "replies": {
                "ekyn1so": {
                  "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekyn1so/",
                  "text": "At least it's not as bad....",
                  "author": "Blinkinlincoln",
                  "created": 1555354776,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "ekyqrv6": {
          "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekyqrv6/",
          "text": "I use Cold Turkey to block all social media until the evening. The last thing you want is wasting your mental energy in the morning when you are at your most fresh and alert.  I try as much as possible to browse all social media in a single pass to avoid damaging my attention span. Works well for me.",
          "author": "therealindiansniper",
          "created": 1555357038,
          "upvotes": 9,
          "replies": {}
        },
        "ekxjzt0": {
          "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxjzt0/",
          "text": "I feel this deep down in my soul....\n\nI get anxious after 5 mins and always have to do a quick walk around my house as a result. But this might be an undiagnosed disorder lol.",
          "author": "Aahhhanthony",
          "created": 1555325232,
          "upvotes": 3,
          "replies": {
            "ekyn2uq": {
              "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekyn2uq/",
              "text": "Yeah that's anxiety my friend",
              "author": "Blinkinlincoln",
              "created": 1555354793,
              "upvotes": 2,
              "replies": {
                "el112kf": {
                  "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/el112kf/",
                  "text": "Yeah :( i know.",
                  "author": "Aahhhanthony",
                  "created": 1555430851,
                  "upvotes": 1,
                  "replies": {
                    "el14p7r": {
                      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/el14p7r/",
                      "text": "In your case tho maybe it's not general anxiety, maybe it's just because of certain things like the internet",
                      "author": "Blinkinlincoln",
                      "created": 1555433001,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ekxjtq0": {
          "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxjtq0/",
          "text": "Saaaaame, still struggling with this problem",
          "author": "KritDE",
          "created": 1555324978,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ekxccq7": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxccq7/",
      "text": "[deleted]",
      "author": null,
      "created": 1555311678,
      "upvotes": 30,
      "replies": {
        "ekxma02": {
          "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxma02/",
          "text": "How long would you say it took from the original disconnect from the online world to regaining your skills?",
          "author": "metafizzishin7",
          "created": 1555328335,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "ekxkm7k": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxkm7k/",
      "text": "Deleting Twitter app was an immense boost to my mood, productivity and motivation. I was subscribed to a lot of big researchers and successful PhD candidates/students as a way to seek motivation myself being a PhD student. Instead I felt quite intimidated and got the opposite effect. It varies a lot from person to person, but I feel better without Twitter. I still have my account and occasionally go there but not everyday and certainly not for long.",
      "author": "m_namejeff",
      "created": 1555326140,
      "upvotes": 23,
      "replies": {}
    },
    "ekxlmsi": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxlmsi/",
      "text": "[This article ](https://www.google.com/amp/s/amp.theatlantic.com/amp/article/306868/) addresses your post in a great way. I don’t necessarily agree with the entire thing, but it’s still a standout piece of writing a decade after it was written. I think it’s only gotten more relevant with the rise of social media.",
      "author": "wayfaringsarah",
      "created": 1555327515,
      "upvotes": 11,
      "replies": {}
    },
    "ekyvnqb": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekyvnqb/",
      "text": "Academia has damaged my writing.",
      "author": "brookish",
      "created": 1555360017,
      "upvotes": 8,
      "replies": {}
    },
    "ekxfwl2": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxfwl2/",
      "text": "[deleted]",
      "author": null,
      "created": 1555318004,
      "upvotes": 24,
      "replies": {
        "ekytwde": {
          "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekytwde/",
          "text": "I like this, thanks.",
          "author": null,
          "created": 1555358947,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ekxej4r": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxej4r/",
      "text": "Definitely not. Even though I am in different types of social media, I still read quite a lot. \n\nWhat made the biggest damage was learning new languages. Each one has a different way to organize ideas and thoughts, and I realized that I have trouble keeping the same type of framework for organizing my ideas throughout any type of writing. Other people probably don't notice, or just think that I'm not so good at writing in general, but I can see the little \"invasions\" from other languages into my writing that makes it bad.",
      "author": null,
      "created": 1555315440,
      "upvotes": 12,
      "replies": {
        "eky9dca": {
          "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/eky9dca/",
          "text": "> can see the little \"invasions\" from other languages into my writing that makes it bad\n\nIt may be that you only recognize them as \"invasions\" because you can see them; for other people it's just a stylistic quirk that does not necessarily make the writing bad.\n\nMany European writers of the past were bilingual, sometimes with different \"high\" and \"low\" languages. They would speak in Czech but write in French, or speak in French but write in Russian, or speak in Russian but write in English etc. Through that, they would bring grammatical and semantic features of one language into the other one. And so what? They are now regarded as classics, and nobody cares. But if you look closely, sure, you can see the influences.\n\nYou are probably all right. Don't worry.",
          "author": "ampanmdagaba",
          "created": 1555346450,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "eky5atg": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/eky5atg/",
      "text": "I think social media, especially Twitter, have benefited my writing but not my reading. \n\n4-5 years ago, to improve my contact networks and communicate my research outside the university (and even outside my country) I had to force myself to write concise and self-explanatory tweets in a language I was not fluent. The informal communication on Twitter has helped me a lot because I did not feel judged for my language skills or my low academic background and I could express myself freely.\n\nHowever, I have the same attention span as a cat... I have always had this problem and I think the Internet and social media have made it worse. I find reading papers and books very difficult, my mind keeps drifting from the content on the pages. I tried to fight against it and I lost miserably, so I am using a different approach now: I jump from one task to another and then back. I start reading a paper, when I lose focus I do something else (e.g. check the emails), then I go back to the paper. Somehow it works.\n\nI have this problem only with academic publications though, especially when they do not go to the point. I suppose social media influenced me in this as well, making me (too) pragmatic and seeking for information I can use straight away.\n\nI don't check my social media accounts often, so they don't usually interfere with my work. Some of my friends have that problem and I know they use apps or browser plugins that do not allow them to browse or to check the phone for a certain time.\n\nSo... I think social media helped me out a lot but they have their side effects too.",
      "author": "memotak",
      "created": 1555343863,
      "upvotes": 5,
      "replies": {}
    },
    "eky92a0": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/eky92a0/",
      "text": "Social media (mostly twitter, and to a lesser degree - reddit) benefited my writing a lot. I tend to go on tangents, and write too much; my emails are hard to read, they are always too long. Twitter helps me to write shorter, punchier paragraphs; something I always struggled with in the past.\n\nReddit, on the other hand, helped me to write faster. As a non-native speaker, that's where I learn to write. Also, that's where I pick the non-academic lingo, and current cultural trends.\n\nTwitter also helps me to stay in touch with the literature. The trick is to craft a highly curated list of people to read, and not follow anyone (or almost anyone) for purely social reasons.\n\nAs for reading, just turn the computer off, and hide the phone. You can immediately read a book.\n\n(See, again, I wrote too much, and went on two tangents =) Twitter is great.)",
      "author": "ampanmdagaba",
      "created": 1555346260,
      "upvotes": 6,
      "replies": {}
    },
    "ekypimd": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekypimd/",
      "text": "I'm not on Twitter. However, as a non-native speaker, my heavy redditing has certainly improved my academic writing in English.",
      "author": "Dr_Gerhard",
      "created": 1555356268,
      "upvotes": 6,
      "replies": {}
    },
    "eky1rps": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/eky1rps/",
      "text": "I stay away from social media as much as possible (probably about 30 min total a week?) It’s largely a cesspool of annoying people talking at each other or marinating in their own incestual circles. There are so many other things that make for a much more productive use of my time.",
      "author": "AnonBizPhD",
      "created": 1555341551,
      "upvotes": 3,
      "replies": {}
    },
    "ekynysa": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekynysa/",
      "text": "So I'm *definitely* more active than the average academic on social media- people will ask me about Reddit stuff at conferences who I've never met before.\n\nHonestly, I think it has overall been beneficial for me, because I wouldn't have worked with my current supervisor had we not been in touch over social media (mainly Twitter) after meeting at a conference early in my PhD.  Some people have been critical about my social media presence, but they've frankly been the \"old guard\" who dislike outreach in general.  I'm never going to have everyone like me, so try not to worry about it much.\n\nI do feel like I do have a better broad general knowledge of astronomy though for having come onto Reddit so much and talking to the public about it!  So that's been great.",
      "author": "Andromeda321",
      "created": 1555355350,
      "upvotes": 3,
      "replies": {}
    },
    "ekxi82u": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxi82u/",
      "text": "Not at all. I love reading, and will happily sit down for a day with a book at any given opportunity. Twitter etc is useful, but it's a very different format, and should be used as such. In the same way that writing a piece for an audience of the general public is totally different from writing a piece for a journal.",
      "author": "OrbitalPete",
      "created": 1555322328,
      "upvotes": 2,
      "replies": {
        "el2tigp": {
          "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/el2tigp/",
          "text": "Hi same.",
          "author": "musicallymaria24",
          "created": 1555474204,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ekyiyty": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekyiyty/",
      "text": "considering I have been scanning Latin verse for two hours and am periodically checking my reddit..... yeah, I guess it does affect my attention span.\n\n&#x200B;\n\nJokes aside, I truly believe switching to my phone/pc for entertainment/information has shot my capacity to focus for longer periods of time...",
      "author": "alli_golightly",
      "created": 1555352328,
      "upvotes": 2,
      "replies": {}
    },
    "ekxivls": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxivls/",
      "text": "I, like another commenter, think some of my decline in attention is age-related. As for Twitter, I never use it. I honestly cannot read all the shorthand people use. It often looks like gibberish to me and I lose interest. I've tried a number of times and simply cannot successfully engage with Twitter as a medium.",
      "author": "whats_it_to_you77",
      "created": 1555323463,
      "upvotes": 3,
      "replies": {}
    },
    "ekygkr9": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekygkr9/",
      "text": "It has definitely been beneficial. When properly used, Twitter is extremely educational and can be a good idea of research ideas, useful sources, and new information about best practices in methods. Also, I don't believe there's any consensus that social media negatively impacts one's attention span. There are a lot of other variables to consider, including burnout.",
      "author": null,
      "created": 1555350854,
      "upvotes": 1,
      "replies": {}
    },
    "ekzb8gw": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekzb8gw/",
      "text": "I think the internet/smartphones in general are basically slowly destroying my ability to read and think. As a kid I'd read whole books cover to cover in one day. In the beginning of undergrad I could plow through a homework assignment in one sitting. Now as a 4th year PhD student I can barely even read a \"light reading\" book more than a few pages at a time, let alone a journal article or long-form academic text. My eyes glaze over after 1-2 sentences. I can still talk about science and understand and learn that way, but I feel like I've become functionally illiterate - I can read the words but have about 5% retention. Apparently I write well but it's hard to write a well-researched paper when I can barely read my references.\n\nMy mental health has never been great but it's been on a steady downward trend for the past ~8 years so that certainly doesn't help. I wonder if I need to get evaluated for adult ADHD or if it's just the internet.",
      "author": "zirchron",
      "created": 1555371730,
      "upvotes": 1,
      "replies": {}
    },
    "el2swf6": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/el2swf6/",
      "text": "The perfect thread. For me it actually oddly benefited my writing and texting, it also decreased my loneliness and it is nice to know. There is always people that will support me. \n\n\nMy issues with Twitter is my college peers at this rate. I let them find it and sometimes they don't agree with me, people got mad at me I was really vocal and dragged in fustration over how I got treated at this school.  I am no way politically correct and that is what is hurting me and gets me in trouble a lot. \n\nMost of my peers wanna have the right opinion about me even after getting in trouble with the student code,  which we are trying to appeal.  No one wanted to here me out, yes legal action within the school got taken. I am getting somewhere. \n\nIt left me frustrated because I tried a discord to reach out and talk, I just decided to drop everything. People still wanna bickery. On my end I am on the verge of snapping at them that is why I left and blocked people off, I thought this is the right action. \n\nI am narrowing it down to sensitivity is affecting my friendships.",
      "author": "musicallymaria24",
      "created": 1555473668,
      "upvotes": 1,
      "replies": {
        "el2t8z6": {
          "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/el2t8z6/",
          "text": "People at my college wanna have the politically correct opinion it is just anyonning.  I gotten personally attacked online, my peers don't even want me to use it to defend myself. .\n\nThe times that I have actually done it, just recently I got someone to help me out and it has worked thus far in getting abusive comments flagged and reported. Just as an update, external source is on this case for me, now anyone that tries anything is dead blocked over an opinion. I am feeling some actual relief.\n\nSchool is rich get a good stalking system lmao.",
          "author": "musicallymaria24",
          "created": 1555473974,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ekxnh65": {
      "link": "/r/AskAcademia/comments/bdcrlv/academics_on_twitter_has_social_media_benefited/ekxnh65/",
      "text": "Nah bro my writing is lit fam.",
      "author": "Grumblepuffs",
      "created": 1555329762,
      "upvotes": -4,
      "replies": {}
    }
  }
}