{
  "sid": "pr8xog",
  "link": "/r/AskAcademia/comments/pr8xog/doctoral_fellowship_should_it_be_cited_as_funding/",
  "title:": "Doctoral fellowship. Should it be cited as funding source for a journal article that has nothing to do with the thesis?",
  "text": "I have a doctoral fellowship provided by my country's government through a body called UGC that regulates universities. I am in my 1st year and my thesis topic isn't decided. I had also submitted  a paper wherein i declared that I did not receive any funding for the particular paper. Did i do the right thing? If not, what repercussions are there for it?",
  "author": "pkjapanlover",
  "created": 1632061618,
  "updated": 1634078928,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "hdgw2bo": {
      "link": "/r/AskAcademia/comments/pr8xog/doctoral_fellowship_should_it_be_cited_as_funding/hdgw2bo/",
      "text": "Check with you advisor.\n\nGenerally, if an external group is proving funding, you should acknowledge it. If it is internal, it varies.  This one, depends on how it is viewed.\n\nIf you submitted the paper for review, chances are there will be opportunities to update if needed. If a journal, you can reach out to the editors. If a conference, similar.",
      "author": "rgbhsv",
      "created": 1632063203,
      "upvotes": 9,
      "replies": {}
    },
    "hdh4fki": {
      "link": "/r/AskAcademia/comments/pr8xog/doctoral_fellowship_should_it_be_cited_as_funding/hdh4fki/",
      "text": "Generally if you are funded by an agency they want to be acknowledged. If the funding is non specific on topic but is paying you to just generally do research,  this will usually holds. I tend to be generous with funding acknowledgments to be on the safe side.  \n\nAs for repercussions, this could reflect poorly on you or your PI as if you do not want to give the funding agency credit for their support. In a practical sense, the repercussions are probably minimal.  Maybe the funding source reminding you to include them in the future.",
      "author": "grounded_out",
      "created": 1632066768,
      "upvotes": 4,
      "replies": {}
    },
    "hdgsq59": {
      "link": "/r/AskAcademia/comments/pr8xog/doctoral_fellowship_should_it_be_cited_as_funding/hdgsq59/",
      "text": "It's best to discuss this with your supervisor",
      "author": "DeepSeaDarkness",
      "created": 1632061769,
      "upvotes": 3,
      "replies": {}
    },
    "hdi43ah": {
      "link": "/r/AskAcademia/comments/pr8xog/doctoral_fellowship_should_it_be_cited_as_funding/hdi43ah/",
      "text": "Having it on there is advisable in my opinion, but I would follow the recommendation of the other comments and check with your advisor to be sure.\n\nIn my case, I performed some analysis for collaboration projects and then always included the funding source that paid for my salary during that time.",
      "author": "StabilGlidare",
      "created": 1632080928,
      "upvotes": 1,
      "replies": {}
    },
    "hdi4myh": {
      "link": "/r/AskAcademia/comments/pr8xog/doctoral_fellowship_should_it_be_cited_as_funding/hdi4myh/",
      "text": "If your fellowship pays for either your salary or costs of your work, then yes you did the wrong thing. Repercussions? Unlikely to be much. If the paper isn't published yet you can just correct it, if it is published you may need to approach the editor and ask for a correction. You should discuss with your supervisor - they should have picked up on it and ultimately they're responsible for your work as a student, so this is their mistake more than yours.",
      "author": "ACatGod",
      "created": 1632081139,
      "upvotes": 1,
      "replies": {}
    }
  }
}