{
  "sid": "qqknug",
  "link": "/r/AskAcademia/comments/qqknug/endnote_x9_help_needed/",
  "title:": "EndNote X9 help needed!",
  "text": "Hello, I'm not really sure if this is the correct place to ask but I'm hoping someone here may have had a similar experience and can help me!\n\nI'm using EndNote X9 to manage references for my PhD thesis and when trying to update a reference this morning the word document I was working on seems to have locked itself. The document is only for a single chapter and doesn't have many references added yet so it's not an issue of being overloaded with references. All other word documents are completely fine so the issue is with this one document. When I right or left click on it, it just dings and the window itself can't be dragged/moved. I also have no way of closing the document. EndNote appears to be working fine. \n\nHas anyone ever experienced this before and was there a solution? I've done a lot of tedious work on this chapter today and I'm not confident on when I last saved it so I'm desperately trying to avoid restarting my computer if at all possible!",
  "author": "shann05",
  "created": 1636513793,
  "updated": 1636654659,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hk1h94c": {
      "link": "/r/AskAcademia/comments/qqknug/endnote_x9_help_needed/hk1h94c/",
      "text": "I’ve gone through tons of problems with word on windows when I was writing my dissertation. So much so that I switched to a Mac after my first year. \n\nTry printing it out at least so you have a copy. Also you could take photos of each page if you can see them. Then when you have a copy you can restart.",
      "author": "ProfAbroad",
      "created": 1636527403,
      "upvotes": 0,
      "replies": {
        "hk1nvue": {
          "link": "/r/AskAcademia/comments/qqknug/endnote_x9_help_needed/hk1nvue/",
          "text": "Unfortunately I couldn't scroll either, it was like word had frozen but just for that one document. I ended up restarting and thankfully I had saved it more recently than I thought so I didn't lose all my work but still enough to be pretty frustrating. \n\nMy laptop is a Mac but I've been doing most of my writing recently on my desktop which is a PC. After this incident I might look into connecting my laptop to the desktop computer screen and using that instead. My Mac never had any issues handling my literature review and this chapter barely has a fraction of the references.",
          "author": "shann05",
          "created": 1636532635,
          "upvotes": 1,
          "replies": {
            "hk4mbk0": {
              "link": "/r/AskAcademia/comments/qqknug/endnote_x9_help_needed/hk4mbk0/",
              "text": "Today windows is probably better than when I was doing my PhD. However when I got my Mac I got a time capsule and was doing hourly backups and everything worked fine. Now I have triple backups of everything. I use a syncing program for files between three computers, I have a hard drive local backup with time machine and I have an online backup system. The data and writing on my computer is basically my livelihood so it’s worth protecting.",
              "author": "ProfAbroad",
              "created": 1636583592,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk1r8cu": {
      "link": "/r/AskAcademia/comments/qqknug/endnote_x9_help_needed/hk1r8cu/",
      "text": "Not much help, I'm afraid, but I had so many problems with EndNote that I switched to Zotero. Also, from now on, I suggest you write continuously against the cloud (Box, Dropbox, or other). ALL computers break down someday, and just like cars don't break down in the garage, they all break down on the road, computers break down when we work on them. These days I can spill coffee all over my laptop, move to any other computer and not lose a minute of work.\n\nEnd of sermon. Good luck!",
      "author": "molobodd",
      "created": 1636535561,
      "upvotes": 0,
      "replies": {
        "hk1s0it": {
          "link": "/r/AskAcademia/comments/qqknug/endnote_x9_help_needed/hk1s0it/",
          "text": "I usually do have auto saves connected so I was really kicking myself that I for some reason hadn’t set it up for this chapter. Don’t worry, it was the first thing I did when I got it back up again. \n\nAnd thanks for the tip about Zotero, I’m only a few months out from submission and my EndNote library is too established to change for my thesis but I’ll definitely keep that in mind for the future",
          "author": "shann05",
          "created": 1636536252,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}