{
  "sid": "rht1zr",
  "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/",
  "title:": "Finished highschool and dropped out of college (no bachelor's degree). I want to do my master's and then a research to get a PhD. Is a bachelor's degree mandatory?",
  "text": "After finishing highschool, I dropped out of college in my first year due to personal issues (depression, no interest in subjects, etc). I'm currently doing a course in animation and I'm also doing several other courses online and offline, but none of them give me a bachelor's degree. I don't wanna remain a college dropout though, I wanna get into research and hopefully get a PhD, but for that, a master's degree is necessary. I'm not very interested in getting a bachelor's degree course and \"wasting\" 3-4 years of my life there. I'm 20 already, so I must take decisions quick. Since I'm not interested in getting a bachelor's, can I directly get into a master's course with my other course certificate and work experience? Is it even possible and does any college even allow that?",
  "author": "3DLE",
  "created": 1639668461,
  "updated": 1639787268,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.25,
  "comments": {
    "hosgk5x": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosgk5x/",
      "text": "Yes, a bachelor's is the first step. You aren't prepared for a master's.\n\nAnd you have all the time in the world. 20 is still practically a child.",
      "author": "CerebralBypass",
      "created": 1639668686,
      "upvotes": 68,
      "replies": {
        "hoshehk": {
          "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hoshehk/",
          "text": "But I'm already doing a course (which is for 6 hours a day and 5 days a week, for 3 years) in animation, and by the time I finish it, I'll be 23. I can't do this course and a bachelor's degree simultaneously. I would prefer to get into masters right after I finish from the course (although I'm not sure if it's possible) in a same field of course. Maybe I will be prepared for master's by that time.",
          "author": "3DLE",
          "created": 1639669025,
          "upvotes": -24,
          "replies": {
            "hoshrcx": {
              "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hoshrcx/",
              "text": "You won't. You're learning a technical skill, which is good, but not the skills needed to be an academic. It won't even prepare you for something like a MFA - because you won't have the requisite skills and knowledge.\n\nEven 23 is nothing.",
              "author": "CerebralBypass",
              "created": 1639669172,
              "upvotes": 47,
              "replies": {}
            },
            "houms1n": {
              "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/houms1n/",
              "text": "If time is an issue for some reason, you may need to prioritize whichever thing is better for your career. As you said, this isn't getting you a 4-year degree, so is it a higher priority? If so, why?\n\n\nBut seriously, 23 is nothing. That's the age when I went back to undergrad, and I know at least two PhD students I've had courses with who are in their 30s. I'm sure there are folks when older than that; professional degrees aren't limited to 21-year-olds.",
              "author": "torgoboi",
              "created": 1639699981,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hoskkum": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hoskkum/",
      "text": "You aren’t getting to graduate school without a Bachelors. Full stop.\n\nIt doesn’t matter if you feel prepared. A BA or BS is required.",
      "author": "cropguru357",
      "created": 1639670292,
      "upvotes": 53,
      "replies": {}
    },
    "hosjdtx": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosjdtx/",
      "text": "You’re a little confused about how the academic system works. \n\nThere are some BA/MA combined/ accelerated programs see here— https://www.gradschools.com/degree-guide/masters-without-bachelors \n\nI caution you to be very careful with them because they could be predatory/for profit Lower Ed type programs. \n\nYou definitely don’t have to follow a traditional path. But also, 20 is not the time to be thinking you need to rush through your life. I went back to school at 22 and was quite successful. \n\nSince you dropped out of your BA, I’m concerned if you’d be able to handle an MA or PhD. And I’m a bit confused why you want these higher academic degrees which are basically for academic institutions. I’m also curious why a BA is “wasting” your time, but whatever certificate you’re doing for 3 years…isn’t. And why you think the time required for an MA and PhD isn’t a waste of time…",
      "author": "ResponsibilityOk617",
      "created": 1639669815,
      "upvotes": 34,
      "replies": {
        "hosrpvs": {
          "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosrpvs/",
          "text": "“IS predatory/for-profit.” Definitely.",
          "author": "cropguru357",
          "created": 1639673095,
          "upvotes": 4,
          "replies": {
            "hossfz5": {
              "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hossfz5/",
              "text": "To be fair even the nonprofit universities are for-profit these days. Just profit for specific groups of people. 😂",
              "author": "ResponsibilityOk617",
              "created": 1639673374,
              "upvotes": 1,
              "replies": {
                "hossmy8": {
                  "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hossmy8/",
                  "text": "Ha! True. Big money industry for sure.",
                  "author": "cropguru357",
                  "created": 1639673447,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hosjyyc": {
          "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosjyyc/",
          "text": "Odds are they see anything outside of their narrow field as a waste of time.",
          "author": "CerebralBypass",
          "created": 1639670050,
          "upvotes": 12,
          "replies": {
            "hoso94n": {
              "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hoso94n/",
              "text": "Seems that way. And i don’t think trying to go straight to a grad program is going to be the magical sidestep they imagine it to be.",
              "author": "ResponsibilityOk617",
              "created": 1639671746,
              "upvotes": 12,
              "replies": {
                "hosoqnw": {
                  "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosoqnw/",
                  "text": "Almost certainly not. Particularly given the disconnect between their current program area and this desire to \"do research.\"",
                  "author": "CerebralBypass",
                  "created": 1639671936,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "hoslv3e": {
          "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hoslv3e/",
          "text": "Good question actually. \n\n>why you want these higher academic degrees which are basically for academic institutions.\n\nI'm interested in doing intensive research, so I was aiming for a PhD.\n\n>why a BA is “wasting” your time, but whatever certificate you’re doing for 3 years…isn’t.\n\nI first took my first bachelor's degree program in political science, and I wasn't interested in it at all. I dropped out of it. I later found my interest. My internet was art, animation and game design. I actually found a really good course for my field of interest in my city, which unfortunately doesn't give a bachelor's degree. This course is really good and the curriculum is actually better than most colleges that offer bachelor's degree in this field. Going for a bachelor's program after I finish this course would definitely be a waste of time as I won't be moving any higher (which I want to). \n\n>Since you dropped out of your BA, I’m concerned if you’d be able to handle an MA or PhD.\n\nAlso, I dropped out of BA because I had taken subjects which I wasn't interested in. I can handle programs if I'm really interested in the subject.",
          "author": "3DLE",
          "created": 1639670803,
          "upvotes": -15,
          "replies": {
            "hosmym6": {
              "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosmym6/",
              "text": "You do realize that you can go back and pursue a different major and that is like really normal, right? \n\nI’m concerned that if your ultimate goal is to do academic research that it isn’t the BA that’s a waste of your time. It’s whatever program you’re doing now for three years that doesn’t offer the credentials or, frankly, the experience you need to be successful in the academic institution.",
              "author": "ResponsibilityOk617",
              "created": 1639671235,
              "upvotes": 30,
              "replies": {}
            },
            "hoso44o": {
              "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hoso44o/",
              "text": "FWIW, MA and PhD programs also have required course work that may or may not interest you. So part of the process of the BA is learning how to do well despite your level of interest in the subject matter.",
              "author": "ResponsibilityOk617",
              "created": 1639671692,
              "upvotes": 21,
              "replies": {}
            },
            "hosnpr6": {
              "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosnpr6/",
              "text": "A Batchelor’s degree isn’t about gaining expertise in a field that you’re into.  It’s about getting a rounded education generally with a focus on a field of study you are interested in.  A school that teaches you how to be an animator, electrician, whatever is a trade school.  It in no way teaches you how to evaluate standards of evidence or to think critically, both necessary skills for graduate study.\n\nIt’s also a proving ground.  If you can excel in an undergraduate environment than you’re more likely to succeed in graduate school.\n\nYou don’t get to try out for big league baseball teams if you’ve only ever played T-ball in elementary school.",
              "author": "vetsquared",
              "created": 1639671535,
              "upvotes": 20,
              "replies": {}
            },
            "hospnmv": {
              "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hospnmv/",
              "text": ">My internet was art, animation and game design. I actually found a really good course for my field of interest in my city, which unfortunately doesn't give a bachelor's degree.\n\nIf you want to do research, this sounds like a waste of time tbh",
              "author": "pacific_plywood",
              "created": 1639672297,
              "upvotes": 11,
              "replies": {
                "hosxl8w": {
                  "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosxl8w/",
                  "text": "Depends on type of research. There are PhD programs within domains of art and design where practice-as-research is a valid method.",
                  "author": "LeewardLeeway",
                  "created": 1639675349,
                  "upvotes": 3,
                  "replies": {
                    "hot79pp": {
                      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hot79pp/",
                      "text": "Yes, but even that practice has a theoretical / reflective basis that OP will lack.",
                      "author": "CerebralBypass",
                      "created": 1639679080,
                      "upvotes": 3,
                      "replies": {
                        "hotr7oz": {
                          "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hotr7oz/",
                          "text": "True, but those degrees also require an artifact to be produced and theory does not help too much if the hands are not trained and able to create it.",
                          "author": "LeewardLeeway",
                          "created": 1639686906,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hosr5ge": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosr5ge/",
      "text": "You seem to have a very romanticized view of graduate school, and it's doing you a disservice.\n\nYou MIGHT be able to find a bachelor's program that will give you transfer credit from your animation course, but there's no way to completely sidestep a bachelor's degree on the way to a graduate degree. Your program might be teaching you the skills to code or do animation, but you're not getting the academic skills that you would otherwise need to do the kind of research you're imagining -- things like critical thinking, research methods, evaluating sources, and critical writing. \n\nYou dropped out of a bachelor's in political science because you \"weren't interested\" -- OK. But your experience with a specific major isn't indicative of ALL undergraduate programs. Poli Sci and animation are so far apart, that it's like saying you know you won't like the zoo because you didn't like the museum. If you want to get a graduate degree, you need to get used to working on things that aren't 100% what you want to do.",
      "author": "sheath2",
      "created": 1639672880,
      "upvotes": 24,
      "replies": {}
    },
    "hoshjo1": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hoshjo1/",
      "text": "When I started reading your post I thought you were going to say you were 40 with a lot of work experience in lieu of a bachelors degree. As you are only 20 you will definitely need a bachelors first.",
      "author": "GalwayGirlOnTheRun23",
      "created": 1639669084,
      "upvotes": 21,
      "replies": {}
    },
    "hosks7d": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosks7d/",
      "text": "What do you even want a masters and PhD in? And to what end?\n\nAlso whether you start a bachelors at 18/20/23 doesn't matter, you've got over 40 years of your working life to go after that, so don't sweat the time.",
      "author": "foibleShmoible",
      "created": 1639670373,
      "upvotes": 17,
      "replies": {}
    },
    "hosi0rt": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosi0rt/",
      "text": "There is a direct PhD program where you don't need to have a Master's degree. However, you still need Bachelors degree to get into a Master or PhD program.\n\nMaster and PhD program usually build on your bachelor's study. You only learn the basic in bachelors. You go further in-depth for a certain topic in your Master and PhD. It is unlikely that you can do well on a specialised topic when you do not know the basic of it. Hence, why bachelor's degree is necessary for a Master or PhD.\n\n20 years old is still green. If you do your bachelor and go for a direct PhD, you can get a PhD when you are around 28 years old, which is considerably young for a PhD holder.",
      "author": "MarkZelVitch",
      "created": 1639669277,
      "upvotes": 17,
      "replies": {}
    },
    "hosqe5w": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosqe5w/",
      "text": "What do you want to research? \n\nNobody gets onto their PhD programmes without being able to elaborate articulately exactly why it is they have decided to commit years of their life to studying a very specific topic for long hours and shit pay (relative to industry anyway), with a great deal of stress.",
      "author": "bethcano",
      "created": 1639672585,
      "upvotes": 12,
      "replies": {}
    },
    "hot0kpj": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hot0kpj/",
      "text": "Oh child….this makes my head hurt 🥲",
      "author": "Sunshinehugz",
      "created": 1639676487,
      "upvotes": 9,
      "replies": {}
    },
    "hotd1ov": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hotd1ov/",
      "text": "Research Engineer here (MS Aerospace): High schools (U.S.) really fail to teach the importance of the bachelors and contextualizing it within the Master’s and PhD Track. Bachelors upper division for the most part are the “Ideal” versions of physical problems that rarely deal with non-linear aspects of the real world. Grad school attacks these non-linearities head on. If you have dreams of academia (PhD) then you need to be capable of the masters, and there is not one bone in my body that would convince me someone who didn’t do the bachelors could ever take on all aspects of a Master’s project, you would not survive the classes, and because you’d be struggling you would have 0 time to research for your thesis, let alone fund and build. All those internet gurus telling you school is a waste of time fail to realize that the first two years of the bachelors are basics to read the upper divs. General Education is boring, but by not having a degree I have 0 faith that you can interpret engineering analysis that utilizes Ordinary Differential Equations as representations of real objects, or knowing linear algebra to utilize the power of state-space. Or if you wanna do the lab sciences, utilizing statistical analysis for biological data. If you didn’t do the bachelors, job employers, and myself would never believe you could do this. Because university provides professors that can actually criticize. And criticism in academia is important.",
      "author": "c3ramics",
      "created": 1639681342,
      "upvotes": 7,
      "replies": {}
    },
    "houbrus": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/houbrus/",
      "text": "A master's student is expected to, the day they start the program, to read, understand and communicate what primary research articles are trying to communicate.  Which means having a broad and moderately deep understanding of the general field.  Also, you are expected to be able to be moderately self directed.  So if your project deals with a new topic you should be able to use primary literature to teach you enough to be functional in that topic.  For PhD students the same expectations apply, just with twice the work being expected since it's a fully supported position (ie no TAing).\n\nAn applicant who couldn't be bothered to complete a bachelor's would be rejected immediately.  A bachelor's not only means you have a basic level of understanding in a field but have some degree of motivation and follow through.\n\nAsk yourself this: if there what a question you wanted to know the answer to how many hours would you dedicate to learning how to ask the question, then how many hours to actually ask it.\n\nAt the PhD level the answer is, \"however many it takes damnit\"",
      "author": "Ashelth",
      "created": 1639695134,
      "upvotes": 5,
      "replies": {}
    },
    "hosh4y5": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hosh4y5/",
      "text": "In the vast majority of Master’s programs, a Bachelor’s in a related field is required. Try googling for programs in your desired Master’s field, and look for their admissions requirements, and you’ll generally see things like Bachelor’s, sometimes specific courses within that Bachelor’s, general GRE, and sometimes a subject GRE.\n\nEdit: see also r/gradadmissions",
      "author": "AceyAceyAcey",
      "created": 1639668919,
      "upvotes": 2,
      "replies": {}
    },
    "hoss0v7": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/hoss0v7/",
      "text": "Yes.",
      "author": "Hhas1proton",
      "created": 1639673212,
      "upvotes": 2,
      "replies": {}
    },
    "howe5ks": {
      "link": "/r/AskAcademia/comments/rht1zr/finished_highschool_and_dropped_out_of_college_no/howe5ks/",
      "text": "I'm afraid so. It's unlikely that any reputable institution would take fees for a masters without evidenced success at bachelor level. You can however go straight into a PhD after completion of a bachelors degree in some cases.",
      "author": "happybanana134",
      "created": 1639734688,
      "upvotes": 1,
      "replies": {}
    }
  }
}