{
  "sid": "h78ckl",
  "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/",
  "title:": "UPDATE: LWIFU. How did I recover?",
  "text": "(Translation: Last Week I Fucked Up.) \n\nI posted [this](https://www.reddit.com/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/) last week and got a ton of good advice, and some requests for an update. Long story short, I \"met\" (remotely) with my PI and some muckety-mucks from my graduate program, and it was painfully awkward but ultimately fine. They had a \"not angry, just disappointed\" tone. Most of the meeting was logistics about how to recoup the lost money. It turns out I have some funds from a fellowship that I didn't realize could be used this way, and they made sure I had all the necessary permissions to get reimbursed that way. But each one of them made sure to remind me how important it is to maintain composure, to represent the program well, etc. They presented it like \"just trying to help you out here\" as if I had no idea that I had fucked up. But I just took the note and didn't argue with them.\n\nThere was one more uncomfortable but nice(ish) coda to the whole situation. An even higher higher-up called me on the phone after the meeting. He said my email debacle had made its way to him. At first my stomach sank and I thought this was the moment they were going to actually reprimand me in some way. Instead, he said he had no idea I was going through so much, and asked if he could help. I nearly started crying but I just thanked him and tried to get off the phone as quickly as possibly. I know he meant it kindly but to be honest I just want the whole thing to go away and I felt even more embarrassed that it clearly was getting forwarded around. But it is nice to know there are some actual human beings running this show.\n\nAnyway, thanks for all the advice. Now to put this all behind me.",
  "author": "Spiritual-Web4426",
  "created": 1591915244,
  "updated": 1634080190,
  "over_18": false,
  "upvotes": 294,
  "upvote_ratio": 0.98,
  "comments": {
    "ftrcv1s": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/ftrcv1s/",
      "text": "Now you know why that higher higher up has that job.  Be sure to send him a nice note of thanks.  And don’t be embarrassed to reach out for help.  Good people help each other in times of need.",
      "author": "bigrottentuna",
      "created": 1591925469,
      "upvotes": 166,
      "replies": {
        "ftrj02o": {
          "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/ftrj02o/",
          "text": "Yeah that guy is a human and he might have your back when you need it. Give him 5% of the vulnerability of the original email and thank him for reaching out. It'll be good for both of you.",
          "author": "wannabesoc",
          "created": 1591929194,
          "upvotes": 61,
          "replies": {}
        },
        "ftrj4za": {
          "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/ftrj4za/",
          "text": "who is the higher higher up ?",
          "author": "FoCoCS",
          "created": 1591929277,
          "upvotes": -25,
          "replies": {}
        }
      }
    },
    "ftr75zk": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/ftr75zk/",
      "text": "Good for you. For what it's worth, the higher up is the only one who seems human. \n\nAre you I'm the US? This is such odd behaviour to me, maybe I'm just lucky but all the supervisors I've had would focus on the personal first and ensure your okay mentally before advising you gently on how to better conduct yourself in emails. Bottom of the priorities is how you represent the programme. \n\nYou're human, you were grieving, for apologised, now forgive yourself and move on. Good luck!",
      "author": "Diddly_eyed_Dipshite",
      "created": 1591922060,
      "upvotes": 125,
      "replies": {
        "fukpvzr": {
          "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/fukpvzr/",
          "text": "Agreed, I would assume I was being forwarded the email because the student was not ok and clearly needed help.",
          "author": "ginisninja",
          "created": 1591945720,
          "upvotes": 16,
          "replies": {}
        },
        "fukt1z7": {
          "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/fukt1z7/",
          "text": "Completely agree.\n\nPlease don't be so hard on yourself. I am sure these PIs did much more terrible things in their life.\n\nDon't think that they are making you a favour. You are only human and those conference organizers are utterly despicable heartless b*tches.",
          "author": "FundamentalPessimist",
          "created": 1591948745,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "ftreph9": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/ftreph9/",
      "text": "Quite frankly, the higher up is the only one who seems like a decent human being. I know you feel like you got off lightly but if I was your advisor my concerns would be (in order):\n\n1. Your well-being.\n\n2. Impressing on you the fact that you didn’t do anything wrong (even if it would be polite to pretend you did).\n\n3. Dragging the conference chairs’ ass over hot coals.\n\n**They used a national disaster as an excuse to steal money from grad students.** I know you said that they had legalese to cover their asses, but all that means is that you can’t sue them. It definitely doesn’t mean you can’t drag their names all over the academic world. They used a national disaster as an excuse to steal money from grad students, and then used a moment of weakness to make the student they were stealing from feel like shit. They’re the bad guys in this story.",
      "author": "StellaAthena",
      "created": 1591926573,
      "upvotes": 105,
      "replies": {
        "ful2k59": {
          "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/ful2k59/",
          "text": "FYI just because a contract has legalise in it doesnt mean that clause is legal or would hold up in court, so dont assume you cant sue just because a contract says so",
          "author": "tc1991",
          "created": 1591958279,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "ftron6s": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/ftron6s/",
      "text": "Just an FYI - you are acting human. What you did may not have “sounded pretty” but it was an honest moment. Fuck the conference for tattling on you and fuck your department. I’m fact, fuck academia. I’m totally bitter and refuse to keep bending over to them.",
      "author": "CompressedReverb",
      "created": 1591932765,
      "upvotes": 21,
      "replies": {}
    },
    "ftr8yc2": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/ftr8yc2/",
      "text": "Glad it worked out. Thanks for the follow up.",
      "author": "mmilthomasn",
      "created": 1591923124,
      "upvotes": 5,
      "replies": {}
    },
    "fullm47": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/fullm47/",
      "text": "I just discovered your post of last week with that one.\n\nI can understand everyone's position, because the proper way of doing this was making sure that you were reimbursed by your institution, and let them address the issue with the conference (or sit on it if need be). In general, the golden rule is: as long as your institution is not dysfunctional, you first address issues internally, and you rely on your institution to deal with external issues. This rule is true at any level.\n\nJust a thing about your higher-higher up.\n\nIn labs, we value highly PhD students. They do a large share of our research. We have to fight to find fundings for them. We are held partly responsible when a PhD goes wrong (except just not in front of the student: remember the golden rule). And so we care about them. A lot. I always found the German expression for PI (\"Doktorvater\", doctor father) quite telling. And there is a lot of ways in which you can get help, and you must not hesitate to use it.",
      "author": "dragonaute",
      "created": 1591971794,
      "upvotes": 5,
      "replies": {}
    },
    "ftra61w": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/ftra61w/",
      "text": "I'm glad things worked out! We all make mistakes 😔.",
      "author": null,
      "created": 1591923851,
      "upvotes": 5,
      "replies": {}
    },
    "ftrh2o2": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/ftrh2o2/",
      "text": "Glad to hear that things sorted out at the end. Good luck with everything that comes now and thanks for the follow up!",
      "author": "kamikaze3rc",
      "created": 1591928012,
      "upvotes": 4,
      "replies": {}
    },
    "fukrykv": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/fukrykv/",
      "text": "Happy for you bud",
      "author": "learning-new-thingz",
      "created": 1591947678,
      "upvotes": 3,
      "replies": {}
    },
    "ftr2ljw": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/ftr2ljw/",
      "text": "Glad to hear that you were able to recuperate the funds and that they were generally understanding. Remember you're still learning your way around academia, so hopefully you'll know how to better approach this kind of situation if it comes up in the future.",
      "author": "poniesgirl",
      "created": 1591919455,
      "upvotes": 10,
      "replies": {}
    },
    "fukzprr": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/fukzprr/",
      "text": "I feel for you. In a somewhat similar situation, I lost my shit as well and hit sent to a certain type of email airing out 'my dirty laundry'. I didnt get into trouble per say but now everyone looks at me differently. Hang in there ... I hope your mum and sister are doing ok.",
      "author": "adashmi",
      "created": 1591955464,
      "upvotes": 3,
      "replies": {}
    },
    "fumv6uv": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/fumv6uv/",
      "text": "I assumed you meant you fucked up by lying about your circumstances. But you're saying all of what you're going through is true? Then what's the problem? I hate these kinds of panicked posts about uncontroversial behavior.",
      "author": "tinkletwit",
      "created": 1591993016,
      "upvotes": -1,
      "replies": {}
    },
    "ftrlfoc": {
      "link": "/r/AskAcademia/comments/h78ckl/update_lwifu_how_did_i_recover/ftrlfoc/",
      "text": ">conference organizers asked me to pay travel expenses and then submit reimbursement\n\nI don't understand this, do you mean they will process it and then give you reimbursement somehow? Who are these organizers? Are they a part of the university? In my part of the world, you pay for these out of pocket, then just give the receipt/invoice to someone in Finance at my department, and then they transfer money to my account.",
      "author": "gergasi",
      "created": 1591930708,
      "upvotes": -10,
      "replies": {}
    }
  }
}