{
  "sid": "mtvp7n",
  "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/",
  "title:": "Work place bullying",
  "text": "I am a victim of workplace bullying. My tormenter is my Director.\n\nShe calls me in her cabin, closes the door and starts with her destabilization tactics. Character assassination and demoralization are her tactics. Many people have put up with her harm either by teaming with her or doing work for her.\n\nShe starts by telling me how pathetic my work is and devalues all my publications, even if it was published in Nature.\n\nShe will deliberately remove me from allocated responsibilities and tell the evaluation committee that I am not doing that job properly during my evaluation, while the committee doesn’t know that she has already removed me from that job responsibility.\n\nShe keeps reminding me of all the blunders that I did when I initially joined the institute.\n\nI am tired of her persistent attempts to demoralize and destabilize me.\n\nBut yes, she protects sexual predators at workplace, just because they have cut a deal with her.\n\nI hope I find a new position some where else. Unfortunately, she is there in every academic recruiting committee in my country.\n\nWhat should one do when a woman leader bullys, harasses and torments another woman who is her subordinate?\n\nWhy are there no #metoo movements for women bullying women? She micromanages everything and everybody, who should I ask for help in such a situation. Everybody is terrified of her, tries to avoid a confrontation or a dialogue with her.\n\nI am at the verge of a breakdown now. ",
  "author": "mausstuff",
  "created": 1618818675,
  "updated": 1634081324,
  "over_18": false,
  "upvotes": 135,
  "upvote_ratio": 0.9,
  "comments": {
    "gv2gsjr": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2gsjr/",
      "text": "If it's of any  ... hope, there are definite moments of female bullies taken down by #MeToo and adjacent activities.  The dissolution of the Astronomy Institute at ETH Zurich was a fairly public example.",
      "author": "Spambot0",
      "created": 1618830160,
      "upvotes": 66,
      "replies": {
        "gv3c76o": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv3c76o/",
          "text": "Was thinking about this in particular. I can see this was pretty public.",
          "author": "kakeman69",
          "created": 1618846792,
          "upvotes": 9,
          "replies": {}
        },
        "gv3zwda": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv3zwda/",
          "text": "There's this one too... https://www.buzzfeednews.com/article/pascalemueller/guinevere-kauffmann-max-planck",
          "author": "dampew",
          "created": 1618856725,
          "upvotes": 7,
          "replies": {
            "gv40csc": {
              "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv40csc/",
              "text": "Yeah, Astronomy got a lot of publicity after Buzzfeed broke the Geoff Marcy story (and two or three other men who were sexually harassing or otherwise inappropriate).  Possibly it motivated more publicity, but obviously as an astronomer I was much closer to that history.",
              "author": "Spambot0",
              "created": 1618856918,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gv3268f": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv3268f/",
      "text": "[deleted]",
      "author": null,
      "created": 1618842438,
      "upvotes": 39,
      "replies": {
        "gv5fexw": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5fexw/",
          "text": "Thank you u/anathebatman\n\nIn my institute she overshadows the HR as well, HR are totally dependent on her without a voice themselves. So HR is totally out of question.. I think my only way to protect myself is to find a job. Thanks again.",
          "author": "mausstuff",
          "created": 1618880584,
          "upvotes": 2,
          "replies": {
            "gw7vfce": {
              "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gw7vfce/",
              "text": "Keep record. Even the great will fall. There was a scary professor who ran everyone at my institution and thought he was untouchable. Those kind of people will always meet their end.",
              "author": "DSP_the_FFT",
              "created": 1619643383,
              "upvotes": 1,
              "replies": {
                "gw8qbeu": {
                  "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gw8qbeu/",
                  "text": "I don't think anything will shake her. Scientific fraternity of this country doesn't want to cross her way.",
                  "author": "mausstuff",
                  "created": 1619657911,
                  "upvotes": 1,
                  "replies": {
                    "gwhpt54": {
                      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gwhpt54/",
                      "text": "Hmm, then what solutions do you see will work?",
                      "author": "DSP_the_FFT",
                      "created": 1619830565,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gv2zhuy": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2zhuy/",
      "text": "Something like this happened to my (ex) girlfriend years ago.  Her co-advisor was abusive and kind of shit on her, basically saying “you need thicker skin to make it in academia”.  In the end she switched universities and finished her dissertation with someone else; a real pain but it worked out.  With a pub in Nature you should be able to find a better situation.  I would talk to your director’s one-over first if you do this though.  This woman will continue to make peoples’ lives hell until there’s enough complaints in her file.",
      "author": "Superdrag2112",
      "created": 1618841219,
      "upvotes": 17,
      "replies": {}
    },
    "gv38ix7": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv38ix7/",
      "text": "I'm leaving a PhD program because my lab advisor is a bully and I just can't deal with it anymore. Same situation. She lies about me not doing work that I am doing. I even tried talking to the Dean of Students and my Department head won't let me switch labs.",
      "author": "opened_padlock",
      "created": 1618845240,
      "upvotes": 13,
      "replies": {}
    },
    "gv31k75": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv31k75/",
      "text": "I am so sorry to hear about your situation. Is there a possibility of having an anonymous talk with the HR of your university? They might be be on the look-out then for such behaviors from her.",
      "author": "Petunias_",
      "created": 1618842166,
      "upvotes": 8,
      "replies": {
        "gv5gh43": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5gh43/",
          "text": "She herself is the HR at my workplace.",
          "author": "mausstuff",
          "created": 1618881140,
          "upvotes": 1,
          "replies": {
            "gv5wrni": {
              "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5wrni/",
              "text": "So she is the Director and HR? Are there no other people you could talk to? Can you possibly find a 'mentor' in the evaluation committee that you can build a relationship with, who can vouch for you.",
              "author": "Petunias_",
              "created": 1618889904,
              "upvotes": 2,
              "replies": {
                "gv5xzxw": {
                  "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5xzxw/",
                  "text": "She overshadows HR as well. HR department are for mere namesake. I have already started reaching out to my mentors.",
                  "author": "mausstuff",
                  "created": 1618890644,
                  "upvotes": 2,
                  "replies": {
                    "gv5ysd0": {
                      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5ysd0/",
                      "text": "That can happen sometime. Well I wish you luck and I think other comments mentioned it but as long as it's possible, make sure to document stuffs on email. Like after a meeting, go back and email her and reiterate all the things she said (bad work, slacking, and all and tell her how you've been working differently to what she said but will take her comments and improve) and hopefully she never replies but if she does, then keep all your emails, polite and courteous.",
                      "author": "Petunias_",
                      "created": 1618891138,
                      "upvotes": 2,
                      "replies": {
                        "gv5za65": {
                          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5za65/",
                          "text": "Thank you for the suggestion u/Petunias_\n\nThe emailing part you suggested is brilliant, I will follow that now on. \n\nThe moment after I step out of her chamber I am always  blanked out and numb, and I  get back to work with a bit of confidence one week after the meeting. I never get the energy to write or speak to anyone. I will document it now on. Thanks again.",
                          "author": "mausstuff",
                          "created": 1618891448,
                          "upvotes": 2,
                          "replies": {
                            "gv5zzzu": {
                              "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5zzzu/",
                              "text": "I imagine it must be hard hearing such demoralizing things from people supposed to be in your objective support group. But take a couple of deep breathes, go for a short walk, have a chocolate or whatever is your pick-me up food then sit down and write your email and make sure it is sent on the same day. I have learnt that even between colleagues, it is good to keep emails for things that have been updated/changed. Take care and keep us posted.",
                              "author": "Petunias_",
                              "created": 1618891909,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gw7vjzg": {
              "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gw7vjzg/",
              "text": "No she's not. Everyone has a boss... Look at her research grants, etc.",
              "author": "DSP_the_FFT",
              "created": 1619643436,
              "upvotes": 1,
              "replies": {
                "gw8q1gj": {
                  "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gw8q1gj/",
                  "text": "Here the HR is just a namesake toy who nods to her decisions. They have no power other than to say 'yes' to everything that she says.",
                  "author": "mausstuff",
                  "created": 1619657776,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gv45puq": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv45puq/",
      "text": "Document, document, document. Keep a running tab on everything that happens.\n\nDate, time, location, what happened, what was said. Tell someone close to you, that you trust, what's going on.\n\nWhen you interact with her, use the grey rock method. Be as boring as possible and don't engage more than you need to. People like her are fueled by chaos, fear, and control. \n\nLastly, you are not what others think of you. people only pull you down to their level because they recognize they can't reach yours. own that.",
      "author": "bbv27",
      "created": 1618859220,
      "upvotes": 6,
      "replies": {
        "gv4cggv": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv4cggv/",
          "text": "This !!",
          "author": "Big_Lab_883",
          "created": 1618862174,
          "upvotes": 2,
          "replies": {}
        },
        "gv5hbre": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5hbre/",
          "text": "Thank you u/bbv27\n\nI will document everything now on. \n\nYes, you are right. She doesn't bully who do not perform well at work. She becomes their protector and takes care of them.",
          "author": "mausstuff",
          "created": 1618881582,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gv28u7k": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv28u7k/",
      "text": "I am so sorry to hear about your situation. Unfortunately women are not above abusing their power either. It sounds like you are in a bad place right now, can you take a day off to just ground yourself? Would it be possible to go above that person’s level to complain? If you have published in such great places I am sure you could get a position somewhere else too, right? Is there a way you can take a bit of a vacation and look for some new positions? Hug. I hope things get better for you soon.",
      "author": "notjennyschecter",
      "created": 1618823144,
      "upvotes": 28,
      "replies": {}
    },
    "gv2tykr": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2tykr/",
      "text": "I am just passing by to let you know that the most brutal harassments I have ever experienced at work came from other other women. It was a very difficult spot to be in. I wish you the best of luck.",
      "author": null,
      "created": 1618838491,
      "upvotes": 16,
      "replies": {
        "gv358f8": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv358f8/",
          "text": "Same here. And when I tried to report, the messaging was constantly \"but she is a woman, this isn't possible\". Women internalize the same misogyny as men, and there is a pervasive view from older women that \"I had it so much worse, why are you complaining?\" It's toxic and terrible.",
          "author": "boilerlashes",
          "created": 1618843798,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "gv2xqg1": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2xqg1/",
      "text": "What workplace protections do you have in your country? Is there a Human Resources department you can go to confidentially?",
      "author": "Harmania",
      "created": 1618840384,
      "upvotes": 4,
      "replies": {
        "gv5gxan": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5gxan/",
          "text": "She is the HR at my workplace. So there is no place for faculty greivance.",
          "author": "mausstuff",
          "created": 1618881372,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gv36dif": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv36dif/",
      "text": "You need to call on your network for advice, support, and protection. Whatever your most recent degree, think of three faculty that were in support of you and contact them for advice. Think of academic peers that you trust and contact them also. Everyone who has a stake in your career will care about this and I promise they will have ideas for action. Godspeed",
      "author": null,
      "created": 1618844298,
      "upvotes": 3,
      "replies": {
        "gv5h15i": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5h15i/",
          "text": "Thank you u/nafrank. I have already starting building network who can support me.",
          "author": "mausstuff",
          "created": 1618881428,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gv2r6sz": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2r6sz/",
      "text": "I'm sorry you feel this way, and I wish I could provide more help than this, but: I think you should record the meetings with her, and throw it for whatever outlet there is to see - dean's office, human resources, student's journal/newspaper, local newspaper. There have been many science news that have touched on workplace environment and abuse.\n\nanyhow, I really wish you all the best",
      "author": "math_chem",
      "created": 1618837012,
      "upvotes": 10,
      "replies": {
        "gv5k0jv": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5k0jv/",
          "text": "This could be bad advice depending on the laws where OP lives.  In many jurisdictions, recording conversations is illegal without the consent of all parties to the conversation.  \n\nRecording what happens between the woman and OP is a possibility, but OP definitely needs to research the local laws before doing so.",
          "author": "ChemMJW",
          "created": 1618882958,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gv3q72h": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv3q72h/",
      "text": "I’m sorry that this is happening to you but the best advice I can give you is Document everything that happens no matter how insignificant and do not give in. No one should have to work in this environment and it needs stamping out. Once you feel there’s enough to address with them , raise it with h r and ask for them to take the lead on it. The person doing it might not even beaware of their toxic behaviour but keeping quiet about it won’t change a thing. Good luck",
      "author": "Creative_Ad_983",
      "created": 1618852661,
      "upvotes": 3,
      "replies": {}
    },
    "gv4e944": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv4e944/",
      "text": "You need recorded evidence, if it is as desperate as it seems you cannot afford not to have evidence that can be presented outside of your immediate peer groups. Tribunals for instance.",
      "author": "Philipfella",
      "created": 1618862967,
      "upvotes": 3,
      "replies": {}
    },
    "gv4eaba": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv4eaba/",
      "text": "You might find r/legaladvice helpful.",
      "author": "apl2291",
      "created": 1618862982,
      "upvotes": 3,
      "replies": {}
    },
    "gv4hfcg": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv4hfcg/",
      "text": "The good ole academic narcissist strikes again. It’s not your fault, just minimise contact and they will move onto their next victim. Talk to campus friends and band together a support network.",
      "author": "playmo___",
      "created": 1618864344,
      "upvotes": 3,
      "replies": {}
    },
    "gv4uuy6": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv4uuy6/",
      "text": "I am a woman who was bullied for years by a female colleague. This colleague bullied others in the department, too — she had her victims and she was relentless. She was a big shot in our field, and it was very difficult to watch her receive international recognition for her work when we knew how cruel and impossible she was. Eventually she left our institution; I remember the day I heard she was leaving — I was ecstatic and texted all my friends like I’d just won the lottery.\n\nAs for advice, I agree with others here who suggest you document everything. You will need this documentation if you decide to file a formal grievance against her. Talk with your HR Director so they know this is happening, and to learn about your institution’s faculty grievance policy. And, yes, read about how to deal with malignant narcissists. It’s about setting clear boundaries and not personalizing their abuse — definitely easier said than done, I well know. Take care and good luck.",
      "author": "boldolive",
      "created": 1618870306,
      "upvotes": 3,
      "replies": {
        "gv5k7nj": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5k7nj/",
          "text": "Thank you u/boldolive\n\nShe is a big shot in my country, and has been attracting lot of international recognition these days. Only we know how mean and self entered she is. \n\nWe have an almost non-existent HR, since she is HR. \n\nI need to find a new job.",
          "author": "mausstuff",
          "created": 1618883060,
          "upvotes": 1,
          "replies": {
            "gv6p6iz": {
              "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv6p6iz/",
              "text": "Oh, I see. Yes, your situation is not likely to improve if she is HR. I’m sorry. Being bullied is very painful. Could you find a therapist to support you — is this possible for you? I talked frequently with my therapist about my bully, and it was very helpful to have someone in my corner.",
              "author": "boldolive",
              "created": 1618913687,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gv67p8u": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv67p8u/",
      "text": "If possible, I suggest getting a neutral third party [if possible] to go to any private meetings this person wishes to have with you. Document everything in writing with dates and times and as much as you can remember during or immediately after meeting. If you have a union, contact them and [again if possible] request a union steward to accompany you to any private meetings. Or, alternatively, you could request that anything she wants to say be said in front of your coworkers. Ive found some of these types of distasteful people to immediately panic the minute you break out pen and paper during a conversation to take notes on what they say. Just some ideas to think about. \n\nNot to make this about me at all, just wanted to share that I too went to HR at a large company when dealing with a harassing manager who would corner me alone physically preventing me from leaving the area to repeatedly tell me how bad of an employee I was. When I contacted HR, the representative told my manager who said exactly what to the rep. My manager again cornered me at my locker alone with both arms on either side of me threatening to fire me for making up lies about him. I wonder if he knew there are cameras watching that area 24/7. My coworkers became like work parents and would signal me anytime he was in the area and would demand to be present for any conversations. The union failed me completely and so did HR. The only change happened when I contacted ethics and the federal partner union and threatened a lawsuit. The company promptly busted my manager down to a grunt mechanic again just like the rest of us. \n\nDon't give in, don't let them win. Whether you stay or leave is up to you, but no matter what you are strong enough and better than they will ever think.",
      "author": "DarkSeidr",
      "created": 1618897476,
      "upvotes": 3,
      "replies": {
        "gv6gsml": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv6gsml/",
          "text": "Thank you for the suggestions u/DarkSeidr I am sorry you had to go through a similar experience.\n\nHR won't do a thing even at my institute as well. But I have planned to document all the meetings and comments now on. \n\nThanks again",
          "author": "mausstuff",
          "created": 1618905423,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gv2b0cu": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2b0cu/",
      "text": "Fight back!!  if u cant do it verbally, do it via Hr department, social media, linkedIn, email etc. Dont cave in. Check out also Dan o connor videos on youtube on how to protect yourself in verbal harrassement. Also just leave, quit the course or job or whatever, ur health is the most important thing, just go. Start again whatever u lose is worth gaining your freedom and self dignity back",
      "author": "CheeseCakeFestival",
      "created": 1618825179,
      "upvotes": 13,
      "replies": {}
    },
    "gv2vtvf": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2vtvf/",
      "text": "I can relate to what you are going through as I have been in the same place. I even went into a state of depression because if it. Its better to put this in record and escalate.",
      "author": "Fluid-Leadership-232",
      "created": 1618839449,
      "upvotes": 7,
      "replies": {
        "gv5hvhd": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5hvhd/",
          "text": "Thank you u/Fluid-Leadership-232\n\nI am sorry that you went into a state of depression, I have been there the second year I joined this workplace. I had totally believed whatever she said that time. Now I am very clear that she is the problem, unfortunately I don't have a place to escalate the issue.",
          "author": "mausstuff",
          "created": 1618881861,
          "upvotes": 1,
          "replies": {
            "gv8fju4": {
              "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv8fju4/",
              "text": "Then I would suggest if possible take a break and find a new job as this kind of toxic culture will really impact your capabilities to think and in the end you will start doubting urself too. Talk to your trusted ones about this let it out till you part ways with the present.",
              "author": "Fluid-Leadership-232",
              "created": 1618944455,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gv2sr6d": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2sr6d/",
      "text": "Do you have a union, or have you gone to HR? You need to get a file going on the harassment. It can be hard to relieve people from their positions in academia, but it is possible. We had one terrible bully fired from our university, but part of the difficulty was that no one complained about him officially for a very long time. Even if universities want to get rid of people, they can’t do it without a series of complaints and interventions, leading up to removal.",
      "author": "Felixir-the-Cat",
      "created": 1618837856,
      "upvotes": 6,
      "replies": {
        "gv5iezm": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5iezm/",
          "text": "Thank you u/Felixir-the-Cat\n\nYes, nobody complaints about her. Thats the issue. Though HR and most of the professors in my country are aware of it. They all tell me that they don't want to deal with as she is very annoying and has a loud mouth which does not have a breaks or bell.",
          "author": "mausstuff",
          "created": 1618882140,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gv3y43e": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv3y43e/",
      "text": "I feel sad hearing your story.  I hope you don't take her lack of self-worth as reflective of you. Know that you are amazing and awesome, and that is true regardless of your director's harsh words.\n\nDo you have a support system? I feel like you could benefit from being able to express yourself, and having someone to help look at your situation from an outsider's perspective.\n\nI wish you good health and peace of mind in this difficult time",
      "author": "PeaceAndPrajna",
      "created": 1618855979,
      "upvotes": 2,
      "replies": {}
    },
    "gv4fsg4": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv4fsg4/",
      "text": "Lindsey shepherd went thru bullying and came out good because she had a recorder in her bag, I was utterly shocked at the level of bullying and mental cruelty laid on her by the people who could make or break her academic career, she was alone in a room with a closed door and facing very senior people, very twisted people. Without the evidence I think it’s hard for people to realise how evil the narcissist is in actuality. Easy to find her story on YouTube....",
      "author": "Philipfella",
      "created": 1618863636,
      "upvotes": 3,
      "replies": {
        "gv5hfkh": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5hfkh/",
          "text": "Thank you.\n\nI will check out Lindsey Shepherd.",
          "author": "mausstuff",
          "created": 1618881635,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gv3btow": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv3btow/",
      "text": "The one thing a bully can't deal with is someone who refuses to put up with their shit. Once you prove to them that you are willing to go down in flames as long as you can take them down with you, they will back right off.",
      "author": "dali-llama",
      "created": 1618846634,
      "upvotes": 2,
      "replies": {}
    },
    "gv2hhle": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2hhle/",
      "text": "> Why are there no #metoo movements for women bullying women?\n\nBecause it's not a systematic problem rooted in gender inequality? Like, I'm sorry you're getting mistreated, but one person mistreating you does not warrant a movement.\n\nI think your options are:\n\n* try to find a job that is several degrees of separation from her. That she bullies you doesn't necessarily mean that she would tank you in a search, but to address that contingency, I'd start making friends elsewhere. If she's toxic, there are certainly other people who see that and will help you get out.\n\n* leave the country\n\n* leave the field",
      "author": "thegreenaquarium",
      "created": 1618830703,
      "upvotes": -3,
      "replies": {
        "gv2t7bw": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2t7bw/",
          "text": "The systematic problem here are people with Dark Triad personalities ending up in positions where they can hurt and bully others. A real problem for organizations, but not as \"metoo\"-able as gender stuff.",
          "author": "ColourlessGreenIdeas",
          "created": 1618838093,
          "upvotes": 12,
          "replies": {
            "gv2twyn": {
              "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2twyn/",
              "text": "Disagree. If anything its worse. I am a lesbian and I can tell you, women can be brutal to other women. Misogyny knows no gender.",
              "author": "Hedgehogz_Mom",
              "created": 1618838468,
              "upvotes": 6,
              "replies": {
                "gv2umxk": {
                  "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2umxk/",
                  "text": "What evidence do we have that OP's director is only mean to her, but not to her male colleagues? The evidence that she's a Dark Triad personality is on the table.",
                  "author": "ColourlessGreenIdeas",
                  "created": 1618838837,
                  "upvotes": 8,
                  "replies": {
                    "gv5jj8t": {
                      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5jj8t/",
                      "text": "She always needs someone in the spot she can play with. Currently, I am in that spot. She has a history of been thrown out from a university for harassing her male subordinates. We are unfortunate to have her as our director. So it's not gender specific. Her only need is that, even if you are well trained in your own field of specialisation, she will still plan your work and you are forced to follow her lead and give her credit.",
                      "author": "mausstuff",
                      "created": 1618882710,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gv2nler": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2nler/",
          "text": "I mean -- women receive the same messages about subjugating women that men do. And unfortunately some women internalize and perpetuate it when they take on positions of power. We're not immune.",
          "author": "saryl",
          "created": 1618834926,
          "upvotes": 15,
          "replies": {
            "gv5jngi": {
              "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv5jngi/",
              "text": "At least in my country, she is the biggest threat for young women scientists.",
              "author": "mausstuff",
              "created": 1618882770,
              "upvotes": 1,
              "replies": {
                "gw7whsz": {
                  "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gw7whsz/",
                  "text": "What do you mean?",
                  "author": "DSP_the_FFT",
                  "created": 1619643841,
                  "upvotes": 1,
                  "replies": {
                    "gw8pwug": {
                      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gw8pwug/",
                      "text": "She never promotes women scientists in the country. I still remember how she  had tormented one of my seniors (woman), who was bullied to that extend that she ended being a nervous wreck and ultimately resigned from the position. I still remember her screaming standing in the corridor. This is an example of which I am aware of, since this event happened the year I joined the institute. Unfortunately, non of her colleagues could do anything since they were threatened of their own jobs.  She is part of all the women empowering committees in the country, but every other person in the committee will unanimously vouch that she is the major enemy of all the women working in this country.",
                      "author": "mausstuff",
                      "created": 1619657712,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gv4hvfb": {
          "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv4hvfb/",
          "text": "It is a systematic problem in universities actually",
          "author": "playmo___",
          "created": 1618864538,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gv2vdh9": {
      "link": "/r/AskAcademia/comments/mtvp7n/work_place_bullying/gv2vdh9/",
      "text": "What's character assassination?? Please report her if you're in physical threat",
      "author": "Int_traveller",
      "created": 1618839217,
      "upvotes": -5,
      "replies": {}
    }
  }
}