{
  "sid": "ow76m4",
  "link": "/r/AskAcademia/comments/ow76m4/professors_didnt_respond_to_requests_for_letters/",
  "title:": "Professors didn't respond to requests for letters of recommendation. What should I do?",
  "text": "I asked three former professors for letters of recommendation almost a month ago but none of them have responded. It's been 3.5 years since I've been in two of the prof's classes, but both knew me very well and one of them even wrote a LOR for me a couple of years back. The third prof I was also pretty close with because I worked in their research lab, but they left the university to work elsewhere last year so I'm not sure if they got my email.\n\nI showed my friends the emails I sent and they said I might have scared them away :(. All my emails were about 5 paragraphs long (I wrote a lot about what I did in their class, their impact on my education, etc.). I also made the mistake of not specifying a deadline... I just said that I would be submitting applications this winter.\n\nI don't need these letters urgently but I feel super anxious that none of them have even replied. Should I try visiting their office when school starts again? Any advice? Thanks!",
  "author": "deablere",
  "created": 1627877537,
  "updated": 1634080037,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.8,
  "comments": {
    "h7e63vx": {
      "link": "/r/AskAcademia/comments/ow76m4/professors_didnt_respond_to_requests_for_letters/h7e63vx/",
      "text": "This might be a stupid question, but have you sent like a “just checking in to see if you got my last email” reminder email? \n\nIf you did, and they still haven’t responded, then they probably don’t wanna do it. It’s also summer vacation, so it’s possible that they are too busy. I’d say send another reminder, but I wouldn’t be too hopeful.",
      "author": "OvulatingScrotum",
      "created": 1627877815,
      "upvotes": 26,
      "replies": {
        "h7htimw": {
          "link": "/r/AskAcademia/comments/ow76m4/professors_didnt_respond_to_requests_for_letters/h7htimw/",
          "text": "I haven't yet. I thought I would have a higher chance of getting a reply if I sent them a reminder after school starts. Thank you for the advice!",
          "author": "deablere",
          "created": 1627950491,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h7eeg49": {
      "link": "/r/AskAcademia/comments/ow76m4/professors_didnt_respond_to_requests_for_letters/h7eeg49/",
      "text": "I'll be honest, if I received an email asking for a letter of recommendation, and the former student told me they wouldn't be needing them until winter, I might forget to reply.  \n\nIf I am busy, I triage email by whether there's something that needs immediate action, whether something that has a due date very soon,  and ... then the other stuff - which I confess sometimes gets neglected.\n\nWhen it comes to letters of rec, I expect requests to arrive about six to eight weeks before the letter is due.   So just email again, but in that time frame, closer to the due date.",
      "author": "matthewsmugmanager",
      "created": 1627883675,
      "upvotes": 16,
      "replies": {
        "h7gacun": {
          "link": "/r/AskAcademia/comments/ow76m4/professors_didnt_respond_to_requests_for_letters/h7gacun/",
          "text": "Agree with this one -- it might not be anything personal, OP. Especially if your initial email is very long and I don't have time to respond to it, I would probably just make a mental note to do the letter when the student emails me with something more \"actionable,\" which is:\n\n1. Where you're applying and why (be brief!)\n2. Where the letter writer should send the letter and how\n3. Due date\n4. You can attach your CV or a list of your past accomplishments, but you could also ask the letter writer what they need from you at this point.",
          "author": "EmmaWK",
          "created": 1627925700,
          "upvotes": 3,
          "replies": {}
        },
        "h7htobk": {
          "link": "/r/AskAcademia/comments/ow76m4/professors_didnt_respond_to_requests_for_letters/h7htobk/",
          "text": "Oh I see, I hope that's the case! I'll try contacting them again in a couple of months. Thank you!",
          "author": "deablere",
          "created": 1627950567,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h7e6hp0": {
      "link": "/r/AskAcademia/comments/ow76m4/professors_didnt_respond_to_requests_for_letters/h7e6hp0/",
      "text": "Maybe wait until school starts and then send a reminder email. It’s still summer and some professors are probably on vacation.",
      "author": "ProtectionOk2116",
      "created": 1627878055,
      "upvotes": 5,
      "replies": {}
    },
    "h7f43yu": {
      "link": "/r/AskAcademia/comments/ow76m4/professors_didnt_respond_to_requests_for_letters/h7f43yu/",
      "text": "Keep in mind that it is summer and most professors are “off contract” (meaning unpaid) over these months. I didn’t even check my email for more than a month over the summer. It’s possibly they haven’t even seen it, or stuck it on their “I’ll get to it when I’m back on contract” list.",
      "author": "gb8er",
      "created": 1627905328,
      "upvotes": 3,
      "replies": {}
    },
    "h7e6btt": {
      "link": "/r/AskAcademia/comments/ow76m4/professors_didnt_respond_to_requests_for_letters/h7e6btt/",
      "text": "You should send 1 brief paragraph and your cv. That's it.",
      "author": "b1c2n3",
      "created": 1627877953,
      "upvotes": 6,
      "replies": {
        "h7f7i9m": {
          "link": "/r/AskAcademia/comments/ow76m4/professors_didnt_respond_to_requests_for_letters/h7f7i9m/",
          "text": "Agree, profs straight up ignore long emails",
          "author": "onetwoskeedoo",
          "created": 1627907526,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "h7epk8f": {
      "link": "/r/AskAcademia/comments/ow76m4/professors_didnt_respond_to_requests_for_letters/h7epk8f/",
      "text": "You say these professors know you well but these are relationships that are several years old and I hate to say it but I think at least with some of these the relationship looms larger in your mind than it does theirs. I worked for nearly a year with someone who 3 years later pointed out that he doesn't know my work anymore and what he can say is 3 years out of date.",
      "author": "ACatGod",
      "created": 1627893205,
      "upvotes": 2,
      "replies": {}
    }
  }
}