{
  "sid": "p8bc4z",
  "link": "/r/AskAcademia/comments/p8bc4z/sabbatical_application/",
  "title:": "Sabbatical application",
  "text": "Here at my university we are eligible to apply for a sabbatical post tenure, but the application is due in October of the year prior to the actual sabbatical. So, if I want to go on a sabbatical next year 2022-2023, I have to apply by this October. In my experience, most of the opportunities for funding, etc. have applications not due until later this fall or next spring. \n\nAre there any suggestions on navigating this mine field?",
  "author": "prof_is_out",
  "created": 1629485144,
  "updated": 1634079541,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "h9qa08v": {
      "link": "/r/AskAcademia/comments/p8bc4z/sabbatical_application/h9qa08v/",
      "text": "Figure out what sabbatical means at your institution. Some places will let you have a semester off with no reduction in pay or a year off at half pay. If you're just taking a term, some schools won't necessarily care about funding. Having something lined up would make your application more attractive, but may not be essential.\n\nHas anyone in your department successfully applied for sabbatical recently? If so, ask to see their application. If your department doesn't have some kind of guidance on how to go through this, suggest that it would be really helpful. You could also talk to your dean about how to do it.\n\nI think most people reading sabbatical proposals are aware that funding hasn't always been worked out in advance. If you have multiple things you're applying for and they seem realistic, that's probably the best you can hope for.",
      "author": "Publius_Romanus",
      "created": 1629504468,
      "upvotes": 6,
      "replies": {
        "h9qgxb7": {
          "link": "/r/AskAcademia/comments/p8bc4z/sabbatical_application/h9qgxb7/",
          "text": "Oh okay, that makes sense. I was told that its basically a slam dunk if you get funding for the entire year, as opposed to one term (I don't quite get why that full year is so much more attractive). It's helpful to know that most don't have the funding lined up exactly when applying. Okay, thanks for the help!",
          "author": "prof_is_out",
          "created": 1629507768,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h9q6ylc": {
      "link": "/r/AskAcademia/comments/p8bc4z/sabbatical_application/h9q6ylc/",
      "text": "I have no idea. But upvoted for visibility",
      "author": "GrandOpening",
      "created": 1629503035,
      "upvotes": 1,
      "replies": {}
    }
  }
}