{
  "sid": "opapb1",
  "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/",
  "title:": "I feel alienated when non-academic friends and family superficially congratulate me for achievements",
  "text": "Hello everyone. I understand very few people want to hear about your achievements, even fewer people care. But my non-academic friends and family say they care, but never get too invested in anything. I mean anything. I know my audience, im not blabbering details and details about my work. Nome of them can actually say 1 sentance about what i like/do. They cant say 1 defining word. I mention i am very invested in their lives and talk for hours over the phone with them. I know they admire and respect me for my achievements, but whenever they say, \"are you finished?? \" - - im like, finished with what exactly? They don't know. I dont want to be finished with uni, with work, this is my life. \n\nWhen it comes to friends and family I personally feel unnecessary pressure with things like \"im sure youll do great\" even if I know they are just trying to be encouraging. There will be something that i fail at, and ill be very disappointed in myself, given i should have done \"great\".\n\n<rant over>\nHow do you manage their passive investment and impostor syndrome to these expectations?",
  "author": "OptiOp",
  "created": 1626947599,
  "updated": 1634082469,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.53,
  "comments": {
    "h64exbv": {
      "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h64exbv/",
      "text": "Honestly, it never even crossed my mind to hold it against my friends and family for not being sufficiently expert in my field or sufficiently well-versed in grad school stuff. Like, for one, because I do something very specialized that people without relevant training can't even understand, let alone be interested in, and for another, because I'm just grateful that my family/friends care about me and want to be supportive, even if they understand diddly squat re what they're being supportive of. Why would you expect non-experts to respond to you as if they are experts? That doesn't make logical sense.\n\nI suspect you have either decided that you have no identity outside of your job, which is why people not being able to discuss your job in detail is so visceral to you, or you feel resentful of your family and friends for some reason and are sublimating that resentment as... whatever this is. Either way, I suggest you meet your family and friends where they are. You can't turn them into different people, and you shouldn't throw them away over something trivial.",
      "author": "thegreenaquarium",
      "created": 1626959087,
      "upvotes": 10,
      "replies": {
        "h64g4rr": {
          "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h64g4rr/",
          "text": "I think you misunderstood me. Im not holding anything against them for not understanding what i do because i dont detail any of my work. I do something very specialised in biology as well. I said they are literally incapable of knowing i do \"biology\" like 1 word. They don't know my specialisation, lol. I dont think 1 sentance about what your child does is too much for non-academic people to comprehend. That is my frustration. Read my previous comments.\n\nAlso, this is not trivial to me since its my passion. Something trivial is all the daily details of their lives that i discuss with them:)",
          "author": "OptiOp",
          "created": 1626959728,
          "upvotes": -3,
          "replies": {
            "h64h9aw": {
              "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h64h9aw/",
              "text": "Bruh, the only people who know my specialization are people who are in or adjacent to my field. My family and friends usually know my discipline (although some confuse it with other social science disciplines), most grieviously misunderstand what my discipline even constitutes, and certainly none of them discuss my specialization with me or probably know that there is such a thing as specializations - what for? I don't think this is weird or something they are doing to spite me. I think you have elevated expectations of how much laymen understand, and also of how much other people are supposed to care about the minutiae of your life. \n\nI don't know, have you tried doing what you're asking your parents to do? Like, suppose your dad is a plumber: does that mean you can now carry out a sophisticated conversation about plumbing?",
              "author": "thegreenaquarium",
              "created": 1626960293,
              "upvotes": 11,
              "replies": {
                "h6572rw": {
                  "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h6572rw/",
                  "text": "This!",
                  "author": "Grace_Alcock",
                  "created": 1626971808,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h63zel1": {
      "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h63zel1/",
      "text": "Don’t wait until you’re asked, tell everyone about your work and use it as an opportunity to learn how to explain it to people outside science. Your enthusiasm will make them remember what you work on, not facts.",
      "author": "awkardlyjoins",
      "created": 1626948384,
      "upvotes": 6,
      "replies": {
        "h6417y9": {
          "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h6417y9/",
          "text": "Ive been doing this my whole life, and still am with everyone else besides my family. My family can be quite anti/skeptical to science coming from a very orthodox country. So science trust is not their best value, and all discussion along years have put me off a lot in explaining things/myself. Im not losing my enthusiasm, as i keep working just the same, but im losing the connection with them since its so tiring for me.",
          "author": "OptiOp",
          "created": 1626949938,
          "upvotes": 0,
          "replies": {
            "h641xwh": {
              "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h641xwh/",
              "text": "Ah so more of a cognitive dissonance from their side.. that sucks, sorry to hear that. Best for you is then to accept this part of your family and get your validation and enjoyment of sharing this part of yourself from someone else.",
              "author": "awkardlyjoins",
              "created": 1626950527,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h653q9l": {
      "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h653q9l/",
      "text": "They truly do not understand what you are doing -- they don't understand the what, why, or how of it, and it all probably makes them feel a bit stupid -- so cannot properly appreciate anything about your accomplishments. It's a bit like if you had a crazy runner friend who ran all of the time and all they talked about was running, and it made you feel a bit inferior because you get winded walking to the corner store, and then they told you that they were about to run in (or just completed) another event. You are now in a relatively elite club, and you are not going to get much validation from people who are not also in the club.",
      "author": "bigrottentuna",
      "created": 1626970420,
      "upvotes": 3,
      "replies": {}
    },
    "h64jiyb": {
      "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h64jiyb/",
      "text": "You're being at bit of an ass. Your friends and family care about you, they don't understand what it is you do but they know it's important to you and they want to show you they understand that and that they support you, so suck it up buttercup. \n\nYou're still doing your PhD, most of your peer group is either still in academia or in junior roles and many will be in areas you understand. Wait until you're 40, your friendship group has expanded and changed, your friends will have been through various career changes and moved across their organisations and you won't have a clue what any of them do in their jobs. However, you may have developed some empathy and you'll find yourself congratulating them on all sorts of things that you don't understand the significance of and just sharing in their joy because you're their friend. \n\nYour friends and family have their own lives, they don't live vicariously through you. It's pretty arrogant to expect them to understand what you do and then to be snotty that their sincere congratulations don't come with a full explanation of why they should be congratulating you. Say thank you, appreciate their sentiment and save the detail for the lab and your colleagues.",
      "author": "ACatGod",
      "created": 1626961409,
      "upvotes": 7,
      "replies": {}
    },
    "h63zrct": {
      "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h63zrct/",
      "text": "I’ve found, as a PhD student, if you can simplify what you do in one sentence in such a way that a baby can understand, that “lightbulb” clicks for them and they can brag and be invested in you. For example, this is what I tell my family:\n\n“I think of creative and logical ways to get people to like their jobs.”\n\nWhy is this work even remotely significant?\n\nNo one wants to go to work anymore post-pandemic.",
      "author": null,
      "created": 1626948695,
      "upvotes": 4,
      "replies": {
        "h640qix": {
          "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h640qix/",
          "text": "I do. I literally give 1 sentance about my passion + 1 sentance to why its important. I need to mention these are sometimes anti-science people from a very orthodox country, so its not like my message is being understood and accepted. And thats the problem. I have the ability to listen to people's passions even if I'm personally not into it.",
          "author": "OptiOp",
          "created": 1626949528,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "h64nx7k": {
      "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h64nx7k/",
      "text": "When you say you talk about their lives, do you talk much about their work? A lot of people see work as separate from their relationships outside of work. They go in, they do what they need to do, they leave and go live their lives. You might hear about the promotions or their boss being a jerk, but it's not something they want to chat about in their free time. Most academics don't see it that way and see their work as a meaningful part of their lives, but that's the mindset you have to convert it to. Sometimes it's easier to mostly talk about non-work stuff with non-work friends/family.",
      "author": "mediocre-spice",
      "created": 1626963489,
      "upvotes": 3,
      "replies": {}
    },
    "h644qi0": {
      "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h644qi0/",
      "text": "Give it up. 99 % of my family and friends are \"non-academic\". I have come to accept that they will never understand what I do, what research etc is in reality (outside Discovery Channel stuff). Even less what constitutes different hard-earned achievements. I remember early on that I got a bit miffed when I had to explain some super basic info for the 100th time, but then I figured out that it was an impossible ask. In time you will get used to it and not worry about it.",
      "author": "molobodd",
      "created": 1626952696,
      "upvotes": 4,
      "replies": {}
    },
    "h64eohb": {
      "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h64eohb/",
      "text": "You might want to try discussing it with them. They probably don’t know you’re feeling this way and if they’re willing to listen in the first place there’s a good chance they’ll try to be more accommodating. \n\nI feel your pain though, in truth no one will ever know or care as much as you do about what you’re doing. Personally I celebrate my own accomplishments with the only person who understands them; me (and my dogs)",
      "author": "_k547",
      "created": 1626958954,
      "upvotes": 1,
      "replies": {}
    },
    "h65lsnv": {
      "link": "/r/AskAcademia/comments/opapb1/i_feel_alienated_when_nonacademic_friends_and/h65lsnv/",
      "text": "I don't think my family even know what I study beyond the basic \"buzzwords\" that most know. I have had numerous fights with them about it. I think it comes down to two issues-one they don't necessarily give attention to it and two, I'm not great at translating my research into something understandable. We can both work on that. It's unreasonable for me to expect them to be super interested in what grad school like I am-we all know there are a LOT of boring details lol. After accepting that (both parties), I've found we are getting better at this. Now, my family asks questions like \"what is you next step?\" instead of asking \"when do you graduate\" which i consider a big win!",
      "author": "macearoni",
      "created": 1626978005,
      "upvotes": 1,
      "replies": {}
    }
  }
}