{
  "sid": "rc6k04",
  "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/",
  "title:": "Is it appropriate to give a professor a card/gift?",
  "text": "I have really enjoyed one of my professors and learned a great amount through the semester, so thought it would be nice to express this with a card written out to them. I would like to give it to them before the holidays, as I will not see them again after. I thought about also including a small gift ($10 amazon card) to express my appreciation. Is this appropriate to give to a professor? I don’t want to create any uncomfortableness but really want to express my appreciation. Also, I do want to note that I have considered asking this professor for a recommendation letter in the future, but don’t at all want to come off as bribing or sucking up for this. Any thoughts?",
  "author": "Ok_Mycologist330",
  "created": 1639014166,
  "updated": 1639515545,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.63,
  "comments": {
    "hnst118": {
      "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/hnst118/",
      "text": "What I can say for sure is that your note will be far far more meaningful than the gift card.",
      "author": "theXlioness",
      "created": 1639015496,
      "upvotes": 26,
      "replies": {
        "hnsu7pk": {
          "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/hnsu7pk/",
          "text": "Agreed. Skip any gift and focus on the wording of the note.",
          "author": "cajunsoul",
          "created": 1639016014,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "hnswiwz": {
      "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/hnswiwz/",
      "text": "Note: Yes.\n\nMoney/Gift-card: No.\n\nMoney makes it weird. They're a professor, making a professor's salary.  \nThey don't need $10 and a gift-card doesn't have any heart in it so it amounts to handing them $10.  \nThat's like... tipping a professor. Na. Just write a nice note.",
      "author": "andero",
      "created": 1639017035,
      "upvotes": 10,
      "replies": {
        "hnsy1e9": {
          "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/hnsy1e9/",
          "text": "Exactly. I keep a box in my office with the notes and cards I’ve received over the years. When I’m feelings stressed out or down I’ll browse through them and feel like I’m making some small difference.",
          "author": "MagScaoil",
          "created": 1639017708,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hnsrwra": {
      "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/hnsrwra/",
      "text": "At least in my university it's cool although not common.\n\nI have done this as a student both in undergrad and grad school as a way to express appreciation for my two favourite professors.\n\nNow that I'm on the other side of this, I would recommend you two things: Do it after you have your final grade and keep it simple.\n\nBy simple I mean a not expensive but thoughtful gift, like a book you think they would like with a little thank you note. Oh, and no, don't give them a gift card, but an actual gift.\n\nFinally, I can assure you this: They will really appreciate it, both the gift and the note. But most of all, the nice gesture. Good luck!",
      "author": "pupsteppenwolf",
      "created": 1639014998,
      "upvotes": 6,
      "replies": {}
    },
    "hnt00jf": {
      "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/hnt00jf/",
      "text": "The card written out to them is a great idea.  The $10 amazon card is not so great.  If you are seeing them in person, maybe instead of amazon card you can provide favorite snack, nice chocolate, something of that nature.  But the card alone is certainly enough (and will be valued).\n\nSource: Am professor, have received gifts from students.",
      "author": "nrnrnr",
      "created": 1639018598,
      "upvotes": 4,
      "replies": {}
    },
    "hntlne8": {
      "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/hntlne8/",
      "text": "Yes, do it after your complete the course. Probably do not include a gift card. Your meaningful note will mean a lot. If you give a gift, make it meaningful. For example, I got my organic chemistry professor a shot glass shaped like a flask with a lab that said “Te” to stand for tequila, like an element. She frequently seemed to enjoy drinking while grading exams, so she much enjoyed the present. She had tons of mugs and signs that said “worlds best” and then whatever. She didn’t love them. This was for her birthday. At the end of both of my courses with her, I got her an organic chemistry scarf, and then made a matching bandana for who dog, who she loved greatly. These kinds of gifts meant a lot more to her than a gift card or a prewritten hallmark card. Write a note with specifics. If you do a present, make it meaningful",
      "author": "Bekah_grace96",
      "created": 1639030113,
      "upvotes": 3,
      "replies": {}
    },
    "hnsshec": {
      "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/hnsshec/",
      "text": "I end each semester reminding students to email me as needed, without hesitation, hoping at that point they recognize the offer extends well past when our course ends & well into the time they may need a letter of recommendation. Over the years, only a handful of students I can’t recall off the top of my head have emailed asking for such, & in the same amount of time, three students I can easily recall gave me a card, with a small gift (a coffee ship gift card; a shirt that said N.O.P.E. on it; & a trinket from their recent visit home) at the end of the semester. The gifts were funny, as each fit something about me & our time in class, but in truth I felt sort of off about them… BUT what they communicated in the cards connected with me the most, & was totally appropriate, & so appreciated, in each situation. \n\nWhen I got accepted into a PhD program I sent one of my professors (who is, incidentally, now the chair of my department) a very honest card, thanking them for, well, existing I guess, & for being so focused on helping student learn. When I finished my associates degree, I gave a beloved professor a full-on letter explaining all the ways they helped me & how grateful I was for all of it. Both sent thank you cards in response. \n\nI think such exchanges largely depend on the connection between student & instructor. A kind card expressing gratitude will likely be appreciated; I’m not sure about the gift card though. Maybe take & print out an awesome photo of a fabulous fungi find & include that instead (ok, shit, that might just be something I’d appreciate).",
      "author": "Mists_of_Analysis",
      "created": 1639015253,
      "upvotes": 2,
      "replies": {}
    },
    "hnt0eky": {
      "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/hnt0eky/",
      "text": "Card will mean so much. Gift card will make them feel awkward.\nI LOVE receiving cards from my students. I keep them all and look at them when I'm struggling. \n\nBut every time a student gives me a gift I feel like I shouldn't accept it. But I'm not usually left with any choice because they give me the card on the last day of class, then I go home and open it and don't see them again. Plus I don't want them to feel bad by returning the gift. \n\nThe only time I think it's okay is if you're a defended grad student giving your advisor/chair a token of appreciation. \n\nGive the card. Be honest about how much the class meant to you. Skip the gift card.",
      "author": "WorleyDooDickPotato",
      "created": 1639018780,
      "upvotes": 1,
      "replies": {}
    },
    "hntkhiq": {
      "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/hntkhiq/",
      "text": "OP, if it’s my class, I’ll take the gift card.",
      "author": "EconGuy82",
      "created": 1639029360,
      "upvotes": 1,
      "replies": {}
    },
    "ho1x928": {
      "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/ho1x928/",
      "text": "As a professor, what I would like best is if you came by my office, told me you enjoyed the class, and shook my hand.",
      "author": "x47126g",
      "created": 1639179806,
      "upvotes": 1,
      "replies": {}
    },
    "hnt2pso": {
      "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/hnt2pso/",
      "text": "I think the safest route would be to give your professor the gc of $10. The route where he would be most proud would be to tell him/her in person and the extra credit would be to do it in front of a couple of his peers but no pressure, none at all.",
      "author": "Patient047",
      "created": 1639019848,
      "upvotes": 0,
      "replies": {
        "hnt35es": {
          "link": "/r/AskAcademia/comments/rc6k04/is_it_appropriate_to_give_a_professor_a_cardgift/hnt35es/",
          "text": "I would also like to say the best \"teachers\" teach by performing good works if that makes any sense at all. Then to really be the over achiever which I do sometimes when they're really worth my time then I offer them something of intrinsic value. Thanks for being one of my best teachers today.",
          "author": "Patient047",
          "created": 1639020050,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  }
}