{
  "sid": "piqiik",
  "link": "/r/AskAcademia/comments/piqiik/have_i_been_out_of_the_field_for_too_long_have_i/",
  "title:": "have i been out of the field for too long? have i ruined my shot at having a career in higher ed?",
  "text": "i'm in the usa.  i have a master's degree in adult and higher education administration, achieved in 2017.  i was working up the housing ladder throughout undergrad and grad school, then worked 2 years out of grad school at a large public university as a professional in their housing program, and left due to the absolutely horrible treatment of and unrealistic expectations placed upon housing professionals.\n\nsince may of 2019, i've worked some other jobs - a year at a call center, some time in retail, etc.  but i think i'm ready to go back into higher ed.  i've also had a case study i created during my final semester of grad school get approval for publishing in a textbook to be released sometime in the next year.\n\nmy question is - does my time away for my own mental and physical health look suspicious?  have i ruined my chances of ever getting back into an administrative role at a university?  or worse - is my only option to go back into housing, since that's where my higher ed background is?\n\ni guess i'm just wondering if it's even worth it to start looking for a job in academia again if my chances are abysmal, since the processes always take forever and usually are super in-depth.",
  "author": "brattysloth",
  "created": 1630895330,
  "updated": 1634079383,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hbrgedp": {
      "link": "/r/AskAcademia/comments/piqiik/have_i_been_out_of_the_field_for_too_long_have_i/hbrgedp/",
      "text": "I’m sure you can get back in there. If you were going for a professor position, the gap can make it close to impossible, but admin staff come from all kinds of background. I’m sure how competitive it is to get those jobs depends a lot on where you are located though.",
      "author": "Overall_Designer7502",
      "created": 1630895518,
      "upvotes": 6,
      "replies": {}
    },
    "hbsbn73": {
      "link": "/r/AskAcademia/comments/piqiik/have_i_been_out_of_the_field_for_too_long_have_i/hbsbn73/",
      "text": "You can very likely still get a good job in higher Ed. You may need to start at a little lower of a position than you like and move up over time. You can try different positions. I think sometimes it’s best to try different one early in your career because you can get sort of pigeon holed if you stay in one field / department for a long time. Try to connect your graduate work to your resume and cover letter.",
      "author": "Scholarscollective",
      "created": 1630915569,
      "upvotes": 6,
      "replies": {}
    },
    "hbsmu7t": {
      "link": "/r/AskAcademia/comments/piqiik/have_i_been_out_of_the_field_for_too_long_have_i/hbsmu7t/",
      "text": "I chaired Social Sciences at a 5000 student state baccalaureate college.\n\nSeveral years before I retired I hired a late 50's-something who had a career as a cop and earned her masters while working. She retired and earned her doctorate. She applied and I hired her from among 50 or so other applicants without any push-back at all from anybody higher up in the administration. She was very clear when she interviewed that she was planning on working for 10 years to earn a second pension and then retire again. She's actually gone a bit longer than that.\n\nAlso, our college hired a person with a master's in I/O psychology who had worked in industry for 20 years or so to run our Student Success program.\n\nSo, my n=2 suggests that it is certainly possible to come into higher ed a bit later in life. Apply and see what happens. I'd bet that your earlier experiences would put you higher up on the applicant pool, particularly if you can get a good LOR from somebody at your previous institution.",
      "author": "rockyfaceprof",
      "created": 1630925531,
      "upvotes": 5,
      "replies": {}
    }
  }
}