{
  "sid": "ksln94",
  "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/",
  "title:": "Can you just hire academics for research contracts and such? Is that considered reasonable or rude?",
  "text": "I work as an assistant for a wealthy tech guy who often goes on weird tangents. He spends a lot of money satisfying his curiosity on various things, whether it be books (or shelves for the books), courses, or consultants for the things you can get consultants in. He recently saw a video on food fraud, read a label on a box in a restaurant for a fish he couldn't find on the menu, and now wants to go find someone at the local university to go run DNA tests on one of each dish from that restaurant as he wants to see if he is right. He has a slate of other things he is curious about but I have convinced him to hold off on those for now. \n\nI know that the news people did it, but are professors and academics ok with random citizens trying to hire them for these kinds of tests? He isn't a cheapskate or anything and is willing to spend thousands on this question, I am just not sure if they want to be distracted from their research with these kinds of proposals.",
  "author": "Long-Fondant-7232",
  "created": 1610050488,
  "updated": 1634080965,
  "over_18": false,
  "upvotes": 165,
  "upvote_ratio": 0.98,
  "comments": {
    "gigte7z": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigte7z/",
      "text": "[deleted]",
      "author": null,
      "created": 1610053097,
      "upvotes": 134,
      "replies": {
        "gigugn0": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigugn0/",
          "text": "He might be ok with the research project actually, although he isn't sure he has found anything yet, so not sure it could be a research project.\n\nThe lab is probably a better bet.",
          "author": "Long-Fondant-7232",
          "created": 1610053578,
          "upvotes": 41,
          "replies": {
            "gigxpkc": {
              "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigxpkc/",
              "text": "I highly recommend he contract with a private lab for this. I used to work for one and this is absolutely the kind of contract they would have taken. (We didn't do DNA sequencing, but if you'd wanted to know about any nutrient in any food dish, we would have happily done that analysis for you.)",
              "author": "MidnightSlinks",
              "created": 1610055040,
              "upvotes": 57,
              "replies": {}
            }
          }
        },
        "gihxpwq": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihxpwq/",
          "text": "This is the correct answer. Ignore everyone talking about paying some Academic lab to do this. You are not doing research. You are doing a one off routine analysis. You'll get better, faster results for less with a contract lab. It's not usually done because some random CEO is convinced that a restaurant is lying about what it's serving, but the general idea of sending samples to an outside lab for testing? Happens all the time.",
          "author": "Mezmorizor",
          "created": 1610072923,
          "upvotes": 40,
          "replies": {}
        }
      }
    },
    "gigvmw9": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigvmw9/",
      "text": "This is what consultants and contract labs exist for. A good consultant should be able to organize a project and connect with an appropriate contract laboratory to set up the appropriate assays.\n\nFor instance if I was going to do this, I'd take a look at your boss's question, check the literature to see if anyone has already looked at the question, formulate a recommendation for tests to run, and then set up a work agreement with a lab that can do the sequencing.",
      "author": "ImJustAlly",
      "created": 1610054107,
      "upvotes": 41,
      "replies": {}
    },
    "gigryqh": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigryqh/",
      "text": "There are PhD students and non-TT instructors (eg, adjuncts) who cobble together as many means to make ends meet as possible. I would be surprised if someone weren't willing to chase whatever wild goose your wealthy tech boss finds appealing at that moment.\n\nYour difficulty will probably be in finding those people. \n\nAs u/Galactica13x mentioned, it would be unlikely for you to find an established professor to take on such a small, one-off task though.",
      "author": "gobucks314",
      "created": 1610052453,
      "upvotes": 100,
      "replies": {
        "gigxoat": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigxoat/",
          "text": "At my university, often the lab managers will take on this kind of work to fund lab running costs and upgrades.",
          "author": "rlrl",
          "created": 1610055024,
          "upvotes": 16,
          "replies": {}
        },
        "gigun3m": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigun3m/",
          "text": "He is expecting to pay 10K to 20K for this project. Have no idea what it would cost, but there is a decent amount of money for it.",
          "author": "Long-Fondant-7232",
          "created": 1610053659,
          "upvotes": 18,
          "replies": {
            "gih5mzu": {
              "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih5mzu/",
              "text": "Lots of labs of TT people specialize on doing certain tests, etc, and may do it for cost or to assist with running their labs. 10-20k could easily be worth it.",
              "author": "imhereforthevotes",
              "created": 1610058726,
              "upvotes": 20,
              "replies": {}
            },
            "gihj0mm": {
              "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihj0mm/",
              "text": "What you're asking for is really a sequencing experiment plus bioinformatics support. Depending on the number of samples, $20k might just about do it, although you may need to spend more if you want a full report of what the results mean. You'd be paying for both reagents and technician time under such an arrangement. A core facility that is currently running lower volume due to the pandemic might take you up on such a project.",
              "author": "tchomptchomp",
              "created": 1610065298,
              "upvotes": 9,
              "replies": {}
            },
            "gigxdm8": {
              "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigxdm8/",
              "text": "Most established academics with wet labs deal with grants in the millions so 10-20K is not going to wow them",
              "author": "ProfOnTheMove",
              "created": 1610054892,
              "upvotes": 35,
              "replies": {
                "gih4bvq": {
                  "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih4bvq/",
                  "text": "I would say otherwise. Academics aren't casual millionaires, those large grants are for long term. I don't do this kind of stuff, but if all the dude wants is a 23andMe on a fish, then I'm sure it won't be _that_ expensive.",
                  "author": "CoffeeVector",
                  "created": 1610058110,
                  "upvotes": 59,
                  "replies": {
                    "gihwp8c": {
                      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihwp8c/",
                      "text": "You could probably hand it off to the undergrad student as some kind of intro to the lab project. Much easier to reorder a restaurant dish if they mess up the sample, than something important. The most expensive part would probably be the primers, I have no idea what you'd need to buy here.",
                      "author": "meddwannabe",
                      "created": 1610072402,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "gikmk9j": {
                      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gikmk9j/",
                      "text": "\"I found out I'm part Swordfish, part Tiger Shark, and part Flushed Goldfish!\"",
                      "author": "gobucks314",
                      "created": 1610133705,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "gih1c7h": {
                  "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih1c7h/",
                  "text": "Millions for years of work for many people plus resources and travel...",
                  "author": "anananananana",
                  "created": 1610056704,
                  "upvotes": 26,
                  "replies": {}
                },
                "gih4fq5": {
                  "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih4fq5/",
                  "text": "He's not asking for a wetland to be studied and sampled over years though by a team of 5. He needs some PCRs run and a student to do them.",
                  "author": "Top_Place_2507",
                  "created": 1610058160,
                  "upvotes": 23,
                  "replies": {}
                },
                "gihcaul": {
                  "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihcaul/",
                  "text": "Lol not true. Those million dollar grants don't go into their personal accounts and there are usually heavy restrictions on how the funds can be used. Many academics are happy to do side jobs, e.g. as consultants for a few thousand, because they get to keep that money directly.",
                  "author": "respeckKnuckles",
                  "created": 1610061936,
                  "upvotes": 21,
                  "replies": {
                    "gihdum3": {
                      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihdum3/",
                      "text": "The 10-20K this guy this guy wants to offer wouldn't go into their personal accounts either if they are using University resources (ie, their lab). It would need to go through the grants office just like any other research funding",
                      "author": "ProfOnTheMove",
                      "created": 1610062694,
                      "upvotes": 10,
                      "replies": {
                        "gihj5r8": {
                          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihj5r8/",
                          "text": "Nah, because this wouldn't be processed through a normal academic lab. It would be processed by a core facility, which would be able to handle external billing.",
                          "author": "tchomptchomp",
                          "created": 1610065372,
                          "upvotes": 6,
                          "replies": {
                            "gihttq8": {
                              "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihttq8/",
                              "text": "Fair enough",
                              "author": "ProfOnTheMove",
                              "created": 1610070897,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gihcnck": {
              "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihcnck/",
              "text": "Public university salaries are public. You can calculate their hourly rates (assume 9 month contracts) and base your offer on that.",
              "author": "respeckKnuckles",
              "created": 1610062104,
              "upvotes": 3,
              "replies": {
                "gihg664": {
                  "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihg664/",
                  "text": "Though for using scientific equipment you'll usually need to factor that into the cost. Machine time is often considerably more than the salary costs for specialized systems. I know my lab used to charge a few hundred bucks a run for something that was ~15 minutes of hands-on labor per sample.",
                  "author": "racinreaver",
                  "created": 1610063847,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "giiak8z": {
              "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/giiak8z/",
              "text": "There's definitely academic labs that would do this. Undergrad and grad students in labs that don't have huge grants are often happy to pick up small projects like this. I would recommend looking at local universities for labs that focus on marine/aquatic/fisheries genetics and ecology.",
              "author": "shesacoonhound",
              "created": 1610079828,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gih7fa0": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih7fa0/",
          "text": "This is wrong, honestly. Plenty of \"established\" professors would do this, depending on their needs. Doing a DNA barcoding project on fish wouldn't be anything a decent genetics lab couldn't do, anyway, and people are always looking for funding.",
          "author": "imhereforthevotes",
          "created": 1610059584,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "gih2wa0": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih2wa0/",
      "text": "This is hilarious.",
      "author": "yankeegentleman",
      "created": 1610057432,
      "upvotes": 32,
      "replies": {
        "gih45zv": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih45zv/",
          "text": "Hilarious in an absurd I am an idiot for asking way? lol.",
          "author": "Long-Fondant-7232",
          "created": 1610058035,
          "upvotes": 8,
          "replies": {
            "gih4mje": {
              "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih4mje/",
              "text": "Not at all. It seems like an interesting job you have.",
              "author": "yankeegentleman",
              "created": 1610058248,
              "upvotes": 29,
              "replies": {}
            }
          }
        }
      }
    },
    "gihbw4g": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihbw4g/",
      "text": "I am picturing you being the secretary of Elon Musk or someone in a similar position. If you decide to write your work with this guy for a sitcom netflix show I would certainly watch it. In the meantime, I wish you luck on this search for a lab to do those tests",
      "author": null,
      "created": 1610061738,
      "upvotes": 17,
      "replies": {}
    },
    "gih08ly": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih08ly/",
      "text": "I’m just commenting to say I used to work in a similar position as you are and your question makes me miss it. Hope you are enjoying the never ending puzzles to piece together!",
      "author": "chadobaggins",
      "created": 1610056196,
      "upvotes": 10,
      "replies": {}
    },
    "gigtchi": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigtchi/",
      "text": "I think you could do this--this is consulting work.  There might be problems with using the university lab for it (or maybe not?) but in my discipline (economics) it is common for professors to do consulting expert work, which is what this sounds like.    \n\n\nExpect it to be expensive ($500+ per hour, plus expenses), but I think it would be doable.",
      "author": "pantslesseconomist",
      "created": 1610053075,
      "upvotes": 17,
      "replies": {
        "gigud0k": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigud0k/",
          "text": "He guesses it to cost like 10K-20K for the batch of 20 or so fish samples, so unless it takes dozens of hours to DNA test fish, that is certainly plausible.",
          "author": "Long-Fondant-7232",
          "created": 1610053532,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gih7sny": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih7sny/",
      "text": "[deleted]",
      "author": null,
      "created": 1610059758,
      "upvotes": 8,
      "replies": {
        "gih8c09": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih8c09/",
          "text": "That acronym confounded a lot of my initial Google searches.",
          "author": "Long-Fondant-7232",
          "created": 1610060011,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "gii29h1": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gii29h1/",
      "text": "I am afraid a lot of the information here is not correct. As I understand it, you want DNA sequencing on 20ish fish samples to identify species.\n\n&#x200B;\n\n1. This is not a project that can be easily done by standard contract labs. This is a molecular systematics project. A knowledgeable person would have to design the right strategy for PCR cloning appropriate genes and depending on the species, this might be quite difficult. For some common species there is enough genome information to do this, but, highly unlikely it would exist for everything on the dishes.\n2. Depending on the species, this could be say a few days of work and \\~$2,000 of reagents or if we have to design, optimize primers, etc, could be a 1-2 months of work. \n3. Having said that no lab would take this kind of work on for money. Yes, professors do consulting. But, when I do consulting, it is for using my expert knowledge and something I can do outside of the lab. If I use my lab and lab personnel, it has to go through the university as a research contract. There is no \"profit\" for anybody and the size of the project would not merit diverting resources from other projects.\n\nThe only thing I can think of is two possibilities. (1) a project could be created as an educational experience for an undergrad or high school student. The professor would have to be pretty willing to do it for education. (2) you find a fish molecular systematics specialist for whom the project would be kind of a hobby activity and they already have similar projects going on. If you DM me where you are located, I could possibly see if there are such people nearby,",
      "author": "unreplicate",
      "created": 1610075303,
      "upvotes": 8,
      "replies": {}
    },
    "gigvw1h": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigvw1h/",
      "text": "At my university, one of our bio profs had his gen Ed science class do that exact experiment at a local restaurant. As long as he’ll fund it, someone is probably willing to do it. He’ll just have to ask around.",
      "author": "eridalus",
      "created": 1610054221,
      "upvotes": 11,
      "replies": {
        "gih6vac": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih6vac/",
          "text": "Bingo.",
          "author": "imhereforthevotes",
          "created": 1610059319,
          "upvotes": 3,
          "replies": {}
        },
        "gii51f2": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gii51f2/",
          "text": "Yeah they sell kits to do this for student projects\nhttps://www.bio-rad.com/en-us/product/fish-dna-barcoding-kit?ID=MH1Z6S15",
          "author": "ron_leflore",
          "created": 1610076789,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gih4bc3": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih4bc3/",
      "text": "Every university I've worked at in the UK has a system for consultancy work (to pick a UK university out of a hat, here is UCL's page on it: [https://www.ucl.ac.uk/enterprise/staff/offer-consultancy-services](https://www.ucl.ac.uk/enterprise/staff/offer-consultancy-services)). I think the rates are quite generous from a UK academic salary point of view.\n\nCompanies or individuals would normally contact the academic or school directly, and if someone bites they would forward it to the central folk to sort out contracts, indemnity etc. I had one experience of the process with some guy who similarly just had a pet project he was interested in, but it ended up not going anywhere. I assume they were put of by the expense/faff.",
      "author": "Flemon45",
      "created": 1610058103,
      "upvotes": 9,
      "replies": {}
    },
    "gih5ix4": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih5ix4/",
      "text": ">now wants to go find someone at the local university to go run DNA tests on one of each dish from that restaurant as he wants to see if he is right.\n\nThat's a remarkably circuitous way of finding out what you could just by asking to see the COOL documentation for the restaurant's seafood.",
      "author": "lucianbelew",
      "created": 1610058672,
      "upvotes": 3,
      "replies": {}
    },
    "gigpjkh": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigpjkh/",
      "text": "Very unlikely. It doesn't help us achieve the things we need to for our jobs (research, teaching, service), and frankly running the DNA on a fish from a restaurant is just downright strange. This isn't something he, or you, should waste anyone's time with. \n\nSome faculty do take on contract or consulting work, but that's generally for prestigious or public service type things (testifying in Congress, working with a foundation to review grants, giving public lectures to your community, etc). It would be very strange for an individual to contact a professor and ask to pay them for research, and most faculty would probably have an internal chuckle -- especially at the fish email -- and delete it.",
      "author": "Galactica13x",
      "created": 1610051355,
      "upvotes": 8,
      "replies": {
        "giguyhi": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/giguyhi/",
          "text": "He has two dishwashers and just moves day to day dishes between them. He is well past strange. \n\n\nThanks though.",
          "author": "Long-Fondant-7232",
          "created": 1610053802,
          "upvotes": 11,
          "replies": {
            "gihb80w": {
              "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihb80w/",
              "text": "Sounds like he's living the dream.  How much does he pay the dishwashers? [joking]",
              "author": "dampew",
              "created": 1610061414,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gih6tpd": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih6tpd/",
          "text": "I'm going to make an assumption, based upon your flair, and guess you have very little experience in the realm of science labs making their research go. (Correct me if I'm wrong.) Depending on the lab funding and focus, this could definitely be something that fits someone's research focus and needs. And you're clearly not aware that this kind of thing has actually been done before (testing products from Japanese dealers to look for protected whale species is the study that comes to mind).\n\nIt absolutely would not be strange for someone to pay for work. They could be a crazy individual but that's not a lot different than a foundation, frankly. You have to worry about whether it looks like your results are influenced by your source of funding, but that's something to work around, not a stop.\n\nI mentioned in a different post, many labs (esp. smaller ones) may collaborate with smaller state govt agencies or other partners to do various tests on samples, ranging from water to genetics or hormones, as a way to turn a bit of a profit and fund their work. This is the perfect kind of thing for someone at a small SLAC if they have an experienced undergrad and could use a few grand to fund some more work.",
          "author": "imhereforthevotes",
          "created": 1610059299,
          "upvotes": 5,
          "replies": {}
        },
        "gigrppk": {
          "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigrppk/",
          "text": "what about adjunct profs, post docs and other non-tenured jobs?",
          "author": "linear_algebra7",
          "created": 1610052340,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gihu4jf": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihu4jf/",
      "text": "Whate state are you in? I know that UNC Chapel Hill has an undergraduate biology research course focused on mislabeled seafood products, could be something theyd be interested in!",
      "author": "Gr000vy-",
      "created": 1610071056,
      "upvotes": 2,
      "replies": {}
    },
    "gii1kgr": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gii1kgr/",
      "text": "As a professor with my own academic lab who does similar work, I’d do this on a weekend at home for the sort of cash you’re talking about. Many universities allow side consulting and work. I’d need to spend a good bit of it getting set up at home so it would need to be a set price that could cover that. Of course I’m looking to replace a spouses salary who lost a job in the pandemic. Might be able to find others in a similar situation.",
      "author": "dunnp",
      "created": 1610074931,
      "upvotes": 2,
      "replies": {}
    },
    "gih24j0": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih24j0/",
      "text": "I'd argue that yes, you can hire academics to do this kind of work. Obviously it depends a lot on the university set-up etc but plenty carry out contract work, it's not uncommon for academics to have side businesses ran within the university for this kind of thing or to chase their own ventures. \n\nIt might not fund a PhD student or a year with a post doc but I reckon you could easily have an undergraduate carry out the work (supervised) on a summer placement for that amount of money. Absolute worst case is you get referred to a friend or associate who can & will carry out the work in a non-academic institution.\n\nThe hard part is getting someone to actually read/respond to an email like this.",
      "author": "AussieHxC",
      "created": 1610057068,
      "upvotes": 2,
      "replies": {}
    },
    "gigqspo": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigqspo/",
      "text": "Yes, there is no problem",
      "author": "mr_kazemiro",
      "created": 1610051925,
      "upvotes": 3,
      "replies": {}
    },
    "gii8an6": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gii8an6/",
      "text": "You can pay a lab to do this.  There might be legal repercussions if the restaurant decides to sue you, but you can get the DNA test done just by paying a lab (you can also get things radiocarbon dated or materials SEM-EDS, FTIR’d, embedded and thin sectioned etc. from the appropriate lab at a university or some private companies.  \n\nSource: I am an academic, with a doctorate in natural sciences.  If your boss wants to pay me 20k to follow up his whims like this a few times a week PM me.",
      "author": "MrsAlecHardy",
      "created": 1610078562,
      "upvotes": 2,
      "replies": {}
    },
    "gigu8gj": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gigu8gj/",
      "text": "You can find contractor circles for independent academics and consultation but asking faculty, probably not.",
      "author": "playmo___",
      "created": 1610053475,
      "upvotes": 1,
      "replies": {}
    },
    "gihg4np": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihg4np/",
      "text": "This project could be done in a long weekend for someone with the right equipment. Hell, I'd do it for an excuse to practice a new technique. A PI isn't going to be wild about doing it, but I guarantee there's someone who would be interested, especially if you're willing to pay enough premium to leave them with enough left over to answer another question for a thesis or dissertation.",
      "author": "guttata",
      "created": 1610063826,
      "upvotes": 1,
      "replies": {}
    },
    "gihl6o0": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihl6o0/",
      "text": "This is the kind of millionaire I hope I'd be.\n\nI work in a university department that specializes in government and military contracts, with a bit of private sector work when we have free time. What you're describing isn't my field at all, but that's certainly something we would do if we had any clue how to do it.",
      "author": null,
      "created": 1610066405,
      "upvotes": 1,
      "replies": {}
    },
    "giho1or": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/giho1or/",
      "text": "sounds more like something a consultancy or industry lab would do",
      "author": "f33dmewifi",
      "created": 1610067884,
      "upvotes": 1,
      "replies": {}
    },
    "gihoi32": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihoi32/",
      "text": "I'd contact local reasearchers/academics with a track record in genetics/genomics. A lot of researchers will be familiar with setting up a project through a consultancy. I'm a PI in genomics and this wouldn't be unusual.",
      "author": "Kleeongg",
      "created": 1610068122,
      "upvotes": 1,
      "replies": {}
    },
    "gihqjp8": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihqjp8/",
      "text": "Absolutely. Go find a fish genetics lab and they will gladly run the samples for you. \nAlternatively find a sequencing lab that runs outsourced jobs. There’s a company in Colorado that runs barcoding for ~$100 sample.",
      "author": "zabulon_",
      "created": 1610069192,
      "upvotes": 1,
      "replies": {}
    },
    "giht75m": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/giht75m/",
      "text": "1. It's unethical and often illegal to use university resources for an outside contract. \n2. There are often provisions against moonlighting in faculty contracts or faculty handbooks. \n3. Other than that, I prefer envelopes with used tens and twenties, but I'll take a check.",
      "author": "7Sax",
      "created": 1610070571,
      "upvotes": 1,
      "replies": {}
    },
    "gii33dg": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gii33dg/",
      "text": "Ultimately, yes. Find the kind of lab who can do these analyses and ask if they do contract work. The prices will be more expensive for you because this work is not belonging to an academic institution, but if you pay the analytical fees, sure. \n\nContract work is how many labs stay afloat.",
      "author": "TourmalineTart",
      "created": 1610075747,
      "upvotes": 1,
      "replies": {}
    },
    "gii9m35": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gii9m35/",
      "text": "If the money is there and it actually is a non-trivial question...then why not. I'd certainly do it.",
      "author": "chmegr",
      "created": 1610079291,
      "upvotes": 1,
      "replies": {}
    },
    "gii9ut7": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gii9ut7/",
      "text": "There are actually a group of researchers who did DNA testing on whale meat illegally sold in Asian Markets. They might be interested?\n\nhttps://royalsociety.org/news/2010/dna-whale-meat/",
      "author": "mandajapanda",
      "created": 1610079428,
      "upvotes": 1,
      "replies": {}
    },
    "giivj9h": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/giivj9h/",
      "text": "There are a couple websites with freelance scientists, e.g. [kolabtree.com](https://kolabtree.com). Food science seems to be overrepresented, so maybe you'll have luck finding someone who has a lab at their disposal.",
      "author": "wirrbeltier",
      "created": 1610095513,
      "upvotes": 1,
      "replies": {}
    },
    "gijcily": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gijcily/",
      "text": "Something like this was done with an analytical facility (provides services to the public) at a university I attended. Let's just say it ended in an attempted lawsuit for defamation.\n\nSee the original news article: [https://www.cbc.ca/news/business/marketplace-chicken-fast-food-1.3993967](https://www.cbc.ca/news/business/marketplace-chicken-fast-food-1.3993967)",
      "author": "poniesgirl",
      "created": 1610111251,
      "upvotes": 1,
      "replies": {}
    },
    "gijfcsb": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gijfcsb/",
      "text": "You'd be better off looking at contract research organizations (CROs). There are tons of the out there, doing every kind of research you can imagine. I can't imagine many academics would be interested in this project, but CROs do what you pay them to do, no matter how interesting or novel it is.",
      "author": "hahahahawoo",
      "created": 1610113140,
      "upvotes": 1,
      "replies": {}
    },
    "gik2sc7": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gik2sc7/",
      "text": "Differently from what many others have answered, I can tell you that in some research fields (where it makes sense) universities do have facilities to which you can easily contract measurements.\n\nMy university hospital has a radiology department for research animals (CT, MR etc...) and you can just come here and ask to get your rat an MR. Not really your PET rat, but if you're a pharma company and you need to have your lab rats monitored you're welcome! And we actually have months long waiting lists. Most of the \"clients\" are labs of the university, but we're open to anyone from outside! You can actually contract an experiment and data analysis from something as silly as an experiment that takes not even a day!\n\nSimilarly a friend of mine works in a microscale materials facility in another university, where most of the \"clients\" are labs of the university. But companies (even big ones, including Huawei) ask them to build things, when they need prototypes (that are too small for the volumes with which they work in general). \n\nUniversities that have high sensitivity nuclear detectors are often contracted to analyze samples!\n\nInstead, if one wants to contract \"serious\" research (projects that take years and actual research thinking, not just using the machineries of the labs), most universities are open for that. It's a long project, you need to discuss with a professor what it will take (how many people, which equipment) and then you provide a grant to the university. And 99% of the time they'll be super glad to do it! Unless it's something so wacky that it's not going to be good on a researcher CV",
      "author": "lucaxx85",
      "created": 1610125052,
      "upvotes": 1,
      "replies": {}
    },
    "gih00pq": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih00pq/",
      "text": "If it is possible for a student to write something about it (e.g. Bachelor thesis) you can easily convince a lab to do random small research projects for you.",
      "author": "noknam",
      "created": 1610056096,
      "upvotes": 1,
      "replies": {}
    },
    "gih0s0i": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih0s0i/",
      "text": "He might find somebody who is willing to do it for free, if they think there might be a publishable paper at the end.\n\nSeveral academics do consulting work as a sideline, so that's an option.\n\nBeyond that, he effectively wants to be a one-man research funding body for this mini-project. Twenty years ago I expect this would have been accepted with few questions and a win-win. Nowadays the legal hurdles and overheads might make it more trouble than it's worth.",
      "author": "radams78",
      "created": 1610056444,
      "upvotes": 1,
      "replies": {}
    },
    "gih2j6s": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih2j6s/",
      "text": "Try some of the lab managers at the university. Not technically faculty, but they could often use some extra cash and would know who might be willing to do it.",
      "author": "Top_Place_2507",
      "created": 1610057262,
      "upvotes": 1,
      "replies": {}
    },
    "gih5e0p": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gih5e0p/",
      "text": "That can totally happen. Labs may make a sort of business of testing water, or doing other labs' test (sexing lab animals or field subjects, for instance, or doing hormone or genetic analyses), as a side gig for funding the lab. If you were to hire someone outright to work for you full time they could probably look into whether it conflicted with their contract.",
      "author": "imhereforthevotes",
      "created": 1610058608,
      "upvotes": 1,
      "replies": {}
    },
    "gihew9e": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/gihew9e/",
      "text": "Where are you all that some lab at your institution wouldn't take 10K for some fairly basic work? Yeah it is not a million dollar grant but the OP is basically willing to buy you an summer researcher in exchange for barcoding some fish. Come over to a GOP run state and you will find lots of takers.\n\nFor OP: https://www.nytimes.com/2016/07/25/business/vw-wvu-diesel-volkswagen-west-virginia.html lots of science labs survive on contract research/analysis of one type or another.",
      "author": "Outside-Western365",
      "created": 1610063217,
      "upvotes": 1,
      "replies": {}
    },
    "giheyxo": {
      "link": "/r/AskAcademia/comments/ksln94/can_you_just_hire_academics_for_research/giheyxo/",
      "text": "This isn't my field, but as others have noted it's not really out of the norm for professors/researchers to take on consulting work.\n\nYou can go with a contract lab/consulting firm or try approaching faculty directly; no one should get too offended, they might just say no.",
      "author": "WrestlingStuffGuy",
      "created": 1610063253,
      "upvotes": 1,
      "replies": {}
    }
  }
}