{
  "sid": "ratpjp",
  "link": "/r/AskAcademia/comments/ratpjp/accident_covid_and_mental_health/",
  "title:": "Accident, Covid, and Mental Health",
  "text": "Hey everyone,   \n\n\nso long story short I went from straight A student to currently failing three of my classes. I was in a life altering accident at the start of the semester and then got COVID on top of that during my recovery. My mental health went to crap, and I couldn't face my professors.  \n\n\nI procrastinated sending them emails with status updates and was not transparent in communication. Surprisingly, I have good grades in my exams; so it's not as if I haven't done a thing in my classes. I am just missing the assignments- not the exams. I do have everything documented with the disability department in my university. I believe that since I have the exams done. I can finish all of my pending assignments by the end of finals week.   \n\n\nHow hard do you think it will be to receive that chance or maybe an incomplete grade in the meantime? My scholarship, GPA, and graduation depend on it. If I fail these three classes, my scholarship will be gone along with my GPA, and I will not be graduating. Moreover, it would tank my mental health even more. I plan on explaining all of this in my email, and just being transparent that my mental health stopped me from being communicative until it was too late. Should I contact the disability department for help first?  \n\n\nThank you for your thoughts!",
  "author": "UpstairsMachine0",
  "created": 1638862617,
  "updated": 1639515572,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.7,
  "comments": {
    "hnkoru8": {
      "link": "/r/AskAcademia/comments/ratpjp/accident_covid_and_mental_health/hnkoru8/",
      "text": "First - managing to maintain good exam grades despite all you’ve been through is incredibly impressive. You should be very proud of yourself. \n\nTo answer your question: It might depend on the university, course, and type of assignment but, from my experience, I would definitely contact the disability office first. They might be able to set up automatic extensions for you (or, you may already have these since you’re already registered with the disability office). In this case, your professors will just be notified of the disability based extension rather than you having to ask them directly. I would at least see what accommodations are available to you. The disability office can also provide resources to help you get through the work without burning yourself out. \n\nWhen/if you contact your professors directly about this, you might want to also explore alternative weighted grading (e.g. hand in the assignments for credit but have final grade depend on exam scores). Although this may be a more likely option in an arts program rather than sciences.\n\nIf all else fails, appeal to the academic board to keep your scholarship. \n\nBasically, use every option available to you. \n\nGood luck! Rooting for you!",
      "author": "Squirtysausage",
      "created": 1638868355,
      "upvotes": 7,
      "replies": {}
    },
    "hnl0i7m": {
      "link": "/r/AskAcademia/comments/ratpjp/accident_covid_and_mental_health/hnl0i7m/",
      "text": "Talk to the dean of students about doing a retroactive medical withdrawal from your classes.",
      "author": "abandoningeden",
      "created": 1638877993,
      "upvotes": 4,
      "replies": {}
    },
    "hnlw2od": {
      "link": "/r/AskAcademia/comments/ratpjp/accident_covid_and_mental_health/hnlw2od/",
      "text": "At the University I teach at you have to be passing at the time you request an incomplete.  This late in the semester there would be nothing I could do as a professor.  I second the comment that you should discuss your options with your academic advisor.",
      "author": "ilikroxnmfrenslikrox",
      "created": 1638893844,
      "upvotes": 2,
      "replies": {}
    }
  }
}