{
  "sid": "r5rwwk",
  "link": "/r/AskAcademia/comments/r5rwwk/research_psychology_phd_fast_track/",
  "title:": "Research Psychology PhD Fast track",
  "text": " Hi all,  \n\n\nI'm new here so I hope this is the right place to post. I am currently an M.A1 student in research psychology and my supervisor is telling me he would like me to fast-track my project to PhD. I have a few questions and concerns.  \n\n\nLet me start by saying that I've been with him and at my lab for 5 years (undergrad, and MA1) and he and I have a great relationship. I do not intend to stay in academia and would like to go into industry after graduating.  \n\n\nI guess first and foremost, what did your guys' timeline look like for you who fast-tracked? I know it is heavily variable from person to person, but how many years of PhD did you guys do do after you fast tracked? Did you feel like it was the right decision for you? Finally, a concern of mine that I have heard from others and would like your opinion, do you think you are overqualified for most positions because you have a PhD?",
  "author": "Lindemann_",
  "created": 1638291979,
  "updated": 1638479847,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmprn2k": {
      "link": "/r/AskAcademia/comments/r5rwwk/research_psychology_phd_fast_track/hmprn2k/",
      "text": "Can't comment on fast track PhDs but the comment about being over qualified if you have a PhD is a common trope and not one I've seen particularly play out. There aren't enough jobs in academia for all the PhDs but I don't see many joining the doll queue for welfare benefits. \n\nIf you want to go work in a corporate environment where most people don't have a PhD then yes, having a PhD may be a bit confusing to employers but a well written cover letter will get you past that. However, there are a vast number of jobs loosely associated with academia/research/higher education where PhDs are very common. This is everything from government to funders to NGOs to intergovernmental orgs to university adminstration to think tanks to R&D companies to clinical psychology and so on.",
      "author": "ACatGod",
      "created": 1638308703,
      "upvotes": 1,
      "replies": {}
    }
  }
}