{
  "sid": "pumr2f",
  "link": "/r/AskAcademia/comments/pumr2f/business_school_faculty/",
  "title:": "Business School Faculty",
  "text": "This subreddit doesn’t have much discussion about business school academia (probably because there are relatively few people in this area). \n\nCan anyone who is faculty (preferably TT) at a b-school comment on how you enjoy your career choice? What is the lifestyle like? Are you glad you went this route vs. private industry?",
  "author": "zeegraggs",
  "created": 1632499197,
  "updated": 1634078857,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.84,
  "comments": {
    "he3ve1r": {
      "link": "/r/AskAcademia/comments/pumr2f/business_school_faculty/he3ve1r/",
      "text": "I'm a TT economist in a business school at a SLAC. The lifestyle is incredible. Between teaching (two or three classes a semester) and research, I probably \"work\" 40-45 hours a week (this number drops considerably in the summer). Tenure requirements aren't burdensome, and I'm given an incredible amount of agency. \n\nI'm absolutely glad I went this route. Compensation is great (perk of b-school faculty), plus I still consult in industry (and am given almost unlimited freedom to do so), which makes up for any possible wage differential.",
      "author": "no_three_ways",
      "created": 1632500243,
      "upvotes": 9,
      "replies": {}
    },
    "he3vmip": {
      "link": "/r/AskAcademia/comments/pumr2f/business_school_faculty/he3vmip/",
      "text": "I am not faculty, but I know a few. For some industrial engineers, you can do almost the exact same research and make significantly more money... like double. I'm not even joking there - take a look at [University of Iowa](https://provost.uiowa.edu/data-and-reports/departmental-faculty-salary-reports) salaries. Often it seems like a higher teaching load. \n\nAlso, I know a b-school professor who got his PhD in sports management and is super laid back, teaches a reasonable amount, and still does research. Seems like he's killing it.",
      "author": "SpetsnazCyclist",
      "created": 1632500342,
      "upvotes": 5,
      "replies": {}
    },
    "he3wwdv": {
      "link": "/r/AskAcademia/comments/pumr2f/business_school_faculty/he3wwdv/",
      "text": "(Language Warning): I FUCKING LOVE IT! \n\nB-schools have become what academia *should be*. \n\n&#x200B;\n\n>how you enjoy your career choice?\n\nIt's exceptional. Many B-Schools have become dynamic and entrepreneurial both in spirit and nature. You have schools with student-led investment funds work several $ million (AUM) that you can advise; they support business incubation and promote industry connections. In essence, you can directly apply your research and teaching to current issues. And, they'll promote the hell out of that. I enjoyed working in the private sector, but I was always drawn to tackling bigger issues and asking questions. I was formerly in consulting which pretends that it seeks to find those who are inquisitive, but it's not in its business nature. Academia offers you the ability to carry both public and private research grants. You can teach, consult, advise and support. You can make money from your myriad of ventures while also nurturing undergraduate and graduate students who'll go on into industry. It's the best of all worlds. \n\n&#x200B;\n\n>What is the lifestyle like?\n\nDepends. If you're at a B-School (and not just a business faculty within, say, arts and science) you'll find that most of them have become partially autonomous from the larger university and manage many of their own functions in-house. It shortens timelines for research approval (standard REB processes can last months). You'll also find that they generally pay better. As a result, it's a good lifestyle. I usually teach 2-2-1 (1 on overload), but I can work with the program coordinator/chair/dean to augment my schedule as needed and have done 4-0-0 before. Generally, it's a great lifestyle. \n\n&#x200B;\n\n>Are you glad you went this route vs. private industry?\n\nPrivate industry is great, but it becomes rote. After several years, you've mastered the skills you'll need in any technical area, and with moderate amounts of continuing training, you'll stay current; but, over 10 years, things don't change that much. I need something new or I lose interest. The trade-off is that I'm teaching, consulting, researching, writing and advising in the same week. I don't have weeks where I'm focused on one thing or prepping for a major client meeting. If you want to be in leadership in the private sector, your best bet is still the good old MBA. But, if you want to be in an area of research in the private sector, then a PhD is great (just be careful *what* PhD you get).\n\n&#x200B;\n\nI have friends in policy, communication studies and the social sciences. A major problem is that jobs are few and far between; it's hard for people to get research funding and the connections to industry and private sources of revenue are scant. Business is the opposite: There are far more opportunities for business professorship than say sociology. You're also well positioned to bring in private money which universities support, so you always have administrative support. \n\n&#x200B;\n\nIt's a great career and a great option. I left well-paying consulting jobs to enter academia. Never once have I regretted my decision. Not once.",
      "author": null,
      "created": 1632500862,
      "upvotes": 6,
      "replies": {}
    },
    "he4opku": {
      "link": "/r/AskAcademia/comments/pumr2f/business_school_faculty/he4opku/",
      "text": "I would love to hear more about business academia stories as well. \n\nI'm FT non-TT, but I love my job. I run a co-curricular program in finance at my school and teach finance classes too. Compared to industry there are obvious pros/cons. The biggest con is that I come from startup VC world where things can move much faster, compare that to state school where I need 4 different committees to approve my lab renovations and they only meet once a month... Then after I get all the approvals, the campus facilities people are understaffed and declare they can't do any new projects for at least a year. Despite my having funds available for it. \n\nBut the work life balance is actually much better for me than I hear about from other professors on reddit. I'm not doing research of course, but I am running a bunch of student teams that need training and workflows and regular monitoring. I have 4 preps all M/W so my T/R/F are open for working on the programs. I have a 1 course buyout for the program I run. \n\nI teach an MBA level course and the rest are UG. I like the engagement from the MBA students, they are genuinely interested in the topic, compared to my Finance 101 class for non-business majors where they are doing it for an \"easy A\" and don't care about anything I have to say.\n\nMy biggest regret in going education over private practice is that I definitely make less money. I have a family, and work/life balance is important to me to be with my son as often as I can. But if I quit work, ignore my family and go into business for myself I can make my same salary or more relatively quickly. My way to counter that need is that I plan to take all next summer to start a consulting gig and then hopefully set it on a relatively autopilot to increase the income I make.",
      "author": "TheJaycobA",
      "created": 1632512511,
      "upvotes": 5,
      "replies": {}
    },
    "he651k8": {
      "link": "/r/AskAcademia/comments/pumr2f/business_school_faculty/he651k8/",
      "text": "I think it's about as good as you can get in terms of academic lifestyle:\n1. Great salary and extra earning potential. My 9 month base is around 200k and last year I earned substantially more than that. \n2. Great research freedom, provided of course you can publish the kinds of flashy papers that appear in FT50 journals. Need to publish 5 \"A\" papers for tenure. While I have good technical skills, my real research strengths are finding interesting problems and writing clearly. So the expectations (quality over quantity, no grant writing) match my strengths.  \n3. B School cares about teaching (also plays to my strength as I'm an excellent teacher). Standard load is 3 or 4 class sections a year. MBA students are demanding, but students generally are eager to learn. Great for people who enjoy teaching and a totally different teaching culture than what is often found in \"R1\" academia where teaching is considered a burden.\n4. For schools that have them, PhD programs are small and funded by the school (not grants), so faculty have to be good advisors or students will work with someone else. Small program makes the mentoring experience enjoyable for me (no expectation to graduate tons of students).\n5. Good job prospects because most B schools don't have a PhD program but all need to hire PhDs to attain AACSB accreditation. \n\nThis is based on my experience at a couple different top 100 research oriented AACSB business schools. \n\nI enjoy my job. \n\nPS. My PhD is not in Business. I was hired from an adjacent field. I easily earn double and have less research pressure (primarily because I don't need to win grants) compared to colleagues in my \"home\" discipline.",
      "author": "DeskAccepted",
      "created": 1632535745,
      "upvotes": 2,
      "replies": {}
    },
    "he9atcm": {
      "link": "/r/AskAcademia/comments/pumr2f/business_school_faculty/he9atcm/",
      "text": "I've been business faculty for over 25 years. It's been a good life. \n\nLet me address industry first. \n\nI enjoyed it. I was in a position where my problem solving abilities were used and valued. Had I stayed there, my employer would  have paid for my masters degree. I would have steadily risen up the ladder and I'd be making far more money today. BUT - I had one week of vacation per year. One. I had to work an entire year with no vacation to earn the first week. Every five years, they added a week until you had four weeks a year (after working there 20 years). I didn't want to live that way.\n\nBut this was 30ish years ago and industry has changed. If I had the work flexibility and vacation that I see my nieces and nephews getting in industry, I might have stayed. Instead, I quit and went to graduate school.\n\nThat brings me to life in academia.\n\nMuch of my business faculty career was spent at smaller colleges. At first it paid poorly. There's a huge over supply of PhDs in some fields and they can be hired very cheaply. Small schools wanted business faculty for the same salary. I switched to a school that understood the market better and made a good living for over 20 years. Again, less than I would have made in industry but more than enough to have a decent life for my family.\n\nThat was then. The world changed. Demographic and economic forces are hitting small colleges pretty hard. Some are making deep cuts and some aren't going to survive. My employer knew that business was *by far*, the largest program on campus but they wanted to use those tuition dollars to subsidize the rest of the college. Some business faculty left and weren't replaced. Since faculty in other areas weren't being replaced, it would have \"looked bad\" to replace business faculty. I took on extra work without additional compensation. I went four years without a raise. Then they cut my pay.\n\nI left. \n\nNow I teach in the business school of a fairly large public university. I'm seeing a lot of what PGMBAA mentions. They have resources. They're developing new programs. Yes, there are still demographic challenges, but we are finding creative, entrepreneurial ways to address them. One of my classes is all online with over 400 students but most classes have 40 to 50 students. Some classes are even smaller. We think about different delivery methods for different content and students. By mass communicating in some areas, we can be more high-touch in others.\n\nTeaching isn't right for everyone. I like teaching and I still occasionally bitch & moan about my students. But if you like teaching, business faculty at a public university is a pretty good job.",
      "author": "WisconsinBikeRider",
      "created": 1632599157,
      "upvotes": 1,
      "replies": {}
    }
  }
}