{
  "sid": "bahd8m",
  "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/",
  "title:": "Have your academic pursuits ever cost you relationships?",
  "text": "Context: Recently left a 2 year relationship because distance couldn't keep working (I'm studying for a masters and she worked a lot, so were seeing eachother less frequently). The final straw was my accepting a PhD at the end of this course, which she'd supported my intention to do throughout, but the prospect of several more years of long-distance was too much. \n\nHave any of you had similar experiences? How did you move past them?",
  "author": "thatsnotmyname95",
  "created": 1554650831,
  "updated": 1634080745,
  "over_18": false,
  "upvotes": 186,
  "upvote_ratio": 0.99,
  "comments": {
    "ekbk92x": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbk92x/",
      "text": "Just accept the fact that you’re actually in married to your adviser and seeing anyone else is cheating ",
      "author": "truniht",
      "created": 1554653310,
      "upvotes": 240,
      "replies": {
        "ekbl302": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbl302/",
          "text": "I can't marry my advisor, she's already acting as my mother.",
          "author": "Grumblepuffs",
          "created": 1554653904,
          "upvotes": 183,
          "replies": {
            "ekbu5i8": {
              "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbu5i8/",
              "text": "As of late, I think I've seen my advisor more times than most of my friends...",
              "author": "CaptainKoreana",
              "created": 1554660407,
              "upvotes": 25,
              "replies": {}
            }
          }
        },
        "ekbqcrn": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbqcrn/",
          "text": "At the end of your doctoral educational your advisor divorces you and you marry science.\n\n\nScience has an ongoing relationship with many others but expects you to be monogamous.\n\n\nIt is even more capricious and jealous than your advisor. It frequently doesn't work out but it is worth the ride.  *(Or so I keep telling myself.)*",
          "author": "polished_iconoclast",
          "created": 1554657647,
          "upvotes": 52,
          "replies": {}
        },
        "ekdrh0q": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekdrh0q/",
          "text": "In this case my advisor is the husband that went out for smokes and never came back",
          "author": "MsFaolin",
          "created": 1554725564,
          "upvotes": 4,
          "replies": {}
        },
        "eke9u2j": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/eke9u2j/",
          "text": "My partner used to \"joke\" about this. ",
          "author": "imnotzuckerberg",
          "created": 1554739946,
          "upvotes": 1,
          "replies": {}
        },
        "ekblc1s": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekblc1s/",
          "text": "Considering how many cases there are of advisors sexually harassing their students, I find this “joke” to be in poor taste. ",
          "author": "AceyAceyAcey",
          "created": 1554654085,
          "upvotes": -62,
          "replies": {
            "ekblsns": {
              "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekblsns/",
              "text": "I’m sorry to hear that. I hope you make a quick recovery.",
              "author": null,
              "created": 1554654420,
              "upvotes": 56,
              "replies": {}
            },
            "ekeml8a": {
              "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekeml8a/",
              "text": "Sorry I didn’t mean it as a joke. It’s just an awful truth.",
              "author": "truniht",
              "created": 1554747962,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ekblmv2": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekblmv2/",
      "text": "I was with my ex for a couple of years, doing long-distance. When she decided to do a PhD, it meant that we would have been long-distance for at least several years more. She broke it off.\n\nI can't say your experience will be anything like mine, but it took me a long while to get over her. I put all of her pictures and belongings into a box and stored it away (they say you should get rid of everything that reminds you of the other person). I couldn't bare myself to throwing everything away, so a box away from view sufficed.\n\nI then read advice that after a breakup, you should focus on yourself, try new hobbies, meet new people, etc. I picked up social dancing lessons, horse-back riding lessons (for a short bit, too expensive in the long run), swimming lessons (yes, as an adult), and I volunteered my time at a charity shop. I needed to stay busy, and it helped keep me sane, otherwise, I would end up depressed in my bedroom thinking about my ex. I'm also naturally a very shy person, so social dancing was perfect because it allowed for female contact without having to start a conversation.\n\nIt took me six months before I started feeling like a normal person again. After one year and I felt ready to start dating again. I think 1.5 years later is when I met someone new that I really, really liked (and eventually married). Although I have to admit, the first year into my new relationship I was scared my ex would try to come back to me, because I wouldn't have known who to choose. Anyways, I'm glad I'm married to my now wife.\n\nI still have a place in my heart for my ex, we had an incredible relationship, and I'm happy that we had it, but I'm also more thankful that I'm with my wife. My ex was a good person, but I never knew a relationship could be so much better until after I met my wife.\n\nAnyways, only time will heal you. The best thing you can do for yourself is to stay busy and focus on becoming a better person. It's a slow process, but for every day that goes by, is one day closer towards recovery.\n\nHope you didn't mind my ramblings. Take care of yourself.",
      "author": "resubleu",
      "created": 1554654301,
      "upvotes": 120,
      "replies": {
        "ekc00n3": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekc00n3/",
          "text": "Thanks for sharing this. It’s been 16 months and I am trying to stop thinking about my ex and the love I have for her (while she has moved on). Finding someone new and connecting to them (for a relationship) feels so much work right now that I don’t dare to indulge myself in (given my busy work schedule). As you said the healing would take time; I guess it’s a slow one for me.",
          "author": "vingeran",
          "created": 1554664550,
          "upvotes": 12,
          "replies": {}
        },
        "ekd8tkh": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekd8tkh/",
          "text": "Not a typical experience, as you were allowed to focused on yourself instead of your work.",
          "author": "lednakashim",
          "created": 1554698054,
          "upvotes": -3,
          "replies": {}
        }
      }
    },
    "ekblnhn": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekblnhn/",
      "text": "Yes. My 15 month relationship ended a month ago. I just couldn’t do both. I was exhausted. I started neglecting his needs in order to satisfy my own - things like needing a night to myself after a long week, etc. It just created issues because it started to seem like I was always making excuses not to see him, but I honestly was just so fucking tired from school that I had nothing left in me to make someone else as happy as they deserve. ",
      "author": "cascaderade",
      "created": 1554654315,
      "upvotes": 56,
      "replies": {
        "ekdbm0r": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekdbm0r/",
          "text": "Wow I feel this so deeply. And it helps to hear it from other people and know that I'm not actually the only person going through this.",
          "author": "LordSariel",
          "created": 1554701269,
          "upvotes": 4,
          "replies": {
            "eke4636": {
              "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/eke4636/",
              "text": "You're not. It's happening to a lot of us.",
              "author": "cascaderade",
              "created": 1554736156,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ekbmg2a": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbmg2a/",
      "text": "Yeah, that's the reality of going the academic route. Perpetual 2-body problem unless you find someone that will follow you around when you have to move every few years.",
      "author": "diskprept",
      "created": 1554654879,
      "upvotes": 33,
      "replies": {
        "ekc0pdr": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekc0pdr/",
          "text": "Even if you find someone who will go with you it’s hard because of stress and long hours. I’m a medical resident and this year (intern year) has almost cost me my engagement even though my fiancé moved with me. We are going to work through it... but it’s brutal being at this level. I don’t know, does medicine count as academia? Similar, anyway",
          "author": "bubblebathory",
          "created": 1554664998,
          "upvotes": 12,
          "replies": {
            "ekdjigf": {
              "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekdjigf/",
              "text": "I know what, you mean, I got married the summer before my 1st year PHD, and the physical presence but mental absence just drags on the relationship so much. ",
              "author": "InfuriatingComma",
              "created": 1554713769,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ekbnv9j": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbnv9j/",
      "text": "Ugh. Does anyone have a good story? I’m moving this fall (only an hour away) to do an MS and I’m really concerned about how it will affect my relationship. We’ve been together 2.5 years (lived together for 1 year) and have a cat :/",
      "author": "arl1286",
      "created": 1554655909,
      "upvotes": 22,
      "replies": {
        "ekcp568": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcp568/",
          "text": ">Does anyone have a good story?\n\n&#x200B;\n\nMet my now almost wife just after applying to grad school. We dated for 7-8 months and then I moved 8 hours away.\n\n&#x200B;\n\nWe spoke nightly, not always long conversations. We visited each other when we could until she graduated. She lived with me for a year and then moved even further away for another year. She came back and we've been together ever since.\n\n&#x200B;\n\nIt was difficult and sometimes didn't feel like we were alway \"together\" but I'm excited to marry her soon. It was worth it. She isn't an academic and never wants to be though. The PhD is a minor accomplishment compared to my relationship with her.",
          "author": "AVeryVIPPerson",
          "created": 1554681573,
          "upvotes": 8,
          "replies": {}
        },
        "ekbpkxj": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbpkxj/",
          "text": "Hey I posted above but I was in a situation close to yours. When I did my master's, I had to move about an hr and a half away from my boyfriend (now husband). It really wasn't so bad. We usually spent 2 sometimes 3 weekends a month together. We didn't live together before this though, but had been together several years. Much harder was starting my PhD (even though we lived together finally), which I did right after getting married. Took at least 2 years to adjust to the demands and toll it took on our relationship, but things are pretty solid now. He did have to move for me out of state when I started my program.",
          "author": "sadgrad2",
          "created": 1554657110,
          "upvotes": 8,
          "replies": {
            "ekbpsyo": {
              "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbpsyo/",
              "text": "That definitely makes me feel better! Do you have any tips or things that you guys did that you felt worked well? We’re planning on spending most weekends together, but that could change once I start the program and actually see my workload.",
              "author": "arl1286",
              "created": 1554657265,
              "upvotes": 2,
              "replies": {
                "ekbqw2v": {
                  "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbqw2v/",
                  "text": "During the \"long distance\" part, we talked a lot on the phone. Not necessarily long convos but frequently. We also took a yearly trip away together. It's pretty essential that your partner be understanding of the huge workload and pressure you'll be under and that this means you'll not be always able to give them as much attention. But you at the same time can't fall into the trap of becoming so overwhelmed by everything that you constantly choose work over your partner. You have to carve out time to prioritize your relationship, even though it may always seem like there's something you need to be working on. This for me was where I struggled the most at the beginning of the PhD. I neglected him a lot, to be honest. And although he mostly was understanding about how much stress I was under, it's not fair to the other person to not give them your time and attention and care about their struggles. That really takes a toll.\n\n I hope things work out for you!",
                  "author": "sadgrad2",
                  "created": 1554658029,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "ekc26ht": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekc26ht/",
          "text": "An hour away should be fine. That's some people's daily one-way commute.\n\nEdit: At one hour away, can't you both move together to the midpoint? Then it's a 30-minute commute for both of you. ",
          "author": "notadoctor123",
          "created": 1554665939,
          "upvotes": 6,
          "replies": {
            "ekcrz0a": {
              "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcrz0a/",
              "text": "He owns the house we live in now and already has a 45 minute commute. It wouldn’t be practical. ",
              "author": "arl1286",
              "created": 1554683881,
              "upvotes": 5,
              "replies": {
                "ekcu3hu": {
                  "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcu3hu/",
                  "text": "Ah I gotcha. Still, an hour away isn't terrible. ",
                  "author": "notadoctor123",
                  "created": 1554685594,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "ekbpvb7": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbpvb7/",
          "text": "I’m only about a year in on the distance, but my partner’s in law school across the country while I’m in a biomedical PhD program. It’s hard, but one plus it that it’s brought a lot of future planning to the forefront that might have been put off otherwise.",
          "author": "femfish",
          "created": 1554657310,
          "upvotes": 3,
          "replies": {}
        },
        "ekbpz5e": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbpz5e/",
          "text": "I posted a bad one, unfortunately. My ex lives an hour away also. It started becoming so difficult to drive to him after the week was done. He came to me one night during the week and that helped, but I was never really “there” with him. I was constantly thinking about my research or what deadline was coming up. I hope things work out differently for you, but it certainly didn’t help that my ex isn’t an academic and doesn’t understand what it is we are going through every day. ",
          "author": "cascaderade",
          "created": 1554657385,
          "upvotes": 5,
          "replies": {}
        },
        "ekc0711": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekc0711/",
          "text": "I met my current boyfriend when I started grad school and he thinks I'm really cool and is supportive when I need to slave or travel, and we're very happy. If your relationship falls apart because your life goes forward, it's not the end of the world - it just means you're moving on to something that suits you better.",
          "author": "thegreenaquarium",
          "created": 1554664662,
          "upvotes": 4,
          "replies": {}
        },
        "ekco2ab": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekco2ab/",
          "text": "I met my partner while doing my masters. When I got accepted into a PhD program in a different country, he moved with me. Once I'm finished, he gets to make the next moving decision. This works for us, and we're both happy. ",
          "author": "goatsnboots",
          "created": 1554680724,
          "upvotes": 2,
          "replies": {}
        },
        "ekdeii7": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekdeii7/",
          "text": "My partner and I (not married yet) have been together for 7 years and still going strong even though I moved to the other side of the world to pursue my PhD. He was and is 100% behind me in my decision to do this. It’s been one year since I moved away, and we went the first 10 months without seeing each other because he was unemployed and neither of us could afford a trip. He’s now employed and coming to visit me next week for two weeks! We decided 10 months apart was way too long so we have plans to see each other every 3-4 months. I’m going to try to attend conferences that are closer to him. \n\nEvery few months doubt creeps into my mind about why we’re still long distance after 7 years and why we seem to be getting further apart in distance, rather than closer. But I know that there’s no one else I’d rather be with, and I wouldn’t be here without his support. We’re both so deeply committed to each other and we know that things will work out for the best. ",
          "author": "kemps-ridley",
          "created": 1554705267,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ekbs7uf": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbs7uf/",
      "text": "My research just cost me the love of my life. Really broken up and considering quitting all together. This shit just isn't worth it anymore.",
      "author": "grawfin",
      "created": 1554659008,
      "upvotes": 20,
      "replies": {
        "ekczvh2": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekczvh2/",
          "text": "Don't quit everything until you've had time to heal from your relationship. You may think that you'll never feel whole again, but you will. It just takes time. Just don't make any rash decisions about other aspects of your life while your feeling broken over your love life. It will get better.",
          "author": "baileybird",
          "created": 1554690208,
          "upvotes": 10,
          "replies": {}
        },
        "ekco5ue": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekco5ue/",
          "text": "Nothing should cost you the love of your life man. People provide so much more than a career ever will. ",
          "author": "goatsnboots",
          "created": 1554680801,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "ekbnsyj": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbnsyj/",
      "text": "Gods, the lack of roots you have while pursuing postgrad opportunities is oftentimes brutal. My MA and PhD are certainly partially to blame for the ending of my marriage, which, ultimately I was very glad for because she turned out to be an awful human. My academic pursuits meant my attention was no longer on her fully, which she disliked, and I think she resented my drive and success (if you could call it that) some as well. That, combined with serious mental illness and a shitty character led to her to cheat for almost two years before I found out and ended it. It was she who pushed me to move over 600 miles away to start my PhD. I thought it was because she cared, but really it was because it would make it a lot easier to continue to cheat and have a spouse who financially supported her. It wasn't easy at all, but I'm so glad I was able to figure out what a horrible person she was sooner rather than later. \n\nSo I guess...academia can cost you relationships, but I'd like to think it's for the best most times. ",
      "author": "Has-Died-of-Cholera",
      "created": 1554655865,
      "upvotes": 35,
      "replies": {}
    },
    "ekboyyh": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekboyyh/",
      "text": "Twice. I date smart women, and the result has been diverging professional trajectories. \n\nIt makes me sad sometimes.",
      "author": "lazyadjunct",
      "created": 1554656678,
      "upvotes": 15,
      "replies": {}
    },
    "ekbynv3": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbynv3/",
      "text": "My SO works in construction. So he can literally find work anywhere. I teach in the liberal arts. He doesn’t understand why I can’t just quit my job and find another one teaching at another college. He gets really frustrated at my workload, lack of pay, and lack of support and doesn’t understand why I do it. I’ve considered going into the corporate world but the benefits in academia are sooo much more feasible to my lifestyle and mental health m (not worrying about affording healthcare, being able to schedule a dental cleaning at 11:30am on a Tuesday without consequences, working from home 75% of the time, student loan forgiveness programs..).\n\n I’ve tried explaining to him that if I take another teaching job that offers these types of benefits means I will be leaving the state, which we can’t reasonably do right now because he has shared custody of his 6 year old daughter. It’s tough and we’ve almost hit our breaking point several times. He hates my industry more than most people I know, which is impressive, maddening and depressing. ",
      "author": "drbzy",
      "created": 1554663630,
      "upvotes": 15,
      "replies": {}
    },
    "ekbmzi7": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbmzi7/",
      "text": "While it's not ideal in any way and bothers me more than I'd like sometimes, the nature of academia lends itself to a) breakups due to distance, workload, or some combination of both, b) a two-body problem that never resolves itself, but that you both slog through, or c) one person is the \"trailing spouse\"/ partner. And even IF you both get a gig at a single place or in a single city, you're sort of stuck there to a certain extent because if one of you wants to leave the chances of the next place doing a spousal hire is unlikely at best.\n\n&#x200B;\n\nEither way, I know I'm preaching to the choir here, but I guess I just want you to know that I empathize and often reflect on how many academics are in the same boat -- myself included. I feel like I worked so long and so hard for this degree, yet I've jeopardized my personal life to do so. It is a \\*real\\* bummer, to say the least, and super freakin' lonely sometimes.",
      "author": null,
      "created": 1554655268,
      "upvotes": 15,
      "replies": {}
    },
    "ekbntrs": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbntrs/",
      "text": "At the end of my Master’s I found out my wife was having a bunch of affairs and she blamed it on me not being attentive enough (even though we had talked about this before me entering the program). After my Master’s was over and before I found out she cheated, she realized that, well, it was just that being a TA and grad student takes a lot, especially when you already have ADHD and an anxiety disorder.  \n\nIf you can’t tell by now, it wasn’t all because of the Master’s. That just exacerbated the issues that were already there, but yeah, this life is not for people who can’t stand to be alone during busy times. I’m in a relationship now with someone who enjoys their personal space and alone time, and things are going pretty well. ",
      "author": "AnHonestApe",
      "created": 1554655880,
      "upvotes": 13,
      "replies": {}
    },
    "ekbldva": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbldva/",
      "text": "Doing LDR to start my PhD 10 years into my relationship made things rocky, but we pulled through. ",
      "author": "AceyAceyAcey",
      "created": 1554654121,
      "upvotes": 12,
      "replies": {}
    },
    "ekc78tl": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekc78tl/",
      "text": "Yes. Good riddance to him. I was given the ultimatum of my academic pursuit (give up going to school) or lose him. It was a horribly unequal partnership- he could work 60 hours a week (elected overtime) and I was expected to not be upset or miss him. OK fine- you keep kicking butt! I miss you but you’re doing great.\n\nWhen the shoe was on the other foot it wasn’t ok. Zero support. And ultimately he used my lack of availability to be the excuse as to why he cheated. \n\n",
      "author": "peep_quack",
      "created": 1554669190,
      "upvotes": 10,
      "replies": {
        "ekp0tyc": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekp0tyc/",
          "text": "Sorry to hear that. Such bs double standard but you deserve better obviously.",
          "author": "winner_in_life",
          "created": 1555051560,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ekbkun3": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbkun3/",
      "text": "We pursued MS on opposite sides of the country. Tried to make it work but couldn't. It sucked at first, but I doubled down on my research, got into some new activities in what little free time I had, and had friends to lean on when it was tough. I think time is the biggest factor. Keep your head up! It gets better!",
      "author": "geohunt",
      "created": 1554653742,
      "upvotes": 8,
      "replies": {}
    },
    "ekblzem": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekblzem/",
      "text": "Broke up when I left the country for a masters. Was very tough - I was emotionally in a state of commitment where I was ready to go for the long haul. She didn't even want to think about marriage. I still miss her from time to time. It was a great relationship, but we had different things we wanted out of life. Years later, we are both much better off for it. Frankly, I'm starting a PhD in the fall (moving again), and I think it was a better experience not being in a relationship during my masters. I spent more time with friends, more time learning, and more time developing myself personally and professionally. I'm finally in a position where I'm ready for another long-term relationship, and having that time being single was extremely valuable in getting there.",
      "author": "Melkovar",
      "created": 1554654555,
      "upvotes": 7,
      "replies": {}
    },
    "ekboaq9": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekboaq9/",
      "text": "It didn't cost me my relationship but it put an lot of strain on my (new) marriage in the beginning of my PhD. I think we've been able to adapt though and getting past classwork and comps definitely helps because I have way fewer weekends where I do nothing but work. Things are pretty good now because we've both worked to be more understanding of each other's needs in this situation, but it took a good while. \n\nIt would have been even harder if we were long distance and/or didn't have several years of solid relationship foundation prior to starting. I fully understand why PhDs are relationship killers.",
      "author": "sadgrad2",
      "created": 1554656206,
      "upvotes": 6,
      "replies": {}
    },
    "ekcms36": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcms36/",
      "text": "Yep. Ended my marriage while working on my PhD  ... but I don't regret it. Doing my own academic work and having no support whatsoever helped me to realize how much our life was about him. I had supported his career with multiple moves, being the lone parent for months at a time while he traveled, and picking up the slack after he choose to work late nights and he was \"so tired\" and couldn't pitch in with household tasks or parenting. We didn't have conversations about anything because he was completely uninterested in me or my career but I always explained it away as him being busy or stressed. It was like being married to a brick wall who I had to clean up after. \n\nWhen I started my PhD, I thought things would change because the plan was always that we invest in his career and then it was my turn. That didn't happen. After he tried to talk me into putting it off for a few more years because we needed to focus on his career more (I said no), it being \"my turn\" meant that he let me hire a maid so I didn't have to clean... end of list. Nothing changed on his end. Once, I asked him what my degree was in and he didn't know. Another time, he expected me to skip a conference presentation at one of the top national conferences in my field because he was \"super busy\" with work. And when I mentioned how important this was to my career, he told me his career was the priority since he made more money. It was the red flag I needed (although one of many).\n\nI realized how one sided our marriage was and how miserable I was. Got a divorce and now have the most amazing supportive partner. He helps around the house, emotionally supports me, and is amazing with my kid (he coaches my kid's sports teams and it makes me turn into a puddle of mush). I'm so incredibly grateful that getting my PhD \"hurt\" my marriage but also empowered me to realize how bad it was. I couldn't be happier now.",
      "author": "littleirishpixie",
      "created": 1554679730,
      "upvotes": 7,
      "replies": {}
    },
    "ekbmsp0": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbmsp0/",
      "text": "In my experience romantic relationships tend not to survive PhDs. Everyone thinks they'll be the 5% to get a tenured job, and everybody thinks that their relationship will last. ",
      "author": "Dr_Marxist",
      "created": 1554655132,
      "upvotes": 10,
      "replies": {
        "ekcvtuv": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcvtuv/",
          "text": "Alternatively, I met and married my husband during my PhD. And thank goodness; he kept our house running while I wrote my dissertation, AND he proof read all 300 pages of my dissertation the night before I submitted it to my committee members, despite knowing next to nothing about my discipline. \n\nI’m not even the only one in my friends group to make it through PhD relationship intact. It’s totally possible if the people/partner match is right. ",
          "author": "TourmalineTart",
          "created": 1554686971,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ekbl1av": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbl1av/",
      "text": "human relationships are more important than postgraduate degrees. ",
      "author": null,
      "created": 1554653870,
      "upvotes": 49,
      "replies": {
        "ekbnb2t": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbnb2t/",
          "text": "Ok, but not *all* human relationships. If someone you didn't know came and said \"don't do that degree\" you wouldn't listen. So it's a question of: how much do you value this relationship? I think this is going to vary massively from person to person, but I don't feel a strong need to be in a romantic relationship as a goal in itself. Therefore I am quite comfortable ending relationships to pursue my academic goals.",
          "author": "l_lecrup",
          "created": 1554655505,
          "upvotes": 43,
          "replies": {
            "ekbosvw": {
              "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbosvw/",
              "text": "I agree that it depends. The right relationship won't stop you from pursuing your overarching goals, but that also doesn't mean that you will never have to compromise or take that person into account when considering jobs and moves and such. But also some people are truly happier without a partner, and that's cool too.",
              "author": "sadgrad2",
              "created": 1554656558,
              "upvotes": 12,
              "replies": {
                "ekbtfnb": {
                  "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbtfnb/",
                  "text": "Absolutely this. I adore my partner of four years, and despite six months abroad for a research project and then moving 500 miles away for a three year one, we’re still making it work. I know he’s a keeper, so when looking for the next contract I’m completely prepared to limit myself geographically for him. If I can’t get something where we can live together again, I’ll make tough decisions - but there’s only so long you can prioritise work over your partner before it’s too much, and for me (even though he wouldn’t ask) I’d choose him over working in my perfect subfield - I’d happily look for a sideways field move or look to industry research or even scientific policy type stuff if I had to.\n\nI would have made this choice for ‘a partner’ - but I would for him. We did live together before I moved for work though, so it’s not a new thing or an unknown.",
                  "author": "ayeayefitlike",
                  "created": 1554659886,
                  "upvotes": 7,
                  "replies": {
                    "ekbu5tb": {
                      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbu5tb/",
                      "text": "> there’s only so long you can prioritise work over your partner before it’s too much\n\nThis is so critical, both in big decisions and in everyday life. This was why we struggled so hard the first two years of my program. Even though we lived together, I was neglecting him and not really making time for him. You have to make the effort to prioritize the relationship at least some of the time, even when you're overwhelmed by work. ",
                      "author": "sadgrad2",
                      "created": 1554660413,
                      "upvotes": 4,
                      "replies": {
                        "ekbv1yh": {
                          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbv1yh/",
                          "text": "This is where I’m actually enjoying distance for the moment. It forces me to spend quality time with him when we see each other, rather than just flop in front of the TV on an evening and make an occasional weekend plan around tidying our flat.\n\nSince I’ve been away we’ve done so many cool things, it’s been brilliant.",
                          "author": "ayeayefitlike",
                          "created": 1554661057,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "ekcp1pa": {
              "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcp1pa/",
              "text": "> points out quantifier error\n\n> questions booleanization of \"relationship\" in the first place\n\n> on second thought, rejects on grounds of not being well-defined\n\nMathematicians, ladies and gentlemen",
              "author": "IAmVeryStupid",
              "created": 1554681499,
              "upvotes": 3,
              "replies": {
                "ekdsigo": {
                  "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekdsigo/",
                  "text": "I was amused by this, and upvoted accordingly, but feel I should give some account of myself. \n\nProposition: there is at least one relationship you care about less than academia\n\nCorollary: in the unlikely event that you must decide between an academic pursuit and a relationship, an evaluation of the relationship in question must be made \n\nObservation: I, personally, wouldn't continue a relationship with someone who didn't understand my ambition (I also won't have children for example)\n\nConclusion: The original comment is, like mine, simply a statement about the person making it, not about humans, or academia.",
                  "author": "l_lecrup",
                  "created": 1554726636,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ekbln5b": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbln5b/",
          "text": "Second this. I’d quit school tomorrow if my wife (or family) really needed me to.",
          "author": null,
          "created": 1554654308,
          "upvotes": 14,
          "replies": {
            "ekbp0uw": {
              "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbp0uw/",
              "text": "That’s family, though. Dating is a whole different kettle of fish.",
              "author": null,
              "created": 1554656714,
              "upvotes": 17,
              "replies": {}
            }
          }
        }
      }
    },
    "ekccda7": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekccda7/",
      "text": "Almost. We were long distance throughout the last years of my B.Sc and all of my MSc (he was in the US, I was in Europe). We were constantly messaging/skyping whenever timezones allowed, and we'd meet up for weeks during semester breaks. The good thing was that it allowed us to live very independent lives (e.g. no guilt for me when I stayed late in the lab or worked weekends), but the lack of physical proximity was very difficult, and we almost didn't make it (there was a \"break\" towards the end of my MSc). \n\nThe key moment was that we decided that, in order to make this work, we needed to make a concrete plan to move together and prioritise each other, even if that meant not going for the \"dream PhD in Sweden\" - e.g. I applied for an RA job in countries/cities he'd be able do get a visa/job in (luckily he's not in academia but IT at the time), but financially support him while he was looking for a job. Then after he was employed, I'd apply for PhD programs in the same city (easier after having made connections through working as RA).\n\nIt all comes down to that you both need to value the relationship over more \"comfortable choices\" (me: a \"smooth academic career\", him: stable job and closeness to friends). It's a big leap of faith and everyone's situation/values/journey is different. 6 years on, we're happy about our choices - we're married with a baby on the way! That being said, I'm not pursuing postdocs abroad and will most likely exit academia in the long run (for unrelated reasons).",
      "author": "gooey_mushroom",
      "created": 1554672462,
      "upvotes": 3,
      "replies": {}
    },
    "ekcfuye": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcfuye/",
      "text": "I’ve been told that many profs in my department have either gone through rough times with their partner or divorced due to the workloads, long hours, and overall poor work life balance. Most often this happens with partners who are not in academia, and some has settled with new partners in either a similar field or similar academic role. Not uncommon for me to leave at 7 and still see them focused at work 5 days a week, and certainly thats gotta have some impact on their home. \n\nIt’s honestly made me reconsider some aspects of academia and my options post PhD. Having said that, I’ve had a good long discussion with my partner about my journey (we met after I started my degree), what it meant for my future commitments, travel, tying the knot, etc. and thankfully she’s super understanding. I had to be upfront and brutally honest with her but I’m glad i put my cards on the table so to speak. It also helps she’s busy with other things so we’re both on a similar level when it comes to quality time",
      "author": "Kleindain",
      "created": 1554674795,
      "upvotes": 4,
      "replies": {}
    },
    "ekcphg4": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcphg4/",
      "text": "I'd love to blame it on the research, but the fact is, I doubt I would have been happy with any of them anyway.",
      "author": "IAmVeryStupid",
      "created": 1554681849,
      "upvotes": 4,
      "replies": {}
    },
    "ekbwgdt": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbwgdt/",
      "text": "Not just significant others, but friends also have to be very mobile and it is very hard sometimes to keep up.\n\nOn the plus side, I have also gained very close relationships from academia.",
      "author": "PersephoneIsNotHome",
      "created": 1554662065,
      "upvotes": 3,
      "replies": {}
    },
    "ekc1ss1": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekc1ss1/",
      "text": "Yup, I had 3 relationships end due to long distance, all of them broken off by my partners. I'm actually fine with long distance, but they weren't. One of them wasn't even \"long\" distance, it was about a 2 hour drive away. Unfortunately, she had a spine condition that worsened and so she couldn't drive to see me anymore. She felt it wasn't fair for me to drive to see her all the time, and so she broke it off.\n\nI thought she was BSing me, and that there was some deeper underlying reason, but we spoke 6 months later and nope, it was the driving distance.",
      "author": "notadoctor123",
      "created": 1554665700,
      "upvotes": 3,
      "replies": {
        "ekcvwyb": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcvwyb/",
          "text": "[deleted]",
          "author": null,
          "created": 1554687043,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ekcrs2l": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcrs2l/",
      "text": "I have an opposite story. I met my incredible partner BECAUSE of my PhD and now our relationship is what keeps me sane while I am in the last 2 months of my PhD. \n\nWe lived in different cities (Perth & Melbourne) and met at a conference (we had the same scholarship) in Sydney. Long story short him and I ended up talking nonstop for the rest of the conference and sparks flew.\n\nOver the following year we did long distance, (including him being in the US for 6 months) and I eventually decided to move to Melbourne to be with him. Luckily I'd collected all my data and my supervisors were totally cool with it. \n\nSkip ahead to now - we've been together almost 2 years (lived together for 1) and I am just 2 months away from submitting my PhD. He finished his PhD a year ago.  I was there for him when he finished his PhD and the depression that came afterwards - it was hard. But we got through it. And now our relationship is the only reason I am not going insane in this final part of my PhD. Being with someone who knows what a PhD is amazing.\n\nIt's not always been easy - communication and knowing how to communicate your stress is essential. The hardest parts of our relationship was when one of needed something from the other but didn't communicate it. There were a lot of moments I wasn't sure if we were going to make it and lots of crying where I thought I couldn't finish my PhD AND be in our relationship. I had to go to therapy, he had to focus on healing himself. It was hard. But we pulled through and are now stronger than ever.\n\nIt's easy to get fixated on your research and thing that is the only thing that is important. I try EVERY DAY to make him feel loved and like I appreciate him and he did that with me while he was in his stressful period. Without that, our relationship would surely fall apart.\n\nMoral of the story - relationships are hard work and you need to prioritise them. But also, who knows, you could meet the love of your life at a conference ;)",
      "author": "picklestheunicorm",
      "created": 1554683725,
      "upvotes": 3,
      "replies": {}
    },
    "ekdc8k0": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekdc8k0/",
      "text": "Yes. This is the only reason I got married at 39 and had my first child at 41. On a related note I have exes in Rio, Hamburg, Miami, Shanghai and New York. When grants call, you move. \n\nAcademic life, if you do not get married early (or if you choose someone in academia) is absolutely toxic for relationships. The three year cycle of postdocs guarantees that sooner or later one of you will get a position somewhere far.\n\nFriends who married other researchers either live in a small country they have never left for work, or married in university so they were already committed enough to put family first. ",
      "author": "rambo77",
      "created": 1554702076,
      "upvotes": 3,
      "replies": {}
    },
    "ekbudrn": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbudrn/",
      "text": "I have a (possibly rare case of a) success story. \nI did long distance with my, now, husband for 3 years. It was tough but in some ways the distance allowed me to focus more on my PhD. It was helpful to have another location to escape to to have a bit of a break from the research sometimes too. ",
      "author": "Greippi42",
      "created": 1554660571,
      "upvotes": 2,
      "replies": {}
    },
    "ekcqeyz": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcqeyz/",
      "text": "Yes. I have super mixed feelings about some of it. ",
      "author": "liquidanbar",
      "created": 1554682614,
      "upvotes": 2,
      "replies": {}
    },
    "ekcztu3": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcztu3/",
      "text": "Very appropriate timing for me. I'm going through it (again) now.\n\nBeen in a relationship for 3.5 years with a fellow PhD student (in another discipline entirely). She got a job this year; I did not, and even postdocs are looking unlikely. She'll be moving from the US to the UK; I have no clue what I'll be doing. \n\nOur problem is that we're both now in our mid-30s and were both divorced earlier in the PhD. We love each other deeply, but if I plan on staying in academia (a relatively strong field within the humanities, but the humanities nonetheless), we'll have to split. We both want kids and while I can still wait at this age, she'll need to find someone with a more stable career ASAP.\n\nThe end of the relationship paired with the shit job market results are causing me to strongly consider an industry job. Unfortunately, I'm now ten years deep into grad school (including MA) so it's going to be very tough to transition. But thankfully, I have good connections and networks so I think it can work.\n\nFrankly, I realize that it just may not be worth it, and that I'm more likely to be happy in a 9-5 with a partner and family (and better money) than a free scholar on my own.",
      "author": "ScholarProblems",
      "created": 1554690173,
      "upvotes": 2,
      "replies": {}
    },
    "ekdckv7": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekdckv7/",
      "text": "I decided to do a PhD in another country so it was long distance. But that said, lol perhaps I decided to move for a reason too. We were having a lot other problems so we broke up. ",
      "author": "whaaaaaaatisthis",
      "created": 1554702531,
      "upvotes": 2,
      "replies": {}
    },
    "ellem59": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ellem59/",
      "text": "I was in a long distance relationship and both of us were in graduate school. We broke up because we did not have time for each other. I was depressed for a long time. I used the school's counseling service to get back to normal again.",
      "author": "Finehvector",
      "created": 1556045250,
      "upvotes": 2,
      "replies": {
        "eln7cxq": {
          "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/eln7cxq/",
          "text": "Sorry to hear that, it's a crappy situation and I'm glad you got back to normal in the end. I might look into some counselling, don't really have anyone around to talk to here and it's really bothering me.",
          "author": "thatsnotmyname95",
          "created": 1556099713,
          "upvotes": 1,
          "replies": {
            "elrt0n0": {
              "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/elrt0n0/",
              "text": "Yes, counseling helps. I have observed that inviting people for dinner helps to make friends. Good luck!",
              "author": "Finehvector",
              "created": 1556221715,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ekbp8s3": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbp8s3/",
      "text": "I haven't been in a relationship since I properly started undergrad years ago so I think the answer is yes. I allowed myself to test the waters during last summer before the beginning of my masters but as the semester started I gave up. Honestly I don't think I have the capacity to start a new relationship at this point but I'm happy for everyone who can make both relationship and education work. As for friends, most aren't very understanding and trigger the imposter syndrome as they usually think what I do is easy. So I guess I tend to avoid seeing my friends as well.",
      "author": "Lady_of_Ironrath",
      "created": 1554656872,
      "upvotes": 2,
      "replies": {}
    },
    "ekcqanx": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcqanx/",
      "text": "Cost me a 5 year relationship unfortunately. But I saw it as that my career would just get more intense over time, and if my relationship with my partner couldn’t handle my training, it wouldn’t be strong enough to handle down the road. Took it as a positive. ",
      "author": "liz-can-too",
      "created": 1554682512,
      "upvotes": 1,
      "replies": {}
    },
    "ekdtkjp": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekdtkjp/",
      "text": "My first marriage ended because of my career and my educational goals.\n\nAt the time, I was a high school teacher. Anyone in K-12 education will tell you that teaching is more of a 6:00AM to 11:00PM job. Even when I was home, I was working on lesson plans and grading. My then-husband did not understand why I could not leave work at work. \n\nMy educational goals were the other big issue in our marriage. Despite dropping out of college, my then-husband had successful and lucrative career as a software engineer. I, on the other hand, had finished my masters degree and had been accepted to a doctoral program. His parents were largely against the idea of a woman making more money than her spouse or being more educated than her spouse and he did not understand why I wanted to pursue my doctorate. \n\nIn the end, my constant work, both teaching and graduate school, and focus on my education led him to find solace in the arms of many others. We separated during my first year of doctoral study and divorced during the second. \n\nIn my experience it is far easier for academics to date other academics or k-12 teachers. Many people outside this world do not understand the time required to be effective and successful.",
      "author": "red_ajah",
      "created": 1554727670,
      "upvotes": 1,
      "replies": {}
    },
    "ekdz0e5": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekdz0e5/",
      "text": "You're starting your PhD single, so you're in excellent position to structure your romantic life to fit.  Being forced back onto the dating scene as I was in my final year for the first time made it easy to prioritise \"can work with itinerant lifestyle\" when dating.",
      "author": "WilyDoppelganger",
      "created": 1554732341,
      "upvotes": 1,
      "replies": {}
    },
    "ekea2r2": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekea2r2/",
      "text": "If you are a serious researcher this situation is almost inevitable. Speaking for myself, I love mathematics probably more than I love any one individual. And I've pretty much put that before anyone and quite frankly it's never let me down.",
      "author": null,
      "created": 1554740106,
      "upvotes": 1,
      "replies": {}
    },
    "ekeg2x2": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekeg2x2/",
      "text": "I guess technically yeah, my ex and I broke up after I moved for a PhD and long distance sucked too much. But I don't regret it. I realized pretty early after we broke up how unbalanced the situation was. If it wasn't the move for a PhD, it would've been something else because we weren't going to work out in the long run.",
      "author": "bluesquid01",
      "created": 1554743952,
      "upvotes": 1,
      "replies": {}
    },
    "ekgf19o": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekgf19o/",
      "text": "Thank you everyone for your comments, they were really informative and I read through them all. Some were uplfiting and sweet, others reflected my worries. I've thought for several years that a PhD is what I wanted to do to improve my skillset and do something that genuinely contributes to  an area of importance. I'm expecting to receive a formal offer soon, but will really give thought to whether I'm prepared to potentially sacrifice/postpone relationships for that period . \n\nMy other option is to reject the offer, go all-out on the grad job junt and potentially ask my now-ex if she'd be prepared to give it another shot for the time being, on the assumption that we can see more of each other when my course finishes in September.",
      "author": "thatsnotmyname95",
      "created": 1554798006,
      "upvotes": 1,
      "replies": {}
    },
    "ekbzx51": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbzx51/",
      "text": "Not my academic pursuits, but my ex's. We were fine when we were long distance, but when I moved a little closer to him and wanted to see him on a semi-regular basis, he dumped me because \"he was starting to resent me for taking him away from his work\". I'm sure the real reason was that he wasn't feeling it anymore, but still that was an absurd thing to say to someone you claim to love.\n\nWe're in different cities and different fields, but from what I hear he's still single af and doing some shitty postdoc.",
      "author": "thegreenaquarium",
      "created": 1554664489,
      "upvotes": 1,
      "replies": {}
    },
    "ekbrq43": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbrq43/",
      "text": "I’m starting a PhD in October and I just ended my relationship because it would have meant 3+ more years of long distance and I can’t handle that. He agreed it was the right thing to do. I don’t mind being single or being in a relationship but I seriously don’t see the point in starting anything during my PhD when I have no idea where I will end up... I just feel like I’m going to keep running into the same problem when I will probably have to move around a lot. It kinda sucks, especially as you get older and everyone around you is settling down and buying houses. 🤷🏼‍♀️",
      "author": "pugaholic",
      "created": 1554658642,
      "upvotes": 1,
      "replies": {}
    },
    "ekbwlmq": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekbwlmq/",
      "text": "That's the problem when most families/relationships are 2-income households by necessity. Gone are the days that the husband is the sole breadwinner and the wife and kids can just pick up and follow wherever his career may take him.\n\nETA: Just to be clear, I'm not advocating we go back to this.",
      "author": "jdoe36",
      "created": 1554662171,
      "upvotes": 1,
      "replies": {}
    },
    "ekce1xf": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekce1xf/",
      "text": "I had an ex use grad school to justify being an emotionally unavailable liar 🤷‍♀️\n\nYes academia is hard and it does legitimately break people up, I just think this dude was an asshole and his excuse was bullshit, especially considering that I too am in grad school ",
      "author": null,
      "created": 1554673581,
      "upvotes": 1,
      "replies": {}
    },
    "ekcuhjc": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekcuhjc/",
      "text": "What does it cost? Everything.",
      "author": "thntk",
      "created": 1554685881,
      "upvotes": 1,
      "replies": {}
    },
    "ekdg03j": {
      "link": "/r/AskAcademia/comments/bahd8m/have_your_academic_pursuits_ever_cost_you/ekdg03j/",
      "text": "Slightly disagreeable opinion incoming.\n\nI got together with my then-GF (2013) now wife (2019) after I had already applied to NIH for a post-doc (in late 2012 during the latter stages of my PhD). I moved from Edinburgh to Baltimore late 2013. I got about nine months in and figured 'fuck this'. I got a job back in the UK relatively easily if I'm honest. If I hadn't, I had resolved that I'd come back and sell shoes, work in a restaurant or whatever. Something would've come up I'm sure. \n\nI personally don't see how long distance for the long term is much of a relationship. I've joked to her in the past that the post-doc was miserable, but for someone single and/or with no major commitments it'd be brilliant!\n\nYou've got so much time on earth and it is genuinely up to you what you value and how you choose to allocate that. ",
      "author": "dl064",
      "created": 1554707609,
      "upvotes": 0,
      "replies": {}
    }
  }
}