{
  "sid": "pijgdx",
  "link": "/r/AskAcademia/comments/pijgdx/advice_on_starting_to_write_my_thesis/",
  "title:": "Advice on starting to write my thesis",
  "text": "Hi, I have a struggle and don't know where to ask. I have been procrastinating on starting to write my thesis (of bachelor's degree, so is the first one I will be writing), even though I have already some data (it's an experimental thesis). \nIt makes me anxious things like making plagiarism without noticing, or doing things in a more difficult way than they should be, being totally oblivious of an easiest way of doing things. \nFor example, I have a lot of trouble writing the discussion, I think it's the most interesting part to write, but when I start to read literature I jump into a rabbit hole to another and a lot of time is lost. Kinda happens the same when I'm writing an introduction. \nI don't know how to start, my mind isn't much into the 'academic mode' because of the pandemics. \nI will appreciate any kind of advice, thanks in advance!",
  "author": "whitefang_07",
  "created": 1630869778,
  "updated": 1634079391,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hbq6e5n": {
      "link": "/r/AskAcademia/comments/pijgdx/advice_on_starting_to_write_my_thesis/hbq6e5n/",
      "text": "OK, first thing: Stop procrastinating, get pen to paper. Begin by outlining what youtr structure needs to be. THen start putting phrases or key ideas in that you want. Get those in order. Start fleshing them out. You'll soon have a piece of work in front of you.\n\nSecond thing. You can't plagiarise without noticing. If you are writing about a subject you reference the place that the information came from. In STEM you should NEVER be taking block quotes or sections of text, because the *exact* phrasing is never important, and you should be writing from the context of your work, which is different to the papers you're citing.",
      "author": "OrbitalPete",
      "created": 1630873273,
      "upvotes": 6,
      "replies": {}
    },
    "hbq1klb": {
      "link": "/r/AskAcademia/comments/pijgdx/advice_on_starting_to_write_my_thesis/hbq1klb/",
      "text": "Start with the methods and then the results. Try to write as badly as you can, just get the content right. You can later go back and edit it all, but at first you need a really shit version.",
      "author": "DeepSeaDarkness",
      "created": 1630871129,
      "upvotes": 5,
      "replies": {}
    }
  }
}