{
  "sid": "ri98h2",
  "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/",
  "title:": "If doing PhD right after bachelors is doable (and some people say it should be done this way normally) what is the usual reason people go for masters before PhD?",
  "text": "Hi. I plan on applying for PhD right after my non thesis masters. I feel like I should insert a proper thesis masters in between but I can also pursue PhD already. I feel like I lack most of the lab training necessary to pursue PhD hence my need of another proper masters with thesis. What do you guys think? Is the experience one of the main reasons why people go for masters first before PhD? What are the other reasons?\n\nIf you are wondering why I am taking a non thesis masters first before going for thesis masters, please check my previous [Post](https://www.reddit.com/r/AskAcademia/comments/rgr85n/i_am_required_by_my_school_to_take_a_masters/?utm_medium=android_app&utm_source=share).",
  "author": "Deus_Sema",
  "created": 1639716093,
  "updated": 1639787256,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hovp8gs": {
      "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/hovp8gs/",
      "text": "A masters let’s you try out grad school. Or in your case try writing a thesis. It is also sometimes an opportunity to study at different universities. I did my masters at a different university than my PhD.",
      "author": "OKswimmer2684",
      "created": 1639717654,
      "upvotes": 10,
      "replies": {}
    },
    "hovpce4": {
      "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/hovpce4/",
      "text": "In my field (computer science), reasons to get a M.S. before Ph.D. include:\n\n1. changing field (undergrad was not comp sci or comp engineering)\n2. not yet sure if want Ph.D. or go into industry\n3. not sure what area of CS interested in researching in (need more time to explore advanced classes in different areas to determine interest)\n4. undergrad work not strong enough to get into Ph.D. program (or at least not one of the level you're hoping for)...  M.S. studies can give an opportunity to work on research with a faculty advisor, if you didn't get to do so as an undergrad.  (That in turn can also get you a better recommendation letter, etc.)  --  Note that going to an M.S. program and continuing to do nothing but classes will probably not net you much over your nothing-but-classes undergrade -- the point is a chance to do more than just classes.\n5. ...maybe other reasons...?  Not claiming this list is exhaustive!\n\n&#x200B;\n\nBut, if you're sure you want the Ph.D., have a strong enough application to get admitted to a school you're happy with, and know at least what general area you want to specialize in, then I don't see much reason not to go straight for the Ph.D.  (at least in the field of computer science)",
      "author": "ComputerSystemsProf",
      "created": 1639717714,
      "upvotes": 5,
      "replies": {}
    },
    "hovp07f": {
      "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/hovp07f/",
      "text": "It depends a bit on the school and the country. In my department it is somewhat standard to go directly from a bachelor’s degree to a PhD (that’s what I did). Usually PhD programs are longer in that case though. Mine is 5 years, so although I don’t have a master’s degree the first 2 years of my PhD were essentially a master’s without a title.",
      "author": "CootaCoo",
      "created": 1639717528,
      "upvotes": 5,
      "replies": {
        "hovp4dz": {
          "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/hovp4dz/",
          "text": "Would u suggest me going for PhD right after my first non thesis masters?",
          "author": "Deus_Sema",
          "created": 1639717591,
          "upvotes": 1,
          "replies": {
            "hovps0i": {
              "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/hovps0i/",
              "text": "If you know you want to do a PhD then yeah, because I think one of the biggest advantages of a thesis based masters is it gives you an opportunity to see if you enjoy research. If you already know you’re going to do a PhD then you probably don’t need to go for another master’s degree. Definitely see what other people in your field have done though.",
              "author": "CootaCoo",
              "created": 1639717955,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hovn2js": {
      "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/hovn2js/",
      "text": "i had a strong enough profile to be competitive for phd applications straight out of undergrad (had extensive research experience and two papers under review) but i chose not to do it because i wasn’t sure if i wanted to go into research (because of interest, not aptitude). doing a (research/thesis-based) masters gave me extra time to decide.",
      "author": "victoria-lobster",
      "created": 1639716487,
      "upvotes": 4,
      "replies": {
        "hovnaj9": {
          "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/hovnaj9/",
          "text": "I see",
          "author": "Deus_Sema",
          "created": 1639716600,
          "upvotes": 1,
          "replies": {}
        },
        "hovnfz9": {
          "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/hovnfz9/",
          "text": "If im gonna be honest to myself I really don't want to pursue all these titles but I want to teach college and tertiary education in general. So I kinda have to",
          "author": "Deus_Sema",
          "created": 1639716677,
          "upvotes": 1,
          "replies": {
            "hoy7834": {
              "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/hoy7834/",
              "text": "You might want to talk to some more folks working the jobs you want to take just for a sanity check. It is my understanding that university professors are hired first and foremost for their research output and secondarily for their teaching credentials. Unless you are planning to teach at a really small school or a community college (bless you if you are, the world needs more quality community college professors), life as a university professor might not be all you may think it is.",
              "author": "AvitarDiggs",
              "created": 1639765791,
              "upvotes": 3,
              "replies": {}
            },
            "howxvtp": {
              "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/howxvtp/",
              "text": "You may want to look a little more into what the job market for your field expects. As I understand, in my field (math) many smaller liberal arts colleges are okay with a Masters rather than a PhD for lecturers. Also worth noting that math education is an entire area of research on its own. I do not know how common it is to have education as a full branch of the field's research, but if you have to do a PhD, you may be able to fit an education theme into the work.\n\nOne thing I can certainly say: If already think you do not want to do a PhD, it is not a good idea to do one unless you can find someway to be excited about it.",
              "author": "TinyFlyingWalrus",
              "created": 1639747439,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hovplvv": {
      "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/hovplvv/",
      "text": "I think I could get into some phd programs straight after my undergrad but I want to go for a masters instead as I have never done any research and can’t tell if it’s really for me. I also much rather commit 2 years of school rather than 5, and see if going i to industry is an interesting option after my masters. And finally, if i decide to do a phd, I probably would have many more options after I get a masters degree, some research work done, and more referees.",
      "author": "Historical-Passion54",
      "created": 1639717860,
      "upvotes": 2,
      "replies": {}
    },
    "hovz1o4": {
      "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/hovz1o4/",
      "text": "it’s not doable in many countries, plenty of places require a Master’s before a PhD",
      "author": "AdditionalWorry7500",
      "created": 1639723537,
      "upvotes": 2,
      "replies": {}
    },
    "howo52s": {
      "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/howo52s/",
      "text": "For me the main thing is that in Europe when you have a master already you need no coursework for the PhD and can focus on your research",
      "author": "CreepyBumblebee31",
      "created": 1639741964,
      "upvotes": 2,
      "replies": {}
    },
    "howtpxe": {
      "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/howtpxe/",
      "text": "I’m in the humanities and always recommend a master’s first. I’ve seen very few straight to PhD students succeed. An MA gives you experience with research, fields and methods of study, and allows you to make an informed decision. \n\nThe vast majority of people I knew who didn’t finish their PhDs left for personal reasons like family, losing interest, money, time commitment, etc. A master’s allows you to decide if the PhD is worth sacrificing for or not. Plus, a master’s is often quick and fun. If you hate it, you can be done soon and get out with an advanced degree. Not so much with a PhD…",
      "author": "pugbug2016",
      "created": 1639745267,
      "upvotes": 1,
      "replies": {}
    },
    "hoxr9j0": {
      "link": "/r/AskAcademia/comments/ri98h2/if_doing_phd_right_after_bachelors_is_doable_and/hoxr9j0/",
      "text": "Personally I had some research offers at my undergrad university so I stayed for a masters.",
      "author": "morePhys",
      "created": 1639759687,
      "upvotes": 1,
      "replies": {}
    }
  }
}