{
  "sid": "r83ytr",
  "link": "/r/AskAcademia/comments/r83ytr/decided_to_go_into_academia_any_advice/",
  "title:": "Decided to go into academia. Any advice?",
  "text": "Here is my situation, briefly:\n\nI've been a practicing electrical/controls engineer for 5 years and I've realized that industry is not for me. I've been involved in some R&D projects that I really loved, but ultimately have spent the majority of my career in industrial projects which involve \"cookie cutter\" engineering. I won't get into it too much, but I've realized that industry is slowing sucking my soul out of my body.\n\nI'm almost done my master's in engineering (part time) although it is course based and I have no publications.\n\nI've taught a college course in the past and enjoyed it quite a bit, although I worked many more hours than I was paid for with marking and whatnot. I should note that in Canada college is differentiated from university and some colleges only require an undergrad to teach technology programs. Nonetheless, it was a good experience.\n\nI've always been interested in learning and research in general. I spend a good amount of my spare time reading research papers and textbooks in various fields and it has occured to me that I would love to do research for a living. In fact, it's always been in the back of my mind. I have a keen interest in the intersection of machine learning and control systems.\n\nAny advice on how to break into academia and research? Obviously I would need to work towards a PhD, but I'm nervous that my course work based master's will hold me back. A couple years ago I reached out to some of my professors in undergrad and they said they would be willing to take me, although I have a feeling it's just because I performed well in my undergrad and they remembered that.\n\nAnyone go a similar path?",
  "author": "ImMrSneezyAchoo",
  "created": 1638551606,
  "updated": 1639515774,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.64,
  "comments": {
    "hn3umpj": {
      "link": "/r/AskAcademia/comments/r83ytr/decided_to_go_into_academia_any_advice/hn3umpj/",
      "text": "OP I was an electrical engineer - controls systems and moved to academia from industry. DM me if you have any questions",
      "author": "Tweetybird5678",
      "created": 1638560820,
      "upvotes": 3,
      "replies": {
        "hn3wb69": {
          "link": "/r/AskAcademia/comments/r83ytr/decided_to_go_into_academia_any_advice/hn3wb69/",
          "text": "Also interested! Aerospace engineer wanting to move into robotics research.",
          "author": "peolothegreat",
          "created": 1638561501,
          "upvotes": 3,
          "replies": {
            "hn3wy9x": {
              "link": "/r/AskAcademia/comments/r83ytr/decided_to_go_into_academia_any_advice/hn3wy9x/",
              "text": "Lot of opportunities for robotics in academia.",
              "author": "Tweetybird5678",
              "created": 1638561760,
              "upvotes": 3,
              "replies": {}
            },
            "hn5a92h": {
              "link": "/r/AskAcademia/comments/r83ytr/decided_to_go_into_academia_any_advice/hn5a92h/",
              "text": "If you're interested in a PhD in the UK, my research group is looking for people - we work on robotics for aerospace, pm for more details!",
              "author": "m_ahren",
              "created": 1638584482,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}