{
  "sid": "i9taxd",
  "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/",
  "title:": "imposter syndrome is a blast",
  "text": "Can we talk about imposter syndrome and navigating academia in STEM as a young woman? I feel drastically under-qualified doing nearly everything my mentors encourage me to do. I do the things anyway, but the discomfort doesn't seem to dissipate the further I get. \n\n&#x200B;\n\nBut also, I am a second year grad student, highest degree BA, presenting at a medical conference in November, presenting among all other MDs. How the fuck am I supposed to feel about this D:",
  "author": "annewuwu",
  "created": 1597435846,
  "updated": 1634080410,
  "over_18": false,
  "upvotes": 270,
  "upvote_ratio": 0.92,
  "comments": {
    "g1he275": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1he275/",
      "text": "Bad news - it's not going away. It doesn't matter how much you will achieve it will be with you. Good news - everyone feels it. So don't worry too much, it's normal, one step at a time, you'll get there.",
      "author": "kit58",
      "created": 1597437593,
      "upvotes": 165,
      "replies": {
        "g1ho9kj": {
          "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1ho9kj/",
          "text": "Yuuuup. Just defended my dissertation last week and I still feel like I have no idea what I'm doing!",
          "author": "Killer_Sloth",
          "created": 1597442445,
          "upvotes": 27,
          "replies": {
            "g1j1dab": {
              "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1j1dab/",
              "text": "Congrats!!!",
              "author": "scienceislice",
              "created": 1597467819,
              "upvotes": 4,
              "replies": {}
            },
            "g1q3k6v": {
              "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1q3k6v/",
              "text": "And you are now the world's leading expert in that topic. We all look to you for guidance and wisdom.👍",
              "author": "IrishShaman1",
              "created": 1597574153,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g1hy9db": {
          "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hy9db/",
          "text": "Yup. The other day I was talking about how nervous I am for a class I'm taking in the fall (LOTS of crazy derivations on exams), and one of my group members was like \"What?! I've seen your presentations, you'll be fine!\" like.... yo, I had no idea what I was doing during my presentations either... \n\nI feel like a golden retriever, I don't know what's going on or what any of these words mean, I'm just happy to be here :)",
          "author": "Quiinton",
          "created": 1597447628,
          "upvotes": 20,
          "replies": {}
        },
        "g1hictg": {
          "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hictg/",
          "text": "The true imposters are those who adamantly say they aren't.\n\n(yes, it's part stereotype but also part true in certain circumstances )",
          "author": "NoobMadeInChina",
          "created": 1597439546,
          "upvotes": 20,
          "replies": {}
        },
        "g1jfziw": {
          "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1jfziw/",
          "text": "Absolutely. Full Prof here just waiting to be found out.",
          "author": "ardbeg",
          "created": 1597474218,
          "upvotes": 5,
          "replies": {}
        },
        "g1iflci": {
          "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1iflci/",
          "text": "Admittedly, the more i \"achieve\" the worse my imposter syndrome gets.",
          "author": "CovidBlueLight",
          "created": 1597457358,
          "upvotes": 4,
          "replies": {}
        },
        "g1hwsva": {
          "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hwsva/",
          "text": "I’m one of the youngest full profs at a world-famous med school. I’m a white cis-male solidly middle class all-the-privileges walking stereotype. Yeah, not much changes over the years. You learn to deal with it much better though.",
          "author": "ccots",
          "created": 1597446861,
          "upvotes": 6,
          "replies": {}
        },
        "g1htyrc": {
          "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1htyrc/",
          "text": "Even the MDs at the conference.",
          "author": "denimbastard",
          "created": 1597445374,
          "upvotes": 3,
          "replies": {}
        },
        "g1hek9m": {
          "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hek9m/",
          "text": "Seconding this.",
          "author": "grayhairedqueenbitch",
          "created": 1597437816,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g1hg1l5": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hg1l5/",
      "text": "As another woman in STEM, it helps me to talk to people in other fields and those outside of academia. I tend to assume a lot of what I know is common knowledge or easy to understand or largely covered in other fields but in different frameworks. When I have to explain my work to someone else, I quickly realize that isn't true. It also gives me a chance to appreciate the other person's expertise and how nice it is that different people are good at different things.\n\nI also look for objective markers of my success and try to save them somewhere I can look at them when I forget. It's amazing how those accomplishments disappear from my mind when I am feeling bad about myself.",
      "author": "epieee",
      "created": 1597438453,
      "upvotes": 65,
      "replies": {
        "g1hph80": {
          "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hph80/",
          "text": "I'm studying biomedical science and my relatives keep on asking me about what side effects their medicines have... That tells you everything",
          "author": "idk7643",
          "created": 1597443066,
          "upvotes": 14,
          "replies": {
            "g1hv7xm": {
              "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hv7xm/",
              "text": "According to my research you will die whether you take them or not... Is that how that works?",
              "author": "Pop_pop_pop",
              "created": 1597446032,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "g1iaqv5": {
          "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1iaqv5/",
          "text": "Same here, about the “objective markers of success.” I kept copies of these in what I called my “feel-good file,” and I also suggested to my grad students to do the same. \n\nEven if I seldom actually opened that file to read through it, just knowing it was there was a great confidence booster — almost like a talisman, but in a very real versus superstitious way because it was all things that I had accomplished and earned.",
          "author": "jadynfirehawk",
          "created": 1597454575,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "g1hncfj": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hncfj/",
      "text": "[This letter](https://scienceblogs.com/thescian/2008/03/11/what-are-worthwhile-problems-f) written by Nobel Laureate Richard Feynman is always my go-to when trying to combat imposture syndrome myself. All these MDs at your conference are people, too. They are not omnipotent beings! Plus, from what I gather about MDs, many of them are somewhat out-of-touch with cutting edge research (particularly outside their specialty). In other words, in the eyes of many of the MDs there, *you* will be the expert, even if you don't feel like it. If that makes you uncomfortable, personally, I fall back on what I know and try not to speculate on what I do not. \n\nOne of the most eye-opening experiences I have had in grad school was at a conference outside of my major domain of study. I went with my advisor and two other faculty--each are very respected in their domains. During a particular session, I felt like an idiot because I just could NOT understand what was being presented. After the session, all four of us got together and they all felt the same way. The moral of the story being that it's okay not to know everything and everything, there is *always* more to learn. The main purpose for virtually all conferences is to share your knowledge with others. If we already knew everything going it, these conferences would just be an expensive, multi-day happy hour.",
      "author": "Verisimilitude_Dude",
      "created": 1597441982,
      "upvotes": 25,
      "replies": {
        "g1ldayt": {
          "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1ldayt/",
          "text": "Thank you for this.",
          "author": "_whatevs_",
          "created": 1597501102,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g1hg8bz": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hg8bz/",
      "text": "I wholeheartedly empathize. I am nearing the end of my PhD, several papers published, and I am still convinced my PI is going to figure out that I'm a fraud and I was just lucky the whole time. It doesn't get much better, but you do gain direct experiences that help squash the feelings (I have a paper published! I presented at a big conference! This scientist I admire didn't rip me a new one during q & a! etc).\n\nGood luck at your conference; you're going to do great!\n\nETA: Also, later in your career, getting a new person you can mentor yourself is a big confidence boost, especially when you can answer their questions/assist them in their studies/etc.",
      "author": "phangirloftheopera",
      "created": 1597438537,
      "upvotes": 23,
      "replies": {}
    },
    "g1hjrik": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hjrik/",
      "text": "I finished my PhD in 2017 and have been an Assistant Professor since but I still have imposter syndrome. \nI’m not even comfortable when people call me Dr. ...\nIt will take time but keep doing your best",
      "author": "fredjin",
      "created": 1597440228,
      "upvotes": 18,
      "replies": {}
    },
    "g1hi3tg": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hi3tg/",
      "text": "Fake it til you make it. The beauty of science is that you're often doing things people haven't done before and it's acceptable to say you don't know if you don't know something or you need to look it up.",
      "author": "mediocre-spice",
      "created": 1597439424,
      "upvotes": 10,
      "replies": {
        "g1hrvg8": {
          "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hrvg8/",
          "text": ">Fake it til you make it. The beauty of science is that you're often doing things people haven't done before and it's acceptable to say you don't know if you don't know something or you need to look it up.\n\nAt the end of the day, it's a personal developmental problem at its core. If you grew up in a competitive environment, you are likely not to suffer from impostor syndrome. If you have not grown up in a competitive environment, you will suffer from impostor syndrome.",
          "author": "actuallynotcanadian",
          "created": 1597444302,
          "upvotes": -1,
          "replies": {}
        }
      }
    },
    "g1icyr5": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1icyr5/",
      "text": "Two things I learned in school and the workforce really helped me out.\n\n1.) A professor telling me to not let the perfect be the enemy of the good.\n\n2.) A supervisor telling me that science is a process, and a team effort, and that I needed to accept that I would make mistakes, and my team would help me fix them.\n\nI've learned that just accepting that I may not be comfortable doing something, whether because I don't think I can do it, or am qualified to do it, leads to me learning far more than only doing that which I know I can do well.\n\nOr, as Ms. Frizzle would say, \"Take chances, make mistakes, get messy!\"",
      "author": "Darkfriend337",
      "created": 1597455836,
      "upvotes": 10,
      "replies": {}
    },
    "g1hnhlu": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hnhlu/",
      "text": "Yeah I graduated with my PhD and I still feel very under qualified. I keep thinking : joke is on them. Despite being so unqualified I keep getting hired to do all these cool things.",
      "author": "yenraelmao",
      "created": 1597442053,
      "upvotes": 7,
      "replies": {}
    },
    "g1irdcu": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1irdcu/",
      "text": "Good news - it's not going away! I just got tenure and I still feel it. For me a big issue is perfectionism - if it wasn't for deadlines I would constantly revise everything I do. Impostor syndrome feeds on your thoughts of how improvements could be made. It can be a very useful self-editing tool, but balancing self-confidence and impostor syndrome is one of the nuances of being a young woman in academia*\n\n*source: personal experience, part of which makes me feel as though I should cite all definitive statements",
      "author": "skleats",
      "created": 1597463595,
      "upvotes": 8,
      "replies": {}
    },
    "g1hkqwu": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hkqwu/",
      "text": "Is this your first conference presentation?!  If so congrats! Once you get over the nerves everyone has, it can be really fun and rewarding. Everyone is nervous and apprehensive before their first (several) conference presentations; I still get so nervous during conference presentations that I talk 8,000 miles a minute.  \n\nImposter syndrome is always going to be there.  I was applying to TT jobs this time last year and reading the admission requirements for the Master's program at a department I was applying to. And I caught myself thinking, \"Oh gosh, I'm not sure I can get into this program...\" and I felt really intimidated for several minutes, until I snapped out of it and realized I already have a masters degree (and a PhD and have done 2 post-docs) and that I was being RIDICULOUS.  It just never goes away! \n\nThe only way to gain experience is by DOING, and that's what I remind myself all the time.  If I let my imposter syndrome get the best of me I won't ever DO anything, and then I really won't have the right experience. Participate as much as you can, learn from as many people as you can, and remind yourself that WE ALL feel the same insufficiencies.",
      "author": "TourmalineTart",
      "created": 1597440705,
      "upvotes": 4,
      "replies": {}
    },
    "g1htt9g": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1htt9g/",
      "text": "Just in case it helps to hear about others' experiences, check out this article: [Common Academic Experiences](http://www.bertramgawronski.com/documents/JAGRSTMMRV2020PPS.pdf)",
      "author": "late4dinner",
      "created": 1597445295,
      "upvotes": 5,
      "replies": {}
    },
    "g1hm7i6": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hm7i6/",
      "text": "Remember that you know more about your own research than anyone else, and it is worth sharing. \n\nIt does seem that imposter syndrome never goes away, though. I just started a postdoc and boy is it hitting me hard.",
      "author": "japjul514",
      "created": 1597441424,
      "upvotes": 5,
      "replies": {}
    },
    "g1hv2rc": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hv2rc/",
      "text": "I think there is a way to mitigate impostor syndrome. And, that is to understand that everyone around you is awesome. And, they know more about some stuff then you do. But, you are also awesome. You are qualified. There is now way you tricked your mentors into thinking you were awesome. They are recommending you to do this stuff because they work closely with you and know you are qualified to do it.  \n\n\nTake home message, you will never know everything everyone else knows. But, that is not the purpose of your work. You need to  know the work you did, and you do. But, it is ok to not know everything about your work. \n\n&#x200B;\n\nYou will do well. Have faith, You deserve to be where you are.",
      "author": "Pop_pop_pop",
      "created": 1597445955,
      "upvotes": 4,
      "replies": {}
    },
    "g1isx4n": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1isx4n/",
      "text": "I know it sucks so much, but the best thing is actually to *lean into it*. Embrace the suckiness and it will become less uncomfortable over time. That, combined with finding a group of supportive people so you feel you belong, will be the best two things you can do to address this.\n\n&#x200B;\n\nThe first part sounds counterintuitive, but let me explain. Feeling out of place, feeling unsure, and feeling like you're beyond your comfort zone means you're exactly where you should be. You're learning, you're growing, and you're expanding your horizons. You don't want to change any of these things, as you want to learn and improve, but you definitely want to feel less uncomfortable!\n\n&#x200B;\n\nI personally have this feeling all the time. I'm going into my 5th year of grad school, 8th year of doing research, and over 20th year of being an insecure overachiever (the last one is an assumption from a very young age!). The part that changed is not feeling like an impostor, but whether I'm okay with feeling that way. Now I embrace feeling dumb! I put my best foot forwards and focus on learning from the experience.\n\n&#x200B;\n\nBelonging helps. I talked about belonging at the beginning, cause it's such a basic need we all have. If you feel like you deserve to be there (because you do), then the rest isn't as much of a problem. Obviously this is a crucially important part, but it gets a lot easier if you find even a few people who value you for who you are. Best of luck.",
      "author": "0102030405",
      "created": 1597464252,
      "upvotes": 4,
      "replies": {}
    },
    "g1htqih": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1htqih/",
      "text": "I am a master's student and have 3 publications yet I feel dumb on a daily basis especially when I foolishly try something in the lab that doesn't work which my supervisors already told me wouldn't work, or pretend to understand X-Ray crystallography data when I don't and tbh, it is difficult even for experienced people especially when dealing with something they haven't seen before.\n\nTo some extent I believe it has to do with the power dynamic working in research groups. A hierarchy exists and there will always be much more smarter people in your group and much more experienced. Every stupid idea that one may come up with will have been thrown to the trash by the much more experienced people in the group and sharing ideas feels a big deal in group meetings as you fear being coming out as utter dumb in front of the biggies.\n\nSo it is natural to doubt your own abilities. But as someone else also commented, you know your work better than anyone. Own it. I always find it easy to convey my work as a story. You may not recognize but always coming out as perfect is not the most ideal way rather research is about learning and storytelling is crucial when presenting your work. The parts you struggled with, how you overcame those, a bit of humor here and there always helps. Of course you need to know about your work but never let that get to your head as if that's the only thing that matters.\n\nOne great thing about discussing your work with others is that may point out something very trivial that you may have missed and help you channelize your work better.",
      "author": "__jaykay__",
      "created": 1597445255,
      "upvotes": 3,
      "replies": {}
    },
    "g1it7me": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1it7me/",
      "text": ">*How the fuck am I supposed to feel about this*\n\nTerrified, but go kick ass anyway. You've got this!",
      "author": "theolivewand",
      "created": 1597464380,
      "upvotes": 3,
      "replies": {}
    },
    "g1ksq1z": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1ksq1z/",
      "text": "Second year (soon to be third 😱😱😱) grad student and I've never felt as stupid and incompetent as I do in the lab :D but it's ok. Grad school is essentially a learning experience. Obviously you'd want at least a publication out of it, but the main thing is developing new practical skills that you can then apply in your future work. So just do what you're doing, don't worry about messing up, keep working and that's all that can be expected from you really. Well done for the conference though, it means you're definitely better than you give yourself credit for :)",
      "author": "anonymous-S",
      "created": 1597493951,
      "upvotes": 3,
      "replies": {}
    },
    "g1lagrd": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1lagrd/",
      "text": "Give it a little time. Nothing will both increase and deflate your opinion of other academics like working in academia.\n\n\nI've been in the ivory tower for a dozen years now and I am still amazed by the number of really brilliant people I've worked with over the years and the number of doofuses with doctorates.\n\n\nThe basic rules of society apply, treat everyone with respect and be open to hearing their story. Everyone there has their own journey.",
      "author": "Kreugs",
      "created": 1597499724,
      "upvotes": 3,
      "replies": {}
    },
    "g1hjr00": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hjr00/",
      "text": "It's not 'you vs curriculum' anymore, it's 'you vs god'.  We're all unqualified.  Finishing your degree isnt about not feeling this way, it's about doing exactly what you're doing.  Pushing forward despite the emotional trauma.  \n\nAs for speaking, if you've done something someone else hasnt done, then you have something to say.  There may or may not be pushback, but saying stuff to other smart people is the job.  No one is gonna beat you up afterwards, so just do the best job you can, sit down, feel like shit, second guess, and repeat until you graduate.\n\nI hate to put it this way, but fuck your feelings.  They're a shit barometer of how you're actually doing.  Unless you get fired, you're doing fine.",
      "author": "bjos144",
      "created": 1597440221,
      "upvotes": 6,
      "replies": {}
    },
    "g1hdcqd": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hdcqd/",
      "text": "I have a theory that imposter syndrome is closely related to your cultural background, and the kind of representation that academics had in art during your formative years.",
      "author": "olixius",
      "created": 1597437258,
      "upvotes": 8,
      "replies": {}
    },
    "g1hmoow": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1hmoow/",
      "text": "It helped me when I realised that my professors didn't know everything. Even when they seemed to have an answer for everything, eventually I realised just how often they were bluffing a bit. Made me feel like it's OK not to know everything, or that there's strength in admitting \"I'm not sure, but I can look it up/ ask someone who would know/ point you in the right direction\"",
      "author": "Philieselphy",
      "created": 1597441657,
      "upvotes": 2,
      "replies": {}
    },
    "g1i59tm": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1i59tm/",
      "text": "Not in the same STEM field but I felt like I just read something I wrote. It fucking sucks man!!! Sending ya love and encouragement!!",
      "author": "JamesonRae",
      "created": 1597451450,
      "upvotes": 2,
      "replies": {}
    },
    "g1j2ie4": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1j2ie4/",
      "text": "I've never really felt imposter syndrome, but plenty of MDs don't know shit.  They're probably going to be just as worried about being seen as a fraud as you are, and probably for better reason.  Don't worry about it.",
      "author": "dampew",
      "created": 1597468332,
      "upvotes": 2,
      "replies": {}
    },
    "g1mj8yn": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1mj8yn/",
      "text": "Not a stem student, but I feel this all the time, including right now! I try to remind myself that I'm learning and doing my best, but my perfectionist tendencies are so bad they're scary sometimes. I try to remind myself of what I can do. I heard once that comparison is the thief of joy.",
      "author": "What-the-heck-Craig",
      "created": 1597513887,
      "upvotes": 1,
      "replies": {}
    },
    "g1pgysy": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1pgysy/",
      "text": "Working on the cutting edge is lonely, and one often questions ones sanity there... but thats our job. Keep pushing further, this journey is only beginning.",
      "author": "MinotaurOnLucy",
      "created": 1597552799,
      "upvotes": 1,
      "replies": {}
    },
    "g1icoud": {
      "link": "/r/AskAcademia/comments/i9taxd/imposter_syndrome_is_a_blast/g1icoud/",
      "text": "Sounds like a humblebrag",
      "author": "my_stupidquestions",
      "created": 1597455686,
      "upvotes": -4,
      "replies": {}
    }
  }
}