{
  "sid": "qz8tbn",
  "link": "/r/AskAcademia/comments/qz8tbn/do_you_work_on_publications_after_you_quitted/",
  "title:": "Do you work on publications after you quitted academia?",
  "text": "Hi, do you work on publications or expected to work on publications after you quitted academia? This is my situation: I had a publication that I was working on as a postdoc but have since left academia and currently hold a full time job. As a postdoc, I designed the study collected data, did the analyses, and draft an outline of the manuscript. I then left to work for the government full time. After I left the lab, my supervisor had an assistant in the lab finished the manuscript. I did additional analyses and remained as a first author when the manuscript was submitted to a journal. The manuscript was reviewed and required additional analyses. I was asked if I could do the revisions (I would say extension revisions). I honestly feel that I no longer has the capacity to work on the manuscript with a full time job and other obligations during this challenging covid time. Should I say no? Remove myself from being the first author to a contributing author? My supervisor did offer if I couldn't do it, we could potentially have someone in the lab to work on it. I obviously did not want to sour the relationship I have with my supervisor so just curious what the expectations are.",
  "author": "waterbug0101",
  "created": 1637541718,
  "updated": 1637688587,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hll0z4g": {
      "link": "/r/AskAcademia/comments/qz8tbn/do_you_work_on_publications_after_you_quitted/hll0z4g/",
      "text": "I have seen people who left academia quit working on a manuscript after the first draft and still be first author on the manuscript. The advisor and a junior grad student did most of the work getting from the first draft to submission, and then through review. I have also seen many other people get a job and then never finish their manuscripts and it never mattered at all. Still, I have seen others finish manuscripts after starting a new job, since they were just really passionate about the work.\n\nKinda depends on where your priorities are right now, and if you can get help from co authors.",
      "author": "Forward-Philosophy46",
      "created": 1637544082,
      "upvotes": 7,
      "replies": {}
    },
    "hlldwbe": {
      "link": "/r/AskAcademia/comments/qz8tbn/do_you_work_on_publications_after_you_quitted/hlldwbe/",
      "text": "If you can't do it, you can't do it.  Depending on the amount of work needed, it might make sense to move you down the author list, yes.",
      "author": "Spambot0",
      "created": 1637550178,
      "upvotes": 5,
      "replies": {}
    },
    "hlmg3ht": {
      "link": "/r/AskAcademia/comments/qz8tbn/do_you_work_on_publications_after_you_quitted/hlmg3ht/",
      "text": "These are tricky, and it depends upon your PI.  Personally, I never remove the first author, as the bulk of the work remains theirs.  \n\nIn this situation I would  bring someone else in to do the required experiments, and that means they get an additional authorship.  If there was a lot of experimentation required, they would maybe get joint first (but second in the list).  If not so much they would get a position of second or further down the list.  BUT - I make sure I discuss with everybody, and make sure we are all on the same page before starting.",
      "author": "Life_time_learner",
      "created": 1637575759,
      "upvotes": 3,
      "replies": {
        "hlph79z": {
          "link": "/r/AskAcademia/comments/qz8tbn/do_you_work_on_publications_after_you_quitted/hlph79z/",
          "text": "> Personally, I never remove the first author, as the bulk of the work remains theirs.\n\nWell, this really depends on how much additional work is necessary to address the revisions. In a major revision, it can certainly require enough additional work to revisit the issue of author order.",
          "author": "mleok",
          "created": 1637627105,
          "upvotes": 2,
          "replies": {
            "hlqhbpb": {
              "link": "/r/AskAcademia/comments/qz8tbn/do_you_work_on_publications_after_you_quitted/hlqhbpb/",
              "text": "I accept that there could be cases, but personally have never come across it (with my students).  Extra experiments are normally that, extra that support the main experimental thesis rather than replacing it.  Given that the bulk of the original writing is normally done by the first author, it would have to be a pretty exceptional case to remove the first author.\n\nEven on typing that, I would be enormously reluctant to remove a first author.",
              "author": "Life_time_learner",
              "created": 1637645080,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlmkmf3": {
      "link": "/r/AskAcademia/comments/qz8tbn/do_you_work_on_publications_after_you_quitted/hlmkmf3/",
      "text": "Someone else should be brought in to do the analysis. They cannot expect you to sacrifice free time to finish the manuscript basically free of charge. If you do not depend on the paper being published I would say no . Also you could get in trouble with your employer if you continue working for your old lab which would be the argument I would bring to refuse.",
      "author": "CreepyBumblebee31",
      "created": 1637579647,
      "upvotes": 3,
      "replies": {
        "hlnen30": {
          "link": "/r/AskAcademia/comments/qz8tbn/do_you_work_on_publications_after_you_quitted/hlnen30/",
          "text": "Based on my experience and observations, there is the expectation that grad students/post doc work for free to finish off work, at least in the labs that I had been. If you do, you are a good grad student/post doc. If you don't, you are a terrible grad student/post doc. I have seen a post doc working while on mat leave. I definitely would not be able to work on the ms at my day job. I will have to find time in the evenings and weekends to work on the ms, which conflicts with my other obligations and responsibilities. Finding someone else from the lab to do the analysis seems to be the way to go. I will just be known as the not so good post doc. Eeeek",
          "author": "waterbug0101",
          "created": 1637596252,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlo4rwd": {
      "link": "/r/AskAcademia/comments/qz8tbn/do_you_work_on_publications_after_you_quitted/hlo4rwd/",
      "text": "It totally depends on the situation and the team. If you aren't able to do a significant portion of the work, you can revisit author order. If it's mostly done you can probably bring someone in as a second/third author to finish it. I know some people that keep publishing as a hobby/to keep options open/whatever. If you can't fit it in, you can't fit in. Just be flexible in your expectations and a reasonable PI/coauthor should be reasonable in theirs.",
      "author": "doctor-mal",
      "created": 1637606700,
      "upvotes": 3,
      "replies": {}
    },
    "hlpgjre": {
      "link": "/r/AskAcademia/comments/qz8tbn/do_you_work_on_publications_after_you_quitted/hlpgjre/",
      "text": "I don't think there are any hard feelings from your PI if you are unable to prioritize the paper after you've left academia, so long as you're willing to hand over all the data and code you have, let someone else handle the revisions and take over as first author. This is exactly what happened with one of my previous students, and taking over the paper was a good way for a newer graduate student to learn the mechanics of writing a paper.",
      "author": "mleok",
      "created": 1637626797,
      "upvotes": 1,
      "replies": {}
    }
  }
}