{
  "sid": "oq4rdj",
  "link": "/r/AskAcademia/comments/oq4rdj/how_do_you_ask_a_superior_for_access_to_a_dataset/",
  "title:": "How do you ask a superior for access to a dataset you're interested in?",
  "text": "I'm a postdoc and am part of a lab that is itself involved in a large scale study with a lot of data. It's a large collaborative dataset and I want to see if I can get involved and analyze some data/write a paper. \n\nHow can I ask my boss for this access? Will it look like I'm not happy with my current tasks? I don't want to seem invasive or demanding, I'm just interested and think I can add the tasks associated with analyzing some data to my current tasks without taking on too much. Any advice?",
  "author": "Prudent_Astronomer_4",
  "created": 1627054148,
  "updated": 1634082452,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "h69gzsd": {
      "link": "/r/AskAcademia/comments/oq4rdj/how_do_you_ask_a_superior_for_access_to_a_dataset/h69gzsd/",
      "text": "Confirm your current work and then ask for it as an additional task. If you find something they will get the extra finding/publication credit. \n\nBy asking you will also be showing initiative which is a sign of independence. :)",
      "author": "Azurus_Why",
      "created": 1627056463,
      "upvotes": 6,
      "replies": {
        "h69qo5u": {
          "link": "/r/AskAcademia/comments/oq4rdj/how_do_you_ask_a_superior_for_access_to_a_dataset/h69qo5u/",
          "text": "Cool thans for the advice!",
          "author": "Prudent_Astronomer_4",
          "created": 1627060580,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h6a99j0": {
      "link": "/r/AskAcademia/comments/oq4rdj/how_do_you_ask_a_superior_for_access_to_a_dataset/h6a99j0/",
      "text": "Talk to them? You should be meeting and discussing progress and ideas regularly. You're supposed to be working towards developing your own independent research portfolio so these should be the kind of conversations you're having with them. Just say you've had an idea, you think you can manage the workload, are they interested?",
      "author": "ACatGod",
      "created": 1627068772,
      "upvotes": 2,
      "replies": {}
    },
    "h6aine2": {
      "link": "/r/AskAcademia/comments/oq4rdj/how_do_you_ask_a_superior_for_access_to_a_dataset/h6aine2/",
      "text": "I’ve asked for datasets before. I went about it like “can I have access to that?”… it wasn’t a big deal, and I got access.",
      "author": "Ron_Day_Voo",
      "created": 1627072981,
      "upvotes": 2,
      "replies": {}
    }
  }
}