{
  "sid": "qfedpo",
  "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/",
  "title:": "Why is it so difficult to land a position as a full-time professor at a T20 research university?",
  "text": "To my knowledge, tenure-track professorships are increasingly being replaced by contingent faculty, which usually results in many English, philosophy and history Ph.D’s being compelled to pursue positions as adjuncts. Is that…all there is to it?",
  "author": "J_SAL005",
  "created": 1635160288,
  "updated": 1639840568,
  "over_18": false,
  "upvotes": 34,
  "upvote_ratio": 0.89,
  "comments": {
    "hhz31l3": {
      "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hhz31l3/",
      "text": "Number of candidates is far greater than the number of positions available, even ignoring adjunctification. If top-20 schools are all graduating, say, 10 PhDs in a particular field each year, then that’s 200 new PhDs. TT positions open up far slower — even if each of them hires 1 new TT each year, that’s only one tenth of new PhDs. And those new PhDs are going to be competing with visitors at other institutions too. It’s just a wildly imbalanced ecosystem",
      "author": "platonic_solidz",
      "created": 1635161942,
      "upvotes": 74,
      "replies": {
        "hhzi0bs": {
          "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hhzi0bs/",
          "text": "Yeah, on average each faculty needs to graduate one good Ph.D. to replace them. Maybe a second for growth or to account for dropout.",
          "author": "rlrl",
          "created": 1635170257,
          "upvotes": 16,
          "replies": {}
        },
        "hhz3hj1": {
          "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hhz3hj1/",
          "text": "Great response. I guess it’s just a cycle, and all boils down to your research, credentials, and a fair bit of luck.",
          "author": "J_SAL005",
          "created": 1635162243,
          "upvotes": 4,
          "replies": {
            "hhz4dyl": {
              "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hhz4dyl/",
              "text": "To be honest I think luck is the main aspect, I landed my position because they'd just got funding for a niche project that exactly aligned with my PhD research, we've just done a recruitment round and all the shortlist were hireable but our new strategic plan is focusing on climate change so the appointment was made due to one applicants work being focused on that, you can't plan that sort of thing when thinking about a career journey (and todays hot topic is 3-5 years from nows dead end) but when our mid range uni has an overabundance of equally employable candidates it comes down to stuff like that",
              "author": "tc1991",
              "created": 1635162841,
              "upvotes": 33,
              "replies": {}
            },
            "hhzsklk": {
              "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hhzsklk/",
              "text": "I have been on many search committees.  Almost always, the top 25% of candidates are virtually identical when it comes to credentials.  They came from good universities, have similar number of publications, similar teaching experience, etc.  So to even make the short list, you basically have to luck into someone on the committee finding something that they like.\n\nWe think that the 10-12 people that we phone interview can do the job.  At this point, we weed out those that do not have good communication skills or can't think fast on their feet.  After that, we have to pick 3-4 to come to campus out of probably 8-ish that are well qualified and did well on the phone interview.  You are almost in coin-flip territory now. \n\nI have been on at least two dozen search committees so I have sat through around 75 on-campus interviews.  I bet fewer than 10 eliminated themselves during the interview (bad presentation, socially awkward, tell bad taste joke, etc.).  It is not unusual for us to send all 3 names to our Dean in ranked order saying they were all acceptable.  \n\nThe luck part does not end here.  Rarely, we have had the Dean make offers out of order (after all, they are all acceptable) because they may have an initiative they want (increase diversity, cluster hires, etc.).  More common is that the first person turns down the job, so now the offer goes to number 2, etc.\n\nI'll give you a story about how random this all can be.  This is how we hired one of my best colleagues.  First, they didn't apply for our position, instead they applied for another position in our department.  Someone from that committee came to me with a CV and said I think you should look at this one.  We did phone interviews and then invited 3 people (my future colleague  not among them).  One of the three got a job offer and pulled out.  The remaining two were good.  We made an offer, but due to a family emergency, withdrew.  We made an offer to the second, but there was trouble finding the spouse a position, so declined.  We then called #4, 5, and 6 from the phone interviews, but they all have already received other job offers.  So we get to the person ranked #7 after the phone interviews (my future colleague).  At this point we are just going to bring in one at a time to either make an offer or move on, but they did wonderful and was a great hire.  \n\nYou just can't plan on any of that.  Everyone in my story was perfectly well qualified, but who ended up here was complete luck.",
              "author": "manova",
              "created": 1635174972,
              "upvotes": 14,
              "replies": {
                "hi06dd4": {
                  "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi06dd4/",
                  "text": "What's fascinating about this as well as that you managed to give offers to 4 people who already got other offers... How common is it for the job to go to the person who gets the first offer?  I'm genuinely asking here, as one wonders whether there is a weird Pareto effect going on where most people aren't getting any offers and a select group are getting multiple offers.  I wonder what could be leading to that as well...",
                  "author": "Lagrange-squared",
                  "created": 1635180672,
                  "upvotes": 1,
                  "replies": {
                    "hi08so4": {
                      "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi08so4/",
                      "text": "My university always has problems getting our act together and is always toward the tail end of the job market.  It is not surprising the top 10-ish out of 100 applicants are also competitive for other jobs.  Most of them have probably applied to dozens of jobs.  Almost all of the candidates that I liked but we didn't offer ended up in a faculty position elsewhere (I sometimes google them the next year out of curiosity).  \n\nI'd guess we are about 50% getting our first choice.  I have only been on 2 committees where we went back into the pool.  The one I described above, and another where one cancelled the week before, another got a better job offer, and the 3rd did not interview well.  The rest we either hired someone from our on-campus pool or failed the search. \n\nBut you are right, I would assume a small group get multiple offers while the majority never hear back from anyone.  Maybe some type of clearing house would be a better way to match people with positions.",
                      "author": "manova",
                      "created": 1635181668,
                      "upvotes": 3,
                      "replies": {
                        "hi2qmmn": {
                          "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi2qmmn/",
                          "text": "Honestly, even then, I'm not sure. The average time between graduation and full-time is around 4 months. It doesn't seem that unlikely that among four reasonably good candidates, all have found a job within that time.",
                          "author": "someth1ng_au",
                          "created": 1635221554,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "hi0jvsg": {
                      "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi0jvsg/",
                      "text": "> I'm genuinely asking here, as one wonders whether there is a weird Pareto effect going on where most people aren't getting any offers and a select group are getting multiple offers. I wonder what could be leading to that as well...\n\nThat is my experience. Almost everyone I know who got TT jobs had multiple offers. I am one exception, although my experience was that I got 0 campus visits for the first 6 years on the market, and then last year I applied for 3 jobs and got 2 campus visits, then one offer which is my current job.\n\nWhile there certainly is a luck element, I think people sometimes overstate the value of luck or misapply it. It's not the case that applying is a pure crapshoot and that there's nothing you can do to increase your chances of getting a TT job. At the same time, you can definitely fail to get a TT job thanks to forces outside your control. The \"luck\" tends to be like \"there were 3 really strong candidates, and you happened to be the one who specialized in the exact area the department happened to be looking for.\"",
                      "author": "honkoku",
                      "created": 1635186206,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hhz4bio": {
              "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hhz4bio/",
              "text": "Don't forget to add raging prejudices & discriminatory hiring practices to the mix",
              "author": "A1B6",
              "created": 1635162795,
              "upvotes": 13,
              "replies": {
                "hi2qop5": {
                  "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi2qop5/",
                  "text": "The classic \"eh, I don't know why, I just think they'll be a better fit\".",
                  "author": "someth1ng_au",
                  "created": 1635221590,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "hi0p7zn": {
          "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi0p7zn/",
          "text": "A faculty member career lasts about 30 years. \n\nIn other words, for every position — there are 200 new PhDs every year x 30 = 6000 potential applicants by the time that position opens again in 30 years. \n\nTo be fair, most of the 3000 will have given up, but that still leads to hundreds of potential applicants for every open position.",
          "author": "spinningcolours",
          "created": 1635188364,
          "upvotes": 24,
          "replies": {
            "hi1opp2": {
              "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi1opp2/",
              "text": "And 30 years might be an underestimate.  I started at 31. I fully expect to go past 70 assuming no health problems.",
              "author": "perceptionactionprof",
              "created": 1635203129,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "hi32po5": {
          "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi32po5/",
          "text": "Why is this a new issue? Wouldn’t this have been true way back?",
          "author": "colonialascidian",
          "created": 1635230151,
          "upvotes": 1,
          "replies": {}
        },
        "hna90g1": {
          "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hna90g1/",
          "text": "I don’t see that this is a problem though? I view it as akin to competitive sport, there are *far* fewer winning positions than losing positions. But what is the problem with the good people getting the positions?\n\nCertainly from experience there are much fewer good PhDs than PhD candidates.",
          "author": "PaboBormot",
          "created": 1638677531,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhz28af": {
      "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hhz28af/",
      "text": "It’s much cheaper for universities to do it that way. And universities in the US are increasingly profit-driven",
      "author": "Dgryan87",
      "created": 1635161386,
      "upvotes": 18,
      "replies": {}
    },
    "hhzkm81": {
      "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hhzkm81/",
      "text": "Great points here and also, at least in Canada, decades of  austerity measures implemented by government that manifests as hiring sessionals and increasing student enrolment to cover costs. The corporatization of the university is very real as evidenced by the massive increases to administration—VPs, deans, exec. assistance, etc. What money  there is is getting sucked to the top earners with the rest battling over scraps (this includes students). \n\nI don't think this is a cycle; I think we're witnessing the outcome of (neo)liberal policies that have fundamentally changed academia, and not for the better. As an adjunct of 10 years now (with industry consulting too) I'm considering abandoning academia as the prospects are low for my field(s), workaholism and petty politics is rampant, and the students are increasingly more difficult to teach as they're both lower quality and more entitled.",
      "author": "LanguidLandscape",
      "created": 1635171476,
      "upvotes": 15,
      "replies": {
        "hhzlwxc": {
          "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hhzlwxc/",
          "text": "You bring up some extremely interesting points. Thanks for sharing.",
          "author": "J_SAL005",
          "created": 1635172074,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhz9ytd": {
      "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hhz9ytd/",
      "text": "Yes, retiring faculty are being replaced by adjuncts in the humanities.  Meanwhile we gain ten assistant provosts and associate deans. \n\nThe main thing is that there are so many people out there who can teach philosophy 101 and English 202.  Big schools use grad students, small schools use the PhDs that those big schools turn out, as adjuncts.  \n\nAsk yourself as a provost, why would you approve a new tenure track salary line?  What does that person bring that you can't get from an adjunct?  \n\nI'm of the opinion that adjuncts are short sighted and we need to trim administration.  But the main point is that schools won't hire someone for life unless they need to do so.",
      "author": "FawltyPython",
      "created": 1635166222,
      "upvotes": 21,
      "replies": {
        "hi0vk3m": {
          "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi0vk3m/",
          "text": "Yes on the administrative bloat!! I recently retired after 25 yrs and one of the biggest changes at my university during those years was the constant expansion of the administrative ranks. Even during economic down turns, when the university cut back on student services, salaries, union contracts, maintenance, and everything else, they kept right on hiring assistant and associate deans.",
          "author": "wildblueroan",
          "created": 1635190864,
          "upvotes": 15,
          "replies": {}
        },
        "hi45y61": {
          "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi45y61/",
          "text": ">Ask yourself as a provost, why would you approve a new tenure track salary line? What does that person bring that you can't get from an adjunct?\n\nBecause that makes for a better faculty member, better academia, and a better environment for the increase of knowledge. \n\nOf course, from a dollars and cents / matriculating students stand point, there is no reason.",
          "author": "Average650",
          "created": 1635257012,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhzpufq": {
      "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hhzpufq/",
      "text": "Due to limited positions, they are looking for high-quality faculty which usually means those who are prolific in the science community and can secure millions of dollars in grants or are already influential (former presidents, nobel laureates, etc). Tenured faculty will likely enjoy extremely high job security and a healthy retirement plan so they expect that level of compensation back.",
      "author": "Disastrous_Fig_3762",
      "created": 1635173792,
      "upvotes": 1,
      "replies": {}
    },
    "hi04u5l": {
      "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi04u5l/",
      "text": "The grad students themselves provide cheap (compared to full-time TT profs) teaching as they are being trained, so there is no incentive for R1 schools to take fewer students even if only 10% of them land TT jobs.",
      "author": "talondarkx",
      "created": 1635180045,
      "upvotes": 1,
      "replies": {}
    },
    "hi06s2o": {
      "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi06s2o/",
      "text": "Yep. There's demand for teaching, and the professors there are have more work than they can handle. Administrators have just decided to hire fewer full time people than are needed to do the work.",
      "author": "raspberry-squirrel",
      "created": 1635180836,
      "upvotes": 1,
      "replies": {}
    },
    "hi1of3i": {
      "link": "/r/AskAcademia/comments/qfedpo/why_is_it_so_difficult_to_land_a_position_as_a/hi1of3i/",
      "text": "The supply of people with the *nominal* required credentials enormously exceeds demand. Even the supply of *genuinely* qualified people greatly exceeds demand, so not only are employers in a position to be very choosy they *must* be very choosy to weed out people who seem qualified on paper but aren’t. And it’s very debatable if universities are any good at this weeding out process.\n\nSo the real question is why is the supply so large compared to the demand? Is something perverse going on to artificially shrink the demand, or to artificially grow the supply, or both?\n\n(I think both)",
      "author": "TakeOffYourMask",
      "created": 1635202994,
      "upvotes": 6,
      "replies": {}
    }
  }
}