{
  "sid": "p3mlbh",
  "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/",
  "title:": "Getting a second bachelor's degree",
  "text": "I got graduated with a bachelor degree in microbiology.\nWhich I was forced into by my parents in hope of getting in medical school. But I was never interested in it. Every one offerd me some BS about how I will grow into it. \nWell, it never happend and I'm thinking of persuing my passion which is physics.\nIm 24 and now and Im afraid that Im too old.\nWhat do you think? Should I get another bachelor degree?\nUniversities are free in my country so money isnt an issue.\nThanks in advance.",
  "author": "Alien24601",
  "created": 1628867196,
  "updated": 1634079600,
  "over_18": false,
  "upvotes": 24,
  "upvote_ratio": 0.93,
  "comments": {
    "h8spfds": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8spfds/",
      "text": "People in my program came back for a second Bachelor's at ages upwards of 55+. Its never too late. 24 is still barely out of childhood. Do what you want.",
      "author": "Kaayak",
      "created": 1628870822,
      "upvotes": 16,
      "replies": {
        "h8we0on": {
          "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8we0on/",
          "text": "Thank you som much. I seriously considering it!",
          "author": "Alien24601",
          "created": 1628940500,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h8sgwsm": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8sgwsm/",
      "text": "24 isnt old, at all. If its free, go. If its anything like the US system, you'll be done in a couple years and finally be happy.",
      "author": "CptSmarty",
      "created": 1628867364,
      "upvotes": 25,
      "replies": {
        "h8we6i1": {
          "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8we6i1/",
          "text": "Yes some of the basic courses that I took for my first bachelor I wont need to take Again. I will be finished In 5 semesters",
          "author": "Alien24601",
          "created": 1628940622,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h8skeg0": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8skeg0/",
      "text": "If it’s free and you don’t mind the opportunity cost etc then eh sure why not.\n\nAnother option could be to pursue a graduate degree that plays to both your background and interests, eg biophysics.",
      "author": "--MCMC--",
      "created": 1628868816,
      "upvotes": 21,
      "replies": {
        "h8w6oki": {
          "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8w6oki/",
          "text": "If you find something that covers both interests, i think this is the way to go. I also think a second MSc is valued more than a second BSc degree.",
          "author": "StarryGlobe089",
          "created": 1628934352,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "h8stub3": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8stub3/",
      "text": "[deleted]",
      "author": null,
      "created": 1628872569,
      "upvotes": 6,
      "replies": {
        "h8wevxj": {
          "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8wevxj/",
          "text": "I thinks If I start a graduate program without a bachelor in physics I will lack alot of substantial knowledge and will effect my performence.\nI am also considering the opportunities that I would lose if I dont get a bachelor's degree in physics\nI will definitly look into biophysics.\nThank you so much for your helpful info 🙏🙏",
          "author": "Alien24601",
          "created": 1628941149,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h8skdwo": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8skdwo/",
      "text": "Microbiology -> Physics might not be the easiest switch but you could also look into getting a Master degree or PhD in Physics, if you find enough transferable lectures/skills and a university that accepts you.  \nThere's no guarantee but sometimes they accept applicants that can make a case how their former degree is a \"related degree\", possibly with a few extra conditions like completing certain lectures in a \"pre-semester\".",
      "author": "LittlePrimate",
      "created": 1628868810,
      "upvotes": 7,
      "replies": {
        "h8vzg7u": {
          "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8vzg7u/",
          "text": "The course work and exams could be extremely difficult to manage depending on OP's physics and math skills and the master's program. Even students with a BSc in physics usually find a physics master's challenging, and it builds directly on the bachelor's. \n\nI would not recommend this.",
          "author": "Shaneypants",
          "created": 1628928115,
          "upvotes": 3,
          "replies": {}
        },
        "h8wfa3n": {
          "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8wfa3n/",
          "text": "The switch wont be easy for sure. And I think a physics degree on its own is challenging.\nMy math and physics are pretty good but if I skip over a bachelor degree in physics I will have some gaps in my knowledge.",
          "author": "Alien24601",
          "created": 1628941434,
          "upvotes": 1,
          "replies": {
            "h8wjj7z": {
              "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8wjj7z/",
              "text": "Depends a bit on the program. As others have pointed out Biophysics might be an easy way in and from there you could easily transition into a Physics PhD program to fully get on track (if you want to try the Academic career path, that is).  \nMy University also allowed me to take a few Bachelor level lectures instead of Master level when I switched from Biology to Computer Science, which helped but yes, it was still rough. My brother switched from Mechanical Engineering to Entrepreneurship and they made him take one pre-semester with the most important Bachelor level lectures before he could join, which was still faster than a complete Bachelor plus better degree. I think he actually had a pretty good time.\n\nI personally took longer to complete the CS Master (4 years for 2 year program) but it was again still faster than Bachelor + Master and turned out to not only get me a great PhD position but also a perfectly fitting industry job.  \nWhat I would have done differently would actually just be being more careful about the program I joined. Mine wasn't the perfect fit for my interests, which made it additionally hard to get through.",
              "author": "LittlePrimate",
              "created": 1628944265,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h8tsld1": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8tsld1/",
      "text": "Definately not too old. In my country (Sweden), the average age to start university is 24.",
      "author": "daylightsilk",
      "created": 1628886376,
      "upvotes": 3,
      "replies": {}
    },
    "h8uueau": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8uueau/",
      "text": "Oh you’re still so young! There’s no age limit to education, it baffling how many people make the same remark.\n\nI did the same thing though, was pushed to finish a degree in something I didn’t like, took a year off then went back into what i actually liked (also not free, debt it fun). I started my 2nd bachelors at 23 and finished at 28.",
      "author": "Valeriyah",
      "created": 1628903100,
      "upvotes": 3,
      "replies": {
        "h8wfhgv": {
          "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8wfhgv/",
          "text": "I think people(including myself) in general compare themselves to others too much.\nThats great to hear that your also pesuing something you like.\nI wish you luck!",
          "author": "Alien24601",
          "created": 1628941581,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h8som4y": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8som4y/",
      "text": "Ever thought about getting into biophysics? This shouldn’t be to difficult to switch to with a bs in microbio. Or is it also something you’re not interested in?",
      "author": null,
      "created": 1628870494,
      "upvotes": 5,
      "replies": {
        "h8we9bq": {
          "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8we9bq/",
          "text": "I havent looked into biophysics but that defenitly an option",
          "author": "Alien24601",
          "created": 1628940682,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h8sk39j": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8sk39j/",
      "text": "You're probably better off getting a masters degree instead of repeating the bachelor's. It's more specialized, offers more avenues for employment, and you skip any general courses that might be required. If the masters is also free (or affordable) I'd just do that.\n\nEdit: it's also faster by 2 years. I'm also based in the US so this is US-centric advice.",
      "author": "A_Kiral",
      "created": 1628868689,
      "upvotes": 0,
      "replies": {
        "h8w38ah": {
          "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8w38ah/",
          "text": "A bachelor takes 3 years in Europe. So it's only one additional year, that is totally worth it if one wants to pursue one's dreams. Further, you should not neglect the advantages of having a broader education. Having a more quantitative education to a biology degree can be a big plus and will certainly make you standing out.",
          "author": "PizzaKawaii",
          "created": 1628931295,
          "upvotes": 3,
          "replies": {}
        },
        "h8t6v2y": {
          "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8t6v2y/",
          "text": "[removed]",
          "author": null,
          "created": 1628877713,
          "upvotes": -3,
          "replies": {
            "h8tb0xb": {
              "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8tb0xb/",
              "text": "You can do whatever for a masters irrespective of bachelor's for the most part so long as you can show interest via a good application essay or some experience on the side that can be justified towards the masters. Just because I did cs in undergrad doesn't mean I had to do a cs masters, I did English instead.\n\nEdit: because I have a lot to add. Most jobs for a physicist require an advanced degree anyway. Timewise OP would be looking at 6 years to get a bachelor's then another masters. If they already have a strong foundation in physics, why add an extra 4 years for the same end goal of eventually needing a masters? Just skip the bachelor's and go into the masters where they can truly explore their passion in a specialized, tailored setting without the need for gen Ed's? Even if the gen eds could be transferred from OP's original degree, that's still two years of coursework needed before having to pursue a masters anyway. \n\nAlso, to Schneizel, no need to be a dick. I'm just offering advice based on my experience of pursuing my passion in academia.",
              "author": "A_Kiral",
              "created": 1628879415,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h8wk3qi": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8wk3qi/",
      "text": "I think a good broad question is what's your plan after the physics degree? If you're going to enter industry then it's worth picking out your target jobs now and looking at the prerequisites. \n\nFor instance if I were going back again I'd be interested in industrial robotics asir leads to some cool jobs after.\n\nAcademia as a route definitely has its drawbacks.",
      "author": "parkway_parkway",
      "created": 1628944610,
      "upvotes": 1,
      "replies": {}
    },
    "h8wpn7d": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8wpn7d/",
      "text": "It is Important you do what YOU love to do. In my mind you are not to old to start a second degree!",
      "author": "Sea-Golf7787",
      "created": 1628947729,
      "upvotes": 1,
      "replies": {}
    },
    "h8wrkzx": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8wrkzx/",
      "text": "No. Get a job",
      "author": "tayt087x",
      "created": 1628948765,
      "upvotes": 1,
      "replies": {}
    },
    "h8ws5fo": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8ws5fo/",
      "text": "Time will pass whether you get the degree or not, might as well go ahead and get it so you can spend time on what you enjoy sooner.",
      "author": "Most_Honeydew_3617",
      "created": 1628949057,
      "upvotes": 1,
      "replies": {}
    },
    "h8wyphs": {
      "link": "/r/AskAcademia/comments/p3mlbh/getting_a_second_bachelors_degree/h8wyphs/",
      "text": "I had a similar shift in undergrad and added a physics degree towards the end of my biology bachelors. A lot of my physics classmates were non-traditional students who were going back to school (granted, that will vary by school and I was at a large state university). I think it depends on what it is about physics that you like! There are definitely paths you could pursue that would leverage your microbiology degree in more of a physics-focused environment, but there are also a lot of cool things about physics itself that you won’t learn that way. I’ve also found having both degrees to be super useful in making my options more flexible moving forward.",
      "author": "_mooge_",
      "created": 1628952236,
      "upvotes": 1,
      "replies": {}
    }
  }
}