{
  "sid": "re9ua4",
  "link": "/r/AskAcademia/comments/re9ua4/to_nsfother_fellowship_applicantsreviewrs_are_phd/",
  "title:": "To NSF/other fellowship applicants/reviewrs: are PhD coursework grades important?",
  "text": "I'm in a reputable U.S. PhD program for chemical engineering and will only be passing my 1st year core classes with the slimmest of margins to remain in good standing i.e. straight Bs - not even a B+. I believe the average person in these classes get B+/A-s, so I'm definitely in the minority. I'm nervous about how this would affect my applications for future fellowships, and no one can give me a straight answer.\n\nI get that research = most important and I'm not in a PhD program to excel in classes, but if I'm applying for a fellowship only in my second year, wouldn't my first-year PhD course grades still be really important? Or could other elements e.g. faculty letters, personal statement, and preliminary data still be strong enough to outweigh them? Would love to hear of experiences from former NSF/other fellowship applicants and/or fellowship reviewers if these grad school grades are still important or not - and how to mitigate them if they are.",
  "author": "Gavlanwheelndeal",
  "created": 1639259811,
  "updated": 1639515509,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "ho67fjm": {
      "link": "/r/AskAcademia/comments/re9ua4/to_nsfother_fellowship_applicantsreviewrs_are_phd/ho67fjm/",
      "text": "Yes grades are extremely important for pre-doctoral fellowships including undergrad grades. This includes the GRFP and others like the DoE CSGF but especially applied to the extremely competitive ones like the DoD NDSEG and the Hertz. Straight B’s is a very bad look for grad-level classes (equiv. to straight C’s) and so you need to have stellar research (maybe a first-authorship in your current lab), a very very good reason for poor grades, and LoRs talking about how your grades are not a reflection of your abilities. Depends on the field I guess tho and you’ll need some luck with whoever ends up on your study section.\n\nI’ve never served on an NSF study section so someone else here may have better advice.",
      "author": "Stereoisomer",
      "created": 1639260324,
      "upvotes": 3,
      "replies": {
        "ho6eclx": {
          "link": "/r/AskAcademia/comments/re9ua4/to_nsfother_fellowship_applicantsreviewrs_are_phd/ho6eclx/",
          "text": "I'll try to make up for it with next semester's grades, though it seems like focusing on research might be my best course of action. \n\nAt most I'm probably only applying for the GRFP, which from my understanding is slightly less hypercompetitive than the NDSEG/Hertz.",
          "author": "Gavlanwheelndeal",
          "created": 1639263433,
          "upvotes": 1,
          "replies": {
            "ho6ki13": {
              "link": "/r/AskAcademia/comments/re9ua4/to_nsfother_fellowship_applicantsreviewrs_are_phd/ho6ki13/",
              "text": "Yup the GRFP funds around 15-20ish% or something which is not outrageous but still very tough",
              "author": "Stereoisomer",
              "created": 1639266210,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ho67o5q": {
      "link": "/r/AskAcademia/comments/re9ua4/to_nsfother_fellowship_applicantsreviewrs_are_phd/ho67o5q/",
      "text": "Well, it’s forbidden for reviewers to answer questions about the review process bound by confidentially. \n\nBut grades are means to an end. For most research related things (grad school, fellowships, postdocs, faculty positions) what matters is your research output and letters, along with your proposal being strong. Really low grades can be a red flag, but high grades don’t really benefit you much.",
      "author": "Eigengrad",
      "created": 1639260430,
      "upvotes": 1,
      "replies": {
        "ho6e6mb": {
          "link": "/r/AskAcademia/comments/re9ua4/to_nsfother_fellowship_applicantsreviewrs_are_phd/ho6e6mb/",
          "text": "That actually makes a lot of sense and is reassuring - thank you!",
          "author": "Gavlanwheelndeal",
          "created": 1639263358,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho6yehx": {
      "link": "/r/AskAcademia/comments/re9ua4/to_nsfother_fellowship_applicantsreviewrs_are_phd/ho6yehx/",
      "text": "I was awarded an nsf grfp with one B on my phd transcript fwiw. It's just one (imo, smaller) portion of your evaluation as an applicant.",
      "author": "tiebow5",
      "created": 1639272813,
      "upvotes": 1,
      "replies": {}
    },
    "ho7hdrw": {
      "link": "/r/AskAcademia/comments/re9ua4/to_nsfother_fellowship_applicantsreviewrs_are_phd/ho7hdrw/",
      "text": "It’ll partly also depend where those grades are from. Top 10 vs bottom 50% will be looked at differently.",
      "author": "angrymarsupial",
      "created": 1639282275,
      "upvotes": 1,
      "replies": {}
    }
  }
}