{
  "sid": "phabhg",
  "link": "/r/AskAcademia/comments/phabhg/do_people_ever_stop_getting_nervous_before_giving/",
  "title:": "Do people ever stop getting nervous before giving a presentation?",
  "text": "I feel like getting nervous before presenting is as normal as breathing, no matter how many times I've done it before. Has someone got to the point that they don't even think about it anymore, and just feel relaxed?\n\nFor those needing some tips on effective communication/presenting, there's a podcast episode [here](https://your-digital-mentor.simplecast.com/episodes/presenting-skills) (start from minute 5 so you get straight into the action).",
  "author": "belamalta10",
  "created": 1630691770,
  "updated": 1634079414,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hbhhmvz": {
      "link": "/r/AskAcademia/comments/phabhg/do_people_ever_stop_getting_nervous_before_giving/hbhhmvz/",
      "text": "I still get a bit nervous, but it's good nervous. It's the little bit that pushes me to prepare to make sure my talk will be great, that little hit of adrenaline to really power through and be excited during a talk.\n\nI was an athlete for a long time and learned the lesson there. If I was every completely relaxed, comfortable, confident before a competition, that's when inevitably my performance would be flat, lifeless and I would make mistakes. For me, having a little bit of nerves is healthy because it means I respect and care about what I'm doing, and my brain is awake and alert.",
      "author": "LeopoldTheLlama",
      "created": 1630698497,
      "upvotes": 7,
      "replies": {}
    },
    "hbjzl3i": {
      "link": "/r/AskAcademia/comments/phabhg/do_people_ever_stop_getting_nervous_before_giving/hbjzl3i/",
      "text": "After a few years of 5-10 conferences per year I actually started to enjoy presenting. But then COVID strikedand during the two years without real conferences, I got nervous as I used to be.",
      "author": "IndependentLinguist",
      "created": 1630752253,
      "upvotes": 2,
      "replies": {}
    },
    "hbl5b1w": {
      "link": "/r/AskAcademia/comments/phabhg/do_people_ever_stop_getting_nervous_before_giving/hbl5b1w/",
      "text": "Uber anxious person here. Like... I don't call assistance of broken products under warranty because I don't want to disturb \"them\".\n\nNever had an issue with giving a presentation, even when just starting my career. Of course I get a slightly nervous when I'm about to start but... that's it.",
      "author": "lucaxx85",
      "created": 1630774572,
      "upvotes": 2,
      "replies": {}
    },
    "hblsua1": {
      "link": "/r/AskAcademia/comments/phabhg/do_people_ever_stop_getting_nervous_before_giving/hblsua1/",
      "text": "Yes and no. The more I present and the more knowledgeable I am about a topic the less I worry. Also, when I present in front of a new group I’m more nervous than a group I present in front of a lot. Doesn’t matter how big or small it is. Just me. Honestly, if you want to get over your fear, just volunteer to present a lot.",
      "author": "LawfulnessRepulsive6",
      "created": 1630785146,
      "upvotes": 2,
      "replies": {}
    },
    "hbk667u": {
      "link": "/r/AskAcademia/comments/phabhg/do_people_ever_stop_getting_nervous_before_giving/hbk667u/",
      "text": "Yes. Honestly, just do a lot of public speaking and it really does go away.",
      "author": "zukerblerg",
      "created": 1630757192,
      "upvotes": 1,
      "replies": {}
    }
  }
}