{
  "sid": "cyuo99",
  "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/",
  "title:": "Labour Day thread on precarious labour in post-secondary education:",
  "text": "Polemically put: post secondary educational facilities thrive on precarious labour. \n\nSome of this impacts our graduate students (as teaching assistants, research assistants, and people training to get a job one day), adjuncts, VAPs, non-ladder faculty, and postdocs. This precarity can then increase the workload of everyone higher above them (more letters of reference to write, more job applications to read, more work to supervise \\[if they do it\\]). \n\nPrecarious labour in the academy has been suggested to impact the [quality of teaching](https://www.chronicle.com/article/Conditions-Imposed-on/125573) (caveat: this article sparked a lot of controversy), [the production of hostile work environments](https://www.insidehighered.com/advice/2019/02/14/how-bias-toward-adjuncts-plays-out-among-students-other-faculty-and-administrators), and mental health crises (CW: [suicide](https://www.theatlantic.com/education/archive/2019/04/adjunct-professors-higher-education-thea-hunter/586168/)).\n\nPrecarious work extends far beyond the academic staff of a university found in the invisible labour that keep these institutions afloat: [food staff](https://www.thecrimson.com/article/2018/10/11/huds-strike-retrospective/), janitorial staff, and part-time administrators. \n\nThe consequences of precarious work extend far beyond the quality of life issues associated with economic and job security  ([example 1](https://www.sciencemag.org/careers/2019/08/hefty-university-fees-are-sending-some-grad-students-food-banks), [example 2](https://tenureshewrote.wordpress.com/2014/01/16/succeeding-in-graduate-school-despite-poverty/), [example 3](http://neatoday.org/2017/11/01/homeless-professor/), [example 4](https://www.theguardian.com/us-news/2017/sep/28/adjunct-professors-homeless-sex-work-academia-poverty), [example 5](https://washingtonmonthly.com/magazine/april-may-june-2019/how-college-professors-turned-into-uber-drivers/)) as well as issues of health insurance and retirement plans (for those not working in social welfare states). Included, but in no way limited to the plethora of sexual harassment cases (CW: discussions of sexual harassment and sexual assault): [example 1](https://www.thedp.com/article/2019/04/penn-sexual-harassment-in-academia-graduate-students-panel), [example 2](https://www.theatlantic.com/science/archive/2016/07/how-women-are-harassed-out-of-science/492521/), [example 3](https://medium.com/@UAW5810President/short-term-appointments-make-uc-postdocs-vulnerable-to-sexual-harassment-ccaeed532512), and [example 4](https://entropymag.org/a-refuge-for-jae-in-doe-fugues-in-the-key-of-english-major/).\n\n&#x200B;\n\nOn this labour day I am wondering what other academics of reddit have done to help protect the precarious workers we labour with.",
  "author": "usedhandles",
  "created": 1567456706,
  "updated": 1634081950,
  "over_18": false,
  "upvotes": 101,
  "upvote_ratio": 0.94,
  "comments": {
    "eyue7dk": {
      "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyue7dk/",
      "text": "I'm part of a voluntary union (sadly and unsurprisingly, professors in the business and medical schools sank the union vote) and, as I've moved up the ranks within my university, I've worked to create pathways for non-tenure track faculty that include security and opportunities for promotion.\n\nPerhaps a bit more controversially, I've been a pretty stalwart advocate against increasing the expectations for our non-tenure track positions. Some in said positions feel as if this means they are somehow viewed as 'less than' their colleagues; rather, I support the distinction because I do not feel it fair to increase the amount of labor placed upon them without a requisite increase in protections, stature, and compensation. In other words, it's a pretty transparent attempt by higher administration to weaken the protections of tenure; I want everyone paid for and protected in everything they do.",
      "author": "WrestlingStuffGuy",
      "created": 1567459791,
      "upvotes": 21,
      "replies": {}
    },
    "eyuazu1": {
      "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyuazu1/",
      "text": "[deleted]",
      "author": null,
      "created": 1567457424,
      "upvotes": 37,
      "replies": {
        "eyuhl05": {
          "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyuhl05/",
          "text": "> meeting two days before Christmas\n\nI'm from Canada and we generally get *more* holidays than they do in the US, but Dec 23rd is definitely a working day and if you need it off you burn a vacation day.",
          "author": "rlrl",
          "created": 1567462348,
          "upvotes": 30,
          "replies": {}
        },
        "eyudv7k": {
          "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyudv7k/",
          "text": ">the academy erodes sensible boundaries around amount of work\n\n100% it does. Research is rarely Monday-Friday 9-5 for me by its nature sometimes, but often academia constructs this idea that you should be always working. I worked in nonacademic research prior to grad school and this mentality just did not exist. Eg, even when I sometimes had to work a weekend or an evening for the purpose of research, I always took extra time off to compensate for it.",
          "author": null,
          "created": 1567459541,
          "upvotes": 15,
          "replies": {}
        },
        "eyucqjp": {
          "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyucqjp/",
          "text": ">to the point we had a meeting two days before Christmas\n\nI am originally from a predominantly-Christian European country, which has many more holidays and vacation allowances than the US, but I am confused - \"two days before Christmas\" isn't an official holiday for anyone even there (though *the* day before Christmas usually is). If some of you needed the extra day e.g. because of very long travel to the family home, did you ask for it in advance?",
          "author": "AstraGlacialia",
          "created": 1567458708,
          "upvotes": 31,
          "replies": {
            "eyv387t": {
              "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyv387t/",
              "text": "In the US, it isn't uncommon to spend a whole day driving. For example, it's 6 hours one-way for me to visit my parents, and I'm still in the same state. So a lot of times, since productivity is going to be shoddy or generally low if you have students coming in for 2 days after already having the weekend off, and the long travel times, it's just easier to get those days off. Easier on everyone.",
              "author": null,
              "created": 1567479341,
              "upvotes": 8,
              "replies": {
                "eyvdydu": {
                  "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyvdydu/",
                  "text": "A PI from China indeed doesn't seem likely to think of that without being told. An American-born PI who doesn't have family to visit (or whose family happen to be a much shorter ride / convenient plane trip away) also may not think of it at the right moment.",
                  "author": "AstraGlacialia",
                  "created": 1567490064,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "eyucz2b": {
          "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyucz2b/",
          "text": "Absolutely. Both internalized and strategic overworking. \n\nPointing to structure over cultural clashes, this wouldn't have been possible with better rights around vacation time. December 23rd isn't a protected holiday in any country I can think of, and doesn't inch up to a religious/cultural ceremony for many. But, the 23rd could be claimed as a part of vacation time if that was a part of academic contracts.",
          "author": "usedhandles",
          "created": 1567458881,
          "upvotes": 5,
          "replies": {}
        },
        "eywp511": {
          "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eywp511/",
          "text": "To everyone saying that it's not an official holiday, people need to take vacation day usually then, etc - \n\nMy department cancels the weekly dept meeting the week before, during, and after the week in which Christmas falls, even though those days are not official holidays. There's a recognition that people  tend to take vacation days around this time of the year and thus a large number of people are likely to be absent for those meetings, so they go on a hiatus until after the new year.  \n\nScheduling a meeting the same week as Christmas seems to imply an expectation that lab members will not be taking vacation days around the actual, official holiday.",
          "author": "alexa-488",
          "created": 1567534661,
          "upvotes": 2,
          "replies": {}
        },
        "eyyn5vp": {
          "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyyn5vp/",
          "text": "It sounds like nobody has given you \"the talk\" yet, so I'm going to suggest being a little bit less casual about conflating Christian and American holidays in groups that include American non-Christians. Most will be too polite to say anything in person, but they may not commiserate with \"only\" having two free days off around your big holidays.\n\n&#x200B;\n\nOf course there are lots of solutions around this. The one I'm familiar with is large, multicultural institutions letting people decide when to take their holiday time and making reasonable accommodations.",
          "author": "HM_D",
          "created": 1567595395,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eyubvz7": {
      "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyubvz7/",
      "text": ">On this labour day I am wondering what other academics of reddit have done to help protect the precarious workers we labour with.\n\nI helped unionize my campus and encourage all grad workers to do the same.",
      "author": "MrLegilimens",
      "created": 1567458078,
      "upvotes": 35,
      "replies": {
        "eyucnc0": {
          "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyucnc0/",
          "text": "I assume this means unionize the graduate students, yes? If so, ditto.",
          "author": "usedhandles",
          "created": 1567458641,
          "upvotes": 20,
          "replies": {
            "eyuco3d": {
              "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyuco3d/",
              "text": "Indeed.",
              "author": "MrLegilimens",
              "created": 1567458656,
              "upvotes": 9,
              "replies": {
                "eyw97dg": {
                  "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyw97dg/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1567523990,
                  "upvotes": 0,
                  "replies": {
                    "eyw9tv6": {
                      "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyw9tv6/",
                      "text": "Lol, sure. Because all those public universities have unions (Michigan, California, Wisconsin, Massachusetts, Rhode Island -- just off top of my head, of course many more) and the Ivys that are bargaining (Brown, Harvard) and the privates that are also bargaining (Georgetown, NYU, Columbia) definitely agree with you 0% factual fake story.\n\nUniversities can't live without grad workers. R1 labs can't function without them. They're cheaper labor than adjuncts.",
                      "author": "MrLegilimens",
                      "created": 1567524420,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "eywfb3d": {
                      "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eywfb3d/",
                      "text": "Just to make sure you don't miss it, here's the list of all unionized schools:\n\n* U Wisconsin-Madison\n* Rutgers\n* U Michigan\n* U Oregon\n* U Florida\n* U South Florida\n* Florida Agricultural & Mechanical University\n* U Mass Amherst\n* U Wisconsin- Milwaukee\n* U Mass Lowell\n* State University of New York\n* U Kansas\n* U Iowa\n* Wayne State University\n* U California\n* Oregon State University\n* New York University\n* U Mass Boston\n* Michigan State University\n* Temple University\n* University of Rhode Island\n* U Illinois Urbana Champaign\n* U Washington\n* U Illionis Chicago\n* California State University System\n* U Illinois Springfield\n* Southern Illinois University\n* Western Michigan University\n* Central Michigan Universty\n* Florida State University\n* Stony Brook Research Foundation\n* Montana State University\n* U Connecticut\n* Columbia University\n* Yale University\n* Brandeis University\n* American University\n* Loyola University\n* Tufts University\n* The New School for Social Research\n* Boston College\n* University of Chicago\n* Harvard University\n* Georgetown University\n* Brown University\n\nUniversities that have said \"k, bye\" to their graduate workers once unionized:\n\n* [blank]",
                      "author": "MrLegilimens",
                      "created": 1567528159,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "eyuj9hn": {
          "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyuj9hn/",
          "text": "Came here to say exactly this. I wonder if it is possible for postdocs to do the same. I'm not currently aware of any institution where postdocs are unionized.",
          "author": "Melkovar",
          "created": 1567463642,
          "upvotes": 9,
          "replies": {
            "eyujca4": {
              "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyujca4/",
              "text": "There are a few! Columbia and U Cali are the two I know of. Columbia’s got admin to the table with the grad workers.",
              "author": "MrLegilimens",
              "created": 1567463703,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "eyv9j3f": {
          "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyv9j3f/",
          "text": "This is so important, and should be the standard. I'm a PhD student at a university where unions are prohibited. (Actually, it might be a statewide thing.) Its a very one-sided arrangement that makes it difficult to peacefully encourage workplace improvements.",
          "author": "BiologyPhDHopeful",
          "created": 1567485153,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "eyudb7q": {
      "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyudb7q/",
      "text": "I have been a huge proponent of my graduate student union, but too over worked to participate much. Compounded by the fact that I have been \"in\" the union on/off due to stupid RA vs TA appointment reasons.",
      "author": null,
      "created": 1567459130,
      "upvotes": 18,
      "replies": {}
    },
    "eyucybn": {
      "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyucybn/",
      "text": "> On this labour day I am wondering what other academics of reddit have done to help protect the precarious workers we labour with.\n\nNothing. My uni's grad student union has made it clear that they don't give a fuck about master's students, so I don't give a fuck about my uni's grad student union.",
      "author": "IvesMeow",
      "created": 1567458866,
      "upvotes": 14,
      "replies": {
        "eyudh2p": {
          "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyudh2p/",
          "text": "Master's students really are in a rough place to support other precious workers,  as almost everyone would be working above you. It is shitty to hear that you aren't getting support from your union. \n\nOut of curiosity: do they not support Master's students even when they are teaching assistants, research assistants, or conducting other work?\n\nOne of the difficulties around unions in American and Canadian higher ed is often that they don't cover the research conducted by those students for their degrees, as this often falls outside of the categories of \"protected labour\", even when it is no less vulnerable when tied to a lab, fieldwork, a faculty member's project, etc.\n\nYou might not want to do the heavy lifting, but there may be union reps that you could bring complaints to. Especially if the vote to unionize included master's students.",
          "author": "usedhandles",
          "created": 1567459247,
          "upvotes": 10,
          "replies": {
            "eyudouu": {
              "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyudouu/",
              "text": "> Out of curiosity: do they not support Master's students even when they are teaching assistants, research assistants, or conducting other work?\n\nUnder their collective bargaining agreement, they do not permit master's students to work as teaching assistants or even tutors in the university tutoring center. Those go exclusively to PhD students. That's why I decline to support the graduate student union. I've brought it up to the union president, but he essentially told me \"yeah it sucks but it is what is is. sorry.\"",
              "author": "IvesMeow",
              "created": 1567459412,
              "upvotes": 8,
              "replies": {
                "eyudtj6": {
                  "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyudtj6/",
                  "text": "That is really unfortunate.",
                  "author": "usedhandles",
                  "created": 1567459506,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "eyumrwq": {
      "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyumrwq/",
      "text": "I've marched with my union, which includes graduate teaching and research assistants. A couple years ago we sympathy striked with the adjunct union, the profs have no such union. Our library staff also striked while i was at school. It was amazing how many precarious workers picked up these crucial roles to keep students going. My many thanks to precarious university workers, or as some are billed, casual employees.",
      "author": "somegenerichandle",
      "created": 1567466401,
      "upvotes": 7,
      "replies": {}
    },
    "eyvm295": {
      "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyvm295/",
      "text": "I'm not in the US, but these issues are affecting universities across the Western world, and although some of the issues are context-specific (e.g. how unions work) and political (e.g. public funding), there is a large demographic element that is not easily solved: higher education has expanded and birthrates have gone down, and there simply will be more PhDs than professorships. \n\nAcknowledging this, my contribution is to make sure grad students (and post docs) have a good non-professor career route plan, if things don't work out in plan A. This is not very complicated - they just need to be able to explain what they do in a different way. \n\nAlso, in our current system, adjuncting is not a full-time job, and should not be expected to lead to one. I don't think this will change, so we'll need to be open about it. If someone wishes to try full time adjuncting, they are free to, but it should be mainly a side gig, especially for those who need it for their cv (post docs and stuff).",
      "author": "sharkinwolvesclothin",
      "created": 1567501213,
      "upvotes": 5,
      "replies": {}
    },
    "eyvnj5y": {
      "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyvnj5y/",
      "text": "As a doctoral student, I've tried to convince other students in my research group that unpaid labour does *not* improve their CVs enough to warrant  more than a  bare minimum  number of hours, and  I've said as much in group-wide meetings.  The retiring head of our group was a big fan of the idea of \"contributing to the field\" with unpaid labour, without drawing a distinction between  more useful types of volunteering, like helping run a conference, and less useful kinds like running workshops  for Masters' students  (which is teaching and should be compensated) or running social media platforms for the group (very time-consuming,  limited upside). Meanwhile, our Faculty has  cut the number of admin positions in half, claiming that doctoral students can pick up the slack (for free), which none of us have time to do even if they *did* pay us for it.  The culture here is ridiculous, and many of my peers buy into it, to  their detriment  imo.",
      "author": "stainedglassmoon",
      "created": 1567503450,
      "upvotes": 3,
      "replies": {}
    },
    "eyv3slo": {
      "link": "/r/AskAcademia/comments/cyuo99/labour_day_thread_on_precarious_labour_in/eyv3slo/",
      "text": "You really got hung up on the word \"precarious\" huh? \n\nSeriously, what is the point of writing such a high handed  post? This is reddit, please be real. I agree with a lot of your points but you are doing academics a disservice by writing in such a inaccessible tone.",
      "author": "DrSucculentOrchid",
      "created": 1567479807,
      "upvotes": -16,
      "replies": {}
    }
  }
}