{
  "sid": "d3f0xu",
  "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/",
  "title:": "Do search committees read applications as they come in, or all at once on the \"review date?\"",
  "text": "Wondering whether there's any advantage to turning in an academic job application earlier than right before the deadline.",
  "author": "Iron_Rod_Stewart",
  "created": 1568324835,
  "updated": 1634082093,
  "over_18": false,
  "upvotes": 94,
  "upvote_ratio": 0.98,
  "comments": {
    "f0283mq": {
      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f0283mq/",
      "text": "[deleted]",
      "author": null,
      "created": 1568325302,
      "upvotes": 69,
      "replies": {
        "f0297qb": {
          "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f0297qb/",
          "text": "We don't have this limitation at my institution. The applicant pool has to be \"certified\" by HR before we can dig into it though.",
          "author": "Jurassic_Eric",
          "created": 1568326006,
          "upvotes": 22,
          "replies": {
            "f029yav": {
              "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f029yav/",
              "text": "[deleted]",
              "author": null,
              "created": 1568326450,
              "upvotes": 6,
              "replies": {
                "f02b98l": {
                  "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f02b98l/",
                  "text": "I'm in the US. I think our ads typically say review will begin 30 days after posted and continue until the position is filled or closed. I've interpreted (and HR has been ok with) \"review\" meaning the actual scoring of applications. We are still able to look at them. In particular, we check that applications are complete and let the applicants know if something is missing. I have only taken the time to look before I was required when I was a search chair.",
                  "author": "Jurassic_Eric",
                  "created": 1568327152,
                  "upvotes": 9,
                  "replies": {
                    "f02c061": {
                      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f02c061/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1568327570,
                      "upvotes": 3,
                      "replies": {
                        "f02c9lq": {
                          "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f02c9lq/",
                          "text": "I think it is ass covering to an extent, but there is a significant amount of wanting to follow the spirit as well and fairly identify strong candidates.",
                          "author": "Jurassic_Eric",
                          "created": 1568327703,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "f02vt4x": {
          "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f02vt4x/",
          "text": ">We can't look at them until the due date listed in the ad.\n\nThat's entirely school dependent. At mine, all committee members have access to incoming applications in real time. As a frequent search committee chair, I instruct my colleagues to have *all* complete applications read before the first committee meeting, which is typically 48 hours after the deadline (we usually close searches on a Monday and meet on Wednesday).  I don't think getting it in *early* is going to make any difference, but you certainly do not want to be late.\n\nThat first meeting is the initial cut, so if your file isn't in (and complete) by the deadline it probably won't be read by anyone but the search committee chair and it's rare that on gets added to the short list late. When there are 200+ applicants for every opening (and 500+ in some fields) nobody is looking to draw the process out.",
          "author": "SnowblindAlbino",
          "created": 1568339223,
          "upvotes": 21,
          "replies": {}
        },
        "f028iib": {
          "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f028iib/",
          "text": "Interesting. Do they... get placed in a pile by order? (No that this really matters; I'm just curious.)",
          "author": "Iron_Rod_Stewart",
          "created": 1568325565,
          "upvotes": 18,
          "replies": {
            "f029nub": {
              "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f029nub/",
              "text": "[deleted]",
              "author": null,
              "created": 1568326270,
              "upvotes": 43,
              "replies": {
                "f02otx8": {
                  "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f02otx8/",
                  "text": "Surprising that there's so much advice out there about applying early to show your enthusiasm for the position. Not surprising that large swaths of the conventional wisdom about academic job seeking are hogwash.",
                  "author": "Bill_Nihilist",
                  "created": 1568335097,
                  "upvotes": 18,
                  "replies": {
                    "f04gtpf": {
                      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f04gtpf/",
                      "text": "I don't think I've paid the least bit of attention to the submission date on any search I've chaired. However, it's probably not coincidental that some of the last-minute applications are incomplete, and those do wind up rejected. Applying early is probably a good idea just so that you can confirm that your file is 100% complete.",
                      "author": "galileosmiddlefinger",
                      "created": 1568387199,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "f02w8y2": {
                  "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f02w8y2/",
                  "text": ">If we looked at any applications earlier than the due date or treat them differently based on submission date (before the deadline), then we open ourselves to possible trouble. \n\nWhy? Treating them differently based on submission of course makes no sense, but what difference does it make when they are read? I've been on search committees in academia, private industry, and government over the last 30 years and never once had anyone suggest there was a reason no to read them as they came in, or the weekend before the closing date, or whatever.  Our HR system releases applications to committee members as soon as they are submitted, be that for a janitorial position or for the provost. (The only difference would be for executive positions-- i.e. presidents --that are handled confidentially using a consultant.)",
                  "author": "SnowblindAlbino",
                  "created": 1568339488,
                  "upvotes": 4,
                  "replies": {
                    "f0429qe": {
                      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f0429qe/",
                      "text": "Because of biases introduced through anchoring\n\n[https://en.wikipedia.org/wiki/Anchoring](https://en.wikipedia.org/wiki/Anchoring)",
                      "author": "cyberonic",
                      "created": 1568377771,
                      "upvotes": 4,
                      "replies": {
                        "f042a2n": {
                          "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f042a2n/",
                          "text": "**Anchoring**\n\nAnchoring or focalism is a cognitive bias where an individual depends too heavily on an initial piece of information offered (considered to be the \"anchor\") when making decisions.\n\nAnchoring occurs when, during decision making, an individual depends on an initial piece of information to make subsequent judgments. Those objects near the anchor tend to be assimilated toward it and those further away tend to be displaced in the other direction. Once the value of this anchor is set, all future negotiations, arguments, estimates, etc.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/AskAcademia/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28",
                          "author": "WikiTextBot",
                          "created": 1568377778,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "f051m3e": {
                          "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f051m3e/",
                          "text": "If the alternative is asking committees to \"read\" 250+ applications in a week or less, I'd favor anchoring. If anything I'd imagine there would be a fairer process due to people taking their time vs being rushed-- if I'm racing through huge piles of applications it's probably *more* likely I'll treat the first few dozen differently than if I took my time and read them carefully as they came in or in batches.\n\nIf we're using a rubric to evaluate them (which we do) that would likely even things out *if* people are not in a hurry.",
                          "author": "SnowblindAlbino",
                          "created": 1568400667,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "f02ayko": {
              "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f02ayko/",
              "text": "Most of the HR softwares I’ve used sort them alphabetically or by alphabetically by period. If a search is extended, for instance, it then shows applications divided by each phase and sorted alphabetically.",
              "author": "cdb3492",
              "created": 1568326987,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "f046wxu": {
          "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f046wxu/",
          "text": "At my university, we can see applicants as they come in, but in practice, most search committee members do not really look at them until the last minute depending on when we set our first meeting to get a phone interview list.",
          "author": "manova",
          "created": 1568381081,
          "upvotes": 1,
          "replies": {}
        },
        "f04ncwm": {
          "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f04ncwm/",
          "text": "Where I am, search chairs often do superficial reviews as apps come in to look for:\n\n1. People who don't meet the basic qualifications\n2. People who are missing materials\n3. Signs that the search window might need to be extended\n\nStill, I don't think there is an advantage to applying very early other than avoiding the terrifying possibility that you have technical problems on the day the application closes.",
          "author": "mediaisdelicious",
          "created": 1568391329,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f02klif": {
      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f02klif/",
      "text": "We can look at them and rate them as they come in. I don’t feel differently about early or late applicants.",
      "author": "ThatProfessor3301",
      "created": 1568332826,
      "upvotes": 14,
      "replies": {}
    },
    "f0290we": {
      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f0290we/",
      "text": "Given how busy faculty are and the number of times my advisor has completely ignored my e-mails, I would say they review applications only when they have to.",
      "author": "fumblesmcdrum",
      "created": 1568325893,
      "upvotes": 25,
      "replies": {}
    },
    "f028mbt": {
      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f028mbt/",
      "text": "It can happen, but probably not in a complete or formal way.\n\nSometimes committees, especially chairs, can and will look at them as they come in.",
      "author": "BeesOnBlow",
      "created": 1568325633,
      "upvotes": 17,
      "replies": {}
    },
    "f02ikf8": {
      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f02ikf8/",
      "text": "It depends. I think the most common answer is that they do not get reviewed early. But things can vary.\n\nWhere I am at, we don't get to peek at anything until the whole batch has been processed and released by HR.\n\nTechnically if it says \"review\" date, they committee should not be starting early. But if it is a \"closing\" or \"due\" date, they could start reviewing whenever they feel like it.",
      "author": "trailmix_pprof",
      "created": 1568331631,
      "upvotes": 5,
      "replies": {
        "f02wjoz": {
          "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f02wjoz/",
          "text": ">Technically if it says \"review\" date, they committee should not be starting early. \n\nThat's certainly not been the practice anywhere I've worked-- \"review date\" or \"closing date\" means that's when the committee gets together to start making cuts. If *nobody* even looked at 200+ applications until after the close date it would take forever to get past the first step.",
          "author": "SnowblindAlbino",
          "created": 1568339664,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f02lwai": {
      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f02lwai/",
      "text": "If its a competitive position, committees are wise to be aware of candidates as they come in.\n\nSometimes you can lose good candidates, because you waited too late to contact them.  Likewise, you have a better chance at a good candidate if you can get them booked earlier.",
      "author": "TallahasseWaffleHous",
      "created": 1568333512,
      "upvotes": 4,
      "replies": {}
    },
    "f0445r0": {
      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f0445r0/",
      "text": "I've been on several search committees at several institutions, and (as others are saying), there's seldom any benefit to beating the review date. However, if there's a review date and a deadline, it's critical to make the review date. One place I worked, HR would release applications to us on the review date, but we had to file a request to review any additional applications that came in after the review date but before the deadline. HR policies required us to vet and score all newly released applications, not just look for good ones. This means search committees seldom asked for more applications after the review date even though dozens may have arrived before the deadline.",
      "author": "Michel_Foucat",
      "created": 1568379181,
      "upvotes": 5,
      "replies": {
        "f047aio": {
          "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f047aio/",
          "text": "I was going to say this—there's seldom any benefit to beating the review date. At my institution, with the system we use, the search committee technically has the ability to log in and see who has applied, but aside from just checking in, we don't really review anything until after the deadline closes. Pragmatically, I've yet to meet anyone who has the ability to take 20-30 minutes out of their day every time a new applicant comes in.",
          "author": "stoutprof",
          "created": 1568381331,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f04bw4u": {
      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f04bw4u/",
      "text": "If you are talking about universities hiring for professor or TT positions, they usually have a filter on the email inbox that automatically reads the part of the CV where it says how much grant money they currently have, and if it is below a certain value, the email is automatically redirected to the spam folder and the person's email address is blocked.\n\n.../s",
      "author": "CaptainCornerCamper",
      "created": 1568384192,
      "upvotes": 2,
      "replies": {}
    },
    "f040t8b": {
      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f040t8b/",
      "text": "Our HR system shows applications to us as they come in.  This doesn't mean everybody on the search committee looks at them as they come in, though.",
      "author": "SearsZamanskyYoung",
      "created": 1568376632,
      "upvotes": 1,
      "replies": {}
    },
    "f044sor": {
      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f044sor/",
      "text": "I am currently on the job market, and it's frustrating that over 50% of the TT jobs I am looking at do not specify when applications close.  Is it safe to assume that it is just 30-days after the posting date on that university's website?",
      "author": "fresnel_lins",
      "created": 1568379644,
      "upvotes": 1,
      "replies": {
        "f04n3e0": {
          "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f04n3e0/",
          "text": "> Is it safe to assume that it is just 30-days after the posting date on that university's website?\n\nIt might be safe to assume that it probably isn't sooner than that.  You should contact HR at those schools and ask.  Some schools just don't have close dates and always accept until the position is filled.",
          "author": "mediaisdelicious",
          "created": 1568391163,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f04c8df": {
      "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f04c8df/",
      "text": "(I'm not an academic, but I do employment compliance and AA/EO for a university)\n\nI do the training on stuff like this at my university. I counsel departments to have a support staff person (Office Manager, etc.) to receive the applications, send a \"thanks for your app\" email, and prep them for committee review. After the deadline date, the committee has access to the applications. They can review them together at a meeting, or review them individually and discuss them at the meeting.\n\nAs for advantages to the timing of your application, early is good in my experience. The most impartial ways to organize applications for review is by order received or alphabetically. Most of my committees go in order received. You want to be in the first 10-20 apps reviewed, not 90 or 100.",
      "author": "Arderis1",
      "created": 1568384394,
      "upvotes": 1,
      "replies": {
        "f04mxxa": {
          "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f04mxxa/",
          "text": "I wish I could afford that kind of administrative support!",
          "author": "mediaisdelicious",
          "created": 1568391065,
          "upvotes": 1,
          "replies": {
            "f04qyaq": {
              "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f04qyaq/",
              "text": "Our faculty hiring process is really decentralized. Each College, and most of the Schools/Departments, have at least a front office person to handle their day-to-day operations. That includes phones, calendars, meeting schedules, etc. but they also handle vacancy communications when necessary. I am under no illusions that they all do it perfectly, but I hope they are at least meeting the minimum requirements! If not, it's going to show up in some compliance audit or IA investigation and we can correct it from there.",
              "author": "Arderis1",
              "created": 1568393629,
              "upvotes": 1,
              "replies": {
                "f04rm8s": {
                  "link": "/r/AskAcademia/comments/d3f0xu/do_search_committees_read_applications_as_they/f04rm8s/",
                  "text": "Ours is frustratingly centralized - so much so that the hiring managers are never direct supervisors (which makes using our hiring software really frustrating).  Yet, it still doesn't lead to standardization in any meaningful sense, save for ways which ends up being counter-productive.  Like, all the job calls are standardized, but totally unhelpful.  We can't solicit sealed letters of recommendation.  Search chairs can't be given permissions (beyond view) in the candidate management system.  Ugh.",
                  "author": "mediaisdelicious",
                  "created": 1568394049,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}