{
  "sid": "djzo73",
  "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/",
  "title:": "Universities should make free coffee a thing for Grad students who clearly rely on it for survival 😪",
  "text": "Honestly, this is one of the perks I look forward to at conferences and at an internship I did earlier (talk about priorities) \n\nI know some people who bring their own coffee machines, but if faculty and staff have access to a pretty nice coffee vending machine, why not grad students, who are already underpaid, work long hours and when each Starbucks coffee quickly adds up?\n\nEdit: Typically in the US (afaik), grad students are not considered full staff and hence in my institute, do not have access to the room that houses the said vending machine.",
  "author": "Gee_Es10",
  "created": 1571464122,
  "updated": 1634080189,
  "over_18": false,
  "upvotes": 295,
  "upvote_ratio": 0.89,
  "comments": {
    "f49iipi": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49iipi/",
      "text": "Just go into the faculty and staff area.  No one will question you. :)",
      "author": "trevor4551",
      "created": 1571467980,
      "upvotes": 112,
      "replies": {
        "f49oqp2": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49oqp2/",
          "text": "I find this comment kind of surprising. Everywhere I've worked (two departments in the UK, one in Germany) graduate students have been treated as staff and used the same coffee making equipment.",
          "author": "EmeraldIbis",
          "created": 1571477425,
          "upvotes": 108,
          "replies": {
            "f4a8qiu": {
              "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4a8qiu/",
              "text": "I just moved from the US to Europe after doing my PhD there, and holy ballsack were we ever treated as children. The kitchen was completely off-limits as we weren't trusted to clean up after ourselves (not that the staff would, either). We had to wash our dishes in the bathroom. They got upset that we were doing this, so they *literally* told us to use the commuter kitchen that was on the other side of campus. Seeing that sign was the first time I felt my blood actually boil. I was furious.\n\nWe revolted after that, and our new department chair saw through the bullshit and opened up the kitchen. Un-fucking-believable.\n\nMoving to Europe was a complete eye-opening experience. The administration at the university actually *helped* us, rather than being a thorn in our side and trying to flex their egos. Our department secretary here is actually respected, and fully deserves that respect. Our kitchen is stocked with an expensive espresso machine and unlimited coffee. We have an induction stove, so I can literally cook food here.\n\nEven as an undergrad in Canada, if I was employed as a student researcher, I was granted full access to everything as an employee.",
              "author": "notadoctor123",
              "created": 1571490601,
              "upvotes": 61,
              "replies": {
                "f4aelam": {
                  "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4aelam/",
                  "text": "This sounds unique to your school/department. Everything you describe about your experience in Europe is spot-on with my university... which is in the US. \n\nBasically I don’t think how your university treated grad students was the norm at all.",
                  "author": "curvebreaker",
                  "created": 1571493635,
                  "upvotes": 52,
                  "replies": {
                    "f4aki5m": {
                      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4aki5m/",
                      "text": "You are absolutely right, but it wasn't even my university - it was specific to my department. Adjacent apartments had their own amenities which grad students could use. I guess my point is that this most certainly wouldn't be tolerated in any way, shape or form at my current European institution, but for some reason it was tolerated by all in my old department.",
                      "author": "notadoctor123",
                      "created": 1571496655,
                      "upvotes": 14,
                      "replies": {}
                    }
                  }
                },
                "f4aukes": {
                  "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4aukes/",
                  "text": "This is not even close to my experience in the US. You had a crazy dept.",
                  "author": "johnnydaggers",
                  "created": 1571501737,
                  "upvotes": 17,
                  "replies": {
                    "f4awylc": {
                      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4awylc/",
                      "text": "Yeah, that's kind of what I'm gathering... my PhD advisor was amazing though, so I don't regret doing it at all - he made it completely worth it. I will have to rib him over this next time I see him at a conference.",
                      "author": "notadoctor123",
                      "created": 1571502950,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                },
                "f4ae1ct": {
                  "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4ae1ct/",
                  "text": "Wow that's really insane to me. I'm sure my PI would go crazy if some administrator tried to waste our time like that!",
                  "author": "EmeraldIbis",
                  "created": 1571493280,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "f4a552h": {
              "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4a552h/",
              "text": "Even so, it's not like it's free. At least in Germany, universities will not provide coffee. It's up to the departments to implement policies regarding the coffee supply. And usually, whenever you take a cup of coffee, you have to put a mark next to your name on a list. Then the cost for coffee, milk and so on is split between the people who drink coffee according to how much coffee they drank in the past month.",
              "author": "rpfflgt",
              "created": 1571489105,
              "upvotes": 18,
              "replies": {
                "f4ajvx5": {
                  "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4ajvx5/",
                  "text": "PI here. This sounds pretty skinflint to me. I just buy a big thing of Folgers or 8 O'Clock whenever our lab coffee supply is low. Christ, I make like 6 times what a graduate student does, I can spring for an $11 container of coffee every couple of weeks.",
                  "author": "Argos_the_Dog",
                  "created": 1571496366,
                  "upvotes": 25,
                  "replies": {}
                },
                "f4aeb4a": {
                  "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4aeb4a/",
                  "text": "Yeah, we have two communal espresso machines. One where you pour in beans from the top and one which takes capsules. We bring our own coffee for the machine, as do all of the staff and professors.\n\nIn my previous department in the UK we had free instant coffee, tea, milk and sugar. Plus a capsule machine we had to bring our own capsules for.",
                  "author": "EmeraldIbis",
                  "created": 1571493454,
                  "upvotes": 12,
                  "replies": {}
                },
                "f4ca0dx": {
                  "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4ca0dx/",
                  "text": "At the Danish university I am at the coffee is free for both staff and PhD-students. So it seems to vary quite a lot from country to country or perhaps university to university.",
                  "author": "JustBecauseOfThat",
                  "created": 1571526401,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "f4a8jxk": {
              "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4a8jxk/",
              "text": "We have the same coffee-making equipment, but that just means it isn't free for the staff either :( \n\nI bring my own instant coffee and just use that",
              "author": "NoxiousQuadrumvirate",
              "created": 1571490517,
              "upvotes": 5,
              "replies": {}
            },
            "f49ou65": {
              "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49ou65/",
              "text": "I've worked places with both arrangements-- was responding to OPs remarks about faculty/staff having designated coffee.",
              "author": "trevor4551",
              "created": 1571477576,
              "upvotes": 3,
              "replies": {}
            },
            "f4atsmz": {
              "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4atsmz/",
              "text": "It's funny in Canada (at least my school) we're treated as both and neither. We're allowed to use the staff lounge but coffee still costs a $1 and undergrads can technically get in there because the doors not locked. It's up to us to kick them out which rarely happens cause who knows if they're actually undergrads. We're told over and over in orientation that we're staff and we're employees of the university but we can't use the good staff parking,  we have to pay $650 for the crummy student parking 2km away.",
              "author": "r3allybadusername",
              "created": 1571501315,
              "upvotes": 2,
              "replies": {}
            },
            "f4aa9yb": {
              "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4aa9yb/",
              "text": "It's different in the US. Must be due to the fact that in a department we have several graduate students. There are places where no one bats an eye when a graduate student uses the staff kitchen but it usually comes down to the administrator, whether they are cool or not.",
              "author": "mcn63",
              "created": 1571491298,
              "upvotes": 1,
              "replies": {}
            },
            "f4b63of": {
              "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4b63of/",
              "text": "I'm in the US and there's only a distinction because the grad offices are on a different floor. Technically anyone can use anything. It was all just one kitchenette at my last institution.",
              "author": "mediocre-spice",
              "created": 1571507385,
              "upvotes": 1,
              "replies": {}
            },
            "f4c105e": {
              "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4c105e/",
              "text": "Same. In my (US) department, PhD students get access to the same coffee and kitchen facilities as faculty, which includes a coffee/espresso machine and a hot water machine with free teabags and ground coffee. There’s even a wide selection of herbal teas for those hungover Sunday mornings ;P\n\nWe’re the top-ranked program in our (STEM) field though, so we may just have a disproportionate amount of funding, which admins (wisely) decide to spend on caffeination.\n\nAnd ofc, people being people, we still find ways to complain about it. :)",
              "author": "occidental_ocelot",
              "created": 1571521844,
              "upvotes": 1,
              "replies": {
                "f5r1ht5": {
                  "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f5r1ht5/",
                  "text": "Agreed. Depends on how well funded your program / university/ department is doing. Visiting a friend attending Harvard Law back in the 80’s, they had a simple “standard” coffee bar (basics; pre-STBX) which was sponsored by the ALUMNI. \n\nSo THERE’S a cool idea to suggest to grad schools!!!\n\n\nBTW, at my not-famous grad school in the Middle of Nowhere we were also treated as children like the OP even though some of us were past 40 and were back at school for our “second career” field as it were. Just maddening.\n\nCan’t wait til the College Financial Bubble has a meltdown. Mark my words— they will be BEGGING for grad students when they all have to get real jobs in the economy! \n\nCiao.",
                  "author": "catsleepsallday",
                  "created": 1572386542,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f49kifq": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49kifq/",
      "text": "I am the admin for a university history department and we have coffee for all students. I stock oatmeal, pop tarts, and popcorn as well as a lot of flavors of tea. I know that some of our grad students rely on the coffee and snacks. Often I bring in fresh fruit and baked goods too. It's the little things that make a difference. \nGood luck with your studies!",
      "author": "JDKMevans",
      "created": 1571470936,
      "upvotes": 93,
      "replies": {
        "f4a2d13": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4a2d13/",
          "text": "I think you're probably a lot of people's favorite admin.",
          "author": "beer_kimono",
          "created": 1571487945,
          "upvotes": 27,
          "replies": {}
        },
        "f4aad9l": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4aad9l/",
          "text": "Speaking as a grad student, you are an angel. I’m sure they all very much appreciate what you do!",
          "author": null,
          "created": 1571491332,
          "upvotes": 12,
          "replies": {}
        },
        "f49mg9a": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49mg9a/",
          "text": "I love that idea, but who is funding it? I don’t mind baking from time to time, but it adds up really quickly if it’s for all students, all the time. At my uni, we served basic coffee and tea, but that was it (and just for staff and PhD).",
          "author": "balletowoman",
          "created": 1571473858,
          "upvotes": 19,
          "replies": {}
        },
        "f4aunzx": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4aunzx/",
          "text": "Please take a job in my dept!",
          "author": "johnnydaggers",
          "created": 1571501792,
          "upvotes": 6,
          "replies": {}
        },
        "f49x0h0": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49x0h0/",
          "text": "God bless people like you",
          "author": "RNARNARNA",
          "created": 1571485458,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "f49ishr": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49ishr/",
      "text": "My PhD ~~institution~~ department had coffee for faculty, staff, and grad students. It wasn’t great coffee, but it was free. I only say this because you’re totally right, it was a really great perk and saved me a good deal of money. \n\nAt my masters institution the students a few years ahead of me bought a coffee maker for the shared office corridor.  Whenever we got a cup of coffee we would pay a quarter to the coffee jar and we’d use that money to buy more coffee. If you were the one to empty the pot you had to make a new pot or rinse it out and shut it off.  Maybe you can self organize in this way with some peers.",
      "author": "TourmalineTart",
      "created": 1571468375,
      "upvotes": 37,
      "replies": {}
    },
    "f49mt9v": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49mt9v/",
      "text": "Are grad students not treated like staff? In the UK PhD students and to some extent Masters students have most of the perks staff do.",
      "author": "Papaslice",
      "created": 1571474428,
      "upvotes": 41,
      "replies": {
        "f49p6lp": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49p6lp/",
          "text": "Same in most universities in Belgium. Professors usually have their own office. PhD students have shared offices. The amenities are often shared with students,  you will especially see master students running around the faculty area coming from meetings with their professors or symposiums.",
          "author": "Instantcoffees",
          "created": 1571478119,
          "upvotes": 11,
          "replies": {}
        },
        "f4avglm": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4avglm/",
          "text": "At my US university, we are treated like staff: NO ONE gets free coffee!\n\nBut I sure have the right to pay for an overpriced faculty parking permit if I really want to.",
          "author": "intangiblemango",
          "created": 1571502202,
          "upvotes": 10,
          "replies": {}
        },
        "f4abe0h": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4abe0h/",
          "text": "It’s definitely institution-dependent. I’ve always had access to coffee, though it’s not always the best quality",
          "author": "Rizzpooch",
          "created": 1571491826,
          "upvotes": 7,
          "replies": {}
        },
        "f4ah9re": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4ah9re/",
          "text": "I'm at a US University (albeit, in a business school, so there's more $$), and we are treated the same as staff. We get coffee and access to any faculty happy hours.",
          "author": "oooomgg",
          "created": 1571495198,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "f49pnx8": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49pnx8/",
      "text": "I guess I’ve mostly been at large public institutions, but  I’m truly amazed that so many places have free coffee! And some of you get snacks? I was was expecting a lot of “buy a coffee maker” comments or supportive chuckling about how don’t we all wish we could have free coffee. I had no idea what I was missing out on!",
      "author": "neuropainter",
      "created": 1571478875,
      "upvotes": 13,
      "replies": {}
    },
    "f49wcgo": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49wcgo/",
      "text": "No, all universities should pay their grad students an appropriate stipend, as part of a fixed contract, with which they can buy coffee or other essentials as they see fit.\n\nAny workplace that incentivises with off-contract 'perks' is a workplace that will remove those perks in a heartbeat when the cost/benefit changes with the wind.",
      "author": "Hasefet",
      "created": 1571485117,
      "upvotes": 28,
      "replies": {
        "f4bh7b1": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bh7b1/",
          "text": "this is the real answer",
          "author": "synesfreesia",
          "created": 1571512467,
          "upvotes": 4,
          "replies": {}
        },
        "f4c3klc": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4c3klc/",
          "text": "Why not both? Yours is the absolute fair point. Grad \"students\" are workers who deserve to be paid appropriately for their labor, which should allow them to pay for their own coffee. But universities are more than just workplaces; they are also hubs of collaboration such that gestures such as \"free coffee\" can go a long way toward inviting collaboration to actually happen rather than only occurring as the result of a contractual requirement.\n\nEDIT: I'd also like people to consider that, in fact, *workplaces* themselves are more than \"just\" workplaces. They're also where people socialize, make friends, find meaning. Any place that doesn't pay fairly isn't worth staying at for long; any place that doesn't make itself more than a mere workplace isn't worth staying at for long, either.",
          "author": "academc",
          "created": 1571523031,
          "upvotes": 4,
          "replies": {}
        },
        "f4bmjy3": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bmjy3/",
          "text": "How about they pay them an actual, decent salary, and treat them like staff? Because mine does, and it's great that way.",
          "author": "simoncolumbus",
          "created": 1571514947,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f49sdsx": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49sdsx/",
      "text": "Our lab always had a coffee machine everyone can use and different arrangements on who bought the coffee.  \n\nWhen I joined the lab, there was an old, very simple machine from a former PhD student, who didn't need it any longer. It was once of those machines where you brew a can full of coffee in advance, so they also needed to coordinate a bit. The coffee drinkers took turns in buying the bags of coffee (and occasional cleaning), otherwise it was \"free\" for them. Guests got coffee for free. They also tried to balance things out so that the more frequent drinkers bought coffee more often.  \n\nA while ago our PI bought a more expensive machine for the lab, that brews individual cups with dozens of settings, where everyone now pays per cup and one person takes that money to buy the next bag of coffee beans. It's something like 10 cents (€) per normal cup, so still dirt cheap. If you have a guest over, you'll usually pay for his/her cup. They occasionally recalculate it, just looking how much the last bag costed and how many cups were consumed (which is why it's important to also register cups that guests consumed). You can pay in advance, so just give 5€ - 10€ to the person in charge and drink until your deposit is depleted. Since cleaning is a bit more complicated now they have a list who has \"cleaning duty\". Silly thing needs cleaning three times a week but somehow it works. Sometimes people forget one cleaning but usually the others will remind them on the next day.",
      "author": "LittlePrimate",
      "created": 1571482335,
      "upvotes": 8,
      "replies": {}
    },
    "f49k005": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49k005/",
      "text": "You should save up some money for a coffee maker or share the costs with other students and place the coffee maker in a common room. Starbucks is overpriced and you can hardly call it coffee.",
      "author": "frugalacademic",
      "created": 1571470170,
      "upvotes": 10,
      "replies": {}
    },
    "f49jfze": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49jfze/",
      "text": "My PhD institution does not even provide us with a computer (doing a PhD in ICT), let alone coffee....",
      "author": "OutplayOutlast",
      "created": 1571469339,
      "upvotes": 6,
      "replies": {}
    },
    "f49jyr0": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49jyr0/",
      "text": "You'll save money pretty fast if you switch to tea, and you can get a cheap electric kettle or just use the hot valve on some water coolers.",
      "author": "kyew",
      "created": 1571470119,
      "upvotes": 8,
      "replies": {
        "f4b8zgd": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4b8zgd/",
          "text": "\"Just drink something you dont like because its cheaper\"",
          "author": "hobbes32t",
          "created": 1571508693,
          "upvotes": 5,
          "replies": {
            "f4bg1ws": {
              "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bg1ws/",
              "text": "If OP's \"relying on it for survival\" it's a caffeine delivery mechanism, not a treat.\n\nBut I like coffee *and* tea.",
              "author": "kyew",
              "created": 1571511933,
              "upvotes": 4,
              "replies": {
                "f4bhh9u": {
                  "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bhh9u/",
                  "text": "I've nothing against tea drinkers, but you can make your own coffee for just as cheap. The issue here is wasting money at starbucks, not beverage preference",
                  "author": "hobbes32t",
                  "created": 1571512599,
                  "upvotes": 5,
                  "replies": {
                    "f4bj5cp": {
                      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bj5cp/",
                      "text": "Fair. I was thinking more along the lines of instant coffee being garbage and tea not requiring any extra hardware if you've already got access to hot water.",
                      "author": "kyew",
                      "created": 1571513350,
                      "upvotes": 3,
                      "replies": {
                        "f4bjbj9": {
                          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bjbj9/",
                          "text": "Fair enough, that's a valid point",
                          "author": "hobbes32t",
                          "created": 1571513432,
                          "upvotes": 2,
                          "replies": {
                            "f4bmjxn": {
                              "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bmjxn/",
                              "text": "Hey, we can't come to an understanding! This is the internet!",
                              "author": "kyew",
                              "created": 1571514947,
                              "upvotes": 3,
                              "replies": {
                                "f4bql5o": {
                                  "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bql5o/",
                                  "text": "Then I suppose its trial by combat",
                                  "author": "hobbes32t",
                                  "created": 1571516857,
                                  "upvotes": 3,
                                  "replies": {
                                    "f4bqxyg": {
                                      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bqxyg/",
                                      "text": "Choose your weapon. I'll take scalding water, with a hint of lemon.",
                                      "author": "kyew",
                                      "created": 1571517028,
                                      "upvotes": 3,
                                      "replies": {
                                        "f4bs21u": {
                                          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bs21u/",
                                          "text": "I choose coffee grounds, with which to blind you.",
                                          "author": "hobbes32t",
                                          "created": 1571517553,
                                          "upvotes": 3,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f49hwwk": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49hwwk/",
      "text": "Save up your Starbucks money for a couple weeks and you can buy a cheap coffeemaker. I've never worked at a university that provided coffee for anyone. I used to work corporate. I do miss those perks.",
      "author": "baileybird",
      "created": 1571467129,
      "upvotes": 7,
      "replies": {}
    },
    "f49il0m": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49il0m/",
      "text": "We have it at my uni... that sucks for you. I am sorry but aren’t you staff as a grad student?",
      "author": "pompomandben",
      "created": 1571468075,
      "upvotes": 5,
      "replies": {}
    },
    "f49k94r": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49k94r/",
      "text": "My internship institute had a free coffee hour for everyone in the afternoon. That helped to bring people together and everyone could grab free coffee while they discussed or go back to their rooms. I miss those coffee hours.",
      "author": "Fisicaphile",
      "created": 1571470553,
      "upvotes": 3,
      "replies": {}
    },
    "f49my1q": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49my1q/",
      "text": "We had great free coffee from quite a fancy machine! I remember googling the coffee bean brand (which the institute bought in bulk each month) and seeing how expensive it was so I think we must have been lucky! Doesn’t seem a common thing but it should be haha.",
      "author": "Dr_L_S_D",
      "created": 1571474637,
      "upvotes": 3,
      "replies": {}
    },
    "f49xbgk": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49xbgk/",
      "text": "Our department (UK) has free coffee (instant) and free tea. Years ago a load of us clubbed together £5 each and bought a nespresso machine for the common room - but we bring our own pods.  Then someone else brought in an old coffee machine which grinds beans - people who want to use it pay £5 a month into a \"coffee club\" to pay for more coffee beans. \nThese are shared between staff and grad students.\nCoffee is life but I'm not paid enough to be getting Starbucks every day.. that shit is expensive!",
      "author": "motley_cran",
      "created": 1571485636,
      "upvotes": 3,
      "replies": {}
    },
    "f4a50mr": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4a50mr/",
      "text": "The department pays for the coffee and teas. Most seem to like having snacks and good caffeine. We keep canned sparkling water too (avoiding plastic). I pay for some too, especially the food. I hate the idea of students struggling to find something to eat and I know our students and faculty think better if they have coffee and snacks. Hunger makes studying difficult. Plus we often have visitors to the department and we want to be able to offer them a drink at least. \nI keep a huge candy jar full of the good candy in my office. I love having  people stop by to say hi and grab a handful of chocolate.",
      "author": "JDKMevans",
      "created": 1571489050,
      "upvotes": 3,
      "replies": {}
    },
    "f4a660e": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4a660e/",
      "text": "Interesting. I have never even heard of a department providing free coffee for faculty, staff or grad students! I have always brought coffee from home in a thermos. When I was a grad student and at one of my faculty positions, there was a coffee pool of people who put their money together for a common pot, but I never joined those pools.",
      "author": "me_again_co",
      "created": 1571489502,
      "upvotes": 3,
      "replies": {}
    },
    "f4at3lw": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4at3lw/",
      "text": "You don't have a dept. lounge with coffee?\n\nI'm at a tiny program but we have a coffee machine at least.\n\nYou know a crappy no frills coffee machine is like 20 bucks right? \n\nJust go in with a few other grad students  to get a basic coffee machine at target.",
      "author": "Jack-ums",
      "created": 1571500949,
      "upvotes": 3,
      "replies": {}
    },
    "f4ayui8": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4ayui8/",
      "text": "I'd settle for a living wage tbh",
      "author": "NonbinaryBootyBuildr",
      "created": 1571503814,
      "upvotes": 3,
      "replies": {}
    },
    "f4b1kai": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4b1kai/",
      "text": "My advisor kept a coffee machine outside his office and used that to woo me to his group. You should see if your advisor will do the same ;)",
      "author": "wazoheat",
      "created": 1571505161,
      "upvotes": 3,
      "replies": {}
    },
    "f49n5v7": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49n5v7/",
      "text": "To be fair my institution offers different kinds of coffee, tea and hot chocolate for grad students and other staff.\n\nThere are often snacks around as well (fruit, cookies, cakes, etc.).",
      "author": "BlinkPT",
      "created": 1571474976,
      "upvotes": 2,
      "replies": {}
    },
    "f49pgjz": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49pgjz/",
      "text": "We have free coffee for grad students. It has saved countless lifes.",
      "author": "jaaval",
      "created": 1571478555,
      "upvotes": 2,
      "replies": {}
    },
    "f49poi9": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49poi9/",
      "text": "Our coffee docks are free for everyone - yes, it's just instant coffee, tea bags and milk, you have to have your own mug, but still... Cleanling crew, master/PhD students, professors- all staff and visitors can use it.",
      "author": "Why_So_Slow",
      "created": 1571478900,
      "upvotes": 2,
      "replies": {}
    },
    "f49sska": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49sska/",
      "text": "Our department used to have an old cafe very cheap filter coffee (something around 50p), which was a lifesaver as an undergraduate. \n\nThat's now been closed and we have a flash barista-style cafe where the cheapest coffee is an americano at about 3 times the price. I do resent universities treating the students like a cash cow.",
      "author": "DhatKidM",
      "created": 1571482750,
      "upvotes": 2,
      "replies": {}
    },
    "f49yrjd": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49yrjd/",
      "text": "My department has a coffee maker, and it’s for grad students and faculty. The only people not allowed to have it are the undergrads. There used to be a change bucket for people to chip in, but now it’s a department cost, so no one has to pay",
      "author": null,
      "created": 1571486268,
      "upvotes": 2,
      "replies": {}
    },
    "f4a55ep": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4a55ep/",
      "text": "Thanks. I feel like the department Mom and I like that.",
      "author": "JDKMevans",
      "created": 1571489110,
      "upvotes": 2,
      "replies": {}
    },
    "f4a7hrn": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4a7hrn/",
      "text": "That sucks! My department lets the grad students use the coffee machines and fridges in both departmental offices.",
      "author": "Jimlish",
      "created": 1571490055,
      "upvotes": 2,
      "replies": {}
    },
    "f4aoqx3": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4aoqx3/",
      "text": "Stating the obvious, but there is no such thing as free coffee. They can provide it to you every day with no charge at that time, but either tuition will rise or your stipend will go down.",
      "author": "beaubaez",
      "created": 1571498620,
      "upvotes": 2,
      "replies": {}
    },
    "f4cz3wg": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4cz3wg/",
      "text": "In my program we have a kitchen with a coffeemaker, and in my previous grad program at a different institution, we had an office with a mini-fridge and a handful of appliances. Both in the US. Now I’m super curious about where you went that treats their grad students like children!",
      "author": "Weaselpanties",
      "created": 1571535845,
      "upvotes": 2,
      "replies": {}
    },
    "f4d460t": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4d460t/",
      "text": "Damn. I could get free coffee in at least 3 different places on campus... your university needs to step it up for grad students!",
      "author": "mirabelle7",
      "created": 1571537816,
      "upvotes": 2,
      "replies": {}
    },
    "f49zc7v": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49zc7v/",
      "text": "You buy starbucks every day!?\nPro tip star bucks give out free hot water. I bring a small pot of instant coffee and a reusable cup, get free hot water and make my own coffee or tea. I mean don’t do this if you’re going to be sitting in Starbucks because that’s rude af but nothing wrong with doing this. Alternatively if you have access to a microwave or kettle just use that?\nHonestly I’m surprised you’re not treated as staff anyway",
      "author": "galacticdick",
      "created": 1571486536,
      "upvotes": 4,
      "replies": {
        "f4n8hxo": {
          "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4n8hxo/",
          "text": "I do a combination of getting coffee in a thermos (stays edible for about 4 hours), keeping instant coffee pouches in my office and allowing myself a $20 Starbucks budget monthly. I have considered keeping a small coffee machine too, but keeping 2 sets of coffee machines and everything else (I dislike black coffee)- at home and at lab - seems too much. \nBut my gripe with the system is that when facilities exist in the same area, why not let grad students use it. \n(Not a big deal tbh, Reddit is just a good place to give sometimes mild grievances a voice)",
          "author": "Gee_Es10",
          "created": 1571686853,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f4a7147": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4a7147/",
      "text": "Coffee is so incredibly cheap to make and there is a coffee brewing approach for any situation no matter how limited the space, time, or access to electricity.\n\nPerhaps, instead of offering free coffee to grad students, a quick 15 minutes seminar discussing how it's ridiculous to complain about being underpaid while spending $3+ for a cup of coffee at Starbucks should be mandatory in the first semester.\n\nBut, I'm cynical.",
      "author": null,
      "created": 1571489849,
      "upvotes": 3,
      "replies": {}
    },
    "f49pjh6": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49pjh6/",
      "text": "Change grad schools.",
      "author": "ostuberoes",
      "created": 1571478678,
      "upvotes": 2,
      "replies": {}
    },
    "f49q2yf": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49q2yf/",
      "text": "Like a lot of other commenters, my institute provides coffee machine for free coffee (regular, lattes, espresso, and all type), chocolate, and various flavor of tea for everyone, plus there are multiple machines in every floor. For my masters I didn't have this perks in the other institute so I am very grateful for this. \nMy lab also have what a corner in a hallway where we have a cookie jar and where lab members frequently leave cakes, chocolates or fruits. Noone regulates who brings what when but people just bring what leftover they have from home and it works great.",
      "author": "d_effervescent",
      "created": 1571479515,
      "upvotes": 1,
      "replies": {}
    },
    "f49trti": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49trti/",
      "text": "Get a cafetiere. Coffee grounds last weeks for the price of one takeaway coffee",
      "author": "Popeychops",
      "created": 1571483648,
      "upvotes": 1,
      "replies": {}
    },
    "f49x4si": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f49x4si/",
      "text": "Damn thag sucks dude. It is in our university. Grad lounge is regularly stocked with coffee though people still prefer the occasional Starbucks.\n\nMy biggest gripe is the lack of decent Tea out here in the states, but not the cost of these things.",
      "author": "boringhistoryfan",
      "created": 1571485521,
      "upvotes": 1,
      "replies": {}
    },
    "f4a42wa": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4a42wa/",
      "text": "Preach",
      "author": "Johndope2402",
      "created": 1571488656,
      "upvotes": 1,
      "replies": {}
    },
    "f4a56yd": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4a56yd/",
      "text": "Thanks.",
      "author": "JDKMevans",
      "created": 1571489129,
      "upvotes": 1,
      "replies": {}
    },
    "f4aclov": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4aclov/",
      "text": "Gawd. I'm currently a PhD student. We get pretty much the same benefits as undergrads. ie. None.",
      "author": "osmotar",
      "created": 1571492437,
      "upvotes": 1,
      "replies": {}
    },
    "f4amsc4": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4amsc4/",
      "text": "When I was in grad school (English), the office for the comp program always kept a pot of coffee brewing that was available to all grad students and adjuncts. It was partially funded by the program itself; we couldn't buy coffee for something like that according to university guidelines, but we *could* overbuy coffee for events and then use the leftovers for the pot. Once that ran out, we used what grads pitched in; I would periodically buy a thing of Stop and Shop coffee myself to make up for all that I used.\n\nA couple profs used it, and they tended to make generous donation to the fund.",
      "author": "BewareTheSphere",
      "created": 1571497711,
      "upvotes": 1,
      "replies": {}
    },
    "f4ar0fx": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4ar0fx/",
      "text": "Wander around an admin building. You can't shake a stick and not hit a Keurig. Just turn up the provost and shake and the k cups will fall out",
      "author": "cdb3492",
      "created": 1571499775,
      "upvotes": 1,
      "replies": {}
    },
    "f4as5sg": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4as5sg/",
      "text": "My university has that, the only downside is there's none on the weekends. My undergrad didn't have that but it wasn't a matter of being treated like full staff/faculty, they didn't have it for them either. From my narrow perspective of talking to a few people from Europe, free coffee seems to be more of a thing there.",
      "author": "mafematiks",
      "created": 1571500444,
      "upvotes": 1,
      "replies": {}
    },
    "f4b2koo": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4b2koo/",
      "text": "Buy a cheap coffee maker and make it at your desk?",
      "author": "adriennehere",
      "created": 1571505671,
      "upvotes": 1,
      "replies": {}
    },
    "f4b9yc5": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4b9yc5/",
      "text": "My school gives out free coffee in the student lounge and the lobby daily, and occasionally free Coke/Diet Coke/Sprite after events. Teachers and students use it.",
      "author": "comped",
      "created": 1571509142,
      "upvotes": 1,
      "replies": {}
    },
    "f4bhyzl": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bhyzl/",
      "text": "I'm going to grad school in the US and I must say I've been very lucky to have access to free coffee, tea as well as hot chocolate and sometimes snacks.\n\nBig shout out to WPI's robotics department admin staff who keep it stocked at all times.",
      "author": "OneArcher7",
      "created": 1571512823,
      "upvotes": 1,
      "replies": {}
    },
    "f4bjgq8": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bjgq8/",
      "text": "In my institute graduate students have way more access to free food and drinks (inc. coffee) than actual staff. There are events for students, seminars, student groups, alumni events, etc. the list goes on and on. if you really wanted to live a life without buying food or coffee you honestly could at my school.\n\ngraduate students are students. students get way more free stuff than staff do. maybe you're looking at it the wrong way. try and find the stuff for undergrads, you most likely have access to that. \n\nalso, ask forgiveness. if there's a building/staff room that has free coffee, most likely no one will care if you take from it. no one working in the building pays for it themselves, so they probably won't care...",
      "author": null,
      "created": 1571513503,
      "upvotes": 1,
      "replies": {}
    },
    "f4bt100": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4bt100/",
      "text": "My program doesn't provide us with anything. When I was working directly under one faculty member whose office was part of a sub-department there was a coffee machine and fridge for anyone in that office to use. As for the main department where most faculty offices are there is nothing. If faculty want coffee or a fridge they have their own in their in their individual offices. We don't even have an office to congregate in as doctoral students. We don't have personal computers or space to meet with students or store any belongings. We have to do that in the general common areas like the library or student center. Unfortunately, the school has a serious space issue and is often full with undergrads all the time during the academic year. \n\nWhen entering the program we are entirely treated as students but as we move past the exam stage we move toward being treated as both staff and student because we teach classes. Around the faculty that taught us during our first and second year classes though we primarily still feel like students. Administratively, we are both - sort of. We are considered full or part time students dependent on registration status and we are treated as temp/part-time /contracted employees - no different than an adjunct so we are not entitled to any benefits (healthcare etc.)",
      "author": "FolkMetalWarrior",
      "created": 1571518020,
      "upvotes": 1,
      "replies": {}
    },
    "f4c08hc": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4c08hc/",
      "text": "We had a real Italian espresso maker provided by the department. Like one of the big ones you see in a coffee shop :D",
      "author": "ICanRememberUsername",
      "created": 1571521482,
      "upvotes": 1,
      "replies": {}
    },
    "f4c7b22": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4c7b22/",
      "text": "LPT: Brew coffee in the morning, take it to work in a thermos. I've been doing that since undergrad (TT professor now).",
      "author": "newpua_bie",
      "created": 1571525212,
      "upvotes": 1,
      "replies": {}
    },
    "f4c7drj": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4c7drj/",
      "text": "The university I attended had free tea and coffee. They charged a small fee for cups.",
      "author": "TenderfootGungi",
      "created": 1571525255,
      "upvotes": 1,
      "replies": {}
    },
    "f4cfs90": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4cfs90/",
      "text": "My university (Public, R1) doesn't even provide for faculty, much less grad students. They do give us grad students uhm...no much.",
      "author": "hillsonn",
      "created": 1571528507,
      "upvotes": 1,
      "replies": {}
    },
    "f4chak3": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4chak3/",
      "text": "My research group has a budget for buying coffee, tea, milk and other non-alcoholic drinks - and usually it's even too much for that (as we try to buy from the cheapest possible source), so we also buy some cookies and snacks. So does every other research group at my institute in Israel. And every department at a much poorer institute in Europe, where I did research before. So, all paid by the institute, though we have to buy or order it ourselves and then get the money back from the institute.\n\nMaybe it's something your student council can fight for? At least an electric kettle / small hot water machine and cheap instant coffee shouldn't be a big expense for a department.",
      "author": "AstraGlacialia",
      "created": 1571529084,
      "upvotes": 1,
      "replies": {}
    },
    "f4cq1ui": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4cq1ui/",
      "text": "Coffee isn't that expensive. My department-- which has no grad students --has pots of regular and decaf on all the time and our undergraduates drink a fair bit of it. Nobody complaints a bit.",
      "author": "SnowblindAlbino",
      "created": 1571532413,
      "upvotes": 1,
      "replies": {}
    },
    "f4crvdh": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4crvdh/",
      "text": "My department has a coffee machine and coffee that anyone (even undergrads) can use for $1/day. They just ask that if you take the last of the pot, you start a new one.",
      "author": "diskprept",
      "created": 1571533082,
      "upvotes": 1,
      "replies": {}
    },
    "f4e34vm": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4e34vm/",
      "text": "So here's the thing. Maybe the situation came across as more dreary than it is. We do have access to a small kitchenette with a fridge and microwave for every floor of the building I'm in. Some of these kitchenettes also have coffee machines out in the open, which clearly belong to some student or other labs (with more generous PIs I suppose).\n\nBut would you use someone's equipment just because it's kept there and you can get your own coffee beans or something, or is it better to have an institute- or building-wide practice, recognizing that small perks like these will not hurt grad students or the institute's discretionary budget in the long run? This is coming from a pretty well funded STEM school with enough funds to build new buildings all over campus. (And yes, I recognize the need for that too)\nI have also tried the instant coffee route, but how does that compare to even a cheap pot of freshly made coffee,especially when the facility exists just a few doors down?",
      "author": "Gee_Es10",
      "created": 1571551400,
      "upvotes": 1,
      "replies": {}
    },
    "f4csys3": {
      "link": "/r/AskAcademia/comments/djzo73/universities_should_make_free_coffee_a_thing_for/f4csys3/",
      "text": "I would eat dirt for the opportunity for a graduate degree and you people whine and cry about how poor you are. Unbelievable.",
      "author": "mrythern",
      "created": 1571533480,
      "upvotes": -2,
      "replies": {}
    }
  }
}