{
  "sid": "gs1po3",
  "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/",
  "title:": "Sexual Misconduct help me please",
  "text": "I’m a graduate researcher focusing on my Masters in a special Pharmacy concentration. I’m working on a huge breakthrough with COVID-19 research and just helped earn a ridiculous grant for my research team. I am in a position where the future of my career may be determined by my next actions. I don’t know if this is the right place to post this but I feel like everything I have been working for over the past year is about to fall apart. Please direct me to the appropriate place if this is wrong. \n\nI was visiting one of the Dr’s that’s part of my research team with another colleague of mine. Discussing future moves over dinner and drinks. The colleague left and i was asked to stay to go over a few more details. I was prevented from leaving physically and repeatedly touched without my consent despite saying no and moving away from him. I’m afraid to report this incident because my career in research could be over. I need this opportunity. But I don’t think I can face him in the lab again. He’s my superior and my future working on this project and any credit that may be mine may not be used. What do I do? What would you do? Please help me decide what to do next.\n\nEdit:\n\nThank you guys all so much. I’m so overwhelmed by your support and just utterly thankful for everyone who commented below and messaged me. I’m going to continue to respond to the comments and chew on this information for a few more days. \n\nIn the midst of the quarantine’s chaos, I’m awaiting on a return phone call from the Victim’s Advocacy center through an anonymous contact. I’m going to try to get in writing a confirmation that any information I share with them will not be shared with anyone else without my consent, and confirmation that they are not held by the same Title IX regulations as University payroll staff are. \n\nThat being said, I have blocked communication for now with the PI and informed my colleague who has been really supportive. He has decided cut ties with the professor and informed me of some disturbing signs throughout that night that I missed. I am so lucky, and just so fortunate things had not been worse but now that I understand how common this actually is, I’m going to do my best to find ways to be supportive to other students who experience these occurrences. \n\nI’m sorry if I haven’t responded to everyone yet, these thoughts have been eating away at my entire day. I’m in tears writing this, thank you all so much, again, for your advice and support. \n\nI don’t know if another update is necessary but I can if anyone is interested when I hear back from the VA center.",
  "author": "AcademMisconTA",
  "created": 1590651297,
  "updated": 1634080186,
  "over_18": false,
  "upvotes": 297,
  "upvote_ratio": 0.97,
  "comments": {
    "fs2g6kq": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2g6kq/",
      "text": "Is there an office that you can deal speak confidentially that can guide you? I had to deal with sexual harassment during my PhD and was guided by a couple of people. my first objective was to get through my PhD and then my second was to file a warning and start the process. I remember speaking to a student union welfare rep and a sexual harassment specialist. I was referred to the SU rep by HR. First port of call is to speak to specialists at your institution who can confidentially advise you. I will leave it here for now and please do ask if my experiences can help.\n\nEdited to add: Part of it is that you need to decide what outcome you want. Right now may not be the right time. Also, anyone you can trust within the research group? My experience was a few years ago and hate seeing others go through things like this. Stay strong.",
      "author": "the_makalele_roll",
      "created": 1590652305,
      "upvotes": 140,
      "replies": {
        "fs2p3qw": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2p3qw/",
          "text": "I’ve had an experience going to my (top) university’s “confidential” ombudsman to talk things over because a harasser coworker was making life impossible for me and trying to denigrate my work/ get me fired. I just needed help approaching this issue with my boss, and didn’t complain about the sexual harassment part at all, because I was young a stoic and didn’t want my career to be “over”. The next day my PI who had no knowledge of the issue, at least from me, apologized profusely and told me I don’t have to work with the guy anymore. Everyone did a good job keeping him away from me after that. I’ve been wondering ever since if the confidential ombudsman is there for you or for the university to not get sued. Did they discuss everything with my boss without my consent? Just something to keep in mind- I’ll never be able to prove anything and in my situation it worked out for the best for me, but I wouldn’t trust anyone working for the university. You should talk to someone though, maybe an undergrad mentor, someone you’re close with and can ask for advice but is not on university payroll.\n\nEdit: because it’s very early and I can’t seem to make sense- I mean definitely talk to someone, you shouldn’t be ashamed to, you did nothing wrong. But try to talk to someone you trust because any of the resources at the university might be there to protect him/them not you. And definitely get proof, like everyone else said. Also I know my story is anecdotal, but I’ve heard firsthand from 2 other friends who filed complaints against their harassers- one filed a title IX and the department forwarded all of her emails to the harasser. A second was pressured and gasslit by the student adviser not to say anything because it would ruin the harasser’s career. I’ve seen enough to know that these kinds of things you strategize and discuss with people you trust- preferably at a different institution and with no skin in the game- and you only tell the university once you’ve gotten an attack plan together.",
          "author": "chokokhan",
          "created": 1590660944,
          "upvotes": 59,
          "replies": {
            "fs2xte1": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2xte1/",
              "text": "If you're in the US, the ombudsman likely was a \"mandatory reporter\" that was required to file a Title IX case by university policy. Once a claim is filed, the university Title IX office is required to investigate it and to take interim mitigation actions, including looping in people in 'managerial' type roles so as to limit contact between the two parties as the claim is under investigation.\n\nAssuming OP is in the US, just about anyone at the University they might talk to would be a mandated reporter on this issue, so OP should keep that in mind when deciding on next steps.",
              "author": "Has-Died-of-Cholera",
              "created": 1590668008,
              "upvotes": 59,
              "replies": {
                "fs37io0": {
                  "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs37io0/",
                  "text": "Well, I was young and stupid and this was 10 years ago, but I believed them when they made a fuss about how nothing will be disclosed unless I choose to, I’m in a safe space, it’s my decision, etc. It would have been decent and useful of them to let me know they’re a mandatory reporter. My PI was great, but I’ve worked for people who would have fired me/made my life miserable after that and a heads up would have been nice.\n\nBut yeah, that’s specifically why I posted. They rope you in with confidential and you’re safe here but that was not my experience.",
                  "author": "chokokhan",
                  "created": 1590674007,
                  "upvotes": 19,
                  "replies": {
                    "fs4k8a8": {
                      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs4k8a8/",
                      "text": "That's extremely messed up, I've worked several jobs where I was a mandated reporter and throughout multiple trainings over the years they all stated I couldn't promise to keep anything within those guidelines confidential.",
                      "author": "lumixter",
                      "created": 1590697319,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                },
                "fs3swuv": {
                  "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs3swuv/",
                  "text": "Yes exactly. Title IX mandatory reporting.",
                  "author": "chlorinesmellsgood",
                  "created": 1590684447,
                  "upvotes": 7,
                  "replies": {
                    "fs50xjf": {
                      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs50xjf/",
                      "text": "Doesn’t this make it functionally impossible to anonymously report something?",
                      "author": null,
                      "created": 1590705629,
                      "upvotes": 4,
                      "replies": {
                        "fs526bd": {
                          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs526bd/",
                          "text": "Many universities will have select people on campus who can take a report of sexual misconduct anonymously. Typically these include a university's counseling center, a confidential victim advocate, and (if present) a clergyperson.\n\nIdeally, a person such as an ombud will specify what they can and cannot keep confidential before you meet.\n\nYou can search your campus's website for confidential reporting options that are Title IX exempt. You can also ask someone in terms of hypotheticals: \"hypothetically, suppose I were helping someone to report a sexual assault--what are the confidential reporting options on this campus?\" Mandated reporters are not (supposed to) be investigators; as long as you do not indicate that sexual misconduct occurred, the person should not be mandated to report.",
                          "author": "jogam",
                          "created": 1590706282,
                          "upvotes": 3,
                          "replies": {
                            "fs5h4f0": {
                              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs5h4f0/",
                              "text": "There is a victim advocacy center but they are not in the office and none of my administrators know when they will be back. I don’t necessary like the idea of leaving my contact information, I’d prefer to ask questions anonymously about the steps the agency would take, in addition to the consequences of reporting the incidence.",
                              "author": "AcademMisconTA",
                              "created": 1590714553,
                              "upvotes": 1,
                              "replies": {
                                "fs5v9a5": {
                                  "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs5v9a5/",
                                  "text": "If the victim advocate office is one you'd like to connect with, do they have an email address listed? I imagine someone is checking that even if they're not physically in the office.\n\nIf it would make you feel more comfortable, one option would be to create a burner email that is not connected with your name, identify yourself as a student of the university, and ask your questions anonymously.",
                                  "author": "jogam",
                                  "created": 1590722839,
                                  "upvotes": 3,
                                  "replies": {
                                    "fs6iwwz": {
                                      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6iwwz/",
                                      "text": "I took this advice and did just that. I’m awaiting the reply now. Thank you for this suggestion <3",
                                      "author": "AcademMisconTA",
                                      "created": 1590740741,
                                      "upvotes": 3,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "fs74h5w": {
                          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs74h5w/",
                          "text": "Faculty certainly has this [concern](https://www.insidehighered.com/news/2015/02/04/faculty-members-object-new-policies-making-all-professors-mandatory-reporters-sexual).  But here’s your dilemma and I personally have had to make this choice. If you want it fixed, you can’t remain anonymous. If the system you’re in has earned your trust, proceed with the complaint. If the system isn’t trustworthy, you choose: being a whistleblower or professional promotion. Seek counseling from someone whose ONLY duty of loyalty is to YOU. \n\nImagine hearing this type of complaint, keeping the secret, then another person becomes a victim. That’s why there’s mandatory reporting.",
                          "author": "chlorinesmellsgood",
                          "created": 1590758680,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fs2y678": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2y678/",
              "text": "\"I’ve been wondering ever since if the confidential ombudsman is there for you or for the university to not get sued.\"\n\nThe confidential ombudsperson is there for the university to not get sued.  Plain and simple.  I found that out the hard way and faced harsh retaliation for it.",
              "author": "shindleria",
              "created": 1590668261,
              "upvotes": 28,
              "replies": {
                "fs5hagk": {
                  "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs5hagk/",
                  "text": "I’m so sorry you had to go through that. Thank you for the experience you’ve shared with me. I want to take all this advice and make the best decision possible.",
                  "author": "AcademMisconTA",
                  "created": 1590714646,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "fs4zol9": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs4zol9/",
              "text": "The ombudsman will ABSOLUTELY place the university’s interests first. As a postdoc, I reported misconduct within my lab (primarily in the part of my advisor). Not sexual misconduct, but still a delicate situation. I was assured that it would be confidential and discrete. A few months later, my advisor called me into his office, closed the door so it was just us alone, and screamed at me for attempting to ruin his career. Turns out the ombudsman alerted the department chair, who happened to be a good friend of my advisor. Advisor switched gears very quickly once he realized it was supposed to be an anonymous report and that he had just outed his friend. Thankfully this happened when I was already planning to leave this lab and the advisor and I put on good faces for the duration of my postdoc, but it effectively burned that bridge for me. \n\nAll in all, you should absolutely talk to people for help. Find people you trust. If you decide to go to the university, play the timing right because it could hurt you and your career if you don’t.",
              "author": "uncreativescientist",
              "created": 1590704977,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "fs2umbx": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2umbx/",
      "text": "This is not your fault in any way, just so you know. Never let anyone try to tell you otherwise. \n\n1. Get yourself safe and get yourself connected to support resources. In the US, RAINN will be a good start. Your campus should have victim advocates that are not mandatory reporters for situations like this. And free counseling center or sex abuse treatment center off campus as well. \n\n2. Speak to specialists at your university about this and your reporting options. You likely have a system via which if you place a report it will be filed anonymously or can’t get back to you in some way. Ask what the case has been for people who’ve reported cases similar to yours. \n\n3. If you decide to report it, document everything (video) and take it to the appropriate staff.\n\nEdit: \nI have dealt with similar incidents on two separate occasions at the same university. For the first incident since the guy moved out of the area they didn’t do anything about it. Although I later found out he had been in trouble in two different states for the exact same thing. \n\nFor the second incident I was not the victim but somebody disabled was, and where I was living abuse of an elder, minor, or disabled person must be reported. My report on another person’s  behalf wound up sparking a series of complaints about the guy who did this amongst the student body and while they did not remove the guy, I didn’t have to go anywhere near him and I believe he was barred from taking other students.",
      "author": null,
      "created": 1590665605,
      "upvotes": 25,
      "replies": {}
    },
    "fs2syh9": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2syh9/",
      "text": "If you are in the US, look for your Title IX office. That is the place to contact. I would definitely speak to someone. Is there a grad student union? Someone there may be able to help, too. \n\nI am sorry this happened to you, but by speaking up, you may prevent it from happening to others.",
      "author": "CardboardChewingGum",
      "created": 1590664273,
      "upvotes": 41,
      "replies": {
        "fs30dv6": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs30dv6/",
          "text": "While this is what the Title IX office is supposed to do, this was not a good option where I did grad school. A friend was being harassed and stalked and the Title IX folks explained to her how upset and embarrassed it might make a man to have a woman argue with him in class. I can only imagine how much worse it is since Betsy DeVos has added protections for the accused. After I'd graduated, the local npr station and propublica were working on a story about how the university covered up faculty sexual harassment for years - getting people to come forward anonymously. So, the university used Title IX to shut that story down and tried to acquire the names of all the victims because the npr station was affiliated with the university which means that their employees were technically university employees, therefore \"mandatory reporters.\" \n\n\nTry to find help and guidance from people who aren't mandatory reporters and understand the culture of your institution. Document as much as possible. I wish I had better advice or more support to offer.",
          "author": "namesefreeze",
          "created": 1590669757,
          "upvotes": 26,
          "replies": {}
        },
        "fs47859": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs47859/",
          "text": "I would be wary. This might be a good move, but most IX offices at places I’ve worked had the chief objective of covering they university’s ass.",
          "author": "BenzeneAvenger",
          "created": 1590691138,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "fs2khj4": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2khj4/",
      "text": "If your career is saved, but the silence makes you sleepless at night and affect your future relationships and personal development and overall mental health, then what good is this career? It may very well be an all losing position in which you have to choose the action that will make you the most satisfied with yourself even though it's not totally winning. This happens in life a lot, we face a situation where there is no win, and we need to make the least catastrophic choice. Good luck and stay strong. I hope that guy is held accountable eventually and be publicly shamed.",
      "author": "DoChemistry",
      "created": 1590656372,
      "upvotes": 24,
      "replies": {
        "fs6c50u": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6c50u/",
          "text": "This. I haven’t slept much since it happened. I think you’re right. It’s not worth it. I don’t think the research is worth it anymore. Knowing that the PI believed in me and supportive my decisions gave me such a strong motivation. But now? I can’t fake it, I can put my head down and work but I doubt I can be near him and keep a clear mind. \n\nI’m not going to follow through with a report through the university staff until they put my graduation certificate in my hands. But I am going to report him to the affiliated victims advocacy center, as long as they confirm I can make the report to the university itself on my own time. I’m going to present the information anonymously and then evaluate the options. I think this way, it shows I went to seek assistance first through an official means and someone can professional document the event for more credibility when I’m ready. \n\nThank you for this wisdom.",
          "author": "AcademMisconTA",
          "created": 1590734826,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fs2pept": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2pept/",
      "text": "What country is this?\n\nIs this a uni?\n\nI've helped female colleagues deal with sexual harassment at our uni in the UK. It didn't go so well sadly.   \nFrom my perspective it seems that there is a fine balance between anonymity and gathering enough facts to take action. On one hand, you don't want your career to suffer so would ideally be anonymous. On the other, you may have to come out with your name if the institution doesn't want to let go of this academic.    \nSome of the female colleagues were thankful they spoke up, others wished they hadn't.   \nDo you know of any female academics in higher positions of your institution who you could get advice on this? \n\nIt sucks, it's awful and one of the reasons I gtfo of academia. \n\nI wish there was a clear answer here. Coming out will harm your career, but not speaking up won't fix this problem. The extent of harm or good your actions will have depends on the situation, the institution, mechanisms in place (like ATHENA SWAN), and your allies.\n\nAll I can for certain is, this is not your fault it happened. What happened was bad and totally unprofessional (and illegal). You have every right to complain about it and anyone that doesn't support you is in the wrong, not you.   \nDefinitely try seek out help, allies, support from anyone you feel you can trust.",
      "author": "onca32",
      "created": 1590661225,
      "upvotes": 9,
      "replies": {
        "fs31y1u": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs31y1u/",
          "text": "This is in the US, at one of the top 30 research universities. I think I’m going to focus on gaining support and alibis and then try to come to a decision about reporting. The other females I know of are no longer in this program are because of course rigor or similar incidences of misconduct. I just never thought this would happen to me in the academic setting, you know? Thank you so much for spending some time to type this out. I really appreciate all this support that I didn’t expect from this sub. Thank you guys.",
          "author": "AcademMisconTA",
          "created": 1590670757,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "fs2kzxq": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2kzxq/",
      "text": "We had a similar case in our dept, and from that girls experience I can tell you one thing - GET PROOF. Do not report him without any tangible evidence. Talk to him in private about the incident and record it without him noticing, get him to admit to the incident happening, because you wont be able to get anyone on your side without this. You absolutely should burn this bridge, but you have to make sure hes standing smack in the middle of it.  \nLike other people commented - whats a career worth if you had to exchange your sanity and agency for it? fuck him up.",
      "author": "MaximumDani",
      "created": 1590656874,
      "upvotes": 61,
      "replies": {
        "fs2ugs9": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2ugs9/",
          "text": "Honestly, mental health and personal safety are also very important. It is up to OP to decide if being alone with this person is safe/worth it. But it's not on any one person's shoulders to take someone down. We all have to be vocal that we do not support any form of harassment and will not work with anyone who behaves this way. I would hope that, even if the university doesn't do anything, the department faculty make it abundantly clear that they will not collaborate with this individual (the predator, not the OP).",
          "author": "Natchamatcha",
          "created": 1590665483,
          "upvotes": 42,
          "replies": {
            "fs3e5an": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs3e5an/",
              "text": "Ofc it is not OPs job to take care of this person, but in this specific situation no one else but they can do that, i.e being vocal about what happened and aiding justice. It is of course up to them to decide whether they want to report it or not, but it does sound like they do and like the situation has left them disturbed enough to be thinking about it afterwards. I honestly do not believe the department would be on a students side when shit like this happens, at least not from my experience. Department faculty is often a clique-based hierarchy that defends its own stronger than anything you can imagine, and the amount of politics that go into that kind of a toxic environment is absurd. I know of some cases similar to this both from my uni and other unis, and not once did the department faculty take a students side. Its unfortunate but that is usually the case; people value their jobs, status and relationships much more than they value the right thing to do, and this is especially true, ironically, in a uni environment where tenure is basically obtained by a combo of bootlicking and black magic.  \nTo the other person responding to this comment - I think its incredibly naiive to think that uni/department personnel could help OP without jeopardizing their relations, without a shred of real evidence. Sure, by the book these situations have a handling protocol, but thats just what it is - by the book, in theory. Not once did I see it really work out in practice. OP needs to obtain concrete evidence if they want to take this guy down, and they absolutely should. No career and no future is worth tolerating such blatant disregard of other people. If we as future academics want to make our already toxic environment better, people like that guy need to be booted out of it.",
              "author": "MaximumDani",
              "created": 1590677479,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "fs2z66y": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2z66y/",
          "text": "1.) While I do understand where this sentiment is coming from, any further in-person, on-on-one interaction may just cause OP to be revictimized.\n\nTruly under no circumstances should OP be speaking to this person in private alone; they should always have another person present if that's necessary. Communication between OP and this person should be virtualized, as well. Evidence can be safely gathered over phone and email.\n\n2.) If OP is in the US, there should a Title IX officer that they can speak to. And they should not wait. Whether or not there is documentation of the incident should not determine if it's reported. It is the responsibility of the Title IX officer to follow-up with complaints brought to them and maintain confidentiality.",
          "author": "some_ether",
          "created": 1590668947,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "fs2k4qu": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2k4qu/",
      "text": "[deleted]",
      "author": null,
      "created": 1590656033,
      "upvotes": 39,
      "replies": {
        "fs2lj6w": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2lj6w/",
          "text": "You can also send an email with a timeline so there is a digital time stamped record for court",
          "author": "somegayshit_20biteen",
          "created": 1590657403,
          "upvotes": 12,
          "replies": {
            "fs32qzl": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs32qzl/",
              "text": "I think I’ll go about this just to protect myself if another instance of this conduct occurs. Does anyone know anything about two-party consent laws when it comes to building a case for this stuff? That’s kinda my worry right now. I also have an NDA signed for lab-related activities that I’m afraid of violating by recording conversations while working in the lab setting.",
              "author": "AcademMisconTA",
              "created": 1590671260,
              "upvotes": 5,
              "replies": {
                "fs3dter": {
                  "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs3dter/",
                  "text": "Check your non disclosure and check your state. For example California is a two party consent state (both people in the conversation have to agree to being recorded or else it’s dismissed as evidence in court).",
                  "author": "Ophiuroidean",
                  "created": 1590677315,
                  "upvotes": 3,
                  "replies": {
                    "fs4sna3": {
                      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs4sna3/",
                      "text": "True -- but the recording would probably be enough to get the department to believe her. And for stuff like this the court of public opinion is what's going to count.",
                      "author": "Quant_Liz_Lemon",
                      "created": 1590701412,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                },
                "fs3zlar": {
                  "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs3zlar/",
                  "text": "I do not and it varies by state and the stipulations in your NDA see if your institution has access to free legal counsel or some lawyers have free intro/consult appointments",
                  "author": "somegayshit_20biteen",
                  "created": 1590687547,
                  "upvotes": 2,
                  "replies": {
                    "fs4li6w": {
                      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs4li6w/",
                      "text": "Unfortunately from my experience the free legal counsel offered by universities usually prohibits advising on matters involving the university itself due to conflict of interest issues.",
                      "author": "lumixter",
                      "created": 1590697927,
                      "upvotes": 3,
                      "replies": {
                        "fs4qh8i": {
                          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs4qh8i/",
                          "text": "That’s a good catch! Didn’t think about the conflict of interest in this case!",
                          "author": "somegayshit_20biteen",
                          "created": 1590700344,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fs2kr5k": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2kr5k/",
      "text": "So I don’t know if this is the same at your uni, but at mine we have a system where if you file a serious complaint you can’t be anonymous because they are obligated to follow up or something like that, but they don’t have to tell the person you made a complaint about that it was you. I once filed a complaint about a professor because of sub-par teaching and disrespectful language use towards the students, and I had to meet with some people and give more details, but I never had to face the professor herself, and she wasn’t informed that I was the one who filed the complaint. I eventually got a letter informing me that they had evaluated the report and what the conclusion was, and this was sent through this digital system that we have in Norway now that is equivalent to the kind of letter you would need to sign for if it was sent a physical copy. So they’re pretty serious about doing things the proper way. Your uni might do things differently, but either way it should be possible to find out how they handle complaints. You could probably talk to someone in the administration and not give them details (you don’t even have to give them your name if you do it by phone), and find out if you can file a complaint anonymously/semi-anonymously, or if the person in question will be informed that it was you.\n\nEdit: also, I am so so sorry this happened to you! Hope you’ll find a solution where you don’t have to see this person anymore without jeopardizing your career. And if that’s not possible, know that no matter the outcome, you did not deserve this and he is a jerk. I know that’s not really much of a comfort, but with the amount of blame typically put on victims of harassment I just wanted to emphasize that you’ve done nothing wrong, and how you choose to deal with this is 100% up to you!",
      "author": "aerdnadw",
      "created": 1590656634,
      "upvotes": 5,
      "replies": {}
    },
    "fs2fo2b": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2fo2b/",
      "text": "I’m not a professor; i’m in law school. But I think you should talk to a tort attorney in your jurisdiction. There might be laws in your state that prohibit retaliation against sexual harassment complaints. I’m sure your school has rules against that, but those rules don’t really matter. The school will calculate the best strategy for itself. You need an advocate who can guide you through the process",
      "author": null,
      "created": 1590651835,
      "upvotes": 23,
      "replies": {
        "fs2mwqi": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2mwqi/",
          "text": "I am sorry for naively asking this question but what tort has to do with the situation here?",
          "author": "Revolutionary_Buddha",
          "created": 1590658782,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "fs2twxm": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2twxm/",
      "text": "AcademMisconTA, I am so sorry that happened to you! Unfortunately, that type of behaviour is prevalent in academia and able to persist due to the power structures and hierarchy that exist in the academy. You need to do what makes YOU feel comfortable. I would recommend speaking with a student union representative if your uni has one. If you are in the US, you can speak with someone at the Title IX office, though be prepared that Title IX exists ONLY to protect the University, not the students. Some people here are recommending you email or talk with this person directly. I would say only do that if you feel safe and reasonably comfortable. You do not need to put yourself in a position that you feel is unsafe just for 'proof.' Lastly, consider speaking with the department head or another faculty in the department whom you trust. Keep in mind, though, that they are likely required to report to Title IX if you disclose (again, that's if you are in the US). Also, keep this reddit thread as proof of disclosure. If you report at any level, they will ask if you have told anyone this already.\n\nThere are many avenues you can take. You can not formally report (though I do recommend disclosing to someone you feel you can trust or possibly a therapist) and continue working in this lab until you complete the Master's work and move on. I would only take that route if you are able to complete this work without ever being alone in the same room as this person. You can disclose to other members of the research team and allow them to guide you through whatever process is appropriate. Or you can formally submit a report/complaint with the University and take action from there. Honestly, all options are hard. The most important thing is that you have people you can trust and that you are safe. Sadly, most womxm I know in academia have experienced some level of harassment. This is not something that should be swept under the rug, so THANK YOU for sharing with us here. Regardless of the path you chose, I encourage you to continue telling your story if you feel comfortable doing so. You can contribute to awareness of this systemic issue at conferences, with colleagues, and in op-eds. I hope you are well through this process and know that none of this behaviour is your fault.",
      "author": "Natchamatcha",
      "created": 1590665045,
      "upvotes": 7,
      "replies": {
        "fs2unat": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2unat/",
          "text": "ALSO, congratulations on all of your hard fucking work!! You deserve all the accolades and recognition!!",
          "author": "Natchamatcha",
          "created": 1590665625,
          "upvotes": 3,
          "replies": {
            "fs31eas": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs31eas/",
              "text": "Thank you so much. I’m going to take your advice to heart and scout today to see if I can get around this project without being alone. I’ve invited my colleague to come over so I can share all the advice that you and the others redditors have been willing to share with me. Thank you again for spending the time to post this.",
              "author": "AcademMisconTA",
              "created": 1590670413,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "fs2udye": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2udye/",
      "text": "First things first, you need to get help for yourself. Can you see a counsellor or psychologist experienced in sexual harassment and assault?",
      "author": "Legalkangaroo",
      "created": 1590665422,
      "upvotes": 3,
      "replies": {
        "fs30v5l": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs30v5l/",
          "text": "Funny story, I already see two for previous experiences as a child. I think I’m pretty overwhelmed by what happened last night because something akin to this just occurred the other day at the grocery store. I already have my appointment scheduled because of that. Thank you for sharing concern for my mental health 💙 \n\nI appreciate your response and time.",
          "author": "AcademMisconTA",
          "created": 1590670074,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fs36jnt": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs36jnt/",
      "text": "I'm so sorry you had to go through that.  As far as people you can talk to on campus, everyone, including the ombuds, is really there to make sure that the university will not get sued.  If you do talk to someone (and I hope that you do!) understand that they may only try to placate you into staying quiet, or may threaten you if you do decide to push things further.  It's a terrible system and I wish it were better.\n\nIf you identify as a woman and have a group or council for women and minorities on your campus, they would be the group I would personally trust the most. \n\nAgain, I am so sorry that this happened.  \\*Hugs\\*",
      "author": "fresnel_lins",
      "created": 1590673474,
      "upvotes": 2,
      "replies": {}
    },
    "fs38x4r": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs38x4r/",
      "text": "The degree, a career, etc., these things can be done through many paths and this is not your only avenue or opportunity for professional advancement.  Keep that in mind while you weigh your choices.  It doesn't have to be coercive.",
      "author": null,
      "created": 1590674768,
      "upvotes": 2,
      "replies": {}
    },
    "fs3syzv": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs3syzv/",
      "text": "Your post reminds me of the time when I was being sexually abused by an 80 years old professor who was my direct instructor in a graduate level program, almost 5 years ago! He bullied me and took advantage of my vulnerability as an International student and even provided me false information regarding immigration to make me rely on his influence only! He sabotaged my self-confidence at that time by telling me how he was the only person who could help me get through all my struggles as an International student and took advantage of that! He made sure he showed me how powerful he was as he was a member of Rotary club, friends with the provincial ministers and a face for the university as an important donor!  I kept quiet for 8 months until I graduated and later just tried to forget it happened and move on to build my life. Later I did have an opportunity to record his confession where he did say he touched me without my consent but I never put any charge against him. I am currently studying in the same university in another program, in a different department. I intend to do a masters and a PhD in the future. But if harassing students sexually is a common phenomena in academic field, it is a huge shame! Where does it end? What can we do about it? Does #metoo doesn’t speak for us? Yesterday only I watched the documentary on Jeffery Épiston on Netflix and it disgusted me to my core! The miniseries showed  how sexual predators prey on vulnerable people and often time they are the powerful faces of the society!",
      "author": "PolySci_Alpha",
      "created": 1590684473,
      "upvotes": 2,
      "replies": {
        "fs6ds4p": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6ds4p/",
          "text": "PolySci, I am so so sorry you had to experience such grooming and abuse. You deserve more than that. My program of study is a pharmaceutical specialty and 98% of students in the program are international students. I hope you never have to experience something akin to that again. \n\nI am part of one of the international student organizations, and being a local for my university’s town, we do community dinners and often share information with one another related to anything and everything. If you are able, please join one of these organizations and donate your time and speak out for other international students who may be experiencing something similar.",
          "author": "AcademMisconTA",
          "created": 1590736158,
          "upvotes": 1,
          "replies": {
            "fs72rmg": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs72rmg/",
              "text": "Thank you AcademMisconTA  for your kind words! Sure, I would love to join such organisations to share time with other international students! Please feel free to share more info with me via  PM if you would like.",
              "author": "PolySci_Alpha",
              "created": 1590757633,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fs3tyub": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs3tyub/",
      "text": "[deleted]",
      "author": null,
      "created": 1590684932,
      "upvotes": 2,
      "replies": {
        "fs6i073": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6i073/",
          "text": "Thank you so much, I can’t imagine how difficult that was to share. Thank you for being so open and honest about your feelings. I just want you to know, what that tech did was absolutely not your fault. You didn’t physically touch anyone, you had no idea he would do such a thing to someone else. I’m going to save a screenshot of this for some liquid courage. I’m going to try and make the best decision I possibly can and all these comments have been so helpful and educational.",
          "author": "AcademMisconTA",
          "created": 1590739894,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fs3utfw": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs3utfw/",
      "text": "I don't have anything useful to add, just wanted to tell you I'm sorry this happened to you and congratulations on your work. I hope your career isn't affected and that you can get proper help dealing with the psychological repercussions. again, I really feel for you.\n\n(one aside: I'm overwhelmed by all the replies with examples of times when the university offices/ombudsmen were supposed to help harassed students and only helped the perpetrator and the institution. not that it's surprising, but it still took me aback and made me all the more sorry. this should be a scandal, someone like ronan farrow should report on this fuckery.)",
      "author": "WittyGertyStein",
      "created": 1590685324,
      "upvotes": 2,
      "replies": {}
    },
    "fs43g3k": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs43g3k/",
      "text": "Keep a few certain things in mind.\n\n**BE BOLD. STAND STRAIGHT AND CONFIDENT.**\n\n**Don't carry and shoulder embarrassment and ignorance like something is gonna destroy your career. you are fine safe and aware now.**\n\n1. You not going to let him go away with this heinous act.\n2. You are going to finish your doctrine and keep doing whatever research has interested you in.\n3. You are not being emotional or low-self esteemed because of anything like this happens.\n\nfind out the most confidential and authoritative member of your institution whom you know very well. all the institutions have this facility for students to deal with trauma or panic or therapy type. those people are or consultants or therapist are best to talk and share yourself with them.\n\nGet trustworthy people on your side. let them know what just happened. don't run for revenge now.\n\ntalk to your authority whom you can trust and let them know that it may cause problems in your PhD so you first consulting him/her before you break the head of that guy.  talk to your head but always behave bold and right.\n\ntry to change your adviser too if possible for you.\n\nit's a sure thing that once things get in your favour, you are gonna talk and get that shit down.\n\nAgain, **Behave confident and bold. don't be shy, low or show any sign of weakness because you are okay now.**",
      "author": "KishanMishra",
      "created": 1590689354,
      "upvotes": 2,
      "replies": {}
    },
    "fs5gd47": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs5gd47/",
      "text": "Report this crime to the police as soon as you possibly can.  That's the only step that can lead to real long-term consequences for a criminal act.\n\nA university's Title IX office is neither a criminal investigative nor a judicial organization.  They have very little real power, especially when it comes to investigating things that happened off campus.  Sure, the guy might eventually lose his job if you go that route, but that's only the very beginning of what's at stake here.  Criminal acts deserved to be punished by the criminal justice system, not by a university make-believe court governed by opaque procedures and run by people who don't have a clue about real investigations.  If somebody makes lewd remarks to you on campus despite you asking them to stop, that's something your Title IX office is capable of handling.  Title IX offices can't even begin to handle actual physical assaults like you experienced.  That type of situation is simply not within their skill set.  That's why we have a real criminal justice system with real investigators trained to deal with these situations.\n\nI strongly urge you to file a police report as soon as you are able.  The longer you wait, the more wiggle room the perpetrator will have to weasel out of any consequences.\n\nBest wishes to you.",
      "author": "ChemMJW",
      "created": 1590714115,
      "upvotes": 3,
      "replies": {
        "fs6j0mp": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6j0mp/",
          "text": "Thank you for this advice. Do you know if there’s a chance a police report would make its way back to the university? I fear something getting out to them before I’m ready to take action against his behavior.",
          "author": "AcademMisconTA",
          "created": 1590740837,
          "upvotes": 1,
          "replies": {
            "fs7xfl2": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs7xfl2/",
              "text": "I think it is unlikely that they would directly communicate your allegation to the university, but I just don't know for sure.\n\nWhat I can imagine is that university officials could learn of your report indirectly.  If the police begin to investigate your report, then of course it's likely they would contact your immediate co-workers and colleagues at the university to obtain background or witness statements.  Word would likely filter upward through the grapevine.  I'm not a police officer myself, though, so I can't say for sure what steps would be immediately taken upon you filing a police report.",
              "author": "ChemMJW",
              "created": 1590773055,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fs389qn": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs389qn/",
      "text": "report him.  REPORT HIM.  \n\nreport him to title 9 and also file a police report against him.  title 9 is only there to protect the university. they will likely not clear this situation.  It's like the Catholic Church being in charge of their own child abuse investigation.  But if you also file a harassment claim with the police it will actually result in action by the university.  They can't bury it (likely they already have a few times) if you file outside of the university.  Do both.  it has the greatest likely-hood of actually holding him accountable.   \n\nalso, sit down right now and write down as much as you can clearly remember about what happened.  the more you have written down the better your memory will be about the event.\n\ndo NOT contact him about it.  if you need to go to work, do so, but no contact beyond what is absolutely required by your job.  don't go to dinner with him and others.  Stonewall this motherfucker and file the reports.",
      "author": "printandpolish",
      "created": 1590674416,
      "upvotes": 2,
      "replies": {}
    },
    "fs3bjw2": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs3bjw2/",
      "text": "Sorry if this is not that much help but If you are on Twitter I suggest asking the academic chatter page to post this anonymously for you. I've seen a similar question been asked but in regards to bullying.",
      "author": "ScottishSTEMinist",
      "created": 1590676162,
      "upvotes": 1,
      "replies": {}
    },
    "fs3kygy": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs3kygy/",
      "text": "Is the harasser actually a faculty member or researcher employed by your university? Or are they a collaborating investigator who is associated with a private medical group, pharma company, or research foundation? \nYour resources in academia have more influence if he’s part of your institution and it impacts how I’d suggest handling this.",
      "author": null,
      "created": 1590680775,
      "upvotes": 1,
      "replies": {
        "fs6daii": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6daii/",
          "text": "He is a tenured professor, retired doctor, and a paid researcher for the university. From what I understand, his position is why I need to tip toe so carefully about who I contact. I know he has relations with the head of the College of Pharmacy. I think they play golf together.",
          "author": "AcademMisconTA",
          "created": 1590735752,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fs3xohs": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs3xohs/",
      "text": "Also, I would comment this: \nRegardless of whether or not you make a report at the university level, one thing I wish I had done in my own situation is if someone asks you about working with them, like a prospective student, tell the truth. Most of these people are repeat offenders. They thrive off people not knowing.",
      "author": null,
      "created": 1590686662,
      "upvotes": 1,
      "replies": {
        "fs6e3e4": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6e3e4/",
          "text": "This. I will absolutely keep this in mind and share it with the other students that I know are considering working for him. Thank you for this suggestion.",
          "author": "AcademMisconTA",
          "created": 1590736423,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fs44v56": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs44v56/",
      "text": "Get some mental health support for yourself. I don’t know what will help but please decide carefully before talking to someone. Maybe this isn’t even the right advice but something like this happened with me. My professor assaulted me and I confided in one of his colleagues. It was mandatory for him to report it so the entire department turned on me.  Everyone except for one professor. Made my life a living hell and I barely escaped with my sanity. Didn’t apply for grad school because I am terrified of it happening again. If I were to do it again i would just turn in my papers on time, sit for the exams, and maybe I wouldn’t even tell anyone except a post in my uni’s anonymous chat rooms just to warn other students to be careful. In my experience the system is fucked up and they do nothing. So do what you have to in order to keep yourself mentally and physically safe.",
      "author": "Dear-Captain",
      "created": 1590690024,
      "upvotes": 2,
      "replies": {
        "fs6jc10": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6jc10/",
          "text": "I’m so sorry you had to go through that. Reading this breaks my heart. I hope you’re in a better place in life, mentally and spiritually now. This is a bit fresh but I’ll keep a tab on this throwaway if you ever want to DM about it. Thank you for sharing your experience with me during my time of struggle. I hope one day I can return the favor.",
          "author": "AcademMisconTA",
          "created": 1590741128,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fs45akg": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs45akg/",
      "text": "Ok ... This is a difference between winning the battle and the war. (1.) The priority is you completing your degree and getting out. (2.)  Second, to prevent any funny business, file a warning and get any sort of processes going.  (3.) Do not be in such awe of these people and listen to your instincts; if one of your peers were acting like this, you would probably tell them off.  The trick in this situation is to stand your ground and move forward.  \nAges ago, I started a degree and did not finish it (moved to another school) and was being harassed by my advisor.  It was a different time.  He considered himself gentile and superior, and I was a blue-collar upstart.  \nHowever, human behaviour remains the same.  When people harass, they are seeking to define a power relationship with you to meet some sort of need.  Sexual harassment from what I have seen appears to be about using a power imbalance to try to form relationships that these individuals could never form outside the office.  \nIn my case, the individuals wanted to be able to condescend and destroy an individual who did not meet his specific criteria of values, appearance and skills.  In your case, I suspect they are looking for some sort of unrealistic romantic relationship.  Their actions tell us more about their failings as individuals than anything.   Functional and successful people do not act like this.    \nGet your degree, but begin making plans to move on.  They may not be as professionally successful as they portray themselves.",
      "author": "DamCraftyBeaver",
      "created": 1590690226,
      "upvotes": 1,
      "replies": {}
    },
    "fs48ph8": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs48ph8/",
      "text": "Report it !! but follow the advise here by others",
      "author": "FoCoCS",
      "created": 1590691838,
      "upvotes": 1,
      "replies": {}
    },
    "fs4djup": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs4djup/",
      "text": "You will have a Title IX officer.  If you want to make a complaint, that is where to go - this is no confidential and they will have to act on your complaint.\n\nThere is probably a counseling service for grad students.  If there is, you might want to go there first - they can keep things confidential.\n\nAnyone else you talk to that is faculty (some staff and in some cases possibly post-docs) are mandated reporters - so they have to report to the Title IX coordinator and/or HR.\n\nI am very sorry that this happened to you - it happened to me when I was about your age.\n\nOne thing that a friend of mine (who is a psychologist) told me when I was older would have really helped me out then - maybe it will help you.\n\nShe asked me to examine why I couldn't face that man in the lab - it was, for me, about feeling guilty, being ashamed and feeling like I had done something wrong and feeling trapped and powerless - none of which were true. In fact, the ball was all in my court (even back then) I did nothing wrong and the shameful behavior was on his part, not mine.\n\nDon't agree to any meetings alone with that guy on anything other than professional grounds - office, campus, lab etc.\n\nPersonally, being prevented from leaving is a really troubling thing (not that the other things aren't troubling) but that one is a really bad sign.",
      "author": "PersephoneIsNotHome",
      "created": 1590694142,
      "upvotes": 1,
      "replies": {
        "fs6fc7o": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6fc7o/",
          "text": "Maybe it’s too early for me to express this, but I fear seeing him out of anger. I have defended this professor’s skills to advisors, he’s praised me countless times for weeks of late nights doing work, receiving achievements on behalf of my research in his lab, he even offered me a place to stay quarantined and alone to keep my family safe when I contracted the COVID virus. I’m so angry. I feel betrayed, I’m questioning everything he’s said to me, I’m questioning the respect he’s expressed having for me. \n\nI feel ashamed and weak because raising my voice and expressing he was making me uncomfortable during the event, pushing him away, it just wasn’t enough. I wasn’t strong enough to defend myself. I feel like I could have done more, the flashback of when he tried to prevent me from driving away keeps coming up, I could have hit him with my car! I’ve never seen myself as someone capable of hurting another person like that. But I couldn’t make a decision to flee at all costs when my heart was beating out of my chest. I’m afraid if I’m ever in a situation like that again, maybe I can’t protect myself or god forbid someone else I care about. (Sorry, I think I used this in a therapeutic sense, thank you for allowing me the space to openly express this). \n\nI won’t be seeing him again off campus, let alone by myself. I am considering getting proof, but I need time to process these feelings and keep a clear mind. I don’t want to make a mistake.",
          "author": "AcademMisconTA",
          "created": 1590737513,
          "upvotes": 1,
          "replies": {}
        },
        "fs6fj0s": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6fj0s/",
          "text": "I’m sorry, I completely spaced out typing. Thank you for these words of wisdom. Your comment really struck a chord and has given me more material to think about. I am so sorry, to this day you have to live with those memories. How long did it take before you were comfortable talking about what happened?",
          "author": "AcademMisconTA",
          "created": 1590737677,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fs4g48n": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs4g48n/",
      "text": "I'm so sorry you are in this situation.\n\nI was at a university where a Prof admitted to pressuring an undergrad into sex by threatening to leave her stranded in the field, with another student providing text evidence to the university verifying a similar incident. Title IX and admin buried it and told the Prof he would maintain his rank, benefits and salary indefinitely, but would not be allowed on campus.\n\n..and then the grad students went and talked to the two female profs in the department and all hell broke loose. Triggered an inquest from the President's office. The sweet deal for the Prof was withdrawn and he was fired. School admitted no wrong and the student eventually left in disgust.\n\nNot how it should have happened, and the students shouldn't have had to recruit female faculty - but there it is. Nothing happened until they found advocates within the system.",
      "author": "BenzeneAvenger",
      "created": 1590695360,
      "upvotes": 2,
      "replies": {
        "fs6fum8": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6fum8/",
          "text": "That is absolutely horrific. I don’t know if in the state of mind I am in now, i could process the mixture of emotions following the messy procedure of reporting and seeing nothing come of it. My heart goes out to those girls. It makes me anxious on the idea that my entire department is male dominated. But perhaps confiding in a female faculty outside of the department could aid me if the VA center suggests that as an option. Thank you so much for sharing.",
          "author": "AcademMisconTA",
          "created": 1590737963,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fs4r9e4": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs4r9e4/",
      "text": "I would go directly to an attorney outside of the school to talk what you should do next.",
      "author": "mrsbutler5",
      "created": 1590700731,
      "upvotes": 2,
      "replies": {}
    },
    "fs4sm61": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs4sm61/",
      "text": "First of all, I'm very sorry that this happened to you. You seem to be a very strong person to be able to think about this whole thing strategically and to ask for advice. \n\n&#x200B;\n\nIf I were you, I would pretend nothing happened until I get the credit I deserve for my work, in an irrevocable way (like authorship on a publication/presentation/etc). During this time I will build my sexual harassment case, i.e. collect evidence like emails, text messages, audio recordings, whatever other attempts that may come up again since I was quiet the first time he tried it. Once I have built a solid case, that's when I would consider officially reporting him. \n\n&#x200B;\n\nI would also try to get advice from trustworthy people in your department's admin, and have a call with them asking them about what would happen if \"hypothetically\" so and so was reported. It's a good way to get customizable answers and advice to go about this situation without actually having anything be on record. I would get in contact with Title IX office, Ombudsman office, sexual harassment office, or whatever anonymous way you can get advice on the best route on reporting it and the best  kind of evidence you can collect and produce when the time comes. \n\n&#x200B;\n\nYou don't have to make a decision about any of this right now. Take your time, it's okay.  \n\nI would  recommend being as secretive as possible about any intention to report anything, because you don't want your harasser to catch wind of it and preemptively retaliate.  I have witnessed situations in my department where a very prestigious professor emeritus was accused of discrimination, and once they heard about it, the university pushed them into retirement so it becomes a civil dispute rather than something the university is involved in. Which made it difficult for the person who reported the discrimination to pursue any legal action because the fees were no longer covered by the university.  Another instance is of a student who was in the process of reporting a superior for harassment and the faculty in question found ways to malign the student on record to discredit her. People can be crazy when it comes to protecting their careers, it's good that you're already being tactful. \n\nFinally, ask yourself, which would make you prouder of yourself: reporting a harasser or getting what you need from him (credit for your work etc) and moving on? nothing is wrong with either, and if you didn't report him, somebody else will eventually. It's not your personal responsibility to take on every wrong doer you encounter in your life, sometimes you'll have the mental capacity for it and other times you won't, and that's okay.",
      "author": "unluckypottyhead",
      "created": 1590701397,
      "upvotes": 2,
      "replies": {
        "fs6go9i": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6go9i/",
          "text": "This is a very well written comment, and thank you so much. When I talked to my colleague today, he informed me that in light of yesterday’s conversation  with the professor that the he was attempting to scrap my future research contributions. In that case, I believe I’ve gotten as much credit as I possibly can out of the situation. \nI have relinquished the desire to fight for further participation in his lab, as it is a one-on-one, small quarters and I will without a doubt be alone with him for several hours at a time in a building that is minimally populated for the remainder of the semester. I don’t think I can take the chance right now. \nI am going to focus on finding another lab to finish my thesis under without an official report as well as talk to the VA center, where no reporting is required. I think I’ll make a final decision on to whether or not to make the report official for Title IX admin after I’ve secured my diploma or I’ve got all my needs met in research. Your concluding question...is a very difficult one to answer. I don’t know if reporting him will necessarily make me proud, but finishing school in December will absolutely make me happy.",
          "author": "AcademMisconTA",
          "created": 1590738687,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fs35p6l": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs35p6l/",
      "text": "There appear to be lots of answers already. Most likely you may have made your mind. Anyway, here's my thought- don't go deep in this s*$t either physically or mentally. Unless it is possible to sort this thing out (either gathering evidence and complaining or standing against him (most of these people are cowards inside)) within a short time period, feel proud of your contributions, politely ask for nice recommendations from the professors (without blaming anybody of anything) and get the hell away from the mess. You can't dream of a bright future with a gloomy present. These kinds of events, in most of the times, changes the life-course of a potentially good academician. Don't let it loose your focus from academia. You're still at the early stage of shaping your career. It is how you take things and deal with them matters more than how others deal with or perceive of you.\n\nTLDR: If it can't be fixed in short time without getting 'huge' attention for this incedent, feel proud of your contributions and seek for study opportunities somewhere else.",
      "author": "OverpricedNeptune",
      "created": 1590672996,
      "upvotes": 2,
      "replies": {
        "fs6gvwx": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6gvwx/",
          "text": "I think I am one of the cowards! I don’t have interests in being alone with him again. I did not burn the bridges necessarily, and perhaps asking him to write me a letter of recommendation could be an advantage I could use. I really like this suggestion. Thank you so much.",
          "author": "AcademMisconTA",
          "created": 1590738876,
          "upvotes": 1,
          "replies": {
            "fs6xbvf": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6xbvf/",
              "text": "I wouldn't advise you to get recommendations from him of course but from other professors, if that is an option. You wouldn't wanna be on his unnecessary moral debt. Anyway, be strong and good luck.",
              "author": "OverpricedNeptune",
              "created": 1590753932,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fs2pxvb": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2pxvb/",
      "text": "First, as u/11001001btk mentioned, you must bring your feelings to the attention of the offender.  Be prepared.  They may deflect, gaslight, or otherwise evade.  You must stand firm and set your boundaries.  You are no less worthy of your boundaries than theirs.  (This seems antithesis to others' advice, but it establishes you having set your boundaries.  Record this interaction!)  \n\nSecond, you need to bring these actions to the attention of their higher ups.  Everyone has a higher up.  They need to be read in on the situation.  No one likes being caught unaware if a situation escalates.  This may actually be first.  Or coordinated with my first item.  (Again, do so in a way that is recordable.  Sending email? Mark it as \"read varification necessary.\")  \n\nThird, DOCUMENTATION!  You must document every interaction.  Even the inoccuous ones.  If you are to be subjected to regular interactions with this person, you must document every interaction.  If a pattern emerges, it will be documented.  If you can record interactions, all the better.\n\nFourth, No Matter What Happens, Stand Your Ground.  You have every right and reason to expect to work in an environment that is beneficial for your future.  If that fails, Do Not Blaim Yourself If You Have Followed The Previous Steps.  \n\nYour goal is not to 'take down a predator.'  Your goal is to educate someone about the current expectations of ethics and decorum.  If they can't handle that, it is on them.  Your documentation will show that you attempted a non-confrontational relationship.  If this person can't handle that, they will bury themselves.  And you still come out the good guy who tried to educate someone stuck in the old school world.  \n\nI know that this is a difficult situation, but you deserve to feel confident to perform your duties as prescribed without feeling singled out or hampered.    \nI am so sorry you are having to go through this.",
      "author": "GrandOpening",
      "created": 1590661694,
      "upvotes": -1,
      "replies": {
        "fs30kub": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs30kub/",
          "text": "Thank you so much for this. I have a department chairman in mind but I don’t think taking actions just yet is appropriate. As in, I’d like to think I may be able to inform him but ask him to not report anything on my behalf unless things escalate. I’ll do this through university email as advised. \n\nI will try talking to the PI and just clarifying my boundaries and being clear that it will NOT happen again and the behavior was unacceptable. Right now, I don’t have confidence in my ability to articulate that but I’ll spend a few days focusing on that. \n\nIf I’m in a two party consent state, does that affect the legality of my recordings or interactions? Should I elect to journal them elsewhere versus recording?",
          "author": "AcademMisconTA",
          "created": 1590669885,
          "upvotes": 2,
          "replies": {
            "fs4474j": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs4474j/",
              "text": "I believe the recording issue you're referring to is in regards to court proceedings.  With or without recording, keeping a detailed journal of time, place, interaction, and any witnesses is the best practice.",
              "author": "GrandOpening",
              "created": 1590689708,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fs2j7fc": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2j7fc/",
      "text": "Was he drunk?",
      "author": null,
      "created": 1590655143,
      "upvotes": -12,
      "replies": {
        "fs2jhe7": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2jhe7/",
          "text": "Should that matter?",
          "author": "nosleeptill8",
          "created": 1590655409,
          "upvotes": 16,
          "replies": {
            "fs2jily": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2jily/",
              "text": "Just wondering",
              "author": null,
              "created": 1590655442,
              "upvotes": -8,
              "replies": {}
            }
          }
        },
        "fs2xgic": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2xgic/",
          "text": "I wasn’t monitoring how many drinks he’d had, but I believe he was at least inebriated. No slurring or obvious signs though I wouldn’t discount it.",
          "author": "AcademMisconTA",
          "created": 1590667743,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fs2nl41": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2nl41/",
      "text": "[deleted]",
      "author": null,
      "created": 1590659462,
      "upvotes": -13,
      "replies": {
        "fs2y9io": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2y9io/",
          "text": "I’ll be honest, I don’t have faith in the system working. I don’t believe my university would protect my voice over his, especially not after this project is finished. He is tenured and I know of other students in different departments, with different PI’s that changed their study entirely over situations less than this  \n\nI never thought that it would happen to me, I’ve always felt so respected by him. Now I wonder where the intentions lie in the favoritism. I’m not sure if I could bring this up to him one on one, he attempted to be sexual in nature and used force to keep me from getting up or away from him. I don’t think I want to be alone with him again. \n\nI know you got downvoted but thank you for taking the time to reply. I never thought reddit would be a place I go to seek advice like this but I value the differing perspectives and I know the lack of confidence in university is a necessary one.",
          "author": "AcademMisconTA",
          "created": 1590668326,
          "upvotes": 3,
          "replies": {}
        },
        "fs2ulik": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2ulik/",
          "text": "[deleted]",
          "author": null,
          "created": 1590665586,
          "upvotes": -2,
          "replies": {
            "fs3bt2u": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs3bt2u/",
              "text": "In this situation the harasser is clearly in the wrong. There is no way he can pretend he didn't know, she said NO. He insisted. This is beyond the point of \"talking about the issue\" together.",
              "author": "splashingseal",
              "created": 1590676292,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fs2lhga": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2lhga/",
      "text": "Where exactly did he touch you? Did you tell him so far that you found it inconsiderate and inappropriate?\nThe trouble isn't worth it if he was just an idiot not knowing that you didn't want to stay, trying too hard to convince you.\nHowever if he actually touched you sexually in any way or shows no remorse/doesn't say sorry when you tell him to not do it again, I'd reach out for help.\nAlso consider if you will actually ever have to be alone with him before the project is over- if not, I'd wait until after the project.\n\nLong story short, I would only act if you think you're in actual immediate danger right now",
      "author": "idk7643",
      "created": 1590657355,
      "upvotes": -16,
      "replies": {
        "fs2zkj6": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs2zkj6/",
          "text": "He started with his hands repeatedly on my legs and me removing them. I started getting nervous when he put his arm around my neck and kinda trapped me there. \n\nI assumed he was inebriated and just quietly removed the contact with him (moving away, removing his hands, leaning away) until he tried to grab between my legs and tried fondling my chest and when when I tried to get up to leave he became forceful and moved my phone away from me. He grabbed my arm and moved it into lap and I quickly pulled away and was very vocal that it made my uncomfortable. \n\nHonestly I just sat frozen after that and tried to leave as soon as he loosened his grip enough. When I went to remove my car from the property, I needed to back out before I could leave and he attempted on two ocasiona to lean into the window and kiss me. At the point I was able to loudly say no and that it was inappropriate and turn away. \n\nI’m going to reach out to another student and ask if they could just accompany me for in-lab times. I think I can avoid him for the most part and just set up strict boundaries. I want to believe he would never do anything in the university setting because we have cameras everywhere because of the high profile work. But I could be wrong and maybe this is just the beginning.",
          "author": "AcademMisconTA",
          "created": 1590669215,
          "upvotes": 10,
          "replies": {
            "fs3zdcg": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs3zdcg/",
              "text": "Yeah that's definitely sexual assault and not just being stupid. Even if he was drunk, that definitely went too far, after the first time of you saying you were uncomfortable he should have backed off.\n\nIf I was you I would straight up tell him, face to face, in a place with cameras (e.g. outside of the laboratory in front of the door so people can still hear you if something happens): \"On X night you did some things that were very inappropriate, and it frankly scared me a lot as I did not want to be touched and I told you several times to stop it. I don't want to make a big deal out of it for my careers sake, but if you ever touch me again in such a way, I will tell X (whatever authority is responsible) \".\nIf he says sorry and shows some remorse, it should be fine.\n\nIf he tries to blackmail you\" who will believe you? \"or threatens you, instantly go to them and report him, because it's not safe.\n\nI think that sort of confrontation is the best way to determine how dangerous he actually is.",
              "author": "idk7643",
              "created": 1590687443,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fs4520v": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs4520v/",
      "text": "[deleted]",
      "author": null,
      "created": 1590690114,
      "upvotes": -3,
      "replies": {
        "fs4dnvz": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs4dnvz/",
          "text": "op was repeatedly touched without their consent. That's more than enough info to know it's wrong. Why would they need to share the details of it? \n\nAnd \"if you were just *friendly* touched..\"?? Wtf is wrong with you.",
          "author": "hexylunt7",
          "created": 1590694195,
          "upvotes": 2,
          "replies": {}
        },
        "fs548k8": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs548k8/",
          "text": "Wow. \"Avoid situations that you can like going out to eat or drinks.\" \n\nIt's such a double edged sword as a woman in science. The options are:\n\n1. You go out with the lab to eat/drink and should be concerned about being cornered and touched inappropriately.\n2. You refuse to go out to eat/drink, miss potential important information that was discussed, and get labeled as \"not a team player\", \"unfriendly\", or the b word. \n\nRegardless of where his hands were on her body, it's best to practice the kindergarten rule - keep your hands to yourself.",
          "author": "OutrageousReasons",
          "created": 1590707376,
          "upvotes": 2,
          "replies": {
            "fs56l4i": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs56l4i/",
              "text": "[deleted]",
              "author": null,
              "created": 1590708639,
              "upvotes": 0,
              "replies": {
                "fs6hicy": {
                  "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6hicy/",
                  "text": "Sorry, I didn’t mean to cause an argument. I had posted some explicit things below in another comment and I just wasn’t comfortable typing them out again. I was vocal and expressed non-consent multiple times. He had groped me inappropriately and it’s in the comments, I’m sorry I can’t type this out again right now",
                  "author": "AcademMisconTA",
                  "created": 1590739437,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fs53vka": {
      "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs53vka/",
      "text": "sorry but it seems like this person has a genuine passion for you.  the simplest way to solve this is to have a conversation with him in a private place and see where it leads.  \n\ndon't be afraid to try something new.  you may end up delighted.  i know many happily married couples that met in confusing circumstances with awkward power dynamics.  What seems like exploitation may let you surprise yourself.  Consider reciprocating",
      "author": "manifest-decoy",
      "created": 1590707182,
      "upvotes": -4,
      "replies": {
        "fs6h1xq": {
          "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6h1xq/",
          "text": "Oh, I don’t think this is necessarily the right step for me. He’s married with children and I prefer a partner who respects my right to consent... but thank you for this perspective.",
          "author": "AcademMisconTA",
          "created": 1590739024,
          "upvotes": 3,
          "replies": {
            "fs6jucm": {
              "link": "/r/AskAcademia/comments/gs1po3/sexual_misconduct_help_me_please/fs6jucm/",
              "text": "you should take time to reflect and consider, there is no need to make a decision here in front of us.",
              "author": "manifest-decoy",
              "created": 1590741602,
              "upvotes": -3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}