{
  "sid": "8osof5",
  "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/",
  "title:": "Got burned by choosing academics over most other things, what do I do now?",
  "text": "I don't know if this is the place to post this but I am feeling raw and this sub is the only place I could think to post this. I am a first generation immigrant and minority from a family that doesn't really see the point of my field but I got into my dream graduate school this year after busting my ass for years in undergrad. I overloaded on credits for several semesters and achieved high marks in addition to doing research at my school and at other institutions concurrently with the overloaded course schedules to stand out. It seems I held this too far above things in my personal life.\n\nI just had my girlfriend of 2 years break up with me. She felt that the relationship was always number 2 to academics. I know I have been laser focused on school, but she was the person I feel I invested the most in. I opened up to her about things I never have to anyone in my life, she was the person I could always just be me around, my only friend and now I'm completely alone. I'm feeling a rush of emotions, I cried for the first time in years. Looking at my grades and my acceptance letter now it feels like a hollow victory. I got my dream but now what. It feels like I gave up the person I love for numbers next to the letters GPA. I feel like the king of the ashes and I don't what to do. I'm heartbroken, upset, angry, confused. Has anyone else been through something like this?",
  "author": "prospectivestudent96",
  "created": 1528219427,
  "updated": 1634082247,
  "over_18": false,
  "upvotes": 94,
  "upvote_ratio": 0.96,
  "comments": {
    "e05shy0": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e05shy0/",
      "text": "Awwwww, OP. It's okay. It's normal to feel these feelings after a breakup. It doesn't say anything about your relationship or your life choices or her reasons for breaking up. These are just the feelings humans feel when they are rejected.\n\nThat said, yeah, academia (or any highly competitive job) will erode your personal relationships, and I felt the same as your ex with my academic exes. Ultimately whether it's worth it to you is something only you can decide (but don't make any rash decisions - girlfriends come and go but the degree is forever). Academia does make dating harder, but lots of academics are in happy relationships. One day you will find someone who can live with your schedule and priorities.",
      "author": "riggorous",
      "created": 1528220049,
      "upvotes": 84,
      "replies": {
        "e06y4vd": {
          "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e06y4vd/",
          "text": "The relationships I've most envied for 1- how happy they seem, 2- how supportive they are of each other and 3-how much fun they have together are the relationships I've seen between academics. I remember fondly my undergrad department chair and her husband who also was a professor in the same department. They were both German and had two cute little boys they would bring on field trips with us (geology grad here). Such a cute family. Super funny having their 7-yr-old follow us students around and tell us what rock we're looking at :) Also my current boss (chem department chair) and his wife, who is a professor in the lib arts field at the same college. \n\nI loved hearing the conversations of both these couples, super high level thoughts but with that closeness. Don't worry OP, she's out there. You may just not have met her yet, and that's okay.",
          "author": "alcogeoholic",
          "created": 1528261013,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "e05sq82": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e05sq82/",
      "text": "Hello fellow prospective student,\n\nWhile I cannot offer advice, I, too, am learning how to manage being productive and keeping those around me happy. As I go deeper and deeper into academia, I see that there are people who give up all relationships to get their work done and advance their careers. I also notice some manage to have a life/family outside of academia while maintaining a good CV. Aside from resorting to dating someone in academia \\(which I can't, as my long term partner isn't in academics\\), I want to learn how to be like the latter, so I'm following this post.",
      "author": "nervouspropective",
      "created": 1528220245,
      "upvotes": 20,
      "replies": {
        "e06n93c": {
          "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e06n93c/",
          "text": "That first kind of person you mention -- do they seem miserable or do they seem to act the way they do out of real love of their work? Genuine question, I'm not even on the first rung of academia yet.",
          "author": "regionjthr",
          "created": 1528248620,
          "upvotes": 2,
          "replies": {
            "e0706ku": {
              "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e0706ku/",
              "text": ">  I see that there are people who give up all relationships to get their work done and advance their careers. I also notice some manage to have a life/family outside of academia while maintaining a good CV.\n\nI am curious about this too.\nAdditionally, how many percentage of professors do you think are out there who manage to have a life/family outside of academia while having a good CV?",
              "author": "mugbrushteeth",
              "created": 1528263910,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "e065p1h": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e065p1h/",
      "text": "Hey, OP. This is probably one of the most important learning moments of your life. It is where you ask yourself what it is that you really want.\n\nIn undergrad and grad school, people try to do everything because that's what they think life/research is. Overworking yourself year after year will take a toll on you and facing failures in that setting might completely break you. But, the ones who succeed in grad school are the one who pace themselves and understand what is truly important to them. Is success in the eyes of others, their acceptance and their awards truly the most important thing to you ? Or is life for you to do what you want and at a pace that you find fun? \n\nFew people realize this early on. It is why they are not upset when they fail or have a paper rejected or even fail qualifiers. They have a broader perspective that helps them be alright.\n\nI'm guessing you like me were not wise enough to handle and prioritize a relationship along with research. What you have to take away from this is that that is one area that you need to grow in. It takes time but once you feel like there is more to life than being at a dream school, once you truly feel that losing any title or position won't make you any less of a person, then you will be ready to devote enough attention to people that care about you because you will know what is important. So, take a break now OP and grow. It is going to be a hard and tough growth that you will have to do alone because self-reflection is the only way to grow. Ask yourself what chains tie you down and how to break them.",
      "author": "Dirivian",
      "created": 1528231456,
      "upvotes": 39,
      "replies": {}
    },
    "e068kq2": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e068kq2/",
      "text": "Using an academic example, it's literally impossible to be [a perfect mother, a great spouse, a fantastic teacher, and a high-flying researcher at the same time, especially early on in your life/career.](https://blogs.scientificamerican.com/guest-blog/the-awesomest-7-year-postdoc-or-how-i-learned-to-stop-worrying-and-love-the-tenure-track-faculty-life/) A major reason that people leave any high-pressure field is because of shifting priorities. If you feel unhappy, you learn to balance your priorities differently in the future and move forward.",
      "author": "AnimaLepton",
      "created": 1528233990,
      "upvotes": 11,
      "replies": {}
    },
    "e066kao": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e066kao/",
      "text": "I'm sorry about your breakup. The fact that you look at your academic situation as hollow right now reflects a lot of humanity on your part. Don't overlook that.\n\nI have not been in your situation, but I can tell you that if your girlfriend was holding out that you would have more time for her once grad school started then this is the best case scenario for both of you. Grad school is a major time/brain commitment - I don't buy into the late '80s framework (which has often been cited to me) that grad students are overly needy partners, but I definitely experienced grad school stresses in my relationship (which went from dating, to engagement, to marriage during grad school). Many times I have felt lucky to have had a partner who understood my commitment to ridiculous sleep schedules, low pay, tedious document proofreading, and moving all over the country to find work, because I know people for whom things have not worked out. Now, 10 years post PhD, all of these things still affect our relationship, but the relationship still works, and, for me, it has helped to have someone with me in this experience for the long term.\n\nMy takeaway for you is that balancing work and life is a long-term issue for all academics - it doesn't get better. What that means is you need to find a way to make it work for you. That might mean finding the right career/partner/etc. to keep you balanced. It will almost certainly mean that you need to consider your own priorities and goals, and where you might need to be more flexible. One thing that I found very hard as a student was saying \"no\" - it feels like you are letting someone down. What I've learned over time is that sometimes (often?) saying no to someone  in my academic life means I can maintain a more healthy personal life.",
      "author": "skleats",
      "created": 1528232201,
      "upvotes": 9,
      "replies": {
        "e06tm3r": {
          "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e06tm3r/",
          "text": "[deleted]",
          "author": null,
          "created": 1528255487,
          "upvotes": -4,
          "replies": {
            "e07ijy9": {
              "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e07ijy9/",
              "text": "You're right, that is a completely unrelated question.",
              "author": "skleats",
              "created": 1528293881,
              "upvotes": 4,
              "replies": {
                "e07mcgx": {
                  "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e07mcgx/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1528297339,
                  "upvotes": -1,
                  "replies": {
                    "e07rnnz": {
                      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e07rnnz/",
                      "text": "If you actually managed to get through \"a PhD from a leading institution\" without learning how to write then I'm sorry, you got scammed.\n\nThat said, this continues to be irrelevant (and weird!). If you are serious about wanting help with writing,  Reddit has places where you can ask for that.",
                      "author": "skleats",
                      "created": 1528301962,
                      "upvotes": 1,
                      "replies": {
                        "e07xzzc": {
                          "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e07xzzc/",
                          "text": "[removed]",
                          "author": null,
                          "created": 1528307285,
                          "upvotes": 1,
                          "replies": {
                            "e07z8tp": {
                              "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e07z8tp/",
                              "text": "No, your advisors were not generous to you, as evidenced by their lack of commitment to your academic development and your PIs unhelpfulness in prepping your paper.\n\nReal talk, in the time you've been (for no reason) latching on to me for writing advice, you could have asked for and gotten writing advice. Like. I. Suggested. I am not an epiphany of academic wisdom, but I'm confident on this one.",
                              "author": "skleats",
                              "created": 1528308338,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e066vs0": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e066vs0/",
      "text": "Learn from this and figure out what you want. Honestly, end of undergrad is when lots of relationships end. It may just be a new chapter for you. \n\nWhat field are you in? I can’t speak for others, but humanities is doable. I’m working full time and getting my PhD in English. My husband has been supportive— we don’t spend as much time together as we used to, but we do find time.\n\nOr be single and work hard, play hard with the other single people in your cohort. Try to remember why you went into this field, find the joy of it again.",
      "author": "capaldithenewblack",
      "created": 1528232476,
      "upvotes": 9,
      "replies": {}
    },
    "e065ihs": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e065ihs/",
      "text": "Regardless of what other people say here, I'll be blunt. Treat this as a wake-up call to the realities of \"being a rockstar researcher\". Many of those people are unhappy, because they had to forego a lot of life's precious moments to get to where they are. On the other hand, it can be fulfilling, but I suggest taking it a bit slower from here on and trying to enjoy life simultaneously.",
      "author": "theoneandonlypatriot",
      "created": 1528231296,
      "upvotes": 15,
      "replies": {
        "e069fo8": {
          "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e069fo8/",
          "text": "As a counter point, I'd like to propose that idea that there are also many people in the world who chose to forgo their careers (either the direction they wanted or at the intensity they envisaged) for the people in their lives and are also unhappy.\n\n\nFor every \"rockstar\" academic who didn't make time for friends and partners but made it big with a degree that lasts a lifetime, you also people who went easy in pursuing their dreams in favour of people in their lives (happy relationships with whome often don't last a lifetime).\n\n\nI feel the choice of what is important to people is not universal to all. Sure, I might sometimes feel bored by not having a long term partner, but I know I care more about achieving my career goals. Conversely, I could indulge my social desires more, but then I would get much more upset feeling like I've left behind my ambitions. The opposite may be true for the next person. I think it's important to emphasize that preferences differ across people. It's natural to feel sad over any breakup, OP. But you may very well be able to find somebody who understands or even shared your ambitions. And it's up to you decide whether you want to search for that kind of person or if you care enough about having any relationship that you would sacrifice your career goals.\n\n",
          "author": "izvin",
          "created": 1528234781,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "e06c1r4": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e06c1r4/",
      "text": "I think it is better to be easy on yourself. \n\nI prefer to have a balanced life. I used to choose the academic work over my family, friends and MYSELF (this is the worst one) as well. Upon the graduation, I realized that I would never be younger or more healthier again.  If I keep my work in this fast pace, I would never find time to do the other things I'd like to ( yes, science isn't my life and I like many things such as; art, cinema). So I decided to choose myself over science. I don't want to be a stellar academic, I just want to teach and learn what I'd love to do but I also want to feel that I am living my life and I want to protect my mental health. \n\nPs: About breaking up, I wouldn't make it about my work or academia. We know that there are multiple variables in the relationships. So don't be angry with yourself. The best thing you can do is to just move on. ",
      "author": "earthsea_wizard",
      "created": 1528237255,
      "upvotes": 4,
      "replies": {}
    },
    "e062rjc": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e062rjc/",
      "text": "There are some partners that will help you succeed in what YOU want, and some will hold you back for what THEY want. You probably know deep down that you need one from the former, not latter, category. In academia, your story is all too common and is pretty much a rite of passage in some respects. In time you'll look back on things much differently.",
      "author": null,
      "created": 1528228924,
      "upvotes": 11,
      "replies": {
        "e069zk2": {
          "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e069zk2/",
          "text": "Given that partners of academics routinely sacrifice their own goals for their partner's career, I'm not sure your derisive tone is warranted ",
          "author": "riggorous",
          "created": 1528235288,
          "upvotes": 13,
          "replies": {
            "e06bgt3": {
              "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e06bgt3/",
              "text": "He's just been accepted to grad school. I originally typed out something much longer delving into all the potential nuances that you're probably thinking of. And if he was five years or more older I'd agree with you for most of them. But for where he is now, I wanted to emphasize what was most relevant to his situation. Common advice for non-academics: don't follow your high school sweetheart to a worse undergrad school than you've earned. For academics: I say the same but replace high school with undergrad and undergrad with graduate and waive away all the irrelevant nuances (obviously, he's not 'following' her somewhere). I just find it tough to imagine that the average highly-driven over-achiever will not regret settling down before they're even in their thirties.",
              "author": null,
              "created": 1528236697,
              "upvotes": 5,
              "replies": {
                "e06fjwr": {
                  "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e06fjwr/",
                  "text": "I'm not disagreeing with\n\n> In time you'll look back on things much differently.\n\nI'm disagreeing with\n\n> There are some partners that will help you succeed in what YOU want, and some will hold you back for what THEY want. \n\nNot wanting to be with someone whose life is their job is not \"holding them back for what you want\". It's natural and the right choice. This is true at any age.",
                  "author": "riggorous",
                  "created": 1528240716,
                  "upvotes": 12,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e06307v": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e06307v/",
      "text": "You are doing what makes you feel happy and following your dream. The right person will embrace that and instead of feeling like 2nd place, they will embrace it too (and you in turn their goals). Sucks now, but that will fade and the right one will come along that makes it not feel like a choice between them and your dreams. Keep the faith, stay positive and dive in to your dream grad school 100%",
      "author": "woopthereiam",
      "created": 1528229132,
      "upvotes": 7,
      "replies": {}
    },
    "e06jxvy": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e06jxvy/",
      "text": "Getting my masters degree was one of the reasons my first marriage failed. I was always busy with school and my husband found other outlets to take the place of his absent wife. We divorced shortly after I graduated. \n\nI taught high school science for 9 years before starting my doctoral work. In that time I remarried and had a child. I can tell you from personal experience that my doctoral studies/research have been a burden on my family. With my doctorate in hand, I still have guilt and regret for being absent from their lives. ",
      "author": "red_ajah",
      "created": 1528245167,
      "upvotes": 2,
      "replies": {}
    },
    "e06q0kz": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e06q0kz/",
      "text": "As others have said, this moment is serving to pause you in your life. Take the time to reflect and consider what kind of work-life balance is best for you. It wasn’t a breakup that served as my wake up call, but a family emergency at the end of the first year of my PhD. I walked into my dream program after 4 years of undergrad and a 2 year MA wanting nothing but to pore my heart into research. I landed in a class led by a professor who made it his mission to force me out of the program. He was aggressive in his comments (asking me in front of my peers why I hadn’t dropped the class yet) and his grading. He failed me on a midterm and then on our final exam, which raised problems for me progress in the program. My advisor was told I was a trainwreck and the prof soured my reputation with all of his colleagues, effectively blacklisting me from taking their courses. I was told by another prof to work harder. So I went from 8 hour work days to 12-14 hour work days. By February my anxiety was so out of control I was having night terrors that my room was on fire and sleepwalking in my efforts to get out. \n\nBy March I was seeking help, but at the end of April I learned my mother had cancer. Her tumour was discovered when it partially ruptured. There was a concern that she would need emergency surgery. I went to my professors to ask for extensions on final papers, and special circumstances for an exam. I was told no by 2/3 of them - including my own advisor! One also made particularly insensitive remarks when I asked them. I found out two days later that that same professor had allowed a male student in our class to write the exam remotely from Taiwan. \n\nI almost walked away. It didn’t seem worth it. Why were these people asking me to sign away my life and my ability to do anything for my family? It was glorified by many of my peers that one of the men in our program had come in for committee meetings and to work the day they were married. This was their vision of a perfect student, a top student.\n\nI realized then and there that I would never be that person. What saved my commitment to grad school was a pair of conversations, one with my undergrad/MA advisor, who had supported my pursuit of academia, and one of my other professors. Both made it clear that I was not less than for wanting to prioritize family. I realized how important it was to work with the right people. So I finished my coursework and vowed never to work with those who wanted me to work 12-14 hours a day or sacrifice time with my family. \n\nI went into second year with a dog, having spent the summer helping my mom through her first round of treatment. 4 weeks before generals my mom was rushed into emergency surgery after developing life threatening blood clots due to complications from her cancer spreading. I was able to leave short notice to be with her, and defer generals and end of term coursework with ZERO pushback from any faculty. My new advisor was an immense support in this and everyone reassured me I was okay in doing this. \n\nI’m now in a position to get back to work, and in a way I have to push back on my commitments to family and assert that I still need time to do research. There’s no crime in this - it’s a balance that will make me happy and I need to live my life. But this is the key: it’s what works for me. It’s taken me a hell of a long time to get to this point and in some ways I’m still considering what I want in life. \n\nOne of the best pieces of advice I received was that grad school is not a race, nor is life in general. Find the pace that works for you. Other people might be extremely critical of those choices (I was told that getting a dog would hurt my career by taking time out of my daily schedule...). But the key thing here is that it’s your choice, not theirs. What works for you might not work for them. And that’s totally fine. ",
      "author": "Lovable_Geek",
      "created": 1528251508,
      "upvotes": 2,
      "replies": {}
    },
    "e06voi4": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e06voi4/",
      "text": "Sorry -_-\n\nAs an academic with a currently tolerant GF, I can relate. Her and I have talked about what she may be in for and have made a point to have honest conversations and check ins about needs and expectations. This strategy at least makes clear the choice between academia and relationships.\n\nIn reality, you are always making this choice, and academic research is extremely time consuming and isolating.\n\nAre you in a position that you could now choose between restoring your prior relationship at thecost of your academic progress? Which would you choose at this point? My guess is the answer of IF you could choose is YES, at least if she feels as strongly about you as you do about her. But it would require a sacrifice that you may be unwilling to make (your academic dream, or at least its timeliness.)\n\nThat is no small choice, and only you can make it, but I would suggest that it is one you will ALWAYS be making. The treadmill doesn't really end and is still getting more burdensome (at least in the US).\n\nYou can also choose to hold out for another partner who might be more compatible, and/or make a point to strike a mutually agreed balance and live by it.\n\nIf nothing else, you may find this experience to be solid fuel for thinking through all of your commitments better.",
      "author": "rwbuie",
      "created": 1528257885,
      "upvotes": 1,
      "replies": {}
    },
    "e0745q1": {
      "link": "/r/AskAcademia/comments/8osof5/got_burned_by_choosing_academics_over_most_other/e0745q1/",
      "text": "If she couldn't support you while you were dealing with the demands of grad school she simply wasn't partner material. This isn't your bad.",
      "author": "FraterPoliphilo",
      "created": 1528270955,
      "upvotes": 0,
      "replies": {}
    }
  }
}