{
  "sid": "d0en98",
  "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/",
  "title:": "I submitted my thesis and I feel horrendous.",
  "text": "I submitted my PhD thesis ten days ago. This was followed by a couple of days of moving house, then travelling to the North (UK) for my partner’s birthday and finally back to my parents’ home on Monday.\n\nI feel awful, I didn’t really sleep the first few days, I feel so up and down. I’m having to sleep in the middle of the day, which I never do. I feel so exhausted I can’t even bring myself to go for a run, and I’ve had all of this weird muscle pain and headaches.\n\nSome colleagues have said this is normal but I didn’t expect to feel... this bad? I feel so guilty for being lazy and mooching round the house but I barely have the energy to go outside at the moment. Does it get better? How do you learn to relax when that’s something I’ve never really allowed myself to do?",
  "author": "croissant530",
  "created": 1567764453,
  "updated": 1634081314,
  "over_18": false,
  "upvotes": 139,
  "upvote_ratio": 0.97,
  "comments": {
    "ez90bms": {
      "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez90bms/",
      "text": "Perfectly normal. I respond to horrific levels of stress by being cool-headed and fine until everything is dealt with. And then my body degenerates, my immune system disappears, my sleep cycle alternates between insomnia and narcolepsy, and I crave and binge on food with terrible digestive consequences.\n\nTake a week. Consciously and actively relax. Do happy things, do quiet things, be kind to yourself. \n\nFor me, I get my sleep fixed first. And then everything works itself out.",
      "author": "taegre",
      "created": 1567768549,
      "upvotes": 129,
      "replies": {
        "ez9gif7": {
          "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9gif7/",
          "text": "Thank you. The food craving and bingeing has been really hard, but I do feel like it is settling a bit.",
          "author": "croissant530",
          "created": 1567781738,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "ez8xd6g": {
      "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez8xd6g/",
      "text": "Same experience for me right now. I spent the past two weekends in bed 24/7 but I don’t feel bad about it. I think we just need some to readjust to a new life and if slowing down is what’s needed then slowing down will be done.",
      "author": null,
      "created": 1567764745,
      "upvotes": 30,
      "replies": {
        "ez9gnbw": {
          "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9gnbw/",
          "text": "I think the readjustment to a new life is exactly what it is, because my life is never going to be the same again. I’ve got a job lined up in finance which I’m really looking forward to, but I think it also feels like a big loss of purpose and identity. Thank you.",
          "author": "croissant530",
          "created": 1567781829,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ez8yik1": {
      "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez8yik1/",
      "text": "Perfectly normal, and it gets even weirder after your viva when suddenly you're a Dr and you start thinking \"ok...now what..\".",
      "author": "dovahkin1989",
      "created": 1567766337,
      "upvotes": 25,
      "replies": {
        "ez94qg2": {
          "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez94qg2/",
          "text": "I literally went and took a nap in my office after my defense, while everyone else was at my \"party\" in the conference room.\n\nI was woken up by a call offering me a job :)",
          "author": "dontbothertoknock",
          "created": 1567772913,
          "upvotes": 18,
          "replies": {
            "ez97045": {
              "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez97045/",
              "text": "... how long was that nap???",
              "author": "RieszRepresent",
              "created": 1567774821,
              "upvotes": 22,
              "replies": {
                "ez9aa4r": {
                  "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9aa4r/",
                  "text": "Lol an hour.  Just good timing.  Sure got me out of my stupor, though.",
                  "author": "dontbothertoknock",
                  "created": 1567777338,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "ez9gstr": {
          "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9gstr/",
          "text": "Ha! I’m going to work in finance so that is going to be really weird. A total change of culture - but hopefully very interesting and will enable me to do some other things in my life that are important to me.",
          "author": "croissant530",
          "created": 1567781931,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ez91a9q": {
      "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez91a9q/",
      "text": "It's definitely something to come down from. What helps a lot of people (and does for me) is to find some low-stress productivity. Do the grocery shopping, some yardwork, etc. Or if you miss the intellectual connections, wander the stacks of the closest library...grab a few books from a section you're unfamiliar with and just skim. (My favorites are books that are illustrated catalogs of things...\"Perennials of North America\" kind of stuff. It starts off mindless and then you get sucked into the details of someone else's passion.) Reading poetry is another good one; I go with brilliant poets who use plain speech, like Jack Gilbert: https://www.amazon.com/Refusing-Heaven-Jack-Gilbert/dp/037571085X",
      "author": "dcgrey",
      "created": 1567769592,
      "upvotes": 14,
      "replies": {
        "ez9gxen": {
          "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9gxen/",
          "text": "This is good advice - I’ve been cooking dinners and preparing lunches for my parents to take to work, which is low effort and enjoyable but still feels purposeful. \n\nI haven’t picked up a book yet. I’d like to, but it feels like a lot of effort at the moment.",
          "author": "croissant530",
          "created": 1567782014,
          "upvotes": 5,
          "replies": {
            "ez9o62o": {
              "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9o62o/",
              "text": "The book one actually came on the advice of a neurologist I had years ago. (I had a health issue that had mostly cleared up but that we knew, one, would go away faster if I read but, two, would make reading feel like a chore.) He specifically recommended poetry and short stories...get the language part of the brain feeling good without wearing it out.",
              "author": "dcgrey",
              "created": 1567786350,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ez92ova": {
      "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez92ova/",
      "text": "I submitted my thesis almost a year ago and only three days ago have I allowed myself to relax, by buying a new computer to play games on (I had donated my old one to my parents to focus on my work). It takes time and you have to work on it. I recommend trying out things that were hard to do without feeling guilty during your PhD. Personally I took an adjunct role and started learning Mandarin and going back to the gym regularly.",
      "author": "needlzor",
      "created": 1567771026,
      "upvotes": 7,
      "replies": {
        "ez9h1nj": {
          "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9h1nj/",
          "text": "Thanks :) getting back into my exercise routine is a priority. I’ve been running twice this week, slowly, but I did it!",
          "author": "croissant530",
          "created": 1567782092,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ez92ylc": {
      "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez92ylc/",
      "text": "[deleted]",
      "author": null,
      "created": 1567771292,
      "upvotes": 7,
      "replies": {
        "ez9hjx1": {
          "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9hjx1/",
          "text": "This is good advice. I think I might book in for a massage. I have been dreaming about being in one of those flotation tanks to switch my brain off.",
          "author": "croissant530",
          "created": 1567782434,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ez9ahkk": {
      "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9ahkk/",
      "text": "You have worked on this sucker for G-d knows how long (years and years) and now suddenly don't have it anymore. In a weird way, that's a loss. This thing that occupied so much of your time, energy, and head space, is well...at least for the time being, gone (until you get revisions). I think you're feeling the effects of a let down, a very anti-climactic let down, and are now learning how to be with yourself and in your head, sans dissertation.\n\n&#x200B;\n\nTotally normal. And, I would try to push yourself a bit to re-define yourself outside of academia. Perhaps try to find the things that you once upon a time enjoyed. For me, post dissertation, I tried baking again and it's the thing I return to when I know I need to separate myself from all the manuscript writing. Don't let your work define you, YOU define you.",
      "author": "amyelizabethellis",
      "created": 1567777491,
      "upvotes": 7,
      "replies": {
        "ez9hfkg": {
          "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9hfkg/",
          "text": "It was super helpful to read this, thank you. I think the loss of identity is something I’m really struggling with, or certainly am going to struggle with. I’m leaving academia to work in finance and the thought of redefining myself in the ‘real world’ is quite scary. It feels like there are so many options that making a choice feels scary. I’m sure I’ll work it out, but it’s a big step and it’s hard to wonder if you’re making the optimal choices. \n\nI’ll continue thinking about this process as ‘learning to live with myself and be in my head’ - the last few days I have been so overwhelmed with negative feelings that it’s hard to retain control of your sense of self. I have also been playing the piano a lot more, not as much as I would like because I don’t have the energy, but it’s something that feels like pure enjoyment for once.",
          "author": "croissant530",
          "created": 1567782353,
          "upvotes": 2,
          "replies": {
            "eza3nku": {
              "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/eza3nku/",
              "text": "Heck yeah, there's so much about identity in this. We move from identifying as a student, to now identifying as a professional. From a follower (just do the work) to a leader (initiate the work). We're on our own! It's enough to induce a mid-life crisis, regardless of our age.\n\nI'm in psychology, so a bit different than finance. But I felt incredibly overwhelmed and anxious when I realized that I was working under my own license, and had nobody to count on anymore. It was safe and secure to know I could fall back on past supervisors or bosses. That the buck did not stop with me. And then, on my own,there were so many decisions and options, all of them with a glaring warning sign of \"Don't F- up.\"\n\nYou are about to get real intimate with yourself. You'll get to know your brain when it's silent, peaceful, and is in a state of just being. That's cool in theory, and scary in practice. Hang in there, I promise it gets easier. If it's one thing I've learned, it's that life is a series of \"leveling up.\" You've beat the thesis level, now you're off to the \"adulting in the professional world 101\" level. You'll prosper, I'm confident. And just when you think you've mastered that...life will throw something else. But hey, that's what communities, friends, and support is for, right?",
              "author": "amyelizabethellis",
              "created": 1567794381,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ez9gtl9": {
      "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9gtl9/",
      "text": "I collapsed for like a month after mine and was utterly useless. It is incredibly normal.",
      "author": "sirophiuchus",
      "created": 1567781946,
      "upvotes": 3,
      "replies": {
        "ez9hl6g": {
          "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9hl6g/",
          "text": "Thank you :)",
          "author": "croissant530",
          "created": 1567782457,
          "upvotes": 2,
          "replies": {
            "ezkv6jd": {
              "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ezkv6jd/",
              "text": "No problem. It's such a crash; all the adrenaline and mental effort and focus that's keeping you going suddenly has nothing to do. I hope you start feeling better soon.",
              "author": "sirophiuchus",
              "created": 1567967103,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ez92ps4": {
      "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez92ps4/",
      "text": "Very normal, just do the best you can for now & realize you'll come back online later. Believe it or not, but a long time from now, you'll actually laugh thinking back about all of this.",
      "author": "Bubba10000",
      "created": 1567771049,
      "upvotes": 2,
      "replies": {
        "ez9gzd3": {
          "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9gzd3/",
          "text": "Thank you :)",
          "author": "croissant530",
          "created": 1567782050,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ez9wkuo": {
      "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/ez9wkuo/",
      "text": "Same here too. I cried and ate too much candy. My body doesn't respond well to being less stressed, I guess.",
      "author": "whyisthatyourhair",
      "created": 1567790827,
      "upvotes": 2,
      "replies": {}
    },
    "eza1589": {
      "link": "/r/AskAcademia/comments/d0en98/i_submitted_my_thesis_and_i_feel_horrendous/eza1589/",
      "text": "Seems normal. I watched all seasons of breaking bad in around two weeks. I had highs and lows. It was a recovery process I needed.",
      "author": "Extreme_Pomegranate",
      "created": 1567793183,
      "upvotes": 2,
      "replies": {}
    }
  }
}