{
  "sid": "p97i06",
  "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/",
  "title:": "I can't write proposals. Should I leave?",
  "text": "Hello fellow academics!\n\nLittle background: I'm at the end of year 3 of my postdoc at a national lab in the US after a PhD in Europe in a STEM-field with a decent publication track record. To make the step to a faculty position my understanding is that it is important to secure grants, but for the life of me I just can't seem to write them. Writing papers does not come easy to me, but eventually I do manage to get words down on paper. For proposals not so much. I feel being a PhD/postdoc taught me how to do research, but not really how to write a grant proposal.\n\nI am supposed to be submitting a proposal in a little over a week and have barely anything. I scheduled a number of days to work on this well in advance, but ended up literally just staring at my screen every damn time. Now I feel I am too late to produce anything that will pass the bar and I feel I let my collaborators down. On one hand I want to give up on the current proposal altogether, but I feel this would let my collaborators down even more.\n\nAt this point I'm even wondering if it makes sense to stay in academia if I so vehemently dislike one of the main things that I would be expected to do the rest of my career. Of course there is always self-doubt of whether I'm good enough to 'make the cut' to stay in academia, but I wonder if my inability to produce a proposal is an indication that perhaps this line of work might just not be for me. Should I stay to improve my skills in the face of adversity? Or should I cut my losses and find a job where writing proposals is not the main part of the job? \n\nSo curious to hear from you...\n\n* How do you transition from paper-writer to grant-writer?\n* What are your best practices for writing a (successful) proposal? \n* How do you deal with a lack of ideas when the submission deadline is looming?\n* Is this a plain lack of experience or am I just not cut out for the job?\n\nThank you",
  "author": "scholaragorn",
  "created": 1629613460,
  "updated": 1634079523,
  "over_18": false,
  "upvotes": 62,
  "upvote_ratio": 0.96,
  "comments": {
    "h9vtqj4": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9vtqj4/",
      "text": "Proposal writing is very important, that's true. You get better at it with time, so don't be so hard on yourself.\n\nSo if you have a topic about which you're truly excited, chart the course for the next 3 years of things that would ideally want to do. Then you need to cut this down to a coherent program that fills the three years with work that makes up a meaningful package (all bits need to be necessary and contribute to the goal, none of the work must be kept 'hanging' or seem optional -- this is the tricky bit of proposal work package design), and in the end many of the text blocks are not so radically different from what you know from writing a paper.\n\nWhat is super helpful is having a (successful) grant proposal as a template. I always give people in the lab one of those, this makes it all seem so much more attainable, and we've had a very, very high success rate.\n\nIf you find budgets and Gantt charts daunting: I don't know anyone who likes those, they are pretty mind numbing. Just got to get through that...",
      "author": "Matthias_Rillig",
      "created": 1629615549,
      "upvotes": 35,
      "replies": {
        "h9wqxix": {
          "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9wqxix/",
          "text": "I just finished my first ever proposal writing during the last few months so hopefully this will be useful. \n\nYes. You read a good proposal and you’ll have some idea what a proposal will look like! The language used in papers and proposals are different. Papers are “past tense” and proposals are “future tense” you are describing what hast not yet happens but trying to illustrate the big impacts and draw reviewers attention. \n\nThe other thing I wanted share is that a lot of times the reviewers are not necessary the expert in your field. Therefore your language in proposal need to be tuned so that general scientific background of ppl would understand. This is something I started to understand more when I became a reviewer of DOE proposals…if I cannot understand the goal within reading the first two pages I became very frustrated (I was also super busy during that period of time, and reviewers could only be busier). So I’ll say it will be a good idea explaining your proposal to someone outside of your field and get some feedback. In the end of the day it’s more like the act of salesperson (shark tank?!) instead of a researcher. \n\nFor new ideas. This is something challenging! I asked a friend he thrives in national lab. His answer is very straightforward: think about new ideas every day. It could be when you just watching TV shows for fun and you suddenly think of: hey why don’t the main character have a water filter powered by li ion battery? Crazy fragments of idea are ok but just keep your brain thinking about something new. \n\nDigging out review papers is a good way. There’s one time my advisor wanted to start researching something new, like none of us touched this field before. So 10 of us (scientists, postdocs, grad students) organized a study group and every week we take turn talking about what we learn from review papers for certain key words. This activity lasted 6 months or so, and turned into a 20 page proposal.",
          "author": "rietveldrefinement",
          "created": 1629640498,
          "upvotes": 7,
          "replies": {}
        },
        "h9vump5": {
          "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9vump5/",
          "text": "Thanks for the reply. What if I don't have anything I'm particularly excited about? I feel this might be part of the problem; I'm submitting a proposal just because there is a funding opportunity that I shouldn't let go to waste, not necessarily because I think I have a great idea. I hear many  senior staff around me say that you should always submit *something...*",
          "author": "scholaragorn",
          "created": 1629616259,
          "upvotes": 5,
          "replies": {
            "h9vvg8v": {
              "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9vvg8v/",
              "text": "Well, always having something submitted is basically good advice (especially with the generally low funding rates in the US). But you should still find some aspect of the topic interesting (if it is in response to a specific call, not a blue-skies proposal), because why else would you write a proposal? It's so much work to write one of these things.\n\nAnd yes, if you're not particularly excited about anything in your field, this will be difficult, because it's this excitement that typically keeps people going.... :) Perhaps this is just a temporary feeling.",
              "author": "Matthias_Rillig",
              "created": 1629616916,
              "upvotes": 11,
              "replies": {}
            },
            "h9wkf3f": {
              "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9wkf3f/",
              "text": "Do you really have no ideas? Or just no ideas that you think are worthy? \n\n\nIf it's the former, maybe this is not for you. If it's the latter, then we are dealing with imposter syndrome. Remember that the process of writing is where we turn bits and fragments of thought into a meaningful argument.",
              "author": "blue_pez",
              "created": 1629636980,
              "upvotes": 9,
              "replies": {}
            },
            "h9wc0jp": {
              "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9wc0jp/",
              "text": "It's work, you don't need to be excited about it. It needs to help you move your operation/research forward. We don't a love every element of what we do. Make sure it's inline with your organization/research objective. Write in a coordinator position and hire someone who is passionate. This will help you both out.",
              "author": "Ok-Refrigerator-2432",
              "created": 1629631184,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "h9w3nsh": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9w3nsh/",
      "text": "In contrast to many people here I will say this, and I probably get downvoted to hell but I want to paint a more critical picture:\n\nIf you really hate writing, than you should consider leaving academia. The writing and more important the successful writing will be one of the most important aspects of your future. The more you rise in the ranks the more writing you will have to and you immediate future will depend on it. I agree things can be learned and you might get better at it, but if you really dislike it I will say you will  never come to that point where its good enough to keep you going in the highly competitive academic landscape. Its not a shame not everyone is good at those things and there is a whole interesting world out there that is not academia.\n\nI hate writing, I am really really bad at it. I knew with this I would start to hate academia at some point when I am confined to doing something I absolutely dislike. I now work in a medium sizes company and do R&D.  So think long and hard if you take up the fight and go try it but keep in mind if you are just no good at it, so be it there is something else out there. However, do not believe that as \"shitty\" writer much success will wait for you in academia.",
      "author": "CreepyBumblebee31",
      "created": 1629623983,
      "upvotes": 21,
      "replies": {
        "h9xd8rs": {
          "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9xd8rs/",
          "text": "Well I'm not downvoting this. Grant writing was the final nail in the coffin of my TT career. Unlike OP I didn't struggle with writing grants, but I absolutely hated it, I hated the feedback and I absolutely loathed the fact that as a combined cohort scientists were putting in thousands of work hours into writing these proposals, of which at least 85% go in the bin. That to me was almost a crime against the tax payer. I left academia for another career, although somewhat ironically ended up doing that career at a research institute where I'm now a senior manager and occasionally writing grants again (although it feels very different now). \n\nI definitely would not recommend staying in academia if you hate writing grants as that is probably the single biggest occupation of your time as you get more senior, behind teaching. Furthermore, they worryingly say they don't have any ideas. That's an absolute pre-requisite for any career in academia and once you've been in academia for a few years post-PhD, you're going to be expected to come with some research ideas even if you stay relatively junior.",
          "author": "ACatGod",
          "created": 1629650466,
          "upvotes": 10,
          "replies": {
            "h9ya04x": {
              "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9ya04x/",
              "text": "I feel you also the fact they might just reject you because the question you seek to answer is not the one they want to have answered or is currently not “trendy “ enough. The system grant funding is one of the big reasons I left. Not worth my pain.",
              "author": "CreepyBumblebee31",
              "created": 1629664703,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ha23aqw": {
          "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/ha23aqw/",
          "text": "I agree that hating writing isn't the best outset for success in academia, but it matters more in some disciplines and less in others.\n\nYou could be a paradigm-shift-level genius and still write slow or suck at it compared to others. I don't know how fast Newton or Darwin wrote (or if they enjoyed it), but sometimes people just come up with smart things that aren't necessarily linked to writing. \n\nBut, in many disciplines, writing is an integral part of doing science. Historians who don't write aren't historians. But, maybe some super brain in CERN can split atoms without writing about it themselves.",
          "author": "molobodd",
          "created": 1629740676,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9w0er2": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9w0er2/",
      "text": "It is a separate genre. A research paper reports back in time, what you have done, while a grant application describes the future.\n\nHowever, **one mistake many people do is that they are too vague about that future, especially regarding the details of METHODOLOGY.** Think of it as if you had already conducted the study and described exactly how you did it. That level of specificity about the future is often necessary.\n\nAnother related concern is how **REALISTIC** your proposal is. How do you know that it is feasible? (Pilot? Similar to what you have published earlier?) If you describe a project that would need twice as much money, you are not realistic, and won't get any money.\n\n**IMPORTANCE is often taken for granted** in proposals. That you find something interesting isn't enough. That you can point to the need for further research isn't enough. Your reader has to refuse 9 out of 10 applications, which all claim to be important. Why is your project more important than the others, or at least top 3?\n\n**Write for generalist, NON-EXPERTS**. Some of your readers will not have detailed knowledge of your specific research area. They may not even be in your field. They too need to understand your proposal broadly, and why it is important.",
      "author": "molobodd",
      "created": 1629621096,
      "upvotes": 18,
      "replies": {}
    },
    "h9vyz59": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9vyz59/",
      "text": "The more you advance in academia, the more important it becomes. Depending on your field and institution, it may not be *everything*, but still, you should show enthusiasm and willingness by applying for grants (even unsuccessful bids can get a mention in your CV).\n\nAt least in Europe, universities offer masterclasses and ongoing support for research grant proposals. I will be very surprised if American institutions don't do that. That might be a good place to start. \n\nIf not, then try to find successful proposals from last year's iteration of the same—or similar—call. This might be trickier, but some research foundations allow individuals/institutions to request them. If that is not the case, then either ask within your institutions or any colleagues that you feel close to.\n\nBefore applying to be a PI in projects, join other consortiums (if that is a thing over there) or be the co-applicant in a few proposals. Your involvement in the writing will vary (as a co-applicant in Horizon proposals, I did as little to write a few lines for a task to as much as 30+ pages of content), but will nonetheless help you learn how to write a grant application. \n\nPS: I wouldn't worry about the admin things, like budgets. Again, most institutions have people dedicated to preparing them for you.",
      "author": "RecklessCoding",
      "created": 1629619867,
      "upvotes": 6,
      "replies": {}
    },
    "h9wsjcy": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9wsjcy/",
      "text": "Did you also say that you work in a national lab? I don’t know your exact field but have you considered being a researcher in a national lab? At least what I see is that people write proposals in groups (engineering fields, not bio) . There will be a lead contributing the main new ideas. Another two of three contributor to the technologies necessary to make this proposal work or to complement the leaders skill sets. So you don’t work on the whole proposal on your own. And being a contributor allows you to learn from experienced people. \n\nMaybe this is a route you can consider.",
      "author": "rietveldrefinement",
      "created": 1629641290,
      "upvotes": 4,
      "replies": {}
    },
    "h9w1ngt": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9w1ngt/",
      "text": "I am by no means an expert proposal writer, I have only written two, one of which was successful! BUT what I have learned... \n\n1) feedback feedback feedback \n\n2) find out how these proposals are evaluated. On the funding body website, is there a section for how this proposal is evaluated? If so, make sure that you make it easier for the evaluators by maybe using similar language so they can easily identity the info that they are looking for. Also, make sure that you answer everything clearly that the is in the evaluators form.\nE.g., if section a) of the evaluators form says the candidate should make known these five things in relation to the project, make sure you answer those. \n\n3) Proof! Try to not have a bunch of adjectives without info to back them up e.g., 'I am amazing so I should get this funding' vs. 'I am amazing bc I have a proven track record of dissemination of finding incl.  x, y, z, publications so my project should get this funding'. \n\n\nAlso... Just start to write!! Even if it's just bullet points initally. Make sure to allow time to get some feedback from colleagues. There's nothing wrong with asking for help!",
      "author": "coscos140321",
      "created": 1629622181,
      "upvotes": 3,
      "replies": {}
    },
    "h9wbsj1": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9wbsj1/",
      "text": "So luckily grant rfps tell you what they want to know. \n\nGenerally it's the problem, the goal/impact, deliverables (including timeline), and budget.\n\nThey want to know the money will be useful. I've mostly written state grants, not NSF (oy 2 rejected NSF). I found NSF want regional impact or lots of collaboration. If you can show you have substantial and reliable network to access, I would think it'd impact your success rate.\n\nAlso you don't need to say too much, just enough. Don't make too many promises and speak with a pseudo broad stroke.\n\nFinally, look up previous awardees. See how much was awarded and gauge the scope of projects -  look up 990s for foundations of the record isn't easily found.\n\nGood luck and remember  that success rate for grants is about 1:4, for every four you wrote you would most likely get 1 (maybe).",
      "author": "Ok-Refrigerator-2432",
      "created": 1629631009,
      "upvotes": 3,
      "replies": {}
    },
    "h9x3byk": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9x3byk/",
      "text": "Don't put too much blame on yourself. It's the hard and not-fun part of a great job for most PIs.   Also, you really have to learn the exact culture of each agency you are proposing to.    A typical funded NIH proposal would probably go down in flames at NSF and vice versa.  Study as many examples of successful proposals as possible and, importantly seek and follow feedback from colleagues, especially those who are in neighboring disciplines to yours who have been successful with your target agency.\n\nFinally' you have to strike this mysterious balance between innovative new ideas (risky but cool) vs. incremental progress (boring, but high chance to move the field ahead a little bit).  The best proposal ideas I've had are the ones where I actually can't figure out which of those two categories it belongs in!",
      "author": "blakehannaford",
      "created": 1629646238,
      "upvotes": 3,
      "replies": {}
    },
    "h9w2wz5": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9w2wz5/",
      "text": "I see two separate issues here. First, a lack of writing experience. Second, a lack of ideas. The first is something that literally everyone struggles with in the beginning, so, that's nothing to worry about. The second varies more between different people, some bubble with ideas, some have an occasional idea, and some never have ideas. If you never have ideas, that might indeed be a problem.\n\nWhen you write papers, do you normally have own ideas, or do you mostly execute other people's ideas?",
      "author": "ColourlessGreenIdeas",
      "created": 1629623312,
      "upvotes": 2,
      "replies": {}
    },
    "h9xhh84": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9xhh84/",
      "text": "There are grant writing courses. Look for one.",
      "author": "MomentSpecialist2020",
      "created": 1629652270,
      "upvotes": 2,
      "replies": {}
    },
    "h9vwpc0": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9vwpc0/",
      "text": "What do you hate about it?  Don’t you ever get excited when you think if future experiments and possibilities?  Just funnel that enthusiasm into writing proposals, as if you were writing a friend to tell them all the cool stuff you’re going to do.\n\nThen go back and add the obligatory references after the fact.  \n\nYou are kind of screwed if you can’t play this game.  A week is plenty of time.  You have ideas, right?",
      "author": "DesertAlpine",
      "created": 1629617958,
      "upvotes": 3,
      "replies": {}
    },
    "h9whdvy": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9whdvy/",
      "text": "There are jobs in academia that are not at research universities where the grant expectations are much lower if any.  At my regional university, grants are strongly encouraged in STEM, but everyone is not funded.  And of those funded, they are not all traditional research grants.  For example, they have several large grants that provide funding for under represented students to pursue STEM degrees or to provide STEM training to K-12 teachers.",
      "author": "manova",
      "created": 1629635062,
      "upvotes": 1,
      "replies": {}
    },
    "h9wiaki": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9wiaki/",
      "text": "where are you located?",
      "author": "04221970",
      "created": 1629635657,
      "upvotes": 1,
      "replies": {}
    },
    "h9wn67i": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9wn67i/",
      "text": "Never written one myself  but a friend asked me to help him with his grant.\nThere are tons of resources (instructions) online plus a few books published on this topic. \nI once had a friend who would review thesis etc for quality and correctness of English language. So that part can be taken care of as well.\n\nOther than that..I believe that every piece of document has some format, templates, do's and dont's. When it came to research articles, I could never wrap my head around how people wrote entire papers. But my mentor had a video tutorial that he made us watch and that made everything so easy .",
      "author": "1SageK1",
      "created": 1629638549,
      "upvotes": 1,
      "replies": {}
    },
    "h9xcy6j": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9xcy6j/",
      "text": "Why can't you write proposals?\n\nIf you can't write proposals because you hate designing a good research project, or are incapable of designing a good research project, then, yeah, you probably should leave academia.\n\nBut if you're good at designing research projects, and you enjoy that work, then you probably should stay in academia, even if you do feel uncomfortable writing proposals.\n\nProposals have two elements: (1) the research plan; (2) the reasons the funder would want to fund it. If you feel intimidated with the writing, perhaps you might be able to make progress just by focusing on developing and refining the research plan for the project: what are you going to do? Why? How?\n\nMost writing gets easier with time and practice.  If you get this proposal filed, writing the next one will feel easier because you'll have a better sense of what to put in.",
      "author": "ThoughtClearing",
      "created": 1629650342,
      "upvotes": 1,
      "replies": {}
    },
    "h9xm04t": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9xm04t/",
      "text": "Just write one and submit the thing. Borrow a template and do the best you can, and give yourself a set number of hours to write the thing so you don't waste too much time. You'll get rejected, but you should get feedback from the panel on where you failed. Then you can revise and submit again. Proposal writing is unfortunately a numbers game, so learning how to write efficiently -- and not care too much if it's not 100% perfect -- is good. I've written big proposals in a couple of days using this approach.\n\nIf you can co-write the proposal with your collaborators you should. Learn from them.",
      "author": "PROPHYLACTIC_APPLE",
      "created": 1629654199,
      "upvotes": 1,
      "replies": {}
    },
    "h9zb5rk": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/h9zb5rk/",
      "text": "Successful grant writing takes quite a bit of practice. That's frustrating, but honing your skills in competitive pursuits is like that. \n\nBeing co-PI with someone who has had success is a really helpful thing to do. They can show you what needs beefing up, and what to ignore. \n\nA lot of granting agencies offer grantsmanship courses or workshops with program managers that give you a lot of insight into what will work.\n\nWith a week to go, I'm usually doing final revisions of the budget to correct for the discrepancies the accountant in the grant office found, getting that last letter of support from the person who promised to send it a month ago, and working with a co-PI to get the management plan realistic.",
      "author": "IkeRoberts",
      "created": 1629682271,
      "upvotes": 1,
      "replies": {}
    },
    "ha02vit": {
      "link": "/r/AskAcademia/comments/p97i06/i_cant_write_proposals_should_i_leave/ha02vit/",
      "text": "Are you me? I made a throwaway to make a similar question and saw this. I am also a postdoc at the third year and thinking of leaving academia because I really struggle with coming up with ideas. I think I am not really cut out for it.\n\nThank you OP for posting and the people who answered for giving useful comments. Best of luck, whatever you decide.",
      "author": "lostresearcher25",
      "created": 1629698385,
      "upvotes": 1,
      "replies": {}
    }
  }
}