{
  "sid": "oocxkl",
  "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/",
  "title:": "Those who have left: which struggles did you take with you and which did you leave behind with academia?",
  "text": "I'm a STEM PhD shifting out of academia after a number of postdocs.\n\nAlong with it being a good opportunity, I'm hoping a change of industry will also change up a few things I struggle with postdocing:\n\n\\- Looong timelines & no regular acheivements\n\n\\- anxiety about not doing enough, which makes me less productive, which compounds things\n\n\\- imposter syndrome (it's bad, and actually I believe truly warranted, which is classic imposter syndrome ha)\n\nI have achieved a fair bit, published reasonably, enjoy my lab group, but I'm not top of the game by any means.\n\nThose who have moved out of academia or have experience outside, did a change of environment make a difference to these kind of things for you (e.g. more team focused, shorter timeframes,less need for great ideas),  or am I just an anxious person with low self esteem and will take that along with me?\n\n&#x200B;\n\nAny thoughts?\n\nEDIT thanks everyone! Great to hear your experiences, and confirms what I'm expecting. I think those of us who feel badly impacted by imposter syndrome and the like should all be prioritising some form of work on that through therapy/ mediation. Good luck out there!",
  "author": "Haikuramba",
  "created": 1626820816,
  "updated": 1634081266,
  "over_18": false,
  "upvotes": 149,
  "upvote_ratio": 1.0,
  "comments": {
    "h5xvjbb": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5xvjbb/",
      "text": "I left academia a year ago, and I am pretty content. Here is what I do not miss: \n\n- Bad work life balance. \n- Always feeling like I cannot take vacations longer than 48 hours because of my model organisms. (And my boss. She never took vacations so we never felt like we could.)\n- Feeling like I have to reinvent the wheel constantly. \n\nWhat struggles have I taken with me? \n\n- Imposter syndrome. Guess that is a forever problem. \n- Managers that have no training in management. It isn’t just a PI problem. \n\nCareers are complicated. I am not sure I could not have succeeded in academia. But I am happier outside of it.",
      "author": "Bookwyrm752",
      "created": 1626826359,
      "upvotes": 92,
      "replies": {
        "h5xxz7d": {
          "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5xxz7d/",
          "text": "Thanks, that's helpful.\n\nYep and sounds like about what I'm expecting. Luckily I have been in the position to take vacations, but always seem to take work along with me (mentally if not physically).\n\nMight start working on brain exercises to try and get a handle on the imposter syndrome though..",
          "author": "Haikuramba",
          "created": 1626827556,
          "upvotes": 13,
          "replies": {
            "h5y6nu2": {
              "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5y6nu2/",
              "text": "I suspect you have the right idea. I have been told by many that meditation or at least some sort of mindfulness really helps. I suspect we should all do more!",
              "author": "Bookwyrm752",
              "created": 1626831771,
              "upvotes": 7,
              "replies": {
                "h5z44gi": {
                  "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5z44gi/",
                  "text": "Meditation helps, but therapy is the way! Said from a PhD at his last year who got rid of his impostor’s syndrome.",
                  "author": "deecadancedance",
                  "created": 1626851435,
                  "upvotes": 9,
                  "replies": {
                    "h5zwmea": {
                      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5zwmea/",
                      "text": "Three times the charm! I'll investigate, thanks :)",
                      "author": "Haikuramba",
                      "created": 1626871713,
                      "upvotes": 2,
                      "replies": {
                        "h606bd5": {
                          "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h606bd5/",
                          "text": "Oopsie! Buggy app I guess",
                          "author": "deecadancedance",
                          "created": 1626876549,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h5ymhz8": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5ymhz8/",
      "text": "I left academia after my post doc and the change is only positive. Better pay, better work life balance, better lab equipment and infrastructure. The variety of projects that challenge you beyond your field of expertise. I still work mostly on my own schedule but have only 40h weeks and it’s really enough to get things done. The biggest change for me is a fixed contract I no longer worry to loose my job all the time and if a project does not work I start something new.",
      "author": "CreepyBumblebee31",
      "created": 1626839546,
      "upvotes": 27,
      "replies": {}
    },
    "h5y804k": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5y804k/",
      "text": "I went to industry right after my PhD as I wanted to achieve a fire lifestyle. I loved working in consulting and the pay was great but came with high stress. The best thing was that I was able to retire early as I became financially independent. I came back to academia (teaching) which I love. I’m happy with the choices I made.",
      "author": "algebragoddess",
      "created": 1626832407,
      "upvotes": 52,
      "replies": {
        "h5ydkqt": {
          "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5ydkqt/",
          "text": "This is really interesting! Would you mind answering a few questions? \n1. Did you get a consulting job right out of your PhD? If yea, how did you search for it? I think consulting is something that I might find most interesting in industry (I'm currently a postdoc in academia). \n2. How in heck did you get a teaching job coming from industry without a postdoc, which I see as a requirement on most R1/2 faculty jobs I see lately? I would feel better about trying out industry if I knew I had some chance of getting back to academia (which I do enjoy, but maybe I might like industry better?). \n\nThanks!",
          "author": "nihan_shot_first",
          "created": 1626835102,
          "upvotes": 12,
          "replies": {
            "h5yex1v": {
              "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yex1v/",
              "text": "1. Yes, I had interviews for academic positions as well as industry jobs as location was important to me. I did get a tenure track offer from an R1 university but my PhD advisor was supportive when I turned it down for the consulting job in my city of choice.\n\n2. I kept in touch with my PhD advisor and even during my consulting years, I went back one semester to teach a class to see if I liked it. When I hit my fire number in saving and investments, I reached out to my advisor and another R1 university about coming back as teaching faculty. \n\nIf you look at teaching positions, they don’t require post docs (at least in my field). My work experience was more important as I teach finance/data science classes. I’m happy as it’s full time on paper (with health insurance etc benefits) but I get to pick my hours so I only teach 2 days a week and get summers off. It works for my lifestyle and I’m stress free (most of the time). Good luck!",
              "author": "algebragoddess",
              "created": 1626835777,
              "upvotes": 31,
              "replies": {
                "h5ygezw": {
                  "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5ygezw/",
                  "text": "If you don't mind sharing, how many years did it take for you to get to fire with your consultant income?",
                  "author": "chillzxzx",
                  "created": 1626836533,
                  "upvotes": 7,
                  "replies": {
                    "h5yh0m0": {
                      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yh0m0/",
                      "text": "10 years but I had invested in some tech companies (google and Apple) with my fellowship and award money during grad school which helped reach my fire goal.",
                      "author": "algebragoddess",
                      "created": 1626836843,
                      "upvotes": 11,
                      "replies": {
                        "h5yi6xt": {
                          "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yi6xt/",
                          "text": "Amazing! As well, was money the reason why you went into consultant despite loving and having the opportunity to teach after your PhD?",
                          "author": "chillzxzx",
                          "created": 1626837431,
                          "upvotes": 6,
                          "replies": {
                            "h5yjcgu": {
                              "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yjcgu/",
                              "text": "It was location and the fact that I really like teaching (much more than research) and teaching alone doesn’t pay a lot straight out of the PhD program. I figured I would first become financially independent and then come back to my true love (teaching).",
                              "author": "algebragoddess",
                              "created": 1626838012,
                              "upvotes": 12,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "h5yihgv": {
                  "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yihgv/",
                  "text": "That's awesome, good for you! And thanks for replying! I'm in Physics so your path isn't probably going to work as well for me (as far as I can tell), but if I do decide to switch to industry, will definitely give consulting a shot.",
                  "author": "nihan_shot_first",
                  "created": 1626837579,
                  "upvotes": 3,
                  "replies": {
                    "h5yismh": {
                      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yismh/",
                      "text": "Good luck!",
                      "author": "algebragoddess",
                      "created": 1626837736,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "h5ykjfw": {
          "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5ykjfw/",
          "text": "I feel like your success is the sort of smooth career progression that makes people want to get PhDs. The fact that you were able to get a tenure track offer right away sounds very field specific and probably explains partially why you were able to return to academia. This is 100% not the norm, which you definitely seem to understand, but this probably won’t work out for the OP or anyone else else reading this. \n\nI am in Biology, but I know a diverse range of PhDs, including people who went into consulting from various STEM fields and I am absolutely sure none of us could come back and teach after leaving. I am now in education at the HS level, which is a totally different beast, but for college level jobs, especially tenure track ones, there are absolutely not enough jobs to go around and anyone who leaves academia should accept the possibility that they are not going to be welcomed back. \n\nOn a separate note, consulting is not for everyone. People I know either love it or burn out in less than 5 years. Kudos to you for sticking it out.",
          "author": "Bookwyrm752",
          "created": 1626838609,
          "upvotes": 14,
          "replies": {
            "h5ymaqu": {
              "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5ymaqu/",
              "text": "PhD is not for everyone and life and career are not linear processes. \n\nI tell my graduate students to apply for private sector jobs as well as not everyone will get a tenure track or post doc offer. I advice all incoming PhD students to build skills that are transferable to industry jobs (python/big data skills). Tenure track offers are very hard to get in my field and it’s always good to have options when you are on the job market. The reason why I was able able to get a job teaching in an R1 university is probably because I have very niche skills that are in demand and students flock to take my class. I have been told I make math and writing algorithms fun!😊",
              "author": "algebragoddess",
              "created": 1626839443,
              "upvotes": 10,
              "replies": {
                "h5zo2wj": {
                  "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5zo2wj/",
                  "text": ">I have been told I make math and writing algorithms fun. \n\nThen the education field badly needs you!",
                  "author": "Bookwyrm752",
                  "created": 1626866278,
                  "upvotes": 2,
                  "replies": {
                    "h60qi4l": {
                      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h60qi4l/",
                      "text": "You made my day!😊",
                      "author": "algebragoddess",
                      "created": 1626885199,
                      "upvotes": 1,
                      "replies": {
                        "h60r2s0": {
                          "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h60r2s0/",
                          "text": ":) Someone recently told me chemistry is where fun and inquiry go to die. I am taking that as a dare, rather than an insult.",
                          "author": "Bookwyrm752",
                          "created": 1626885440,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "h5zd0g1": {
          "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5zd0g1/",
          "text": "I'm also a PhD interested in getting a consulting job. \r  \n\r  \nRecently I've been looking at cases for consulting interviews, they are like riddles where one person knows the answer, and another person needs to figure out the answer by asking the right questions. I'm looking for people who would be interested to practice for interviews by switching the roles and preparing a case for each other. \r  \n\r  \nI'm going to make a Discord server to exchange case books and to coordinate the time, and if someone is interested to join, you can DM me for the link.",
          "author": "Loweren",
          "created": 1626856745,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h5yeoz5": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yeoz5/",
      "text": "I've only been working in industry for a month and a half (I currently work with defense), and over all it's been great.  I applied to post docs in my final year, but not that many, and I got no call backs (though looking back my heart wasn't in it given my two-body+ kid situation).  \n\n\\- Timelines: My own industry likes to keep to  40 hours and no more, though as a project nears its deadline (or so I've heard), one might have to put in something like 45-50 hours.  I honestly love this... projects here might take a few years (1-3 years), but people here work in decent sized groups (think 10-20 at a time) rather than just 2 or 3 of us at a time. I now have a much wider work circle, which I like.  There are also more veterans than just your advisor.\n\n\\- anxiety: I have a certain amount of it right now since my transition was a theoretical field to a very applied one,  but at least people here are pretty helpful and expect there to be an acclamation period.  Some places are rather fast paced,  but mine involves a good bit of red tape (which might be annoying to some, but it allows me to learn to be extra careful).  New ideas are welcome, but since we are making stuff for the military, safety is extra important, so innovation is more restrained.  I'm actually ok with that given my own work-life balance.  \n\n\n\\- imposter syndrome: I feel like I overcame it midway through grad school when I realized how everyone has it, and just accepted my general ignorance.  I now just ask questions all the time of the senior engineers, and they emphasize us newbies being unafraid to ask questions as well.",
      "author": "Lagrange-squared",
      "created": 1626835663,
      "upvotes": 14,
      "replies": {}
    },
    "h5yhxgt": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yhxgt/",
      "text": "I left academia after a post-doc five years ago. One of the best parts of working in industry is getting to work with people with completely different backgrounds and experiences. I have many colleagues with PhDs, but I also work with former nurses, marketing experts, engineers, and lawyers. I learn a new way of thinking every time I work with a different team. \n\nThe variety of work is great. And projects certainly change faster in industry. However, I was surprised at how projects even in industry can still take 4 or 5 years, but that will depend greatly on the place you go to work. Some industries have quick product development times. Others are slower than academia. \n\nThe thing I miss the most are the conferences. I still go to industry conferences and present work that I'm publishing, but it's just not the same. Especially because I switched fields. But, that really only impacts me a few times a year and it's a trade I'd make over and over again to not deal with the rampant sexism, to have better balance, more opportunities for professional variety and growth, and most importantly, being able to see the impact of my work.",
      "author": "lurkerforlife27",
      "created": 1626837307,
      "upvotes": 32,
      "replies": {}
    },
    "h5yfiir": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yfiir/",
      "text": "I'm at a national lab functioning similar to a staff scientist in academia. I live off of soft money, write all my own proposals, am expected to publish, etc. I like it better than academia because I do have access to a decent amount of internal R&D money (which still requires winning proposals to access), but being mission driven helps me focus my research. At times it can feel frustrating, but I'm still given incredible latitude compared to people I know in industry. The hardest thing is money doesn't go nearly as far. For my own overhead I need to wrangle (or get wrangled into projects) of ~$350k/yr, and even our cheapest engineer is more expensive than a grad student. That said, I have access to world class experts with 30 years of experience on my teams, as well as being able to outsource to academia when we have a higher risk/more labor intensive R&D task.",
      "author": "racinreaver",
      "created": 1626836083,
      "upvotes": 10,
      "replies": {
        "h6336fl": {
          "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h6336fl/",
          "text": "I am also considering the switch to a career in a national lab. As a scientist, do you work within a group or do you hire your own researchers? How do you compare the proposal writing/fund chasing to regular TT academic appointments? National labs seem like a great  balance between academic and industry careers.",
          "author": "looking--back",
          "created": 1626923666,
          "upvotes": 1,
          "replies": {
            "h638t1s": {
              "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h638t1s/",
              "text": "Most scientists I know at national labs (my own as well as others) are pretty happy. Depending on your agency, you may or may not need to constantly chase soft money. It'll make a huge difference in your day to day life. Some places you act more as a contract/project manager for industry, while others you'll be doing lots of your own work. I have some coworkers who are members of a lab that acts like a service center, and they don't have to worry about proposals or fighting for funds. I'm part of a group where we all function as independent PIs putting in our own proposals, but we all are focused in materials & manufacturing technologies. Each has our own focus, and we also often serve as Co-Is or collaborators on projects.\n\nI work with a wide set of people around lab, mostly with thermal management (that's my focus), but also have collaborations with planetary protection, robotics, mission formulation, instruments, and a lot more. Being mission driven means I get exposed to some really interesting, deep problems I never would have known about otherwise.\n\nThe hardest thing is both a lack of tenure, so there isn't forever job security (though at least it's not promote or get fired), and I'm responsible for wrangling funding for my own salary. I'm PI for about 30% of my timecard, a Co-I for about half, and get hired in to other work on other projects for another 20%. It can be stressful when there's not enough work due to funding cuts (aka right now). That said, if I ever can't fill my timecard I could go do flight work...but I really don't want to do that.\n\nI'll say all of this is really dependent on where you work. There are feds at other centers who have solid job security and are guaranteed funding to do their research. There are also other places where their funding levels are 10x ours, so covering your timecard is easy. That said, I love what I do, and I believe in our mission. In the last decade or so I've probably averaged one paper (plenty more as a middle author) and one patent a year.\n\nMoney is better in industry, freedom is better in academia, but we get a really nice middle ground of both.",
              "author": "racinreaver",
              "created": 1626926877,
              "upvotes": 3,
              "replies": {
                "h63exro": {
                  "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h63exro/",
                  "text": "Thanks! Thats very insightful.",
                  "author": "looking--back",
                  "created": 1626930843,
                  "upvotes": 1,
                  "replies": {
                    "h63ial4": {
                      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h63ial4/",
                      "text": "Yep, best of luck! You also can build a great network at NLs, and if you ever want to bail I don't think it's usually too hard to find a job in industry. You have insight into their funding mechanisms and contacts on the inside to help build collaborations. I also know people who tended to have stronger publication records were able to make the jump back to academia.",
                      "author": "racinreaver",
                      "created": 1626933290,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h5yj5dv": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yj5dv/",
      "text": "After completing PhD I started my own company. Actually I established it while a grad student. I completed my PhD quite young. I was 26 yrs old. So I said hey if this doesn't workout I'll do a postdoc out go to the industry. The reason why I started my company was BC of money. Assistant Profs make 100k in my city and salaries go up to maybe 140k in 10yrs. A house within 1 h subway commute costs 1M. I just couldn't see myself being able to save a down payment with that salary within the time frame I wanted to buy a house and start a family.\n\nI know I didn't answer your specific questions. But wanted to give some context of how my life kinda panned out.",
      "author": "slowpokesardine",
      "created": 1626837910,
      "upvotes": 9,
      "replies": {
        "h5yk3ly": {
          "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yk3ly/",
          "text": "I was also considering this...even though it's much farther down the road. How long has it been since you established it and how is it going? Do you have a bit of advice from what you learned?",
          "author": "vaborbactam",
          "created": 1626838394,
          "upvotes": 2,
          "replies": {
            "h5ykyfm": {
              "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5ykyfm/",
              "text": "Its been 5 yrs since i completed my PhD. 7 since I started the company. It was going excellent until covid hit. We were routinely ranked among the nation's fastest growing companies. I think STEM PhDs could be exceptional at running businesses BC of their attention to detail, tendency to observe and frame hypothesise and then test them out and iterate. This makes them better at business execution, I'd say even more so than ppl who have business degrees. But business strategy needs to be developed. Ideally you find a co founder who has that skillset. Then most likely you'll have all bases covered.",
              "author": "slowpokesardine",
              "created": 1626838806,
              "upvotes": 7,
              "replies": {
                "h5ymo1r": {
                  "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5ymo1r/",
                  "text": "Thanks, this is very helpful info. I'm located in the U.S. but if I choose to start a company, I would have do so overseas as an expat. Based on your advice, after I get my STEM PhD finished, I think the best move is to find someone trustworthy who is skilled in management.\n\nI'm also sorry to hear about that, but do you have plans of restarting in the upcoming years whenever covid isn't as much of an issue anymore?",
                  "author": "vaborbactam",
                  "created": 1626839630,
                  "upvotes": 3,
                  "replies": {
                    "h5yn4s7": {
                      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yn4s7/",
                      "text": "Oh don't be sorry at all. Its picked up since. And getting better everyday. I never stopped the operation. We were eating our runway for bulk of last year. This year has been a breath of fresh air with sales increasing. We are in an industry that relies heavily on in person interaction at conferences and tradeshow and as they start happening again, our activities will increase. Most businesses were in survival mode.",
                      "author": "slowpokesardine",
                      "created": 1626839872,
                      "upvotes": 3,
                      "replies": {
                        "h5yndzl": {
                          "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5yndzl/",
                          "text": "That's great, I'm glad to hear that! I hope everything continues to go well for you guys moving forward. Thanks again",
                          "author": "vaborbactam",
                          "created": 1626840010,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h5z9o7s": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5z9o7s/",
      "text": "I left and didn't leave academia(!) several years back. I did a professional masters and was expecting to get a job in government or working for a funder, but an opportunity came up at an academic organisation which I took. So I'm still in academia but not an academic. \n\nI don't miss grant writing - the enormous waste of hours on producing excellent work that only stands a tiny chance of being funded. I don't miss the hours and I definitely don't miss the toxic culture of the US university I did my last postdoc at. \n\nI weirdly missed supervising students but having established an entire team in my new role I've had the joy of mentoring and bringing on really talented staff and I've rehabilitated a few from academia too. \n\nI've always had a sense in every job I've ever had that everyone else is doing better science/new job than me, and even now having really fought to establish and build this team I still look at other people doing the job in other orgs and think I don't do it properly. \n\nSomewhat surprisingly I do a lot more thinking in my new role than I did as a scientist and the first few weeks in the job I couldn't sleep because my brain was going nineteen to the dozen, but I've adapted to the pace. \n\nI have zero regrets about leaving the bench. I think I have achieved more and left a lasting imprint on my organisation in the last 5 years than I did in my 10 years as a scientist. My papers get cited every now and again, but there will always now be a team doing the function I introduced into the org and that team has ready been incredibly successful.",
      "author": "ACatGod",
      "created": 1626854158,
      "upvotes": 7,
      "replies": {}
    },
    "h5xkkzs": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5xkkzs/",
      "text": "Haven't been brave enough to quit, but I hear (and have seen) good things happen when people leave academia. Go for it!",
      "author": "Overall_Designer7502",
      "created": 1626821079,
      "upvotes": 12,
      "replies": {
        "h5xmt8t": {
          "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5xmt8t/",
          "text": "I'm hoping for this, but it's going to be a change! Thanks :)",
          "author": "Haikuramba",
          "created": 1626822130,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h60139v": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h60139v/",
      "text": "I've moved between industry and academia and ultimately retired early.  One big benefit to being a STEM person is we bring a fair bit of career capital to the table and can advocate for ourselves better than non-STEM people.\n\nEvery environment has its pros and cons.  As you suggest, some issues are internal things that we bring with us.\n\nI'd generally recommend that if you have an appealing opportunity outside of academia, and no irresistible opportunities within academia, take the industry offer and see how you like it.\n\nGet your personal life and finances in order as soon as possible, which will give you more options down the road.",
      "author": "TADodger",
      "created": 1626874056,
      "upvotes": 3,
      "replies": {}
    },
    "h60gu4v": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h60gu4v/",
      "text": "I left academia for a position in a Federal research group.  Best decision I ever made.  The pay is great, I’m working on really interesting projects that have real world applications, I get a healthy amount of leave, and I still teach as an adjunct (just one course at a time) because I want to do so.",
      "author": "Ocean2731",
      "created": 1626881152,
      "upvotes": 2,
      "replies": {}
    },
    "h5z9nko": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5z9nko/",
      "text": "I left and didn't leave academia(!) several years back. I did a professional masters and was expecting to get a job in government or working for a funder, but an opportunity came up at an academic organisation which I took. So I'm still in academia but not an academic. \n\nI don't miss grant writing - the enormous waste of hours on producing excellent work that only stands a tiny chance of being funded. I don't miss the hours and I definitely don't miss the toxic culture of the US university I did my last postdoc at. \n\nI weirdly missed supervising students but having established an entire team in my new role I've had the joy of mentoring and bringing on really talented staff and I've rehabilitated a few from academia too. \n\nI've always had a sense in every job I've ever had that everyone else is doing better science/new job than me, and even now having really fought to establish and build this team I still look at other people doing the job in other orgs and think I don't do it properly. \n\nSomewhat surprisingly I do a lot more thinking in my new role than I did as a scientist and the first few weeks in the job I couldn't sleep because my brain was going nineteen to the dozen, but I've adapted to the pace. \n\nI have zero regrets about leaving the bench. I think I have achieved more and left a lasting imprint on my organisation in the last 5 years than I did in my 10 years as a scientist. My papers get cited every now and again, but there will always now be a team doing the function I introduced into the org and that team has ready been incredibly successful.",
      "author": "ACatGod",
      "created": 1626854149,
      "upvotes": 1,
      "replies": {}
    },
    "h5zj4wm": {
      "link": "/r/AskAcademia/comments/oocxkl/those_who_have_left_which_struggles_did_you_take/h5zj4wm/",
      "text": "I'm thinking of quitting, one year into my PhD - it feels like I'm not achieving anything and that I'm squandering precious time. Sure, I've learned some lessons but the day to day nonsense by way of:\n\n&#x200B;\n\n* Terrible, procedure laden interactions with supervisors and the doctoral college\n* Awful UX of online systems\n* Uncertainty regarding COVID\n* Having to jealously guard my research against multiple attempts to take credit\n* Not being paid to do this\n* Knowing that any motivation I have to be autonomous is better invested in something other than a PhD due to how woefully unfulfilling it is\n* Not knowing anyone, in recent times, who feels better for having acquired their PhD\n\n...all makes me question \"why?\"",
      "author": "zante2033",
      "created": 1626862293,
      "upvotes": 1,
      "replies": {}
    }
  }
}