{
  "sid": "cx5x6l",
  "link": "/r/AskAcademia/comments/cx5x6l/advice_on_posthumously_publishing_a_thesis/",
  "title:": "Advice on posthumously publishing a thesis",
  "text": "Hello,\n\nI'm making a throwaway for this request for personal reasons. I'd greatly appreciate any help that you kind Redditors can provide.\n\nA year ago, my brother passed away. He studied political science and game theory and was interested in the Kashmir conflict. His plan was to publish the thesis on the subject and pursue a doctorate. For various reasons, he had to put this plan on hold and moved back home with my parents. \n\nHe moved on before it could be published. Recently my mother has been looking through his things and found his work. We obviously can't speak to him to find out if its final draft or not but she wanted to submit it to a journal as a tribute to him. (it is still handwritten and needs to be typed up) She was speaking to me about how she's shown it to academic friends she knows but its been very difficult to get it published especially since neither of us are experts in this field. \n\nI know that he did want it published in an international journal so ethically speaking, I don't think we're doing anything wrong by trying to publish without his consent ( although I cannot confirm if this is the final draft or not, all I have is a brief and hundreds of documents in his study). That being said, I wasn't a star student like him and have no idea how academic publishing works.  I'd imagine getting your work published when you're alive is absurdly difficult never mind this current situation. It's also highly possible that the work itself isn't ready to be published. I know that it's a possibility but just thinking about that makes my stomach turn. \n\nI'd greatly appreciate any advice on how to get started. Especially if you've been in a similar situation. How do you even go about submitting something like this? What journals should I reach out to? If I'm being delusional, please let me know. Just try not to be mean about it. If I haven't made it obvious, losing him was a horrifying experience. I feel like working on his thesis would be doing the right thing for him.",
  "author": "helpfulspirit123",
  "created": 1567108325,
  "updated": 1634082103,
  "over_18": false,
  "upvotes": 99,
  "upvote_ratio": 0.96,
  "comments": {
    "eyj4azm": {
      "link": "/r/AskAcademia/comments/cx5x6l/advice_on_posthumously_publishing_a_thesis/eyj4azm/",
      "text": "Sorry to hear about your brother. Here is my initial sense of the direction you should take.\n\nI think a logical first step would be to contact the department chair where he was studying and speak with them about your wish to see your brother's work published in an international journal. I am assuming he was at least a Masters student? They will likely remember him but if not remind them (a picture of him, courses he took, some details about when the accident occurred, etc). Tell them that you recently discovered a handwritten draft of your brothers work describing some research topic, accompanied by a significant number of supporting documents, and you would like to have someone there review it to see what shape it is in. In reality, your brother's work may not be ready for submission to a reputable journal. A professor in his department will be able to tell you that.\n\nSomething to keep in mind if you're unable to publish in the traditional sense. Upload an edited final draft onto a preprint server for all to access. Is [SocArXiv](https://osf.io/preprints/socarxiv/discover?subject=SocArXiv%7CSocial%20and%20Behavioral%20Sciences) suitable for this?",
      "author": "tauopathy",
      "created": 1567112299,
      "upvotes": 103,
      "replies": {
        "eyjhbg4": {
          "link": "/r/AskAcademia/comments/cx5x6l/advice_on_posthumously_publishing_a_thesis/eyjhbg4/",
          "text": "Also, if it a write up of some kind of research project, there must be some one in the department who was supervising him to do the project.  They would probably be best suited to review the paper.",
          "author": "Doofangoodle",
          "created": 1567119170,
          "upvotes": 33,
          "replies": {}
        },
        "eyk9ajv": {
          "link": "/r/AskAcademia/comments/cx5x6l/advice_on_posthumously_publishing_a_thesis/eyk9ajv/",
          "text": "Great response and here's a bit more to consider- depending on the thesis field there may be an intellectual property consideration with the dissertation chair having a stake. Which would mean you'd need to have appropriate permissions in order to publish.\n\nAlso dissertations are typically not journal length, so to shorten it to article length changes it, which therefore has even more intellectual property considerations.",
          "author": "cmgeek",
          "created": 1567141298,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "eyjrwgf": {
      "link": "/r/AskAcademia/comments/cx5x6l/advice_on_posthumously_publishing_a_thesis/eyjrwgf/",
      "text": "While it wasn't a thesis, I had a similar situation while I was working on my PhD. One of the students in our cohort died and we, his classmates, worked with his family to get some of his research published posthumously. He was listed as first author but because of the extra research we had to do to get it ready for publication, several of our names appeared with his. It was a group effort of his friends and probably the most helpful way I've ever mourned someone. It wound up being a really positive thing for everyone involved. \n\nThere's some good advice here but I also might recommend reaching out to classmates or colleagues who would be willing to help and understand the research well enough to clean it up to make it viable for publication of some sort. It may not end up being attributed to him alone but it would still accomplish the goal.",
      "author": "littleirishpixie",
      "created": 1567126603,
      "upvotes": 54,
      "replies": {}
    },
    "eyjbq2c": {
      "link": "/r/AskAcademia/comments/cx5x6l/advice_on_posthumously_publishing_a_thesis/eyjbq2c/",
      "text": "I believe the first thing to do is to contact his advisor. He/She will know how advanced the project was and if it is feaseble. They will also be someone directly interested on such publishing. Off the top of my hat I remember the work of Lindeman on ecosystem energy flow on the Cedar Creek Bog was published post humously by his advisor after he passed away. Best of luck and sorry for your loss.",
      "author": "milixo",
      "created": 1567116136,
      "upvotes": 29,
      "replies": {}
    },
    "eyjpeuq": {
      "link": "/r/AskAcademia/comments/cx5x6l/advice_on_posthumously_publishing_a_thesis/eyjpeuq/",
      "text": "I am sorry for your loss. I recently read a paper:\n\nHsieh, J. J. P.-A., Rai, A., Petter, S., & Zhang, T. (2012). Impact of user satisfaction with mandated CRM use on employee service quality. MIS Quarterly, 36, 1065-A1063.\n\nthat was posthumously published.   MIS Quarterly is the top journal in my field.  T. Zhang has a footnote beside his name on the title page.  The footnote simply reads: \n\n>Posthumously.\n\nThe following appeared in the 'about the authors' section at the end of the paper:\n\n>Ting Zhang (deceased, January 2010) was a doctoral candidate at Xi'an Jiaotong University, China, and a visiting scholar at Northeastern University in Boston. Mr. Zhang died of melanoma prior to the acceptance of this paper.\n\nThis paper's first three authors are highly regarded in my field.  I suspect they developed what Mr. Zhang left as his dissertation/MIS Quarterly submission and took it to completion.  So, you will need to talk to the dissertation chair and other academics to get the publication process started for your brother's paper. Best wishes on this endeavor.",
      "author": "fetch04",
      "created": 1567124712,
      "upvotes": 23,
      "replies": {}
    },
    "eyjgvwl": {
      "link": "/r/AskAcademia/comments/cx5x6l/advice_on_posthumously_publishing_a_thesis/eyjgvwl/",
      "text": "I can't speak to the ethics/acceptability of the situation, but I would imagine even if the work is incomplete, academics in his niche might be able to finish it or at least take huge inspiration/direction from the work to publish something themselves off the back of this and do so in his memory. Of course a lot of written work is dedicated to someone important acknowledged at the start of the piece, e.g. friends, family, co-workers, others who assisted. As just a postgrad student, I'd be more than happy if out of nowhere lots of relevant material came across my desk, reviewing the relevant literature is half the job.",
      "author": "NumerousOrder2",
      "created": 1567118927,
      "upvotes": 9,
      "replies": {}
    },
    "eyj39yy": {
      "link": "/r/AskAcademia/comments/cx5x6l/advice_on_posthumously_publishing_a_thesis/eyj39yy/",
      "text": "A few quick things:\n\nMany journals have author guidelines along the lines of: every author must make a substantial intellectual contribution to the paper, be involved in the actual drafting of the content of the article, every author must make final approval of the submitted version of the article, and every author must agree to be accountable for the final content of the article.\n\nThe last two will make it difficult to publish in many reputable journals. Many journals will also want an academic affiliation from the people submitting it for publication. \n\nI can see two options for you. The first would be to find an academic who finds value enough in the work to publish it. This will be extremely difficult because many academics receive requests to review documents from cranks, and those ignore emails from outside academia. \n\nThe second option would be to find a publication in the \"lay press\" that would see enough value in the work to publish it, although that will still likely require some expertise to change it from \"academic speak\" to \"lay speak.\"\n\nSo no matter what it will be a lot of work. If you think it will be a worthwhile way to honor your brother, then I suggest moving forward.",
      "author": "fleemfleemfleemfleem",
      "created": 1567111825,
      "upvotes": 14,
      "replies": {
        "eyjqe5w": {
          "link": "/r/AskAcademia/comments/cx5x6l/advice_on_posthumously_publishing_a_thesis/eyjqe5w/",
          "text": "The “final approval” is regularly waived in the case of posthumous publication.  Such articles often have a short note from the co-authors in memorium of the deceased author; sometimes the note is co-signed or even authored by the senior editors of the journal.",
          "author": "Decisionsota",
          "created": 1567125450,
          "upvotes": 19,
          "replies": {}
        },
        "eyjin1p": {
          "link": "/r/AskAcademia/comments/cx5x6l/advice_on_posthumously_publishing_a_thesis/eyjin1p/",
          "text": "My PI died suddenly a few years back and lots of articles got published posthumously. Not an insurmountable obstacle.",
          "author": "TurnsOutImAScientist",
          "created": 1567119981,
          "upvotes": 30,
          "replies": {}
        }
      }
    },
    "eykbfqr": {
      "link": "/r/AskAcademia/comments/cx5x6l/advice_on_posthumously_publishing_a_thesis/eykbfqr/",
      "text": "You may also want to talk with the library at his university. They publish PhD theses, and may be able to help you with an arrangement if you don't have luck with the academic department.",
      "author": "racinreaver",
      "created": 1567143708,
      "upvotes": 3,
      "replies": {}
    }
  }
}