{
  "sid": "ps2xyq",
  "link": "/r/AskAcademia/comments/ps2xyq/will_a_failed_module_at_masters_level_haunt_me/",
  "title:": "Will a failed module at masters level haunt me forever?",
  "text": "I'm doing a masters course and there was one piece of coursework that accounted for 2% of the entire course. It was a lab report that, due to covid, we never actually did the lab for. We were just given some fake numbers and told to do analyses on it that we had never be taught to do. Basically it was a cluster fuck and due to the low weighting and personal stressors I just didnt do it. \n\nHowever, that coursework was 25% of a module so if I dont make up for it with my exam results (>67%) I could fail that module. It's not in the field I want to research, it was during a pandemic, and I got one of the best scores in the university for my dissertation and great grades in my other modules so... will a failed module be the end of the world? \n\n(I'm hoping to go for a phd but I dont want to get my hopes up if every interview will be met with 'so why did you fail this modules are you stupid or something?')",
  "author": "amaranthinelux",
  "created": 1632169255,
  "updated": 1634078914,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hdn0sxv": {
      "link": "/r/AskAcademia/comments/ps2xyq/will_a_failed_module_at_masters_level_haunt_me/hdn0sxv/",
      "text": "Nobody will care about it",
      "author": "DeepSeaDarkness",
      "created": 1632172015,
      "upvotes": 3,
      "replies": {}
    },
    "hdn2hfu": {
      "link": "/r/AskAcademia/comments/ps2xyq/will_a_failed_module_at_masters_level_haunt_me/hdn2hfu/",
      "text": "Yes... I am 47 and I remember vividly failing a thermodynamics course in my masters' program at Caltech. It was very difficult at the time and caused me an uncountable amount of issues.\n\nI graduated amongst the top 10 students of my program in the end, but my transcript showing the failed grade has always kept me from reaching my full potential.\n\nI will not tell you about all the unsuccessful interviews (when I was lucky enough to actually get one), because I'm guessing that you're already expecting that.\n\nThe worse consequence it had on my life was with my personal relationships. My ex-wife's parents did not want me to marry her daughter because of that module. Eventually, after accepting that I still had some qualities deep down, they allowed the wedding. But the social pressure was so high that my wife ended up divorcing me 6 months later for a dude who got out top of his class in his business administration undergraduate from University of Idaho. I had to acknowledge the impressive achievement, so I decided to let my wife go with most of my belongings for the happy life she deserved, with a truly successful individual.\n\nAfter that, well, life hasn't gotten any better, unfortunately. I get jobs here and there in supermarkets or gas stations - though gas stations usually don't allow me to touch the fuel tanks because of my ignorance of thermodynamics...\n\nBest of luck my friend, I hope life will be kinder to you than it was for me. But in all honestly, a failed master's course is a bad one, and it is difficult to recover from it. Maybe we should create some kind of support group - what do you think?",
      "author": "taratataw",
      "created": 1632172737,
      "upvotes": 0,
      "replies": {
        "he4u1ks": {
          "link": "/r/AskAcademia/comments/ps2xyq/will_a_failed_module_at_masters_level_haunt_me/he4u1ks/",
          "text": "You had me in the beginning.",
          "author": "MrSeader",
          "created": 1632514725,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}