{
  "sid": "pqspkt",
  "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/",
  "title:": "Feeling like I will never belong in academia(STEM/USA)",
  "text": "Feeling really lost. Recently I got selected into a diversity program at an ivy league uni meant to prepare students from Phd the application process, it involves me being paired up with a current grad student from the department who will mentor me until April, when I will supposedly be deciding where to go, though I am over the moon grateful to be involved, I don't know if I'll ever see myself fitting in western academia.\n\nAs a a part of the mentorship program, the program coordinators were really kind to share the SoPs of current grad students, and it would be an understatement to say that I was blown away, I'm from the third world so reading those SoPs it seemed like these people were living on some other planet, the kind of things they've done, the experiences they've had, the people they've worked with, I don't think I'll ever be able to compete with them, I'm in Ecology so most people have mentioned being around nature reserves all their lives and things like going to Africa in high school for biodiversity surveys. On the other hand I didn't even know there was something like Ecology at that age, I've never had any of these experience, I just came across a theoretical ecology paper one day in university and that was it for me, I grew up in a small industrial town and hadn't even been to a proper forest before my first field internship.\n\nAt the same time I was able to accumulate decent amount of experience and publications just through contacting enough people in Europe for internships, though the work was not exactly related to what I was primarily interested in, I had to take those opportunities because the other option was sitting duck at home. I've been contacting PIs in America since the last month for Phd positions and have somehow been receiving positive responses, with them not really caring about my previous work being slightly detached from what I'm currently interested in and what they're doing, I don't know how I am in a position to say this but I have multiple Professors at amazing places like UCLA and Stanford who are somehow really really interested in their own words, in the questions I approached them with and have told me they'll do everything in their power to get me into the program.\n\nSince reading those SoPs I'm confused about my position, even if I do end up making the jump from a poor nobody from a poor country to a grad student at an elite university, will I ever fit in with the rest of the people there who come from places and experiences which seem completely alien to my imagination? Would I be just another diversity hire who would struggle to find their place? I did use to think about the fact that I'll never be able to compete with people coming from immense privilege, but today for the first time I was pure intimidated. Is academia for people like me?",
  "author": "Neat-Mix3864",
  "created": 1631992972,
  "updated": 1634078930,
  "over_18": false,
  "upvotes": 108,
  "upvote_ratio": 0.92,
  "comments": {
    "hddc1rn": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hddc1rn/",
      "text": "Yes, academia is for people like you. You suffer from impostor syndrome. It's very common in academia. But you been selected into the program, you've got publications, and you have PIs that are interested in what you're doing. All those things have happened because you made it so, and it shows you're doing fine.\n\nNow, I don't have any Ivy league experience. But I'm also an ecologist, and I certainly didn't grow up doing shit in nature reserves or going to Africa and all that. But I managed to fit in anyways, and my PhD turned out alright. And if I'm allowed to pat our own backs for a moment, I must say that us ecologist are a pretty decent bunch of people, so I'm hopeful you'd feel welcome whereever you end up.",
      "author": "No-Biscotti7018",
      "created": 1631994459,
      "upvotes": 98,
      "replies": {
        "hdettaj": {
          "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hdettaj/",
          "text": "Yep, I was lucky enough to hear a talk once by Jocelyn Bell Burnell, who discovered the first pulsars. She had severe imposter syndrome as a woman from the north of England in Cambridge for her PhD, and just figured “I’ll work as hard as I can so once they realize I’m a fraud and throw me out, at least I know I tried my best” and went forward. I always thought that was a good mentality for dealing with imposter syndrome.",
          "author": "Andromeda321",
          "created": 1632017469,
          "upvotes": 15,
          "replies": {}
        },
        "hddzl33": {
          "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hddzl33/",
          "text": ">I must say that us ecologist are a pretty decent bunch of people\n\nI did my undergrad in biology and can confirm--my favorite professor was my ecology professor.",
          "author": "DataNerd1011",
          "created": 1632004116,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hddek4g": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hddek4g/",
      "text": "Don’t let yourself be intimidated by someone else’s application, it’s a constructed advertisement designed to make them look as good as humanly possible.  If you get in, you get in, same as they did.  From there, it’s as much about how much you care and how much you invest mentally as anything you’ve done in the past.  It makes no sense to judge yourself by opportunities you were never had the chance to be offered.",
      "author": "S_Belmont",
      "created": 1631995503,
      "upvotes": 32,
      "replies": {}
    },
    "hdec7b2": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hdec7b2/",
      "text": "First, it seems like it would be easy to write a SoP by starting out talking about how you grew up in a small industrial town and had never been to a proper forest.\n\nSecond, even if the internships weren't exactly what you wanted, surely you learned something from them about what you want to do.  Nobody gets exactly what they want but it seems like you have enough to form a narrative.\n\nFinally, I don't know if you'll fit in.  Do you care?  If that's what's really important to you you can always get a job in your hometown doing the same things as the people you grew up around.",
      "author": "dampew",
      "created": 1632009618,
      "upvotes": 9,
      "replies": {}
    },
    "hddu4k5": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hddu4k5/",
      "text": "OP, I really identify with that feeling of being out of place. I grew up as a genuine hick in rural Alaska and for sure had no STEM opportunities in high school or only got research experience in my final year of undergrad (went to small state school). I also ended up in an elite university and felt wildly out of place when I started my PhD, as many had more experience than I did. But I can guarantee that you won't be the only one feeling out of place, you will find other grad students to connect and build support with. Also, trust that if those professors see something in you and your passion for ecology, than you belong there just as much as those with more privileged backgrounds.",
      "author": "garbonzo_bean_can",
      "created": 1632001858,
      "upvotes": 7,
      "replies": {}
    },
    "hddbnsy": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hddbnsy/",
      "text": "Oh so much to unpick here. I'm going to be honest and say you may never find somewhere that you feel you fit in but that doesn't mean you don't deserve to be there or that academia and ecology doesn't need you. \n\nThere's no such thing as diversity hires, if there were academia (and industry) would be stuffed full of BIPOC and they aren't. The few BIPOC who make it, make it by being twice as good as everyone else, while some people try to tear them down by calling them a diversity hire. \n\nYour experience is totally different from the people around you and you bring a unique perspective to the academic questions you ask and clearly they're questions that pique interest from serious academics. Growing up in a privileged environment of nature reserves and trips to Europe doesn't necessarily equip you to ask really important questions with large societal impact. Growing up wherever you did, may.\n\nPlease don't let anyone convince you, you don't belong somewhere just because you're different from them, but at the same time you don't owe anyone your mental health and your sanity just because you've been offered mentoring and support. If you want to do a PhD, go for it. Find other people like you - societies, volunteering for a cause, religious communities etc - and build a support network, and do whatever it is you want to do with your life. My feeling is from your post academia needs you more than you need academia, and you could do some great work.",
      "author": "ACatGod",
      "created": 1631994298,
      "upvotes": 43,
      "replies": {
        "hdepa2c": {
          "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hdepa2c/",
          "text": "When I confirmed absolutely nobody feels like they fit in.\n\nIn his autobiography George W. Bush said because he grew up in Midland TX and was a conservative, he felt like an outsider at Yale.  \n\nA confident and extroverted third generation Yale student, grandson of a recent US Senator, a guy that was used to being away from home on his own because he attended a nearby prestigious private boarding prep academy in Andover Massachusetts the three years prior to Yale, somehow felt like he was the outsider.\n\nThat let me know there are no new arrivals in any situation or institution that don’t feel somewhat or totally like they are the one different and they are the outsider.\n\n(in 1964 being an east coast Republican/conservative at Yale was not an anomaly.)",
          "author": "rethinkingat59",
          "created": 1632015496,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hdfzd6g": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hdfzd6g/",
      "text": "  I can't answer if you will feel you fit in,  especially as I am not in America but the UK. What I will say, is that I have found people ion academia here at least, care about you putting in hard work and showing a real interest in getting internships even if they are not exactly what you were looking to do because skills can be transferable. In my story, I was from what is considered a poor background in my country, and though I had a degree, after ten years when I stopped to have a child I changed to a completely different field, the field I'm in is considered very high class, it is only taught in expensive private schools and most of the candidates came from those background, but people were interested that I had pursued the course whilst holding the baby, literally, that I had retrained when pregnant and nursing, because it shows dedication. What I also came to realize is that because my background was different, my outlook was different and the questions I asked the materials was different, the conclusions I came to was different. That was why the people looking at my essays were interested in me, this is why having people from different backgrounds in a field is good. So, my point is, I think, that the higher ups are interested in you because they can see you having a good voice for the field - fitting in... well some of us never do, but that shouldn't stop you, because your voice is needed in the field, you have something to say, and the fact that it's different from other people - that's a good thing.",
      "author": "Too_Tired_Too_Old",
      "created": 1632043273,
      "upvotes": 3,
      "replies": {}
    },
    "hddu3u4": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hddu3u4/",
      "text": "If that's what you want to do, stick with it and soon enough you'll see that you truly belong there, and end up carving out your personal space. \n\nYour first interaction is daunting, but what I've learnt from many professors and students is that they all feel like they don't live up to the \"ideal\" of their occupation, but you have to realise there's something equally special and different about your own story. Goodluck and be happy to be you.",
      "author": "AsimovNo9",
      "created": 1632001849,
      "upvotes": 2,
      "replies": {}
    },
    "hdersru": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hdersru/",
      "text": "Write your own SOP citing all the previous outdated SOPs that are no longer applicable Re Covid\nMake your own f$%^& rules Shape your battlefields",
      "author": "WmBBPR",
      "created": 1632016595,
      "upvotes": 2,
      "replies": {}
    },
    "hdi1qnk": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hdi1qnk/",
      "text": "> I'm in Ecology so most people have mentioned being around nature reserves all their lives and things like going to Africa in high school for biodiversity surveys. On the other hand I didn't even know there was something like Ecology at that age, I've never had any of these experience\n\nPlease don't worry about this. These are *privileges* that these students had - it does not translate into someone being a good scientist. I am a PI with a small overlap with Ecology, and I had had none of this experience or opportunity when applying to grad school. My group is mostly computational so I almost always skip these parts of the CV. Rather, I am looking for students who know what big questions they are interested in, who have made the most of the research opportunities they have been given (e.g. undergrad projects), and who show a strong willingness to learn and develop as independent researchers. Publications are a big plus as they provide a track record of research experience (but I don't expect them as I know the process is quite fickle!) \n\nAs others have said here, it sounds like you have imposter syndrome, which is very common. It is easier said than done, but when writing applications, try to know your worth. You deserve to be there. Sometimes it helps to pretend you are writing for a friend or colleague rather than yourself. Don't be afraid to ask for feedback from mentors. Good luck!",
      "author": "nailface",
      "created": 1632080028,
      "upvotes": 2,
      "replies": {}
    },
    "hddj6f2": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hddj6f2/",
      "text": "Also, many people who grow up in very privileged  circumstances also feel imposter syndrome. They know they’ve been allowed to coast here and there. \n\nPlease don’t worry about all of this. Get out there and do ecology!",
      "author": "DntfrgtTheMotorCity",
      "created": 1631997352,
      "upvotes": 5,
      "replies": {}
    },
    "hdftiid": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hdftiid/",
      "text": "Impostor syndrome. I had it also. Do what you did to get there and you'll be fine. You'll be surprised at how many will drop out or never finish. You belong there because you stood out...someone thinks you can do it despite not having the same track record. In many ways those experiences won't matter. They don't teach you how to analyze your data, edit your dissertation, prepare for publication and read until your eyes bleed.",
      "author": "Miskwaa",
      "created": 1632038616,
      "upvotes": 1,
      "replies": {}
    },
    "hdjq58r": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hdjq58r/",
      "text": "You sound perfect for academia. Everyone thinks they’re not good enough. All you need is a passion for the subject, the ability to work independently, and the willingness to commit to a longa$$ program. Join us, we have more questions than we do answers and we love it",
      "author": "sophi529",
      "created": 1632107308,
      "upvotes": 1,
      "replies": {}
    },
    "hde8k0w": {
      "link": "/r/AskAcademia/comments/pqspkt/feeling_like_i_will_never_belong_in/hde8k0w/",
      "text": "Clear just bragging. Bad troll.",
      "author": "rohanps",
      "created": 1632007927,
      "upvotes": -10,
      "replies": {}
    }
  }
}