{
  "sid": "imbp07",
  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/",
  "title:": "For those of you who didn't end up in academia after your PhD, do you think your PhD experience was still worth it?",
  "text": "Not just career-wise, but overall as a life experience?",
  "author": "bahasasastra",
  "created": 1599204804,
  "updated": 1634080462,
  "over_18": false,
  "upvotes": 268,
  "upvote_ratio": 0.98,
  "comments": {
    "g3yr76h": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yr76h/",
      "text": "My PhD is directly related to my job so definitely. As for life experience, my defense was so brutal that no human can hurt my feelings any more.",
      "author": "luv2belis",
      "created": 1599214163,
      "upvotes": 544,
      "replies": {
        "g3yv0we": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yv0we/",
          "text": "Haha that second sentence is like therapy to me.",
          "author": "cobie1em0ji",
          "created": 1599217357,
          "upvotes": 138,
          "replies": {}
        },
        "g3yzv6p": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yzv6p/",
          "text": "I mean at this point you wouldn't even be fazed by an Eminem diss on stage in a stadium.",
          "author": "Ghaenor",
          "created": 1599220418,
          "upvotes": 58,
          "replies": {
            "g3zbb36": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zbb36/",
              "text": "Now picturing Eminem on stage calling out someone in the crowd for being unaware of a recent paper that rules out their central hypothesis.",
              "author": "retkg",
              "created": 1599226039,
              "upvotes": 95,
              "replies": {
                "g40c6ov": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40c6ov/",
                  "text": "I can actually picture this because he can literally make anything offensive rhyme with hypothesis.",
                  "author": null,
                  "created": 1599239133,
                  "upvotes": 19,
                  "replies": {
                    "g40jx5a": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40jx5a/",
                      "text": "Unaware of a recent paper that rules out your central hypothesis\n\nYou droppin' shit on the page like Kris Jenner's incontinence",
                      "author": "TheJadedEmperor",
                      "created": 1599241694,
                      "upvotes": 29,
                      "replies": {
                        "g451rhd": {
                          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g451rhd/",
                          "text": "On top of this \n\nPreposterous hypothesis ain’t nothin in my side of the metropolis\n\nAcademia’s an acropolis \n\nAnd the man said \n\nIn academia you write your findings to the finish \n\nBecause in the tower you better publish or you dead",
                          "author": null,
                          "created": 1599323413,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g3yq2oc": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yq2oc/",
      "text": "I dont like this thread. \n\n- someone 6 months from finishing who wants to stay out of academia.",
      "author": "Diddly_eyed_Dipshite",
      "created": 1599212943,
      "upvotes": 191,
      "replies": {
        "g3z0dfe": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z0dfe/",
          "text": "I make 4 times my friends who stayed in, and my life is much, much more enjoyable. Downside: industry is constantly shifting and restructuring. Tenure certainly doesn’t exist here! So that kind of job security isn’t here, but the flexibility, creative freedoms, and career advancement opportunities are much greater over here in the corporate world",
          "author": null,
          "created": 1599220715,
          "upvotes": 75,
          "replies": {
            "g3zay1j": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zay1j/",
              "text": "Honest question - Why do you think that the flexibility and creative freedoms are more in the industry? I would think the exact opposite. As a postdoc/prof you have the freedom of choosing what you want to work on and when you want to work.",
              "author": "etal_etal",
              "created": 1599225903,
              "upvotes": 30,
              "replies": {
                "g3zgrxg": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zgrxg/",
                  "text": "Who says you don’t have this in pharma or industry? One of the biggest myths that keeps people in academia is once you move into industry you have no more intellectual freedom. This is wrong.\n\n1) If I was in academia, my job is tied to my funding. My funding is tied to research I’ve done before. I get more and more pidgeonholed into an obscure corner of research and can’t get out. Also, if there’s no funding for what I’m interested in, or no publishing prospects, I’m totally SOL. I have to hustle my whole career.\n\n2) We are allowed sabbaticals in industry. My company offers 3 months, where I can join a project and focus solely on that for the duration.\n\n3) No publication pressure! But if you do publish, you get rewarded! I’ve published twice this year, in two very different areas. Both times, I got recognized by my team. Felt amazing. You can publish and collaborate with whomever you want still.\n\n4) Remember, at this level in industry, you’re typically working with other MDs, PhDs, and other doctorate levels. We all share the same culture of publishing, researching, intellectual curiosity. This culture doesn’t just disappear, and continues to be cultivated. This is my second company I’ve worked for, and both places my bosses asked me on my first day what I wanted to explore, what research I was interested in, what I wanted to pursue.\n\n5) So much free time. No students, some busy work (paperwork can be a lot - regulations here), but just a lot of flexibility.\n\n6) Finally, if you get stuck in a job or project you don’t like - YOU GET TO LEAVE. And you don’t have to start over! You get to leave, and you can stay in the same city! And whatever company/job you move on to, you’ll likely get a RAISE. If you’ve studied a certain therapeutic area all your life, it’s likely adjacent to ten other TAs you can jump into and explore. And if you want a different job title (you were a clinical research scientist in Med Affairs, now you want to explore health outcomes), YOU CAN DO THIS! \n\n7) I’ve never had a 9-5 in industry, and no one expects you to. Throughout the last few months in covid, I’ve seen my friends in academia struggle with the workload and families. One friend hasn’t had a day off since February. That’s asinine. On my team, if someone is stuck at the dentist and needs to jump off an important call early, no one bats an eye.\n\nETA - the opposite goes too - if you don’t want to do ANY of those things (research, publish, be creative) a you don’t have to and it will not affect your career prospects one bit. It’s so nice over here y’all - come join us!",
                  "author": null,
                  "created": 1599228086,
                  "upvotes": 72,
                  "replies": {
                    "g402y38": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g402y38/",
                      "text": "What you say is true, but it’s also good to point out that for industry, things move very fast. Your project can be dropped in a week despite having worked on it for years due to the lack of results. That can be crushing. In big pharmas, multiple projects are in parallel so if your project doesn’t produce good results, it doesn’t get prioritised and manpower can be reallocated to more promising projects. This is of course expected, since industry is known to be very fast-paced and very dynamic as compared to academia.\n\nWork hours are variable. I have friends in a major MNC who is from Medical Affairs & Regulatory Affairs departments. Super different culture across different departments. Regulatory affairs is kinda more “standardised” so 9-5/6 is normal. Things can be occasionally busier when new regulations are put in place. But medical affairs is really about reasoning and being critical and understanding the Science in accordance to the business perspective. That usually calls for very dynamic discussions with clinicians and consultants that can last till 1 or 2am. Medical affairs are not only crucial throughout the entire clinical trial phase but also the post launch as well. \n\nIt really depends on the nature of your work even in the same company.",
                      "author": "nixeij",
                      "created": 1599235918,
                      "upvotes": 21,
                      "replies": {
                        "g41f8s1": {
                          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41f8s1/",
                          "text": "I would rather drop a go-nowhere project hard and fast than spend years on it.  That is success, not failure.  The goal is to spend money on a good drug to treat people and not spend money on a bad drug that won’t.  In academia, you beat a dead horse until it shits out a paper — if it doesn’t, you get nothing (or you smudge the data as often happens).  Even if it does go well, who gives a shit, it’s just another dumb paper that doesn’t really matter.\n\nDifferent strokes lol",
                          "author": "tiddies_akimbo",
                          "created": 1599252042,
                          "upvotes": 13,
                          "replies": {}
                        }
                      }
                    },
                    "g3zqmd0": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zqmd0/",
                      "text": "This is really encouraging and making me even more sure of my idea to go into industry when I graduate. When you said you've never had a 9-5 in industry, do you mean you're working more or less than that, or that you can choose your own hours?",
                      "author": "geosynchronousorbit",
                      "created": 1599231623,
                      "upvotes": 10,
                      "replies": {
                        "g45m4ix": {
                          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g45m4ix/",
                          "text": "Working less some days/weeks, more others. It’s just a different schedule. Some days I work for an hour and a half, and spend the rest playing with my dog or in my garden. Other weeks I’m traveling for 10 days straight. It’s much more variable! But by and large, I choose when I travel (sometimes no, like meetings and conferences).",
                          "author": null,
                          "created": 1599333673,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "g40u7eu": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40u7eu/",
                      "text": "How does someone who was very productive in academia but didn't get the exact skill set that hiring managers are all looking for on Indeed break into the kind of life you have?  What is the path?",
                      "author": "Hermetic_Wisdom",
                      "created": 1599244977,
                      "upvotes": 8,
                      "replies": {
                        "g45m8uk": {
                          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g45m8uk/",
                          "text": "Get clinical trial experience, with humans. Be relentless in informational interviewing everyone you know in industry. Network like crazy. Hire a resume writer. Be good at presenting.\n\nETA - just read the comment about becoming master of everything. This is wrong. Go look at some job postings for medical science liaison, or something in medical affairs, or regulatory specialist at any biotech or pharma company. No one needs to a master in anything. What they expect is a terminal doctorate, clinical trial experience, scientific acumen, good communication skills, and a track record of following rules. \n\nOn my team of 19, we have a handful of MDs, PhDs, a lot of PharmDs, and one DVM. Most of us had no industry experience at all. What we had in common was that we all had clinical trial experience, and many of us worked as clinicians in one way or another. And we are all likeable. Our harder skills mean very little, as we like having a diverse team. So I’m great with statistics, another colleague is an expert in sleep. We all contribute something.",
                          "author": null,
                          "created": 1599333732,
                          "upvotes": 3,
                          "replies": {
                            "g5adyp8": {
                              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g5adyp8/",
                              "text": "Have human clinical trial experience.  What is the job title I should be looking for, other than CRC?",
                              "author": "adlibitum",
                              "created": 1600118885,
                              "upvotes": 1,
                              "replies": {
                                "g5aiiuv": {
                                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g5aiiuv/",
                                  "text": "Medical liaison; medical writer; science writer; research scientist; scientist; if you’re looking for a fellowship, just search Fellowship (medical affairs) in the big pharma companies. Can also look in regulatory affairs for similar job titles. Depends on what your specialized skill set is, might look at HEOR as well. Good luck! It’s so fun over here!",
                                  "author": null,
                                  "created": 1600120627,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "gkrx7r3": {
                              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/gkrx7r3/",
                              "text": "Would experience with human subjects and human behaviour be a decent substitute or at least a stepping stone for clinical trials?",
                              "author": "valryuu",
                              "created": 1611624410,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "g40wyz8": {
                          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40wyz8/",
                          "text": "Honestly, in every sector you have people demanding that you become a master of everything (yet also be very focused, hmmm) and have skill that the old guys spent decades learning (some of which didn't even exist until well after they left graduate school!!) There's no winning.",
                          "author": "ChadMcRad",
                          "created": 1599245911,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "g42p2mn": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g42p2mn/",
                      "text": "As someone who went back to school to get a PhD after several years in industry, I agree with this.",
                      "author": "snaggletots22",
                      "created": 1599273174,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "g9k8571": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g9k8571/",
                      "text": "Which exact job do you do?",
                      "author": "idk7643",
                      "created": 1603301941,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "g3zc0bc": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zc0bc/",
                  "text": "Because the hours in academia can be brutal. I guess you can choose them so long as you pick 60-80/week, especially early in your career. Industry, on the other hand, can offer better work-life balance.\n\nThese are, of course, generalities and there are always exceptions. If you’re in a non-research position in academia, then it can be very different.",
                  "author": "PhD4Hire",
                  "created": 1599226296,
                  "upvotes": 18,
                  "replies": {
                    "g40x9y2": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40x9y2/",
                      "text": "It's funny you say that, because I agree, but we had a seminar speaker come to us and say that in industry, the parking lots are always full on Saturdays, to the point where he made his student workers come in for meetings then. Not to mention the rat race of always being on top of your game to keep ahead of your peers (and competitors).\n\nGovernment... maybe government is the way to go?",
                      "author": "ChadMcRad",
                      "created": 1599246012,
                      "upvotes": 5,
                      "replies": {
                        "g41orr4": {
                          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41orr4/",
                          "text": "I know many PhD scientists in STEM and can’t think of one who works weekends. I’m sure it happens on occasion, but it’s certainly not the norm.",
                          "author": "PhD4Hire",
                          "created": 1599254891,
                          "upvotes": 4,
                          "replies": {
                            "g41yxrb": {
                              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41yxrb/",
                              "text": "Thank god. I support hard work but not killing yourself",
                              "author": "ChadMcRad",
                              "created": 1599258853,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g41cuvu": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41cuvu/",
                  "text": "Is that true?  Seems like all postdocs spend their holidays pretty much the same way: in lab/office, writing grants or papers.  PIs write grants, papers, teach/mentor students, and compete with each other.  You can’t really change fields easily, can’t re-tool your skills easily, and have to stay within the lines to get the funding needed to survive.  You don’t get to choose where you live, you live where you can get your tenure (and most won’t).  And on top of that, no matter what choices you make, you’re still just writing grants.  Writing papers.  Teaching.  Mentorship.  Grading.  Grants.  More grants.  Even more grant writing.  Where is the choice?  The freedom?\n\nThe above is what academics is all about and all it will ever be.  It’s less than 1% of all work.  Are you really saying that the real freedom, variety and choice is within this less than 1% of all work and it’s the over 99% of the rest of the world of human effort that is constrained?\n\nNon-academic work is:\n\nAll art, music and media\n\nAll law, governance and politics\n\nAll handiwork, skilled craftsmanship and physical creation\n\nAll business and technological innovation\n\nAll leisure, travel and experience of history\n\nAll things money, power and influence\n\nSurely there is some choice and freedom to be found there?",
                  "author": "tiddies_akimbo",
                  "created": 1599251258,
                  "upvotes": 10,
                  "replies": {}
                },
                "g422b49": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g422b49/",
                  "text": "> As a postdoc/prof you ~~have the freedom of choosing what you want to work on and when you want to work.~~ work on whatever the meager grant funding landscape allows you to work on, applying for more and more grants until you’re more technical writer than scientist\n\nFTFY",
                  "author": null,
                  "created": 1599260110,
                  "upvotes": 3,
                  "replies": {
                    "g45i064": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g45i064/",
                      "text": "So true. A lot of people are very unrealistic see naive about intellectual freedom in academia vs industry. You work on what gets funded, period, and other people decide what gets funded.  It's really not that different. Most people didn't dream of working on their super esoteric specific system/protein/mouse model, they just happened to be working on something that is funded and then became experts at it to the point where they become so entrenched in that little niche that they can't do anything else.",
                      "author": "Minny7",
                      "created": 1599331643,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g3z802t": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z802t/",
              "text": "Which field?",
              "author": "idk7643",
              "created": 1599224752,
              "upvotes": 6,
              "replies": {
                "g3z84jg": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z84jg/",
                  "text": "I work in pharma - PhD in a life science",
                  "author": null,
                  "created": 1599224802,
                  "upvotes": 15,
                  "replies": {
                    "g3zhfwc": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zhfwc/",
                      "text": "Cool, I'm doing an undergraduate in biomed and I'm applying for masters in drug development or \"biomedicine-- pharmacology track\" type of things.\n\nDo you have any good advice, like what pharmaceutical companies are looking for most or how to get into this field in general?",
                      "author": "idk7643",
                      "created": 1599228338,
                      "upvotes": 3,
                      "replies": {
                        "g3zhwgx": {
                          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zhwgx/",
                          "text": "Get industry experience now. Also why do a masters in biomed pharma track, and not a pharmD? You’ll have a way easier time doing a pharmD and doing an industry residency",
                          "author": null,
                          "created": 1599228510,
                          "upvotes": 7,
                          "replies": {
                            "g40kl4z": {
                              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40kl4z/",
                              "text": "I did 3 months worth of laboratory internships so far (1 month microbio, 2 months pathology). Sadly even just getting unpaid laboratory internships was very hard, they all just say \"we don't take interns\" and that's that. I don't think I'll be able to get any industry experience before my masters.\n\nI don't seem to fullfill the entry requirements for a lot of pharma related courses. Currently I plan to apply to 5 countries: The only 3 Swedish unis that have a course I'm eligible for, the 1 uni in Finnland, the one uni in Denmark, the one uni in Norway, and the one uni in Germany.\nNormally they say something like: \"10 credits in bioinformatics\", and I don't have bioinformatics. Or \"35 credits in organic chemistry\" and I only have 20. Or \"10 credits in statistics\" and I don't have statistics. My course covered stuff like cell biology, genetics, histology, haematology, microbiology, immunology, pathology, anatomy, drug development etc.\nIt's essentially aimed at biomedical scientists who work in hospital laboratories to diagnose people.",
                              "author": "idk7643",
                              "created": 1599241901,
                              "upvotes": 1,
                              "replies": {
                                "g45neiu": {
                                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g45neiu/",
                                  "text": "Oh cool. Well make sure you get clinical trial experience, with humans! That will set you up for success. Also just network network network - it takes a while to get into industry, and most times it’s through someone already in. Best of luck! You’re looking in a part of the world where there are loads of opportunities!",
                                  "author": null,
                                  "created": 1599334307,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "g49lst4": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g49lst4/",
              "text": "> Tenure certainly doesn’t exist here! \n\nTenure increasingly doesn't exist in academia either lmao.  Also there's virtually no TT job growth, as that has been eaten entirely by adjunct positions.",
              "author": null,
              "created": 1599424744,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g4226er": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g4226er/",
          "text": "I defended in December and was just offered a $110K position outside of academia so don’t get discouraged. Great things can happen by completely random chance if you’re lucky!",
          "author": null,
          "created": 1599260059,
          "upvotes": 7,
          "replies": {}
        },
        "g3yxvl9": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yxvl9/",
          "text": "I wish you good luck!",
          "author": "AnGuinn",
          "created": 1599219213,
          "upvotes": 2,
          "replies": {
            "g3zao7q": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zao7q/",
              "text": "Thank you, and the same to you :)",
              "author": "Diddly_eyed_Dipshite",
              "created": 1599225799,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g42oxoe": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g42oxoe/",
          "text": "You. Do. Not. Have to go into academia. You don't. I don't plan on staying in academia either and I had a substantial career in industry prior to going back. Do your own thing and be proud of your PhD.",
          "author": "snaggletots22",
          "created": 1599273089,
          "upvotes": 2,
          "replies": {}
        },
        "g3zwzn8": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zwzn8/",
          "text": "Same\n\nAnd I have 2 years to go",
          "author": null,
          "created": 1599233857,
          "upvotes": 1,
          "replies": {}
        },
        "g4158kd": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g4158kd/",
          "text": "Same and I am only 1 year in lolololol",
          "author": "succulent_124",
          "created": 1599248649,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3yzi9o": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yzi9o/",
      "text": "I'm two years out of an English PhD. Since then I've worked in market intelligence research (1.5 years) and currently I work for a policy institute doing research and communications. My current position is funded by a postdoc, but at this point I've left my original field entirely and there's no chance I'll ever be a professor. I love policy and hope to stay in this field.\n\nCareer wise, there are definitely more direct paths I could have taken to end up in my current field (a masters in economics or public policy), but this career path didn't even cross my radar until late in the PhD, and only because I was paying attention to where other grad students were getting jobs.\n\nAs a life experience, the PhD was definitely worth it for me! The experience of moving to a new city by myself (I did my undergrad and master's relatively close to home) was something I needed at the time, even though I'm back in my home town now. Now that COVID has us grounded for the foreseeable future, I'm soooo glad I used the opportunity to travel a bunch during my PhD. My school had really generous conference funding, so I was able to leverage that into some longer trips. As an English PhD, I had no lab commitments, and I had a fsirly distant relationship with my adviser, so once I finished coursework I'd just skip town for months at a time without telling anybody lol. I still finished the PhD in four years despite spending a cumulative 5-6 months backpacking overseas during that time! I think the travelling actually kept me motivated to be more productive when I was home. My dissertation topic was really fun. There were definitely challenging points early in the research process, but once I got going with the writing I was able to keep up the momentum. I only published one article based on the diss but it's gotten a decent amount of engagement and I'm happy with that.\n\nOverall, I'm glad I did the PhD, but I think a big part of it was the timing. I finished at 28 and I'm a bit immature for my age so it just felt like I was continuing to \"self-discovery\" phase you're expected to have during undergrad.",
      "author": "suhawhee",
      "created": 1599220209,
      "upvotes": 58,
      "replies": {
        "g43v1ct": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g43v1ct/",
          "text": "Hi, I was wondering about doing a PhD in English Literature. Would it be possible for me to ask you some questions?",
          "author": "jaishreeeee",
          "created": 1599301862,
          "upvotes": 2,
          "replies": {
            "g44hi9r": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g44hi9r/",
              "text": "Sure!",
              "author": "suhawhee",
              "created": 1599314410,
              "upvotes": 1,
              "replies": {
                "g47n286": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g47n286/",
                  "text": "Thank you! Please check your chat :)",
                  "author": "jaishreeeee",
                  "created": 1599377086,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g3z4v89": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z4v89/",
      "text": "[deleted]",
      "author": null,
      "created": 1599223187,
      "upvotes": 51,
      "replies": {
        "g40gysz": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40gysz/",
          "text": "Can you talk more about what political consulting is?",
          "author": "garulous",
          "created": 1599240715,
          "upvotes": 3,
          "replies": {
            "g40jdkx": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40jdkx/",
              "text": "Seconded, and how you ended up in that field?",
              "author": "asdf111q",
              "created": 1599241515,
              "upvotes": 1,
              "replies": {
                "g41adfu": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41adfu/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1599250419,
                  "upvotes": 3,
                  "replies": {
                    "g41jjxt": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41jjxt/",
                      "text": "Very interesting. Good for you. I’m wondering because I’m considering a humanities PhD but also have a focus/interest in scientific communication. (Have worked projects re: how to effectively communicate with the public in order to mobilize action.) Right now I’m meandering a little, but it’s ultimately brought to an interest in politics and education. Just trying to figure out the best way to make an impact, and it sounds like consulting might be the way to get involved with people and groups that I believe in while bringing my own expertise to the table. Thanks for your answer. \n\nHow do you find that your STEM PhD does or doesn’t help you in what you’re doing now? (e.g. your knowledge base, your skills, etc.)",
                      "author": "asdf111q",
                      "created": 1599253264,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "g40xa9b": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40xa9b/",
                  "text": "My guess, money and connections. Politics is all about who you know.",
                  "author": "fcirillo",
                  "created": 1599246014,
                  "upvotes": -1,
                  "replies": {
                    "g41a6xx": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41a6xx/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1599250357,
                      "upvotes": 5,
                      "replies": {
                        "g41dca6": {
                          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41dca6/",
                          "text": "I admire you for doing it for passion, I just hope that lasts for you because I got too jaded way too quickly but then again I was working in Florida so idk what I should have expected 😅😂",
                          "author": "fcirillo",
                          "created": 1599251424,
                          "upvotes": 0,
                          "replies": {
                            "g41dty4": {
                              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41dty4/",
                              "text": "Yeah I hear that. What I'm doing now is very stable (relative to campaign life), so I'm hoping it works for the long haul. What were you doing in FL? I've considered heading back that way, but I don't think I can survive the summers any more as they keep getting worse.",
                              "author": "toot_ricky",
                              "created": 1599251594,
                              "upvotes": 2,
                              "replies": {
                                "g41e9eo": {
                                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41e9eo/",
                                  "text": "Campaigns(state and local) but I just didn't have it in me to lobby because I find it antithetical to my core political beliefs, I think I was way too idealistic especially for a state that runs majority Republican",
                                  "author": "fcirillo",
                                  "created": 1599251742,
                                  "upvotes": 1,
                                  "replies": {
                                    "g41ejne": {
                                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41ejne/",
                                      "text": "Yeah Florida politics has disappointed me for far too long, I could see that getting incredibly tiring. You ended up going to academia post-politics? We switched, ha!",
                                      "author": "toot_ricky",
                                      "created": 1599251839,
                                      "upvotes": 2,
                                      "replies": {
                                        "g41eznp": {
                                          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41eznp/",
                                          "text": "Haha public sector, academia adjacent, after I get a few years of exp under my belt I am going to apply for an adjunct position but right now I work for BLS as an economist.",
                                          "author": "fcirillo",
                                          "created": 1599251961,
                                          "upvotes": 1,
                                          "replies": {
                                            "g41gc29": {
                                              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41gc29/",
                                              "text": "Trading one tough gig for another!",
                                              "author": "toot_ricky",
                                              "created": 1599252337,
                                              "upvotes": 1,
                                              "replies": {
                                                "g41gpun": {
                                                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41gpun/",
                                                  "text": "Haha no way, way better benefits and a lot less stressful, not to mention I get to do actual research which is a nice change",
                                                  "author": "fcirillo",
                                                  "created": 1599252434,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g40j57t": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40j57t/",
          "text": "What do you mean with PI?",
          "author": "Wobbel96",
          "created": 1599241440,
          "upvotes": 2,
          "replies": {
            "g40jah4": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40jah4/",
              "text": "Principle Investigator / Advisor / Boss / Mentor",
              "author": "toot_ricky",
              "created": 1599241487,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "g3yms9r": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yms9r/",
      "text": "Career-wise, not so much. Speaking from a STEM perspective. But i hope it’s only a transition thing.. some industries and roles definitely need a PhD for entry but of course they will also be more competitive I suppose? Like Medical Affairs, Data Scientists in Biotech and MNC Pharmas.. \n\nThe thing is if u know what u wanna do, and phd is not necessary, then don’t do it. The academia is a shitty system unless ure a top publishing Scientist with loads of patents under ur belt.\n\nWhen you wanna transition to industry (non-scientist roles), suddenly your publications mean nothing.......",
      "author": "nixeij",
      "created": 1599209247,
      "upvotes": 68,
      "replies": {
        "g3yoqzr": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yoqzr/",
          "text": "“your publications mean nothing...” Ah hits close to home.",
          "author": "cobie1em0ji",
          "created": 1599211471,
          "upvotes": 30,
          "replies": {}
        },
        "g3z5a4s": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z5a4s/",
          "text": "A lot of the time in science roles even the publications mean nothing. \n\nI just hired 2 PhDs and didn’t even look at their publications.",
          "author": "Prophetic_Hobo",
          "created": 1599223403,
          "upvotes": 14,
          "replies": {
            "g44kzis": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g44kzis/",
              "text": "What did you look at?",
              "author": "HigHog",
              "created": 1599316003,
              "upvotes": 1,
              "replies": {
                "g44lva9": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g44lva9/",
                  "text": "Specific needs that my group had.  I had both present work from their previous jobs or postdocs. I was mostly interested in seeing them tell a story. What did they work on? What was hard about it? How did they overcome challenges?\n\nBased on these presentations I can make decisions about whether or not they have the skills needed. \n\nThere’s always a lot of doom and gloom in these sorts of posts. In all honesty it takes a lot of interviews and applications before most people transition out of academia to the industry. If you work hard enough it will happen. \n\nIt also helps if you are in an area where there’s lots of jobs for your background. In life science for instance, Cambridge, MA and the Bay Area are the two major locations. It’s going to be a lot harder to score that biotech job in Kansas.",
                  "author": "Prophetic_Hobo",
                  "created": 1599316390,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g3ymbj2": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3ymbj2/",
      "text": "I'm about to be able to answer this. I'm trying to make the switch to \"industry\" (whatever that means for my field) to prioritize living with my partner, and I'm constantly plagued by comments I hear that people would rather employ someone without a PhD than with one. I'm starting to regret it a little because I was under the impression that I would come out *equally* employable to when I just had a Master's, not *less* employable, and I feel betrayed. But doing the PhD was an excellent experience for personal growth, whether that is ever reflected by anything external to my own thoughts or not.",
      "author": "papayatwentythree",
      "created": 1599208719,
      "upvotes": 80,
      "replies": {
        "g3ypois": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3ypois/",
          "text": "Is PhD an exercise in masochism?  Sounds like living in poverty and stress for 5+ years to decrease your job opportunities.",
          "author": "battle-obsessed",
          "created": 1599212506,
          "upvotes": 68,
          "replies": {
            "g3yq0bc": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yq0bc/",
              "text": "Yes\n\nAs someone at the end of my PhD, after starting it knowing I didnt want to continue with academia, this hurts.. thought it would increase job ops outside of academia too but doesnt seem to be the case :(",
              "author": "Diddly_eyed_Dipshite",
              "created": 1599212869,
              "upvotes": 29,
              "replies": {}
            }
          }
        },
        "g3ysft9": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3ysft9/",
          "text": "I'm starting the last year of my PhD and I'd like to switch to industry for the same reason as you. What I've been noticing, at least for my field, is that it works in waves. O didn't want to do a PhD in the first place, but all the jobs I wanted required a PhD or 4 years of experience. Now I'm seeing less, but from time to time there's something that pops up. Like someone said to me the other day, the problem after getting a PhD is that you're \"too old, too expensive and too specialized\"",
          "author": "1popu1ar",
          "created": 1599215482,
          "upvotes": 25,
          "replies": {}
        },
        "g3zqe6r": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zqe6r/",
          "text": "I made the jump to industry and found that the Ph.D. is both a positive and negative. It does make certain jobs difficult to get because you are \"overqualified.\" However, once you're in that industry, it leaves you in an excellent position to advance quickly. You've already got a terminal degree, so no education requirements will stand in your way for the rest of your career (except specific certifications or subject matter expertise). Once you're in, all you need is experience. Spend a few years getting experience and suddenly you're extremely employable.\n\nMaking the initial shift from academia is the hardest part. And it's hard. Requires a lot of researching, understanding how to market yourself, networking. It can even take years while you work whatever jobs you can to pay the bills.",
          "author": "cee2027",
          "created": 1599231536,
          "upvotes": 14,
          "replies": {
            "g3zu42q": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zu42q/",
              "text": "This actually makes me feel a bit better somehow. Thanks for letting me know there's light at the end of the tunnel!",
              "author": "papayatwentythree",
              "created": 1599232857,
              "upvotes": 4,
              "replies": {}
            },
            "g404l0p": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g404l0p/",
              "text": ">I made the jump to industry and found that the Ph.D. is both a positive and negative. It does make certain jobs difficult to get because you are \"overqualified.\"\n\nThe flip side also being that as you accrue more experience in a field you are also \"overqualified\" so there is a point where you really can't win.",
              "author": "ManInBlackHat",
              "created": 1599236511,
              "upvotes": 2,
              "replies": {
                "g4091ws": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g4091ws/",
                  "text": "That can be true, but once you're in an industry and understand which direction you want to take your career, it makes networking much easier. And many (perhaps most) jobs are won through networking and knowing the right person, rather than blind application.",
                  "author": "cee2027",
                  "created": 1599237989,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "g3z8k80": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z8k80/",
          "text": "If you feel like your PhD is a barrier to employment, how hard would it be to omit it from your applications? (the ~4 year employment gap this would create would need to be addressed of course) unless you think age is also part the problem? Just curious as I've heard of this being done by some older PhDs I asked about this when starting my masters. But never got details on what they did exactly.",
          "author": "non-inverting-op-amp",
          "created": 1599224988,
          "upvotes": 6,
          "replies": {
            "g3zcgxq": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zcgxq/",
              "text": "I have considered lying about the last six years, yes. It would mean not only removing my PhD from my listed education, but most of my work experience too (teaching and other nont-teaching academic jobs). My MA was in the same field, so if an employer really has a problem with it, then that's eight years of my life in a black hole instead of six. It would also leave me unable to express my mastery of all of the skills I had to learn over the course of the PhD.\n\nThis isn't to say that I and other people in this situation aren't trying to find a solution. But our (failed?) attempts to approach the non-academic job market are not the root issue here. The actual problem is that employers decide who starves in the street and who doesn't, and many of them have decided to hold PhD's to different standards than the rest of the applicant pool. I doubt they will receive any pushback for their prejudice, given that everyone else stands to benefit from the reduced competition. But given how quickly demand changes for specific fields/industries, there needs to be a better way to 'start over' so to speak.\n\nOn the other hand, the other recent graduates from my department are all enjoying success in academic and industry jobs. I think a big factor in this is how important networking is to finding employment. And through diligence I did have a pretty solid network back in the US. However, right before COVID I moved to Northern Europe to be with my partner, and now I'm facing another networking-driven job market with no ability to network. So my pessimism is in part due to putting myself between a rock and a hard place, I admit. But man, I would take a minimum wage job just to have some stability right now, but I don't think I have any way to get one with my work history.",
              "author": "papayatwentythree",
              "created": 1599226481,
              "upvotes": 9,
              "replies": {}
            },
            "g406u7y": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g406u7y/",
              "text": "My mum did that when she wanted to get a chill office job to tide her over til retirement (after getting made redundant from her lecturing position). \n\nAfter 40 or so rejected applications she just changed her CV to something like ‘bachelors and further qualifications’. Got a job very soon after that",
              "author": "sexy_bellsprout",
              "created": 1599237256,
              "upvotes": 7,
              "replies": {
                "g42ccsi": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g42ccsi/",
                  "text": "Bachelors and further qualifications\n\nHow elegant and efficient!",
                  "author": null,
                  "created": 1599265491,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "g44ms3i": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g44ms3i/",
              "text": "I hire people. I’d be suspicious of a gap like that with no good explanation. Plus a casual google search (not to mention a more rigorous background check) of your name would likely yield that you had a PhD. If I was looking at a candidate and they failed to mention a PhD and I found they had one I probably wouldn’t hire.",
              "author": "Prophetic_Hobo",
              "created": 1599316782,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g3yqb62": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yqb62/",
      "text": "Enjoyable, but, no, not worth it in terms of opportunity cost.",
      "author": "mbfunke",
      "created": 1599213203,
      "upvotes": 26,
      "replies": {}
    },
    "g3ywnzn": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3ywnzn/",
      "text": "Lol, reading this only a month away from starting my PhD is a little demoralising....",
      "author": "WhereChanceFalls",
      "created": 1599218457,
      "upvotes": 42,
      "replies": {
        "g3z5kf2": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z5kf2/",
          "text": "Yes. Agree these posts draw in the most angry. My PhD was 100% worth it. In STEM, got a job pretty easily and the PhD was necessary for what I want to do in the short and long term.",
          "author": "Prophetic_Hobo",
          "created": 1599223552,
          "upvotes": 35,
          "replies": {
            "g3z8h2v": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z8h2v/",
              "text": "Which part of stem?",
              "author": "idk7643",
              "created": 1599224953,
              "upvotes": 2,
              "replies": {
                "g3zg2y2": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zg2y2/",
                  "text": "Life sciences. Have a PhD in Biophysics and work in biotech.",
                  "author": "Prophetic_Hobo",
                  "created": 1599227830,
                  "upvotes": 9,
                  "replies": {
                    "g40idgp": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40idgp/",
                      "text": "Intresting. I was thinking about going into biotech but I suck at math. I instead decided to go for the pharmaceutical industry, but there it seems like a PhD isn't necessary",
                      "author": "idk7643",
                      "created": 1599241181,
                      "upvotes": 5,
                      "replies": {
                        "g44m0qy": {
                          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g44m0qy/",
                          "text": "They are two sides of the same coin. In my job I don’t do a lot of day to day heavy math. A basic understanding should be enough.",
                          "author": "Prophetic_Hobo",
                          "created": 1599316460,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g3yy6gd": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yy6gd/",
          "text": "Remember that these posts often draw the most upset people. It’s not always an accurate depiction",
          "author": "crimbuscarol",
          "created": 1599219401,
          "upvotes": 53,
          "replies": {}
        }
      }
    },
    "g3yrps5": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yrps5/",
      "text": "Define academia.\n\nI ended up in a PI position at a government lab, which I love. I am very very happy to not be a prof where you're asked for way too much in return for way too little.",
      "author": null,
      "created": 1599214715,
      "upvotes": 37,
      "replies": {
        "g3z9fll": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z9fll/",
          "text": "I’d also like to get into govt research, do u mind telling us how your found the job? USA jobs or other online posting? Or through their website? Or a personal connection? Curious",
          "author": "onetwoskeedoo",
          "created": 1599225342,
          "upvotes": 5,
          "replies": {
            "g40ho8e": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40ho8e/",
              "text": "Part personal connection, part USAjobs. My position was advertised with a title I normally wouldn't have been searching for (Research Hydrologist), but a colleague in the agency forwarded me the posting and encouraged me to apply.\n\nI interviewed for 2 other federal scientist positions before getting this job, both of those I found on USAjobs.\n\nGood luck!",
              "author": null,
              "created": 1599240953,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "g3zaepu": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zaepu/",
          "text": "About to transition to my new government lab PI position in three weeks. Excited and scared.",
          "author": "PM_me_your_squids001",
          "created": 1599225703,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "g3z7e0c": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z7e0c/",
      "text": "As a life experience: Yes. The middle 3 years of my PhD were the some of the worst years (but not THE worst) of my life, but the people I met and the research I got to do in my last 2 and first year made it worth it. I had a pretty great (albeit maybe  a little too hands off) advisor during my PhD which was also nice.\n\nCareer-wise: The job I work in now is pretty cushy, but requires a PhD so it was worth it I guess. In my field however lifetime earnings are probably inversely correlated with level of degree (chemical engineering). We start higher but cap out lower. I'm not sure how many jobs there are out there for me if I end up getting laid off from my current position, although I suspect it's not a ton. I'm planning on getting an online MS in analytics from Georgia Tech, maybe have my work pay for it and transition me into a role that uses this degree in a meaningful way.",
      "author": "ColickingSeahorse",
      "created": 1599224460,
      "upvotes": 11,
      "replies": {}
    },
    "g3zj6cg": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zj6cg/",
      "text": "I'm going to answer this on behalf of my husband who doesn't have Reddit:\n\nHe absolutely loved his physics PhD topic and experience, though towards the end he was feeling frustrated about his research not having enough of a \"real world impact.\"  But in terms of life experience, well we met each other and got married while both in grad programs so I have to think there were some good life experiences, lol, not to mention he made a number of close friends who are still both in his personal and professional network today.\n\n\nHe currently works in tech and after two years is making more than he could have ever expected even at peak career in academia, and he says it's way more creative and flexible. He says he feels like a researcher still and that he is still solving complex math problems all day but now has a far better environment, pay, and better hours. Unlimited PTO, flex can work remotely whenever he wants, structured hours so not working at all times, etc. And he likes that he's solving problems that have a real time impact. Most of his team has PhDs.\n\n\nI was in a PhD program too in a different field, quickly realized I wouldn't want to pursue an academic track in that field alone, but decided to \"masters out\" and go to law school because so much of my research intersected with law and so many of my desired outcomes would also be better served by a JD. With my MA, I was still able to work in some relevant areas and didn't realize beforehand how much of a boost that alone would give me, but now I honestly love my JD program and I have a dream now of being a law professor at the intersection of where my grad school research was and law. So I guess I'm the reverse of this question, where I decided to leave a PhD but may still want to pursue academia, lol. I also find a number of both professors and practitioners\n who have my MA/JD combo, many of whom had the same experience as me of mastering out and taking up law, so it's been a surprisingly useful networking device.",
      "author": "FuzzyJury",
      "created": 1599228999,
      "upvotes": 13,
      "replies": {
        "g42s811": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g42s811/",
          "text": "What does your husband do? I’m trying to explore alt-ac careers.",
          "author": "tiensij",
          "created": 1599275132,
          "upvotes": 2,
          "replies": {
            "g4gc9sp": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g4gc9sp/",
              "text": "He is a data scientist. But I think that term can mean different things depending on your company. Out of three of our close friends who each have that label,  it seems they have very different roles: one is almost treated as a pure statistician, another more as a machine learning engineer, my husband more finds himself as the person who tells the engineers what to make, etc.  There's a lot of overlap I'm sure, but it also seems that different companies emphasize different parts of that job label.",
              "author": "FuzzyJury",
              "created": 1599582031,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g3yq1w1": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yq1w1/",
      "text": "Life experience: neutral. I did my PhD part-time while working in a related career so it sort of felt just like an extension of my day job.\n\nCareer-wise: no. I don't have much more of an advantage over non-PhDs. Industry experience and professional networks is what really counts when it comes to climbing the ladder.\n\nFinance-wise: absolutely not. I was lucky in that my PhD was sponsored by my employer so I was earning a relatively substantial salary. Some of my peers sacrificed 5-7 years of good earnings and, most notably, all-important early career pension contributions through doing a PhD. The effects of compounding interest means they were setback quite substantially in this regard.",
      "author": "jimmythemini",
      "created": 1599212919,
      "upvotes": 23,
      "replies": {}
    },
    "g3yt8z7": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yt8z7/",
      "text": "I went to government after my PhD. Hated it so much. I was hired as a statistician and had to use excel as my main analytical tool. Most of my analyses were silly simple things and fact-checks. Losing that intellectual stimulation was pretty demoralising. I moved country and got back into academia, first as a research assistant and then postdoc. Academia is precarious and it may not be a permanent gig, but I love being back.\n\nEDIT: re-read the question and remembered why I wanted to answer. For government, there was absolutely no reason to have a PhD. Those years felt wasted. But there were many others like me who were burned out after their studies.",
      "author": "DrLaneDownUnder",
      "created": 1599216146,
      "upvotes": 27,
      "replies": {}
    },
    "g3zzcy2": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zzcy2/",
      "text": "Absolutely.  The process of getting a PhD has taught me how to approach problems in a more systematic way and ~~completely~~ mostly reigned in my scatter-shot approach to thinking.\n\nAll of this happens independent of whatever PhD project you work on.  No one's dissertation matters.  the PhD is about the _process_.",
      "author": "fumblesmcdrum",
      "created": 1599234666,
      "upvotes": 11,
      "replies": {}
    },
    "g419xna": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g419xna/",
      "text": "Yes and no.\n\nOn the not worth it side:\n\nI got totally screwed on pay scale upon transition, as it is well known that PhDs are coming from salaries of 20-35k (or even less).  This will be used against you and you will not have much leverage at first.  I was offered significantly less than both someone with a Masters who had 1 year in the role and significantly less than someone with a postdoc in the same role with no experience, and I completely outperformed both.  I am in the process of renegotiating my salary while in discussion with another 2 companies that, if I get an offer, would double my salary, PLUS bonus.  \n\nI probably did irreparable damage to my body by over drinking in grad school.  Not good.\n\nI trained myself to rarely seek health care, mental health care, spend money or take vacations during the PhD.  Not good.\n\nThe PhD trains you to accept what you have instead of leaving for something better.  Not good.\n\nDidn’t make retirement contributions for a long time.  Not good.\n\nI cringe whenever someone calls me Dr. tiddies_akimbo.  Fuck you and fuck that shit, pay me.\n\nThe worth it side:\n\nHad some fun & made really great forever friends.\n\nSome dudes are really into that kind of thing & think it’s hot lol\n\nI’m pretty scrappy now and can probably figure out how to do anything without instructions.\n\nI have some really weird & obscure skills that might serve well in an emergency field medic or apocalypse setting.",
      "author": "tiddies_akimbo",
      "created": 1599250272,
      "upvotes": 12,
      "replies": {}
    },
    "g3yo587": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yo587/",
      "text": "For me, no. It was five years of hell I'll never get back. I wish I had switched majors at the bachelor's level to avoid having to go to graduate school to even be competitive in the job market.",
      "author": null,
      "created": 1599210804,
      "upvotes": 16,
      "replies": {
        "g3yxfbz": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yxfbz/",
          "text": "Out of curiosity, what major(s) would you have chosen to pursue instead knowing what you know now?",
          "author": "fuschiaoctopus",
          "created": 1599218931,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "g3z1wie": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z1wie/",
      "text": "I got a good offer in industry (actually public sector) before I wrapped up my final year. Resulted in me going to work before my dissertation was fully drafted. The last year had been tough, dealing with workload on both end, the job and then the drafting of my journal submissions. But, last night at 03:47 I wrapped up my final journal submission. Also, because I'm doing Phd by publication, my dissertation defense is basically just for show.  \n\n\nNever had any intention of ending up in academia.",
      "author": "scromboidfish",
      "created": 1599221591,
      "upvotes": 8,
      "replies": {}
    },
    "g402dkh": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g402dkh/",
      "text": "I think it depends on why you’re getting a PhD and what you want to when you get out. I’m approaching defense. Grad school has been psychologically crushing, and to echo other comments I’ll admit I’m totally disillusioned with academia. However, I don’t regret time spent in grad school one bit, because I didn’t come here to get a job. I came here to learn, and I’ve gained an incredible suite of skills, knowledge that I treasure, and a more informed world view. I plan in part to work in student capacity building and advocacy when I get out, as well as helping build bridges between the scientific community and the general public, so even the aspects that were demoralizing and dysfunctional have been instructive to me. I wouldn’t give that experience up for a second.",
      "author": "lobster_claus",
      "created": 1599235712,
      "upvotes": 9,
      "replies": {}
    },
    "g40ogin": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40ogin/",
      "text": "This is the $1MM question.\n\nDid I come out of this a \"better\" person? Sure, I know my writing skills, critical thinking, lab skills, scientific knowledge, and domain expertise were immeasurably improved. My personality definitely took a hit and I had a lot of residual anger and bitterness coming out of the process - I didnt even attend the commencement ceremony because of the bad vibes.\n\nNow, in terms of \"was it worth it\" - I still feel like I lost 7 years of my life that I will never get back. I'm behind on lifetime earnings and savings relative to my peers who didnt do PhDs, and I am not sure if I will be able to _ever_ catch up. I'm still yet to find a job that actually utilizes the skills and knowledge that I got from my PhD - academia is saturated to hell, and I didnt do a postdoc. Industry R&D positions in my field are equally saturated now due to the overproduction of PhDs. \n\nI was unemployed for 2 years after my PhD...it was a real struggle to land my first job. The first job I was able to get was in management consulting (which had nothing to do with my PhD). I left that company after a year and a half when they announced they were closing down the office and moving to a significantly higher COL area with no adjustment to the absurdly low salary. Oh, and they used the fact that I didnt have an MBA as an excuse to keep my job title and salary low. I was unemployed for exactly 1 year to the day after that. Now I work in sales for a CMO. Did either of these jobs require a PhD? Nope.",
      "author": "PM_ME_GRANT_PROPOSAL",
      "created": 1599243125,
      "upvotes": 8,
      "replies": {}
    },
    "g41j7l4": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41j7l4/",
      "text": "It’s been the sole cause of my ongoing struggle with depression since I graduated 9 years ago. Being at the top of my class with several publications before I defended, I assumed I would find a tenure track job. Nope. Ended up falling back on university fundraising and have been there ever since.\n\nIf you’re not in academia or in a field where there is a need for a PhD in private industry, no one cares how many letters you have after your name. Sometimes it helps with hotel upgrades...so yeah, waste of time.",
      "author": "ephi1420",
      "created": 1599253189,
      "upvotes": 8,
      "replies": {}
    },
    "g3z5vjb": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z5vjb/",
      "text": "Going into my third year of my PhD and am majorly concerned rn reading this shit. I already hate my life in grad school too.",
      "author": "foxygapher",
      "created": 1599223702,
      "upvotes": 14,
      "replies": {}
    },
    "g3zlnf0": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zlnf0/",
      "text": "Completed a PhD in mechanical engineering from a top tier university. Started a B2B SAAS company which got acquired recently. Frankly, I could've done it without my PhD. Right now I'm thinking of what to do next. I could retire at 33. Or start another venture but it's unlikely to be related to mechanical engineering. If it is then I might find my training useful.",
      "author": "slowpokesardine",
      "created": 1599229869,
      "upvotes": 7,
      "replies": {
        "g40sh1k": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40sh1k/",
          "text": "What industry?",
          "author": "reed17purdue",
          "created": 1599244393,
          "upvotes": 1,
          "replies": {
            "g40skrr": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40skrr/",
              "text": "Adtech",
              "author": "slowpokesardine",
              "created": 1599244429,
              "upvotes": 2,
              "replies": {
                "g40wj50": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40wj50/",
                  "text": "is it normal for founders who get acquired early in their age and have no idea what to do next and join the industry doing job as a manager/tech guy etc?",
                  "author": "rajatrao777",
                  "created": 1599245762,
                  "upvotes": 1,
                  "replies": {
                    "g410kwx": {
                      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g410kwx/",
                      "text": "The route they choose is diverse. Some retire, some consult on the side, some stay with the business for some time (or as required by the acquisition agreement), some go on to work on a new project usually related to their expertise. I haven't seen many ppl become employees (tech guys or mgmt) although I know a PhD who started a company, that got acquired and then he went on to became a tenure track professor (assistant professor at the moment). For me I'm quite interested in the real estate tech space, the industry is ripe for disruption, so I want to explore this area in the near term.",
                      "author": "slowpokesardine",
                      "created": 1599247047,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g40km03": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40km03/",
      "text": "Funny enough it depends on my mood. When I'm feeling positive and like 'everything is a learning experience', I feel like it was. When I'm feeling kind of down and negative, I feel strongly like it wasn't worth it.",
      "author": null,
      "created": 1599241909,
      "upvotes": 6,
      "replies": {}
    },
    "g41ai0b": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41ai0b/",
      "text": "Yes. I had a great time. \n\nI got to spend 5 years in a different part of the US and was well-funded (relatively speaking) through a combination of fellowships plus LCOL. I put away almost $30K in savings despite living alone, eating out regularly, and buying pretty much whatever I wanted. \n\nI had a very hands-off advisor, which was great for me personally because I basically got to do whatever I wanted. My dissertation research was entirely of my own design, and I felt a great sense of ownership over it. I would get stressed out when deadlines approached or I ran into issues during my field seasons, but otherwise it was easy going.\n\nI now work in government regulation and planning, where I don’t really do research or data analysis, but I still utilize my grant writing and various fieldwork skills. The hours are great, and while there are frustrations related to bureaucracy and annoying members of the public, the stress of expectation is generally low. My job doesn’t require a PhD, but I do get a percentage of my base salary added as an educational incentive because of it, so I am still getting something from my PhD in a sense. \n\nI don’t know that I’ll stay in this particular type of job forever; I might try to transition to a government position with a bit more of a research component, but I’m not itching to leave either. I think I got my fill of research during grad school if it comes to that.",
      "author": "GRCA",
      "created": 1599250461,
      "upvotes": 6,
      "replies": {}
    },
    "g3yqw41": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yqw41/",
      "text": "[deleted]",
      "author": null,
      "created": 1599213826,
      "upvotes": 10,
      "replies": {
        "g3ziig5": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3ziig5/",
          "text": "I was thinking about that. I'm in life sciences, but even I realised by reading senior level job descriptions, that a PhD isn't a requirement. At most, it's a \"nice to have\" thing, but usally a masters plus 3-4 years extra experience (length of PhD) is equal to a PhD candidate.\n\nSo why would I spend 3-4 years of my life being payed less than minimum wage, just to end up with the same employability as someone who had proper work experience and a decent salary all this time?",
          "author": "idk7643",
          "created": 1599228755,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "g3yquf8": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3yquf8/",
      "text": "[deleted]",
      "author": null,
      "created": 1599213776,
      "upvotes": 40,
      "replies": {
        "g41hwqd": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41hwqd/",
          "text": "I’m relating hard.  I’m from a bit of a small town, redneck, downwardly mobile area wrecked by the opioid crisis — my PI used to say stuff like “you’re not exactly the scientist type” in an endearing way lol",
          "author": "tiddies_akimbo",
          "created": 1599252761,
          "upvotes": 3,
          "replies": {
            "g41lahq": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41lahq/",
              "text": "[deleted]",
              "author": null,
              "created": 1599253836,
              "upvotes": 5,
              "replies": {
                "g41o21p": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41o21p/",
                  "text": "For sure.  It doesn’t help that the “better” the school you get into is, the more likely it is to be in a high COL area.  More likely to be admitted with rich kids.  \n\nWhen I had originally interviewed, I was talking with a fellow candidate who said that her dad sent her on a safari as a graduation gift from undergrad.  She had just gotten back from that safari prior to interview weekend, meaning she also didn’t have to work in between undergrad (Harvard) & grad.  I learned that she did one 6month research assistant internship in college, that’s it.  I had 2 years in the lab during school, multiple papers including a first authorship, two years working in a lab AFTER (very modest non-flagship) college, and could barely get interviews anywhere.  And yeah.. no time or money for safaris lol.",
                  "author": "tiddies_akimbo",
                  "created": 1599254644,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "g3z53vn": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z53vn/",
          "text": "[deleted]",
          "author": null,
          "created": 1599223317,
          "upvotes": 6,
          "replies": {
            "g3z5jnd": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z5jnd/",
              "text": "[deleted]",
              "author": null,
              "created": 1599223540,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "g407uey": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g407uey/",
      "text": "I did have a research postdoc for a couple of years after my PhD, but I didn't end up teaching in a university. My PhD and postdoc involved a lot of translation, and I realized I could do that as an everyday job, so that's what I do now. But the sequence of events that led to this job depended on me getting a PhD first. I'm really not sure what I'd be doing without that! \n\nPlus, now I get to work from home, and I can still do academic research and write. So it was definitely worth it, for me.",
      "author": "WelfOnTheShelf",
      "created": 1599237602,
      "upvotes": 5,
      "replies": {}
    },
    "g3zg4wp": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zg4wp/",
      "text": "Overall, yes. There's definitely some opportunity cost, but I realize now that to many people, a PhD is some mythical thing that you can use to unlock a lot of opportunities. Oh yeah, and some of the stuff I learned is useful too.",
      "author": "QxV",
      "created": 1599227850,
      "upvotes": 9,
      "replies": {}
    },
    "g402c1o": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g402c1o/",
      "text": "Career options vary widely based on the degree. For example, within psychology, graduates from social psychology programs rely primarily on academic job opportunities, industrial/organizational psychologists have academic and applied opportunities, and clinical psychologists are proportionally look at more applied positions.\n\nSide note on this, I have observed that those in disciplines with a primarily academic focus don’t realize just how prevalent and necessary PhDs are for certain occupations.",
      "author": "_Sigmund_Fraud_",
      "created": 1599235698,
      "upvotes": 4,
      "replies": {}
    },
    "g40aapt": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40aapt/",
      "text": "For me, it was totally invaluable. I started grad school with the goal of being a professor, but always knew the odds were super low. I had a great postdoc fellowship, but ultimately went into industry because I had a lot of student loans from undergrad and decided the financial security was more important to me at that moment.\n\nFast forward nearly five years later and I'm making an absolute ton of money, way more than I ever expected I could make. And furthermore, I love my work. I certainly miss doing research, but I don't miss trying to do research with the tiny budgets common in academic labs.",
      "author": "OpticaScientiae",
      "created": 1599238465,
      "upvotes": 3,
      "replies": {}
    },
    "g407k8u": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g407k8u/",
      "text": "Well, I don't have my PhD (mathematical statistics) yet but I expect to graduate in December. I started job hunting late July and accepted an offer today, so roughly one month of job hunting. And the PhD was crucial to the job, and the job pays very well, so... seems to have worked out.\n\nI did my PhD because it was what I wanted to do in life, because I love my field of study, and I still do. Also, it does seem that the PhD experience, with teaching in particular, helps ensure you develop good communication skills that the job I'm going to accept seemed to really want to test my ability in, since in teaching you need to talk to non-experts in addition to experts. But when someone asks whether they should get a PhD my advice will always be \"Do so only if you love that field.\"",
      "author": "NTGuardian",
      "created": 1599237509,
      "upvotes": 3,
      "replies": {}
    },
    "g41ghqp": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41ghqp/",
      "text": "As a life experience, yes - it was something that I would almost never think, or be able to, do in any other circumstance - for me it was a great learning experience, I got to travel the world and got paid reasonably well for it.\n\nCareer wise, I would say so. Could I have got into the same role without it? I think so. Would I have the breadth of experience, or authority? Probably not. I probably could have earned a few more quid going into industry straight after undergrad, but fuck it - that's life!",
      "author": "DhatKidM",
      "created": 1599252377,
      "upvotes": 3,
      "replies": {}
    },
    "g406uoh": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g406uoh/",
      "text": "Yes. Though for what I do now, it was completely unnecessary.",
      "author": "wondert",
      "created": 1599237261,
      "upvotes": 2,
      "replies": {}
    },
    "g40bqhj": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40bqhj/",
      "text": "Yes. Though I'm not in academia anymore, I was for a bit, and it was an experience I wouldn't want to have missed out on. I also enjoyed the time I spent both during and after my PhD. I spent five years in an amazing country working on interesting research. Don't regret it at all.\n\nProfessionally, it's hard to say. It did help me get my current job, but the alternative would have been spending several more years as a software architect leading into whatever that would lead into, and I will likely never make up those lost earnings, even if getting the PhD ultimately has a higher ceiling on my career progression (which is itself debatable).",
      "author": "deong",
      "created": 1599238976,
      "upvotes": 2,
      "replies": {
        "g4193ng": {
          "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g4193ng/",
          "text": "1.Does being in academia mean professor position?\n\n2. Does Ph.D in CS subject help in your day to day work ,is it research oriented or coding?Which subject in Ph.D?How deadline works in a research oriented work where one is unaware of whether results are going to obtain or not?\n\n3. Can you still publish papers independently?\n\n4. Can you describe your Ph.D journey in brief if possible(any ups or down facing anxious),did you had masters before that,how much autonomy does one get to research on what one wants rather than what advisor tells you to?\n\n5. Did you had clarity that you wanted to get into industry after Ph.D,didn't you feel being left out of fast paced industry\n\n6. Do you think most people are getting into industry after Ph.D rather than in academia due to financial reasons\n\nThanks",
          "author": "rajatrao777",
          "created": 1599249986,
          "upvotes": 1,
          "replies": {
            "g44n7sj": {
              "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g44n7sj/",
              "text": "Not sure whether I'd say I was a professor or not. My job was with a non-profit research institution affiliated with a university. I did have a joint appointment to the university with something like a \"Visiting Professor\" title, but it was a permanent position. I taught 1-2 classes a year and otherwise just worked on my research.\n\n1. The PhD does help a bit in my day to day work, but my job doesn't involve active research anymore. My current role is Director of Data Science for a publicly traded company. I help steer the work we're doing, but it's decidedly not research in the classic sense, and I don't publish at all. More than half of the job is what in the academic world we'd call \"administration\" (budgeting, people-management, negotiating contracts, etc.).\n\n2. I could publish work I do in my own time. If it were company paid work, I'm actually not sure. It's just not really part of the job description and I never bothered to ask.\n\n3. The PhD journey was a little rocky. I did an undergrad and masters (in a completely different area of Computer Science) at a lower tier university and then got a normal job. About a year later, I had gotten interested in a particular new area that's now considered part of Machine Learning I'd been reading about and decided I'd try for a PhD. I was accepted at a university with a pretty big name in that field, but at that point, I had no real idea how to be a researcher, and I'm not sure he was used to dealing with a student coming in quite that green. So I felt like I wasn't making progress (I'm sure he would agree), and I didn't really have a productive way to channel that into any tangible improvement, so instead I spent some time watching a lot of Simpsons reruns and then bailed. I landed what was basically an adjunct job while I was going to figure out what was next, and over the course of that year, started to figure some things out a little better. I also had some really supportive colleagues who helped talk my confidence back up a bit, and I applied to a different university to basically restart the PhD, and at that point, it was extremely smooth sailing. I was still a bit slow to finish, as my project funding from the military was cut when I was ABD, and I went to work full time as a software engineer while I finished the writeup, and that six months took me two years, but I was publishing quite a lot, and overall it was a great experience.\n\n4. So for the last two years of my PhD, I was in industry writing software. I kept that job for two years after finishing the PhD as well. During that time, I continued to collaborate with colleagues on my own time and published more papers, went to conferences, etc. I still very much wanted to be in academia, but it was exhausting. At some point, I figured I had to just do it or stop trying, so I applied for academic jobs, got a few interviews, and took a job in Europe. I was there for five years, and really enjoyed *most* of the work. Two things happened: I met my (now) wife, and for a handful of reasons, it made some sense to consider moving back to the US. And secondly, I had landed a grant from the EU a few years prior, which was my first taste of life as a more senior academic, and there was quite a lot about that I didn't enjoy. I had the same experience a lot of new faculty have -- I'm hiring students to do what I wanted to do while I'm just begging for money for the next project that I'm at best half-interested in. So I talked to a few people, and ended up taking an industry position back in the US that, as I mentioned, uses my skills, but is wholly outside of the research world really. I still miss the fun parts of my job, and I liked living there more than I like the US, but I don't miss the 60% pay cut and constant begging for money.\n\n5. I don't know that I have any special insight here, but I would guess that most people who go to industry after a PhD are doing it because they were forced to. They probably did a PhD because they wanted a TT faculty job, and they slammed into a job market in which like three universities produce enough PhDs every year to fill every open position in the United States, and faced with making $8000 a year with no health insurance or finding a real job, they choose wisely.\n\n\n**Edit:** Just realized that in all that, I didn't really answer your question about what the PhD was like. In short, it varies wildly depending on your advisor and situation. My (first) advisor very much took the approach that finding a good problem to work on is part of the training, and while he would help you, that was your conversation to drive. I think that's a healthier approach, but it was a recipe for failure with me at the time (my own fault -- don't take that as criticism). I had friends who in their first meeting with their advisor, had a 30 minute conversation about their interests, and then he grabbed a folder out of a file cabinet, handed it to them, and said, \"Solve this problem and you get your PhD\". I think the most common thing is that you're hired to work on an existing grant, and over the course of your studies, you carve out some piece of that work that is your own contribution, and that becomes your research.",
              "author": "deong",
              "created": 1599316966,
              "upvotes": 2,
              "replies": {
                "g44wn5q": {
                  "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g44wn5q/",
                  "text": "Thanks for sharing your exp :)",
                  "author": "rajatrao777",
                  "created": 1599320976,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g40gtpl": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40gtpl/",
      "text": "I work in government research doing everything an academic does except teach. It was worth it.",
      "author": "Frogmarsh",
      "created": 1599240669,
      "upvotes": 2,
      "replies": {}
    },
    "g42qbdb": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g42qbdb/",
      "text": "Yes. I'm currently in academia again, but I worked in the industry for 5 years, and never regretted the PhD. If I leave academia again (which is often tempting), I will regret some of the decisions I made during my current stint (could have progressed faster; could have picked the research topic a bit smarter), but not the time of my PhD. Learning stuff properly is worth it. 4 years of bachelor is barely enough.\n\n(In fact, I'm regularly  dreaming of doing another PhD in at least 2-3 completely unrelated fields, and then every time I have  to shake myself, and remind myself that I cannot afford it right now :) But it's so tempting!)",
      "author": "ampanmdagaba",
      "created": 1599273928,
      "upvotes": 2,
      "replies": {}
    },
    "g3z6ijt": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3z6ijt/",
      "text": "Without my PhD not only would I not have my career but my life wouldn’t be what it is (and I’m not giving up the good parts in-spite of the bad)",
      "author": "k0np",
      "created": 1599224031,
      "upvotes": 5,
      "replies": {}
    },
    "g3zqoez": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g3zqoez/",
      "text": "Career wise? Yes, I absolutely love my job and you simply can not get such a position without a ‘D’ degree (PhD, MD, PharmD) these days.  Life experience wise? For sure, learned so much, established effective working methods and strategies that have served me well in life, made great friends and many professional connections.   Was it easy? No.  Has it paid off for me many, many times over? Yes.",
      "author": "Jobs-",
      "created": 1599231644,
      "upvotes": 2,
      "replies": {}
    },
    "g40vq1b": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g40vq1b/",
      "text": "100% yes. I did my neuroscience PhD thinking I would want to be a professor. After finishing, I moved home to do a postdoc, but then met someone, got engaged and got a dog and the academic life lost its sheen. I wanted to be home with the people (and animals) I love, go hiking, go to dinners, etc. I didn't do any of that while working in academia.\n\nSo, I got a job in biotech where I work 9-5, making a good 6-figure salary, doing nearly the same work I did in my postdoc (which I love). Life is good, and I couldn't be here without the PhD and the postdoc.",
      "author": "slugbearwave",
      "created": 1599245487,
      "upvotes": 2,
      "replies": {}
    },
    "g41dlyi": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g41dlyi/",
      "text": "Not much.",
      "author": "alex_raw",
      "created": 1599251519,
      "upvotes": 1,
      "replies": {}
    },
    "g42yr83": {
      "link": "/r/AskAcademia/comments/imbp07/for_those_of_you_who_didnt_end_up_in_academia/g42yr83/",
      "text": "I regret nothing. I'm incredibly proud of my degree and the skills I developed while pursuing it. Often I wondered what one step in my \"career\" had to do with another, but with a bit of perspective, it's \"interdisciplinary,\" yo! Edit: have been outside academia. Full disclosure: I'm an historian but day job is advising director.",
      "author": "karenaviva",
      "created": 1599279462,
      "upvotes": 1,
      "replies": {}
    }
  }
}