{
  "sid": "rb8qtg",
  "link": "/r/AskAcademia/comments/rb8qtg/almost_positive_im_going_to_drop_out_need_some/",
  "title:": "Almost positive I'm going to drop out, need some encouragement",
  "text": "So I'm in my third year of a molecular biology PhD program (USA) and the past hear has been a huge struggle for me. I'm not performing to my advisors standards, I have a really hard time with the unstructured work environment, I got a conditional pass (later full pass) on my qual this summer.  Not to mention my lab is small, the environment is antisocial, and there's no one I can really go to for support. \nMy advisor is nice but pushes a really u healthy work environment, and has told me on multiple occasions that I'm expected to put in extra work on weekends and evenings. I know this is pretty standard for academia but I'm just not cut out for it.\n\nI'm pretty much at wits end. I don't want a career leading research. All I've ever wanted was to be a high-level technician, and I wanted to get a PhD to avoid the pay ceiling. Now I'm realizing that I can still make enough money to be happy with only a master's, and I've kind of made peace with the fact that a PhD isn't for me. \n\nI just have no idea how to bring this up with my advisor and committee. I'm worried they'll be mad at me, try to convince me to stay, block me from even getting a master's, etc. I also feel incredibly guilty because my advisor is pre-tenure, and I know my leaving will look bad on her, not to mention that I haven't generated that much useful data. I left a toxic, controlling relationship earlier this year, and it was so hard to do but so empowering, and I know I'll feel the same way about this (lol), but I just don't know how to get the ball rolling. Any advice would be appreciated!",
  "author": "beepboopsboops",
  "created": 1638909121,
  "updated": 1639515558,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hnng9ox": {
      "link": "/r/AskAcademia/comments/rb8qtg/almost_positive_im_going_to_drop_out_need_some/hnng9ox/",
      "text": "Hi. I am a pre tenure prof. It is NOT your responsibility to get your advisor tenure. This is a totally normal thing that happens. If your advisor gives you a hard time, go to your chair or director of grad study. If you passed quals and have enough to get a strong first author pub for your MS, you are golden. I would never pressure a student to do this job unless they loved it. Life is short…do what you love if u can. \n\nGood luck!",
      "author": "hillbeany",
      "created": 1638918129,
      "upvotes": 11,
      "replies": {}
    },
    "hno6qc8": {
      "link": "/r/AskAcademia/comments/rb8qtg/almost_positive_im_going_to_drop_out_need_some/hno6qc8/",
      "text": "First, let me say I think it's perfectly reasonable to drop out of a PhD if you've realized it's not for you and/or you've decided on a career path that doesn't require one.  \n\n\nI also think it's reasonable to see if a different lab would be better. The mentor is absolutely the most important part of picking a lab, and it sounds like this mentor isn't a good fit for you. I've absolutely never worked for anyone who expected me to work nights/weekends. (Obviously sometimes I need to for my own goals, but there's never been an expectation that that was anything other than going above and beyond.) If you think you might want to try a new lab, I'd also recommend you see the student counseling office. Getting a PhD is very mentally challenging, and many many many students benefit from therapy (1/3 of the student counseling services utilized at my PhD institution were utilized by School of Medicine PhDs, even though they only made up \\~8% of the grad/professional student body).   \n\n\nIf you decide you want to quit (which again, I think is totally fine and even downright good if there's not a good reason to stay), I'd start by talking to your grad program admin about what the right steps to take are. There's no reason they should withhold a masters from you if you passed your quals. You'll need to write up a thesis, so you could get started on that if you wanted to speed this process up.\n\nTotally agree with Hillbeany that it's not your job to get your mentor tenure. Your job is to do what's best for you. Hopefully you can give your advisor a decent amount of notice, but if you do that's out of the kindness of your heart, not obligation.",
      "author": "queue517",
      "created": 1638930972,
      "upvotes": 4,
      "replies": {}
    },
    "hnp0pht": {
      "link": "/r/AskAcademia/comments/rb8qtg/almost_positive_im_going_to_drop_out_need_some/hnp0pht/",
      "text": "Hey, PhD is both mentally and physically challenging. Indeed, very well supervision and a nice atmosphere are two critical components that make you finish PhD and don't get crazy. I really understand you, as I also had these thoughts before I switched my lab.  Working at the weekends sounds really bad, even if it happens in many labs. I had this too and I felt that I cannot work like this: my brain gets floppy at some point, my time management breaks down, I drop out of my social circles, it affected my private life and I've got health issues, that took a while to bring myself back to the track. While, I have a friend, who is also doing PhD and she feels stressed only about research, but very happy with the working atmosphere and has time for everything. I realized, that it is super important to understand what conditions you need in order to succeed and feel happy. So I told my former PI and it did not work out. I left and started to look for a better place. Now I have so far an adequate PI and lab colleagues. So, before you quit academia, ask again whether you do not want PhD or just these conditions. Anyway, do not be afraid to leave. First, talk with your PI and say everything you mentioned here: that you are sympathetic to her and deeply sorry for bringing this now, but you are not happy due to la la la, and decided to quit. Maybe you will be told, that this feeling is normal, try again and etc. You can argue, that it affects you mentally and you are not working efficiently and feel big concern about it. Be confident about your decision. You can also inform the graduate school (this is what I did first, actually as i was on the stipend), maybe you can get some advice on that...Good luck!",
      "author": "cozy-scholar",
      "created": 1638950120,
      "upvotes": 1,
      "replies": {}
    },
    "ho28lbp": {
      "link": "/r/AskAcademia/comments/rb8qtg/almost_positive_im_going_to_drop_out_need_some/ho28lbp/",
      "text": "Geeeeet oooout.\nDoes your program offer a Master's for those who reached a certain level?  That would be nice but is not essential.\n\nI think there's a couple ways to finesse the leaving-a-program issue.  One is to say that you discovered you wanted to work in ____ rather than research.  Leave out the part about entering the program because you wanted to increase your.income potential.  Also leave out complaints about workload, hours, supervisors' expectations, and disliking your colleagues.  No complaints.  You entered the program because you thought research would be delightful, but it turns out you miss/are more thrilled by (what your potential employer does, i.e., applied work, achieving goals as part.of a team, seeing a product succeed, blahblah).\n\nThere's no reason to stay in the program if you don't enjoy any part of it.\n\nETA, to heck with making your advisors, PI, etc. happy.",
      "author": "x47126g",
      "created": 1639184800,
      "upvotes": 1,
      "replies": {}
    }
  }
}