{
  "sid": "hagwrf",
  "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/",
  "title:": "How do you switch off your brain and resist the constant urge to be productive in your free time?",
  "text": "For context, I recently finished a PhD in a subject I absolutely love and my graduate studies went really well, but I am frustrated with the academic lifestyle and moving to industry. But all those years in grad school, I developed unhealthy feelings of guilt any time I wasn't trying to \"get ahead\" somehow in my spare time. Even after finishing the PhD and having some free time on my hands, I can't switch off. I constantly feel the need to be learning something new or doing something productive, and it causes me a ton of stress, guilt and anxiety if I don't. I learned to live with it during grad school, but I'm surprised to find it still gets to me. How do you guys switch that part of your brain off?",
  "author": "0hMyGardevoir",
  "created": 1592355728,
  "updated": 1634080151,
  "over_18": false,
  "upvotes": 321,
  "upvote_ratio": 0.98,
  "comments": {
    "fv36eyt": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv36eyt/",
      "text": "I learned a trick in grad school that helps. If I put my leisure activities of choice in my to-do list, right alongside my work goals, then it's still something to check off. This helps me remember to see those activities as also required. So I check off yoga, bike rides, walks, video games, reading for fun, etc. This has helped me immensely. Good luck!",
      "author": "abby8710",
      "created": 1592365496,
      "upvotes": 194,
      "replies": {
        "fv45kh8": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv45kh8/",
          "text": "This is a beautiful suggestion.",
          "author": "zsantana459",
          "created": 1592395885,
          "upvotes": 16,
          "replies": {}
        },
        "fv53s54": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv53s54/",
          "text": "I would also add to the list: listening to music and podcasts(especially to fall asleep at night), while creating some kind of art during the day just for the fun of it.",
          "author": "jungleros",
          "created": 1592414490,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fv30zoz": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv30zoz/",
      "text": "I’d like to know the answer to this too. Academic work can feel like having a chronic illness. It’s not always at the forefront, but you always know it’s there.",
      "author": null,
      "created": 1592362128,
      "upvotes": 90,
      "replies": {
        "fv4haj9": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv4haj9/",
          "text": "It's been over two years since I defended and I still have moments of panic when I'm relaxing because I feel like I'm wasting time and should be writing. I think in a way grad school causes PTSD that never really goes away.",
          "author": "archyslayer",
          "created": 1592403237,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fv3k50d": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3k50d/",
      "text": "There are a number of good suggestions here focused in cultivating new pastimes and unplugging from work. I agree with many of these. \n\n\nI would like to take a moment and acknowledge that what your asking isn't, \"else should I do with my time?\" instead I understand your question to mean, \"how do I unlearn compulsive work behaviors I developed during my PhD as an adaptation and coping mechanism for sustaining the academic effort I felt was required for success.\" \n\n\n\nTo my thinking, what you're going through partially a result of all the time dedicated to your PhD where you needed to remove non-phd-progressing habits and partially a grown up realization about what we can realistically achieve in life.\n\n\n\nTry to think about what your career is going to look like with your PhD. What do you want to achieve professionally and what do you want personally?  I presume for most people they desire to feel successful and fulfilled in both arenas of their life. You've spent so much time and energy focused on getting to the PhD milestone it's time to cultivate what life looks like after it. What do you want at work? \n\nIn 30 years looking back what do you think will help you feel accomplished and satisfied; publishing, research, leadership, promotions, things in your discipline or out, serving on boards, etc.? \n\n\n\nAnd looking back from that same point what personal things do you want to have achieved; family, marriage, kids, travel, home ownership, etc. \n\n\n\nOnce you have an idea what you might want in the end, that list is where you start making your changes. If you don't need to be a dean or academic chair, but you want to stay in your lab - great! Go for it. If you won't feel fulfilled until you have kids or travel the world, then figure out those things. Make them priorities now. There are no guarantees for the future and it can't be just one thing. \n\n\nWhen we're old and gray as the cliches go we won't want to look back and think 'gee, I wish I spent more time in the office' by the same token diversion and recreation can be the same. We need a balance between a focus on productivity and personal fulfillment. Whatever that balance is try to move it everyday with good habits. I say this because I don't know anyone who can change overnight. As creatures of habit we get the most accomplished and the most achieved when we work on a task consistently over time whether that's a PhD, a hobby, weight loss, reading, working out, finding a partner, or cultivating ourselves personally. \n\n\nAnyway, that turned into a book. TL,DR; figure out what you want not just what you want to avoid, and work on it over time.",
      "author": "Kreugs",
      "created": 1592375680,
      "upvotes": 36,
      "replies": {
        "fv3voi1": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3voi1/",
          "text": "Cultivate weed",
          "author": "snapper2",
          "created": 1592386968,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fv36t0t": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv36t0t/",
      "text": "This is why I smoke weed.",
      "author": "waxlrose",
      "created": 1592365743,
      "upvotes": 131,
      "replies": {
        "fv3m2ep": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3m2ep/",
          "text": "This was my immediate response too, and I see a few similar below. I think it’s funny that weed has such a bad reputation for messing with your memory, but it’s so common in academia. Weed is my “switch off” too. It has to wait until the work’s all done though, and it’s not for everyone.  I need a t-break every few months and I’ll be irritable the whole time, but for the rest of the year, I can switch off at the end of the day, watch some shit tv, read some reddit and go to sleep.",
          "author": "WillyNilly_AU",
          "created": 1592377357,
          "upvotes": 30,
          "replies": {}
        },
        "fv51j1d": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv51j1d/",
          "text": "🤣 Great answer. I had no idea. Adding “smoke weed” to my to-do list immediately 👀📝",
          "author": "princessllamacorn",
          "created": 1592413393,
          "upvotes": 6,
          "replies": {}
        },
        "fv4hfgn": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv4hfgn/",
          "text": "God I wish this was an option for me. I still live in one of the dumbass states where not even medical is legal. Fucking hate it.",
          "author": "archyslayer",
          "created": 1592403310,
          "upvotes": 3,
          "replies": {
            "fv5b1kq": {
              "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv5b1kq/",
              "text": "I wish it were an option for me, too. My restrictions aren’t because of legality issues, but rather because it doesn’t work well for me. Makes me (even more) anxious. But for 80% of the people I know, weed is their regular relaxation activity, and I’m super jealous.",
              "author": "justfreehouse",
              "created": 1592417847,
              "upvotes": 3,
              "replies": {
                "fv5haw9": {
                  "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv5haw9/",
                  "text": "Have you tried CBD? It doesn't work quite as well for me as THC, but it's legal where I'm at. I've talked to a lot of people who didn't like weed but had good results from CBD.",
                  "author": "archyslayer",
                  "created": 1592420714,
                  "upvotes": 3,
                  "replies": {
                    "fva9k1i": {
                      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fva9k1i/",
                      "text": "Not recently. It might be worth another go. When I tried it way back in the day it didn’t have much of an effect.",
                      "author": "justfreehouse",
                      "created": 1592523728,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fv55t28": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv55t28/",
          "text": "Eh, I don't think suggesting substance use is really the best thing here.",
          "author": "yourmomdotbiz",
          "created": 1592415462,
          "upvotes": -3,
          "replies": {
            "fv56p4v": {
              "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv56p4v/",
              "text": "Sounds like a response you’d expect from someone that doesn’t know how to appropriately moderate a calming substance in their life.",
              "author": "waxlrose",
              "created": 1592415886,
              "upvotes": 7,
              "replies": {
                "fv5745r": {
                  "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv5745r/",
                  "text": "8% of the population has addiction problems. To give advice on getting high to calm down is not good advice. Taking a personal shot at me doesn't change that.",
                  "author": "yourmomdotbiz",
                  "created": 1592416079,
                  "upvotes": 1,
                  "replies": {
                    "fv5arkx": {
                      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv5arkx/",
                      "text": "Getting high is a great suggestion. As good as any others mentioned here. And just like any others, moderation and timing is key.",
                      "author": "justfreehouse",
                      "created": 1592417719,
                      "upvotes": 6,
                      "replies": {
                        "fv5b822": {
                          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv5b822/",
                          "text": "it's a good short term solution in small doses, sure. But it's a terrible way to cope over the length of a career when in academic life we're taught that we're never working enough. The key is to unlearn that and move towards real change.",
                          "author": "yourmomdotbiz",
                          "created": 1592417935,
                          "upvotes": -1,
                          "replies": {
                            "fva9ag0": {
                              "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fva9ag0/",
                              "text": "Eh, idk. I see it as equivalent to a glass of wine after work.",
                              "author": "justfreehouse",
                              "created": 1592523574,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "fv5ajvv": {
                      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv5ajvv/",
                      "text": "And what percentage of the population has anxiety problems that could be at least partially mitigated by the purposeful intervention of (medical) marijuana?",
                      "author": "waxlrose",
                      "created": 1592417619,
                      "upvotes": 3,
                      "replies": {
                        "fv5azlr": {
                          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv5azlr/",
                          "text": "Complicated question. With cbd being bred out of most marijuana strains, and THC being much higher, higher doses of THC can trigger and increase anxiety. CBD manages the negative effects of THC. So...it's not a good idea for anxiety at all. https://adai.uw.edu/pubs/pdf/2017mjanxiety.pdf",
                          "author": "yourmomdotbiz",
                          "created": 1592417821,
                          "upvotes": 0,
                          "replies": {
                            "fv5bs8p": {
                              "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv5bs8p/",
                              "text": "Literally the second line:\n\n\nTHC appears to decrease anxiety at lower doses and increase anxiety at higher doses. \n\nWhat are we even debating here? I mentioned specifically the purposeful use of medical marijuana. Not rolling blunts with the homies. If you’re content without MMJ in your life, that’s fine. But this thread was initiated by someone that clearly fits all descriptions of someone that could benefit from it and, given my own anecdotal success stemming from a very similar situation, I gave my insight. Don’t deprive someone of the possibility of relief because you’ve been indoctrinated by the reefer madness mentality that has been used explicitly as a subjugation tool for generations.\n\nedit: In the event you’re interested in challenging your perspective on that last point, I highly recommend Johann Hari’s 2015 book Chasing the Scream.",
                              "author": "waxlrose",
                              "created": 1592418203,
                              "upvotes": 3,
                              "replies": {
                                "fv5cnph": {
                                  "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv5cnph/",
                                  "text": "increase anxiety at higher doses.\n\nThat's my point. Too much will have the opposite effect.\n\nIn any case, if it helps, good, but the issue is it covers up the underlying problem of not shifting beliefs around career that are toxic. I'm not depriving anyone of anything, I'm providing info. Everyone's free to do what they want. I have no issue with marijuana. I used it in grad school and it gave me panic disorder, but hey, I'm indoctrinated with reefer madness. What an odd conclusion to draw by being presented with an opposing viewpoint.",
                                  "author": "yourmomdotbiz",
                                  "created": 1592418621,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fv37b54": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv37b54/",
          "text": "[deleted]",
          "author": null,
          "created": 1592366068,
          "upvotes": -56,
          "replies": {
            "fv3a46b": {
              "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3a46b/",
              "text": "I hope you've never had any alcohol then, or coffee for that matter.",
              "author": "ModeHopper",
              "created": 1592367955,
              "upvotes": 40,
              "replies": {
                "fv3f0jm": {
                  "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3f0jm/",
                  "text": "Coffee doesn’t put tar in your lungs",
                  "author": null,
                  "created": 1592371543,
                  "upvotes": -16,
                  "replies": {
                    "fv3q03q": {
                      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3q03q/",
                      "text": "No, but it also doesn't reduce stress, which in itself can lead to further health complications. Coffee can also induce anxiety and insomnia with long term usage. \n\nCigarettes also out tar in your lungs, and don't have the therapeutic benefits of CBD/THC, but they're still legal. There are also other ways of taking marijuana that don't involve smoking it, such as edibles and oils. \n\nMy point was that not all drugs are \"bad\" just because the government decided they should be some 100 years ago. Some have tangible benefits than can improve quality of life, and people should be so quick to dismiss them just because they don't personally like using them.",
                      "author": "ModeHopper",
                      "created": 1592381112,
                      "upvotes": 15,
                      "replies": {
                        "fv3xesx": {
                          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3xesx/",
                          "text": "To be fair, all they said is they are bad. You are jumping to conclusions in thinking that this implies the user you are responding to believes that their use should be criminalized, which is an entirely different conversation. I know tons of people who do believe drugs like weed are bad but also believe they shouldn't be illegal to use.\n\nAlso, having less of a knee jerk reaction to things tends to make your case more relatable to people than going on a long rant that brings things into the conversation that were not part of it. It might feel more personally satisfying but if you actually want to convince someone, it isn't a very efficient tool.",
                          "author": "ImAlsoAHooman",
                          "created": 1592388728,
                          "upvotes": 0,
                          "replies": {
                            "fv3y177": {
                              "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3y177/",
                              "text": "If you think that was a long rant you should try reading a philosophy essay",
                              "author": "ModeHopper",
                              "created": 1592389344,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fv3al52": {
                  "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3al52/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1592368281,
                  "upvotes": -19,
                  "replies": {
                    "fv3beoj": {
                      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3beoj/",
                      "text": "What?",
                      "author": "ModeHopper",
                      "created": 1592368863,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "fv3asig": {
                  "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3asig/",
                  "text": "r/whoosh",
                  "author": "ahf95",
                  "created": 1592368424,
                  "upvotes": -11,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fv32cwq": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv32cwq/",
      "text": "I haven’t found the solution myself, but spending time with others and getting back into old hobbies are two strategies to help me feel more balanced. Part of it is recognition that the old way of constant work is unhealthy. I’m trying to remind myself that, at the end of my life, I probably will wish I worked less, and I try to think about hoe I could spend my time in a way that adds to my health, not my CV. And, Draw strong boundaries (e.g. no weekend work) and try to add new things to your life to fill that time, perhaps starting with activities that used to give you joy but that you haven’t put a lot of time into in recent years.",
      "author": "Trulymadlydeeplydo",
      "created": 1592362964,
      "upvotes": 19,
      "replies": {}
    },
    "fv3638q": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3638q/",
      "text": "Maybe not the healthiest approach, but drinking helps me. Not heavy drinking, but a single beer or cocktail when I'm done with work helps me switch my brain out of work mode and relax. \n\nAlso socializing with people outside of academia helps.",
      "author": "ProfOnTheMove",
      "created": 1592365286,
      "upvotes": 64,
      "replies": {
        "fv3dpsm": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3dpsm/",
          "text": "Socializing outside of science helps. Having only scientist friends it’s hard to switch out of science mode.",
          "author": "Juggernaut1210",
          "created": 1592370563,
          "upvotes": 43,
          "replies": {
            "fv3emoq": {
              "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3emoq/",
              "text": "This has become an issue as I’ve gotten older and moved for a university. My only acquaintances are in the same field, and I honestly just miss hanging out with people who aren’t wrapped up in this lifestyle.",
              "author": null,
              "created": 1592371246,
              "upvotes": 12,
              "replies": {
                "fv3gb5h": {
                  "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3gb5h/",
                  "text": "I’ve started hanging out with my friends from grad school a lot less because they’re all still so wrapped up in work it’s impossible to do anything. I have a set of friends who I can rely on to hang out with because when they’re home, they’re not working. But if I ever move cities I know it’ll get harder because the easiest way to meet people will be work. And scientists even in industry never seem to switch off.",
                  "author": "Juggernaut1210",
                  "created": 1592372552,
                  "upvotes": 9,
                  "replies": {
                    "fv4bb98": {
                      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv4bb98/",
                      "text": "Same here. I have several groups of friends outside of my gradschool cohort (friends maintained from undergrad and my bartending days). They span many different fields and jobs and so we talk about anything. I rarely talk about my PhD outside of research situations now because most people don't get it and most people don't care about it. So we talk about anything ranging from games, economics, something a celebrity said, lifestyle things...and just mundane banter, like who hooked up with who last weekend. And honestly, it's nice not to talk - or think- about my research during those times. \n\nWhen I started my PhD I thought I was \"above\" chit-chat like that, but turns out it was integral to maintaining my social skills and sense of fun and relaxation. Chatting research only with academics hammered my social skills and blurred lines of work and leisure. I struggled to maintain conversations more and more in non-academic settings. Unfortunately I have found that a lot of researchers are interesting when they talk about their topic/field (to a point), but beyond that most are kinda' not very fun and don't switch off.",
                      "author": "Neyface",
                      "created": 1592399774,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fv3ki3x": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3ki3x/",
          "text": "Socializing with people outside of academia? What would you talk about, then?",
          "author": "Kapara_newbie",
          "created": 1592375992,
          "upvotes": 6,
          "replies": {}
        },
        "fv55yjk": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv55yjk/",
          "text": ">Maybe not the healthiest approach, but drinking helps me.\n\nBad advice. it'll take more alcohol over time to get the same effect and before you know it, you're a functioning alcoholic. I'm not trying to be a dick, I've seen this happen to many of my colleagues.",
          "author": "yourmomdotbiz",
          "created": 1592415536,
          "upvotes": 3,
          "replies": {}
        },
        "fv4h58u": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv4h58u/",
          "text": "Yes yes yes yes! It’s so necessary for me to spend time with non-academic friends. Otherwise the temptation to “talk shop” is too great and I don’t end up getting a chance to relax. The only way I survived grad school was to make friends in the board game community and the local performing artist community.",
          "author": "PirateBushy",
          "created": 1592403157,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fv3fc2c": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3fc2c/",
      "text": "Set some boundaries with respect to what time you spend in the office (or, given the current situation, have your computer on at home). Focus on your work during that time, but when things start to wind down for the day you should start to write a to-do list of tasks for the next day. Be as detailed and expansive as you like, the key here is to try to empty your mind of annoying little things that might pop up later in your head and switch your mind back to work. Once that's written, tell yourself you're done for the day.\n\nThe easiest way to disconnect would be to leave home for an hour or so without your phone or laptop and go for a walk. If you have a stand-alone music player then take it with you, or a book, if you need something to run through your mind. But take the time to give yourself some healthy isolation. Hopefully you'll start to appreciate things you see on your little walks that distract you from wanting to *do* stuff. \n\nIf you really have the desire to learn all the time then channel that into more healthy pursuits than returning to work. If you have any sort of hobby then start learning about it obsessively - if you have a favourite sports team then learn more about that team's history; if you like cooking then choose a recipe to tweak and perfect to the Nth degree (/r/macarons would be an easy way in to obsessive cooking/baking, speaking from experience); maybe start to learn a new language...you have plenty to choose from.\n\nTurn this nervous energy into something positive and set yourself goals to accomplish by the end of the week/month. I could recommend a load of YouTube channels of people who set themselves challenges to learn a new skill (useful or not) or change something in their life: The Goal Guys, Mike Boyd, Wheezy Waiter, Matt d'Avella...\n\nAbove all else, remember your employer pays you for a set number of hours per week. Working more than those hours means you work for free, costing you money and your personal time. Your boss wouldn't allow your personal life to encroach on your contracted work hours, so you shouldn't allow your work to encroach on your personal time.",
      "author": "TheFlyingMunkey",
      "created": 1592371792,
      "upvotes": 17,
      "replies": {}
    },
    "fv3b4eq": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3b4eq/",
      "text": "I exercise a shit ton and I clean a lot",
      "author": "Ronaldoooope",
      "created": 1592368660,
      "upvotes": 12,
      "replies": {}
    },
    "fv2urnq": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv2urnq/",
      "text": "Some ideas to focus on something else:\n\n- get some fun videogame to play,\n\n- call your parents more often,\n\n- watch some shows on Netflix with your s.o.,\n\n- have a baby \n\n- start an arts project,\n\n- exercise, cook, and eat healthy\n\n- let yourself dive into the depths of Reddit and find an obscure, yet interesting, topic to talk to other kind strangers\n\nHowever, it is likely that you are feeling that you are not doing enough in your work time. Perhaps you can keep track of your tasks during the week to remind you of your hard work so far? Then, you can rest assured that you have done your best during the week, and you cannot possibly do better than your best. Therapy and meditation can also help with that.\n\nScience and results are really nice, but they are only a small fraction of all the world has to offer. \n\nGood luck!",
      "author": "notlesterthemouse",
      "created": 1592358416,
      "upvotes": 29,
      "replies": {
        "fv35cg0": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv35cg0/",
          "text": "I like how you squeezed in \"have a baby\" here :D",
          "author": "reddit_wisd0m",
          "created": 1592364818,
          "upvotes": 50,
          "replies": {
            "fv3i9td": {
              "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3i9td/",
              "text": "mom, is that you?",
              "author": "Gerry0505",
              "created": 1592374121,
              "upvotes": 8,
              "replies": {}
            },
            "fv446w7": {
              "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv446w7/",
              "text": "Haha yeah they’re just like puppies that can talk\n\nThat baby turns into an adult you’ll have to help navigate the world, at least think carefully about how good a parent you might be and whether you’re ready, or what your partner wants...",
              "author": "alchemist_of_feels",
              "created": 1592394815,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fv39dwi": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv39dwi/",
          "text": "On the exercise front, highly recommend rock climbing - endless spatial/physical puzzles to solve and you get jacked doing it, so much fun",
          "author": "oboe-wan_kenoboe",
          "created": 1592367455,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "fv4bcwx": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv4bcwx/",
      "text": "Oof, tough to see how many people rely on altering consciousness for this. \n\nI went to therapy for something else entirely (traumatic grief that among other things destroyed my ability to work) but it ended up being a lot about this. Here’s how I handle it now.\n\nI don’t try to switch off the urge too forcefully, I try to notice it, sit with it. I schedule downtime, I track when the urge hits me and explore what it feels like. I use the same curiosity I have for intellectual pursuits for this peculiarly personal phenomenon. This is part of mindfulness so I also encourage exploring mindfulness meditation which helps you be a better noticer. For me, riding the wave of the urge is more manageable than trying to remove it from my life entirely.\n\nWhen trying to take a real multi-day break, I put up barriers to checking email (I disable it on my phone, make it hard to check on other devices). I used to do this to enforce time-of-day limits as well, but with time I didn’t need that anymore. You can limit time on apps incl email on your phone. Any barrier helps so it can’t be reflexive.\n\nAnd because I so identify with my work I characterize my downtime consistently, publicly and internally, as something that benefits my overall productivity. Eventually this becomes its own habit — both on and off serve the mission.",
      "author": null,
      "created": 1592399803,
      "upvotes": 5,
      "replies": {}
    },
    "fv3vf2p": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3vf2p/",
      "text": "It took me about 6 months post-PhD to get over my guilt. It was like a reflex I had to consciously unlearn. \n\nI had to remind myself that I was ALLOWED to do nothing. That I didn’t need to feel guilty for relaxing. I had to consciously remind myself of that A LOT. And after awhile I realised I don’t always have to be DOING something and that I actually LIKE relaxing! My mental health is better for it!\n\nIt gets better.",
      "author": "creature-of-the-dark",
      "created": 1592386695,
      "upvotes": 5,
      "replies": {}
    },
    "fv38r5x": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv38r5x/",
      "text": "Weed. Scheduled sessions.",
      "author": "ThatMsAnthrope",
      "created": 1592367025,
      "upvotes": 22,
      "replies": {}
    },
    "fv3qj12": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3qj12/",
      "text": "Philosophical enlightenment. Just ask why and the purpose/meaning to everything around you. Suddenly BOOM! I don't even know why I would think of the nitrogen gas tank in the lab...",
      "author": null,
      "created": 1592381637,
      "upvotes": 5,
      "replies": {}
    },
    "fv48lda": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv48lda/",
      "text": "[deleted]",
      "author": null,
      "created": 1592398031,
      "upvotes": 4,
      "replies": {
        "fv5hylj": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv5hylj/",
          "text": "I think you're thinking of Weber's *The Protestant Ethic and the Spirit of Capitalism*.",
          "author": "TheJadedEmperor",
          "created": 1592421013,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fv3tvyc": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3tvyc/",
      "text": "I'm a master degree student, so I actually have more time to spend than a phd student, but I was also studying to death last year. This year however, I started to take piano lessons. Just 1 hour in a week, but surprisingly it really helped me mentally. In the evenings I started to practice half an hour and that helped me to get rid of the stress of the day somehow. It still counts as learning, it is still productive, so you really don't feel bad or unproductive, you just enjoy it. I'm 25 and never had a piano lesson before, so sometimes it gets a little frustrating but even the frustration makes me happy, it's a promising challenge. I think you can start a hobby from the zero, like learn a new instrument or start painting. This type of hobbies won't make you feel like you're doing something unproductive, because there's also a challenge to learn them and the results are better than playing video games or watching mindless movies.",
      "author": "SapientiaDominus",
      "created": 1592385096,
      "upvotes": 4,
      "replies": {
        "fv6p1v0": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv6p1v0/",
          "text": "i agree.start a hoby or learing new languages or teaching to other one ,like a tutor or using new app that would be exciting and intersting for u or learing a new skill through your favorite sowftware or exercise...\nall of them must do  along with interest and you enjoy doing each of them.\nafter all you must overcome your mind and thoughts,\nand prevent of bad thought and guide your mind into up activities.",
          "author": "Mosheideh",
          "created": 1592442369,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fv55pvz": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv55pvz/",
      "text": "It comes with a change in values. Put yourself and your needs before the \"academic cult\". Acknowledge your own brainwashing, think about what really matters to you in life, and go from there. \n\nTake on projects you only genuinely care about.",
      "author": "yourmomdotbiz",
      "created": 1592415421,
      "upvotes": 3,
      "replies": {}
    },
    "fv2sx3k": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv2sx3k/",
      "text": "\"Healthier\" Ways: Exercise, pick up a new hobby, play board games, garden, spend time with people I love\n\n\"Less Healthy\" Ways: Alcohol",
      "author": "ToxicityMasochist",
      "created": 1592357316,
      "upvotes": 10,
      "replies": {}
    },
    "fv3bbkv": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3bbkv/",
      "text": "Marijuana.",
      "author": null,
      "created": 1592368804,
      "upvotes": 13,
      "replies": {}
    },
    "fv3eo17": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3eo17/",
      "text": "get a good hobby",
      "author": "atypic",
      "created": 1592371275,
      "upvotes": 3,
      "replies": {}
    },
    "fv3f5xj": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3f5xj/",
      "text": "Start training aikido.",
      "author": "ruparjev",
      "created": 1592371659,
      "upvotes": 2,
      "replies": {}
    },
    "fv3ke7u": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3ke7u/",
      "text": "I think it probably needs some time for those feelings to go away. \n\nIt might sound corny but a sort of mindfulness approach might help. Try to be aware of your feelings of guilt and tell yourself that you might not be productive now but you will be another day. It might also help to set realistic work goals each week that you can check off. Lastly as others have said, planning your free time probably helps as well. The more busy and in need of free time I get, the more likely I am to end up on the couch bored, staring at the TV, not enjoying myself and feeling guilty. Probably because I was so busy that I didn't plan what to do with that free time.",
      "author": "Oedipurrr",
      "created": 1592375900,
      "upvotes": 2,
      "replies": {}
    },
    "fv3ywdp": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3ywdp/",
      "text": "This is one upside of having a family in grad school; now that I am finished I really just spend more time with my wife and kids. I also started learning classical guitar before I graduated (after playing electric for years).  I try to find songs that are challenging (for me) and focus on practicing.",
      "author": "geojash",
      "created": 1592390170,
      "upvotes": 2,
      "replies": {}
    },
    "fv4c96k": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv4c96k/",
      "text": "And I'm over here and can't seem to switch myself ON. Wouldn't it be great if we could pair up? You could cheer me on in the mornings to be productive and stay focused and I could get you hyped to relax and have fun as soon as it's break time to go do any number of the 500 hobbies that are always on my mind.",
      "author": "mimariposa",
      "created": 1592400348,
      "upvotes": 2,
      "replies": {
        "fv5u8qm": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv5u8qm/",
          "text": "I have the exact issue OP has and it probably wouldn't work that way unfortunately. \n\nAt the least for me, the stress and anxiety about doing nothing makes it harder to think about what I  (think I) should be doing, causing me to be lazy and get nothing done by watching YouTube or playing video games, but I don't enjoy it at all while I'm doing it. I actually cannot play video games by myself anymore, gotta have a friend or I can't enjoy it :(\n\nI used to use weed as my brain-off switch and it worked perfectly, but I became a machinist and I can't risk weed ruining my career so I had to stop. \n\nI'm hoping I can redirect this crippling need to be productive into a hobby I enjoy but I do not have the means to do so at the moment so I guess I'll just have to sit with these butterflies in my stomach for a while.",
          "author": "Baaaane",
          "created": 1592426507,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fv4e5d2": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv4e5d2/",
      "text": "My problem is the opposite",
      "author": "mrgoldenranger",
      "created": 1592401471,
      "upvotes": 2,
      "replies": {}
    },
    "fv5dk1u": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv5dk1u/",
      "text": "You could try this: https://www.sciencealert.com/ketamine-experiment-in-sheep-reveals-brain-phenomenon-we-ve-never-seen-before\n\n(Lol sorry /s)",
      "author": null,
      "created": 1592419058,
      "upvotes": 2,
      "replies": {}
    },
    "fv3lmt4": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3lmt4/",
      "text": "The answer lies in two Mary: Bloody Mary and Mary Jane 8)",
      "author": "minhquan3105",
      "created": 1592376976,
      "upvotes": 3,
      "replies": {}
    },
    "fv4eh0f": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv4eh0f/",
      "text": "I wish this was my problem (having already graduated and worrying)! \n\nI’m currently going into my last year and fully avoiding writing — 🆘",
      "author": null,
      "created": 1592401660,
      "upvotes": 1,
      "replies": {}
    },
    "fv3eje1": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv3eje1/",
      "text": "I second having a baby. We also go camping and leave the laptop at home.",
      "author": "gradstudentgrunt",
      "created": 1592371175,
      "upvotes": 1,
      "replies": {}
    },
    "fv2ugyi": {
      "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv2ugyi/",
      "text": "Use your desire to be productive to invest in yourself financially. Read about investing and asset allocation. Start or work on a side business. Consider how you might make some consulting income.",
      "author": "Free_Paint",
      "created": 1592358241,
      "upvotes": -6,
      "replies": {
        "fv347dk": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv347dk/",
          "text": ">I constantly feel the need to be learning something new or doing something productive, and it causes me a ton of stress, guilt and anxiety if I don't.\n\nI can't help but think OP's crippling pressure to \"learn something new\" and \"be doing something productive\" won't be assuaged by learning how to invest or starting a business. \n\nTake some time off: rest, relax, read some books for fun, pick up a new hobby -- anything that makes you happy and feel like you're spending your time well. If that's learning to follow stock market trends, great! But I think for the most of us, a few weeks of Netflix and birdwatching might be slightly more helpful. Best of luck, OP!",
          "author": "augusyy",
          "created": 1592364101,
          "upvotes": 13,
          "replies": {}
        },
        "fv4ihw9": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv4ihw9/",
          "text": "Boring.",
          "author": "crusty_coffee",
          "created": 1592403883,
          "upvotes": 5,
          "replies": {
            "fv4mhmy": {
              "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv4mhmy/",
              "text": "Cool, so money’s boring.",
              "author": "Free_Paint",
              "created": 1592405958,
              "upvotes": 0,
              "replies": {
                "fv52hlr": {
                  "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv52hlr/",
                  "text": "Not at all :-) just making a friendly jab that didn’t come across. I’ve consulted in the past to supplement my income.",
                  "author": "crusty_coffee",
                  "created": 1592413861,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fv55s34": {
          "link": "/r/AskAcademia/comments/hagwrf/how_do_you_switch_off_your_brain_and_resist_the/fv55s34/",
          "text": "[deleted]",
          "author": null,
          "created": 1592415450,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  }
}