{
  "sid": "q1cale",
  "link": "/r/AskAcademia/comments/q1cale/if_you_were_serving_on_an_admissions_committee/",
  "title:": "If you were serving on an admissions committee and saw an applicant who was about to have major surgery (organ transplant), would this make you uncomfortable?",
  "text": "I posted this in /r/gradadmissions and had someone privately recommend that I post in /r/askacademia too, to get some perspectives from those who may have more direct experience with admissions committees. \n\n**TLDR**: trying to decide between having a liver transplant this year (would make applying this cycle highly unlikely) or early next year (would allow me to apply this cycle, but worried about putting an admissions committee in an uncomfortable position). The programs I'm looking at are fairly competitive and I'm not applying to many to begin with because I want to stay in my home state where my medical care is located.\n\nI graduated from undergrad in 2020 and am looking to apply to PhD programs in the social sciences. What’s complicating matters is that I’ll be receiving a liver transplant (live donation) soon. The surgery was originally supposed to happen in June/July but the process with my donor was delayed. At this point, it looks like the soonest I would be able to have this surgery is sometime in November, although I could delay until early 2022 - this is what I'm considering now.\n\nI’ve been dealing with this medical crisis for over a year now. I wasn’t able to apply last cycle because I had another surgery in December and my head just wasn’t in the right place. I think I could still apply this cycle, but only if I delayed surgery until early next year. I’ve been told the choice is really up to me. Unless there's a drastic change in my situation, I have wiggle room. \n\nI know there's no definitive answer here - but how harmful do you think it would be to apply *before* an operation like this? I don't want to put anyone on an admissions committee in an uncomfortable position. This is a major operation with risks involved, and I’m aware that some people might be spooked by that. I’ve already decided that if I do end up applying this cycle I’m going to bring up this medical ordeal, even if only briefly, because I’ve been strongly advised by several faculty members to do so. This has eaten up *so* much of my life over the past year and I haven’t been able to do much because of the unpredictability of the situation. My condition is extremely rare as well and the extraordinary circumstances/ethical implications around it have caused dissension among my team that I’ve had to navigate. I do think it's changed me as a person. \n\nTo leave an unexplained gap on my resume is unacceptable to me, and to water it down by being as vague as possible and writing something to the effect of “spent the year dealing with a medical issue” feels like I’m selling myself short… I don’t want anyone to think I took an entire year off to deal with, comparatively speaking, a more routine/low stakes medical issue, or that I took a year off because I had a nervous breakdown. I know there isn’t any shame in taking time off for mental health reasons - but that isn’t the case here, and it just doesn’t feel right to have people (potentially) assuming my situation is very different than it actually is.\n\nSo that’s where I’m at now. I’ve gotten conflicting opinions from the people in my life regarding what to do - whether I should be transparent, if so how much, whether I should even apply in the first place, etc. I was hoping to get some input from strangers on the internet though - no sugar coating, no bias. Just your gut feeling as to what you might do in a situation like this.",
  "author": "Lasticool",
  "created": 1633373950,
  "updated": 1634078773,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hff5z8j": {
      "link": "/r/AskAcademia/comments/q1cale/if_you_were_serving_on_an_admissions_committee/hff5z8j/",
      "text": "I'd go ahead and apply. People take interruptions of studies all of the time, it wouldn't be weird. You'd also be interrupting for something very important, it's not like you're asking to take a super fun extended holiday.\n\nPersonally I wouldn't have any moral problems with doing what you're describing. Any program that gives somebody a hard time for taking essential medical leave isn't one I'd want to be at anyway. Please do not feel obliged to disclose this information in a personal statement or at interviews. I'm not an expert but I'm pretty sure this sort of thing is something they wouldn't be allowed to ask about or to let affect their hiring decisions.\n\nIt's probably a good idea to look at the graduate handbooks for the programs you're applying to and find out what their policies/processes are on medical leave in advance. When you do get in somewhere, don't immediately jump for the medical leave forms either - depending on your circumstances your director of graduate studies might know of another route you can go down such as taking a very reduced credit load or jiggling things about a bit with responsibilities. This is important because your stipend/pay may be affected by being on leave.\n\nGood luck with your surgery and with the application season.",
      "author": "A1B6",
      "created": 1633392643,
      "upvotes": 7,
      "replies": {}
    },
    "hffmnk9": {
      "link": "/r/AskAcademia/comments/q1cale/if_you_were_serving_on_an_admissions_committee/hffmnk9/",
      "text": "A lot of life happens during the grad school years so a good supportive program will accommodate leaves for a whole host of reasons and you won’t be the first. That said, as a PI it would be much less disruptive to me if you had surgery prior to starting a grad program than once you were in it. I’m not quite sure I’m following your concerns on doing now while applying. You are worried what they’ll think or isn’t actually possible to put apps together while having surgery.",
      "author": "AwkwardAccountant5",
      "created": 1633400996,
      "upvotes": 3,
      "replies": {}
    },
    "hfg6la1": {
      "link": "/r/AskAcademia/comments/q1cale/if_you_were_serving_on_an_admissions_committee/hfg6la1/",
      "text": "Is your pending operation related to your qualifications for the position? Probably not. Most faculty are specifically trained and instructed to judge applicants based on their qualifications, not what they think might happen later. You are under no prerogative to share your condition and I would advise you not to do so.",
      "author": "ohnoyoudin",
      "created": 1633413082,
      "upvotes": 3,
      "replies": {}
    },
    "hfg5qpv": {
      "link": "/r/AskAcademia/comments/q1cale/if_you_were_serving_on_an_admissions_committee/hfg5qpv/",
      "text": "Something that may be important for you to think about, as someone who’d be entering grad school after major surgery - how good is the medical insurance at the places you’re applying? The insurance at my school is terrible if you have pre-existing conditions",
      "author": "bird-nird",
      "created": 1633412461,
      "upvotes": 2,
      "replies": {}
    },
    "hfhqmxp": {
      "link": "/r/AskAcademia/comments/q1cale/if_you_were_serving_on_an_admissions_committee/hfhqmxp/",
      "text": "I agree with everyone saying apply now. One thing to consider is that if you do it now it means the department will be aware of your health status and will also see your recovery. That might be an advantage over going in somewhere at less than 100% and them only knowing about it from what you've said but not having seen you go through the whole process.",
      "author": "ACatGod",
      "created": 1633449545,
      "upvotes": 1,
      "replies": {}
    }
  }
}