{
  "sid": "poo5wo",
  "link": "/r/AskAcademia/comments/poo5wo/what_does_it_take_to_succeed_you_have_to_give_up/",
  "title:": "What does it take to succeed? You have to give up your family, your friends...",
  "text": "The podcast guests didn't sugarcoat what it takes on this episode about the skills and sacrifices being at the top entails: [https://your-digital-mentor.simplecast.com/episodes/leadership](https://your-digital-mentor.simplecast.com/episodes/leadership)",
  "author": "belamalta10",
  "created": 1631704944,
  "updated": 1634078989,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hcxv5nb": {
      "link": "/r/AskAcademia/comments/poo5wo/what_does_it_take_to_succeed_you_have_to_give_up/hcxv5nb/",
      "text": "That might be what it takes to reach the very top, but I would argue there are many successful academics with slightly less prestigious titles who have not forsaken every other aspect of their lives.",
      "author": "CootaCoo",
      "created": 1631707354,
      "upvotes": 10,
      "replies": {}
    },
    "hcyc764": {
      "link": "/r/AskAcademia/comments/poo5wo/what_does_it_take_to_succeed_you_have_to_give_up/hcyc764/",
      "text": "I find it interesting that that's what they're saying. I know the organisation this podcast originates from a bit and know people who work there. That definitely isn't the impression of culture there that I had although they do work hard. All the senior faculty I know there are married with kids and I've been told their parental leave policy is pretty good (couples are allowed to share paid leave up to a year).\n\nI think it is a problem generally in academia, especially when you have married academics or a partner with a niche career, because moves can pull families apart but I don't think it's as impossible as people say. Looking around at all the universities I've worked at in the UK and US that wouldn't seem to be the case.",
      "author": "ACatGod",
      "created": 1631715887,
      "upvotes": 5,
      "replies": {}
    }
  }
}