{
  "sid": "qb318f",
  "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/",
  "title:": "PI screwed me when I needed recommendations and now he needs recommendations from me. What to do?",
  "text": "EDIT: I follow everyone advice and I professionally told him to be far from tis lab without getting in too much details. He was very relieved, bc he is trying to scape a toxic lab as well. As he wants to change field completely, he asked me for some advice. I feel a lot better now knowing he is out of danger (at least this danger), and knowing I was able to help him! Thank you all for the kind words and helpful advice!!!!!\n\nHey\nLet's say I hypothetically had a lot of problems with my master advisor. He may have said things about how awful I was, how I would never manage to get a PhD position, how I'm ugly, how I will never be good enough for other labs, and etc etc and he may even called me a secretary more than once - to address to someone else who they should speak for reagent shopping or for details of his schedule of meetings. Anyways, I  was able to finish my master, and follow up to a PhD position as far away as I could get without his recommendation (another country, another continent etc). I tried applying with his letter but he screwed me (I prefer not entering in detail here), so I tried again without his LOR and then I got it. So far so good. \nBut I just received an email from what appears to be a real student (I checked his existence on Instagram, on the fellowship founding agencies and his institutional email) asking me about the lab of my master advisor, bc he wants to do his PhD there. \nI was thinking about telling him the truth, but it still seems like a trap to me. I thought on telling him all the unethical things that used to happen at the lab (like inexistent animal care, scientific misconduct, lack of safety protocols and inappropriate chemical and biological waste disposal) without mentioning the \"personal\" issues (harassment, competition stimulation in the lab, zero to negative supervision).\nIs there anyway to ethically tell him that he shouldn't do this? How to address this without burning myself???\nI don't want to ignore him. When I was thinking about doing my master there, I asked a lot of people and everyone left me on read or lied to me (they said \"now that you are here, you can know the truth\"). I don't want to cause this sort of harm in someones life...\nThank you for you help and attention.",
  "author": "immuno-cookies-340",
  "created": 1634614445,
  "updated": 1634654284,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hh6ynd3": {
      "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh6ynd3/",
      "text": "Be honest, just tell him that you don’t recommend working there. Be professional ofc but if you truly had a poor experience save someone else the trouble.",
      "author": "farting_cum_sock",
      "created": 1634614788,
      "upvotes": 18,
      "replies": {
        "hh6yt2p": {
          "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh6yt2p/",
          "text": "Thank you!",
          "author": "immuno-cookies-340",
          "created": 1634614875,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hh77q3f": {
      "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh77q3f/",
      "text": "Be honest, but just try to keep it objective and try to leave out as much personal issues you two had. \n\nMy advisor actually made it a point to have one on ones with students and potential students. She was a bit of a hard ass, could come off as confrontational, and had really high expectations; and she knew that about herself. It was just obvious that it was a loss for both parties if it was not a good fit. She was a great advisor though, especially if you didn't take her style personally.\n\nCongrats on the PhD position!",
      "author": "HappyHrHero",
      "created": 1634620626,
      "upvotes": 3,
      "replies": {
        "hh88ogf": {
          "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh88ogf/",
          "text": "Thank you",
          "author": "immuno-cookies-340",
          "created": 1634649047,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hh7hjz7": {
      "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh7hjz7/",
      "text": "I agree with what others have said.  However, I would also strongly advise you arrange a call to do this over, rather than using email.",
      "author": "OrbitalPete",
      "created": 1634628628,
      "upvotes": 2,
      "replies": {
        "hh88pfn": {
          "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh88pfn/",
          "text": "Thank you",
          "author": "immuno-cookies-340",
          "created": 1634649061,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh7z7b0": {
      "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh7z7b0/",
      "text": "\"I was unable to establish a working professional relationship with Dr. X during my time in the Master's program.\"\n\n\nAlso, most of what you mentioned you had an ethical duty to report....",
      "author": "Ashelth",
      "created": 1634643585,
      "upvotes": 2,
      "replies": {
        "hh88ox5": {
          "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh88ox5/",
          "text": "Thank you! I tried to report to the uni, but they don't care bc my PI is bringing money in for them...",
          "author": "immuno-cookies-340",
          "created": 1634649053,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh7tokh": {
      "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh7tokh/",
      "text": "If you want to be safe a simple \"I wouldn't do it again.\" without details. And don't put any details in writing nor in a phone call unless they are already documented at the institution. There are states in the US that allow recording of phone calls without permission of both parties. I don't know about other countries.\n\nBut, when all is said and done if you feel like this is a trap then you can just not respond, of course. If it is a trap and you respond at all your old advisor could come after you either through your current institution or legally. You might well \"win\" whatever is done but it would still be a very stressful and difficult thing to go through. Having said that, it's hard to imagine that your old advisor would try to set a trap for somebody who has left and is still in their doctoral program.",
      "author": "rockyfaceprof",
      "created": 1634639557,
      "upvotes": 1,
      "replies": {
        "hh88qiz": {
          "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh88qiz/",
          "text": "Thank you",
          "author": "immuno-cookies-340",
          "created": 1634649076,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh880ng": {
      "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh880ng/",
      "text": "Do you wish that someone had warned you before you went there? You now have an opportunity to do that for someone else. You have an obligation to be honest, but it is important to be professional. That means avoiding going into too much detail. For example, you could say, “I did not have a positive experience working with X and would not recommend it to anyone else.”",
      "author": "bigrottentuna",
      "created": 1634648706,
      "upvotes": 1,
      "replies": {
        "hh88no2": {
          "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh88no2/",
          "text": "Thank you! Yes, I asked similar question for his students at the time. They said good things, and when I committed to the fellowship and went to the lab, on my first day, the students said \"now you can know the truth\". And it was too late. But other things I discovered later too.",
          "author": "immuno-cookies-340",
          "created": 1634649036,
          "upvotes": 1,
          "replies": {
            "hh8atzm": {
              "link": "/r/AskAcademia/comments/qb318f/pi_screwed_me_when_i_needed_recommendations_and/hh8atzm/",
              "text": "Argh. That really sucks.",
              "author": "bigrottentuna",
              "created": 1634650124,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}