{
  "sid": "kdpulq",
  "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/",
  "title:": "Anyone else fantasise about starting a brewery? Or becoming a plumber? Anyone done this?",
  "text": "Academic (PhD + Post-doc) now working in an academic data science research group within industry. Early 30s, but so tired of the BS in both worlds and I've genuinely lost my love for the sciences. I just don't want to be a scientist anymore, and I think this is a lot more than just a stint of burnout. I'd love to start a brewery or become a plumber. I've worked at some of the worlds top institutions (not intending for that to be a humblebrag, just pointing out that it doesn't get any better at the \"top\") and so very tired of constantly having to be on my A-game.\n\nI'm in the UK where universities have essentially become big businesses and being a scientist is not a glamorous or well-paid job. I suppose this is a silly question for this sub, given that anybody who has walked away from academia is not now likely to be hanging around on here. But does anyone have any experience with leaving academia/science and doing something widely different? Anyone know anybody whose done left academia and gone in a completely different direction? Am I completely insane?\n\nI've done so much reflection on this subject recently, and I've seriously started looking at re-training. I think a big part of the problem is that nothing is ever \"good enough\" in academia or the R&D industry. It's an incredibly thankless job. I'm not one of these people that needs constant reassurance or praise, but I've come to realise over the course of my career, that despite producing some very impactful work, that nothing was ever good enough for PI's, committees, metrics etc. and nothing ever will be.\n\nI used to work in a supermarket, back in my student days. Managed to get promoted and my boss was always pleased with my performance. Only now do I realise how rewarding it was to have a boss that was genuinely please, sometimes ecstatic, with my work (or ideas). Customers too. Hearing the words \"thank you\" and \"great job!\" every day boosted me mentally more than I realised at the time. Life was simple: nobody there was ever trying to one-up me; there were no office politics (i.e. dirty tricks, not usually collaboration); no egos; no insane deadlines; no unrealistic expectations; I could clock-off and mentally checkout, and I always had the resources that I needed to do the job. Basically, the job permitted me to recharge. I've come to realise that I miss that type of supportive environment. I'm tired of my PI's being in competition with me, tired of having to navigate the office politics, tired of being under-resourced, tired of being expected to \"just figure it out\", tired of others trying (and some times having succeed in) taking credit for my work etc. Research is hard enough without all the BS that comes with it.\n\nI'm struggling to find examples of people who have decided to go a completely different direction, not just left academia, but science altogether. I'm trying decide if this is just a burnout/melt-down or if I am seriously unhappy and in need of a change.",
  "author": "Least_Curious_Crab",
  "created": 1608052642,
  "updated": 1634080084,
  "over_18": false,
  "upvotes": 459,
  "upvote_ratio": 0.98,
  "comments": {
    "gfxy7ye": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxy7ye/",
      "text": "I call these \"escapist fantasies\". Almost everyone I know has one. They all involve starting a new life with a job that involves working with our hands and (at least in the fantasy) rarely being on a computer/behind a desk. Mine is being a florist, even though I have a black thumb and know nothing about plants.",
      "author": "wantonyak",
      "created": 1608055036,
      "upvotes": 207,
      "replies": {
        "gfz8ja2": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfz8ja2/",
          "text": "I have these as well, often towards the end of a grueling semester. But after the shine of my fantasy wears off, I finally ask myself, would that fantasy life actually make me happier? Would it really be better than the freedom and autonomy I have currently? The answer is probably no. These are fantasies for a reason. Because you’re not thinking about the headaches that would also come along with that new, totally different career. Life is tough. And wherever you go, there you will be. Grass is not always greener, as they say.",
          "author": "CuriousCat9673",
          "created": 1608077059,
          "upvotes": 31,
          "replies": {
            "gg1mce9": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg1mce9/",
              "text": "Well, or as I like to put it, if your neighbor has greener grass, it's because he or she is putting in the effort to make it that way. You have to invest in whatever you do to make it work for you. A lot of people I see who are constantly chasing greener grass are looking for reward without investment. \n\nSometimes there are truly better situations, though. So one doesn't need to accept that one's lot is the only one that could possibly be. But such things take a lot of introspection and consideration.\n\nThat being said, academia has its ups and its downs. The fact that other jobs have their ups and downs doesn't mean that their ups, or their downs, might not be better or worse than academia.",
              "author": "restricteddata",
              "created": 1608136818,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gfzda3o": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzda3o/",
          "text": "Thought I was the only one! A friend and I are actually in the process of opening up a bar! :)",
          "author": "Goliof",
          "created": 1608079693,
          "upvotes": 18,
          "replies": {
            "gfzduam": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzduam/",
              "text": "Good luck! I have no interest in running a bar myself, but one of my backup escapist fantasies is my husband (who fantasizes about opening a pizza shop) opening a bar that I get to frequent and decorate.",
              "author": "wantonyak",
              "created": 1608080003,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "gfzryfp": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzryfp/",
          "text": "Hey! I also dreamt about being a florist lol I finally left academia and I'm a translator now. And happier. I know nothing about plants.",
          "author": "Instinctivelily",
          "created": 1608087890,
          "upvotes": 5,
          "replies": {
            "gg10nh9": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg10nh9/",
              "text": "That's amazing - congratulations!",
              "author": "wantonyak",
              "created": 1608124774,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gg12mqa": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg12mqa/",
          "text": "Mine is about becoming a baker!\n\nThe fantasy usually breaks down when I get too deep in to the logistics. I do love my job, I just get burned out sometimes.",
          "author": "Esmereldista",
          "created": 1608126140,
          "upvotes": 5,
          "replies": {
            "gg17f2s": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg17f2s/",
              "text": "As do we all!",
              "author": "wantonyak",
              "created": 1608129090,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gfxzp1x": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxzp1x/",
      "text": "My Plan B if I decided to quit was to become a postal worker. I'm naturally a morning person and like taking long walks while listening to podcasts and I thought it looked pretty great, as long as I could work a walking route in a city or town (I don't like driving as much so wouldn't want a rural route). Plus it's a federal job with good benefits, or at least it was until the Postal Service was gutted by reforms in the... mid 2000s? early 2010s? something like that.\n\nI ended up not needing my Plan B, I just got tenure last year at my ideal institution (R2, some research expectations but not a ton, doable teaching load) in a city I enjoy living so I feel a little like I hit the academia jackpot. But, you are not alone.",
      "author": "boilerlashes",
      "created": 1608055720,
      "upvotes": 70,
      "replies": {
        "gfy2lro": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy2lro/",
          "text": "I feel like this is a better answer for people like OP (and me, for that matter) who just don't enjoy the modern research environment. I left academia for a corporate job, and it's not less stressful. It's just different stress.\n\nI think a job at a SLAC, R2, regional school, etc., is probably a better fit for most people in this situation. Those jobs aren't trivial to get either, but a job where you can teach, work on research that  excites you without needing 18 collaborators in 12 countries because that's what a modern EU grant is, that feels like a better escapist plan than trying to launch a business if your dream isn't actually about running a business.",
          "author": "deong",
          "created": 1608057065,
          "upvotes": 35,
          "replies": {
            "gfy3m66": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy3m66/",
              "text": "Yeah, I honestly love where I work. I have no regrets about leaving the high-pressure research situation I was in during my postdoc, and I feel like I escaped the massive levels of stress I saw my PhD and postdoc PIs go through. \n\nYou do have deliberately plan to build your CV to be attractive to a uni like mine - we regularly decline to interview folks who seem like they are aiming for a more research-heavy job as we assume they will use a faculty position at our institution as a stepping stone for an R1 and we cannot afford to search / award startups constantly. But man it's a good gig if you can get it.",
              "author": "boilerlashes",
              "created": 1608057522,
              "upvotes": 20,
              "replies": {}
            },
            "gfylq2a": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfylq2a/",
              "text": "I do wonder about that. I feel like people just go from a rose tinted glasses view of academia to a rose tinted glasses view of whatever new industry. Small businesses in particular are crazy stressful and pretty small margins for the owners.",
              "author": "mediocre-spice",
              "created": 1608065633,
              "upvotes": 9,
              "replies": {}
            },
            "gfzs6tc": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzs6tc/",
              "text": "I am at a state regional, it is pretty amazing. Salary not great, but full autonomy, easy research, great teaching.",
              "author": "nc_bound",
              "created": 1608088023,
              "upvotes": 4,
              "replies": {}
            },
            "gfyfyuj": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyfyuj/",
              "text": "OP is in the UK, though, which limits the type of institution to work at. There isn't anything quite like a SLAC, but there are institutions that are less research intensive.",
              "author": "AerosolHubris",
              "created": 1608062950,
              "upvotes": 4,
              "replies": {}
            },
            "gfz99sj": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfz99sj/",
              "text": "Would you mind expanding on the difference between the stress? I am currently working in industry, managing and running a medium-small company. Currently the plan is to quite in 2 years at age 31 and go back for PhD. I've been teaching as an adjunct at a local regional university and the stress is nothing like the corporate job. I haven't talked to anyone who works at an R1 or R2 about their stress levels yet.",
              "author": "vw68MINI06",
              "created": 1608077472,
              "upvotes": 3,
              "replies": {
                "gg1xmw1": {
                  "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg1xmw1/",
                  "text": "At high-level research institutions, I would describe the stress as being the idea that you're in charge of your own fortunes, but in a system that makes success fairly unlikely. \n\nLet's say you're the lucky winner of a brand-new assistant professor position at an R1. You get an offer of $140,000 a year and a $40,000 startup package to get your lab rolling. You have about four years to really make a mark before your first big checkpoint. So take that $140,000 times four years plus the $40k, and you have $600,000. Divide that into four equal piles of $150,000, and every year on January 1, fly to Vegas, walk up to a roulette wheel, and bet the whole thing on a corner bet (8-1 odds). If you go any consecutive four years without winning, your career is over.\n\nThat's what a research career feels like to me. You cannot survive without substantial grants, and winning a substantial grant has somewhere between a 2% and maybe a 15% hit rate. Each one takes six months to prepare and another six months to get a result from. And every year you fail just puts you a little further behind the people who won and therefore get to show that much more successful funding than you when you both apply next year. \n\nThe reality isn't quite that bleak. There are ways that you can mitigate the risks and try to scrabble together some notion of success that will keep you employed, but that's no way to go through life. You will absolutely feel like you need to hit that corner bet this year, and if you don't you will be afraid for your future. That is constant until you're tenured.\n\nHaving said that, I spent five years in an environment that was probably closer to R2 than R1, and all this is my perception colored by my own anxiety around it, so your mileage may vary, as they say.",
                  "author": "deong",
                  "created": 1608142204,
                  "upvotes": 3,
                  "replies": {
                    "gg27ilp": {
                      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg27ilp/",
                      "text": "Thanks for the detailed answer! \nYour stress of feeling like you need to hit the corner bet every year is pretty similar to what I have experienced in industry. I ended up as a sales engineer at a rep firm instead of the traditional engineering route. Every month I either make it big or have to use savings from last month to cover my bills. I have a constant worry that construction projects will stop or my customers might start favoring my competition. Also, if I have a slow month, I have to make the boss think next month won't be slow and give some kind of evidence that I am building up the sales pipeline.\n\nAll that I could handle if it was toned down a bit but I also feel like my job is useless and I don't do anything that matters. I am pretty passionate about research and creativity. There is no role for that in my company.  Sounds like the big change would be the fact that the anxiety would come along with me doing what I am passionate about instead of selling HVAC widgets. \n\nThanks again for the information!",
                      "author": "vw68MINI06",
                      "created": 1608146784,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gg0u405": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0u405/",
              "text": "What’re those abbreviations like SLAC and R2",
              "author": "Sckaledoom",
              "created": 1608119224,
              "upvotes": 1,
              "replies": {
                "gg0z17i": {
                  "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0z17i/",
                  "text": "SLAC = Small Liberal Arts College\n\nR2 is part of a classification system (https://en.m.wikipedia.org/wiki/Carnegie_Classification_of_Institutions_of_Higher_Education) and indicates a mid-tier research institution.",
                  "author": "deong",
                  "created": 1608123560,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gfxugu7": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxugu7/",
      "text": "Full Professor here at an R1 and I’d love to start a brewery 👍",
      "author": "plinianeruption",
      "created": 1608053307,
      "upvotes": 106,
      "replies": {
        "gfy73ex": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy73ex/",
          "text": "Eh, don't. Opening a brewery is a great way to start hating brewing. It's a business like any other. Except it's arguably worse because it's both a popular \"dream job\" and you'll quickly learn that you're not going to make enough money to keep your doors open if you don't sell out and sell whatever the flavor of the month beer is which will almost assuredly not be something you enjoy or something that shows a particularly high skill level on the part of the brewer.\n\nNow, if you want to start a small scale local business for some beer money on the side, that's different. Check your alcohol laws though. That works well for cold brews, but I don't know about beer.",
          "author": "Mezmorizor",
          "created": 1608059057,
          "upvotes": 49,
          "replies": {
            "gfzczvd": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzczvd/",
              "text": "Crusher of hopes and dreams, are you",
              "author": "plinianeruption",
              "created": 1608079532,
              "upvotes": 24,
              "replies": {}
            }
          }
        },
        "gfxw8ug": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxw8ug/",
          "text": "I'm now a college administrator but have been buying brewery equipment as I see it come available at the right price with the goal of opening one in the near to mid term",
          "author": "PBandJammm",
          "created": 1608054131,
          "upvotes": 39,
          "replies": {
            "gfxwyxd": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxwyxd/",
              "text": "That sounds great",
              "author": "plinianeruption",
              "created": 1608054466,
              "upvotes": 8,
              "replies": {
                "gfzat7o": {
                  "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzat7o/",
                  "text": "Especially the implicit 'one less administrator'.",
                  "author": "makemeking706",
                  "created": 1608078326,
                  "upvotes": 19,
                  "replies": {}
                }
              }
            }
          }
        },
        "gfxz7q1": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxz7q1/",
          "text": "I remember a few friends and a professor started a brewing club on campus. It was pretty cool, the school would fund all of the equipment & supplies and every now and then they'd provide a few kegs for one of the grad student parties the administration would throw. I will say, though, the pumpkin ale was absolutely disgusting, lol.",
          "author": "racinreaver",
          "created": 1608055494,
          "upvotes": 21,
          "replies": {
            "gfz347v": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfz347v/",
              "text": "thats a great idea",
              "author": "kaswing",
              "created": 1608074129,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gfxtji5": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxtji5/",
      "text": "My plan B was to work in a video rental and reducing my problems to not rewound tapes. But then VCRs became obsolete any now I have to stick to academia.",
      "author": "Why_So_Slow",
      "created": 1608052874,
      "upvotes": 173,
      "replies": {
        "gfxw17r": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxw17r/",
          "text": "I've been enjoying my time rewinding DVDs, and am thinking of working my way up to rewinding Blu-rays.",
          "author": "monkestful",
          "created": 1608054034,
          "upvotes": 45,
          "replies": {
            "gfxy1zb": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxy1zb/",
              "text": "You're going to need a bigger pencil",
              "author": "Flatland_Mayor",
              "created": 1608054959,
              "upvotes": 31,
              "replies": {}
            }
          }
        },
        "gg1mvij": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg1mvij/",
          "text": "I know you're joking, but as someone who did work in video rental (before Netflix killed all of that), the whole thing was rife with problems of every nature and magnitude (from kids pissing on the carpet, to terrible policies handed down from corporate overlords who were always looking for a way to squeeze out an extra dime). I was the lowest guy on the totem pole but it didn't look to me like anyone I met there — from our manager to his boss and so on — thought it was a relaxing way to make a buck. \n\nI did, however, get to rent as many movies as I wanted for free, and that was fun for a summer.",
          "author": "restricteddata",
          "created": 1608137073,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gfxxr4x": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxxr4x/",
      "text": "I would love to either be a sugar baby or a magician, whichever comes first. The former is a plan in the making at least\n\nI understand you, mate",
      "author": null,
      "created": 1608054823,
      "upvotes": 88,
      "replies": {
        "gfyl362": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyl362/",
          "text": "I aspire to be a trust fund kid or trophy wife so I can focus on my research but no luck so far",
          "author": "mediocre-spice",
          "created": 1608065337,
          "upvotes": 41,
          "replies": {
            "gfyt021": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyt021/",
              "text": "upgrade to exceptional-spice",
              "author": "fumblesmcdrum",
              "created": 1608069093,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "gfzaxkc": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzaxkc/",
          "text": "Either way, it's all about have quick hands.",
          "author": "makemeking706",
          "created": 1608078392,
          "upvotes": 17,
          "replies": {}
        },
        "gfy1jcm": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy1jcm/",
          "text": ">a sugar baby\n\nThis is the way",
          "author": "yourmomdotbiz",
          "created": 1608056578,
          "upvotes": 44,
          "replies": {
            "gfz2cgs": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfz2cgs/",
              "text": "Oh certainly. I've already told my advisor that if I managed to land a research internship in Europe I will certainly look for a sugar daddy and, if I do, I will buy stuff for the lab. He gave me a thumbs up",
              "author": null,
              "created": 1608073718,
              "upvotes": 16,
              "replies": {}
            }
          }
        }
      }
    },
    "gfxv7g4": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxv7g4/",
      "text": "My plan B was/is to be a wedding planner. That's not necessarily a lower-stress job, but at least vendors are more likely to respond to your emails and be cooperative than collaborators are.\n\nThen again, current circumstances definitely make me appreciate not being in an industry dependent on customers.",
      "author": "aggressive-teaspoon",
      "created": 1608053653,
      "upvotes": 67,
      "replies": {
        "gfxwnhv": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxwnhv/",
          "text": "I used to be a project manager who managed a lot of events. \n\n> vendors are more likely to respond to your emails and be cooperative than collaborators are\n\nHa. Hahahahaha. My entire job was getting other people to do their jobs.",
          "author": "banamana27",
          "created": 1608054318,
          "upvotes": 41,
          "replies": {
            "gg0uflx": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0uflx/",
              "text": "I know right? In my engineering internship I emailed a bunch of chemical vendors for information for a project I was working on that would make *their* lives easier and I was getting first responses from some of them weeks later.",
              "author": "Sckaledoom",
              "created": 1608119536,
              "upvotes": 2,
              "replies": {
                "gg24pqj": {
                  "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg24pqj/",
                  "text": "Yup. I would always send an email, send a follow up email about 3-4 business days later, then subsequent follow up emails would become increasingly more frequent. For incredibly difficult people, my strategy was to become more annoying than the thing I was trying to get them to do so they would finally just give up and do it.",
                  "author": "banamana27",
                  "created": 1608145477,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gfyhuq5": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyhuq5/",
          "text": "Bridezillas vs grade grubbers/admin/nit-picky IRBs\n\nTough one.",
          "author": "SailTheWorldWithMe",
          "created": 1608063824,
          "upvotes": 12,
          "replies": {}
        },
        "gfzcyr1": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzcyr1/",
          "text": "God. You would hope that vendors would respond to emails, but I organized a few school events, and let me tell you....they don't. \n\nIt is like they don't want the money I'm paying them.",
          "author": "joobtastic",
          "created": 1608079515,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gfxuoa4": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxuoa4/",
      "text": "I know plenty of ChemE/Chem PhDs who home brew (and some have won awards at national home brewing competitions).\n\nNone of them would want to start a brewery due to the cost (selling/making alcohol for non-personal use is expensive) and not wanting to focus on the business aspects.",
      "author": "jpc4zd",
      "created": 1608053403,
      "upvotes": 31,
      "replies": {}
    },
    "gfxxw29": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxxw29/",
      "text": "All the time! I think about having a bakery a lot, and I always remind myself that just bc I’m getting a PhD doesn’t mean I can’t open my own bakery later on in life :)",
      "author": "sugarwater28",
      "created": 1608054884,
      "upvotes": 31,
      "replies": {
        "gfxxx8a": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxxx8a/",
          "text": ">:)\n\n:)",
          "author": "tiny_smile_bot",
          "created": 1608054898,
          "upvotes": 20,
          "replies": {
            "gfylo4a": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfylo4a/",
              "text": "Good bot",
              "author": "kwik_kwek_en_kwak",
              "created": 1608065608,
              "upvotes": 8,
              "replies": {
                "gfylp7e": {
                  "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfylp7e/",
                  "text": "Thank you, kwik_kwek_en_kwak, for voting on tiny_smile_bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                  "author": "B0tRank",
                  "created": 1608065622,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "gg0frsu": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0frsu/",
          "text": "Yep my escape fantasy is to become a *baker* or run a cafe.",
          "author": "52in52Hedgehog",
          "created": 1608104890,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gfxv0qz": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxv0qz/",
      "text": "Senior lecturer here, in Entrepreneurship. I constantly see opportunities to do different projects and over the years have seen my students go on and do amazing things. I reflect on this issue on an almost daily basis.",
      "author": "schumpter81",
      "created": 1608053566,
      "upvotes": 62,
      "replies": {
        "gfye97g": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfye97g/",
          "text": "PhD to CEO is the way",
          "author": "Anasoori",
          "created": 1608062183,
          "upvotes": 13,
          "replies": {
            "gfyeqje": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyeqje/",
              "text": "Ha. Unlikely. Truth be known. I've seen the failures too. It's not pretty the other way. One of the paradoxes of capitalism.",
              "author": "schumpter81",
              "created": 1608062392,
              "upvotes": 15,
              "replies": {
                "gfypj87": {
                  "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfypj87/",
                  "text": "Just gotta keep trying though. Not only as individuals but as a community. The successes don't come without the failures.",
                  "author": "Anasoori",
                  "created": 1608067445,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gfxwygr": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxwygr/",
      "text": "We call it the “fuck it plan”. Basically when you finally say “fuck it, I’m out”. My boyfriend’s plan is to open a bakery with a secret Mac and cheese menu. I think it would be really fun to have a tea and/or wine shop.",
      "author": "banamana27",
      "created": 1608054460,
      "upvotes": 51,
      "replies": {}
    },
    "gfxyjd6": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxyjd6/",
      "text": "I can remember as an undergrad I had a last year PhD student that taught composition.  He was already completely burned out and would sit cross legged on the desk and tell us how when he graduated, he was going to move to Cincinnati to sell shoes.  I don't know why, but that always stuck with me. \n\nI was in restaurant management before I went to grad school and I have always thought that would be my backup if things did not work out in academics, but truthfully, I hated working in restaurants.  No rude student or staff member has ever rubbed me the wrong way like a rude customer.",
      "author": "manova",
      "created": 1608055181,
      "upvotes": 21,
      "replies": {
        "gg019xw": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg019xw/",
          "text": "Lmao. I’m from Cincinnati. Currently in a grad program not in Cincinnati (not in Ohio in general), but I was born and raised there, and lived there for the first 22 years of my life (18 if you don’t count college which was also out of state). I’m not sure what is so special about Cincinnati with regard to selling shoes. I think all the big sneaker head and shoe collectors are generally on the east and west coast from what I’ve seen online. There are some nice running shoe stores but not many. Bob’s running shoes comes to mind and I think that one’s in Newport, KY? My mom raves about it from time to time (or used to b/c Covid). \n\nYeah, not sure what’s so special about the place. I think most people think of it as just a no-name Midwestern city that’s kind of a cliche for “eh, just going to go to some low-key city in the midwest.” Cincinnati has really changed in the last 10-15 years. I wouldn’t necessarily say it’s small. We have an NFL team, an MLB team, Xavier basketball is huge, our Soccer team kills it, we have a good number of Fortune 500 companies, King’s Island, etc. \n\nIf you want small go to Dayton, Toledo, Akron, or Chillicothe. \n\nInteresting PhD guy that one is/was.",
          "author": "Citizen_of_Danksburg",
          "created": 1608093572,
          "upvotes": 3,
          "replies": {
            "gg02x19": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg02x19/",
              "text": "> “eh, just going to go to some low-key city in the midwest.”\n\nI think that was his thing.  This was 25 years ago and Cincinnati was nearly 1000 miles away from us.  I think it was all about checking out of academics.  \n\nI also remember he played in a band because a student in the class also played, so the first part of every Monday was them discussing their gigs over the weekend.  I don't know what the music scene was there 25 years ago.",
              "author": "manova",
              "created": 1608094661,
              "upvotes": 3,
              "replies": {}
            },
            "gg19ill": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg19ill/",
              "text": ">our Soccer team kills it\n\nFC Cincinnati kills it?? Since when?? Compared to Vancouver, sure.\n\nColumbus sure does though...\n\nSad tears from Sounders fan here....\n\nMy backup plan is to make model ships and sell them....😆",
              "author": "OrionAnthracis",
              "created": 1608130280,
              "upvotes": 1,
              "replies": {
                "gg1b0oc": {
                  "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg1b0oc/",
                  "text": "Frankly that’s just what I’ve heard. It could very well be outdated information, I don’t follow sports other than Chess if you want to count that. I looked it up and yeah, their MLS history isn’t great. I think when they first came onto the scene though before they were an MLS team they were good? I remember hearing a bunch of people talk about it like they were the next great thing. \n\nYo that’s a dope backup plan. My mom runs a nonprofit in the city that works with pretty much every major brewery outside of Madtree, and I say that because after being her delivery boy and working with all these places, opening up a brewery is absolutely no small task. Suuuper fucking expensive to get all the equipment, the building, land, electricity, etc., and yeah, if you don’t brew what’s popular you ain’t getting business. Making model ships seems much more appealing and relaxing if you ask me :D",
                  "author": "Citizen_of_Danksburg",
                  "created": 1608131097,
                  "upvotes": 2,
                  "replies": {
                    "gg3aj1m": {
                      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg3aj1m/",
                      "text": "Yeah they were having a great run in the USL league. Bummer it couldn't continue once they made the jump to MLS. \nChess is something I've been trying to get into lately, but it's hard without a proper teacher haha.\nIf only hobbies were financially profitable, but the mental benefits are worth it either way!",
                      "author": "OrionAnthracis",
                      "created": 1608166275,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gfxy5lp": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxy5lp/",
      "text": "Just want to pop in and say - you do you. People switch careers all the time; many on here get tons of feedback about switching to academia “later in life.” We’re all trying to find the most fulfilling path, and sometimes that means stepping away from a dream you had before and embracing the dream you have for yourself now. Many times life makes those decisions for us. It sounds like you’re in a good spot in that you can make the decision for yourself - at least professionally. \n\nIt may be worth thinking through what elements you’d like in a “dream” job (in addition to positive feedback) and how that relates to what you want outside of work. Good luck!",
      "author": "GritAndLit",
      "created": 1608055005,
      "upvotes": 20,
      "replies": {}
    },
    "gfxto50": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxto50/",
      "text": "I haven't done this, but I fantasize of a new business idea every few weeks with the coworkers. We've had some amazing ideas and one day...",
      "author": "CuriousGeorgeVII",
      "created": 1608052935,
      "upvotes": 19,
      "replies": {}
    },
    "gfy0o8w": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy0o8w/",
      "text": "I started publishing poetry and I have a Baby Yoda meme account. Not quite a brewery or plumbing, but out there endeavors for someone in my position",
      "author": "yourmomdotbiz",
      "created": 1608056178,
      "upvotes": 16,
      "replies": {}
    },
    "gfy0w1p": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy0w1p/",
      "text": "Not completely insane. I have a back burner dream of opening up a barkery- bar/bakery, possibly with a geology theme.  Biscuits and gravy available at any hour of the day, and otherwise an assortment of things I like to bake (namely cheesecakes) paired with craft beer and wine.",
      "author": "ivorybiscuit",
      "created": 1608056277,
      "upvotes": 16,
      "replies": {
        "gfyj6d4": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyj6d4/",
          "text": "I was thinking about a prehistory/ice age themed bakery 😂",
          "author": "Oatkeeperz",
          "created": 1608064442,
          "upvotes": 7,
          "replies": {
            "gfyqtfr": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyqtfr/",
              "text": "I’ve always wanted to open a philosophy themed bagel shop: Hegel’s Bagels and Locke.",
              "author": "drLilu",
              "created": 1608068060,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "gfxuwkj": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxuwkj/",
      "text": "Quite a lot of people I know have dreams about becoming something else. I think it has to do with mental exhaustion. I dreamed about opening up a library cafe. Never happened. Would try it if I had a lot of money.",
      "author": "buzzbuzzar",
      "created": 1608053511,
      "upvotes": 14,
      "replies": {}
    },
    "gfxvmfz": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxvmfz/",
      "text": "thinking of startup company and self-employed in next year 2021. As long as comfortable living and don't need to deal with BS, I believe it's good for my health and longevity. It will also give me more freedom and time to do exercise. \n\n&#x200B;\n\n[https://www.vox.com/health-care/2018/10/4/17936626/leon-lederman-nobel-prize-medical-bills](https://www.vox.com/health-care/2018/10/4/17936626/leon-lederman-nobel-prize-medical-bills)\n\n\\- The pride\n\n\\- The dignity\n\n\\- The top notched scientist\n\nWho the F cares when you can't even pay the bill from your medical condition? \n\nThose medical conditions would probably be accumulated over years of dealing with BS.",
      "author": "yourseck",
      "created": 1608053844,
      "upvotes": 13,
      "replies": {
        "gfxxogb": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxxogb/",
          "text": "Oh god, yes thanks for sharing the link. I saw this at the time, and it just blew me away. A  Nobel laureate selling their medal to cover medical bills. This is certainly a world away from the \"academia\" that I had for so long romanticized.",
          "author": "Least_Curious_Crab",
          "created": 1608054789,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "gfymcfr": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfymcfr/",
      "text": "During my time in grad school I often fantasized about being that dude who holds a stop sign during road construction.",
      "author": "demerdar",
      "created": 1608065927,
      "upvotes": 13,
      "replies": {
        "gfzafaw": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzafaw/",
          "text": "Ok this is the best answer.",
          "author": "CuriousCat9673",
          "created": 1608078111,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gfy0hqy": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy0hqy/",
      "text": "Not an academic but aspiring towards a PhD, and also someone who works with former academics; try public policy. Public service is nice in that you can treat it as a job rather than a calling, and don’t have to produce cutting edge work all the time, just do the job. It takes a while to temper the ambition to rise, but actually being around people who are happy where they are and the work they do without being stressed all the time has been refreshing.",
      "author": "yoshah",
      "created": 1608056094,
      "upvotes": 9,
      "replies": {}
    },
    "gfy16xf": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy16xf/",
      "text": "There is a man in the town where our local R1 is that went through all of a doctoral program in English and decided, \"Screw it.  I'd rather open a restaurant\".  He opened one of the most popular pizza places in the area with some damn good pizzas and calzones.  Sadly, his restaurant just closed due to taking too many losses during the COVID pandemic.  Not sure what he's going to do now.  \n\n\nSo, if you're feeling led to do something different, don't feel bad about that dream.  You don't have to do academia.  Hell, my backup/ retirement plan is opening a hot dog stand.  Good luck!",
      "author": "DarkwingDoctor",
      "created": 1608056416,
      "upvotes": 10,
      "replies": {}
    },
    "gfy1yzk": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy1yzk/",
      "text": "The world needs more doggy day cares.",
      "author": "undercoverbunn",
      "created": 1608056775,
      "upvotes": 8,
      "replies": {}
    },
    "gfy31tr": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy31tr/",
      "text": "Have seen several comments here that seem to suggest that this sort of desire is especially prevalent in academia. Let's not get too navel-gaze-y here. This is something that almost everyone does. I think it's helpful to remember that while there are differences between our job and other types of jobs, almost all jobs have unique facets. There's nothing particularly special or romantic about working in academia.",
      "author": "Aubenabee",
      "created": 1608057269,
      "upvotes": 15,
      "replies": {
        "gg0usv8": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0usv8/",
          "text": "Hell, my brother is an engineer in a factory and he fantasizes about getting into academia for philosophy.",
          "author": "Sckaledoom",
          "created": 1608119898,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gfy05ug": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy05ug/",
      "text": "I still dream all the time about moving back home and taking over my parent's chicken-wing restaurant. The thought of a 9-5 at a successful business is so attractive to me.",
      "author": "rcxheth",
      "created": 1608055941,
      "upvotes": 9,
      "replies": {}
    },
    "gfy09xo": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy09xo/",
      "text": "I did my PhD in Wyoming, where my grandpa way back when was a coal miner. Sometimes I dream of starting/joining a ranch or agricultural farm out there, but I'll stick with academia for the time being!",
      "author": "WyoBioCowpoke",
      "created": 1608055993,
      "upvotes": 7,
      "replies": {}
    },
    "gfy4dyk": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy4dyk/",
      "text": "Have you considered working for a smaller company or somewhere not at \"the top\"? I mean, I have only ever heard bad things about working at the top institutions or companies- Mostly the same complaints you have: hyper-competitiveness, no amount of work is ever enough, unreasonable expectations, long hours, shady practices/ethics, etc. \n\nThere are places that don't have this atmosphere to the same extent. Certain parts of govt for example. \n\nBut yeah, I'd love to open a winery or brewery on a beautiful piece of land with nice views. I studied chemistry and always wondered that I took the time to study food science if I could make the switch one day.",
      "author": "stathicus",
      "created": 1608057865,
      "upvotes": 8,
      "replies": {
        "gfy5sjb": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy5sjb/",
          "text": "Thanks for this. Yes, I have started to consider SME. I guess I always felt that the \"top\" institutions would naturally be \"better\" places to work. I'm now questioning where my assumption there came from, it's clearly in need of modification. I once worked for a small VC start-up, and that was also a nightmare. I trying to understand if I'm cut out for academia, or whether I should apply my skillset elsewhere.",
          "author": "Least_Curious_Crab",
          "created": 1608058483,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gfxwuyf": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxwuyf/",
      "text": "I am training to be a beer sommeilère (to the moment, is more of a hobby to take the edge off than anything). Maybe we can join paths?",
      "author": "StrawberryinPizza",
      "created": 1608054414,
      "upvotes": 7,
      "replies": {}
    },
    "gfy03sd": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy03sd/",
      "text": "Let's see. I've fantasized becoming these in the past few days: woodworker, ceramic artist, salesperson in an arts supply store, researcher for film makers and many more.",
      "author": "ajayaviator",
      "created": 1608055913,
      "upvotes": 6,
      "replies": {}
    },
    "gfyqi9e": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyqi9e/",
      "text": "My best friend did this. I think his story is exactly the one you're looking for, so let me give you a little background. We met at university when we both happened to show up for a meet-up of the outdoor adventure club and realized we were the only people there who had any real climbing skill/experience. He already held a world record in mountaineering by that point and I had a car, so we would drive to the local climbing gym at least once a week and talk about economics. Years later, he ended up at the Rand Corporation working on a number of big projects. He hated it. He realized that the entire culture / all of the incentives were structured such that real results were not being published and office politics were horrible. He told me that even though his projects received substantial money to help people with real problems that the money wasn't ultimately being spent to meaningfully test the theories he felt were important because the powers that be were too eager to rush out papers rather than effect real change. So he took advantage of the flexible work schedule and started working 10 hours/day, Monday through Thursday and spent every Friday, Saturday and Sunday at Joshua Tree, which is only a 2.5 hour drive from LA (where the main office of Rand Corporation is located), until he got a specific certification and qualified to become a guide. He then got a second job and started guiding rock climbing trips in Joshua Tree on the weekend until he had built up enough trips as a co-guide that the company he was working for would let him be a lead guide. He then worked as a lead guide (still holding the job at the Rand Corporation) at Joshua Tree every weekend until he built up enough trips that the company he was working for agreed to hire him on full time and let him pick ~~any destination in the world~~ superior destinations from a broader list that was previously unavailable to him. He now guides mountaineering trips in Oregon and Washington state. He barely texts me anymore because he's almost always outside of cell service. But, as far as I can tell, he's much happier than he's ever been before.\n\nMeanwhile, I still love climbing, but I love economic research more. I have been able to live vicariously through my best friend and learn from his experience. But, unlike him, I know that I won't be whole unless I take my research further and contribute more to my field. \n\nSo, moral of the story: we're all a little bit different. If you want to go out and do something else, before I saw what my friend did, I would have said: you're crazy and should stick to your research. But, after seeing what happened to my best friend, I can honestly say: you do you. Just take measured steps like he did so that it's sustainable. He didn't quit his job immediately, he built a new life while holding onto a job he hated because he knew he needed the first income stream and didn't have the second income stream well-established just yet.\n\nEdit: minor edits.",
      "author": "WildAboutPhysex",
      "created": 1608067909,
      "upvotes": 6,
      "replies": {
        "gfz6xex": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfz6xex/",
          "text": "Hey thanks for such a detailed post. Wow, what an incredible story. \n\n>If you want to go out and do something else, before I saw what my friend did, I would have said: you're crazy and should stick to your research.\n\nYeah that what my friends think at the mo. You're totally right that I need a plan. I guess in some ways it's an unusual career move, and it's hard to find other examples, so thank you again for sharing yours.",
          "author": "Least_Curious_Crab",
          "created": 1608076186,
          "upvotes": 2,
          "replies": {
            "gfznp8s": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfznp8s/",
              "text": "Given your background, I'm sure you know the story behind the Student's t-distribution. I'm sure there's plenty of ways for you to contribute your scientific knowledge to another pursuit that you may find more interesting. After all, there's a lot of science in running a brewery, as William Sealy Gosset proved!\n\nAlso, I'd love to hear about your plans, or even just your brainstorming as you try figure out where to go next. Given how this year has limited our socializing, I'm down to pick up a new friend or penpal.",
              "author": "WildAboutPhysex",
              "created": 1608085502,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gfxzd9x": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxzd9x/",
      "text": "When I was doing my PhD, one of the other PhD students in my group bailed on his PhD and started working as a brewer. He now owns a hugely successful brewery on the east coast.\n\nI think the problem is that transitioning any hobby to a career is going to make it \"work.\" I kind of enjoy my hobbies as hobbies and work as work but, then again, I don't have any teaching responsibilities, only research.",
      "author": null,
      "created": 1608055567,
      "upvotes": 8,
      "replies": {}
    },
    "gfy02nf": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy02nf/",
      "text": "I have a nanobrewery in my closet just for me. At this point, the best move forward for me is to get my degree and move into industry, but I frequently fantasize about going back in time and just being a plumber.",
      "author": "kitten_twinkletoes",
      "created": 1608055899,
      "upvotes": 4,
      "replies": {}
    },
    "gfy0vo4": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy0vo4/",
      "text": "R&D Engineer here - yes, am planning to return to monke ASAP",
      "author": "DhatKidM",
      "created": 1608056272,
      "upvotes": 4,
      "replies": {
        "gfy2hu7": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy2hu7/",
          "text": "Haha, I love the \"return to monke\" memes!",
          "author": "Least_Curious_Crab",
          "created": 1608057014,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gfy9eqq": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy9eqq/",
      "text": "I haven't made the call just yet, but I'm in a similar situation to you. I'm somewhere in the middle of my PhD, and I'm so fed up with all the bullshit that's going on, both locally at my university and in academia globally. I'm also starting to lose my interest in science completely as a result. I haven't been in the industry, so my current plan B is to start working as a penetration tester (my field is computer security).\n\nThat being said, I've also noticed that I feel much better working with more tangible things than computers as well, so my plan C is actually starting a brewery. So you're definitely not alone in feeling this way.",
      "author": "EelOfSteel",
      "created": 1608060097,
      "upvotes": 4,
      "replies": {}
    },
    "gfy67h6": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy67h6/",
      "text": "My plan B is to become a radio host with my amazing voice if academia does not work. Plan C involves a chocolate factory and cocoa harvesting :P",
      "author": "mr_kazemiro",
      "created": 1608058663,
      "upvotes": 3,
      "replies": {}
    },
    "gfy72mx": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy72mx/",
      "text": "sometimes I dream of quitting my job and becoming a professional illustrator. then I check out the freelance subs and am like, nope I like having a stable income too much.\n\nso yeah, I think \"being your own boss\" is actually extremely stressful, many of those people work 8 days a week to survive, and  idk how fun that is. But I've definitely thought about downshifting to a simple 9-5 where I do a bunch of repetitive tasks while listening to podcasts then go home and play vidya.",
      "author": "thegreenaquarium",
      "created": 1608059047,
      "upvotes": 3,
      "replies": {}
    },
    "gfy7ld0": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy7ld0/",
      "text": "Met a guy during my master that had a total plan, with parts list, prices, etc. to start a brewery !\n\nFor me, whenever I want to start working in a coffee shop, I know I need to take some time off, or relax a bit.",
      "author": "jtmooon",
      "created": 1608059280,
      "upvotes": 3,
      "replies": {}
    },
    "gfyef2i": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyef2i/",
      "text": "All I want is to start my own bookstore.... But here I am doing this thing I love in the lab and science doesn't love me back.",
      "author": "snaggletots22",
      "created": 1608062252,
      "upvotes": 3,
      "replies": {}
    },
    "gfyls5z": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyls5z/",
      "text": "Early 30s British academic like OP. Have a permanent position, reasonably successful research profile. Teach on my own research led modules.\n\nYou are not alone mate in feeling like that  The pressure is immense in academia - in the last few years I have been thinking I would be much happier in a job where you repeat what you do on a daily basis.",
      "author": "motorheadavcn",
      "created": 1608065662,
      "upvotes": 3,
      "replies": {
        "gfz7cx6": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfz7cx6/",
          "text": "Thanks for your post.\n\n>in the last few years I have been thinking I would be much happier in a job where you repeat what you do on a daily basis.\n\nI agree. Don't get me wrong I don't want to just coast, but sometimes it would be nice not be on my A-game every single day. I often think that if I step into a role/job that permitted a bit more breathing room, that I'd be happier.",
          "author": "Least_Curious_Crab",
          "created": 1608076418,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gfyvete": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyvete/",
      "text": "Woah... all these comments. I haven’t even started my career yet as I am in a research program still but this is literally all I think about. It is my dream job to open up a book café. It kind of scares me that I’m already having these escapist fantasies as someone here called them. I love writing and analyzing but it’s also so exhausting and draining. And I worry for my career.",
      "author": "thatnorthafricangirl",
      "created": 1608070260,
      "upvotes": 3,
      "replies": {}
    },
    "gfzcb97": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzcb97/",
      "text": "Not really a fantasy as I’m actively looking. Currently, I’m applying to full time instructional design jobs. I’ve had three interviews so far. I’ve given myself next year before the start of fall 2021 to find a full time job. If not, I’m going to study for the LSATs in the fall as I teach and go to law school so I can be in corporate law for a gas/oil company and make so freakin money lol. \n\nI’m tired of being poor and working like a farm horse for dishonest, entitled students. The good students make it worthwhile. I’m tired of saving money for the summer and not being able to go anywhere because I’m broke.",
      "author": "Ok_Marionberry_8468",
      "created": 1608079154,
      "upvotes": 3,
      "replies": {}
    },
    "gfzk6ug": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzk6ug/",
      "text": "Not a brewery but I really want to have my own workshop in my basement to build cool stuff and try out different tech :(",
      "author": "DreemingDemon",
      "created": 1608083543,
      "upvotes": 3,
      "replies": {}
    },
    "gfzkvsf": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzkvsf/",
      "text": "I'm not in academia, never have been, probably never will be but I come from an academic family, am in an academic adjacent field, and large sections of my social group have been or are in academia. Because of this I have a very different perspective than a lot of the commenters here and encourage you to honestly look at leaving the field you are in. \n\nThat being said, this can not be a snap decision and you will have to work very hard to not burn bridges as you make this decision no matter what it is. Sit down with yourself and write out the pros and cons of 1. leaving the field entirely, 2. taking a sabbatical/leave of absence, or 3. adjusting what area of academia/the sciences you are in. Talk with friends/family who's opinions you trust about your thoughts and research what steps you would like to take. \n\nIt is okay and so understandable to feel frustrated with work and life and reflect on times when things were simpler. You are in the UK so Covid stress is also a big thing and may be influencing your thoughts. Maybe consider talking to a councillor who has experience with work related stresses/trauma. \n\nAnd if you feel drawn to breweries, maybe, as you are thinking about all this look around at the breweries you are near, maybe craft brewing could be an awesome hobby for you on your downtime... Or home plumbing/repair projects as a way to recharge. \n\nI definitely wish you the best!",
      "author": "BeBoBorg",
      "created": 1608083926,
      "upvotes": 3,
      "replies": {}
    },
    "gfxzvjq": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfxzvjq/",
      "text": "Yes. I would love to move to SE Asia and start an American B&B/hostel. There are some British B&B's over there but I'm American and thought it would be fun to have one with familiar aspects of American culture. Not the annoying parts of our culture though. It would be a ton of work but I would love to just be spending my days greeting travelers and making their stays good, and I'd be able to do some traveling myself once I got the place up and running. I'm about to have a baby and I also sometimes fantasize about just being a SAHM, which I kind of will be since I'm planning to just fit dissertation work around the baby's schedule. I love love love what I do and I really do want to be a professor. But sometimes I think it would be nice to just do something where I'm not putting all of me into my work.",
      "author": "msr70",
      "created": 1608055806,
      "upvotes": 5,
      "replies": {}
    },
    "gfy3ten": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy3ten/",
      "text": "Barista",
      "author": "dsaalman",
      "created": 1608057613,
      "upvotes": 2,
      "replies": {}
    },
    "gfy44pf": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy44pf/",
      "text": "So a good friend of mine is in med school and I'm applying to grad school now but we talk about quitting it all and opening a bakery together more these days. My husband is a phenomenal cook and I wish we had a mini restaurant/bar with a psychology clinic attached 😂",
      "author": "a-deer-fox",
      "created": 1608057751,
      "upvotes": 2,
      "replies": {}
    },
    "gfy4iuc": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy4iuc/",
      "text": "Back up plan is be an system integrator for pcs. I have dreamed about being a mech engineer though or rockets.",
      "author": "Molecular_model_guy",
      "created": 1608057924,
      "upvotes": 2,
      "replies": {}
    },
    "gfy4l2n": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy4l2n/",
      "text": "Sometimes I stroll around Target and think, man I want to work here. Lol",
      "author": "DopeData",
      "created": 1608057951,
      "upvotes": 2,
      "replies": {}
    },
    "gfy6w2x": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy6w2x/",
      "text": "I feel very similar to you, also in a similar career stage. Although I would open a bakery not a brewery😂 I still don't have a courage to change. But it is getting pretty hard every day...",
      "author": "antagonista2020",
      "created": 1608058964,
      "upvotes": 2,
      "replies": {}
    },
    "gfy76rp": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy76rp/",
      "text": "I keep saying i want to quit and manage a plant shop/ nursery",
      "author": "vButts",
      "created": 1608059099,
      "upvotes": 2,
      "replies": {}
    },
    "gfy8x30": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy8x30/",
      "text": "Everyday.",
      "author": "molbionerd",
      "created": 1608059877,
      "upvotes": 2,
      "replies": {}
    },
    "gfy989x": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy989x/",
      "text": "I fantasize about becoming a plumber or electrician or something like that.  Maybe a mason?  Daily working hours, clear targets and end products, right and wrong ways to do things, still some trouble-shooting and problem-solving.  A mail carrier was a feature of my fantasy job for a while until I learned that their work is stressful as h\\*ll where I live and they're terribly managed.",
      "author": "ohbonobo",
      "created": 1608060017,
      "upvotes": 2,
      "replies": {}
    },
    "gfya48m": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfya48m/",
      "text": "I want to write genre fiction. Maybe a screenplay.",
      "author": "7Sax",
      "created": 1608060411,
      "upvotes": 2,
      "replies": {}
    },
    "gfya8v2": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfya8v2/",
      "text": "One guy from my department went to start a farm. Didn't want to do anymore chemistry, was tired of it all. Can't say I can't relate, been thinking a lot of how life would have worked out differently in professional school...",
      "author": "switchpot",
      "created": 1608060468,
      "upvotes": 2,
      "replies": {}
    },
    "gfyau8a": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyau8a/",
      "text": "I think about dropping out and becoming a firefighter all the time. (Late twenties ABD in the same field).",
      "author": "NonbinaryBootyBuildr",
      "created": 1608060733,
      "upvotes": 2,
      "replies": {}
    },
    "gfyd6ep": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyd6ep/",
      "text": "I fantasize about becoming a park ranger.  I realize this also takes training and jobs are also scarce in that field, but it's a fantasy that sometimes sustains me.",
      "author": "FamousCow",
      "created": 1608061785,
      "upvotes": 2,
      "replies": {}
    },
    "gfyjq7e": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyjq7e/",
      "text": "I've been seriously looking into training as an electrician or a welder. But I'm in a foreign country, which makes it difficult for me to find adequate training. I think about re-training in a trade or something else on a very regular basis. You're definitely not alone!",
      "author": "AnthroPluto",
      "created": 1608064704,
      "upvotes": 2,
      "replies": {
        "gfyy4qm": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyy4qm/",
          "text": "Yeah I'd love to do something like welding, electrician, or become a train driver. Actually looking to see if I can get an adult apprenticeship in the UK at the mo! Glad to know I'm not alone.",
          "author": "Least_Curious_Crab",
          "created": 1608071566,
          "upvotes": 2,
          "replies": {
            "gg0abo7": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0abo7/",
              "text": "I feel you. I think if I was back in the UK I would have already jumped ship. I have a couple of friends who are carpenters, organic farmers, one that owns a sustainable brewery,  and others doing more hands on crafts. Another one is doing a lectureship but has a national rail job lined up - he's very exited about it!  \n\nSometimes when I look at reflect on them I feel a sense of loss for what else I could have done. But I think the academic path was something I needed to do. I've taken a lot of lessons from this chapter. Primarily that I am not happy doing just thinking and no hands on practice, and I probably would not be happy doing just hands on without much thinking. I'm trying to think of my next step, and if there is a way I could find a sweet spot. I wish you luck in your journey!",
              "author": "AnthroPluto",
              "created": 1608100167,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gfyjrem": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyjrem/",
      "text": "Left academia after my PhD, and even though it's occasionally cut-throat as the commercial scene tends to be,  it's so much more relaxing work than my PhD has ever been.\n\nI do miss having time for my own research and hopping from one conference to another, but I definitely can do without the academic mindset.\n\nThen again, I still have some backup plans set out for when I'm done with this field ;)",
      "author": "Oatkeeperz",
      "created": 1608064720,
      "upvotes": 2,
      "replies": {}
    },
    "gfyjxe3": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyjxe3/",
      "text": "https://www.wweek.com/restaurants/2016/09/30/heres-what-happened-when-i-opened-a-restaurant-in-portland/\n\n---\n\n\nhttps://torontolife.com/food/restaurant-ruined-life/",
      "author": "lalochezia1",
      "created": 1608064798,
      "upvotes": 2,
      "replies": {}
    },
    "gfyk10p": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyk10p/",
      "text": "I’m just here waiting for my Etsy store to really take off",
      "author": "botheorange",
      "created": 1608064845,
      "upvotes": 2,
      "replies": {}
    },
    "gfymd3h": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfymd3h/",
      "text": "I’ve considered joining the military for a while just so I can shut my brain off and have someone else tell me what to do for a while",
      "author": "Bondulance911",
      "created": 1608065935,
      "upvotes": 2,
      "replies": {}
    },
    "gfyvmfl": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyvmfl/",
      "text": "It sounds like you need a job with better managers. I worked as a bioinformatics support at a biotech company right after my PhD and it was such a stark contrast. The littlest things I did were met with thanks and appreciation. The pay wasn’t too bad either. I ultimately quit because I didn’t enjoy doing tech support day to day but depending on what you specialize in, you might be able to find a better work environment that just appreciate you more. It also did have an answer usually, even if the answer is that our current pipeline doesn’t support this project idea of yours.",
      "author": "yenraelmao",
      "created": 1608070365,
      "upvotes": 2,
      "replies": {}
    },
    "gfywy34": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfywy34/",
      "text": "Pre-C19 I bar tended at a wine bar after classes, etc. Absolutely loved it. Looking into trying stand up post covid. I realized a long time ago academia was going to frustrate and demoralize if it was my only focus. The insularity of the academic culture is striking when you poke your head out and dabble in other types of work.",
      "author": "rboller",
      "created": 1608070971,
      "upvotes": 2,
      "replies": {}
    },
    "gfz290e": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfz290e/",
      "text": "PhD student here. \n\nI bake regularly  to keep the sanity at bay through editing and the amount of people who say that I should open a bakery is flattering. \n\nIt's kinda still a dream. Opening a cafe or something like that. Everyone has one. I don't think it's not normal to daydream about stuff. \n\nI would also be up for opening either a pub or a brewery. Either or.",
      "author": "DoodleCard",
      "created": 1608073668,
      "upvotes": 2,
      "replies": {}
    },
    "gfz7dkc": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfz7dkc/",
      "text": "Personally i would start a small food cart. The research is slowly killing my passion of cooking food from many cultures.",
      "author": "Mangek_Eou",
      "created": 1608076428,
      "upvotes": 2,
      "replies": {
        "gfzc5zi": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzc5zi/",
          "text": "My fiancé and I want to do this with two 40’ containers. A nice coffee/sandwich shop.  I’ve also thought about, once we build our home, of building a separate in-law suite to rent out.",
          "author": "apl2291",
          "created": 1608079074,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gfzh0j8": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzh0j8/",
      "text": "One time as I was walking to the office, I saw this guy painting a door. And I was so jealous of that guy. His day consisted of deciding to paint a door, starting, and finishing. I missed that feeling of finishing something.",
      "author": "MaptivistJudge",
      "created": 1608081767,
      "upvotes": 2,
      "replies": {}
    },
    "gg0pc67": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0pc67/",
      "text": "I know a professor who started a coffee shop. She talked about getting away from the constant pressure felt liberating. Although she feels pressure in the shop, that pressure is there to benefit her: she has impact on everything while in the University, she was just a part of a big machine. Besides her, I know a few people who went into alt-ac jobs. A history PhD for example went to work in a museum. Much less admin overburden and more contact with the public, so a better work-life balance in total. If you can move out (have the finances to do it), then I'd say go for it. Academia will not get better so it's either staying and accepting worsening working conditions and less opportunities, or taking life in your own hands.",
      "author": "frugalacademic",
      "created": 1608114322,
      "upvotes": 2,
      "replies": {}
    },
    "gfy5yee": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfy5yee/",
      "text": "I’m still just a lowly doctoral candidate. I’ve gotten past the point of no return, so I still plan to finish. But I’ve seriously considered trying a “digital nomad” lifestyle after I graduate. Maybe going off to live in some ultra-cheap country, like Thailand, and maybe teaching online ESL classes or tutoring part-time. It’s still academic work. But I do really like teaching, and after doing grad school at an R1, it feels like it’d be much less stressful.",
      "author": "anothergradstudent2",
      "created": 1608058554,
      "upvotes": 1,
      "replies": {
        "gfyaew6": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyaew6/",
          "text": "Online ESL? Interesting.\n\nHave you got your TESL/TEFL certifications?",
          "author": "7Sax",
          "created": 1608060542,
          "upvotes": 1,
          "replies": {
            "gfycd6q": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfycd6q/",
              "text": "Not yet. But I’ve looked into it and found out I could get certified fairly quickly at my current institution, and my tuition waiver would cover it! I just haven’t pulled the trigger yet. I’m still not entirely sure what I want to do.",
              "author": "anothergradstudent2",
              "created": 1608061420,
              "upvotes": 2,
              "replies": {
                "gfz754f": {
                  "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfz754f/",
                  "text": "I'm familiar with ESL as it was years ago. How does online ESL work?",
                  "author": "7Sax",
                  "created": 1608076302,
                  "upvotes": 1,
                  "replies": {
                    "gfznp45": {
                      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfznp45/",
                      "text": "To be honest, I haven’t looked into it enough to know the details of how classes work yet. But there are several companies that teach English exclusively online to students in various countries in Asia (often for exam/college prep, or adults hoping to work overseas). I imagine it works somewhat similarly to the way most university courses have moved online this year (meeting via video conference, etc.), but I’m not entirely sure.",
                      "author": "anothergradstudent2",
                      "created": 1608085500,
                      "upvotes": 1,
                      "replies": {
                        "gfzzb0l": {
                          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzzb0l/",
                          "text": "Look into it. My understanding of the ESL market is that the school/company you work for is *everything*. They range from fly-by-night gangsters to four star... sharks of a different type. \n\nI'd be curious to know what you find out.",
                          "author": "7Sax",
                          "created": 1608092304,
                          "upvotes": 1,
                          "replies": {
                            "gg0fydw": {
                              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0fydw/",
                              "text": "I’ve heard this, as well! Not so much in terms of the way classes are structured, but more so about the way some companies treat employees or have shady business practices. So if I do decide to take this route, I definitely plan to do my research and try to avoid anything like that!",
                              "author": "anothergradstudent2",
                              "created": 1608105059,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gfyafrz": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyafrz/",
      "text": "I'm applying to PhD programs and am already feeling burnt out and all the things you've mentioned wrt to the deadlines and expectations. Irs crazy. I wonder how I'm going to be after a PhD and post doc if I make it that far...",
      "author": "CHvader",
      "created": 1608060553,
      "upvotes": 1,
      "replies": {}
    },
    "gfyb3ox": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyb3ox/",
      "text": "Opening my own business ie brewery would still keep me in a cycle of obsession, workaholic-mindset and never feeling like I could clock out just like academia. But i do like hourly part time jobs in service and partly fantasize about any switch that would allow me to clock out and say Fxxk that job when I go home",
      "author": "maroonhaze",
      "created": 1608060855,
      "upvotes": 1,
      "replies": {}
    },
    "gfybjt2": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfybjt2/",
      "text": "Does quitting my STEMP professor job to become an artist count? Then yes. I think sabbaticals were invented to keep professors from simply quitting out of frustration.",
      "author": "eridalus",
      "created": 1608061055,
      "upvotes": 1,
      "replies": {}
    },
    "gfydrf9": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfydrf9/",
      "text": "Sort of.\n\nI took a 7 year break after high school to pursue being a musician. After gigging regularly and some touring, I decided I needed something more stable for work. Plus the alcohol and drugs were a bit toxic. So I applied to a uni in another state and got accepted. Pursued my undergrad in microbio, graduates with honors and received and accepted a fellowship for graduate school.\n\nI’m 1 semester away from finishing but I just have no more passion for academia at all. Haven’t stepped in my lab in over a month, let alone worked on writing.\n\nI’ve been jamming every single day with my musical toys and I haven’t felt this happy since before I started school.\n\nI’m considering dropping my program entirely just to go back to music. I’m tired of hearing “but the opportunity is too good to pass up!” It’s bs. If your mental health is suffering, then do what you need to do to get right. \n\n\nTLDR: school is cool, but I love music",
      "author": "GenericRaiderFan",
      "created": 1608062040,
      "upvotes": 1,
      "replies": {}
    },
    "gfyrcd6": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyrcd6/",
      "text": "I'm currently 2 years and 3 months into my PhD and I'm kind of torn at the moment about whether I want to stay in HE, whether I want to do R&D in industry......or whether I want to do something different altogether once I finish......maybe I'll be a train driver. I'm really not sure currently. \n\nI, for the most part, like my area of research, however I'm fully aware I'll never be one of the high fliers or someone who can constantly pump out high grade publications.",
      "author": "Molem7b5",
      "created": 1608068315,
      "upvotes": 1,
      "replies": {
        "gfyy8if": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfyy8if/",
          "text": "I've also looked at train driving. I think it'll be a great job.",
          "author": "Least_Curious_Crab",
          "created": 1608071619,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gfzv0g0": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzv0g0/",
      "text": "Constantly thinking about starting a side hustle.",
      "author": "justavg1",
      "created": 1608089674,
      "upvotes": 1,
      "replies": {}
    },
    "gfzwmvn": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzwmvn/",
      "text": "[Postdoc Brewing!](https://postdocbrewing.com/)\n\nI don't know them personally, but I'm familiar with their story and I saw them at local beerfests pre-COVID19.",
      "author": "alexa-488",
      "created": 1608090656,
      "upvotes": 1,
      "replies": {}
    },
    "gfzwz0x": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gfzwz0x/",
      "text": "I worked in a copy and print shop in undergrad and my escapist fantasy is working in one again or opening my own. I loved the repetitive nature, problems that can be solved in a day, and getting some physical activity while working.",
      "author": "geosynchronousorbit",
      "created": 1608090865,
      "upvotes": 1,
      "replies": {}
    },
    "gg03zb2": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg03zb2/",
      "text": "I'm veterinarian and I want to go back veterinary practice but that's also very stressful since you need to have some funding for your own place. So I'd like to pass the government exam and become a  vet in the government organizations instead. The other thing is to do art, I enjoy drawing. I'm just so bad at managing a business, I should better learn how to make money in social media.",
      "author": "earthsea_wizard",
      "created": 1608095388,
      "upvotes": 1,
      "replies": {}
    },
    "gg04bs9": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg04bs9/",
      "text": "I've said since I was in high school - if things don't work out I'll start a small bakery",
      "author": "jrvdl",
      "created": 1608095632,
      "upvotes": 1,
      "replies": {}
    },
    "gg060r1": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg060r1/",
      "text": "Me and some of my friends have been joking about getting a bar, with people who haven't left their job being equity partners.\n\nWe laugh but I'm not sure we were joking.",
      "author": "didtjdcns",
      "created": 1608096861,
      "upvotes": 1,
      "replies": {}
    },
    "gg06rk3": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg06rk3/",
      "text": "I loved reading about everyone's Plan B's, these kind of kind of clean-slate fantasies make me happy :)\n\nMine would be to homestead it in Appalachia. Keep livestock and crops to feed myself, adjunct at a community college, and AirBnB out a little cottage somewhere else on the property for some extra cash. Play music, cook good food, and go mountain biking every weekend. That's the dream.",
      "author": "dustonthedash",
      "created": 1608097401,
      "upvotes": 1,
      "replies": {}
    },
    "gg06vpp": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg06vpp/",
      "text": "The only way I got through my PhD was checking Indeed or other job sites to see what my possible alternatives were. Always decided to just push and finish up.",
      "author": "LadiesLoveMyPhD",
      "created": 1608097486,
      "upvotes": 1,
      "replies": {}
    },
    "gg0ali8": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0ali8/",
      "text": "Matthew Crawford did something just that. His work is really interesting. I particulalry like 'the world outside your head' (which is about how our attention has become a commodified item which corporations are after and the joy of the knowledge you get form working with your hands...Or perhaps the latter was the topic of his first book :)).\n\nHe has a motor bike repair shop after being dissillusioned with the think tank work he did after his PhD.\n\nIt NOT a romantisized take on working with your hands, but very interesting take on autonomy and how we relate to the physical world. I think his first book also dealth with how middle management jobs are so frustrating.\n\nI recommend looking him up. One of the most interesting books I've read the last few years.  (I should reread the books myself!)",
      "author": "afteracademia",
      "created": 1608100391,
      "upvotes": 1,
      "replies": {
        "gg0bzql": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0bzql/",
          "text": "As for myself, I LOVE my work for a charity after I left academia. I thrive on the real team work (as opposed to competing for the good results in collaborative topics), the applied work we do and the variation in my projects. I used to do reasearch on climate change (the effects of it) which I considerred pretty useful. Now I'm working for an organisation actively taking steps to mitigate and battle climate change, which feels way more useful and satisfying.\n\nThere is so much we can do with our lives (and so much joy/satisfaction to find in the work we do) outside of academia. Funnily enough when I meet up with academic mates and their academic contacts, people tend to ask me \"Do you *really* not miss it?\" as if they can't believe (or won't allow them to think) there is a great life on the outside. (The only thing I sometimes miss is friends I made during my fieldwork that are now living at the other side of the world and I don't see them at conferences. It's also nice to live near to your friends).\n\nThe other day someone used my PhD dataset (from 10 years ago) in a paper and in the emails with the authors (I did not contribute much, have not kept up with the literature) I could not hel but thinking: \"After 10 years, this is still not really solved and meanwhile the Amazon is burning and the ice sheets are melting...Although this is an interesting question, the paper topic, we need action on climate change 100 times more than another paper about my little ex-niche\")\n\nNB I am not sad about my journey at all though. If I had gone stright into my current carreer I would have always wondered what it would have been like. Now, having done the PhD, post-doc, lecturer journey (wasn't a lecturer for long) I know how that sausage is made and realy appreciate the 9-5 stability (that I frowned upon 15 years ago). I *love* not working in my Christmas break, for example, and having an employer who takes overtime and a healthy work/life balance seriously.\n\nAlso, academia in the UK is only going to get leaner after Brexit, so if you're thinking of getting out, just go for it. Make an exit strategy/Shawshank yourself out.\n\nGood luck!",
          "author": "afteracademia",
          "created": 1608101545,
          "upvotes": 1,
          "replies": {
            "gg0ci4n": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0ci4n/",
              "text": "Also, the jobs you mention might be fantasies, but the things you do like about academia can all be found elsewhere. The job might be 'an escapist fantasy', but your discontent is very real, and you're allowed to take it seriously.\n\nIf you really dislike where you are, please don't think thre is no way out, but start crafting your way out. Analyse what you want/need/have to offer and do your research about what kind of job would be a fit.\n\nTalk to people who have left, not the people that are still in. In other words: learn how to curate advice. Advice about leaving academia from people that don't want or dare to leave s way less useful than from those who left.  Your colleagues at university will not be able to tell you what's out there and how to get there.",
              "author": "afteracademia",
              "created": 1608101981,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gg0evfl": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0evfl/",
      "text": "I'm joining the family business in the new year, only finished my PhD last year but it would take 10+ years to be on the same money in academia",
      "author": "RTMicro",
      "created": 1608104075,
      "upvotes": 1,
      "replies": {}
    },
    "gg0eyl3": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0eyl3/",
      "text": "Should begin my Doctorate in 2022, (earlier canceled due to Covid). Presently at a Research Job in a top academic institute in my country. But I do dream, to have a Permaculture Farm, grow my fruits, vegetables, have cattle, lots of cats, and just be a farmer. That is really my dream! :) Thinking about it gives me pleasure.",
      "author": "cuttothechasealready",
      "created": 1608104155,
      "upvotes": 1,
      "replies": {
        "gg0q6ds": {
          "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0q6ds/",
          "text": "Tbh owning a farm is a ton of work. I’ve never have heard the phrase “and just be a farmer”",
          "author": "transport_safety",
          "created": 1608115202,
          "upvotes": 2,
          "replies": {
            "gg0qh4g": {
              "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0qh4g/",
              "text": "Haha. True, it's a lot of work. My father is a farmer, so I do get that.  I meant in terms of pleasure. Too much work is not a problem, as long as it brings joy.",
              "author": "cuttothechasealready",
              "created": 1608115521,
              "upvotes": 2,
              "replies": {
                "gg2yzm7": {
                  "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg2yzm7/",
                  "text": "Gotchu!! You know what it actually means then! haha, I see SO many people who make farming seem so casual and I’m like, “dude, that job is so much work”. People don’t get it!",
                  "author": "transport_safety",
                  "created": 1608160004,
                  "upvotes": 1,
                  "replies": {
                    "gg3i9sx": {
                      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg3i9sx/",
                      "text": "It is a lot of work. These days I enjoy watching Permaculture Videos on youtube! :)",
                      "author": "cuttothechasealready",
                      "created": 1608170397,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gg0g0ej": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0g0ej/",
      "text": "Not to be overly critical, but I feel like there is some contradiction in your post. You say you don't need constant praise or feedback, but you also say that getting kudos at your old job was a significant mental boost. Perhaps you should take some time to actually analyse what kind of environment you work best in, and also whether you can realistically find that in your field.",
      "author": "52in52Hedgehog",
      "created": 1608105110,
      "upvotes": 1,
      "replies": {}
    },
    "gg0kpuw": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0kpuw/",
      "text": "I thought about trying to get a teaching position at a community college for a while.  Then I switched fields.",
      "author": "dampew",
      "created": 1608109545,
      "upvotes": 1,
      "replies": {}
    },
    "gg0oscv": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0oscv/",
      "text": "Maybe the wrong sub to post this (is there an r/ex-academia?), but I agree with your sentiment. I'm nearly 20 years in on PhD life, and it's going well, but I plan to \"retire early\" so I can do manual and LOCAL work. One drawback of my job (environmental economics) is the depressing nature of everyday reading. \n\n(Don't even get me started on grants, research and bureaucracy!)\n\nAdvice: Start the beer or plumbing hobby. Maybe you get paid, maybe you don't, but at least you'll have a diversion from the academic scrum.",
      "author": "davidzet",
      "created": 1608113732,
      "upvotes": 1,
      "replies": {}
    },
    "gg0p7w5": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0p7w5/",
      "text": "Do you want to hear about my farm or my cafe? Can't afford to start either.",
      "author": "gcitt",
      "created": 1608114194,
      "upvotes": 1,
      "replies": {}
    },
    "gg0t6ds": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0t6ds/",
      "text": "So true! I’m in exactly the same position where I feel like the carefree, excitement and fun aspect of academia that I loved when I was a PhD student has diminished as I’ve risen up the ranks. Now I’m expected to be a serious and professional grown up- which I suppose is inevitable- but I’ve been craving the good old days of working in a bar and having zero worries about the intricacies of my job and whether I am performing well enough. I think in my case it’s just a bit of stress and after a good break at Christmas I will hopefully reset!",
      "author": "hesgotarobitbrain",
      "created": 1608118297,
      "upvotes": 1,
      "replies": {}
    },
    "gg0t92a": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0t92a/",
      "text": "Mid career PhD and 15 years of experience in sustainable development policy. I feel you. In 2020 I built an outdoor wood fired oven and got into welding and now want to buildd my own timber frame workshop. Not sure if it's midlife crisis, malaise with my job or a mix of both.  My professional work is so full of people telling about solutions it's sickening. I want to leave it all behind downshift and just get to something tangible and more real. My wife is supportive but we need income also. One day I might do the jump. Wish me luck.",
      "author": "rightnextto1",
      "created": 1608118371,
      "upvotes": 1,
      "replies": {}
    },
    "gg0usx0": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0usx0/",
      "text": "I used to be a lensmaker. I fantasize about going back all the time lol",
      "author": "sbre4896",
      "created": 1608119899,
      "upvotes": 1,
      "replies": {}
    },
    "gg0vfad": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0vfad/",
      "text": "My plan B is becoming an actuary or a consultant. Well.. that’s also my plan A, the difference being that plan A includes a PhD and an occasional part time lecture.",
      "author": "ravonrip",
      "created": 1608120493,
      "upvotes": 1,
      "replies": {}
    },
    "gg0y6y6": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg0y6y6/",
      "text": "I have friends who opened a brewery, and are quite successful regionally. \n\nThey started home brewing in the late 90s while we were in undergrad. Only myself and one other in our friend group finished, the others failed out due to Madden and other popular video games at the time, but mostly Madden 24/7. \n\nI'm an academic and frequently look at them with some twinge of jealousy, but I'm sure it's just a bit of the grass is greener...",
      "author": "DillyDang",
      "created": 1608122900,
      "upvotes": 1,
      "replies": {}
    },
    "gg1691x": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg1691x/",
      "text": "I want to be a barista or brewer. \n\nMy sibling is the functional kind of doctor who actually DID do the alternate career after 20+ years as an OR doc. He likes his new job (way less daily job-stress), but he’s had to make some big and uncomfortable adjustments to making basically minimum wage with minimal healthcare access/benefits. Given the structure of the place, I don’t know how much higher he can really move there.",
      "author": "elvenwanderer06",
      "created": 1608128392,
      "upvotes": 1,
      "replies": {}
    },
    "gg1h9dr": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg1h9dr/",
      "text": "One guy quit a tenure-track job at the leading school in my field to run his family's propane business. Dunno how he feels about it.",
      "author": "atchemey",
      "created": 1608134315,
      "upvotes": 1,
      "replies": {}
    },
    "gg7z4q8": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/gg7z4q8/",
      "text": "Yup, but a hardcore gym. Haha. I only do that when my work isn't working though!",
      "author": "PersonalZebra8993",
      "created": 1608267299,
      "upvotes": 1,
      "replies": {}
    },
    "giu2iq4": {
      "link": "/r/AskAcademia/comments/kdpulq/anyone_else_fantasise_about_starting_a_brewery_or/giu2iq4/",
      "text": "I am(was) an avid brewer. I looked and was not accepted.  Times have changed. I still have wishes.",
      "author": "bubbared1",
      "created": 1610335273,
      "upvotes": 1,
      "replies": {}
    }
  }
}