{
  "sid": "qetp60",
  "link": "/r/AskAcademia/comments/qetp60/applying_for_jobs_letters_vs_contact_information/",
  "title:": "Applying for jobs: Letters vs. \"Contact information for references\"",
  "text": "Hi all,\n\nI'm on the academic job market right now, and I'm curious what it means when a position asks for \"contact information for references.\" Does this mean the search committee will reach out to the recommenders at some *later* point for references?\n\nthanks!",
  "author": "haltheincandescent",
  "created": 1635087176,
  "updated": 1636173591,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hhv9dag": {
      "link": "/r/AskAcademia/comments/qetp60/applying_for_jobs_letters_vs_contact_information/hhv9dag/",
      "text": "Yes, and the reference request will probably not be a letter but a quick phone conversation or a form they fill out.\n\nUsually they won't be contacted until pretty late in the hiring process, typically right before the offer is made, or sometimes even after if they are moving quickly, in which case the offer would be contingent upon them not hearing anything bad during reference checks.",
      "author": "MidnightSlinks",
      "created": 1635087690,
      "upvotes": 8,
      "replies": {
        "hhvcnor": {
          "link": "/r/AskAcademia/comments/qetp60/applying_for_jobs_letters_vs_contact_information/hhvcnor/",
          "text": "Excellent, thanks! I was anxious since the deadline is soon and I just found this position, so good to know my ref's likely won't be contacted soon/pressed by a deadline.",
          "author": "haltheincandescent",
          "created": 1635089198,
          "upvotes": 1,
          "replies": {
            "hi1qyxn": {
              "link": "/r/AskAcademia/comments/qetp60/applying_for_jobs_letters_vs_contact_information/hi1qyxn/",
              "text": "Do be sure to let them know that you've listed them as a reference!  I always appreciate that when people do that, it's better than being called out of the blue!",
              "author": "ChemKnits",
              "created": 1635204166,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hi1qvm5": {
          "link": "/r/AskAcademia/comments/qetp60/applying_for_jobs_letters_vs_contact_information/hi1qvm5/",
          "text": "Agreed - this is what we do when hiring at my community college.  Check references by phone between interview and offer.",
          "author": "ChemKnits",
          "created": 1635204123,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhw0cha": {
      "link": "/r/AskAcademia/comments/qetp60/applying_for_jobs_letters_vs_contact_information/hhw0cha/",
      "text": "In my field (humanities) they will often make one round of cuts, and then they will ask semi-finalists or finalists for letters by either emailing the dossier service address on your reference sheet, emailing you to ask you to submit your letters, or reaching out to letter writers directly.\n\nI find this approach to be a bit more distressing, because it is one more aspect of the process out of the applicant's control. You don't often know if your committee is being contacted, so you can't keep up with them to make sure they respond on time or see the email. I'd rather just submit the letters in the beginning.",
      "author": "gggggggggggfff",
      "created": 1635098900,
      "upvotes": 4,
      "replies": {
        "hhztfjd": {
          "link": "/r/AskAcademia/comments/qetp60/applying_for_jobs_letters_vs_contact_information/hhztfjd/",
          "text": "The advantage for you for asking for them later is a) you can tell your advisors about the specific job you made the short-list for, and the letter can be personalized for that job, b) the letters will be better if they are not a single generic letter for all jobs, and c) a committee that wants to hire you is not going to be put off by one of your letters being late (we know how academics are — we're them!). What you really want is the best possible letter, and the best letters are never the \"To whom it may concern\" letters that get written for Interfolio with the goal of being sent to a million places. (In any event, I don't think the letters matter as much as people think they do, anymore. This is no longer the world of kingmakers.)",
          "author": "restricteddata",
          "created": 1635175342,
          "upvotes": 1,
          "replies": {
            "hi1r415": {
              "link": "/r/AskAcademia/comments/qetp60/applying_for_jobs_letters_vs_contact_information/hi1r415/",
              "text": "Yes, these are all good points.",
              "author": "gggggggggggfff",
              "created": 1635204229,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhw297m": {
      "link": "/r/AskAcademia/comments/qetp60/applying_for_jobs_letters_vs_contact_information/hhw297m/",
      "text": "Sometimes it’s no different. Often, they’ll ask for contact information and an automated system will send a request for the letter. So if you use Interfolio or something, put those email addresses into the appropriate field.",
      "author": "EconGuy82",
      "created": 1635099652,
      "upvotes": 2,
      "replies": {}
    },
    "hhx827j": {
      "link": "/r/AskAcademia/comments/qetp60/applying_for_jobs_letters_vs_contact_information/hhx827j/",
      "text": "In engineering, we wouldn’t even look at the application without 3 letters. No one is contacting anyone on the search committee side unless it is to clarify something. You should contact the search committee or the department chair to clarify.",
      "author": "Alex_55555",
      "created": 1635117474,
      "upvotes": 0,
      "replies": {
        "hhzslay": {
          "link": "/r/AskAcademia/comments/qetp60/applying_for_jobs_letters_vs_contact_information/hhzslay/",
          "text": "I'm sure that is your experience. But this is far from universal.\n\nHere we don't accept references submitted by the applicant - only those submitted direct to us by referees on request. And we generally only request references when we are doing the final sift before inviting for interview.",
          "author": "OrbitalPete",
          "created": 1635174981,
          "upvotes": 2,
          "replies": {
            "hi00ce1": {
              "link": "/r/AskAcademia/comments/qetp60/applying_for_jobs_letters_vs_contact_information/hi00ce1/",
              "text": "True. We don’t accept letters from the applicants. The system is setup to ask the applicants for referees contact information and then it automatically solicits them for letters - very standard in US academics. The applications without the letters are flagged incomplete. Letters, past productivity and research statement are probably the most important pieces of the package. So in our case it’s difficult to rate the applicants without any rec letters. Typical junior search will have hundreds of applicants, so a robust rating rubric is important. This is different for senior or special opportunity hires - in these cases letters are usually requested much later",
              "author": "Alex_55555",
              "created": 1635178195,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}