{
  "sid": "rgk4nt",
  "link": "/r/AskAcademia/comments/rgk4nt/need_advice_should_i_withdraw_my_chapter/",
  "title:": "Need advice: Should I withdraw my chapter?",
  "text": "TL;DR: Submitted a chapter to an edited book, and am becoming skeptical about it getting published, so wondering if I should withdraw the chapter.\n\nSo I submitted an abstract to a book collection, following a CFP. This was in April of 2020. I then sent the full chapter in February this year, got confirmation it had been submitted, and then heard nothing. I asked for an update in October, and just got back that there was nothing currently required and to bare with them.\n\nI don't want to sound like an arse here: COVID absolutely has thrown things out of whack for a lot of people. Additionally, the editor of the collection is active on social media and is very much a legitimate academic, so I am not at all implying this is some sort of weird grift.\n\nI'm just concerned because, well, I'm pretty proud of the work I did in the chapter! It was based on a paragraph in my thesis which I am now turning into a monograph, so I'd like to have the work \"out there\" before the book so I can create some sort of continuity in my work. Additionally, I'm in a bit of a funny position at work where if I don't publish three Q1 articles by mid next year, my contract will be terminated. So I'm looking at this chapter, and thinking it might be better off as an article sent to a journal before the year is out so I can try and get some feedback/get it published.\n\nBut with that said, I don't want to leave this editor high and dry. I'm not really sure what the etiquette is around this kind of thing?",
  "author": "EatingBeansAgain",
  "created": 1639523753,
  "updated": 1639787275,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "holgiyo": {
      "link": "/r/AskAcademia/comments/rgk4nt/need_advice_should_i_withdraw_my_chapter/holgiyo/",
      "text": "If you have signed a contract or a form assigning the copyright of your text then I think you might find it harder to withdraw it . If not,  it''s difficult  to see  what the editor or publisher can do if you withdraw it - especially if they gave you an estimated publication date which has passed. Will it matter as far as your career is concerned if you annoy this particular editor? \n\nIn reality the editor is almost certainly waiting for other chapters to be delivered - and there's not a huge amount that can be done to speed that up. They are probably as keen as you are to see it published!",
      "author": "pixiepasty",
      "created": 1639536363,
      "upvotes": 3,
      "replies": {
        "hologqq": {
          "link": "/r/AskAcademia/comments/rgk4nt/need_advice_should_i_withdraw_my_chapter/hologqq/",
          "text": "Nah, I didn't sign anything.\n\nYeah, that's the thing! I get the impression that COVID caused huge disruptions, and really, the editor probably can't talk much about it. Part of me does want to just leave it be, and it'll be a nice surprise sometime next year (or the year after!) when it is released.\n\nThanks for the advice!",
          "author": "EatingBeansAgain",
          "created": 1639540051,
          "upvotes": 1,
          "replies": {
            "homds0c": {
              "link": "/r/AskAcademia/comments/rgk4nt/need_advice_should_i_withdraw_my_chapter/homds0c/",
              "text": "Yikes not signing a contract is a huge red flag. Did you give them any money? \n\nThe editor absolutely can talk about it and should be talking about it. \n\nI'm worried you've handed over a load of text without even confirming you retain the IP while you're trying to also develop a monograph presumably to publish elsewhere?",
              "author": "ACatGod",
              "created": 1639555677,
              "upvotes": 1,
              "replies": {
                "hoq9erl": {
                  "link": "/r/AskAcademia/comments/rgk4nt/need_advice_should_i_withdraw_my_chapter/hoq9erl/",
                  "text": "Nope, no money has exchanged hands!\n\nAs for the monograph, I think I overstated the similarities. I used a paragraph from my thesis as the jumping off point to develop this chapter, while my monograph itself is a different beast based on the thesis. I only mention it because it would be cool to try and get a bit of buzz with the chapter, so people get interested in my work and are more likely to check out the book. There is nothing shared between the two text wise.",
                  "author": "EatingBeansAgain",
                  "created": 1639621836,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hom0ppj": {
      "link": "/r/AskAcademia/comments/rgk4nt/need_advice_should_i_withdraw_my_chapter/hom0ppj/",
      "text": "Just to be clear-- are you waiting for it to be reviewed? Are you waiting to get back edits? Or are you just waiting for the actual book to come out?\n\nIf the former-- you can definitely withdraw it, IMO.\n\nIf the middle-- I would reach out to the editor and ask for information about timelines, but I think it would be *okay* to withdraw if you haven't signed anything and don't need to make this editor happy for any reason.\n\nIf the latter (it has definitely been accepted and you're just waiting for the actual book to come out)-- I think you should just suck it up, TBH. This is within the typical timeline for book chapters in my field, unfortunately. Books are sooooo sloooooow; things are outdated by the time they hit the shelves (we just had a chapter get published and looking at the things listed as \"in press\" in our references is funny, haha. So long ago!). At that point, I would take that as a cautionary tale about the disadvantages of book chapters.",
      "author": "intangiblemango",
      "created": 1639546643,
      "upvotes": 3,
      "replies": {
        "hoq9lrv": {
          "link": "/r/AskAcademia/comments/rgk4nt/need_advice_should_i_withdraw_my_chapter/hoq9lrv/",
          "text": "Thanks for the help! I haven’t heard anything about reviews, when it might get published (the original dates are long gone, but they were pre-COVID), or anything of that nature. As far as I know the file hasn’t even been opened.",
          "author": "EatingBeansAgain",
          "created": 1639621924,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "honekjs": {
      "link": "/r/AskAcademia/comments/rgk4nt/need_advice_should_i_withdraw_my_chapter/honekjs/",
      "text": "I've edited a few things and sometimes they can take an age to come together. The longest I've heard between someone submitting and it still not being published was 20 years...and still counting.\nIf I received an email from an ECR saying they are eager to get stuff out for job applications and if it was OK to pull it, I'd be a little frustrated but would understand. It's been quite a while as well, so I would certainly understand. Things seem to be taking longer to get through though, I have an edited collection with a decent publisher for a while now. I suspect it will speed up now since terms are ending and reviewers will have more time. \nJust be honest and explain the situation, if they're half way decent they should understand. If they don't understand, you probably don't want to be working together anyway.",
      "author": "Fardays",
      "created": 1639579955,
      "upvotes": 2,
      "replies": {
        "hoq9ms0": {
          "link": "/r/AskAcademia/comments/rgk4nt/need_advice_should_i_withdraw_my_chapter/hoq9ms0/",
          "text": "This is good advice. Thanks!",
          "author": "EatingBeansAgain",
          "created": 1639621936,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}