{
  "sid": "9i1gs7",
  "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/",
  "title:": "[PhD dropout] I'm much happier after leaving my program, but feel sad that I won't be a professor.",
  "text": "I entered a PhD program immediately out of undergrad and dropped out after a year because I found myself unable to adjust to the lifestyle of academia. I found it difficult to complete my work in an unstructured environment and felt fairly isolated with so few people to talk to. Ultimately, I never overcame these personal challenges and felt super depressed, and so made the decision to drop out and accept a new job at a great company. I have since been doing really well at work. I went from being a very mediocre student to a superstar at the office. Still, I feel called to be a professor, as dumb as that sounds. The fact that you get paid to do research that you find interesting and discover truths about the world is literally the coolest thing I could imagine. I've considered going to therapy to address the issues that prevented me from being a successful PhD student and maybe reapplying for a program some years down the line. But I also feel like I should maybe just accept that the academic lifestyle will never be a fit for me and fulfill my calling in other ways. Has anyone had a similar experience?",
  "author": "timesthataregood",
  "created": 1537637620,
  "updated": 1634081472,
  "over_18": false,
  "upvotes": 121,
  "upvote_ratio": 0.97,
  "comments": {
    "e6g353t": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6g353t/",
      "text": "You had a set of expectations about how your life would go, and it's not shaping up how you thought. It's natural to be sad about this. Look ahead, consider your other options and see how you can move forward. You might find that you really enjoy what you end up doing. Or maybe not, and that's also ok! Coming back to school after some time away can be really beneficial, and it is not uncommon for grad students.\n\nAnd no matter what happens, or which way things go, professional therapy is a good idea. They can help a lot as you navigate this part of your life.",
      "author": "ProbabilisticWorld",
      "created": 1537638587,
      "upvotes": 79,
      "replies": {
        "e6ge9p0": {
          "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6ge9p0/",
          "text": "Noticed that you're community college physics professor from the tag. How is it like teaching and building career in this environment?",
          "author": "LPYoshikawa",
          "created": 1537649648,
          "upvotes": 8,
          "replies": {
            "e6igvnj": {
              "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6igvnj/",
              "text": "It's pretty much exactly what I want to be doing. I don't really like doing research, but I do really like teaching. I have tenure. I like the students, and I like that I get students from a wide range of backgrounds. I like being part of a system that allows people to get an education who would probably not be able to otherwise.\n\nOf course it's not all sunshine and rainbows, but no job is. ",
              "author": "ProbabilisticWorld",
              "created": 1537737348,
              "upvotes": 7,
              "replies": {
                "e6xv1q0": {
                  "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6xv1q0/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1538352685,
                  "upvotes": 2,
                  "replies": {
                    "e700n5t": {
                      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e700n5t/",
                      "text": "Job satisfaction *and* job security? Yeah, it would take a lot to get me to leave.\n\nThanks for the kind words about CCs!",
                      "author": "ProbabilisticWorld",
                      "created": 1538439068,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e6g60yo": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6g60yo/",
      "text": "I started a PhD program one year out of undergrad, got really anxious and isolated, and mastered out after three years. Many years later, I am working in a field I love with lots of other ABDs. Something has been nagging at me, some big questions I don’t have the time or resources or skills to answer while working full time so...back to school I go! I’ll be starting a PhD in a different (but allied) field at a different university next fall.\n\nYes, you can leave academia and come back. And yes, therapy helps a lot. I started talk therapy in grad school, then got really into meditation. My sitting practice helps me identify those automatic negative thoughts and habits that held me captive during grad school #1. I feel much more resourced and capable of handling stress now that I’ve been out in the world a bit. I hope that whole journey will be an asset during my next phase, and I’m sure it would be for you, too.",
      "author": "mettazoe",
      "created": 1537641400,
      "upvotes": 30,
      "replies": {
        "e6ii4eh": {
          "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6ii4eh/",
          "text": "Sorry, what's an ABD?",
          "author": "tommeetucker",
          "created": 1537738460,
          "upvotes": 2,
          "replies": {
            "e6ii6fh": {
              "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6ii6fh/",
              "text": "“All but dissertation”",
              "author": "mettazoe",
              "created": 1537738510,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "e6q0umj": {
          "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6q0umj/",
          "text": "What field?",
          "author": "Tlaughs",
          "created": 1538037060,
          "upvotes": 2,
          "replies": {
            "e6qtbi0": {
              "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6qtbi0/",
              "text": "History —>  Education",
              "author": "mettazoe",
              "created": 1538069132,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "e6gavem": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6gavem/",
      "text": "lots of great answers already\n\nmy perspective: it's just a job. A job I like, but I'd be happy doing a bunch of other things. When you're there you realize the prof status does not mean much in the great scheme of things.",
      "author": "joe_leaphorn",
      "created": 1537646230,
      "upvotes": 15,
      "replies": {}
    },
    "e6g9bc7": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6g9bc7/",
      "text": "I'm leaving my PhD too. Did you have a job lined up before you left? If not, how long did it take to find one? ",
      "author": "iammaxhailme",
      "created": 1537644672,
      "upvotes": 9,
      "replies": {
        "e6go88d": {
          "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6go88d/",
          "text": "Not OP, but I quit my PhD programme in classics without a job lined up. I was unemployed 1st of February 2017, three months later I started working in a government department.",
          "author": "NuclearWarhead",
          "created": 1537659927,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "e6g9ycr": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6g9ycr/",
      "text": "Probably headed that direction myself, only I didn't realize it (and still haven't) until year 8 of this \"4-year\" program. \n\n",
      "author": "tunelesspaper",
      "created": 1537645312,
      "upvotes": 8,
      "replies": {}
    },
    "e6gbqf3": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6gbqf3/",
      "text": "Hey there, your post found me just at the right time. I'm about to tell my PI that I'm leaving with a Masters due to poor results and serious personal issues. I feel much the same as you, sad about potentially hindering my career as I would like to teach, and regretting that the unique opportunity of a PhD has been wasted on me... And in another life maybe I'd nail it... But therapy helped me see that leaving is overall the right decision and a Masters is an amazing achievement that I'm proud of. You can still do a PhD one day.",
      "author": "eabayp",
      "created": 1537647081,
      "upvotes": 9,
      "replies": {}
    },
    "e6ggdyi": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6ggdyi/",
      "text": "I think this sentiment has already been covered in a couple other comments, but it's probably worth saying that there's nothing wrong with taking time to regroup outside of academia and then re-evaluating your career goals in a couple years. Many academics that I've talked to said they really valued taking the time to work before going into a PhD program. And those that hadn't said they wished they had. \n\nWorking before graduate school really allowed me to see what life was like, but I found that I really missed the academic environment after a couple years. Additionally, the type of career I was setting myself up for just wouldn't have been fulfilling or challenging a few years out. You might find that you feel the same after taking time for yourself. Making money is nice, but it can't replace the feeling of finishing challenging problems or learning something new. Entering a graduate program in your mid/late 20s isn't bad.\n\nAnd if you get down the road, and decide not to re-enter? Try to make sure your career allows for a lot of mental and personal growth, and find ways to be challenged in whatever you do.",
      "author": "secret_economist",
      "created": 1537651806,
      "upvotes": 7,
      "replies": {}
    },
    "e6h5ggi": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6h5ggi/",
      "text": "Lots of others have given some great advice and perspective but I do want to add one thing. \n\nIf the structure is an issue for you then you should know that being a professor is at least the same if not worse. No one is checking on you, you are evaluated on pretty much results only. ",
      "author": "leestitzel",
      "created": 1537680205,
      "upvotes": 5,
      "replies": {
        "e6hfwoq": {
          "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6hfwoq/",
          "text": ">I found it difficult to complete my work in an unstructured environment and felt fairly isolated with so few people to talk to. \n\nI think if this is a problem then academia isn't the right place for OP. Sure the idea of being an astronaut is cool but do you really want to get in one of those spinning high g force machines?\n\nI personally love to work in a team and hate to be alone, this is important to know.",
          "author": "parkway_parkway",
          "created": 1537701991,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "e6gd97t": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6gd97t/",
      "text": "My PhD program did not accept students straight out of undergrad. The two times they did -- for students they felt were totally exceptional, superstars in the making -- one student dropped out after a couple of years, the other took 10 years to finish. This was notable in a program that otherwise had a very high completion rate, with almost all candidates finishing in 5-7 years.  \n\nIt's really really difficult to transition from undergrad life to the kind of academic culture that exists in most PhD programs. Maturity and the ability to work independently  are as important as intellectual prowess for doing doctoral-level work. If you're still interested in becoming a professor (and you also have a realistic view of how dire the academic job market is), you might do well to apply again in a couple of years and in the meantime work in a research capacity or other jobs related to your interests. \n\nEdit to add: I started my PhD in my 30s and had several colleagues in the program who were in their 30s and 40s. It's never too late. ",
      "author": "baubino",
      "created": 1537648625,
      "upvotes": 16,
      "replies": {
        "e6gl27i": {
          "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6gl27i/",
          "text": "What field is this? In my area nearly everyone comes from undergrad and there is a very low dropout rate, with median completion around your 5-7 mark if not lower on average.\n\nHowever, a similar field to mine takes almost no undergrads and I had no idea when applying to those programs. A complete waste of money that could have been avoided, but I digress.",
          "author": "0102030405",
          "created": 1537656609,
          "upvotes": 10,
          "replies": {
            "e6i4mef": {
              "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6i4mef/",
              "text": "You're right; it's certainly field dependent. I don't mean to generalize across fields, only to share my experience and emphasize that the transition from undergrad can be brutal.",
              "author": "baubino",
              "created": 1537727647,
              "upvotes": 4,
              "replies": {
                "e6iaqdb": {
                  "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6iaqdb/",
                  "text": "Sorry for coming off as harsh. I completely agree it's nothing like undergrad, and most people are ill-prepared, especially if they didn't put do things like research, TAing, and spending lots of time with professors directly on projects or in small classes during undergrad. The transition can be really difficult, and the guilt during and sometimes even after grad school (especially if it didn't go as one expected) can hijack you, as it seems to have done for OP.\n\nI completely agree OP can start again if desired, but they should also make sure that they look realistically at the success rate and what's required to get there, which is again very field dependent.",
                  "author": "0102030405",
                  "created": 1537732356,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e6h52c8": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6h52c8/",
      "text": "I work with a few military vets that did undergrad first, then 20 years of military service, THEN grad school, and have become professors in their late 40's-early 50's.\n\nThere isn't one path that is always followed.",
      "author": null,
      "created": 1537679601,
      "upvotes": 5,
      "replies": {}
    },
    "e6giq9y": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6giq9y/",
      "text": "I strongly suggest therapy! I went to therapy all throughout my PhD and after. It was extremely helpful. ",
      "author": "FancyScientist",
      "created": 1537654195,
      "upvotes": 5,
      "replies": {}
    },
    "e6hdknr": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6hdknr/",
      "text": ">to do research that you find interesting and discover truths about the world is literally the coolest thing I could imagine.\n\nand that's where the problems begin, because that view is bit rose-tinted to begin with. ",
      "author": "ordash",
      "created": 1537696880,
      "upvotes": 4,
      "replies": {}
    },
    "e6h03f0": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6h03f0/",
      "text": "One of my best friends recently decided not to complete her PhD and she was almost done. The job at the end wasn’t what she wanted to do and she’s much happier now. She does still wonder “what-if”, which I think is normal. We think like that about lots of decisions in our lives. Maybe just focus on how happy you are doing what you do now, and let that drive you instead of an old goal? It takes courage to know when to walk away from something that isn’t making you happy. ",
      "author": "Ebonnie_L",
      "created": 1537672929,
      "upvotes": 3,
      "replies": {}
    },
    "e6g3qs1": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6g3qs1/",
      "text": "There's nothing stopping you from becoming a professor.\n\nYou can gain industry experience and evaluate a few years later if you still want to be a professor.\n\nMost people do their PhDs in their middle ages, you started very early.\n\nAcademia, unlike other careers, isn't a career where you have to put in a set amount of work to become a full professor. Quality matters over time spent.\n\nI've met professors who spent their entire life in academia as well as professors who started a PhD at 35.\n\nContinue your work in industry, make bank, think a few years later if you still want to do it.",
      "author": "anotherbozo",
      "created": 1537639173,
      "upvotes": 20,
      "replies": {
        "e6g84xi": {
          "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6g84xi/",
          "text": "> There's nothing stopping you from becoming a professor.\n\nThis is strongly dependent on the field. For plenty of traditional sciences (say, math or non-drug-related biology), unless you are somehow able to publish tons more than your postdoc counterparts, you have very little chance. In many applied sciences there are non-tenured Professor of Practice appointments for people with industry experience, but as mentioned, they won't come with tenure and thus will typically be less desirable than regular professorial appointments.",
          "author": "newpua_bie",
          "created": 1537643488,
          "upvotes": 29,
          "replies": {
            "e6gbjwc": {
              "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6gbjwc/",
              "text": "If OP can get into another PhD program, the clock will restart. Research output is generally judged against how long you've had your PhD, not your biological age. ",
              "author": null,
              "created": 1537646896,
              "upvotes": 17,
              "replies": {}
            },
            "e6g93fj": {
              "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6g93fj/",
              "text": "Fair enough. My experience has only been in social sciences. Should have clarified that.",
              "author": "anotherbozo",
              "created": 1537644448,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "e6gbr4z": {
          "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6gbr4z/",
          "text": "I'm not sure this is the most helpful of comments. When someone says, \"I found being in academia really unpleasant, but I do sometimes wish I was a professor,\" a response of, \"keep that dream alive, buddy!\" may not be the right one. In most fields it is NOT easy to become a professor under _any_ conditions (which is to say, there's a _lot_ stopping one from becoming a professor — it's a long road to becoming one even under ideal conditions), and it is not especially common for people to become professors later in life. Starting a PhD at 35 is a recipe for financial ruin. \n\n(Let's imagine you finish in a brisk 5 years... now you're 40, and on the TT job market. Let's imagine you somehow nail it and get a TT job on your first year of interviews. Now you're not going up for tenure until you're 46 or 47. Do you really want to be getting true financial stability for the first time when you're pushing 50? It's a crazy thing to do — even crazier when you consider how unlikely it is that all of the above would happen on such a smooth timetable, and even more unlikely when you consider how alive and well ageism is in the academy. Again, some people have tried it. But that doesn't make it a good idea. There are reasons to potentially pursue a PhD in mid-life, but the dream of becoming a TT professor is pretty unlikely at that point — and frankly at any point — and shouldn't be the motivating one.)\n\nI think a better approach, personally, is figuring out how to achieve what one wants given the limitations that life or one's self may present. If the desire to be a professor is based on some idea of status — one should realize that a professor is just one kind of job, and status is always relative. If the desire is based on a desire to do research — there are ways one can harness that interest outside of the structures of the academy. If the desire is to teach — many opportunities there. There are ways, in other words, to get much of the \"job\" of the professor out of other careers, as long as one is not hung up on the title alone.",
          "author": "restricteddata",
          "created": 1537647101,
          "upvotes": 21,
          "replies": {
            "e6gdoqe": {
              "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6gdoqe/",
              "text": "Financial stability happens when you get a job, not when you get tenure. The vast majority of industries do not have the benefit of tenured employment so OP's financial stability now, in an industry job, would be analogous to financial stability in a tenure-track (but not yet tenured) job. ",
              "author": "baubino",
              "created": 1537649057,
              "upvotes": 11,
              "replies": {
                "e6gdvul": {
                  "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6gdvul/",
                  "text": "Pre-tenure employment is both underpaid and lacks guarantees about future employment, so I don't consider it really all _that_ stable. It's certainly better than being a grad student or a postdoc, to be sure. Your future in academia is still essentially provisional. \n\nThe difference between a pre-tenure job and an industry job is that there are usually more than 1-2 industry jobs in any given geographical location.",
                  "author": "restricteddata",
                  "created": 1537649257,
                  "upvotes": 9,
                  "replies": {
                    "e6gf7xh": {
                      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6gf7xh/",
                      "text": "Industry jobs also lack guarantee of future employment. The vast majority of employment is provisional. That's exactly my point. \n\nYes, OP will likely have more industry options in a given geographic area. But OP need not expect that financial stability won't come until tenure. Financial stability comes with a full-time job that pays a living wage or better. Tenure-track jobs pay a living wage, as do many industry jobs. Tenure-track jobs also typically come with a minimum contract (3 or 4 years) until the tenure review. Most industry jobs don't have minimum employment contracts. ",
                      "author": "baubino",
                      "created": 1537650607,
                      "upvotes": 5,
                      "replies": {
                        "e6hozws": {
                          "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6hozws/",
                          "text": "Well, I don't know where you work, but nobody I know who is pre-tenure is what I'd call financially secure unless they've got a spouse who makes a lot more than they do. The starting pay for TT faculty — even at good institutions — is generally not great, esp. compared to comparable levels of experience at an industry job. It's a big pay cut, to say nothing of the opportunity costs accrued during grad school (which are going to be huge in the case of something leaving an industry career in their 30s).\n\n(And we have, for the sake of argument, left out the average 3-5 years of postdocs, plus the prospect of adjuncting, plus the likelihood that there isn't a TT job for someone that age at that rank anyway.)",
                          "author": "restricteddata",
                          "created": 1537714080,
                          "upvotes": 3,
                          "replies": {
                            "e6i400j": {
                              "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6i400j/",
                              "text": "Well, we'll have to agree to disagree then. I've followed what you propose to be the worst case scenario (10+ years in industry, PhD in my 30s, TT in my 40s, etc) and it's been neither a career-killer nor a life a destitution. Far from it actually. And my outcome isn't much different than many of my colleagues (though certainly some failed to get jobs at all). Much of this might be field-dependent, of course. Otherwise, I'm just letting the OP know that there are options, some better than others, and that they should explore the possibilities. ",
                              "author": "baubino",
                              "created": 1537727173,
                              "upvotes": 2,
                              "replies": {
                                "e6iqgiz": {
                                  "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6iqgiz/",
                                  "text": "While I applaud you on your accomplishments, from what I have read and seen, they are not typical results.",
                                  "author": "restricteddata",
                                  "created": 1537746212,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e6gcvj9": {
          "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6gcvj9/",
          "text": ">Continue your work in industry, make bank, think a few years later if you still want to do it.\n\nNot only that, being a grad student seems a lot comfier if you have real savings going in.",
          "author": "DMTMH",
          "created": 1537648233,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "e6gcnz0": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6gcnz0/",
      "text": "Could you teach at a local teaching or community college? They often hire people with master’s degrees. Even adjuncting might scratch your professorial itch.",
      "author": "ploomyoctopus",
      "created": 1537648018,
      "upvotes": 4,
      "replies": {
        "e6h049p": {
          "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e6h049p/",
          "text": "My friend does that actually. Quit her PhD but teaches now. ",
          "author": "Ebonnie_L",
          "created": 1537672960,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e8e8n1w": {
      "link": "/r/AskAcademia/comments/9i1gs7/phd_dropout_im_much_happier_after_leaving_my/e8e8n1w/",
      "text": "Perhaps you are one of those people who thrive in a more structured work environment like deadlines and having external accountability would help? Have you heard of the four tendencies by Gretchen Rubin? She divides people into four groups depending on how they react to internal and external expectations. Some people do well without external expectations (which can take the forms of coworkers, deadlines) while others don't. I suspect that maybe having deadlines and coworkers will make you more productive. If that's the case, all you need to do is to create external accountability for yourself and you can achieve what you want to. Perhaps give this a try and maybe you just need to have a different working style than others in the program. \n\n[https://quiz.gretchenrubin.com/](https://quiz.gretchenrubin.com/)\n\n&#x200B;",
      "author": "cddc1234",
      "created": 1540424974,
      "upvotes": 1,
      "replies": {}
    }
  }
}