{
  "sid": "re93ea",
  "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/",
  "title:": "My real passion is history, but I’ve been deterred from pursuing graduate education because of how terrible I hear the job market is in the US. Is it as bad as they say? And if I’m willing to move abroad, are there other places with better opportunities?",
  "text": "I already have my BA in history. But I graduated three years ago and I have a job in a completely unrelated field, (healthcare administration, and I’m still shocked how I managed to spin a history degree to get my foot into the door for this industry) where I make well the above average income, and far above average for my age, comparable if not a little more than the average for tenured professors in the US. This field seems to have far more upward mobility for higher administrative roles. But I make enough now, so I don’t really need the higher pay if it means I’m in a field I don’t care for.\n\nI have a family of four, so while a pay cut from what I make now isn’t ideal, I’d be willing to take one to pursue my passion as long as I could still provide for my family. \n\nMy wife is currently a stay at home mom. She’s not opposed to working, but I’d like if I could still have the income for a comfortable living working alone if possible just as a safety net. We’re comfortable enough that without her working, I don’t really need to even look at my paycheck or check my bank account. I just know I have enough time to cover the bills anyway and for whatever smaller personal spending I want. I like this peace of mind a lot, but if this isn’t possible with history, I’d be willing to change that as long as it isn’t too drastic.\n\nI currently work 50-60 hours per week, salaried so no overtime, and while this is doable, I definitely wouldn’t want to work anywhere with more hours. I don’t want my work life balance to suffer because I love my kids and want to be with them as much as possible.\n\nFor unrelated reasons, we are already interested in moving abroad anyway, because we feel like our kids might have better options somewhere in the EU. Portugal, Germany, Austria, Ireland, and Sweden are already places we’ve been interested in. So the need to move abroad for better odds in the field doesn’t bother me much.",
  "author": "MolotovCollective",
  "created": 1639257533,
  "updated": 1639515512,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.38,
  "comments": {
    "ho63nfn": {
      "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho63nfn/",
      "text": "The job market really is as bad as they say it is. The other thing to keep in mind, especially given that you have a large family with a non-working spouse, is that moving from a PhD program straight into a stable, long-term job is basically unheard of nowadays unless you're coming from one of the absolute tippy top programs in your field. What most people end up doing is spending years (upwards of a decade in some unfortunate cases) bouncing between postdocs, visiting professorships, adjunct gigs, and so on, none of which pay well or are all that predictable or reliable. Realistically, until you get a tenure track job or at least a full-time lecturer position, it's very unlikely you'd be able to support a family of four on the money you'd make. Grad school and pre-tenure academic careers also aren't exactly known for their good work/life balance, which is another thing to keep in mind.\n\nThe academic job market is also, for most people, a global market. It's not uncommon at all for US PhD graduates to apply overseas and vice versa. So you're chances don't increase that much if you're willing to apply outside of the US, because most of your peers are likely doing the same.",
      "author": "BandiriaTraveler",
      "created": 1639258618,
      "upvotes": 16,
      "replies": {
        "ho64fcm": {
          "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho64fcm/",
          "text": "That’s unfortunate to hear. Honestly at this point I’ve been even considering the idea of getting my PhD online during my off time, and then just starting a YouTube channel or something. Plenty of amateur historians with no degree at all make a living on YouTube, so hopefully I could provide something a little better. Plus, the period and topic I’m interested in has basically no one covering it so I feel like I wouldn’t be competing against anyone.\n\nJackson Crawford went from professor to professional YouTuber so why couldn’t I make it work? Plus I could do that on a side while keeping my current job until it kicks off, or I could just end it if it doesn’t.\n\nMy job provides education stipends if we want to continue our education, so I could basically get my PhD for free anyway.",
          "author": "MolotovCollective",
          "created": 1639258964,
          "upvotes": 2,
          "replies": {
            "ho7pq1z": {
              "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho7pq1z/",
              "text": "If you find a university that has an online PhD program in History (that isn't a shady for-profit \"college\"), let me know. I want to pursue a doctorate in History also, but I'm not willing to give up my current career (and paycheck) for it.",
              "author": "LeelooDallasMltiPass",
              "created": 1639286784,
              "upvotes": 2,
              "replies": {
                "ho7w9ng": {
                  "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho7w9ng/",
                  "text": "The decent ones I’ve found are either only master’s rather than PhDs in the US, and the ones that are PhDs seem to be in the UK. I have reached out to some though, and many of them do accept American students, so those are actually a possibility. University of Edinburgh has one program, only a master’s, but you don’t even need to take classes. You just have like two years to one kickass thesis and if they like it you get a master’s, and the school is pretty highly rated. I’ve been considering that one and then moving on to complete one of the other PhD programs.",
                  "author": "MolotovCollective",
                  "created": 1639290809,
                  "upvotes": 1,
                  "replies": {
                    "ho8kn1g": {
                      "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho8kn1g/",
                      "text": "Just as a note - it would be quite easy to do an ‘in person’ PhD as a remote student anywhere the system is a 3-4 year thesis only (UK, Aus, NZ, Europe - though I know less about the particulars there) and I know several people who live well away from their university (including in different countries). You would probably work this out with the supervisor in the first instance. \n\nHaving said that, for UK PhDs at least, you would probably need to have a (good) master’s degree as a prerequisite.",
                      "author": "Neon-Anonymous",
                      "created": 1639310625,
                      "upvotes": 2,
                      "replies": {
                        "ho8u3e3": {
                          "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho8u3e3/",
                          "text": "Good to know. Thanks!",
                          "author": "MolotovCollective",
                          "created": 1639316692,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "ho7qztw": {
              "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho7qztw/",
              "text": "> Plus, the period and topic I’m interested in has basically no one covering it so I feel like I wouldn’t be competing against anyone.\n\nWhat is it if you don't mind me asking?",
              "author": "wetcogbag",
              "created": 1639287545,
              "upvotes": 2,
              "replies": {
                "ho7umir": {
                  "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho7umir/",
                  "text": "I’m interested in the French Revolution and the landscape that brought it about in the first place. Enlightenment philosophy praising the natural rights of humanity and the scientific method. The early Romantic movement, social relations of the lower classes and how they bargained with the lords and wealthy merchants, the start of the industrial revolution and the upheaval of the urban working class, rising literacy, the widespread use age of the press, news, and “cafe culture.” \n\nAdditionally I’d want to cover the less pretty side that Revolution would later lead to, those being the French Revolutionary and Napoleonic Wars. Other important topics I’d need to cover are the earlier Seven Years War and the development of more advanced military tactics, like the gradual decline of linear tactics, the rise of individuality in the military, mass conscription, professional military schools, modern staff and organizational structures, etc. Rather than going broad on one subset of society over a long period, I just really want to go deep on all the aspects of what it would be like to live through such a turbulent time.\n\nThere are some channels that almost get there, either going deep into topics that come close, or channels that are broad enough to kind of encompass my topic but unsatisfactorily. Those that tend to go as in depth as what I plan to don’t really exist for my topic, and those are the ones that are most successful for other periods from what I’ve seen and watch. \n\nTownsends does a great job of culinary history of roughly the same time, but slightly earlier around the time of the American Revolution, and he’s focused exclusively on America. He covers to some extent homestead living, but it’s absent of what society was actually like, and doesn’t cover at all what other nations may have been like. He’s by far the most popular, but since he’s interested in roughly contemporary America compared to the European history I’m interested in, I think we’d supplement each other far more than compete with each other.\n\nThere’s a channel called Napoleonic Wargaming that talks about how to play a tabletop game based on the period, so it kind of covers military history. But as a result of it being based on a game, it’s not always true to history, and it’s very focused on the “tactical” rather than the larger strategic overview, or the lived experience of being a soldier. Again being based on a game he has his niche in that game, where I’m more interested in the actual history. From the comments, it seems that those who go to him for actual history rather than the game do so because there just isn’t anyone else for the real history, which is where I’d step in.\n\nThere’s one last one I know of from a reenactor named Brandon F. He does a good job, but he tries to cover everything from the American Revolution to at times as far as the Second World War, so he’s not able to really go deep enough for my tastes. He goes so broad that even reading just a little bit on any specific period makes his more overview-like videos no longer that educational. As a reenactor he’s understandably focused almost only on military life and again not really on how the society that supports such a military functions, or the rapidly evolving industry that supplies it. He also has a tendency to rant about topics and go off script which leads to incorrect information or just ranting about a topic he doesn’t know about at all which to me is unprofessional, but even more in my opinion it hurts his credibility to teach me something new. If I can pick out errors in the things I know about, I have a hard time trusting him in topics I don’t. I had to stop watching him when I’m a recent video he speculated for 45 minutes about a subject, never used sources, and then came to the wrong conclusion, when any decent historian would look for primary sources, and sure enough there is a very well known primary source that discusses that exact question that he ignored, and I’m assuming he didn’t even know existed. He would be my only “competition,” and while I feel bad just saying it, to me he’s just not putting out good history which makes me want to do it more to fill that gap with proper research.\n\nAnd even still, all three of these completely miss the majority of what I’d want to discuss, those being social relations, philosophy, the romantic movement, industry, etc.",
                  "author": "MolotovCollective",
                  "created": 1639289707,
                  "upvotes": 1,
                  "replies": {
                    "ho8xt3m": {
                      "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho8xt3m/",
                      "text": "I don’t understand why you need a PhD to start a YouTube channel. And if I were counting on supporting a family of four, I’d make certain I had a good handle on how that revenue model works and how realistic it is to build a sizable following.",
                      "author": "Ronnie_Pudding",
                      "created": 1639318628,
                      "upvotes": 1,
                      "replies": {
                        "hoa5bdd": {
                          "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hoa5bdd/",
                          "text": "I want a PhD mostly for two reasons. First, I want to really develop the proper research skills and methods to treat the sources well. And second, it’s just a personal goal of mine that I’d really like to get done.\n\nAs for needing to understand the model first, yes absolutely. Luckily as I mentioned in another comment, I could just do it on the side and keep my current job so that if it failed I’d still be okay.",
                          "author": "MolotovCollective",
                          "created": 1639336201,
                          "upvotes": 1,
                          "replies": {
                            "hoaabgi": {
                              "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hoaabgi/",
                              "text": "I don’t want to sound discouraging, but as someone who holds a doctorate in history and has produced six (and counting) new PhDs, wanting to do a seven-year degree as a personal goal is one of the worst reasons to enter a doctoral program, and one that frequently ends in frustration, burnout, and withdrawal. \n\nDone properly, a history PhD is exactly as romantic as dental school. “I don’t plan to actually drill teeth, but earning a DDS has always been a personal goal of mine.”",
                              "author": "Ronnie_Pudding",
                              "created": 1639338114,
                              "upvotes": 2,
                              "replies": {
                                "hoaantb": {
                                  "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hoaantb/",
                                  "text": "Would it make more sense if I told you that I have a pile of education money just rotting away from my military service? I could get a PhD for free. They’d give me a paycheck in fact so I’d actually get paid to get it. I don’t need further education in my field, so why not get it in something I like?\n\nI also feel like if I ever wanted to publish books, I’d need a PhD to be taken seriously as a history author and have any chance.\n\nPlus, to be totally honest there is a personal pride element. If I am going to put myself out there and try to educate, I want to be seen as actually qualified, and I’d want to feel like I’m actually qualified. I also just grew up poor and I’m the first in my family to even graduate high school, I’m the first to go to college, imagine also being the first to go all the way to a doctorate? That would just mean a lot too.\n\nAt this point I’m 100% convinced I’ll get my doctorate in something, again since it’d be free, it would be silly not to. It’s just whether I follow my passion and get it in history, or if I do get the edge on peers and stick with healthcare administration, or even transition over to the provider route and go to medical school, which I have the grades to be competitive for.\n\nI honestly hate healthcare administration. I make a lot of money, but oh my god it’s so boring. So if not history, I’d probably definitely lean toward transitioning to be a provider, whether it’s med school, vet school, physical therapy, or something like that.\n\nI am fully aware that all of those healthcare careers on average pay more than a history degree, work fewer hours, and have a massively better job market, but I just don’t love those things and I’d feel a certain amount of guilt taking care of patients if I’m not fully passionate in what I’m doing.",
                                  "author": "MolotovCollective",
                                  "created": 1639338250,
                                  "upvotes": 1,
                                  "replies": {
                                    "hoavy1x": {
                                      "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hoavy1x/",
                                      "text": "Get an MA in public history.\n\nThere is no need for a PhD given your goals.",
                                      "author": "matthewsmugmanager",
                                      "created": 1639346837,
                                      "upvotes": 3,
                                      "replies": {
                                        "hoaw67m": {
                                          "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hoaw67m/",
                                          "text": "That’s a good suggestion. Thank you! I have seen programs for things like historical education. It would be a good idea to shoot for that instead. And if sometime in the future I did still want a PhD, that would help contribute to that as well without sinking that much time up front for a PhD if it’s not needed.\n\nThere’s actually a really good program for that out of the University of Edinburgh and I’ve even talked with them a little bit and it seems like I’d have a good shot at getting in even though I’m in the US.",
                                          "author": "MolotovCollective",
                                          "created": 1639346931,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    },
                                    "hodmv49": {
                                      "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hodmv49/",
                                      "text": "It helps a little--bringing your own funding usually helps in the admissions process, at least. Because of where I'm located and what I study, between half and two-thirds of my PhD students are using some form of GI benefits, and they're great to work with. \n\n(Your profile sounds a little like one of my students who just advanced to candidacy: born and raised in rural Alabama; Army straight out of high school; got an AA at the community college here after he got out, and liked it; transferred to my university and got a BA, and liked that, too; joined the MA program here, and liked it; and applied to our PhD program and got in. His wife is great and has some kind of high-powered executive job, and they just had their third kid last year so he's sort of a stay-at-home-dad/PhD student. He's an awesome guy and I love working with him, so it definitely can be done. But having a spouse pulling down a large salary certainly helps the equation. The family does not depend on him for financial support.)\n\nI don't mean to sound discouraging--it's just that I've been doing this a while and I've developed a sense of how different paths play out. A doctoral program will bleed a lot of the passion from even the most enthusiastic students, since a lot of it is boring (and a surprising amount is bureaucratic.) If you're going to pursue some career path in history, you may need to relocate your family to attend the best program you can get into. I spent 70 hours a week working during my first three years as a grad student--that's a lot of time to be away from your kids. You're interested in French history--are you ready to be away from your kids for months at a time while you're visiting archives? I your partner OK with that? I field a lot of information requests from prospective students this time of year, and while I try not to be discouraging I *do* want people to go in with eyes open.\n\nI have no idea what the economics of a YouTube channel are, but I would want to have a very good idea before I attempted to support my family on the platform. It is certainly possible to write books--good books!--without a PhD (Rick Atkinson is among those turning out high-quality popular work at a good clip.) Doctoral study may also ruin your writing for the general population. Academics are not exactly known for being highly readable. \n\nAnd while it is very, *very* difficult to publish with an academic press unless you have a doctorate, the economics of academic publishing are terrible and are only getting worse. Many academic presses are shuttering, and the ones that remain are not churning out best-sellers. My first book came out a decade ago with a top press in my field, and it got a lot of support from the marketing department, which put it on the cover of its catalog. It got a glowing review in a national newspaper and peaked at #818 on Amazon for about ten minutes. It was, by academic press standards, a big hit. My total royalties for the book to date are about $1,800. And I had to spend $800 out of pocket to have the book indexed. My last check covered five years of book sales and was $138.13. It's not the kind of thing you can support a family on.\n\nSo: My universal recommendation is to investigate all of the outcomes and have fixed goals at the other side (public history? teaching high school?) while you're weighing whether to apply. Pursuing a PhD mainly because \"I've always wanted a PhD\" has not, in my experience, sustained most people through the long slog of a doctorate. And while the financial costs of tuition are eased by GI Bill benefits, the opportunity cost of those hours and years--time you will not spend with your kids, with your spouse, pursuing hobbies, and so forth--cannot be replaced. So the degree is not \"free\" in that important sense. \n\nThat's not to say you shouldn't do it, just to say you should keep your eyes open. Good luck to you!",
                                      "author": "Ronnie_Pudding",
                                      "created": 1639403539,
                                      "upvotes": 2,
                                      "replies": {
                                        "hoe49c1": {
                                          "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hoe49c1/",
                                          "text": "Thanks for all your input! Out of curiosity, and I really hope this doesn’t come across the wrong way, but who do you recommend a PhD for? If, “I have a passion for the field and want to make a living researching it” isn’t enough, what is? Is it just because I’m already “settled in” enough somewhere else that the transition doesn’t seem worth the stress on myself and my family from your experience?",
                                          "author": "MolotovCollective",
                                          "created": 1639411289,
                                          "upvotes": 1,
                                          "replies": {
                                            "hoienkv": {
                                              "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hoienkv/",
                                              "text": "My advisor is a lot wiser than me, and here is the advice he always gave: \"The only reason to get a PhD in history is if there is only one job that you can imagine making you happy, and if that job absolutely *requires* a doctorate.\"\n\nTo be honest, it's very difficult for me to recommend a PhD in history at the moment. It's too early to tell what the long-term effects of the pandemic will be on higher education, and on history in particular. Things were not good before COVID, and there are some people who argue that the pandemic is the asteroid-hitting-the-planet moment. It's hard for me personally to recommend someone with a family depending on them *Close your eyes and jump! Things sometimes work out!*\n\nBut I have accepted a new student in each of the past few cycles, so there's a short list of people for whom I think the degree makes more sense: \n\n--People who have a pretty broad set of professional goals (working in public history, working for the government) and are not hoping to win the PowerBall lottery of a tenure-track position, which increases the odds of finding a job you can support yourself with on the other side. The government hires a significant amount of historians, and from what I can tell COVID is not affecting those positions. It sounds like you have the veterans' preference, which carries a *massive* advantage in hiring. The advantage of those positions is that they are steady, and that they are comparatively well-paid. The disadvantage is that you will not be pursuing your own research passion: Instead of writing about the years following the French Revolution, you'll be writing a series of short-turnaround pieces on, say, the history of military quarantines. The upside is that your work will actually be read, and be read by people in a position to act on it, unlike the vast majority of academic history. \n\n--People who are already working jobs in history (public history or teaching positions) for whom a doctorate opens up possibilities for promotion. That's about a third of my advisees at the moment, and I feel less nervous about their chances in the program because they are not bearing the opportunity costs of the degree (most are still working in those jobs and completing the degree part-time), and because the concrete benefits of a doctorate are pretty well-established for them. My two most senior students are both working full-time while completing their dissertations. (Both have the veterans' preference, by the way.) The most senior is rocketing up in the field of public history; he took a new job a few months before the pandemic started, and then got hired to a director position early in 2021. He's already having a great career and the doctorate will light the afterburner for him. (It's also a pretty nifty and well-timed dissertation project, which just turned out to be lucky.) The other decided to leave the Army after 11 years while ABD and got himself hired at a really neat organization in a job he says he'd love to stay in permanently. (Though I think once he completes the degree he'll be able to write his own ticket at a lot of places--he's extremely good.) I have a lot of confidence that the program is going to do very well by both of these guys. (Both have a young kid, too, if that helps.)\n\nSo it *is* possible to make this work. I would start thinking now, as you're considering applications, how much you're willing to disrupt your life, and whether your partner is completely on board. You'll lose your current income, and the raises that would come if you stayed in your field; and you will likely have to relocate your family at least once, and probably twice--once to move to the area your program is located, and once for your new job. You will likely be spending a lot of time working, and some away from your family; are you OK with that? Is your partner? From personal experience, I can say that the work involved in getting a history PhD is not always easy to explain to people outside the field. My girlfriend in grad school was a med student, and it was easy to explain why she was working such punishing hours: *I diagnosed a rare spinal condition today and helped save a toddler's life*. It was harder for me: *I read nine mostly-similar books about labor reform in the 1840s and then wrote a 22-page paper pointing out the very small differences*. \n\nIt sounds like some of the things you're interested in doing with history (writing, starting a podcast or YouTube channel) don't require a PhD, so why not start with those for now, and reassess whether a doctorate makes sense later? Would you be interested in teaching high-school? Is that a transition you can make now? Is there a part-time (NOT online) MA program you can use to dip a toe in the water without making a full-time commitment? MA programs are famous for not offering funding, but if you're bringing GI Bill benefits that's not a worry. If you uproot your family to begin a PhD program, you've already crossed the Rubicon. I always suggest to prospective students that they explore lower-stakes ways of testing out the field before placing a massive (and massively risky) bet on a doctorate.\n\nLast piece of unsolicited advice: I hear from a lot of former students who graduated three or four years earlier, who found entry-level work in a field unrelated to history, and who hate it and want to get back to their passion. I always spend a little time trying to ascertain what it is they don't like about their work--sometimes it's the field that is a bad fit, but half the time what they don't like about their current position is that it's entry-level rather than the field itself. A lot of lower-level positions, whatever the field, sorta suck. Things get a lot more interesting as you move up, get more responsibility, get more autonomy, and get better compensated. I'm not saying that's you; you seem to have a good handle on that. Just something I see a lot. \n\nI was one of those people who couldn't imagine doing anything besides being a historian, and I had a miserable two years during my run-up to tenure. That's an all-or-nothing proposition; you either get tenure, or you're basically chased out of the profession. My first thought every morning during those two years was *This is the only job that will ever make me happy, and I'm going to lose it, and I'll be forever haunted by the knowledge that I had my dream job and couldn't keep it*. It was, as you'd imagine, a miserable couple of years. In the end, I got tenure, and kept my job, and I'm extremely good at it. But looking back I can see quite clearly that the idea that this was the *only* thing I could do and be happy was just a failure of imagination.\n\nAnyway, free advice from an internet stranger. Take it for what it's worth. Mostly a very sincere *Good luck!* whatever route you decide to pursue.",
                                              "author": "Ronnie_Pudding",
                                              "created": 1639490208,
                                              "upvotes": 2,
                                              "replies": {
                                                "hojp00w": {
                                                  "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hojp00w/",
                                                  "text": "Thank you! You and the others in this thread have helped a lot. I think now I’m learning more toward a master’s rather than a PhD, and in public history instead to broaden the options and keep educational outreach central. I also think a masters is obtainable for me with minimal disruption and could possibly be done online if I find a decent program. I think a masters in public history, plus my veteran status should probably make many government jobs in cultural resource management, state or national parks, or state or federal museums fairly open to me. Plus I could apply those schools to more unconventional media routes like YouTube or something like that.",
                                                  "author": "MolotovCollective",
                                                  "created": 1639509215,
                                                  "upvotes": 2,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "ho6hkoy": {
              "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho6hkoy/",
              "text": "This is a great plan!!!!!",
              "author": "OreadaholicO",
              "created": 1639264876,
              "upvotes": 2,
              "replies": {
                "ho6iev6": {
                  "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho6iev6/",
                  "text": "Thank you for your optimism! It actually does mean a lot. I know I’m in no place to complain because I got lucky and have a good thing going for me already, but it doesn’t feel good to have a passion that seems like a dead end, so you giving me some hope on a more unconventional route does help a lot.",
                  "author": "MolotovCollective",
                  "created": 1639265255,
                  "upvotes": 2,
                  "replies": {
                    "ho6ipwe": {
                      "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho6ipwe/",
                      "text": "Passions may not be meant for day jobs but they damn sure aren’t dead ends!!!!!",
                      "author": "OreadaholicO",
                      "created": 1639265393,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ho6gwld": {
      "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho6gwld/",
      "text": "There is a lot here. What I’m hearing you say is you work 50-60 hours a week, your wife stays home with your two kids, you make a comfortable six figure income, and you want to move to several possible countries in EU, all with less stability, weaker currencies, and MUCH SMALLER (and even shakier) economies (because it’s all based off the USD). \n\nThe job market is tough here but there are many more opportunities than where you just named. Also, if you turned a BA in what many consider a no-pay field into a great paying job in a another field and your wife doesn’t even work, why would you think you won’t be able to bust your ass to get a dream job?\n\nI question why you’re not happy? Honestly, I think you work too many hours and would be happier spending MORE time with your family or pursuing hobbies. Healthcare administration is mind-numbing. You probably aren’t challenged but would do well with the same job, less hours, and a fascinating hobby. \n\nI make six figures too but I work a government job, 35 hours per week, with a pension etc. But it’s not my dream so I’m in a PhD (my passion project) and believe I will land a good job one day because I want to teach. I may have to eat some crow for a bit (associate spots) but I’ve got 12 years applied experience in the field that I can bring into the classroom. \n\nI dunno. I just don’t see uprooting my family for so much instability and uncertainty. Jesus look what happened to England with Brexit. And Ireland???? Half my family is there, I’m second generation American. Ireland is beautiful to look at (in many places) but is in big trouble economically and brutally poor for many.\n\nYou have what many would consider a dream. Many would kill for what you have. Have you truly done a deep dive into your restlessness? Are you tying your title to your worth as a person, husband, dad etc.? Just my two cents and a questions that come to mind.",
      "author": "OreadaholicO",
      "created": 1639264587,
      "upvotes": 12,
      "replies": {
        "ho6hxbd": {
          "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho6hxbd/",
          "text": "Thanks for your reply! I’m not unhappy really. I’m quite content. I’m aware that I’m lucky to have the career I have now and I that I have options many don’t have financially. I also have a good future ahead of me.\n\nI just know that I’d be a little bit happier in the actual field I love, if I could maintain the current life we have. I also make enough that even if it was a slight hit to total income, I’d be fine, and would outweigh the boredom in my current job.\n\nMy wife is also a stay at home mom more by necessity since our kids are both toddlers and it’s just easier for her to be home right now. She wants to work, and she loves the field she’s in, so in a few years her work would also probably make up for any lost income from me changing fields.\n\nAlso, thanks for your input on Ireland. We’ve been there quite a few times, but they were all vacations, so maybe we just got a rosier than normal view of the country. At least to me it seemed like the best place I’ve ever visited, which is why we went back so much.",
          "author": "MolotovCollective",
          "created": 1639265031,
          "upvotes": 2,
          "replies": {
            "ho6iitc": {
              "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho6iitc/",
              "text": "I lovvvvvve Ireland. For me, teaching at Trinity college for a year or two is a goal (even if they pay me nothing but room and board). I have no kids thank god so I can do that. But living there permanently wouldn’t be great unless I was old money rich lol.\n\nYou just hang in there. Having toddlers is HARD!!! No wonder your mind is wandering. Stack enough cash so you can peruse your dreams after work and on the weekends a bit until the YouTube takes off. We’re also in a world of web3 opportunities coming. Podcasts are an option too. Books. A million side hustles. If you want the PhD and don’t want to go into academia, online is totally fine and you’d probably enjoy using your brain toward your passions so go for it when you can and just do something part time.",
              "author": "OreadaholicO",
              "created": 1639265302,
              "upvotes": 3,
              "replies": {
                "ho6j7et": {
                  "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho6j7et/",
                  "text": "Thank you again! And thank you for suggesting books as an option for income as well! I think that might actually be a good idea because I try to stay educated and I read books and other published works from historians in my free time already. One thing that surprised me is how scarce published work is on the subject I’m interested in, especially compared to how much public interest there is in comparison. It’s definitely an area that could use more historians publishing books to disseminate that knowledge to the public.\n\nI have basically every book from a credentialed historian writing on my subject on my bookshelf, and there’s only like 10 books. That’s really not many. There definitely needs to be more work.",
                  "author": "MolotovCollective",
                  "created": 1639265619,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho6kz51": {
      "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/ho6kz51/",
      "text": "I still don't see the value of a doctorate, online or in person.  It doesn't seem to affect your plans, and it won't affect your employability.  It may affect you're perceived expertise, but less than your expertise will be affected by your performance in whatever you do.\n\nConsider your future in terms of your family.",
      "author": "x47126g",
      "created": 1639266425,
      "upvotes": 8,
      "replies": {
        "hoarlks": {
          "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hoarlks/",
          "text": "Thanks! Maybe my pride is taking over too much. I did have to deal extensively with proper historical methods in my undergrad. While it’s not to the same level as a masters or PhD, I think I am capable of analyzing the historical sources with proper respect and understanding.",
          "author": "MolotovCollective",
          "created": 1639345050,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hoanavf": {
      "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hoanavf/",
      "text": "Since the PhD will be free and you will get paid doing it, I would say go for it. Look for programs you want to apply for and check their requirements. Look for advisors that you want to study with, contact them, and see what you can find out. You might have to take the GRE, and you might have to relocate your family. See if you still want to do it after all the logistics are being considered. \n\nThe job market in the humanities really is bad, but if you could return to your current field in case you can't find jobs in academia, you will be fine. I have a PhD in the humanities and couldn't find a full-time job that requires all the skills I worked hard to gain, and that kind of killed my passion for my field. But I did have a wonderful time when I was a doctoral student. While I don't regret getting my PhD, I wish I had used those seven years on something else that can lead to a satisfying career. However, I do understand the desire to learn more, and, if I were you, I really couldn't let the education money go to waste. :)",
      "author": "thinking_is_living",
      "created": 1639343317,
      "upvotes": 2,
      "replies": {
        "hoasih4": {
          "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hoasih4/",
          "text": "Thanks for your input! I think I’ve mostly resigned my hopes for a “proper” academic career. If possible I’m learning more toward trying to eke out a living in more unconventional public education like YouTube or publishing books geared toward the general public, kind of like other academics like Jackson Crawford has been doing with linguistics after he ended his career as a professor to pursue those full time.",
          "author": "MolotovCollective",
          "created": 1639345419,
          "upvotes": 1,
          "replies": {
            "hob169i": {
              "link": "/r/AskAcademia/comments/re93ea/my_real_passion_is_history_but_ive_been_deterred/hob169i/",
              "text": "I think that is an excellent goal. I think more people (students and adults) should study history and learn from history. Public education reaches more people, and you already know your research topic. I will check out Jackson Crawford's videos. If you ever made YouTube videos, let me know and I would love to watch them!",
              "author": "thinking_is_living",
              "created": 1639349027,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}