{
  "sid": "dt2s3l",
  "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/",
  "title:": "I think I've just failed my PhD",
  "text": "This is kind of my open letter to academia...\n\nMy PhD was tough. It started really well, full UK scholarship, amazing project, and enthusiasm to do amazing research and follow the dream career. \n\nThen something happened. Can't pinpoint where or when, but my mental health deteriorated rapidly. I started to be afraid of going to the lab, and everything crumbled from there.\n\nTwo intermissions to try to sort my health, a referral at the first Viva and major corrections on my second and I have just submitted corrections..\n\nI tried so hard to juggle the corrections with work, and I really doubt it was enough. \n\nI'm away from academia now, and even though I'm starting again I'm doing well in my new career. Still disappointed in myself though.\n\nOn the other hand, I've now done the final mic-drop on the (very personal) hell that became academia.\n\nTo those who managed to survive, you are in a wonderful industry where you get to be creative and use your unique view on the world to enhance the knowledge of the human population. I wish you all the best of success and all of the grants and papers your hearts desire.\n\nI'm not bitter of any of you, just a bit disappointed in myself. But hey that's life. Thanks academia, I've learned lots not only about my subject matter, but also about myself.",
  "author": "_scottwar",
  "created": 1573154816,
  "updated": 1634080177,
  "over_18": false,
  "upvotes": 300,
  "upvote_ratio": 0.99,
  "comments": {
    "f6u5fdf": {
      "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6u5fdf/",
      "text": "There is so much I want to say to you. But I'm gonna start with the most important. You did NOT fail. You took control of your mental health, and frankly, that's so much more important than a degree. I need you to understand how utterly brave and strong that choice was. There are many of us didn't make that choice. I remember having a nervous breakdown 6 months before I defended, like on the brink of committing myself to a psych ward. If it hadn't been for a bit of luck and a kind committee member, I wouldn't have finished either. \n\nThe other thing I need you to understand is that Academia isn't the great answer. You can save the world without ever taking another foot on a campus. I wish you the best of all the world in your new career. And I don't know you at all, but I'm very proud of you.",
      "author": "tarakerin",
      "created": 1573158339,
      "upvotes": 223,
      "replies": {
        "f6u7nxu": {
          "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6u7nxu/",
          "text": "Incredibly kind words, thank you - and sorry that you had a similar\\* experience with mental health. I feel so much more comfortable in my new role, which I've had for throughout the whole viva process. \n\nYou are absolutely correct that academia isn't the great answer. I still respect those who have managed it well and are being amazing scientists, but I'm not of that specific breed. \n\nThank you, I didn't mean for this to turn into a 'praise me' post, it was more of a rant because my feelings are incredibly mixed at the moment.\n\n&#x200B;\n\n\\*no mental health issue is similar, unless you look in an extremely broad sense..",
          "author": "_scottwar",
          "created": 1573159172,
          "upvotes": 46,
          "replies": {}
        },
        "f6u89qs": {
          "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6u89qs/",
          "text": "This deserves all the upvotes.",
          "author": "agecraft",
          "created": 1573159402,
          "upvotes": 17,
          "replies": {}
        },
        "f6uxso9": {
          "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6uxso9/",
          "text": ">You did NOT fail.\n\n\\+1. Just starting a PhD is a bigger academic achievement than 99% of people will ever reach. Even if you had to opt for mental health over the piece of paper (which is totally the right choice), you're still in some upper echelon of educated individuals.",
          "author": "zanidor",
          "created": 1573171351,
          "upvotes": 18,
          "replies": {}
        }
      }
    },
    "f6u42ex": {
      "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6u42ex/",
      "text": "Congrats on finding your footing on a path that appears to work for you.  Having worked in industry and academia, I know first-hand that neither one is \"better,\" they are just different career paths, with different advantages and disadvantages.  I know brilliant, successful people that never tried to earn a Ph.D., that tried and chose not to finish, that finished and chose to go into industry, and that finished and stayed in academia.  Leaving academia and going into something that works for you is absolutely not a failure, it is a success.  I'm not disappointed in you--nor in any of my students who chose a different path than I did (in fact, I have counseled some of them not to follow my path)--and you absolutely need not be disappointed in yourself.  If you are happy with where you are now, that's all that matters.",
      "author": "bigrottentuna",
      "created": 1573157835,
      "upvotes": 51,
      "replies": {
        "f6u6cal": {
          "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6u6cal/",
          "text": "Thanks for the kind words.\n\nI'm a believer in hard work paying off over anything  - I was the first in my family to go to Uni let-alone going for a postgrad degree. My siblings and parent are all incredible successful in their lives, and it's amazing to see that if you work at it, regardless of intellectual ability, you can succeed.\n\nMy journey has been tough, and submitting a sub-par piece of work on the deadline is what's getting to me I think - even though preparing for my future is what blocked me from completing it fully. \n\nPositives are that I have some really valuable transferable skills, even without the formal qualification. I'm working towards developing this where I am at the moment and given (bar the last few weeks of stress leading up to the deadline) my mental state, I'm in such a better place.",
          "author": "_scottwar",
          "created": 1573158679,
          "upvotes": 16,
          "replies": {}
        },
        "f7ga7m2": {
          "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f7ga7m2/",
          "text": "We need more Profs that have this view, like you.",
          "author": "someth1ng_au",
          "created": 1573698503,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f6v79yk": {
      "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6v79yk/",
      "text": "You just submitted your corrections for your thesis, for which you have already done your viva? Yo, you didn't fail. You're about to be a doctor.",
      "author": null,
      "created": 1573178489,
      "upvotes": 9,
      "replies": {
        "f6vtoom": {
          "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6vtoom/",
          "text": "My corrections were not up to scratch I fear, so don't think that they will make it through.",
          "author": "_scottwar",
          "created": 1573200103,
          "upvotes": 3,
          "replies": {
            "f6wbulo": {
              "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6wbulo/",
              "text": "Saying you failed is definitely premature. PhD committees want their students to pass. If they let you defend and gave you corrections, you're in good shape; I think, deep down, you know that.",
              "author": null,
              "created": 1573222656,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "f6ussrb": {
      "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6ussrb/",
      "text": "There are people who will fail in academia, but you are not one of them.  One of the hardest things anyone can do is to walk away from a sunk cost.  It seems you are ready to do that for your mental health.  Given the undiscussed high rates of suicides and breakdowns this should be considered a success.",
      "author": "engelthefallen",
      "created": 1573167844,
      "upvotes": 12,
      "replies": {
        "f6w96v1": {
          "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6w96v1/",
          "text": "Not comitting suicide is a success indeed.",
          "author": "BeatriceBernardo",
          "created": 1573220514,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f6v7e29": {
      "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6v7e29/",
      "text": "I quit my PhD two years ago and it saved my mental health and my career is fine! I'm still doing creative and interesting work and making a difference with the added bonus of not getting gaslighted or ignored! You did the right thing!",
      "author": null,
      "created": 1573178574,
      "upvotes": 5,
      "replies": {}
    },
    "f6wc0by": {
      "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6wc0by/",
      "text": "I love this. I mean, rather, I don't find any delight in your misfortune, but I love the relative neutrality and clearheadedness with which you've assessed your situation.\n\nYou had a tough path, but the fact that you made it to the end anyhow is a testament to the fact (yes, fact) that whatever actual path you end up taking from here, you've got what you need to see it through.\n\nMost who leave academia take years not to hold a grudge, if they're bitter. If they're prone to perfectionism or self-guilt, they take even longer to stop holding a grudge against themselves.\n\nYou, though? You're holding gratitude, subject expertise, and self-knowledge, which far outweigh the touch of wistfulness you're feeling at the moment. And you'll bring yourself where-ever you go, so the investment of your efforts won't go to waste whatever the case.\n\nRe: corrections: good luck! Usually committees want their students to succeed, so at least you have that working for you, which is nice :)",
      "author": "academc",
      "created": 1573222778,
      "upvotes": 3,
      "replies": {}
    },
    "f6w93ho": {
      "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6w93ho/",
      "text": "1 question, did you try your best? If you did, don't be stupid and be disappointed in yourself. Be proud, be very-very proud. You aimed high, and tried hard. That is already an accomplishment in itself. Yes it is sad that you didn't make it. Be disappointed in the result, but not in yourself.",
      "author": "BeatriceBernardo",
      "created": 1573220436,
      "upvotes": 2,
      "replies": {
        "f8u41ef": {
          "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f8u41ef/",
          "text": "Yeah, this is how I feel about these situations as well.",
          "author": "118arcane",
          "created": 1574818664,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f6wopc2": {
      "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6wopc2/",
      "text": "You fought. That's what matters.",
      "author": "lunaticneko",
      "created": 1573231407,
      "upvotes": 1,
      "replies": {}
    },
    "f7aktds": {
      "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f7aktds/",
      "text": "Don’t feel guilty or ashamed or a failure! I just want to point out that mental health is important to address at any point in our lives because if we aren’t well, that will interrupt WHATEVER we are doing at the time, whether that’s finishing a degree or if you’re already at work or trying to settle into a relationship or trying to get a permanent house of your own.\n\nI struggle with some issues myself and it frustrates me because I want to be/feel successful in many areas of life. So I take a deep breath and try to pace myself and go after my goals, some of which are academic, and some of which are occupational. But the important thing is to never feel bad about taking care of myself. Because that is more important, and comes prior to any other success anyway. So don’t ever feel bad about leaving a life project if you need to address something more important with yourself.",
      "author": "mitshoo",
      "created": 1573531871,
      "upvotes": 1,
      "replies": {}
    },
    "f6wn4nq": {
      "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6wn4nq/",
      "text": "No one, not even one single soul in academia, is fully healthy mentally. It's a very demanding area with LOTS of ups and downs, and it really takes a lot of time and patience to get to a point where you can just sit and relax. It literally eats you up. Even then, though, you're still not mentally stable.\n\nThis is why I've also bolted. Most of my friends who kept up are not happy. Maybe they'll turn to be happy at some point, but the bottom line is, it is not for everyone, that's for sure.\n\nGlad you're happy and peaceful now, OP. Best of luck in life!",
      "author": "griwulf",
      "created": 1573230387,
      "upvotes": -1,
      "replies": {
        "f6wog7p": {
          "link": "/r/AskAcademia/comments/dt2s3l/i_think_ive_just_failed_my_phd/f6wog7p/",
          "text": ">No one, not even one single soul in academia, is fully healthy mentally.\n\nI get that you're trying to make OP feel better, but this is an unsupported, and ultimately unhelpful, generalisation.",
          "author": null,
          "created": 1573231245,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}