{
  "sid": "qgswwk",
  "link": "/r/AskAcademia/comments/qgswwk/what_should_you_do_if_you_have_a_sudden/",
  "title:": "What should you do if you have a sudden neurological condition and are unsure of your prognosis?",
  "text": "Hi I have had currently terrible migranes in the past 2 weeks I went to the urgent care 2x then to the ER It was more than a normal migrane, I loose feeling in the right side of my body and it’s hard to walk talk , my head kills me to the point I’m crying and I have intense brain fog rn :( . I saw a doctor earlier today about a sinuis issue I have that may be contributing to that amd they basically recommended a procedure to be done that would take about a week. Also I have an upcoming neurologist appointment about my head issues I guess I’m worried that I should think about possibly “pausing” this semester I basically haven’t been able to do any school work for 2 weeks….\nI have all my medical documentation so I can prove my illness I’m worried that it will take me a while to mentally recover from this odd attack I still feel so weak and school is scaring me, who should I look into contacting at my school about possibly “pausing a semester “? Or whatever options I have available thank you !",
  "author": "nostsarah",
  "created": 1635327742,
  "updated": 1635456597,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hi8div5": {
      "link": "/r/AskAcademia/comments/qgswwk/what_should_you_do_if_you_have_a_sudden/hi8div5/",
      "text": "First, you can do this. You might have to get creative but you can get through this and still get your education.\n\nSecond, see the neurologist, but if they aren’t a headache specialist, try to find a headache clinic with headache specialists (generally neurologists with additional training in managing headache disorders). There are also several in-patient treatments that may help, like ketamine and DHE infusions. Don’t let them discharge you from the ER until your headache is gone. \n\nThird, talk to your professors and the disability resource center to set up extensions and arrangements for anything you’ve missed. If you have any professors who aren’t cooperative or understanding, the disability resource center can advocate on your behalf.\n\nFourth, if you need to take a semester off to manage your health—do it! Taking care of yourself isn’t weakness or even a problem. If you want to stay in the school mindset, take a free course on Coursera or edX or some similar platform.\n\nI started getting migraines in grad school, sorry to hear you’ve joined the club!",
      "author": "eightwednesday",
      "created": 1635332164,
      "upvotes": 3,
      "replies": {}
    },
    "hi8p62y": {
      "link": "/r/AskAcademia/comments/qgswwk/what_should_you_do_if_you_have_a_sudden/hi8p62y/",
      "text": "This exact thing happened to me last September, minus the sinus issues. My neurologist originally thought migraines but migraine meds didn't help so when they found a small hole in my heart I was put on a mild blood thinner and it has sorted everything out, both regular migraines AND hemiplegic ones. \n\nIt can take a lot of time, different investigations, different med trials, etc to figure this out, so definitely look into all the possibilities with your doctor's and definitely take a semester off school, or two if you need to. Your health is so much more important and your profs will absolutely understand!\n\nEdit to add: your program director and/or program administrator should be able to sort you out with getting a medical leave approved",
      "author": "twitch_n_stitch",
      "created": 1635339157,
      "upvotes": 3,
      "replies": {
        "hia24g0": {
          "link": "/r/AskAcademia/comments/qgswwk/what_should_you_do_if_you_have_a_sudden/hia24g0/",
          "text": "Yeah I’m ngl like I feel so stressed bc of it , if i get too low of a gpa they can kick me out of my program at uni :( and I’m so behind already… I’m mect engineering",
          "author": "nostsarah",
          "created": 1635359537,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hi89lh8": {
      "link": "/r/AskAcademia/comments/qgswwk/what_should_you_do_if_you_have_a_sudden/hi89lh8/",
      "text": "From your post I'm not sure what level you're in, though many who posts in this subreddit are Ph.D. students. If you are one you'll want to talk to your Ph.D. director and/or advisor about your options there. If you don't get enough support there, and this would apply whether you're a Ph.D. student or not, you can see if your school has some kind of center for educational access or disability resource center. You could find out by looking up receiving accommodations for your uni. They advocate for you and stipulate what accommodations you would receive. I had bad migraines and went through them as well. You submit your medical information to them and they advocate for you without you having to give out your personal medical information.  \n\n\nThere is the option to withdraw for a semester with most programs, but how that works with Ph.D. depends so definitely talk to them first. For other graduate and undergraduate programs, you can talk to the registrar's office about a withdrawal for the semester. This would put a \"W\" for those courses on your transcript and not affect your GPA. There is also the option to approach your professors and ask for an \"I\" and complete the work later. Generally they give you into the next semester. The accommodations department can advocate for you with this as well. \n\nI hope this helps! I wish you healing.",
      "author": "jenl2881",
      "created": 1635329169,
      "upvotes": 2,
      "replies": {
        "hia2b27": {
          "link": "/r/AskAcademia/comments/qgswwk/what_should_you_do_if_you_have_a_sudden/hia2b27/",
          "text": "Ahh that’s what it’s called incomplete!!! I’m a soph/junior I have my associates degree from community college and now I’m at a university for a 4 year degree",
          "author": "nostsarah",
          "created": 1635359609,
          "upvotes": 2,
          "replies": {
            "hia346z": {
              "link": "/r/AskAcademia/comments/qgswwk/what_should_you_do_if_you_have_a_sudden/hia346z/",
              "text": "Definitely look into an \"I\" first then and a withdraw if needed. Getting accomodation support can help immensely, but some faculty will work with you themselves. If you choose to withdraw then the registrar can help you or you can reach out to an advisor if you have one.",
              "author": "jenl2881",
              "created": 1635359922,
              "upvotes": 2,
              "replies": {
                "hiaedyf": {
                  "link": "/r/AskAcademia/comments/qgswwk/what_should_you_do_if_you_have_a_sudden/hiaedyf/",
                  "text": "Thank you !! Think I’m going to try to reach out to my professors",
                  "author": "nostsarah",
                  "created": 1635364290,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}