{
  "sid": "pyl4un",
  "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/",
  "title:": "I shouldn't accept a PhD if I'm not passionate about the project, right?",
  "text": "I have an offer for a PhD in a mediocre university (less prestigious than the one I graduated in). It's tied to a project that I find maybe interesting, but I know I'm not gonna be passionate about it. On the other side, in my country you can't really expect to win a PhD with your own project, because it's more about who you know and who wants you to get in. \n\nAm I ungrateful to turn down the offer and in case, how can I do it without offending the professor I got it from (who would be able to help me in future applications)?",
  "author": "nonvogliomicalaluna",
  "created": 1633012736,
  "updated": 1634078796,
  "over_18": false,
  "upvotes": 113,
  "upvote_ratio": 0.92,
  "comments": {
    "heuxy3a": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heuxy3a/",
      "text": "You're really just going to have to do a costs/benefit analysis here. What are your ultimate professional goals? Is it likely that you will get accepted into another Ph.D. if you decline this one? Are you OK with the possibility of never earning this degree? Is it likely that this person would even be willing to support you in future applications? How important is prestige to you, especially given that it's perceptual? Even though you aren't \"passionate about it\" right now, is there a chance that you could grow to enjoy, tolerate, or learn from this project and/or mentor? If you believe that academia is \"about who you know and who wants you to get in,\" won't you be burning a bridge by declining this offer? Etc. Nobody here can give you an easy answer; this is something you're going to have to decide through introspection.",
      "author": "tspier",
      "created": 1633014920,
      "upvotes": 112,
      "replies": {
        "hevnpmo": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevnpmo/",
          "text": "True, I find it really hard to decide on only one professional goal. I know it broadly, the ways to get there are many! PhD could help",
          "author": "nonvogliomicalaluna",
          "created": 1633025575,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "hev1q6q": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hev1q6q/",
      "text": "No matter how passionate you think you are about something, it can (and likely will) become a slog after working on it for years. On the other hand, it's pretty easy to develop a passion for even the most random boring project if you put a solid effort into it and take pride in your work.\n\nIf there is another project that you 100% know you would rather work on then by all means do that, but if you just have a vague feeling that you won't be passionate about your current offer I don't know if that's a good reason to turn down the offer. I didn't even know what my project was when I started so I certainly was not passionate about it, but I've still done good work and had a positive experience nonetheless.",
      "author": "CootaCoo",
      "created": 1633016509,
      "upvotes": 66,
      "replies": {
        "hevd0w7": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevd0w7/",
          "text": "> On the other hand, it's pretty easy to develop a passion for even the most random boring project if you put a solid effort into it and take pride in your work\n\nI completely disagree. The exact opposite might also happen. I was in the situation as OP and went into a PhD in classics with a project that I wasn't totally into. I put a solid effort into it, but ended up getting out halfway because my lack of passion ended up with myself completely losing all interest in classics. I now work in a government department instead.",
          "author": "NuclearWarhead",
          "created": 1633021159,
          "upvotes": 10,
          "replies": {
            "heviuf2": {
              "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heviuf2/",
              "text": "I'm not sure you disagree. They didn't say that putting effort will make you love it, just that it can happen. Which is true, you can end up nerding out about some specific aspect of a project that looks boring at a shallow level, but has a lot of hidden complexity. Or you can become bored of the tedium of tackling that little sub-sub-sub-subtopic. The issue is that you never know which one you'll get until it happens to you.",
              "author": "needlzor",
              "created": 1633023541,
              "upvotes": 23,
              "replies": {
                "hevnkal": {
                  "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevnkal/",
                  "text": "This is exactly what I meant. In my experience the sub-sub-sub-subtopics of PhD projects are so specific that you'd be pretty hard-pressed to find anyone on Earth who is actually passionate about them before they dive in. So in my view it's great if you're excited about a project ahead of time, but having an innate passion before you even start isn't a reliable indicator that you will have a good experience.",
                  "author": "CootaCoo",
                  "created": 1633025512,
                  "upvotes": 20,
                  "replies": {
                    "hevorbp": {
                      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevorbp/",
                      "text": "Can't agree more. I was fascinated by my topic until about year 2, then I had to drag myself to finish. My friend was the opposite, he picked a random topic that I actually had to help him define, but got fascinated by a minute subpart of it and was very successful afterwards.",
                      "author": "needlzor",
                      "created": 1633026020,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hev10kv": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hev10kv/",
      "text": "Imo it's similar to a job in the sense that it would be nice if you're passionate about what you do, but if you're not it's not the end of the world, provided that you can get what you want out of it. For instance, if doing this PhD can open you to many career opportunities then maybe it's worth it. We can't make this decision for you, it's up to you to decide whether the end goal is worth the effort that you put in.",
      "author": "SubcooledBoiling",
      "created": 1633016206,
      "upvotes": 14,
      "replies": {}
    },
    "heuya2u": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heuya2u/",
      "text": "The question that comes to mind is whether slogging through w/out passion is worth the outcome- phd \nAnd perhaps being open to your interest becoming more akin to passion could help? In my experience what I thought coming in morphed many times before I got out",
      "author": "droldman",
      "created": 1633015061,
      "upvotes": 13,
      "replies": {
        "hevls5u": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevls5u/",
          "text": "That's interesting! I think looking into myself, I want a PhD because I like and I'm good at research, and I like the prestige to say \"I've got a PhD\", but would try to get an alt-ac job after those three years.",
          "author": "nonvogliomicalaluna",
          "created": 1633024761,
          "upvotes": 0,
          "replies": {
            "hevmbe1": {
              "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevmbe1/",
              "text": "In no way am I trying to dissuade you, but the process is fairly brutal. If a phd isn’t necessary or very helpful in your career plan then getting one might be needless suffering",
              "author": "droldman",
              "created": 1633024988,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "hevf1pp": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevf1pp/",
      "text": "Depends on the phd supervisor and the mentoring you will have access to. I'll take a good supervisor + less interesting project over a toxic supervisor + interesting project. hard to tell during a single meeting. you can kind of tell from how previous students talk aobut the supervisor.",
      "author": "PM_me_ur_floof",
      "created": 1633021988,
      "upvotes": 8,
      "replies": {
        "heymllj": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heymllj/",
          "text": "This. “Choose people not projects” is proably the best advice you can give out for phd admissions.",
          "author": "expelir",
          "created": 1633086243,
          "upvotes": 1,
          "replies": {}
        },
        "hevn2ai": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevn2ai/",
          "text": "Thank you, that's very useful advice... the supervisor is nice and good in their field but has no knowledge on what the project is about and will not be able to help me for that. I think I'm not gonna regret turning it down",
          "author": "nonvogliomicalaluna",
          "created": 1633025302,
          "upvotes": 0,
          "replies": {
            "hew0vnj": {
              "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hew0vnj/",
              "text": "You still might want to talk to current and/or former PhD students in a specific group you will apply for. I would also say that if your supervisor is as nice as you believe he/she will definitely support you in your decision.",
              "author": "GrumpyKungFu",
              "created": 1633031111,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hevgg0l": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevgg0l/",
      "text": "So much of this is dependent on what the advisor is like. (I took a PhD based on a similar level of enthusiasm about the project but knew the advisor really well.) The project pays me but my advisor and I also have other interests so I've submitted 3 papers thus far, only one of which was directly related to my funding project if you know what I mean.\n\nIt also largely depends on your field. I'm in engineering so the project defined the problem I had to solve, but I have some flexibility in how to solve it. \n\nOther questions: Is the uni still an R1? Will you be disappointed if you can't get into another PhD program right away (or at all)?\n\nIf the PI who offered you a position is reasonable they will support you in future applications should you turn it down, but also this is a conversation I had with my PI (because I was also considering other schools) and they unprompted told me they'd write me the best letter of rec should I turn down the offer. Some PIs would be offended no matter how polite you were in turning them down.",
      "author": "little_grey_mare",
      "created": 1633022562,
      "upvotes": 5,
      "replies": {
        "hevmsxk": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevmsxk/",
          "text": "I don't know my advisor at all. My project is computer science for cultural heritage, but the advisor is an English professor so knows nothing about that stuff. There might be machine learning involved and in that lab nobody does that, so idk how I will be supposed to learn. I think however that the PI or some of their colleague would write me a letter of recommendation, already told me it's ok if I say no (but idk if the subtext is \"say yes\").\n\nI think I could get into another PhD program, I have a job in a research center right now (temporary) so I don't need the money. The PhD is less that 20.000 euros/year so I'm not doing that for the pay lol...",
          "author": "nonvogliomicalaluna",
          "created": 1633025192,
          "upvotes": 2,
          "replies": {
            "hevsgwg": {
              "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevsgwg/",
              "text": "Ok so you’re a CS person and someone is trying to offer you a position in their English department lab? Does that mean you’d have a PhD in English? Consider how that might impact you (and also that the places you’d likely be looking for jobs wouldn’t know of your advisor’s works unless you end up liking English) \n\nI’m a little confused on if you don’t know the advisor how they or their colleagues would be able to write a letter of rec (or how it would be perceived in an application for a CS lab) but if they said they’d write one they should do it. (And general rule is that if you write a letter of rec it needs to be positive — otherwise decline)\n\nNo one should (has?) ever done a PhD for the money, lol\n\nETA: prof might also not have connections to the field of work you want to do (or connections to people who can help you when you’re stuck). On the flip side it is easier to make profs happy/get them off your back when they don’t know anything about your work but this just sounds like you won’t have anything to discuss at all",
              "author": "little_grey_mare",
              "created": 1633027569,
              "upvotes": 2,
              "replies": {
                "hevy87a": {
                  "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevy87a/",
                  "text": ">On the flip side it is easier to make profs happy/get them off your back when they don’t know anything about your work but this just sounds like you won’t have anything to discuss at all\n\nyeah, I'm worried they'd gonna be happy but I wouldn't learn how to do a good job",
                  "author": "nonvogliomicalaluna",
                  "created": 1633029986,
                  "upvotes": 2,
                  "replies": {
                    "hevysfd": {
                      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevysfd/",
                      "text": "Yeah, it’s a balance",
                      "author": "little_grey_mare",
                      "created": 1633030229,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "heuzjnd": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heuzjnd/",
      "text": "Hard to say, it probably depends on the person/topic. In my experience, I signed off for a couple of different projects, and at the end of most I feel that I dislike those that I had the most expectation regarding the interestingness, and start to enjoy a lot those theoretical works that I wasn't looking forward to at all. Your experience will probably differ though",
      "author": "maratonininkas",
      "created": 1633015588,
      "upvotes": 4,
      "replies": {}
    },
    "hev02if": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hev02if/",
      "text": "This is a deeply personal decision that no one in this group can make for you. Are you interested enough in the topic to spend years of your life working on it? I don't think you necessarily have to be extremely passionate about it but there has to be some interest there. Are you likely to be able to get a PhD another way? How much do you want a PhD in general?",
      "author": "Watershed0",
      "created": 1633015807,
      "upvotes": 3,
      "replies": {}
    },
    "heve4ga": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heve4ga/",
      "text": "For me, I'm not passionate about the day to day of the project / the methodology used, but I know the industry is what I want and that the outcome of the project is something I am passionate about which will make it worth it in the end, and the connections will be great! So I've decided to go for it. If this is similar to your situation I would give it a try, if none of those things resonate then I would probably pass, and/or look at your options to got to a diff country to find one you are passionate about.",
      "author": "Mashpole",
      "created": 1633021609,
      "upvotes": 2,
      "replies": {
        "hevn9ad": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevn9ad/",
          "text": "Thank you! I may have another possibility very similar to your case and the work environment is really nice!",
          "author": "nonvogliomicalaluna",
          "created": 1633025383,
          "upvotes": 1,
          "replies": {
            "hevsxy6": {
              "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevsxy6/",
              "text": "I’d say go for that then!",
              "author": "Mashpole",
              "created": 1633027761,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hewi7j7": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hewi7j7/",
      "text": "Personally I could never do a PhD in something I'm only slightly interested in. Doing a PhD will mean you will become an expert in something that's most likely pretty narrow. I believe research should be grounded in genuine interest and curiosity, because that's what it's all about. But I agree with others here - a cost/benefit analysis could help.",
      "author": "bearbutt1337",
      "created": 1633038706,
      "upvotes": 2,
      "replies": {}
    },
    "hewmuo3": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hewmuo3/",
      "text": "I wouldn't worry much about the exact topic. Instead, ask if this would be a good training experience. Will you gain knowledge in techniques or concepts that will get you your next job? How will my resume align with the qualifications for the job I'd like to have next? Am I able to get these qualifications working in this environment? Will there be people around who are experienced in this to help me or will I be all out on my own? These are most important questions imo.",
      "author": "bigvenusaurguy",
      "created": 1633040855,
      "upvotes": 2,
      "replies": {}
    },
    "heyrt2h": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heyrt2h/",
      "text": "Take the PhD. The offer is a gift. Even if you aren’t passionate about it you can use it as a building block for future successes.",
      "author": "imhappilymarried",
      "created": 1633089750,
      "upvotes": 2,
      "replies": {}
    },
    "heuyh6q": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heuyh6q/",
      "text": "`in my country you can't really expect to win a PhD with your own project, because it's more about who you know and who wants you to get in.`\n\nI find this statement deeply misguided. ALL PhDs should be based on YOUR OWN project. Working on someone elses project is a masters. I think you're a bit misguided as to what a PhD actually entails.\n\nEDIT: I understand projects as a whole, but PhD students are(should be) required to generate their own questions, methods, and experiments. They aren't there just to collect data for their PI and analyze it. Correct me if I'm wrong.....because I would be shocked if that is what PhDs have become now.",
      "author": "CptSmarty",
      "created": 1633015143,
      "upvotes": -6,
      "replies": {
        "heuyxlq": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heuyxlq/",
          "text": "not necessarily the case, pre-defined PhD projects are also advertised by PIs, especially if they acquire funding for a specific project.",
          "author": "Competitive-House202",
          "created": 1633015333,
          "upvotes": 15,
          "replies": {}
        },
        "heuzfkg": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heuzfkg/",
          "text": "Yeah this isn't true at all. A lot of scientific PhD projects in the UK are  predefined, especially if they have funding attached. You can maybe focus on the areas of the project that interests you most but the project itself is already set in stone before you even apply.",
          "author": "Watershed0",
          "created": 1633015541,
          "upvotes": 11,
          "replies": {}
        },
        "heuyy7y": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heuyy7y/",
          "text": "What you cite as a norm is actually only normal in some fields of study the US. OP likely lives elsewhere; even in top unis in the UK and Europe, advisors almost always assign projects.",
          "author": "ardhanarisvara",
          "created": 1633015340,
          "upvotes": 9,
          "replies": {
            "hev3p1i": {
              "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hev3p1i/",
              "text": "Yes! I'm from Europe",
              "author": "nonvogliomicalaluna",
              "created": 1633017316,
              "upvotes": 2,
              "replies": {}
            },
            "hevbf8f": {
              "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevbf8f/",
              "text": "The UK is a mix, from experience the majority are not pre-defined projects but pre-defined projects are the most advertised by a good margin because of how UK PhD recruitment works. It's definitely not \"almost always\", it's pretty much only when a specific project has already acquired funding. Additionally you usually have a lot of leeway with pre-defined projects to make them your own.",
              "author": "HW90",
              "created": 1633020506,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hev6te2": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hev6te2/",
          "text": "To answer your edit, we are talking about projects as a whole here. Of course within that project you will come up with your own methods and experiments but I'm not sure how that's relevant to the discussion at hand?",
          "author": "Watershed0",
          "created": 1633018609,
          "upvotes": 3,
          "replies": {
            "hev7i9z": {
              "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hev7i9z/",
              "text": "considering OP got an offer, they obviously have an interest/experience in the topic. For them to make a statement about lacking passion for the whole project without tying their own interests into it (their own investigation), why would they even apply to begin with? \n\nI'm just perplexed as to how OP got themselves in this situation, this far down the road.",
              "author": "CptSmarty",
              "created": 1633018891,
              "upvotes": 1,
              "replies": {
                "hevm77d": {
                  "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevm77d/",
                  "text": "Yes, I actually didn't apply. My professor said there would be an opening soon and that she was asked to find someone who could apply, but it's basically an offer if I say yes. In my country you say yes unofficially before doing the exam to get into the PhD, so that they can make sure to not make a bad impression if they select someone and that someone says no...",
                  "author": "nonvogliomicalaluna",
                  "created": 1633024940,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hev1gzu": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hev1gzu/",
      "text": "Having a project that motivates you is very important in my opinion. Whether the university is prestigious or not is less important than the PI and lab environment itself.",
      "author": "howaboatno",
      "created": 1633016400,
      "upvotes": 1,
      "replies": {
        "hev3sm5": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hev3sm5/",
          "text": "Thanks! Yeah this is a mediocre uni + project with a PI that knows nothing about it, so...",
          "author": "nonvogliomicalaluna",
          "created": 1633017356,
          "upvotes": 1,
          "replies": {
            "hevn3lh": {
              "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevn3lh/",
              "text": "Best of luck with your decision. Don't feel bad about turning down an offer, a PhD is a big chunk of YOUR LIFE, not the PI's",
              "author": "howaboatno",
              "created": 1633025317,
              "upvotes": 1,
              "replies": {
                "hevo8w9": {
                  "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevo8w9/",
                  "text": "Haha true! That's really motivating, thanks",
                  "author": "nonvogliomicalaluna",
                  "created": 1633025800,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hev9vz3": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hev9vz3/",
      "text": "Do you have other active funding applications for doctoral studies? Do you want to wait another year for better opportunities?",
      "author": "maturelearner4846",
      "created": 1633019870,
      "upvotes": 1,
      "replies": {
        "hevngq3": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevngq3/",
          "text": "I may have for 2022, but this is my only possibility for this year. I already have a job that involves research, though temporary, so I can surely wait",
          "author": "nonvogliomicalaluna",
          "created": 1633025469,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "heva9l3": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heva9l3/",
      "text": "I think I've seen a lot of posts on this sub asking \"is it bad if I don't feel burning passion for my research?\" and the answer is often to treat it as any job. Feeling passionate about it certainly helps, but then again I don't think it's an absolute necessity. In other words, \"discipline > motivation\"",
      "author": "jetpumps",
      "created": 1633020027,
      "upvotes": 1,
      "replies": {
        "hevnd4u": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevnd4u/",
          "text": "I totally suck at work when I don't like what I'm doing :/",
          "author": "nonvogliomicalaluna",
          "created": 1633025428,
          "upvotes": 1,
          "replies": {
            "hey3x4c": {
              "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hey3x4c/",
              "text": "Every single kind of work in the world will have some parts you like and some you don't like. \n\nGet a clear picture of the activities that the work on this topic will involve, and see if the nice parts outweigh the \"meh\" parts.",
              "author": "ColourlessGreenIdeas",
              "created": 1633069791,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hevdhkl": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevdhkl/",
      "text": "It depends on the prof and his group. Many universities have star profs who have very strong research groups, even if the university is not all that great overall.\nSo I would suggest make your decision based on the supervisor, his research team, and resources.",
      "author": "stdoggy",
      "created": 1633021350,
      "upvotes": 1,
      "replies": {}
    },
    "hevkh1s": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevkh1s/",
      "text": "Fakkit",
      "author": "jklm3456",
      "created": 1633024218,
      "upvotes": 1,
      "replies": {}
    },
    "hevms1r": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevms1r/",
      "text": "I don't think professional passion is a characteristic that is intrinsically attached to a project in an \"either it's there or it isn't\" sort of way. You can develop passion for a project by working on it, you can sometimes surprise yourself with the sort of things you end up passionate about.  \n  \nIt sounds like there are other things that are making you think twice about this offer, but I wouldn't put a lot of emphasis on some \"does this project spark joy\" snap-evaluation.",
      "author": "brett_hoover_wx",
      "created": 1633025182,
      "upvotes": 1,
      "replies": {
        "hevofrt": {
          "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hevofrt/",
          "text": "You're right, the conditions of the PhD aren't the best either (PI who wouldn't be able to help me in a big chunk of the research, very low pay & commute, mediocre university, not many job prospects...)",
          "author": "nonvogliomicalaluna",
          "created": 1633025884,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hew5ngf": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hew5ngf/",
      "text": "The project is not the most important thing. The mentor is the most important thing. Rankings and prestige are good, for foot in the door for organizations and industry life, but the stuff you practiced and learned in the program is way more important after that. Case study, I chose a program based on prestige, rankings, and perception. The project was not of my interest, but was okay. I can enjoy research in general. The mentor was not someone I was that fond of and that relationship eventually became toxic. Don't be like me. I left with a master's.",
      "author": "Weird_Surname",
      "created": 1633033169,
      "upvotes": 1,
      "replies": {}
    },
    "hewphip": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hewphip/",
      "text": "If you see the program leading to somewhere you want to go, then you might consider. \n\nIf you have no interest and do not see it going anywhere, why consider.\n\nWeighing your options will also help here. If you turn this down, then what next?\n\nBe grateful that you have an opportunity, but know that you can still turn it down. One way to turn it down is to say you have other opportunities/interests you want to explore. \n\nGood luck!",
      "author": "PeaceAndPrajna",
      "created": 1633042085,
      "upvotes": 1,
      "replies": {}
    },
    "hewspbi": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hewspbi/",
      "text": "Given what you've said, I'm guessing this is in the natural sciences. I say this because you absolutely can do your research on your own topic in the social sciences and humanities (and this I know personally).\n\nThe advice I had always heard was to do a Ph.D. if you couldn't do anything else. That is, you absolutely couldn't see yourself doing anything else right now, and it is agonizing to think about not pursuing academia (not necessarily a career in academia, but, remaining in academia for now). So, I would ask yourself those questions.\n\nAs a Ph.D. student, it's not at all uncommon to have a job you don't enjoy as part of your studies. What is most important is that you're passionate about your coursework and your own research.",
      "author": "JapanOfGreenGables",
      "created": 1633043620,
      "upvotes": 1,
      "replies": {}
    },
    "hewurmn": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hewurmn/",
      "text": "I didn't love what I worked on for my PhD.  I think I may be in the minority, but I just want to put it out there.  I wasn't miserable during grad school, I still work on projects I do love, it worked out for me because the tools I learned to use for my PhD project were very applicable to other topics I do work on.\n\nI specifically chose to work on my PhD project (I was admitted without a specific project in mind, and then my project got funding within about 3 months of me starting my PhD) mostly because I had already been working in that field area and working on my project meant I didn't need to re-learn the complex history of a place before I had to take my quals (which at the point was only 3 semesters away). I think a lot more goes into professional decisions like getting PhD than whether you're passionate about the subject.",
      "author": "TourmalineTart",
      "created": 1633044651,
      "upvotes": 1,
      "replies": {}
    },
    "hexyxy7": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hexyxy7/",
      "text": "First thing I'd look at is the supervisor. You can do great things with a good supervisor. But honestly there are too many factors at play here. You really have to assess if you are going to get an opportunity elsewhere.",
      "author": "givemeyourdonut",
      "created": 1633065950,
      "upvotes": 1,
      "replies": {}
    },
    "hey7mca": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/hey7mca/",
      "text": "Well, here's a few ideas. First, drop the prestige shit. It really doesn't matter that much unless you're talking top tier elite universities like Oxford, Harvard, etc. It's not beneath you. Good science is done in all sorts of places, so don't think something is beneath you based on some random metric. \n\nI don't know which country you're in and the policy, but in the US, at most Universities, if you drop out of the PhD program after your qualifications, as long as you've met the requirements for a Master's degree, you're granted one. As PhDs in the life sciences in the USA are funded, that's a way to get a \"free\" masters, but it's frowned upon. I wouldn't plan on doing that, but see if it's possible. \n\nSecondly, how familiar with the project are you? How familiar with the professor and the lab and such are you? The relationship with your PI is going to be incredibly important, and can make or break a PhD. If you start it, and you find it doesn't work, it's very possible to transfer within the university, or to another university, much easier than trying to apply fresh. Giving a project a chance is probably the best thing you can do, as you really can't know if you're going to be interested in it or not unless you actually get dug in, learn the current state of research, the bread and butter of the science you'll be doing, etc. You can be absolutely passionate about a project going in and then find a year in you hate it, and likewise, you can find the concept boring as hell, but then find it absolutely interesting once you get stuck in.\nI don't mean to be rude, but frankly, at the moment, it's pretty fair to say you don't know whether you're passionate about it or not, you might have an interest in it based on something you read, but you literally do not know enough about the subject to know whether it's something you'll hate or be passionate about until you spend time learning it. \n\n I'm seeing you focusing on very unimportant (in the grand scheme of things) parts and ignoring the important bits, such as whether or not you can have a successful working relationship with your supervisor, ask previous or current students how they work, and see how that feels, if you get alarm bells such as distant, never replied to emails, never proofread anything, etc., then take that for what it is. But a good supervisor can make a \"boring\" project extremely interesting.\n\nThe purpose of a PhD isn't to learn about a subject. It's to learn how to do research, and essentially saying \"I no longer need a babysitter to ensure my research is done properly.\" The knowledge you learn on the way is certainly a bonus, but it's not the purpose. It doesn't lock you in. Do post-docs in different fields afterwards to get more experience. \n\n>Am I ungrateful to turn down the offer and in case, how can I do it without offending the professor I got it from (who would be able to help me in future applications)?\n\nNo, you simply politely say you aren't interested, but thank them for considering you. The professor isn't going to take it personally, and if they do, that's a warning sign. You both have to find what works best for both of you, so they shouldn't expect an offer to be accepted simply because it was sent. As far as who can help you with future applications, the same people who helped you with this last round. Perhaps work a year in a lab you find interesting as a research assistant, and have that PI write a recommendation letter if they're comfortable doing so. \n\n>On the other side, in my country you can't really expect to win a PhD with your own project\n\nThat's pretty much everywhere, as that's not how that works. Generally, you'll develop your own project based on the focus of the lab. It'll be a very specific project related to the labs focus. You're using the PI's grant to do research on a certain subject, and utilizing some of that to work on a project of your own that'll be your thesis, but it's insane to expect you'll have free reign to just do whatever you want. If it's not within the scope of the funding for the lab, then how are you paying for supplies, your time, etc?",
      "author": "htbdt",
      "created": 1633072936,
      "upvotes": 1,
      "replies": {}
    },
    "heyetcg": {
      "link": "/r/AskAcademia/comments/pyl4un/i_shouldnt_accept_a_phd_if_im_not_passionate/heyetcg/",
      "text": "Just dropping in to write less prestigious doesn't mean worse opportunities. A 'prestigious' uni tends to be more competitive. I've always preferred to be a top student at a mid-higher ranked institution than a mid-higher student at a top one because I could get much more individual attention and really squeeze more out of my studies.",
      "author": "Pawel_Malecki",
      "created": 1633079567,
      "upvotes": 1,
      "replies": {}
    }
  }
}