{
  "sid": "gac6r2",
  "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/",
  "title:": "How do I approach my conservative scholarship program about making our content more inclusive?",
  "text": "Please let me know if this isn't the right place for this question! I'm new to Reddit.\n\nI'm in an undergraduate mentored scholarship program (I'm a rising sophomore). This was my dream program, and I feel lucky to be part of it. However, this program has a reputation on campus and in the community for being extremely conservative, which I am not. I was assured when I was offered the scholarship that it was a non-partisan group without bias and that I would be welcome.\n\nWhile I have enjoyed my time in the program, I have a few issues. We read books and hold upwards of 50 unique private and public lectures and seminars throughout the year. Every book we've read has been by a white man, and all of our guest speakers have been white (though we had several women speak this past semester for the anniversary of the 19th amendment). \n\nI have brought up my issues with the lack of diversity before, but I don't think I'm being taken seriously since I'm new to the program, and I'm one of the few outspoken liberals. Once when I did mention diversity during a philosophy seminar, I was told that there just aren't many female philosophers, and the ones who did exist don't have many, if any, surviving texts, so we couldn't study them. Obviously that wasn't the response I was hoping for, and I didn't feel comfortable bringing up the problem again.\n\nAdditionally, several of my fellow scholars seem to think I'm overreacting or that the program is trying to bring in diverse speakers, but they won't come because of our reputation (though there's been no evidence that this is the case).  I know some of my friends feel the same as I do, but they don't want to rock the boat or make any of the staff upset by criticizing the programming.\n\nThis mostly flared up because our summer reading list was just announced, and it is once again all white male authors. \n\nAm I overreacting? Is there a certain way I can approach this without seeming too confrontational or disrespectful? I know a lot of work goes into making our schedules and choosing books to read, but I want to work with the program to make it better for future students. I'm just nervous, and I feel a bit lonely since no one seems as bothered by the issue as I am.\n\nThanks in advance!",
  "author": "_rainjacket",
  "created": 1588176252,
  "updated": 1634081858,
  "over_18": false,
  "upvotes": 115,
  "upvote_ratio": 0.8,
  "comments": {
    "foz4dd5": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/foz4dd5/",
      "text": "This is obviously a huge problem, and it's really courageous of you to take it on. I suspect that there's some long-standing problems here—beginning with a commitment to \"classic\" humanistic study that largely depends on a critical tradition established by white male scholars in the twentieth century. In addition, it's clear that you're being gaslighted—the notion that there are not female philosophers (in both continental and analytic traditions) is patently false and disprovable with a quick google search. So, dismantling what is clearly a deeply entrenched ideology in the very curriculum of a university program is something that will probably require one of a few major things: a) curricular change approved at the dept/program level b) a change in the director that you mentioned picks most of the reading or c) a demand from a large proportion of the students that the readings be revised.\n\nSome of these are institutional and are completely out of your control. Nonetheless, I think there's some things that you can do. While the reading group idea is obviously a bit patronizing, there's something to it, at least to the extent that you'd be bringing together some like-minded individuals to study, say, Wollstonecraft, Fuller, Douglass, Du Bois, etc. There's reading lists available online for this kind of curriculum, or you can reach out here if you need help (I'd personally be happy to assist). Once this gets some traction, you'll have allies in the truly venerable goal that you've set. One other idea with which you might be able to approach the institution is the following: think about suggesting the democratization of the program. Ask that students (or a student rep) be involved in the process of selecting texts or inviting speakers, or that you all vote on a particular text/speaker to be added to the curriculum. Even if only a couple texts or speakers each yr are student chosen, you can perhaps start to chip away at these arcane practices. Best of luck!",
      "author": "mobymobyahab",
      "created": 1588184481,
      "upvotes": 122,
      "replies": {
        "fp100ya": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp100ya/",
          "text": "Thank you for your kind words and advice! I really like the idea of democratizing the scheduling process (though I doubt it'll happen). The scholar-elected Chair of the program typically is the liaison between staff and students, so I've been discussing different options with her about giving students more input for the curriculum. In any event, I'll likely start my own small reading circle. If you have any particular lists or recommendations to get me started, I'd be grateful!",
          "author": "_rainjacket",
          "created": 1588220885,
          "upvotes": 7,
          "replies": {
            "fp2yftv": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp2yftv/",
              "text": "Of course! What kind of stuff are you interested in? Or, does the program have a particular theme? Another way to approach this would be to think about dialogue—so, which readings have you done, and which ones might complement them (e.g. Ralph Waldo Emerson's essays alongside W.E.B. Du Bois—Du Bois partially gets the idea of \"double consciousness\" from Emerson). Some places to start with primary works might be Phillis Wheatley's poetry, Frederick Douglass's *Narrative*, Harriet Jacobs's *Incidents in the Life of a Slave Girl*, Kate Chopin's *The Awakening*, Leslie Marmon Silko's *Ceremony*, virtually anything by Virginia Woolf, although \"A Room of One's Own\" is a classic. These are more typically literary works. If you're interested in philosophy, some texts might include Mary Wollstonecraft's *Vindication of the Rights of Women*, Margaret Fuller's writings, W.E.B. Dubois's *The Souls of Black Folk.* But these are just starting points! Feel free to send me a message if you have some specific themes/topics you're interested in and I can point you in the right direction.\n\nI'd also recommend getting in touch with a grad student in English, American Studies, or History - they might be able to point you in a more specific direction, and might even offer to help out (though don't be offended if they politely refuse—grad students are severely overworked and underpaid).",
              "author": "mobymobyahab",
              "created": 1588269991,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fozmf4y": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozmf4y/",
          "text": "I bet you wouldn’t think a conservative in a liberal program was “really courageous”.",
          "author": "sickboy789",
          "created": 1588193099,
          "upvotes": -78,
          "replies": {
            "foznb2w": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/foznb2w/",
              "text": "I've had conservatives in liberal programs that try to see multiple viewpoints and provide evidence for their own views.  They can describe how their views have changed or why they have stayed the same taking alternative perspectives into account.  These students are also courageous.",
              "author": "Lamalaju",
              "created": 1588193524,
              "upvotes": 65,
              "replies": {}
            },
            "fozotc0": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozotc0/",
              "text": "This isn't a well-formed criticism at all, so I'm not going to give a full response. What I will say though, is that OP is clearly someone who is invested in making their educational experience one that has greater breadth, depth, and analytical training. The program as it's described doesn't do that—though it purports to. If that kind of rigorous improvement is not positive in your view, regardless of political position, then your issues are less with this particular problem and more with the idea of education as such.",
              "author": "mobymobyahab",
              "created": 1588194259,
              "upvotes": 38,
              "replies": {
                "fp0jwo6": {
                  "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0jwo6/",
                  "text": "So you’re saying there’s no variation among white male philosophers?",
                  "author": "TakeOffYourMask",
                  "created": 1588210746,
                  "upvotes": -13,
                  "replies": {
                    "fp0slxp": {
                      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0slxp/",
                      "text": "That's not the right question to ask.\n\nThere's probably as much diversity within white male philosophers as there is between them and philosophers of other races and genders. That's not the point.\n\nOne's race, gender, nationality, sexual identity, gender expression, and other identity factors greatly influence their perspective and the expression thereof. That's true if they're writing about race (*The Souls of Black Folk* wouldn't be the same if not written by W.E.B. DuBois) or not (*The Wretched of the Earth* is greatly influenced by Fanon's positionality).\n\nBesides, there are different philosophical traditions too, outside of just the U.S. and North America. Philosophy is one of the oldest fields in the world; people have been thinking about philosophy since before humans could write. No Chinese philosophy? No Indian philosophy?",
                      "author": "roseofjuly",
                      "created": 1588216003,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fozyy17": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozyy17/",
              "text": "Where's the courage in challenging diversity, representation, and intersectionality, especially when coming from a position in which white male representation is the status quo? When you already hold all the cards, challenging those who hold none is just punching down at that point, and isn't at all courageous. A program not putting in the work to diversify is lazy at best, malicious at worst.",
              "author": "drilllbit",
              "created": 1588199376,
              "upvotes": 24,
              "replies": {}
            }
          }
        }
      }
    },
    "foz9wif": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/foz9wif/",
      "text": "I think conservatives are mainly allergic to the idea that you might choose an author or speaker simply *because* of their gender or ethnicity. Whether that's smart or not is up for discussion but I bet that's what they object to. \n\nYou might be more successful if you specifically look for philosophers who have really good ideas, but seem to get overlooked because they don't fit the mold of what a philosopher \"should\" look like. Then make your argument based on their ideas, not their gender or ethnicity. \n\nI also think that it's probably *true* that there there aren't many historical female philosophers with surviving texts. I wouldn't interpret this as someone saying that women can't be philosophers, though. They are probably just as aware as you are that institutional barriers made it nearly impossible for women to work or publish in the field. Not much can be done about that now, so you may want to look for your non-white-males among more modern scholars. \n\nDo you find that the men and women in your program are treated equally? No doubt philosophy is historically male-dominated, but if the program does a good job of encouraging its female students, I consider that a good sign.",
      "author": "thewhitewallisblue",
      "created": 1588187119,
      "upvotes": 67,
      "replies": {
        "fozhdmq": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozhdmq/",
          "text": "I mostly agree with this. While not being \"allergic\" to the notion, I would encourage works to be promoted on the ideas they present against a cultural backdrop researched deeper than skin colour, gender, or sexuality of the individual author. There are many authors weighty enough that the mention of metacontext to their works presents as a lack of research I to their merits. The perception is often: If the works are worthy of merit, why not discuss the works, rather than who wrote them. \n\nConservatives, while frequently framed as favouring white male authorship and chafe a bit at the idea that this is properly presents our ideals: we don't value white male works because of intrinsic white maleness, but rather the merits of their works, so approaching the discussion in this way seems  ill advised. \n\nAs I've posed above, the value of many non-white male authors is not reasoned by their proponents, to lie solely in their statistical demographics, but in their talent. This being the case, advocacy centered around presenting value in sources based around gender, ethnicity, or nationality is likely to do little to sway the Conservative thinker or advocate for the quality of authorship as these criterion do not speak to the works themselves. \n\nIndeed, I find most often what people value is not colour of skin, sexual preferences, or nationality, within the lifestyle of author, but of culture (culture not being synonymous with Individual lifestyle ) and what ideas the person presents through this , therefore I would distance from language based on labels and not content. It's not that Franz Fanon was black, it's that he wrote about being black, just as it is not that Judith Butler identifies as Queer, but rather what she has written on Queer theory, which lend them weight and therefore relevance. Showing people there are ideas of value within labels rather than valuing labels because they represent a political ideal seems the best way to approach this.",
          "author": "the-paper-unicorn",
          "created": 1588190687,
          "upvotes": 24,
          "replies": {
            "fp0ol9c": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0ol9c/",
              "text": "I would push back on that a little, though, and say that I think many folks *assume* that liberal folks calling for more representation in the classics want representation for the sake of skin color. I'm a black woman, and when I say \"I want to see more women of color in the classics curriculum,\" I am saying that because I believe women of color have a unique perspective and cultural/identity-related influence that comes across in their works, not because I just want to see a little extra brown on the skin of the scholar.\n\nThis is true *even when* women, or people of color, or queer folks, are writing/discussing things that are not specifically related to their identity. There are scholars from underrepresented groups with works of value who don't necessarily do research/scholarship specifically on their identities.\n\nAnd quite honestly, I disagree with this:\n\n>we don't value white male works because of intrinsic white maleness, but rather the merits of their works, so approaching the discussion in this way seems ill advised.\n\nI'm a social scientist who studies race. People often *believe* that they do not value white men (or whatever identity holds systemic power) because of their whiteness and maleness...but the research tells us that they do, actually. When the exact same words are spoken/read, they tend to be rated and valued more highly when they are portrayed as coming from a white man rather than a woman or a person of color.",
              "author": "roseofjuly",
              "created": 1588213522,
              "upvotes": 14,
              "replies": {
                "fp10xvp": {
                  "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp10xvp/",
                  "text": "This puts my thoughts into words much more eloquently than I could do myself. Underrepresented scholars have a unique perspective that just can't be captured by people who aren't in those communities. I really want to lift those voices up, especially in a program whose mission is to promote higher learning and produce future community leaders.",
                  "author": "_rainjacket",
                  "created": 1588221524,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "fp10itl": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp10itl/",
          "text": "I won't pretend to know what my conservative friends are thinking, but I do think there is something to what you're saying. There has been some pushback on \"including diversity for the sake of being diverse\" although that's not necessarily my goal. \n\nI believe men and women are treated equally in the program (from my experience), but there has been some discussion about racism within the program (usually unintentional but still a major issue), and we have a disproportionate number of white people in the program compared to the university's student population as a whole. This is one reason why I feel it's important to be intentional and consciously make an effort to include authors and speakers of color.",
          "author": "_rainjacket",
          "created": 1588221234,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fozdg2f": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozdg2f/",
      "text": "I’m confused on what their excuse is for having only white guest speakers. It’s one thing to say we don’t have enough surviving historical texts in the subject area from non-white people (although that sounds suspect to me), but saying there’s not currently enough non-white people in the field for them to invite as speakers seems ridiculous to me. Do they really think 50 out of 50 speakers being white is normal?",
      "author": "illmaticrabbit",
      "created": 1588188811,
      "upvotes": 43,
      "replies": {
        "fozkhne": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozkhne/",
          "text": "I have no idea why you're being downvoted. 50 invited talks is a massive organizational endeavor and there is absolutely no way the committee didn't notice that they were only inviting white people...and if they somehow didn't catch this, that's a problem in and of itself!",
          "author": "spec_of_cp",
          "created": 1588192174,
          "upvotes": 37,
          "replies": {
            "fozxoxm": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozxoxm/",
              "text": "I have worked with some White people who not notice at all.",
              "author": "ThatProfessor3301",
              "created": 1588198723,
              "upvotes": 17,
              "replies": {}
            },
            "fp0op0q": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0op0q/",
              "text": "...yeah, I believe that they didn't notice.",
              "author": "roseofjuly",
              "created": 1588213585,
              "upvotes": 3,
              "replies": {
                "fp1d2vd": {
                  "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp1d2vd/",
                  "text": "And if they didn’t notice I’d say that’s a huge cultural problem in and of itself as opposed to an excuse",
                  "author": "Rec0nSl0th",
                  "created": 1588231514,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "fp17gzc": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp17gzc/",
          "text": "Not for this case but do you thing generally commitee counts the numbers of Black, White, Make Female, Asian etc when they select them?",
          "author": "big_man123",
          "created": 1588226584,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "foyrupe": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/foyrupe/",
      "text": "Have you tried suggesting other books to read?",
      "author": "smartwin02",
      "created": 1588178016,
      "upvotes": 14,
      "replies": {
        "foyv684": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/foyv684/",
          "text": "I’m trying to compile a solid list of books with more diverse authors, but I usually get hit with the “you can start your own small reading group if you want” or an empty “yeah, we’ll think about it” without any follow up.  The director picks most of our reading list, and he tends to stick to what he’s already read.",
          "author": "_rainjacket",
          "created": 1588179762,
          "upvotes": 32,
          "replies": {
            "foz3uhb": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/foz3uhb/",
              "text": "Makes sense, I’ve learned with a lot of these programs, coordinators tend to stick with what they know or what’s already been done before even if it’s not working or doesn’t benefit everyone in the group. \n\nIs the point of this scholarship to read the books assigned and then discuss them. You had mentioned that it was mentored, could your mentor help you promote more diversity?",
              "author": "smartwin02",
              "created": 1588184228,
              "upvotes": 11,
              "replies": {
                "fp1141e": {
                  "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp1141e/",
                  "text": "It's mentored in the sense that we communicate directly with the staff (such as the director) and do specialized programming. I don't have a personal mentor within the program, and it functions almost independently from the university.",
                  "author": "_rainjacket",
                  "created": 1588221643,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fp0iq16": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0iq16/",
      "text": "[deleted]",
      "author": null,
      "created": 1588210071,
      "upvotes": 5,
      "replies": {
        "fp120a0": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp120a0/",
          "text": "Thank you for the advice. I will say that I typically don't use liberal/conservative labels within the program, but it is a political science scholarship (I maybe should've included this in the description for clarity). So politics comes up more often than not. \n\nI'm currently working on compiling a list of possible books, speakers, and topics to recommend to the staff, and I hope to have a number of other scholars sign off on it before I present it either to our chair or the staff. I will likely start my own small reading group whether they take my suggestions or not (and I'm looking forward to it!). \n\nI agree with your point about echo chambers, and sometimes I feel like I'm just bouncing back and forth between the conservative stances in my program and the liberals outside of it without any middle/common ground. I want a diversity of opinions and experiences represented, and I hope I can be a strong advocate. But it's hard, and I know I do have my own biases to work through at the same time.\n\n(Also it may not sound like it from this thread haha, but I am having a great time in college and really enjoying my studies!)",
          "author": "_rainjacket",
          "created": 1588222277,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fp0rfyo": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0rfyo/",
      "text": "I'm a black woman who left academia and have done what you're trying to do both inside and outside of academia (with varying levels of success...more in industry, interestingly enough). I have found that I get the most traction when I acknowledge their efforts (like you did), say that I understand why the \\[insert activity here\\] is structured this way; but here's why I'm concerned and here are some suggestions for how to do it better. \n\nThe suggestions part is the most important part. Without them, it's far too easy for people to say \"I hear you, but we don't have a better solution so we're just going to keep doing it this way.\"  And then nothing changes. This may take a little bit of research on your part. Do you have professors in your department or program that you trust and can talk to one-on-one? If not, you could also reach out to other scholars of color in your field and related ones to ask for recommendations of readings or speakers.\n\nThe other thing is that I always assume best intentions. I've found that when people do unintentionally exclude voices from women and people of color, it usually actually *is* unintentional. They simply just don't notice because they haven't thought about it. Keep asking questions. There aren't *many* surviving texts from female philosophers? \"Oh, really? So then there are *some* surviving texts from some female philosophers, even if not many? Do you have any recommendations for us to look up?\" The important thing is to be genuine (not just to *sound* genuine, but to *be* genuine) when you're asking.\n\nIf you find yourself getting angry or upset, stop and try again later. It's not that you don't *deserve* to get upset (as I mention in a different comment - people are never asked to justify white or male scholars, only women, people of color, etc., and that's *infuriating*). It's just that your chances of being successful go way down when you do exhibit any kind of negative emotion about this.",
      "author": "roseofjuly",
      "created": 1588215275,
      "upvotes": 8,
      "replies": {
        "fp13i3l": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp13i3l/",
          "text": "Thank you for your advice!\n\nI think the lack of suggestions has been one of the bigger roadblocks so far, because I know I'm not the first to bring this issue up. It's easy to identify a problem but much harder to come up with feasilbe solutions, and I think that's why we haven't gotten very far yet.\n\nI think, as a previous commenter suggested, I'm going to reach out to the university's office of diversity and inclusion as well as the women and gender studies department (I know a few professors there) for advice and recommendations.\n\nYou're definitely right about it being unintentional -- I don't think anyone sits down and thinks about how to exclude POC and women from the schedule. My issue is probably just being a little shy (especially as a freshman) and afraid to question things too much or too publicly. But I will try to take your suggestion and frame my questions differently because I think your framing is a much better approach.\n\nIt is frustrating because I have trouble expressing my thoughts in an \"academic way\" since I tend to get emotional. I think my best bet is to make my list of recommendations, have as many other scholars in the program sign on as I can, and ask our chair to send it to the staff. This will at least keep me from having to talk to them in person.",
          "author": "_rainjacket",
          "created": 1588223393,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fp0j5h3": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0j5h3/",
      "text": "Why not embrace the conservativism and suggest a book by a black conservative or a female conservative? There are plenty. Might I suggest “Why young men” by Jamil Jivani? He grew up in Toronto’s Little Jamaica, functionally illiterate. We were later classmates at Yale, where he graduated from the law school. His book draws interesting parallels between how gangs recruit fatherless young men and how ISIS does the same. It’s “traditional family structures are important” conservativism, which you may find substantially more palatable.",
      "author": null,
      "created": 1588210313,
      "upvotes": 3,
      "replies": {
        "fp123yj": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp123yj/",
          "text": "Thanks for the suggestion! I'll have to look into his work.",
          "author": "_rainjacket",
          "created": 1588222352,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fp13ru7": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp13ru7/",
      "text": "There's being conservative and there's being sexist, racist, xenophobic, etc. I'm so fed up with these concepts being interchangeable. It's far beyond time that being conservative no longer means being discriminatory butts. \n\nI wish you great success especially because being that person who initiates change can be scary but so, so important!",
      "author": "rnalice",
      "created": 1588223604,
      "upvotes": 3,
      "replies": {
        "fp155is": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp155is/",
          "text": "Thanks!",
          "author": "_rainjacket",
          "created": 1588224692,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fozm8za": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozm8za/",
      "text": "Is there a diversity & inclusion office on your campus? They don't typically work with curriculum afaik, but they might be able to help you figure out how to best approach this and what your actual resources are.",
      "author": "mediocre-spice",
      "created": 1588193018,
      "upvotes": 9,
      "replies": {
        "fp128un": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp128un/",
          "text": "I actually hadn't thought of this! We have a great diversity and inclusion office on campus, so I may shoot them an email and see if they can at least give me contact info for possible guest speakers I could recommend to the program's staff. Thanks!",
          "author": "_rainjacket",
          "created": 1588222450,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fozktbk": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozktbk/",
      "text": "Is this program part of a larger institution. You don't have to say what one, of course, but most institutions are run by various committees. In academic institutions, there is usually a human rights of equity committee. This would be the place to raise your concerns. The thing about institutions is that you can use these committees to enact change in policy that programs have to follow. \n\n If poosible, reaching out to an equity group, committee, or program might also be helpful. They can give you equity training or anti-oppression training that could help prepare you to engage with the conservative culture of the program.",
      "author": "rnalice",
      "created": 1588192330,
      "upvotes": 7,
      "replies": {
        "fp12q32": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp12q32/",
          "text": "I think part of the issue is that my program is mostly independent of the university itself with seemingly little oversight. I'm trying to be vague, but it essentially belongs to a very wealthy conservative politician, and the politician donates a boatload of money to the university each year. The university itself has a reputation for being liberal, so it makes our program out to be somewhat of a \"conservative safe haven\" as I've heard others on campus phrase it.\n\nI will definitely consider at least reaching out to our office of diversity and inclusion for advice on how to approach the subject as a previous commenter suggested.",
          "author": "_rainjacket",
          "created": 1588222804,
          "upvotes": 2,
          "replies": {}
        },
        "fp0640a": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0640a/",
          "text": "This is a good idea. \n\nOP, I know you said you're an undergraduate, but if this same department also has graduate students/TAs then there's a chance that there is also a labor union for TAs in the institution. They usually have an equity committee. So reaching out to the labor union, if there is one, could be a good place to start.",
          "author": "simone_snail_420",
          "created": 1588203191,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fozyft1": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozyft1/",
      "text": "No, you are not overreacting. It seems you are getting a lot of good advice, so I won't comment more on that, only a part of how you described the program. \n\nIt seems to me that THEY are lucky to have YOU.",
      "author": "justus_trail",
      "created": 1588199113,
      "upvotes": 7,
      "replies": {
        "fp13uis": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp13uis/",
          "text": "Thank you! :)",
          "author": "_rainjacket",
          "created": 1588223662,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fp0jrv3": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0jrv3/",
      "text": "Advocating diversity for diversity’s sake will get you nowhere with people who want to discuss *ideas*, so you have to make this about ideas.\n\nDon’t advocate for tokens just to up some arbitrary quota, that angers the people the quota is foisted on and insults the people you’re tokenizing.\n\nDon’t make it about taking white male authors down a peg just for being white males, striking them from reading lists and lectures and whatnot. You’re just trading one exclusivity for another.  Instead make it about bringing new people (and overlooked people of the past) into the fold.\n\nHere’s what you do instead:\n\nCompile a list of books and authors you think ought to be included on their own merits who happen to be women, Hispanic, black, etc., and make the case for including their writings and ideas. Include more than just people on the left to show you have friendly intentions. Include people like John McWhorter and Thomas Sowell (talk about pioneering diversity, that guy has had an interesting career in a time when black academics were very rare), not *just* people like Cornel West and bell hooks. This is truly meaningful diversity.",
      "author": "TakeOffYourMask",
      "created": 1588210668,
      "upvotes": 1,
      "replies": {
        "fp14ixf": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp14ixf/",
          "text": "Another commenter made a similar remark about diversity simply for the sake of being diverse, and I think a lot of that is in the framing of the subject. I don't want to tokenize anyone, but I believe we have to make a conscious effort to include different perspectives and voices since everyone has some internal bias to work against. \n\nI'm currently working a list of suggestions, and I'm trying to get input from other students in the program. I would ideally like to have a wide range of opinions, races, etc. represented, but my personal lack of knowledge prohibits that a little. I can't suggest what I've never heard of (I'm 19 years old and from a tiny rural town that's 98% white, so it's not like I have a great background in diversity or have a ton of recommendations to whip out whenever anyone asks).\n\nThanks for mentioning some specific authors, and please let me know if you have others you'd recommend!",
          "author": "_rainjacket",
          "created": 1588224195,
          "upvotes": 1,
          "replies": {
            "fp197lf": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp197lf/",
              "text": "Zora Neale Hurston, Booker T Washington, WEB Dubois, and Roland Fryer (who I hesitate to recommend because of his sexual harassment but his research is still interesting).",
              "author": "TakeOffYourMask",
              "created": 1588228074,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fozn4g9": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozn4g9/",
      "text": "Would (suitably historical) suggestions of authors that would be for a philosophy curriculum help you make your case?",
      "author": "willbell",
      "created": 1588193435,
      "upvotes": 1,
      "replies": {
        "fp13wul": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp13wul/",
          "text": "Yes, I'm working on compiling a list of possible suggestions, but it's slow going since I really have no background knowledge on the subject.",
          "author": "_rainjacket",
          "created": 1588223715,
          "upvotes": 1,
          "replies": {
            "fp2fxru": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp2fxru/",
              "text": "I'll give you some suggestions:\n\n* Mary Astell's *A Serious Proposal to the Ladies, I & II* and *Some Reflections upon Marriage*\n* Masham's *A Discourse Concerning the Love of God*\n* Mary Wollstonecraft's *A Vindication of the Rights of Man* and *A Vindication of the Rights of Women*\n* Margaret Cavendish's *Observations upon Experimental Philosophy*\n* Elizabeth of Bohemia and Descartes' Correspondence\n* Anne Conway's *The Principles of the Most Ancient and Modern Philosophy*\n\nAstell and Masham in particular were writing at the same time and sometimes respond to each other and more \"canonical\" authors, like Locke and Descartes.  Wollstonecraft was so brilliant that even in her time she achieved a high level of notoriety, she is also the mother of Mary Shelley, known for *Frankenstein*.  She wrote in response to Burke and Rousseau.\n\nIf you're onto more recent times, i.e. 19th and 20th century, then there's so many that it shouldn't require someone who has made a point of looking into the topic to find good work by women and non-white people.  However one oft-overlooked figure who is a really awesome read is Edith Stein.",
              "author": "willbell",
              "created": 1588261082,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fozdnxd": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozdnxd/",
      "text": "Because of white males being the only ones who had access to higher education in the past, it is difficult to find much significant work by any woman or non-white person before 1940 in any field.\nSo if you're concerned about books that have been published since 1970-today, go ahead and research some and suggest them as material. But otherwise you certainly shouldn't study something just because the author is a ethnicity or gender that you prefer.\nImagine how you would feel as e.g. a native American woman giving a talk about her work at a uni, just to find out the only reason she was invited is because she's a woman and native American. People should be respected and exposed for their academic accomplishments no matter their ethnicity.",
      "author": "idk7643",
      "created": 1588188917,
      "upvotes": -11,
      "replies": {
        "fp00vvf": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp00vvf/",
          "text": ">it is difficult to find much significant work by any woman or non-white person before 1940 in any field.\n\nThis is shockingly ignorant. I hope you are simply an young person who hasn't yet had much experience in the world.\n\n/historian",
          "author": "SnowblindAlbino",
          "created": 1588200399,
          "upvotes": 14,
          "replies": {
            "fp05p01": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp05p01/",
              "text": "From their history:\n\n>I'm currently doing an undergraduate in Biomedical Sciences.\n\nSo yeah.. definitely a young person speaking way outside their knowledge base.",
              "author": "intirb",
              "created": 1588202967,
              "upvotes": 10,
              "replies": {
                "fp0bwti": {
                  "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0bwti/",
                  "text": ">definitely a young person speaking way outside their knowledge base.\n\nSo really too ignorant to even know they are ignorant yet. Hopefully they'll learn-- hopefully someone will teach them.",
                  "author": "SnowblindAlbino",
                  "created": 1588206306,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fozosit": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozosit/",
          "text": "> it is difficult to find much significant work by any woman or non-white person before 1940 in any field.\n\nDo you think that no Chinese or Indian person wrote significant works of philosophy before 1940? To name a few: Confucius, Mencius, Lao Tzu, Zhuangzi, Nāgārjuna, Vasundhu, and Kumārila. And this is not to mention Medieval Islamic philosophers. Non-white authors of philosophical texts are not difficult to find. Just check the [table of contents](https://plato.stanford.edu/contents.html) of the widely lauded *Stanford Encyclopedia of Philosophy.* Or you might consider the following:\n\n—http://www.bryanvannorden.com/suggestions-for-further-reading\n—https://blog.apaonline.org/2018/10/22/so-you-want-to-teach-some-chinese-philosophy/\n—https://blog.apaonline.org/2018/10/08/so-you-want-to-teach-some-indian-philosophy/\n—https://blog.apaonline.org/2018/09/03/so-you-want-to-teach-some-islamic-philosophy/\n\nWhat's expressed your quote may be the case in the history of \"Western\" or \"European\" philosophy, but it is not true of this history of philosophy *simpliciter.* \n\nWhat you've said is, unfortunately, true of women in many times and places.\n\nI agree with you, however, that it is probably best to engage with authors and justify their inclusion in terms of their internal intellectual merits, and in many cases race, sex, etc., count as no such things.",
          "author": "SailorBulkington",
          "created": 1588194248,
          "upvotes": 32,
          "replies": {
            "fozpovo": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozpovo/",
              "text": "It's ridiculous even if you're talking western/european philosophy.",
              "author": "mediocre-spice",
              "created": 1588194693,
              "upvotes": 19,
              "replies": {
                "fozqe5v": {
                  "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozqe5v/",
                  "text": "Can you educate me on this fact? \n\nI'm aware that much ancient Greek philosophy was written by \"Anatolians\" (folks from \"Asia Minor\" or the area approximate with modern-day Turkey), and I am aware of important important early-Modern philosophers who were women (for example, those whose works are collected in [this Hackett volume](https://www.hackettpublishing.com/philosophy/women-philosophers-of-the-early-modern-period)). I mentioned medieval Islamic philosophy, which may in large part be thought to be \"Western.\"\n\nBut I am not aware of much outside of that.\n\nEdit: Also aware of W.E.B. Du Bois, whose work many consider to be philosophy, even though as I understand it he eschewed being \"a philosopher.\"",
                  "author": "SailorBulkington",
                  "created": 1588195043,
                  "upvotes": 4,
                  "replies": {
                    "foztvci": {
                      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/foztvci/",
                      "text": "I'm not a philosopher myself, so don't know in detail -- but was specifically talking about the idea that there are no major works by women before 1940 in any field. That would leave out Cavendish, Wollstonecraft, de Beauvoir, du Chatelet in philosophy as well as Marie Curie and Ada Lovelace in science.",
                      "author": "mediocre-spice",
                      "created": 1588196772,
                      "upvotes": 14,
                      "replies": {
                        "fozuf7z": {
                          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozuf7z/",
                          "text": "Okay, thank you.",
                          "author": "SailorBulkington",
                          "created": 1588197050,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fp15fo4": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp15fo4/",
              "text": "I'm not engaging with the overall conversation here, but I just wanted to say thank you for the sources you've listed! I'll hopefully be able to use them when I compile my list of suggestions to bring to the staff.",
              "author": "_rainjacket",
              "created": 1588224917,
              "upvotes": 1,
              "replies": {
                "fp4nxnh": {
                  "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp4nxnh/",
                  "text": "You are very welcome. Best of luck, and please let me know if you have any questions. I'm happy to answer them.",
                  "author": "SailorBulkington",
                  "created": 1588303217,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fozp524": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozp524/",
          "text": "This just isn't true. Philosophy is more diverse in the last 50+ years, sure, but there's literally centuries of work by female and nonwhite philosophers. Unless OP's program is extremely narrow, there are prominent female & nonwhite philosophers they *should* be reading if they want a full understanding of the debate.",
          "author": "mediocre-spice",
          "created": 1588194421,
          "upvotes": 21,
          "replies": {}
        },
        "fozntej": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fozntej/",
          "text": "> Imagine how you would feel as e.g. a native American woman giving a talk about her work at a uni, just to find out the only reason she was invited is because she's a woman and native American.  \n\nNo need to imagine, this is how I get a voice at the table! It feels amazing because I get to be heard even though I don't have the right connections and don't look the part.  It feels amazing because it puts a new face on what an academic looks like for the next generation of scholars.  It feels amazing because it forces the rest of the academy to think twice about who they've been excluding.",
          "author": "Lamalaju",
          "created": 1588193770,
          "upvotes": 25,
          "replies": {
            "fp0klky": {
              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0klky/",
              "text": "You like that you’re not valued and invited for your ideas but for the racial box you check off...because it gets you a seat at the table?",
              "author": "TakeOffYourMask",
              "created": 1588211147,
              "upvotes": -2,
              "replies": {
                "fp0qi2o": {
                  "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0qi2o/",
                  "text": "I’m going to ignore your inability to read past the first sentence of my response and give you an honest answer anyways. \n\n\nMy ideas are valued, but only when I am listened to. The problem is that even in liberal academia people of color tend to be overlooked.\n\n\nThere are plenty of data out there on the preferential treatment that white folks get in many different academic settings.  From kindergarten to professorships. White folk are the defaults for seats at the table. So yeah, it’s nice to occasionally get a seat and have my good ideas heard. I’m often invited back.",
                  "author": "Lamalaju",
                  "created": 1588214698,
                  "upvotes": 5,
                  "replies": {
                    "fp184yf": {
                      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp184yf/",
                      "text": "I read everything you said.\n\nDoes the data show that people get preferential treatment *because* they’re white? Or is this happenstance?\n\nThe real problem, as I see it, is class, not race.  By accident (not design), because the way the academic job market works, it favors people from fairly affluent backgrounds. To oversimplify to illustrate my point, only people from rich families will stay to get a PhD (rather than start earning money with their BS), and only people from rich families will put up with spending 6-10 years doing postdocs (or worse, adjuncting) at random places until a TT position opens up. Because they’re not even worried about the lost years of earnings or having enough money. A similar dynamic goes on in show business, where you will find that lots of singers and actors come from money and can happily spend years pursuing a dream because they’re okay on money. Meanwhile at each rung more middle and lower class people drop out.\n\nI’m oversimplifying and I haven’t even address (comparatively) poor immigrants who will also put up with years of hardship because it’s their only way of staying in the country.\n\nBut where I’m going with this is that since wealth disparities persist across races (in aggregate) with white people and Asians at the top in this country then—ceteris paribus—if my analysis above is somewhat correct, then I’m not surprised to see that so many academics (especially from prestigious institutions) are white.",
                      "author": "TakeOffYourMask",
                      "created": 1588227149,
                      "upvotes": 1,
                      "replies": {
                        "fp1f7h8": {
                          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp1f7h8/",
                          "text": "The data specifically shows preferential treatment.  Not better outcomes (which also yes) but preferential treatment. This is an entire body of social science literature.\nHere’s a start for you: https://link.springer.com/article/10.1007/s11199-019-01052-w\n\nJust a tip, explaining your personal thoughts on socioeconomic disparity to a POC academic based on zero evidence isn’t really a good look. You have a lot of incorrect assumptions going on, perhaps look into the subject further before you assume any type of mastery of it.",
                          "author": "Lamalaju",
                          "created": 1588233494,
                          "upvotes": 4,
                          "replies": {
                            "fp1n7oi": {
                              "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp1n7oi/",
                              "text": "That’s a disturbing study. Do you have data on things like hiring and promotion rates of black applicants?",
                              "author": "TakeOffYourMask",
                              "created": 1588241385,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fp0ke6n": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0ke6n/",
          "text": "I agree with the gist of your argument but you overstate your case.",
          "author": "TakeOffYourMask",
          "created": 1588211029,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "fp0v2cb": {
      "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp0v2cb/",
      "text": "Conservative raised by a liberal academic(different ideas were encouraged if you can't guess) with an opinion \n\nFind those who have merit and a track record of respect across liberal and conservative platforms.  If you bring a left leaning scolar to me who has only left leaning ideas, I will not be happy.  I want the full idea.  I want the potential philosophy professor who can speak to the liberals, conservatives and future libertarians in the group.  Or, the women's lib teacher who can phrase the debate of women's autonomy across Kentucky coal mountain conservation viewpoints to much left leaning big city ideals.  \n\nThis will not be easy, but people will respect you for doing this work.  I personally hope you post more about your goals and steps because this is an extremely important undertaking.  \n\nBest of luck!",
      "author": "Nopenotme77",
      "created": 1588217574,
      "upvotes": 0,
      "replies": {
        "fp13tmy": {
          "link": "/r/AskAcademia/comments/gac6r2/how_do_i_approach_my_conservative_scholarship/fp13tmy/",
          "text": "Thank you!\n\nI'm currently working on a list of recommendations to bring to the staff, but it is difficult since I am 19 years old and know of very few philosophers. If you have any suggestions, I will gladly take them!",
          "author": "_rainjacket",
          "created": 1588223644,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}