{
  "sid": "r4x7eo",
  "link": "/r/AskAcademia/comments/r4x7eo/what_should_i_expect_from_my_advisor_it_seems/",
  "title:": "What should I expect from my advisor? It seems like she doesn't have any interest in my work",
  "text": "Hi,\n\nI'm in the process of writing my thesis. My advisor is good at her work and I think she is a good person as well. But for the last couple of weeks it seems like she has zero interest in my work. She hasn't returned to my email from I think two weeks ago (not the first time) and I feel like when I try to communicate, I'm forcing her to do something she doesn't want. Obviously she might have personal issues and she is a very busy person but I feel like I'm not doing enough if I let things go like this. So I'm still trying to set meetings on the days we agreed on meeting at the beginning of the term. \n\nI think if I'm incompetent and she doesn't want to be my advisor she should just tell me. Or if she's having personal issues, shouldn't she notify me and we could have longer breaks between our meetings?\n\nThanks to the pandemic I only have contact with two other students but I don't feel comfortable asking them so I'm asking here.\n\nI'm really sad and I don't know what to do. I honestly think she just gave up and I should look for a new advisor. But this will cost me time and there isn't anyone who's working on a similar subject in my department and I'm not even sure how to do that.\n\nAny advice is much appreciated.",
  "author": "Major-Initiative4756",
  "created": 1638196699,
  "updated": 1638479855,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmku6il": {
      "link": "/r/AskAcademia/comments/r4x7eo/what_should_i_expect_from_my_advisor_it_seems/hmku6il/",
      "text": "Hi! I am wondering if your colleagues are also experiencing this? I think it would be best if you could talk to her first, why did she give up on you and etc. If the project is done and you and writing, i do not understand it. Or maybe she is thinking that you are a senior, almost-done grad student and you should be more independent from her point of view?",
      "author": "cozy-scholar",
      "created": 1638220007,
      "upvotes": 1,
      "replies": {
        "hmnblzw": {
          "link": "/r/AskAcademia/comments/r4x7eo/what_should_i_expect_from_my_advisor_it_seems/hmnblzw/",
          "text": "Yes I think I should find an appropriate way to ask her. The project is going on for a while but there's still long way to go. \n\n>you should be more independent from her point of view?\n\nyou might be right. I'm trying to have regular meetings even though I don't have much to show. It's easier for me to be motivated that way and stay on track. Maybe the right thing is not to show until I got something substantial. \n\nthanks for the reply!",
          "author": "Major-Initiative4756",
          "created": 1638267858,
          "upvotes": 2,
          "replies": {
            "hmnf7tt": {
              "link": "/r/AskAcademia/comments/r4x7eo/what_should_i_expect_from_my_advisor_it_seems/hmnf7tt/",
              "text": "I think you should have a chat with her about ways of working. Be open and say you prefer meeting in person to discuss progress and results and ask what works best for her? You can also say you feel you have a lot of questions but you don't want to bug her so what would be the best way for her for you to ask them? I like my people to save up as many questions for our 1:1s as possible so that I'm not handling a deluge of not urgent questions and so I don't have to reply by email except for the really important stuff. \n\nPIs are humans. They've also had a rough pandemic and many people are just exhausted. Sometimes you need to just bite the bullet and be direct (but kind) and say what it is you want. If you're having meetings and she's not sure why or what it is you want she may be just peddling through them and isn't really getting what you're trying to achieve. Ideally she should be thinking about this stuff and directing you more but sometimes you just have to manage your manager.",
              "author": "ACatGod",
              "created": 1638270890,
              "upvotes": 1,
              "replies": {
                "hmnwmj0": {
                  "link": "/r/AskAcademia/comments/r4x7eo/what_should_i_expect_from_my_advisor_it_seems/hmnwmj0/",
                  "text": "This is helpful, thank you. I think she might give me some explanation. In any case I'll go to the next meeting more prepared, gathering my thoughts and questions about the process.",
                  "author": "Major-Initiative4756",
                  "created": 1638281495,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}