{
  "sid": "hbyv6d",
  "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/",
  "title:": "Anxiety and procrastination of reading papers.",
  "text": "Hey all. I've always had a problem with reading papers, and I was wondering if anyone here could relate/give advice. \n\nIt's not that I struggle to understand research papers, I just seem to get a bit freaked out when I'm faced with a big paper.. I feel anxious to start reading it because it's just so MUCH information. Then I just open a new tab and distract myself to reduce my anxiety. Either that, or I'll start reading it and the author will cite a load of other papers that sound interesting... leading me to open those up too. I then have like 6 papers open at once and it feels like it's just too much. \n\nSo far this hasn't affected my performance or anything, and I've always scored well when I was a student. However, I feel as though I could be doing better if I could overcome this issue. How can I stop doing this or manage it better?",
  "author": "leftflowers_art",
  "created": 1592565332,
  "updated": 1634081347,
  "over_18": false,
  "upvotes": 137,
  "upvote_ratio": 0.99,
  "comments": {
    "fvbu9jm": {
      "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvbu9jm/",
      "text": "Print it out. Sit down and go through it with a pen marking the important/relevant bits, making notes in the margins and if there's something you don't understand skim those references to see if they are worth going through in detail.  It's totally fine and probably normal to be reading a couple papers at the same time ie. Be 20% through paper A, 50% of paper B and just starting paper C.  A good paper takes multiple reads to get everything in it so dont worry about having to read some parts several times.  \n\n\nIf your finding several papers in the references that sound interesting, good! You're really interested in the subject. Check if they are decent papers with a quick skim, and you can put them aside for when you have time. Of course you'll need to act on your own ideas at some point rather than just read an infinite number of papers, but you'll know when this comes.",
      "author": "slick3rz",
      "created": 1592566942,
      "upvotes": 55,
      "replies": {
        "fvfacxr": {
          "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvfacxr/",
          "text": "Okay, this has made me feel a bit more relaxed about it, to be honest! Thank you. I think printing it would be really helpful for me, I wish I had more printer credit...",
          "author": "leftflowers_art",
          "created": 1592642755,
          "upvotes": 1,
          "replies": {}
        },
        "fvfcxgy": {
          "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvfcxgy/",
          "text": "> making notes in the margins and if there's something you don't understand skim those references to see if they are worth going through in detail. \n\nI'm not OP. This is what I've always been doing. My problem lies elsewhere: tidying up those notes to a coherent, comprehensible interesting stuff to work on or to be cited later.\n\nI'm currently using Zotero. I've been copy-pasting my notes to each items I added in Zotero. I've used tags, but I still feel like my notes are scattered. Any tips for better organization?",
          "author": "SeveralDumbQuestions",
          "created": 1592645490,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fvcwqwl": {
      "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvcwqwl/",
      "text": "This is a natural reaction - the ever-expanding body of information most of us access daily in our fields is simply more than we can process. You might find the following helpful, however:\n\n1. Read the abstract, then read the conclusions, then stop. Make **written** (not typed) notes on the main research question(s), methodology, and basic findings. Leave the article and go do something else for 30 minutes (eat a cupcake, drink wine, do some yoga). Associate the reading with something positive to quell your anxiety.\n2. Turn off your wi-fi, close any unneeded tabs on your desktop. **Without accessing your notes**, see if you can articulate one or two of the main points/questions you read earlier. If you can't, read the abstract/conclusion again. This time you don't get a cupcake.\n3. Dive into the first 2-4 pages. Access your original notes and create an outline. As you read, you want to see if you can fashion the same information structure as the author, noting key arguments and findings along the way. Make the reading as interactive as possible.\n4. Do **not** (and I really mean it) go chasing down the author's source material while you're slogging through the article, even if something strikes you as the most interesting thing you've ever seen or most pressing question that's ever occurred to you. Following those rabbit holes feeds your avoidance. Make a note of the source/your question. You can return to these later, but only after you've completed the task at hand.\n5. Follow the above strategy as your work your way through the article or chapter. When your focus wanders, try to bring it back. If after 15 minutes it's not working, do something else for a while. Put a time limit on your breaks and don't use them to web surf. Get back to the reading as soon as you are able.\n6. At the end of the week, quiz yourself. If you've read an article a day (or a book chapter a day), see how much you've retained by writing brief synopses of each work.  In many fields, you will not have the same kind of testing that regularly requires demonstration of knowledge that you had as an undergraduate. You must monitor this on your own.\n7. Shake hands with the reality that reading shallowly contributes to your anxiety. The above process takes time, but it is infinitely more valuable to you than \"reading\" 200 pages and retaining nothing.\n\nI've taught graduate students in the U.S. and in Germany and have noticed significant cultural differences in the two academic arenas.  In the U.S., we often under-educate our undergraduates and then stuff our Master's and Ph.D. students to the gills with information, encouraging them to incorporate as much data as possible within a few scant years, asserting at the end that the process is more important than the actual retained knowledge. The process I've experienced in Germany is slower and more focused on deep learning. It is also less tolerant of \"intellectual off-roading,\" which can have both positive and negative effects.\n\nWhile I do not know where you are studying or the field in which you work, I would advise you to protect your own cognitive space - and peace. You cannot learn every bit of information you encounter, so relieve yourself of that burden. Instead,  develop strategies to learn deeply, to assess what information is really needed to reach your goals, and to alleviate the anxiety that transforms a subject you love into something you cannot bear. When you make these your priorities and carry them forward into your career, you'll make important cultural and institutional changes of your own.\n\n**\\*\\*Edit\\*\\* Thanks for the gold, kind stranger! Made my day.**",
      "author": "pierrotlunette",
      "created": 1592588557,
      "upvotes": 58,
      "replies": {
        "fve1n0v": {
          "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fve1n0v/",
          "text": "I follow some of these already, and hope to incorporate others.\n\nHowever, I believe that typed notes are better since they can be easily searchable for reference in the future. But I make sure to type things rather than copy paste.\n\nThank you.",
          "author": "pecey",
          "created": 1592610004,
          "upvotes": 4,
          "replies": {
            "fvqqztr": {
              "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvqqztr/",
              "text": "Late response to this, but you bring up a good point. I tend to think of handwritten notes and typed notes as different animals. To put it inelegantly,  I use the former to \"inscribe\" information on my brain, while I use the latter for indexing and later reference. I also differentiate between handwriting and typing in order to weed out important information. If something makes it into my typed synopses, it means I've decided it really is worth noting and referencing later.\n\nWhen completing my graduate work, I typed the majority of my notes and tended to make notes on *everything* (and follow every cool rabbit hole, similar to the original poster). This was because I wasn't yet certain what was truly important and what wasn't, but it also meant I wasn't actively training myself to discern the important info. Others may be more readily adept at this, but it took me some time to develop a system.\n\nSo - I definitely agree with you that typed notes are superior as long-term reference *documents*. I also think that handwriting plays an important part in the actual learning/incorporation process needed for forming memories (a useful study comparing the two strategies can be found [here](https://d1wqtxts1xzle7.cloudfront.net/39044710/JoWR_2015_vol7_nr2_Mangen_et_al.pdf?1444246013=&response-content-disposition=inline%3B+filename%3DMangen_A._Anda_L.G._Oxborough_G._and_Bro.pdf&Expires=1592922694&Signature=SM6p12VXWZkHnJjtmb8FrVImnqq58bgVw1RVTWegXkHt7aDlGLVBmUchW0VZcMxCmexRwM8XZ7LYXcM~UXQff2hwVMgq9cvcEqM1qGpgH17WS8N05hRAG3U-1527zQft8lP-pBO5knAxgdJbHgkPZRL0t-ghiYoJqNdhrYslyaKlBJGILXkAFf~0Y1qHEojKH~uCgQ4oVbBbreQBFH1JU70DvHg0fBG0u4-QWTE3GjaOj78Y4wmY3I2FMbasxl9TsYJM3fTAs548PBQonW3wZuCSn94mW~Y2lVhElkQcGQscGNooifXpHFdzL0goXnGOD3pl9R2GK9Fbx3VCKcH1XQ__&Key-Pair-Id=APKAJLOHF5GGSLRBV4ZA)). Whatever method(s) you use, I wish you success!",
              "author": "pierrotlunette",
              "created": 1592920045,
              "upvotes": 1,
              "replies": {
                "fvsg7qm": {
                  "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvsg7qm/",
                  "text": "I guess I am in a similar position where I am making notes on everything. Did you figure out  a way to train yourself to be able to discern the important info? Or as with most things, it came with experience?",
                  "author": "pecey",
                  "created": 1592950366,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fvdtban": {
          "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvdtban/",
          "text": "Very well-written! I learned a lot. Thanks very much.",
          "author": null,
          "created": 1592605215,
          "upvotes": 3,
          "replies": {}
        },
        "fvfald0": {
          "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvfald0/",
          "text": "Thank you so much for this response, this is all extremely helpful! I'll definitely use the method you've recommended, it sounds like it would help me a lot.",
          "author": "leftflowers_art",
          "created": 1592643001,
          "upvotes": 2,
          "replies": {}
        },
        "fvf44w0": {
          "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvf44w0/",
          "text": "RemindMe! 12 hours",
          "author": "echouchoutime",
          "created": 1592636589,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fvcsbr9": {
      "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvcsbr9/",
      "text": "I made it a game for myself to see how I could relate each paragraph/ argument to what I already knew and how i could improve upon it. \n\nThe gamification helped get over anxiety and also acted to help me develop better research skills.",
      "author": "Cantos",
      "created": 1592586390,
      "upvotes": 9,
      "replies": {
        "fvfanmy": {
          "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvfanmy/",
          "text": "That's a really interesting approach, I've never considered that. Thank you!",
          "author": "leftflowers_art",
          "created": 1592643069,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fvcnze5": {
      "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvcnze5/",
      "text": "Break it down into smaller more manageable chunks. For instance maybe you’re first time opening the paper all you’re going to do is read the abstract and all the intros for the different sections. Then the second time maybe you pick specific sections to read etc... \n\nTakes some adjusting on how much to do in a single sitting, but makes starting easier and that’s usually half the battle.",
      "author": "beeskness420",
      "created": 1592584235,
      "upvotes": 4,
      "replies": {
        "fvfarm7": {
          "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvfarm7/",
          "text": "I think breaking it into chunks is something that will definitely help. Thank you!!",
          "author": "leftflowers_art",
          "created": 1592643186,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fvd9t7k": {
      "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvd9t7k/",
      "text": "I’ve had the same problem. I think I have a hard time getting into the zone. It’s important to be able to stop at every section and reiterate to yourself their points. Another thing that I’ve found helpful is using a text to speech app. When I don’t feel like reading, I have the app read it to me while my eyes follow along with the words and I have another tab open to the same paper on another screen following the figures. It really really helped with the activation energy.",
      "author": "sadphdbro",
      "created": 1592595030,
      "upvotes": 3,
      "replies": {
        "fvd9w92": {
          "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvd9w92/",
          "text": "I’ve also started using Mendeley as my paper organizer. Thanking notes on it has gotten a lot easier.",
          "author": "sadphdbro",
          "created": 1592595072,
          "upvotes": 2,
          "replies": {}
        },
        "fvfaurd": {
          "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvfaurd/",
          "text": "I have a text to speech app too, It's been really helpful.",
          "author": "leftflowers_art",
          "created": 1592643279,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fvdccvr": {
      "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvdccvr/",
      "text": "What’s helping me is literally a task a day. One article, two articles, one hour on lit review reorganization, and one hour to figure out how to do weighting for a GLM that makes sense. \n\nAlso going through with apps and figuring out what must be done to fit my advisor’s expectations. Weekly meetings help.",
      "author": null,
      "created": 1592596265,
      "upvotes": 3,
      "replies": {}
    },
    "fve0u48": {
      "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fve0u48/",
      "text": "If it’s a paper that’s *really* important to me, I’ll read it aloud and record it to playback later. (I use Audacity.) I find that the process of reading aloud makes me pay attention and think about what I’m saying. Then, if I need to review it, I can play back my recording. I find that once I’ve read it aloud properly, I understand it much better than the several half-arsed readings I’ve probably done before that.",
      "author": "WillyNilly_AU",
      "created": 1592609533,
      "upvotes": 3,
      "replies": {
        "fvfawbo": {
          "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvfawbo/",
          "text": "I've never tried that before, sounds like a good idea! Thank you.",
          "author": "leftflowers_art",
          "created": 1592643326,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fvdasef": {
      "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvdasef/",
      "text": "1. Havening technique \n\n2. Sedona method \n\n3. Pomodore technique \n\n4. Reading as game, give your serf reword after you finish chapter. Or say it dosnt need to be perfect I will just read it for fun to see what is it all about. \n\n\n5. When you make notes mark at the end what you need to check later when you finish pomodore. \n\n6. Ask questions when you read so you are active with material and not just passive collector. Your notes need to be yours, not just record of author thinking. Thats how people write article fast, they start writing will reading.",
      "author": "goranstoja",
      "created": 1592595511,
      "upvotes": 2,
      "replies": {}
    },
    "fvdsyb9": {
      "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvdsyb9/",
      "text": "People who publish are your peers from the bar who were able to write down their thoughts and collect data on it. They aren't exemplars, but they're your contemporaries.\n\nIf you're reading for insight, it's not much more than talking at a bar. If your reading to develop your research question, ask what could affect what you find or where it could be applied to.",
      "author": "TBDobbs",
      "created": 1592605014,
      "upvotes": 2,
      "replies": {}
    },
    "fvdt2lu": {
      "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvdt2lu/",
      "text": "Seems like you need to up your reading quantity and quit worrying so much about information uptake. Read 50 papers fast over the course of a month, then go back and read a few that struck you more carefully. You may be surprised what you picked up.",
      "author": "herbertwillyworth",
      "created": 1592605081,
      "upvotes": 2,
      "replies": {}
    },
    "fvdyd4l": {
      "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvdyd4l/",
      "text": "I have the same problem. Reading papers is my least favorite task, even when I'm interested in them. Partly it's just that academic papers tend to be written with an emphasis on conveying information and not readability (at least in science). I don't have a good solution, my list of papers to read grows ever longer....",
      "author": "queennbee",
      "created": 1592608085,
      "upvotes": 2,
      "replies": {}
    },
    "fvf9epw": {
      "link": "/r/AskAcademia/comments/hbyv6d/anxiety_and_procrastination_of_reading_papers/fvf9epw/",
      "text": "I tend to find research papers relaxing because they're so formulaic. When I see an APA title page, I know more or less exactly what to expect over the next 3-30 pages.\n\nI write 15-20 page papers pretty regularly. Most of it is making an outline first and then filling in all the sections. Research papers are a lot like intake forms or job applications in that you start with your personal information then work your way through section after section.\n\nIf you're getting overwhelmed, don't think of it as reading one large paper, but numerous chunks that amount to a paper.",
      "author": null,
      "created": 1592641779,
      "upvotes": 2,
      "replies": {}
    }
  }
}