{
  "sid": "azdu1s",
  "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/",
  "title:": "I think I need to quit my PhD. How can I do this respectfully and professionally?",
  "text": "I am currently a first year PhD student and I think I need to quit my program. When I got to my senior year of undergrad I had no idea what I wanted to do with my life. In a panic I applied to grad schools and somehow got accepted. I have no real research experience and had no idea what I was getting into. \n\nIn my first year my grades have been good and my PI is happy with my performance. However,  I’m extremely unhappy. I dread going into the lab, I generally dislike the people I work with, and I just can’t see myself doing this 10 years from now. I have no motivation to do work and that is something I’ve never experienced before.  I sleep for a minimum of 10 hours at a time and I don’t feel rested. I think I’m becoming depressed, I feel myself beginning to slip and I need to leave.\n\nHow can I do this without burning bridges? I respect the hell out of  my PI, but this isn’t for me. Any advice would help. \n\nThanks for reading.",
  "author": "Mr_Mancandy",
  "created": 1552207319,
  "updated": 1634081894,
  "over_18": false,
  "upvotes": 105,
  "upvote_ratio": 0.98,
  "comments": {
    "ei74gdf": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei74gdf/",
      "text": "Hey, I'm sorry you're struggling with your mental health so much. It's actually a great thing that you're deciding to put yourself first, so dont feel ashamed about that. Many postgraduates fall into the trap of thinking it's normal to feel that way and end up doing some damage to themselves, so yes absolutely take time for yourself to get better.\n\n\nAs for your programme, honesty is always the best way to handle this. Of course there's no need to say \"I hate everyone and dread coming in\" but sitting your PI down and saying that you are struggling with your mental health and you think you leaving would be best for both you and the lab is not you burning bridges by any means. Of course stay respectful and only reveal as much personal stuff as you feel comfortable to, but be honest. I think your PI may just suggest you take a sabbatical and then try to come back. As horrible as this situation is, unfortunately it just happens.",
      "author": "LillFeather",
      "created": 1552208890,
      "upvotes": 105,
      "replies": {
        "ei7h1nm": {
          "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei7h1nm/",
          "text": "Agreed. Only thing to add is to go to health services on campus or your doctor to get help with what you are going through. You don't have to face these mental issues alone. \n\nHope you end up better in the end, with whatever path you end up taking.",
          "author": "mtb_addict",
          "created": 1552227463,
          "upvotes": 26,
          "replies": {}
        }
      }
    },
    "ei7ieid": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei7ieid/",
      "text": "I want to add to everyone else's comments that people drop out of PhDs pretty frequently. It's practically impossible to really know what you're getting into and the first year shock is real. If you're polite and respectful I don't think you have to worry. I'm sure people will be disappointed, but they probably won't be upset and perhaps not even surprised. ",
      "author": "Dr_Pizzas",
      "created": 1552228805,
      "upvotes": 36,
      "replies": {
        "ei8yo4f": {
          "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei8yo4f/",
          "text": "Agreed. Don't beat yourself up over quitting after your first year. It's far better to quit now than to spend precious years of your life doing something you hate. The PhD process is hard enough when you love it. A lot of folks who quit PhD programs don't do so until they're all the way through coursework. Do yourself a favor and move on now. \n\nBut first, make use of your campus health care and counseling services to get evaluated and treated for depression. Then make use of your campus career development office figure out some fields of work you might actually want to pursue.\n\nDon't think of this as a failure--think of it as an experiment that gave you information about what you do and don't want to do with your life. ",
          "author": "tyrannothesaurus",
          "created": 1552269028,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ei7hcaw": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei7hcaw/",
      "text": "Honestly I'm half way through my PhD and feel incredibly stressed, depressed and drained all the time. I respect the hell out of someone who can, very early on, identify when a path isn't right for them. I'd agree that taking a break is good - often just stepping back and giving yourself time to not think about it either gives you renewed interest, or clarifies that your purpose is elsewhere. Any academic knows what it is like to feel as you feel, especially someone who has worked their way up the ladder to be a PI. I'd let them know you respect them and your work, but that issues in your personal life and/or mental health (however much you feel like sharing) mean you need to take a step back. It's important to remember that your *life* and *health* come before any 'career path.'",
      "author": "thelondonjets",
      "created": 1552227762,
      "upvotes": 22,
      "replies": {}
    },
    "ei7ont0": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei7ont0/",
      "text": "[deleted]",
      "author": null,
      "created": 1552234162,
      "upvotes": 20,
      "replies": {
        "ei8yct2": {
          "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei8yct2/",
          "text": "I would agree if OP said they were super interested in research before they were in grad school. However, they said they entered a PhD because they didn't know what to do with thier life, so a PhD may not be worth pursuing.",
          "author": "LogicalOtter",
          "created": 1552268769,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ei77ten": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei77ten/",
      "text": "Have you ever taken a few months break? That's what I did. I left my thesis untouched for a few months and I went and did everything I wanted to do. In the end, I came back feeling like a completely different person and a renewed sense responsibility for my thesis. Not trying to paint a really beautiful picture of what a break can do but if you haven't taken a break, I would highly suggest that.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
      "author": "givemeyourdonut",
      "created": 1552214931,
      "upvotes": 24,
      "replies": {}
    },
    "ei762gb": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei762gb/",
      "text": "If you really need or want to do it, best luck first and foremost. How? Be honest and open. Do not make anyone feel guilty (and I mean even though they may even slightly be). Explain your feelings and your situation. That's pretty much it. A reasonable boss/advisor/whatever will totally understand. If not, it's their business, you have been honest and respectful. ",
      "author": "9december3",
      "created": 1552211797,
      "upvotes": 9,
      "replies": {}
    },
    "ei7pn29": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei7pn29/",
      "text": "First and foremost, I would say get assistance for your mental health issues. After you have started to get help, really think about if it’s your mental health that is making you hate your PhD or your PhD that is affecting your mental health. It sounds like you did not have a strong drive to get a PhD and you just did it because you didn’t know what else to do. I did the EXACT same thing, and it’s refreshing to hear I am not the only one.  I’ve been on the verge of dropping out many times. For better or worse, I pushed through and am almost done. If you decide a PhD is really not for you, then you just go your advisor and tell them nicely that this is not for you. You do not have to tell her/him that it’s because of mental health. If you truly think you would be happier doing something else, tell your adviser that",
      "author": "grfhoyxdth",
      "created": 1552234925,
      "upvotes": 6,
      "replies": {}
    },
    "ei7tq9n": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei7tq9n/",
      "text": "OP, talk to PI. Tell them what’s going on mentally and motivationally. \nFinish off the year, then ask if you can have a month off in the summer to reflect, sit back and relax and come back. If by then you’ve decided it isn’t for you, quit. \n\nIf your PI is insensitive, seek higher ups and it could be an indication that they’re not the right person to work with. \n\nEdit: Added on using the help with some comments below.",
      "author": "DoctusCerebrum",
      "created": 1552237967,
      "upvotes": 5,
      "replies": {
        "ei7yx2z": {
          "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei7yx2z/",
          "text": "This is the best advice. Sometimes you don't even need a breather but just change in project/lab/etc. I think discussing with PI is step 1. If PI is a dick and doesn't help, then alternative solutions (which may include quitting) could be an option.",
          "author": "MarshmallowsOnAGrill",
          "created": 1552241688,
          "upvotes": 6,
          "replies": {}
        },
        "ei81wxf": {
          "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei81wxf/",
          "text": "I like this advice. I would not rush into make a decision, and your PI will respect you for thinking it over.",
          "author": "OutplayOutlast",
          "created": 1552243824,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ei7nt28": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei7nt28/",
      "text": "You don't need to spill your guts to your PI (i.e. tell your deepest, darkest secrets) but you do need to clue him/her into what is going on. Burning bridges happens when you pull out the rug from someone and they are blindsided. Open communication is best.\n\nYou aren't the first PhD student to cope with depression.",
      "author": null,
      "created": 1552233474,
      "upvotes": 5,
      "replies": {}
    },
    "ei7y9da": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei7y9da/",
      "text": "Most campuses have mental health assistance of some kind.  I encourage you to seek it out.  Even if leaving the porgram makes you feel better about somethings, it could contribute to your depression.  You are being brave by taking action, but make sure you have some assistance to help you figure out what comes next in your adventure.\n\nIdeally a professional can also help you figure out the best way to make the decision.  \n\nGood luck!",
      "author": "Ethnographic",
      "created": 1552241222,
      "upvotes": 2,
      "replies": {}
    },
    "ei95465": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei95465/",
      "text": "Lots of good advice here already. Let me just add one thing you might want to consider:\n\nWhen we've had students decide they wanted to leave before finishing the PhD, a number have been able to transfer into the MA program. You might be able to get a master's in another year (maybe even less), and some programs have a 'non-thesis' master's option, where you'd take an exam or something similar rather than doing original research. Worth asking the administrator that supervises the graduate program you're in, at any rate. ",
      "author": "quietlysitting",
      "created": 1552274544,
      "upvotes": 2,
      "replies": {}
    },
    "ei75cla": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei75cla/",
      "text": "What PhD is ten years??\n\nBut OP you just talk to them. They’ll understand.\n\nAlso don’t be afraid to see help! Grad school is stressful and we’re a population frought with depression. ",
      "author": "MrLegilimens",
      "created": 1552210486,
      "upvotes": 6,
      "replies": {
        "ei787an": {
          "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei787an/",
          "text": "I think OP meant more about the career path, becoming a researcher.\n\nThough OP does not need to stay in an academic career once the PhD ends.",
          "author": "anotherbozo",
          "created": 1552215606,
          "upvotes": 23,
          "replies": {}
        }
      }
    },
    "ei8gw1m": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei8gw1m/",
      "text": "I just want to add a facet that hasn't been touched on. Your PhD lab isn't a good indication of how science has to be. If you stay in academia, you'll end up going to a different lab (potentially a number of different labs) for postdoc and you can do something totally different with all new people in that lab and a new PI who is hopefully as great as your current PI. If changing any of this sounds appealing, you should consider trying to either change labs or sticking through until you can go to a new lab for a postdoc.\n\nIf, however, you just don't like the though of doing research or being in academia, then more power to you. I absolutely do not want to disuade you from quitting if it's making your life hell. I just want to let you know that labs and research topic and coworkers can change.",
      "author": "icantfindadangsn",
      "created": 1552254911,
      "upvotes": 1,
      "replies": {}
    },
    "ei8l92q": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei8l92q/",
      "text": "What is it like in the lab?",
      "author": "idster",
      "created": 1552258281,
      "upvotes": 1,
      "replies": {}
    },
    "ei7jame": {
      "link": "/r/AskAcademia/comments/azdu1s/i_think_i_need_to_quit_my_phd_how_can_i_do_this/ei7jame/",
      "text": "OP, you need to talk to your PI and he'll have a better sense of how to handle it. Probably moving you to a different problem that you'll like would be a better answer. And urm, you are lucky to be getting minimum of 10 hours of sleep, I'm usually on 6-8 hours myself. :D",
      "author": "thnok",
      "created": 1552229649,
      "upvotes": 1,
      "replies": {}
    }
  }
}