{
  "sid": "r2ffbc",
  "link": "/r/AskAcademia/comments/r2ffbc/how_to_add_a_cosupervisor_after_already_starting/",
  "title:": "How to add a co-supervisor after already starting?",
  "text": "Hello all!\n\nI'm in my first semester (out of 2 years) of a master's program. I currently have a supervisor, but I would like to get a second supervisor. I am not sure how to ask my current/primary supervisor about this or how to approach the second professor either.\n\nI would like to get a second supervisor for the following reasons:\n\n\\- I realized that I would like to pivot my thesis topic to something different from what I initially discussed with my current supervisor, though I haven't begun work on it yet since I am mostly finishing required courses at the moment. This new direction would be at the intersection of these two professors' areas.\n\n\\- My current supervisor is extremely busy and does not have much time to meet regularly (it's a running joke that nobody knows where they are at any given moment). The second professor I would like to ask for supervision is a new hire, building up their lab, has few students and provides a lot of time and support for their research students.\n\n\\- I took a couple of classes with the second professor, and I just generally like them for their research interests, vision and involvement in things besides being a professor. It seems that working with them would help me achieve my goals for what happens after grad school.\n\nDoes anyone have experience with this?\n\nThanks!",
  "author": "comp-scomp",
  "created": 1637903229,
  "updated": 1638206321,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hm59ust": {
      "link": "/r/AskAcademia/comments/r2ffbc/how_to_add_a_cosupervisor_after_already_starting/hm59ust/",
      "text": "This doesn't sound like you want a second supervisor, but a different one. Is the first supervisor at all useful in this new direction you want to take?",
      "author": "OrbitalPete",
      "created": 1637927750,
      "upvotes": 3,
      "replies": {}
    },
    "hm58jme": {
      "link": "/r/AskAcademia/comments/r2ffbc/how_to_add_a_cosupervisor_after_already_starting/hm58jme/",
      "text": "I would handle this by working up my research proposal first (don't go nuts - just have a high level overview). I'd also make sure the proposal isn't dependent on supervisor number 2.  Then I'd go one of two ways I'd either sound out supervisor number 2 informally to see if they'd be interested while being clear about the situation. Or I'd sit down with supervisor number one and explain I've been rethinking the research direction, I'm excited about this new idea, explain the proposal. I'd guage the reception - if it's bad, no point discussing supervisor 2. If it's good, I'd then say I think supervisor 2 is interested in this area, do you think it would be beneficial if they provided some mentoring additional supervision? If I hadn't gone to number 2, I'd then go talk to them and see if they're interested.\n\nUltimately, it's about communication but also being respectful of the other person's commitment already to you. You're almost certainly going to need to do this face to face.",
      "author": "ACatGod",
      "created": 1637926675,
      "upvotes": 2,
      "replies": {}
    },
    "hm5lrbl": {
      "link": "/r/AskAcademia/comments/r2ffbc/how_to_add_a_cosupervisor_after_already_starting/hm5lrbl/",
      "text": "Us supervisors do this as part of our job -- we get paid to do this. Adding 100 % more spending on you may not be a thing.\n\nThat being said, all parties involved benefit from the best fit.",
      "author": "molobodd",
      "created": 1637935609,
      "upvotes": 1,
      "replies": {}
    }
  }
}