{
  "sid": "r8sl1z",
  "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/",
  "title:": "Search Committees: What Do You Want to See After a Successful Second Round?",
  "text": "I had a second round full-day interview with a private liberal arts college and thought it went great. I felt connected to everyone I met and interviewed with and even though it was 9 hours of virtual meetings, I ended the day feeling very energized and optimistic. Based on advice from others, I sent a personalized thank you to each person I met the next morning, but now I'm second-guessing those emails. The replies I received have been encouraging, but I feel like I may have leaned too heavily into my emotional investment and overshared my enthusiasm.\n\nFor those of you on hiring committees, do you expect any sort of follow-up from short-listed candidates after their full-day interviews? If so, what do you want/hope to see?\n\nAs an aside: Is it really for entire committees and departments to put a smile on and keep candidates encouraged throughout the process? I seriously did not expect so much positive engagement throughout the day, but since I don't have a ton of second-round interview experience, maybe that's the norm?\n\nFirst post here. Thanks in advance for any advice.",
  "author": "bossymandias",
  "created": 1638633543,
  "updated": 1639515631,
  "over_18": false,
  "upvotes": 37,
  "upvote_ratio": 0.94,
  "comments": {
    "hn7hifu": {
      "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn7hifu/",
      "text": "The follow-up thank you email is all I would recommend. Don't be discouraged if their replies are lukewarm. It's a busy time of the semester and they might not have the time or capacity for a more thoughtful response. \n\nWe always try to be as encouraging and enthusiastic as possible during the interview. If we end up making an offer, we want the candidate to accept. We're trying to sell the school just like the candidate is trying to sell themselves.",
      "author": "tongmengjia",
      "created": 1638634348,
      "upvotes": 47,
      "replies": {
        "hn7lf2o": {
          "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn7lf2o/",
          "text": "Thanks. Honestly, the replies I’ve received have been encouraging, though a couple were lukewarm. It’s that double-dynamic of me pitching myself to the school and the school pitching itself to me that caused me to second-guess showing too much enthusiasm. That said, it’s good to know that a simple thank you is all that’s needed, and if I personalized it a touch more than normal, all should be fine. I’m guessing there’s nothing else I can do at this point to differentiate myself from the other candidates.",
          "author": "bossymandias",
          "created": 1638636036,
          "upvotes": 11,
          "replies": {
            "hn85zsm": {
              "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn85zsm/",
              "text": "Remember you're interviewing them too. You want to work somewhere that loves your enthusiasm, not somewhere where they see your enthusiasm as a negative (assuming you didn't reach a pitch only dogs could hear before screaming how much you love them). \n\nWe're doing some faculty recruitment at the moment and we had one candidate who practically bounced off camera she was so excited by a question our director asked. I'm a curmudgeonly introvert and I was absolutely charmed and her enthusiasm was just infectious. I really hope we are able to offer her a post because I think she'd just be a great addition to our institute. \n\nHopefully, they see you the same way.",
              "author": "ACatGod",
              "created": 1638644461,
              "upvotes": 22,
              "replies": {
                "hn86gqe": {
                  "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn86gqe/",
                  "text": "I definitely think my enthusiasm, while evident, was tempered enough not to reach dog pitches lol. Thanks for sharing! I’m grateful for the encouragement.",
                  "author": "bossymandias",
                  "created": 1638644652,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hn7jzsk": {
      "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn7jzsk/",
      "text": "When I am on search committees, I take the approach of being honest but not forthcoming. If someone asks me a question about the drawbacks or “areas for improvement”, I tell them in the most professional way I can. However, I am not going to offer those up without solicitation. I would highly encourage you to get some truthful insight about the culture and environment of the department and college before accepting any job. Everyone is putting on their best face during the interview process and not always revealing the downsides.",
      "author": "psychprof1812",
      "created": 1638635428,
      "upvotes": 25,
      "replies": {
        "hn7luso": {
          "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn7luso/",
          "text": "Thanks for the feedback. I honestly didn’t think to inquire along those lines because I would have thought they’d be a faux pas. Do you expect questions along those lines in a group interview, or more personally afterwards?",
          "author": "bossymandias",
          "created": 1638636223,
          "upvotes": 10,
          "replies": {
            "hn7ocwo": {
              "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn7ocwo/",
              "text": "This is my just 2 cents so take it with a grain of salt. I think asking those types of questions on the first round is a faux pas. However, I think a second round interview is more of a two way street. You are also interviewing them. I would question someone’s interest in the job if they did not ask some probing questions. Of course, there are tactful ways of asking these types of questions. I would ask them personally instead of in a group setting.",
              "author": "psychprof1812",
              "created": 1638637256,
              "upvotes": 12,
              "replies": {
                "hn7orye": {
                  "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn7orye/",
                  "text": "Appreciate the insight. Thanks!",
                  "author": "bossymandias",
                  "created": 1638637430,
                  "upvotes": 4,
                  "replies": {}
                },
                "hna0892": {
                  "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hna0892/",
                  "text": "There are a ton of questions I wouldn’t ask until I got an offer.",
                  "author": "nrnrnr",
                  "created": 1638673314,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hn7iujc": {
      "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn7iujc/",
      "text": "I wouldn’t put any stock in their reply. I’ve been on hiring committees (albeit UK). I paid no attention to who did or did not engage in the time honoured obligation to issue a thank you note. Quite frankly, I didn’t care (not saying others don’t) and my reply to them was as generic and contrived as their thank you note (not saying yours was). In short, it’s a game and as a hiring academic, I never gave it a second thought afterwards. In fact once they were hired, I introduced myself to a new colleague having had no idea I’d interviewed them (they refreshed my memory).",
      "author": "DrArmitageShanks",
      "created": 1638634930,
      "upvotes": 15,
      "replies": {
        "hn7m4xi": {
          "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn7m4xi/",
          "text": "Thanks! This is honestly how I expect the norm to be.",
          "author": "bossymandias",
          "created": 1638636342,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hn8iq19": {
      "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn8iq19/",
      "text": "FWIW, I've been on several search commitees (and probably chaired half of them) and one thing I try to do is  imagine how the candidate will be as a colleague.\n\nMy advice is, be yourself! Don't tell them something just because you think it's what they want to hear.",
      "author": "oldguy76205",
      "created": 1638649852,
      "upvotes": 9,
      "replies": {
        "hn8q3ws": {
          "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn8q3ws/",
          "text": "Thanks! This is a good reminder.",
          "author": "bossymandias",
          "created": 1638653058,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hn8hpr0": {
      "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn8hpr0/",
      "text": "9 hours?! Yikes and holy cow that's more than we ever require. I am a fan of notes, although I've seen both ways of doing it, to members or to HR who shares with members.  But one thing we tend to like, and I certainly do, is seeing a candidate who not only has the expertise and experience we want, but shows enthusiasm and excitement for the job. So I'm on your side on what you did, and that comes from being on committees and seeing loads of candidates. When I see relatively equal candidates the one who seems energetic, outgoing, etc will often be my choice.  \n\nAs for your second question, yes the norm is be very generous, encouraging etc to the final candidates, trying hard to show no cards.  The reason is the committee members may not be unanimous on who they want, so we have to fight it out in a later meeting where we'll do our best to convince the others of our preferred candidate.  On the other hand, encouragement is often a really good sign. But I note for me there is genuine encouragement for candidates I really want the uni to hire and sort of business/fake encouragement to candidates I know I'd never vote for just so they leave feeling ok.  It's hard for me to have any sense of the people you met but maybe you can tell.\n\nThe fact you were part of the second round is already great. Good luck, I hope it works out for you.",
      "author": "gutfounderedgal",
      "created": 1638649407,
      "upvotes": 8,
      "replies": {
        "hn8jbyc": {
          "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn8jbyc/",
          "text": "Yeah, the 9-hour Zoom schedule really threw me off at first, but in the end I really appreciated most of my meetings being with individuals and pairs. Not sure if that was by design or just a result of their scheduling, but it definitely facilitated the more personal and conversational experience—aside from the formal presentation and administrator meetings. Really appreciate this insight!",
          "author": "bossymandias",
          "created": 1638650109,
          "upvotes": 7,
          "replies": {}
        },
        "hn95nh6": {
          "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn95nh6/",
          "text": "Our newest search guidelines recommend at least 16 hours of in person interviewing for each candidate.  I’m chairing a search and really can’t deal with that much, so I’m doing 12.\n\nOP, I wouldn’t put any stock in the replies your get.  Our equity guidelines really don’t allow us to reply to emails from individual candidates with anything but very generic emails, and even those are discouraged.",
          "author": "Ruby_Ruth",
          "created": 1638659712,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hn8lwcj": {
      "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn8lwcj/",
      "text": "I had 21 years as a chair of a department at a small public university, not a liberal arts institution. I wanted us to hire someone who wanted to be at our place. Dog level enthusiasm could a little bit of turn-off, but not much. The personalized thank you note is really good. I did that when I interviewed for the job, in fact (but I also knew, through insider contacts, that I was the only viable candidate).",
      "author": "janemfraser",
      "created": 1638651208,
      "upvotes": 4,
      "replies": {
        "hn8q5m4": {
          "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn8q5m4/",
          "text": "Thanks so much for the feedback!",
          "author": "bossymandias",
          "created": 1638653078,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hn96o1m": {
      "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn96o1m/",
      "text": "> For those of you on hiring committees, do you expect any sort of follow-up from short-listed candidates after their full-day interviews? If so, what do you want/hope to see?\n\nNothing is needed. It's nice if you send a little thank-you e-mail, but it's honestly not necessary (if you do or don't, it won't change a thing about our deliberations — if we aren't convinced you're the right candidate, it won't make a difference; if we are, it won't make a difference). Don't expect any kind of reply, much less one that gives you any information (I don't reply to them at all — I don't want to send any \"signals\"). \n\nAs for positive vibes — if they are encouraging you throughout the process and being positive, it probably means that they think you are someone who they might want to work with. It does not mean you are their #1 choice, though. You might be the #2 choice, or the #3 choice, and so on — but they know, through long experience, that you often end up with the #2 or #3 choices, because the committee does not really have control over who gets hired, in the end (that's a complex little dance between deans and provosts and candidates and so on; we just make a recommendation and an ordering, that's all). So yeah, you can probably take it as a positive sign that things went well! (Or, at least, that the committee and everyone else you talked to know how to act like decent people; I try to be nice even if I don't think I want to hire a candidate, though I admit it is easier to be consistently friendly and encouraging to the ones I actually want to hire.) But don't buy that house near the campus yet.",
      "author": "restricteddata",
      "created": 1638660138,
      "upvotes": 2,
      "replies": {
        "hn9eds3": {
          "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hn9eds3/",
          "text": "Thanks! This is helpful, especially re: ordering the candidates and not really having much say beyond that. While I really loved my PhD program, I was not given any mentoring or prep for the job search, so insights like this are very valuable as I continue the process!",
          "author": "bossymandias",
          "created": 1638663438,
          "upvotes": 1,
          "replies": {
            "hna0r5x": {
              "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hna0r5x/",
              "text": "There are so many things about academia that I sort of wish could be just written down, but aren't, but it's hard to generalize because I gather it works quite differently at different institutions, even within the same country and field (and certainly across them). \n\nBut yeah, I didn't really understand how job searches worked until I was on about a million job search committees. I didn't understand how tenure review worked until I was (recently) on a committee for tenure review. We have all of these opaque systems in academia, it makes it about ten million times more stressful than it could be for people who are stuck on the other side of the opaqueness. I think if more people on the job market knew what it was like to be on search committees at different kinds of institutions, it would make them much better candidates, and they'd have much better applications!",
              "author": "restricteddata",
              "created": 1638673555,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hncve4y": {
      "link": "/r/AskAcademia/comments/r8sl1z/search_committees_what_do_you_want_to_see_after_a/hncve4y/",
      "text": "Regarding their replies, remember that they are probably not allowed to offer you the job or say anything that could be interpreted as promising anything. This is surely on their minds as they respond to your thank-you notes, and some people will be awkward writers or keep you at arm's length if they are trying to be careful like that. (even if IMO it's not that hard to toe that line, some people are just more comfortable with it than others)",
      "author": "pb-pretzels",
      "created": 1638731166,
      "upvotes": 1,
      "replies": {}
    }
  }
}