{
  "sid": "6eqopz",
  "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/",
  "title:": "I reported my partner for plagiarism",
  "text": "Was taking a graduate level math programming course where the final project was a 15 page research paper where you could partner up. The dude I partnered with seemed alright for the first couple weeks. We met up a couple times, I drafted an outline, and we split up sections that we'd work on and reconvene as we progressed. He decides he wants to write the introduction and outline the use cases of the mathematical formulation we're working on. \n\nFrom here, the partnership got sketchy and turned south. He lets me know that he's finished his portion of the paper. I start reading it and am immediately suspicious. The writing style is abruptly changing and basically vacillates from quite complex sentence structure, to more simplistic language within the same thought. The sentences by themselves look ok, but overall there is no cohesion. I Google the first sentence I suspect of plagiarism and sure enough, I get a hit. I then run his entire portion through a plagiarism detector and it detects 33% plagiarized. \n\nSo this looks pretty bad and I confront him about it. He looks somewhat embarrassed, but smiles it off and says he just needs to add citations. He says he has fixed his portions but when I check them, the plagiarized sections are mostly intact, and all he has really added are inaccurate citations. i.e., he found a passage from a website, but then attributed it to a wholly different paper. \n\nI talk to him about it again, this time being much more explicit  about the fact that he was plagiarizing. No real mea culpa or \"please explain to me what I'm doing wrong,\" just that he'll go 'fix it'. After his second round of edits it seems like he's removed most of the plagiarism but some parts still exist.\n\nI'm pretty flabbergasted at this point.\n\nI talk to my professor and agree to outline all the portions he had plagiarized. It just seemed like my partner was completely clueless about the seriousness of this, or didn't care. School administration wants me to testify about this and my partner has been blowing up my phone trying to talk to me, because I think he has a disciplinary hearing tomorrow. He's texting me telling me he only put copied parts in there as a kind of placeholder until he filled it in with his own words. He never once said this to me and that practice in and of itself sounds rather suspect. Seems like he's freaking and really wants to talk to me.\n\nThis whole episode is making me feel ill wondering if I did the right thing. I'm even considering returning his call telling him my side of the story, but my gut tells me I should probably not speak to him. Did I do the right thing? And what would you have done differently?",
  "author": "plagius_the_foolhard",
  "created": 1496359637,
  "updated": 1634081925,
  "over_18": false,
  "upvotes": 103,
  "upvote_ratio": 0.95,
  "comments": {
    "dicad5a": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicad5a/",
      "text": "You did the right thing by protecting yourself. Plagiarism is very serious, you gave him two chances to own up and correct the situation. I recommend not talking to him.",
      "author": "kilohirtz",
      "created": 1496360341,
      "upvotes": 152,
      "replies": {
        "dici05i": {
          "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dici05i/",
          "text": "I'd go farther than tell OP to be very cautious about talking to the person. Frankly, they really have nothing to gain by doing so. And you don't want to leave open any doors for potentially sticky legal situations.",
          "author": null,
          "created": 1496370423,
          "upvotes": 50,
          "replies": {
            "dicursm": {
              "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicursm/",
              "text": "That's a good point.",
              "author": "kilohirtz",
              "created": 1496395500,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "dicg2ng": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicg2ng/",
      "text": "I almost thought you meant your SO by the title....that would be really dramatic",
      "author": "tontoto",
      "created": 1496367979,
      "upvotes": 122,
      "replies": {
        "dicuzpc": {
          "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicuzpc/",
          "text": "Glad I'm not the only one...",
          "author": "MrLegilimens",
          "created": 1496396132,
          "upvotes": 23,
          "replies": {}
        }
      }
    },
    "diceg76": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/diceg76/",
      "text": "Graduate level course. It is virtually impossible that he has made it to graduate level mathematics courses without even being conceptually aware that plagiarism is against most university rules. I can't tell you not to feel bad about what you did; emotions aren't always rational, and when someone is freaking out and blowing up your phone it's hard to avoid it. \n\nThe best way to think about it is that he made a choice to plagiarize and he made a choice to do it on a shared assignment. If you hadn't caught it, you could have ended up in trouble too. *He knew that* and he did it anyway. You gave him ample opportunity to fix what he did; two warnings. Everything you did was correct, and anything consequences that he faces because of this are *his fault*, not yours. ",
      "author": "GeeWhillickers",
      "created": 1496365933,
      "upvotes": 55,
      "replies": {
        "dicf1qf": {
          "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicf1qf/",
          "text": "Great point in here. This guy was willing to put *your* academic career in jeopardy due to sheer laziness. He is not your friend. Giving him not one but two chances to correct his behavior is more than generous enough. You owe him nothing.\n\nThat said, your university probably has an Ombudsman's office if you'd like to talk anything over with a professional neutral third party.",
          "author": "kyew",
          "created": 1496366705,
          "upvotes": 34,
          "replies": {}
        },
        "dicj5wr": {
          "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicj5wr/",
          "text": "This is really a great point and encapsulates how I feel right now. I know I did the right thing, but it's hard not to feel bad about what he's going through--even though it is completely self-inflicted. I know I'm being a bit irrational about this.\n\nI also keep trying to tell myself that he put my reputation at risk as well.",
          "author": "plagius_the_foolhard",
          "created": 1496371939,
          "upvotes": 16,
          "replies": {
            "dicoqze": {
              "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicoqze/",
              "text": "I know what you mean, but don't let him make you feel bad later. Its his dumbass fault for plagiarizing. \n\nAnd you almost certainly would be sharing his fate had you turned it in the way it was.  Besides, screw cheaters. They de-value everyone's degrees and are an insult to every hard working honest student.  ",
              "author": null,
              "created": 1496380567,
              "upvotes": 7,
              "replies": {}
            },
            "dicz648": {
              "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicz648/",
              "text": ">This is really a great point and encapsulates how I feel right now. I know I did the right thing, but it's hard not to feel bad about what he's going through--even though it is completely self-inflicted. I know I'm being a bit irrational about this.\n\nOne  thing that has been difficult for me to learn through live, and I think is for everyone, is that you can't control outcomes. You can only control your actions. Your actions were excellent here. The outcome might not have been what you wanted, but you did what you could. Kudos for that.\n\nGood luck, and I wish you better partners in the future.",
              "author": "Niezo",
              "created": 1496405827,
              "upvotes": 6,
              "replies": {}
            },
            "didbgxu": {
              "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/didbgxu/",
              "text": "Exactly, imagine if you had been disciplined for HIS actions. Especially as you discussed it with him, it would mean if something was submitted with your name on it that had knowingly been plagarized you would have been in the wrong as well.\n\nIts a horrible situation, but he didnt care about the consequences on your part, he was been self serving, so you need to do the same. \n\nOf course you will feel upset because you know that it must be stressful and scary to get in trouble like this but he brought it on himself and you need to distance yourself from him. \n\nHe made his bed so he can lay in it. Dont let him try to take you down and make you sway on your morals. You did the right thing. It takes courage to speak out when people do something wrong ",
              "author": "DrRobotniksMachine",
              "created": 1496421325,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "dicbhyq": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicbhyq/",
      "text": "If you noticed his bizarre writing style, your teacher would have too. You did the right thing and have no obligation to talk to him about it. You warned him that he was obviously plagiarizing, the fact that he didn't fix his work is 100% on him. ",
      "author": "KiltedLady",
      "created": 1496361867,
      "upvotes": 50,
      "replies": {}
    },
    "dicbogv": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicbogv/",
      "text": "I'm an English professor. You absolutely and without question did the right thing. You warned him more than once, and he was jeopardizing your performance by cheating. Rest easy. I wish you better partners in the future. ",
      "author": "superboombox",
      "created": 1496362117,
      "upvotes": 44,
      "replies": {
        "didfxwc": {
          "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/didfxwc/",
          "text": "> I wish you better partners in the future.\n\nMuch appreciated.",
          "author": "plagius_the_foolhard",
          "created": 1496426168,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "dicbqts": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicbqts/",
      "text": "Just here as a third voice: you handled this in an excellent way. Like others, I encourage you not to take his calls. Not because he's a horrible person, but because you're a witness, not an accomplice. Good for you.",
      "author": null,
      "created": 1496362205,
      "upvotes": 19,
      "replies": {}
    },
    "dicdm4w": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicdm4w/",
      "text": "It really sucks when someone who is supposed to be your peer engages in such egregious misconduct. You don't want the responsibility of having to be like this person's boss, however if you take your own studies seriously you unfortunately have to.\n\nYou have every right to be mad at him for putting you in this position, and don't let him manipulate the narrative into one where you caused the problem. If he is someone who has a childish notion of us-against-them, why is he taking graduate level courses in the first place? Is he planning on being a con man later in life?",
      "author": "rz2000",
      "created": 1496364809,
      "upvotes": 16,
      "replies": {}
    },
    "didfyod": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/didfyod/",
      "text": "As someone who is currently involved in a kinda similar affair with my university right now (mine is a Title IX sexual assault case) I would say do not under any circumstances talk to this person. It will just make you doubt yourself. And it's okay to feel bad, I feel bad too and I'm literally going up against my rapist (which is crazy to think about!) empathy is a weird and crazy thing. Just tell university what happened, don't let him influence you. It would be smart to get screenshots of everything that you have. Any messages between the two of you, especially any where you confront/discuss his plagiarism. Any previous versions of the document that are still around as well, especially with the plagiarism in it. It will be okay :) ",
      "author": "FlowerPotRock",
      "created": 1496426193,
      "upvotes": 12,
      "replies": {}
    },
    "dice16a": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dice16a/",
      "text": "You absolutely did the right thing. Let's suppose you did nothing and just turned in the paper as is. There's a high chance that your professor, like you, would be immediately suspicious. If you knowingly turned in plagiarized work, even if your partner was the one who \"wrote\" the plagiarized parts, you yourself would be responsible. Even if you had no clue the parts were plagiarized and turned it in, it may be very hard to clear your name.\n\nMost people don't like ratting on someone else. But you gave this person a chance and he was seriously jeopardizing your own academic standing. You did the only reasonable thing in this situation.",
      "author": "jogam",
      "created": 1496365385,
      "upvotes": 11,
      "replies": {}
    },
    "dickk1v": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dickk1v/",
      "text": "You absolutely did the right thing to protect yourself. This is clearly plagiarism beyond a doubt; you gave him two valuable chances to redeem himself once you realized what was going on. He chose to go off the deep end, and he's now facing the consequences for this unacceptable conduct. Left unchecked, he could have seriously harmed your reputation and put your academic career in jeopardy, which is something you absolutely cannot afford.\n\nAlso if I were you, I would block his number so he can't continue to bother you. Let the school and your professor handle this from there on out.",
      "author": "theintrepidwanderer",
      "created": 1496373782,
      "upvotes": 2,
      "replies": {}
    },
    "did0wa2": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/did0wa2/",
      "text": "Did he turn in the paper?",
      "author": null,
      "created": 1496408648,
      "upvotes": 5,
      "replies": {}
    },
    "dif58u8": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dif58u8/",
      "text": "You offered him help, you gave him more than one out, and then told the professor about plagiarism that was occurring on work that would've had your name on it. You did the right thing! Keep the texts (screenshot just in case), and block the number. Don't talk to him, and tomorrow, let the folks running the hearing know that he's been trying to contact you- if he's blowing up your phone to the point of harassment, they should know. \n\nHe made a series of choices. Now he gets to face consequences for those choices. That's not on you. \n",
      "author": "jjdactyl",
      "created": 1496526037,
      "upvotes": 2,
      "replies": {}
    },
    "dii2o4v": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dii2o4v/",
      "text": "You did the right thing. One of my favorite professors in my PhD program said that he always \"nailed cheaters to the wall\" because he couldn't let them go into life with the power of a degree and the inclination to cheat. On so many levels, you did the right thing.",
      "author": "SignorinaMia",
      "created": 1496695648,
      "upvotes": 2,
      "replies": {}
    },
    "dimagqp": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dimagqp/",
      "text": "You did the right thing, and I thank you on behalf on everyone who does not cheat and has been harmed by ridiculous behaviors like this.",
      "author": "tenuredx",
      "created": 1496911214,
      "upvotes": 2,
      "replies": {}
    },
    "diewf6u": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/diewf6u/",
      "text": "[deleted]",
      "author": null,
      "created": 1496513795,
      "upvotes": 0,
      "replies": {}
    },
    "dicun51": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicun51/",
      "text": "I don't understand - was this project finished and handed to the professor already? \"Plagiarism\" in a personal draft is not a problem, the only thing that matters is what your turn in as your work at the end. You were aware of the problem during the project, and somehow it got handed in that way? Then you're just as guilty as he is...",
      "author": "TheFML",
      "created": 1496395122,
      "upvotes": -10,
      "replies": {
        "die43hf": {
          "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/die43hf/",
          "text": "> \"Plagiarism\" in a personal draft is not a problem, the only thing that matters is what your turn in as your work at the end.\n\nThis is absolutely counter to all best practices about writing papers. You should never, ever, ever copy or even paraphrase material into your working draft that should be cited without citing it right then and there, or at least, clearly noting that the citation needs to be added later.  (My working drafts are certainly peppered with (CITE THAT PAPER FROM THAT GUY HERE) notes to myself.)\n\nTo do otherwise is sloppy, and intentionally or unintentionally, if that is the habit you are in, you *will* plagiarize at some point. And then whether you get caught and face consequences becomes a matter of luck. I would never bet my academic career and reputation on luck.",
          "author": "Zoethor2",
          "created": 1496456766,
          "upvotes": 4,
          "replies": {}
        },
        "didc9dm": {
          "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/didc9dm/",
          "text": "If this were my university, they would not have taken any action until a paper had been submitted for a grade. He shouldn't plagiarize, we all agree on that, but I don't think he has actually committed a punishable offense until it's turned in.  \n\nBlaming OP for the quality of her partner's work and saying they are \"just as guilty as he is\" though?  *No*.  OP has every right to defend themself against what is likely an expellable offense, especially if they can provide documentation of the suggestion to make changes. You're suggesting that OP should have re-done the partner's portion of their group project, which would likely give the partner credit for OP's work, which is also problematic.    \n",
          "author": "TourmalineTart",
          "created": 1496422191,
          "upvotes": 2,
          "replies": {
            "didrvb6": {
              "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/didrvb6/",
              "text": "Yes, changing around a few sentences and citing properly 5 papers is probably less trouble for everyone involved than snitching on your project mate for something that was not final. And please everyone remember here that this is a STEM project - plagiarism is very relative in this context, and can almost always be fixed by a proper citation (\"In the work of BLA, the authors show that BLA\"). Noone expects anything more than that from a related work section either way...",
              "author": "TheFML",
              "created": 1496439623,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "dicur1q": {
      "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicur1q/",
      "text": "A small disclaimer at one corner of the paper would have been sufficient. Reporting it to the officials is extremely mean. He/she could be busy. The topic could have been exceptionally challenging to her. There are many challenges in life. She could be going through one of the hard times of her life. It is always nice to assist one another before running to \"our rights\". ",
      "author": "4Nuts",
      "created": 1496395439,
      "upvotes": -18,
      "replies": {
        "dicxh5b": {
          "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicxh5b/",
          "text": "[deleted]",
          "author": null,
          "created": 1496402472,
          "upvotes": 15,
          "replies": {
            "did196m": {
              "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/did196m/",
              "text": "dropping? well, there people who are running under a lot of burdens. It is  unfair to judge without hearing the other person's story. And, honestly, most of the papers submitted for assignments and term papers could have some level of plagiarism: they are just not under the spotlight of administration scrutiny. ",
              "author": "4Nuts",
              "created": 1496409178,
              "upvotes": -12,
              "replies": {}
            }
          }
        },
        "dicyr7a": {
          "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dicyr7a/",
          "text": "Uhhh disclaimer of what?\n\nExtremely mean? Could be busy? There is no challenge in life whose answer is to cheat. \n",
          "author": "MrLegilimens",
          "created": 1496405069,
          "upvotes": 10,
          "replies": {}
        },
        "didf6kz": {
          "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/didf6kz/",
          "text": "I *did* assist him. Reminding him that plagiarism is unethical *twice* and highlighting the offending sections without turning him in right then and there was a favor that I didn't have to do. The fact that he still chose to rip-off someone else's work after all these clear warnings tells me he wasn't getting the message and needed to learn about this the hard way.\n\nAlso, what conclusion does your reasoning lead to? That it's ok to lie, cheat, and steal when things get tough? How about asking for help, reducing your load, or just doing the right thing no matter what challenges life throws your way. Isn't that the ethical character we want graduate students to abide by? I would have been more than happy to have helped him with the workload if he was under too much pressure, but he chose to go the dishonest route instead.",
          "author": "plagius_the_foolhard",
          "created": 1496425353,
          "upvotes": 9,
          "replies": {
            "diea3rz": {
              "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/diea3rz/",
              "text": "it is a class assignment: not sending it for a publication, for gods sake. and, he might not be doing it intentionally. lack of experience could play a role. I don't know the other person's story, I cannot tell you. but, from your description, you seem to take it to  extreme. I would  have leave the job for the professor to identify the plagiarism if he can (there is a bigger chance, that would have never happened). Your task is to protect yourself: not unfairly accusing a person which is not your job or responsibility.  he is now unfairly scrutinized: while a number of other students might have committed the same level of careless mistakes without being tracked. \nYou could have also consulted to the professor before you submitted so that he(she) can supervise him. While appreciate the assistance you offered at the beginning,  to my sense, in all honesty, reporting him is evil act. ",
              "author": "4Nuts",
              "created": 1496467121,
              "upvotes": -1,
              "replies": {
                "dif9r6p": {
                  "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dif9r6p/",
                  "text": "OP was protecting himself. They were partners working jointly together on a paper. If he turned in a paper where he knew sections were plagiarized, then he opens himself up the same punishment. Because whether or not the other person knew it was wrong, OP did.  \n\n",
                  "author": "LeopoldTheLlama",
                  "created": 1496532385,
                  "upvotes": 3,
                  "replies": {}
                },
                "dif4z3q": {
                  "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/dif4z3q/",
                  "text": "> he is now unfairly scrutinized\n\nDid you read the OP? They gave him two opportunities to fix it, and offered help. He declined. At that point, it's not a \"careless mistake.\" The fact that others may have gotten away with it \"without being tracked\" shouldn't excuse his behavior. Plagiarism is wrong, \"forgetting citations\" is bad scholarship. Getting to graduate level work without an understanding of academic integrity or a willingness to improve screws it up for the rest of us who manage to write without cheating. ",
                  "author": "jjdactyl",
                  "created": 1496525657,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "didcfeg": {
          "link": "/r/AskAcademia/comments/6eqopz/i_reported_my_partner_for_plagiarism/didcfeg/",
          "text": "> He/she could be busy. \n\nAnd? Welcome to grad school.\n\n> The topic could have been exceptionally challenging to her. \n\nThen she deserves the shitty grade she earned if she doesn't understand it. This isn't an excuse to rip off other people's work.",
          "author": "pl213",
          "created": 1496422371,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}