{
  "sid": "qa2d08",
  "link": "/r/AskAcademia/comments/qa2d08/how_do_you_deal_with_coauthors_that_try_to_take/",
  "title:": "How do you deal with coauthors that try to take over control of the article although it was your idea and your data?",
  "text": "Specifically, I mean when they act as they want to take decisions over the paper all together but they do take important decision behind your back (presentations at conference / asking other people if they would like to join the study).",
  "author": "JoyVlogs",
  "created": 1634488822,
  "updated": 1634654294,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.69,
  "comments": {
    "hh0qgao": {
      "link": "/r/AskAcademia/comments/qa2d08/how_do_you_deal_with_coauthors_that_try_to_take/hh0qgao/",
      "text": "What's your position and what's their position? As a PhD student/postdoc, you're unfortunately very likely to face the situation where the PI has a bunch of bullshit requests about submissions and other co-authors.\n\nIf the annoying co-authors are students then you can tell them politely to go away.",
      "author": "CheeseWheels38",
      "created": 1634498734,
      "upvotes": 14,
      "replies": {}
    },
    "hh1biip": {
      "link": "/r/AskAcademia/comments/qa2d08/how_do_you_deal_with_coauthors_that_try_to_take/hh1biip/",
      "text": "So, my point of view is that no one ever does substantial work on a project unless it's necessary or very worthwhile. If you're a middle author / supervisor regardless, you're not likely to do more than *ensure the work is sufficient* when you have dozens of other projects that require more attention. If your coauthors are suggesting major changes to the work, try to figure out why. \n\nAre you junior, and they are more knowledgeable about how this information is likely to be received? If you're a student or grant-funded postdoc, I think there's a tendency for some on this sub to think they came up with an idea when they actually saw its natural progression from prior work. In this case, the coauthors may be pursuing a next step that has been years in the making, even though it seems to you like they're changing *your* direction. Could this be happening?\n\nIf it's neither of these things, I reiterate that co-authors don't usually make big splashes for no reason. Is there a way to have a conversation about the changes? They likely have a good reason for what's happening.",
      "author": "botanicalbuddy",
      "created": 1634507659,
      "upvotes": 7,
      "replies": {}
    },
    "hh0lpi6": {
      "link": "/r/AskAcademia/comments/qa2d08/how_do_you_deal_with_coauthors_that_try_to_take/hh0lpi6/",
      "text": "Any suggestions are welcome..",
      "author": "JoyVlogs",
      "created": 1634496772,
      "upvotes": 3,
      "replies": {}
    },
    "hh0u0i5": {
      "link": "/r/AskAcademia/comments/qa2d08/how_do_you_deal_with_coauthors_that_try_to_take/hh0u0i5/",
      "text": "It happened to me with my first paper and to one of my colleagues with whom we are good friends. I had a conflict with my supervisor who wanted to put another person as a first author just because this person need such paper, not because of his contribution (a small one, to be honest). But nobody can take my baby from me =). \n1. Make sure that you are the first author and that you are the person who actually writes the paper.\n2. Who are those people, making decisions behind your back? Talk to them and let them know that you do not want to be out of these decisions. But if they are more expirienced than you, they may just try to make your paper stronger. If it is a case, then it is not a problem. I understand that you can be kind of jealous of it, but if the manuscript will benefit from the collaboration, then go for it. \n3. Evaluate each person who was already added to the manuscript behind your back if they can really improve your work. Ask others why they want to include them.\nAn idea and data are not the manuscript yet. Try to get the best of it and others may help you with it. The question is if they can add something to the paper or just want to be in the list of authors.",
      "author": "MrBacterioPhage",
      "created": 1634500206,
      "upvotes": 2,
      "replies": {}
    },
    "hh3ogwu": {
      "link": "/r/AskAcademia/comments/qa2d08/how_do_you_deal_with_coauthors_that_try_to_take/hh3ogwu/",
      "text": "If the coautor is your prof you have no chance but letting it happen. It happens to me right now, he is shitty publicating in a shit journal with a shitty reputation and very few specialists to read it. But he cut me off whenever I tried to communicate and now since I “didnt contribute my writing part“ he removes me from first position as well. My career is over before it began, thanks to him. (He also gave me bad marks)",
      "author": "One-Bodybuilder-5646",
      "created": 1634560894,
      "upvotes": 1,
      "replies": {}
    }
  }
}