{
  "sid": "otg3o3",
  "link": "/r/AskAcademia/comments/otg3o3/i_have_interview_tomorrow_please_help/",
  "title:": "I have interview tomorrow. Please help",
  "text": "I am PhD in life sciences with 2 years postdoctoral experience. Tomorrow I have an interview for project manager position. I have relevant education and experience but no project management (as a job) experience. \nI am looking for any advice as I really am into this job. Also, the interview is online so any tips would also be welcomed on this matter.",
  "author": "Realistic-Swimming93",
  "created": 1627497556,
  "updated": 1634082399,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.92,
  "comments": {
    "h6vaxk9": {
      "link": "/r/AskAcademia/comments/otg3o3/i_have_interview_tomorrow_please_help/h6vaxk9/",
      "text": "Look up STAR technique - Situation, Task, Action, Result. It's a way to frame and structure interview answers. Have some examples of things like:\n\n- managing your time\n- prioritising work with competing deadlines\n- team work\n- managing a difficult situation\n- project you managed to completion\n- managing upward\n- gathering views/engaging stakeholders.\n\nThese don't have to be formal situations, they know you're straight out of PhD. You don't need a different example for every one of these but you do need to be able to produce several different examples. Also have a think about what things you might need to learn in order to the job, and have an answer to why you want the job and where you see yourself in X years time/what do you want to do in future. And then the rubbish question of what weaknesses you have (I personally think this is an utterly shite question because no one half sane answers it truthfully) and slightly less shite, what would your friends/colleagues say are your strengths/weaknesses.",
      "author": "ACatGod",
      "created": 1627501640,
      "upvotes": 11,
      "replies": {
        "h6vuqph": {
          "link": "/r/AskAcademia/comments/otg3o3/i_have_interview_tomorrow_please_help/h6vuqph/",
          "text": "Thank you so much for the valuable suggestions. I will definitely incorporate these",
          "author": "Realistic-Swimming93",
          "created": 1627510149,
          "upvotes": 3,
          "replies": {
            "h6xhutn": {
              "link": "/r/AskAcademia/comments/otg3o3/i_have_interview_tomorrow_please_help/h6xhutn/",
              "text": "Good luck!",
              "author": "ACatGod",
              "created": 1627542960,
              "upvotes": 1,
              "replies": {
                "h6xkplj": {
                  "link": "/r/AskAcademia/comments/otg3o3/i_have_interview_tomorrow_please_help/h6xkplj/",
                  "text": "Thank you for the suggestions again. That really helped. I just had my interview. It was weird as they didn’t ask specific project management questions and it finished in 20 minutes. Simply asked how my background matches the position, my motivation and my future plan. Don’t know what to get from this",
                  "author": "Realistic-Swimming93",
                  "created": 1627545409,
                  "upvotes": 1,
                  "replies": {
                    "h6xzpt7": {
                      "link": "/r/AskAcademia/comments/otg3o3/i_have_interview_tomorrow_please_help/h6xzpt7/",
                      "text": "At my institution, often a project manager it’s just somebody who’s good at keeping things moving along.  In the IT department, they may be more likely to hire people who have actual “project management” credentials, But for other kinds of academic administration, we kind of just want somebody who knows the ropes and can keep a project or initiative progressing.  Being organized, goal oriented, collaborative, and personable is good.\n\nIn a lot of ways, completing a PhD demonstrates you have the first two things on the list.",
                      "author": "FeatofClay",
                      "created": 1627557984,
                      "upvotes": 2,
                      "replies": {
                        "h6xzvs8": {
                          "link": "/r/AskAcademia/comments/otg3o3/i_have_interview_tomorrow_please_help/h6xzvs8/",
                          "text": "True. I agree with you but I was just surprised that there were not any project management related questions. I tried to mention every now and then that I know what I applied for and I have the experience and knowledge but still",
                          "author": "Realistic-Swimming93",
                          "created": 1627558100,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "h6xn5xr": {
                      "link": "/r/AskAcademia/comments/otg3o3/i_have_interview_tomorrow_please_help/h6xn5xr/",
                      "text": "Interviewing is a skill and some people/places don't learn it. I don't know if you were on zoom but I've found doing recruitment during the pandemic that interviews are much shorter - I think videoconferencing has quite an inhibitory effect on conversations and people tend to talk less. \n\nWell good luck and I hope you land this or something else soon.",
                      "author": "ACatGod",
                      "created": 1627547568,
                      "upvotes": 2,
                      "replies": {
                        "h6xn8qw": {
                          "link": "/r/AskAcademia/comments/otg3o3/i_have_interview_tomorrow_please_help/h6xn8qw/",
                          "text": "Thank you again. Yes it was on zoom.",
                          "author": "Realistic-Swimming93",
                          "created": 1627547635,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h6wt3l9": {
      "link": "/r/AskAcademia/comments/otg3o3/i_have_interview_tomorrow_please_help/h6wt3l9/",
      "text": "Be personable! If you got the interview that likely means they already know you can do the job- they just want to figure out if you’re a good fit.\n\nGood luck!",
      "author": "XCThinker",
      "created": 1627526754,
      "upvotes": 2,
      "replies": {}
    }
  }
}