{
  "sid": "ps4izq",
  "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/",
  "title:": "How much is academia teaching critical thinking vs. information?",
  "text": "I keep seeing posts from professors on social media pushing back against the idea that universities are indoctrinating students. These professors talk about how they teach critical thinking rather than ideological material. I do believe that my undergraduate career was filled with learning how to think critically, but you can't really teach critical thought without teaching certain material.  My PhD is from an interdisciplinary department but most of my coursework revolved around anthropology.  I feel like my field might actually be fairly ideological. I'm designing some syllabi for some adjunct classes I'm going to be teaching and I just can't help but feel that my field might be built to some extent on ideologies.  This was something I realized when I started applying for dissertation research grants and was told my research wouldn't make much of a theoretical impact even though it was well designed. I kept thinking that a well designed project should be more important than some desire to align with existing theories. I know I'm not \"indoctrinating\" students with my ideologies, but I'm not really sure how to design a class around critical thinking in my field.  Does anybody else have this issue?",
  "author": "UncommonPhoenix",
  "created": 1632174102,
  "updated": 1634078907,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hdoekcz": {
      "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdoekcz/",
      "text": "At least I have found from my experience that it's critical thinking they teach. I do think a lot of teachers may be liberal but, I have yet to see them take hard stances in their own field, i.e. what they teach. These people are experts in their respective fields and understand that it's mostly grays and not often black and white. I've personally never seen teachers \"indoctrinate\" about anything in their respective fields. Though I'm sure it does happen and people will give examples but that's my experience.",
      "author": "Putrid-Repeat",
      "created": 1632195259,
      "upvotes": 6,
      "replies": {
        "hdoghr3": {
          "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdoghr3/",
          "text": "I'm not sure about in the classroom, but I definitely know there are a lot of people in my field who believe certain things about human rights issues that have become politicized.  Generally, I think our field backs up what those claims, but now that you mention politics, I'm wondering if my concern is that there are issues that have become politicized that are human rights issues.  It really boils down to the fact that I study society and I think in the U.S., we generally have a very immature approach to understanding society. I study how policies, phenomena, and events affect people's lives. For example, I've taught a class about gender. We went over the biological and cultural basis of sex. We generally accept that gender is a spectrum, but that is definitely a politicized issue.",
          "author": "UncommonPhoenix",
          "created": 1632196332,
          "upvotes": 1,
          "replies": {
            "hdoi3ia": {
              "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdoi3ia/",
              "text": "I think damn near everything gets politicized today. Especially the social Sciences. I think the idea of college has itself become political. I mean it's looked at as an institution that indoctrinates its students! Crazy time lol",
              "author": "Putrid-Repeat",
              "created": 1632197257,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hdn72w3": {
      "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdn72w3/",
      "text": "My field is physics, and I can definitely say that there is a culture of indoctrination. I can't tell you how many times someone has tried to tell me that the earth is a ball or that the universe was created more than 5,000 years ago. \n\nBunch of liberal blasphemy. Down with the system.",
      "author": "tylerdoescheme",
      "created": 1632174755,
      "upvotes": 13,
      "replies": {
        "hdnci81": {
          "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdnci81/",
          "text": "Hahaha, that's not quite what I'm talking about. I'm in a social science and I think it's different.",
          "author": "UncommonPhoenix",
          "created": 1632177231,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdnu9iw": {
      "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdnu9iw/",
      "text": "CS here and we really need more critical thinking. There's a very dangerous trend in the world now to just pump datasets into a machine learning algorithm and believe that what comes out the other side is absolute truth.\n\nThere's no real incentive to think critically about this when there are people willing to pay you a six-figure salary not to think critically. \n\nThere's also a lot of pushback from the students whenever I set an assignment that requires them to exercise critical thinking. Questions are \"vague\" and \"it's unclear what we are supposed to do\". It's considered an unfair question if I don't just tell them which method to apply. It takes very careful course design to overcome this.",
      "author": "radams78",
      "created": 1632185575,
      "upvotes": 6,
      "replies": {
        "hdogmc2": {
          "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdogmc2/",
          "text": "Yes! I study metrics in healthcare and this is such a big issue.",
          "author": "UncommonPhoenix",
          "created": 1632196405,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdw2nwp": {
      "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdw2nwp/",
      "text": "The relationship between the \"thinking\" and the \"content\" is obviously interconnected. An education is learning both. It is impossible to teach the former without the latter. It is silly to try; critical thinking concepts in a vacuum of examples, methods, content, are just empty truisms. The application of it to content is where you see how difficult it is.\n\nWhen you are teaching about things that involve human history and behavior, it is impossible to not be considered \"ideological\" to people who feel threatened by the account you are teaching. There is no \"neutral\" ground there. You teach what you believe — in an honest, good-faith attempt — is the best understanding of it, and ideally you teach the students how this understanding came about and what it is based on. I teach all sorts of things about history that a thoroughly \"ideological\" person could find objectionable because my view is not their view, but I always try to indicate where the boundaries of our knowledge and interpretation lie, what the evidence we have seems to say, and that, ultimately, you need to learn all of this stuff if you are going to think critically about the stories we tell about people. In my experience the people who complain about \"ideological\" content are not trying to do that; they are trying to teach a particular account (often an obviously mythical one) and silence any opposing voices. I don't have time for that nonsense and I don't take it seriously as an intellectual complaint (I do take it seriously as a political movement to silence intellectuals and experts).",
      "author": "restricteddata",
      "created": 1632346268,
      "upvotes": 3,
      "replies": {
        "hdxfw3h": {
          "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdxfw3h/",
          "text": "Oh, I like that idea of making sure I point out where I'm interpreting things.  That would be enormously healthy for certain topics that I teach.  Thanks!",
          "author": "UncommonPhoenix",
          "created": 1632372118,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdnbmrb": {
      "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdnbmrb/",
      "text": "A related tricky issue is methodological or epistemological group think which pervades parts of the social sciences. I.e. US political science and its rationalism and quantification fetish, vice far more qualitative approaches in Europe. Point is to teach the roots and recognise these inherent concerns. Sounds like in thinking about these issues you're on the right path.",
      "author": "dbrq",
      "created": 1632176826,
      "upvotes": 4,
      "replies": {
        "hdncvqj": {
          "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdncvqj/",
          "text": "Oh yes, I agree about the quantitative vs. qualitative issue. I take a lot of quantitative approaches to qualitative data, but sometimes you just can't do that. On the other end of the spectrum, I've had more training in methods than most people in my field and I rarely ever see an extensive discussion of methods in major works.  It's pretty frustrating.",
          "author": "UncommonPhoenix",
          "created": 1632177402,
          "upvotes": 1,
          "replies": {
            "hdtdit3": {
              "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdtdit3/",
              "text": "All the better then for you to add value. Cross fertilization of ideas is one way to real innovation.",
              "author": "dbrq",
              "created": 1632291846,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hdncd5b": {
      "link": "/r/AskAcademia/comments/ps4izq/how_much_is_academia_teaching_critical_thinking/hdncd5b/",
      "text": "I told them it's critical thinking but I actually teach just what they want to hear, not really critical thinking, because my teaching evaluations ask them if I encourage critical thinking. If I don't do this, I will lose my job. Students don't like being challenged with thoughts against their own these days, so if they are the ones evaluating us, the system itself already eliminates the possibility of teaching true critical thinking. Critical thinking is a 1980s or 1990s thing.",
      "author": "throwaway_5456435434",
      "created": 1632177165,
      "upvotes": 4,
      "replies": {}
    }
  }
}