{
  "sid": "pc8ln4",
  "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/",
  "title:": "Made a mistake in my research",
  "text": "Hi everyone,\n\nThis is a throwaway account. I made a minor fuckup recently in my research. I am a PhD student. My supervisor is a very strict man and I am very afraid of him. He is very harsh whenever I make a mistake even during the midst of covid and I was struggling with mental health. Therefore, I am very afraid of being honest to him. \n\nI discovered that I have made a mistake in my calculations. The software I use has several versions. The numbers are different(very slightly) in the data from the previous version. And I have combined it with new data from the current version. I am noticing it just now. As a result, everything I have done so far is a complete waste. This is something I can fix in a couple of weeks. But, I am terribly afraid of him shouting at me. I am thinking of quitting. I am sitting here panicking badly. I do not know what to do.",
  "author": "throaway29092",
  "created": 1630011963,
  "updated": 1634079473,
  "over_18": false,
  "upvotes": 73,
  "upvote_ratio": 0.97,
  "comments": {
    "hah4r6t": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/hah4r6t/",
      "text": "It's easier for our minds to fear action than inaction because fight-or-flight can give us the instinctual bias that doing nothing is better than doing something of known consequence. As much as it feels like the most difficult thing you could do right now, this is probably a case where the short-term consequences to your work and your mental state will be less for fixing the problem than for letting it get any further. In simple terms, armor up and admit the hard thing before it comes to light any other way.",
      "author": "scootmcdoot",
      "created": 1630012766,
      "upvotes": 67,
      "replies": {
        "hail7k1": {
          "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/hail7k1/",
          "text": ">  the instinctual bias that doing nothing is better than doing something of known consequence.\n\nBasically, the reason why so many people aren't getting vaccinated. Also the reason, more generally, while Republican voters support \"small government\"/government deregulation despite tons of evidence that Republican policies which amount to \"staying out of your lives\" are worse for the vast majority of voters.",
          "author": "TheSpanishPrisoner",
          "created": 1630037413,
          "upvotes": 3,
          "replies": {
            "haj9owj": {
              "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/haj9owj/",
              "text": "This is not the subject of this post but Republicans are only pretending to support small government. A governor banning local government from doing what they want, or policing women's bodies, is not small government at all. But then again this is out of the scope of this post.",
              "author": "Ofbearsandmen",
              "created": 1630055290,
              "upvotes": 5,
              "replies": {}
            },
            "hajg3bk": {
              "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/hajg3bk/",
              "text": "Yes I love how this got political /s.",
              "author": "Sylo_319",
              "created": 1630060522,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "haincgu": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/haincgu/",
      "text": "Please do yourself a favor and find a new advisor that treats you with respect.",
      "author": "setholopolus",
      "created": 1630038583,
      "upvotes": 35,
      "replies": {}
    },
    "hahfibv": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/hahfibv/",
      "text": "I’ve done this. I wouldn’t be surprised if everyone hadn’t experienced this to some degree. \n\nWhat I did, and what I hope a supervisee would do when reporting to me, is to provide a clear explanation, with documented examples, of the problem, a summary of the consequences, and a plan (with timeline) for correction. No excuses, just facts. \n\nAs for being afraid of your advisor, are there other students in the same boat? Does he have a history of harsh or unfair treatment of students? You should consider a confidential conference with your institution’s ombudsperson to lay out your concerns and examine your options. \n\nI switched labs as a grad student almost two years in, because I just couldn’t work comfortably with my advisor. Yes, it was a difficult decision, and a bunch of heartache lost time, but I was able to find a new position with someone who was a much better fit, and who remains a good friend twenty years on.",
      "author": "jxj24",
      "created": 1630017421,
      "upvotes": 30,
      "replies": {}
    },
    "haiwncq": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/haiwncq/",
      "text": "\"I've spotted an error and I know how to fix it\"\n\nGreat! Awesome! That's a good thing.",
      "author": "baenpb",
      "created": 1630044393,
      "upvotes": 13,
      "replies": {}
    },
    "haiwegd": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/haiwegd/",
      "text": "IMO there 3 seperate by own issues here:\n\n**1. The mistake itself:** As others said, you should own up to your mistake. It is better to do it now instead of hoping that it will pass unnoticed until you get a chance to fix it. \n\n**2. Your own expectations:** You are a PhD student: mistakes are *expected.* They certainly suck and none wants to do them, but they are part of learning. You need to understand this first of all and go easier on yourself. \n\n**3. Your  supervisor relationship:** Being harsh is one thing, but making your students afraid of you is another. This relationship sounds toxic. You *need* to at least have a chat and make him understand what worwks or not for you. If he doesn't get the memo, you should in my opinion consider switching supervisors. *Hint*: If your university offers any sort of student support system sign yourself up for it. Student services not only may offer conselling sessions to help you with the second point, but also provide a trail documentation in case you need to switch supervisors.",
      "author": "RecklessCoding",
      "created": 1630044213,
      "upvotes": 9,
      "replies": {}
    },
    "hah8hvh": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/hah8hvh/",
      "text": "First of all, remember that you are human and make mistakes. Sometimes, no matter how easy the task, we all mess up. The best thing you could do in my opinion is just to own up to it. Yes, your supervisor may not be exactly happy with your mishap, but the most important thing is that you don't lose your self-confidence. High self efficacy even in the midst of our not so promising moments is what creates that drive that all supervisors look for. Just take a moment and relax. Assess what went wrong and make a plan on how you can minimize the risks of that happening again. If you present what went wrong, and steps you are taking to ensure that it won't happen again, then it may help your supervisor have a better outlook on the situation.\n\n&#x200B;\n\nGood Luck!",
      "author": "Caleb14allen",
      "created": 1630014350,
      "upvotes": 8,
      "replies": {}
    },
    "hahxe3k": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/hahxe3k/",
      "text": "It might depend on the specifics of the software, but things might not be a complete waste! If it's something like R, for example, (the change from 3.xx to 4.xx is what I'm thinking), and it hasn't broken completely, than the models and trends should all be in the same direction and all but the most borderline results aren't compromised at all. You should be able to present your data with a note about the version change where appropriate. Rerunning everything in the newest version will have to be done at some point, and will take time, but it's not a thing where you have to drop everything RIGHT NOW and go back to the beginning, losing your current momentum and risking your supervisor's wrath. There are arguments to be made for using the most current version of software, and arguments to be made for sticking with legacy versions, but ultimately if they show the same thing and you are clear about when and how each one was used, it's fine.\n\nTo be honest, it might not even be necessary to tell your supervisor directly, and certainly you don't need to frame it as a major fuck-up. Only you know the relationship, but if it's something that will be fixed in a future draft you can just make a note that you identified a problem, and are going back to implement the solution, it has/will be fixed soon. Or if you think it's best to let them know (it's possible they have a tip for what to do in this case that makes versioning easier, for example), just sending an email directly telling them that you've had a set-back due to this, without dwelling too much on how bad you feel about it, should be fine. Then don't check your email for the rest of the day and treat yourself to something nice for Doing that Hard Thing.\n\nStuff like this happens a lot. Take a deep breath. It will be okay.",
      "author": "Jacqland",
      "created": 1630025752,
      "upvotes": 6,
      "replies": {}
    },
    "hahow2u": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/hahow2u/",
      "text": "I would definitely do what you have to do to correct the mistake, including telling your supervisor. From the sounds of it, it's going to be difficult and uncomfortable, but worth it in the long run. Foremost, it's not worth risking your scientific integrity. But also, it's not worth cringing at the products (paper, poster?) that will come out of this data years down the road when you look at your CV, or having to walk on eggshells when explaining the project in the future, which might be an important part of your professional journey on grant applications or job talks. I assume he'll be mad, but can't kick you out of your program for this. Hell, even if he would or could, it's still not risking the things stated above, and you deserve a better mentor anyway. \n\nIf it's any comfort: I submitted my masters thesis to a good journal, got a promising R&R asking for only minor revisions, and found an error in my data that changed results (like, changed which findings were significant. Worst case scenario, IMHO). I called my mentor and he thanked me for doing the right thing even though it was scary, and the journal still accepted my paper.",
      "author": "slicingthelemon",
      "created": 1630021743,
      "upvotes": 3,
      "replies": {}
    },
    "hajhs6w": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/hajhs6w/",
      "text": "Hey friend! \n\nI make 20 serious mistakes per day, and sometimes a mistake costs a weeks worth of data/progression.\n\nPoint 1: a study/research is always simultaneously an education and a product. Even for a professor. When you are chasing knowledge you cannot “waste time”, because any experience is an accumulation of… experience - which is a kind of knowledge. \n\nPoint 2. Your supervisor is not perfect. They make mistakes as well. No matter their level of proficiency or frequency of mistakes or their personal temper, being overly harsh will never be a well fulfilled job for them. You feel like you have failed - if you quit/give up, they have also failed. It’s not certain that they see things this way, (me and my supervisor definitely don’t always agree) but you have to be adamant *with yourself* that your best effort is the best you can give. I know it’s a boring old tale, but you CANNOT evaluate yourself based on results, you have to evaluate based on effort. Supervisors reaction is outside your control, the best effort for you is to relay the information about what happen in the best way you can - and then the reaction from them is not your problem. If they try to tell you off, you can either disregard their tantrum (if they are the type to throw these) completely - or you can be even more well-adjusted and even look for useful information in the telling off.\n\n\nSome weeks ago my supervisor got a bit angry in a discussion we had and it’s my belief that he tried to throw some guilt at me because he was displeased with a result. It really doesn’t matter - I just shut up and let him have his moment, but looked for things he was saying that would be of use. At least 2-3 points came across, I wouldn’t have been able to extract that information 6 months ago. It’s all just practice - getting used to that kind of interpersonal “communication challenge”. \n\n\nThat being said, if the working relationship is making you unhappy over the long run, despite your efforts, then of course you gotta leave!\n\nMuch love, nothing is so bad that it’s worth you torturing yourself!",
      "author": "boriswied",
      "created": 1630061741,
      "upvotes": 2,
      "replies": {}
    },
    "haiy5j7": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/haiy5j7/",
      "text": "If your supervisor shout at you...record it and get a lawyer. Prepare all the evidence and draft a formal letter to the school. \n\nThis may be classified as emotional abuse, depending on your current mental conditions.",
      "author": "COFenirr",
      "created": 1630045546,
      "upvotes": 1,
      "replies": {
        "hak9e54": {
          "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/hak9e54/",
          "text": "lol",
          "author": null,
          "created": 1630075621,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "haj4k5m": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/haj4k5m/",
      "text": "Like all other humans, we make mistakes!\nMy supervisor found a very huge mistake in my paper figures before the submission. So I know very well your feelings..but I am glad because a retracted paper is worst than a temporary disappointment from your advisor.\nI worked hard for fixing them, and I tried to be nice to myself instead of punishing myself, and the most important thing is to * understand the mistake*.\nIn my case I analyse what exactly went wrong:\n-busy advisor who didn't pay attention during the face-to-face meetings before the submission\n-incomplete/not appropriate training received\n-working contemporary on too many things\n-poor organisation \n\nTake a breath, go out for a walk, treat yourself with respect because the world is full of people like your advisor. \nYour are not your mistakes.",
      "author": "Visual-Snow4057",
      "created": 1630050805,
      "upvotes": 1,
      "replies": {}
    },
    "hajaq7z": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/hajaq7z/",
      "text": "You have to confront the problem and tell the truth. After that, you should also seriously consider finding an advisor you will feel more comfortable communicating with before continuing your research.",
      "author": "YoreWelcome",
      "created": 1630056190,
      "upvotes": 1,
      "replies": {}
    },
    "hajti13": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/hajti13/",
      "text": "I know the feeling, but it’s just your brain overwhelmed by all this shit you live (and god know we are all kinda messed up) do your best my friend and don’t let fear control your life !!!! YOU ARE A WARIOR YOU CAN FACE THIS SITUATION AND NOBODY WILL STOP YOU",
      "author": "Ismailboul",
      "created": 1630068652,
      "upvotes": 1,
      "replies": {}
    },
    "haktf7l": {
      "link": "/r/AskAcademia/comments/pc8ln4/made_a_mistake_in_my_research/haktf7l/",
      "text": "I'd just get shouted at and ignore the dude.\n\n You're basically free labor, and most PIs need you rather than you needing them.",
      "author": "lednakashim",
      "created": 1630083602,
      "upvotes": 1,
      "replies": {}
    }
  }
}