{
  "sid": "p7b1ju",
  "link": "/r/AskAcademia/comments/p7b1ju/supervisor_is_asking_me_to_switch_parttime_but_i/",
  "title:": "Supervisor is asking me to switch part-time but I don't wanna",
  "text": "Hi everyone, I am a M.Phil student and 21y/o (M). I have my first major review due in 1.5 months time. So, part of the expectation for my Major Review was to submit a manuscript for my experiment 1 but experiment 1 has been hard for me and I only get all my data from experiment 1 by next month which will be a bit too late to get everything ready to submit my manuscript.\n\nThe thing is, I have always been behind in terms of my 2 year project plan particularly when I started my experiment. It’s mostly because the experiment is a bit hard to generate results and also my fault for maybe not trying hard and making so many mistakes. \n\nBut whenever I met with my supervisors they never told me I was behind. They were happy with my progress and tbh I was sometimes surprised myself. But all of a sudden I got an email from my supervisor stating that I am lagging way behind and I should reconsider and change it to part time.\n\nThe thing is his right in some aspects, I am lagging, I haven’t been giving 40 hours a week (I am close to it) and people haven’t seen me around recently (took a week break cause I was depressed and feeling very lonely and needed some time, first break in a year for me).\n\nWhat do I do now. The reason I don’t work as much in weekdays is cause my job demands me to work 4 days a week in the late afternoon, travelling takes 1.5-2 hrs and they don’t see me in the lab also because I don't have lunch with them (Have it while travelling for my job) but I make up for it by spending time at night studying and all day during the weekends in the lab (but no one is around). \n\nThe thing about part time is, it will affect my Visa (I am an international student) and I feel like I have disappointed my family as well. Isolation is never good and being an international student who lives by myself and don't really have anyone to discuss with is daunting. \n\nI love the research but hate the stress :(\n\nAny advice is much appreciated!\n\ntldr: I am a full-time M.Phil student who is being asked to consider part-time all of a sudden and I am panicking and feeling guilty because all this while I was told I was doing alright.",
  "author": "OrangeExciting1151",
  "created": 1629362986,
  "updated": 1634079559,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.63,
  "comments": {
    "h9ih2z3": {
      "link": "/r/AskAcademia/comments/p7b1ju/supervisor_is_asking_me_to_switch_parttime_but_i/h9ih2z3/",
      "text": "Is the studying you do in the evenings really 'making up' for the time you are spending at your job? If you're as behind as you say you are then I suspect not and that's probably the root of your problem. I'd have an open and honest conversation with your supervisor, they may think they're trying to be helpful rather than punishing you, on the other hand going part time might be the alternative to terminating your studies. Only they can answer that.",
      "author": "IntLawprof",
      "created": 1629364791,
      "upvotes": 11,
      "replies": {
        "h9ipoh3": {
          "link": "/r/AskAcademia/comments/p7b1ju/supervisor_is_asking_me_to_switch_parttime_but_i/h9ipoh3/",
          "text": "You are right. My supervisors have been wonderful to me and I think they are trying to be helpful. I am having a discussion with him tomorrow and I will be honest with him . I am also ready to leave my job need be even if I am going to struggle a little bit financially. Thank you for your help! I truly appreciate it.",
          "author": "OrangeExciting1151",
          "created": 1629371678,
          "upvotes": 1,
          "replies": {
            "h9iyl4p": {
              "link": "/r/AskAcademia/comments/p7b1ju/supervisor_is_asking_me_to_switch_parttime_but_i/h9iyl4p/",
              "text": "I always tell students if supervisors are complaining about your hours, what they're really complaining about is your productivity. Aside from the psychos, most PIs wouldn't give a monkeys if you only worked 2h a week but every week you pulled a stunning result out of the bag. \n\nYour PIs aren't being good managers, in as much as they didn't voice concerns with you before your review (the outcomes of reviews should never be a surprise) and now instead of addressing the real issue - your lack of results and progress - they're focussing on your hours and trying to avoid a difficult conversation in which they have to tell you you're not cutting the mustard. Instead they're trying to get you to officially match the hours they perceive you as putting in because they think that sort of solves the issue. \n\nI think your approach is spot on - be honest and give them an alternative proposal which you can sincerely and convincingly commit to. If you need support, be that training, funding, whatever tell them that. If you can suggest a solution do, if not be clear that you need input from them. Try to nail down specifics (on both sides). Many managers would rather an unhealthy peace than go anywhere near a healthy conflict.",
              "author": "ACatGod",
              "created": 1629377085,
              "upvotes": 6,
              "replies": {
                "h9j270a": {
                  "link": "/r/AskAcademia/comments/p7b1ju/supervisor_is_asking_me_to_switch_parttime_but_i/h9j270a/",
                  "text": "Wow, yes I am going in tomorrow with a proposal as to how I am approaching the next month. Thank you for taking the time to write your comment and helping me out!!",
                  "author": "OrangeExciting1151",
                  "created": 1629378924,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h9ij56f": {
      "link": "/r/AskAcademia/comments/p7b1ju/supervisor_is_asking_me_to_switch_parttime_but_i/h9ij56f/",
      "text": "One thing I want to pick up from what you've written is the contradictions over your progress:\n\n> So, part of the expectation for my Major Review was to submit a manuscript for my experiment 1 but experiment 1 has been hard for me and I only get all my data from experiment 1 by next month which will be a bit too late\n\nSo you already knew you were behind schedule there.\n\n> I have always been behind in terms of my 2 year project plan particularly when I started my experiment. It’s mostly because the experiment is a bit hard to generate results and also my fault for maybe not trying hard and making so many mistakes.\n\nAnd you've apparently been consistently behind schedule.\n\n> whenever I met with my supervisors they never told me I was behind. They were happy with my progress and tbh I was sometimes surprised myself.\n\nWell first off, we've established that they shouldn't need to tell you that you were behind, since you could apparently tell that you were behind on your project plan. And did they actually tell you that they were happy with where you were relative to the plan, or did you assume that? Because honestly there seems to be a breakdown of communication for this to come so out of the blue.\n\n------------------------------------------------\n\nOnto the rest. Your supervisor is suggesting you go part time, and you yourself say you haven't been working on this full time, so that kind of makes sense to me. And how could you work on this full time, when you apparently have another job that even if the hours didn't amount to full time, if you add in the travel time it basically does? I'm also wondering if this part time job is actually consistent with the rules of your visa?\n\nNow as you say, your visa won't allow you to move to part time, so that is something that you need to make clear to your supervisor, as they might not have considered that. But you also need to make clear to your supervisor that you're going to justify being a full time student.\n\nThat doesn't have to mean being in the lab the same time as everyone else. Presenteeism is less important if you're actually getting the work done. So you need to get the work done. You need to come up with a plan to make up for your current short fall and to keep yourself on track for your two year plan. Which, I'll break it to you now, is going to require more than 40 hour weeks moving forward, because you've gotten yourself behind. This is likely why your supervisor suggested part time, so you could avoid that. But if you can't do part time, you have to put in the extra time.",
      "author": "foibleShmoible",
      "created": 1629366583,
      "upvotes": 7,
      "replies": {
        "h9irakt": {
          "link": "/r/AskAcademia/comments/p7b1ju/supervisor_is_asking_me_to_switch_parttime_but_i/h9irakt/",
          "text": "Thank you for your comment. Honestly, you are right. Everything you are saying here makes sense. I started to fall a lot more behind in the recent months and there is a little bit of lack of communication during these months too.\n\nThe part time job is consistent with rules of my visa as I don’t work over the time limit. I will just give a bit of context, my job requires me to work 2 hours per day late in the afternoon to evening but because I have a poor morning schedule I tend to spend 4-5 hours in the day time at uni travel an hour to work (I have no car :/ ) and continue my study after work to make up the time. This was totally fine with the writing part but when it came to lab, made it much harder.\n\nYou are right and also since I am working with microorganisms, they take a certain time period to grow so there will be a bit of waiting around. \n\nHonestly, I am not sure what will happen to me but I am having a discussion with him tomorrow. I just hope we can resolve to something. Thanks for this, you have no idea what it means to me!!!",
          "author": "OrangeExciting1151",
          "created": 1629372775,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h9ir8h2": {
      "link": "/r/AskAcademia/comments/p7b1ju/supervisor_is_asking_me_to_switch_parttime_but_i/h9ir8h2/",
      "text": "Thank you for your comment. Honestly, you are right. Everything you are saying here makes sense. I started to fall a lot more behind in the recent months and there is a little bit of lack of communication during these months too.\n\nThe part time job is consistent with rules of my visa as I don’t work over the time limit. I will just give a bit of context, my job requires me to work 2 hours per day late in the afternoon to evening but because I have a poor morning schedule I tend to spend 4-5 hours in the day time at uni travel an hour to work (I have no car :/ ) and continue my study after work to make up the time. This was totally fine with the writing part but when it came to lab, made it much harder.\n\nYou are right and also since I am working with microorganisms, they take a certain time period to grow so there will be a bit of waiting around. \n\nHonestly, I am not sure what will happen to me but I am having a discussion with him tomorrow. I just hope we can resolve to something. Thanks for this, you have no idea what it means to me!!!",
      "author": "OrangeExciting1151",
      "created": 1629372736,
      "upvotes": 2,
      "replies": {}
    }
  }
}