{
  "sid": "l63ds8",
  "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/",
  "title:": "A story about trying to report scientific misconduct",
  "text": "I found an interesting article that I wanted to share, where someone tells their story of what happened when they tried to report scientific misconduct: https://crystalprisonzone.blogspot.com/2021/01/i-tried-to-report-scientific-misconduct.html",
  "author": "randomusefulbits",
  "created": 1611750100,
  "updated": 1634082134,
  "over_18": false,
  "upvotes": 97,
  "upvote_ratio": 1.0,
  "comments": {
    "gkxyfta": {
      "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gkxyfta/",
      "text": "He didn’t even put in the effort to lie. Definitely not saying he should lie. But, wow, it’s eye opening that people can just lie their way into good journals when their lie is so apparent",
      "author": "jasonmoyy",
      "created": 1611752658,
      "upvotes": 31,
      "replies": {}
    },
    "gkzpg5q": {
      "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gkzpg5q/",
      "text": "Thanks for sharing that! Unfortunately [retraction watch](https://retractionwatch.com) is full of similar stories in which scientists use identical tables or even figures in their different manuscripts. Which is so obvious and bold and unimaginable to me that I’m actually amazed. Also sad. But also amazed by their absolute lack of care. And it’s not a single person, usually there is a TEAM of coauthors who must all agree on such procedures.",
      "author": "Jeczke",
      "created": 1611777378,
      "upvotes": 24,
      "replies": {
        "gl016xp": {
          "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gl016xp/",
          "text": "I'm not super fussed about re-using a table, per se. A table is a set of numbers - if they're used, say, in the methods section, the same methods can be reported in several papers (especially when reviewer 2 does not accept \"as per our previously described methodology\" when trying to avoid it). Or in commentaries.\n\nIf people are re-using their figures in original research papers, then yikes.",
          "author": "ThePhysicistIsIn",
          "created": 1611781869,
          "upvotes": 7,
          "replies": {
            "gl02nge": {
              "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gl02nge/",
              "text": "Yes sorry maybe that was nit clear. It’s about a phenomenon in which the same data (tables, statistical tests, graphs or microscope visualisations) are used as new studies with new results, claims etc. \nI mean if universities do not punish that kind of behaviour they are basically predatory universities, just like predatory journals but on the institutional level. And that is scary for scientific integrity. I always considered that in terms of a personal issue. Sort of “how can you look at yourself in the mirror?” but the author of that blog post actually brings an important point in which data like that, especially fabricated samples of thousands, really impact the future meta-analyses.",
              "author": "Jeczke",
              "created": 1611782461,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "gkzjini": {
      "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gkzjini/",
      "text": "Thanks for posting. That's an interesting and distressing story. It also gives rise to some very important questions concerning reviewers and either their competence or the work they did (or did not!) do in the reviews.",
      "author": "rockyfaceprof",
      "created": 1611774477,
      "upvotes": 6,
      "replies": {}
    },
    "gl1epy7": {
      "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gl1epy7/",
      "text": "Thank you very much for sharing. I have to agree with the inefficiency of the editor-in-chief of Children and Youth Services Review. I have emailed repeatedly, to complain about unfair reviews that I have received for my paper with no response. I was forced to just write a very detailed 'Response to Reviewers' rebutting almost  everything Rev #3 commented. My paper is finally published but it was not a good experience.",
      "author": "thesocialworkout",
      "created": 1611801791,
      "upvotes": 3,
      "replies": {}
    },
    "gkzq1j7": {
      "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gkzq1j7/",
      "text": "Good for him for doing the efforts to try and get this retracted. But, tbh, you shouldn't trust anything that comes from China in the first place. They make up the overwhelming majority of caught fake data, and I don't want to know how much that isn't caught. The problem is so pervasive that it discredits honest work coming from that country. I got my project stolen and paper held in peer review for 1.5 years before two chinese authors published the same thing one month before acceptance. Only their results showed a cure while mine had only minimal effects. The project was so oddly specific that literally nobody had a reason to also be working on it. From that day, I stopped believing anything coming from China. If reviewers and editors don't want to do their part in stopping the problem, than just do your part by ignoring their blatant lies. Don't cite, reject in peer review, don't even read.",
      "author": "ActionXPotential",
      "created": 1611777612,
      "upvotes": 14,
      "replies": {
        "gl0foxx": {
          "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gl0foxx/",
          "text": "Do you by chance have any sources for the claim that Chinese researchers are responsible for the overwhelming majority of cases where someone is caught fabricating/falsifying data?",
          "author": "illmaticrabbit",
          "created": 1611787620,
          "upvotes": 6,
          "replies": {
            "gl0k3j0": {
              "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gl0k3j0/",
              "text": "Here is for fake peer review. 74% of all papers analyzed were chinese.\n\nhttps://retractionwatch.com/2016/09/27/what-publishers-and-countries-do-most-retractions-for-fake-peer-review-come-from/\n\nThis one states that total retractions regardless of reason or pub frequency are highest in america, but the sampling dates covered areas where china hadn't boomed. It shows the recent trajectory of Chinas lies and it's frightening. Keep in mind, they publish a TON of papers in total so having such a high frequency per paper retraction is frightening. While american isn't innocent, it's retraction rate is amongst the lower end.\n\nhttps://www.biorxiv.org/content/10.1101/2020.04.29.063016v2.full\n\nThis one confirms that Chinas retractions are highest  for plagiarism and duplicate publications. \n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3988779/\n\nI would also love to know how many of the american retractions are from foreign authors. Every professor I know that has been in trouble for plagiarism was foreign, mostly chinese.",
              "author": "ActionXPotential",
              "created": 1611789438,
              "upvotes": 10,
              "replies": {
                "gl13866": {
                  "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gl13866/",
                  "text": "Thanks for the detailed followup. After a quick look at your sources, I’m not sure if they support the idea that the “overwhelming majority” of caught fake data is from China, but I do see some reason for concern.",
                  "author": "illmaticrabbit",
                  "created": 1611796707,
                  "upvotes": 3,
                  "replies": {}
                },
                "gl0rng7": {
                  "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gl0rng7/",
                  "text": "This is a bad argument. The large number of retractions come from publishing the most number of papers. These old papers don't scale vs the number of papers published. In fact, an Indian or Iranian paper is more likely to be retracted than a US or China paper. https://pubs.acs.org/doi/10.1021/acs.chemmater.9b00897 (figure 1, right)",
                  "author": "heliumagency",
                  "created": 1611792604,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gl4gl3s": {
      "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gl4gl3s/",
      "text": "Power wins almost inevitably. The only two cases where it did not were  Christopher Gillberg and Paolo Macchiarini and then it took many years...\n\nI was involved in understanding misconduct in coauthorship and it led nowhere: [https://www.salon.com/1999/06/14/scientific\\_authorship/](https://www.salon.com/1999/06/14/scientific_authorship/)\n\nAnd when the inventor of the mRNA vaccines wanted to do research, she was stopped:\n\n[https://soundcloud.com/user-88491014/katalina-kariko-is-the-real-deal](https://soundcloud.com/user-88491014/katalina-kariko-is-the-real-deal)\n\nThere is no fairness in science.",
      "author": "Such_Possession4553",
      "created": 1611856510,
      "upvotes": 1,
      "replies": {}
    },
    "gl0599o": {
      "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gl0599o/",
      "text": "[deleted]",
      "author": null,
      "created": 1611783485,
      "upvotes": -13,
      "replies": {
        "gl0nazd": {
          "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gl0nazd/",
          "text": "Don't believe the hype. The \"top\" journals do it too, probably even more so sometimes. Some well-connected, big-name folks don't get desk rejected like most people, and being reviewed is no guarantee of quality, especially in fields where lots of pseudo-science is being practiced in general, nobody dares to call out the big names for this, so they just keep getting published using the same tired old narratives while people asking new questions and doing quality research on them are blocked if they challenge the old guard. This leads to \"top\" journals being full of crappy research.",
          "author": "encom-mcp",
          "created": 1611790822,
          "upvotes": 7,
          "replies": {
            "gl0nhv3": {
              "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gl0nhv3/",
              "text": "[deleted]",
              "author": null,
              "created": 1611790914,
              "upvotes": 0,
              "replies": {
                "gl0ojue": {
                  "link": "/r/AskAcademia/comments/l63ds8/a_story_about_trying_to_report_scientific/gl0ojue/",
                  "text": "Yeah well below some threshold, there are just crappy journals. But some mid-tier ones are really good, it really depends on the editors.",
                  "author": "encom-mcp",
                  "created": 1611791357,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}