{
  "sid": "p3ywgi",
  "link": "/r/AskAcademia/comments/p3ywgi/using_professional_development_funds_to_help/",
  "title:": "Using Professional Development Funds to Help Advance My Career",
  "text": "I want to know if anyone has any ideas about online education programs (degrees or certifications) around $7-10,000 that I can do to use professional development money. Currently, I am an assistant dean at a state school (that does not have doctorate degrees), but I want to see if I can open up new doors for myself in higher education. I have an MSW and an MBA and I enjoy learning about sociology and business. I was looking at online EdDs but those are expensive and probably offer little value for the expense, but I found some cheap EdS programs online. Does anyone think that would add any value to my career?  Any thoughts on what to do with this money (before it expires) would be great. It can be any kind of suggestion, I just need to use the money! Thanks!",
  "author": "dolphin-walrus",
  "created": 1628905226,
  "updated": 1634079641,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "h8y6993": {
      "link": "/r/AskAcademia/comments/p3ywgi/using_professional_development_funds_to_help/h8y6993/",
      "text": "What is your career goal? I don't know how we can give you advice without understanding that.\n\nCan you spend the money to travel to a (useful) conference or seminar? Honestly, an online EdD sounds like a total waste of money (and may not help your career if it is not a well regarded program-- academics in particular tend to view \"degree mill\" type of credentials as being worse than having no credential because it signals you either don't take your own education seriously or that you don't understand the difference between good and nonsense programs).",
      "author": "DeskAccepted",
      "created": 1628971464,
      "upvotes": 2,
      "replies": {
        "h93e63f": {
          "link": "/r/AskAcademia/comments/p3ywgi/using_professional_development_funds_to_help/h93e63f/",
          "text": "Thanks for the response. That makes sense about the EdD. My career goal is to stay in higher education in administration. I understand since I am not  a faculty member, I most likely will not move beyond the assistant dean level (I work at a higher ranked US News business school).  However, I also teach at a community college (Marketing) and I would love to to work there full-time with more teaching experience.\n\nI also can spend the money on a conference/seminar.",
          "author": "dolphin-walrus",
          "created": 1629071606,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h8wbqzn": {
      "link": "/r/AskAcademia/comments/p3ywgi/using_professional_development_funds_to_help/h8wbqzn/",
      "text": "You have the masters, what you need is a doctorate or terminal degree in a subject to be fully \"legitimate\" in higher education.  It will allow you to move up at the place you are at or as you seek better opportunities elsewhere.  Terminal Degree includes the JD - all coursework, no dissertation, no language required.  It's a very useful degree even if you do not practice - but if you stay in HE it gives you the respectability you need.",
      "author": "KrysG",
      "created": 1628938731,
      "upvotes": 0,
      "replies": {
        "h93eb5p": {
          "link": "/r/AskAcademia/comments/p3ywgi/using_professional_development_funds_to_help/h93eb5p/",
          "text": "Thanks for the response. I appreciate the insight on the JD.",
          "author": "dolphin-walrus",
          "created": 1629071674,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}