{
  "sid": "2ixv41",
  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/",
  "title:": "I just gave up on my dissertation...",
  "text": "and officially withdrew from my Ph.d. program after working toward it for 8 years.  The grief and shame is almost more than I can bear. help.\n\nEDIT:  Jeeze -- thank you all (almost all) so much for the huge number of kind replies -- I cried a lot reading them (but a in a good way).  It helps a bit.  I want you to know that your kindness matters.\n\nThe worst is that I felt it wasn't my decision, but my pathologies' decision.  I felt it was out of control.  There's no reason I shouldn't have finished.  I cannot offer you a clear reason -- even after working with a therapist.  The closest thing I can say is that it felt like fear.  I don't know that it WAS fear, but it was related to fear somehow.\n\nThank you all very much.\n\nP.S. It was English Lit -- and I was doing quite well.",
  "author": null,
  "created": 1413030123,
  "updated": 1634080064,
  "over_18": false,
  "upvotes": 593,
  "upvote_ratio": 0.97,
  "comments": {
    "cl6imhb": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6imhb/",
      "text": "I have friends who've quit their PhDs at various points and, dude, they're doing well in life, truly enjoying paths they'd never even thought of before leaving.\n\nAcademia can be a bit of a cult. All your advisors, department heads, etc. got there because they're passionate about their subject and couldn't imagine wanting to do anything else, and so threw enormous amounts of energy (and no small amount of luck) into getting where they are today. That's great if it's making them happy, but the downside is that as a student, everyone you look up to thinks that academia is the ultimate goal that everyone should strive for, and can't think of leaving as anything other than failure. This manifests in obvious ways (e.g. in scientific fields, moving into industry is \"selling out\" or \"joining he dark side\"), but also in more subtle shifts in attitude when talking about other options. \n\nCoupled with this is the fact that, as a grad student, you've always been really good at school. Being smart and good at your subject, and being able to say \"I'm a [subject]ist!\" is probably a major part of your identity, and a big source of self-respect. With so much of your identity tied up in your status as a grad student, it's easy to think \"I'm doing badly at school so I'm a worthless person\". This is NOT true. Sure, being a grad student has sucked up a lot of your attention, but it's not the sum total of who you are. Your friends and family don't love your ability to bash out an essay after three hours' sleep, they love and respect you for who you are, and still will tomorrow. \n\nThere's also a very real chance that this is the first big thing you've *ever* \"failed\" at, which makes it seem catastrophic and life-destroying. This is not true either. People miss life goals, have major setbacks, and experience soul-crushing failures all the time. But we pick ourselves up, dust off, and slowly a new path and a new goal appear. It's possible that you don't have the practice at that, at least not with stuff that feels this big. Don't get me wrong, this would suck for *anyone*, and feeling bad is totally understandable. My point is that slowly, and with plenty of missteps along the way, you're going to surprise yourself with your resilience.  \n\nAll of which is to say: If you choose to leave academia, that's OK. A PhD is a means to an end, not a way of life or the core of your identity. Grief is a totally rational reaction to closing the doors on whatever career you'd imagined, and shame is a totally understandable response to leaving the cult of academia and putting a dent in your self-image. But those will heal. Hopefully you've met some great people and learned some great stuff. If it's not for you, then that's something you've learned too. Life is not over, just because you've quit a course. \n\nRight now: Talk to someone you can rely on (family, close friends). You're probably expecting them to be disappointed in you but, I promise you, their only concern will be that you're OK. Get your support network in place, then book whatever time you can to just crash and get your head in order, including human contact (even if it's just phonecalls) so you don't just spiral into deeper misery.\n\nFinally, for now, get the contact info for your school's mental health services and make an appointment. I guarantee that this sort of thing is completely normal to them, and they'll have some great resources to help with all of this. Even if your changing status at the uni means that they can't treat you, they're the best people to recommend an external service for you to contact.\n\nAfter all this: It really sounds like you can't (couldn't?) write due to stress, depression or whatever. Talk to the schoo's mental health people about this, too. This is really common, and if you want then you might be able to change your \"I quit\" to a temporary withdrawal, spend some quality time with a shrink, and come back to attack your thesis with some shiny new coping mechanisms. Mental health issues amongst grad students are alarmingly common: your school knows this, and will have procedures in place to help you deal. \n\nIt's totally OK to just walk away and try a new path, if that's what you want. It's probably still possible to get help, take a break and then re-attack your thesis, if *that*'s what you want. Either way: what your're feeling now sucks, is totally valid, and will fade with time.\n\n\n**EDITED to add:**\nI'm really touched by all your replies. I can't decide whether it's flattering or horrifying that this resonated so strongly with so many people. Take care of your mental health folks, balance is important. (...he said, as if he were any kind of authority on the subject)",
      "author": "RedBugs",
      "created": 1413036389,
      "upvotes": 2327,
      "replies": {
        "cl6qctk": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6qctk/",
          "text": "This is exactly what I needed to hear right now, and I didn't even know it. Thank you so much.",
          "author": "radiogekko",
          "created": 1413056217,
          "upvotes": 549,
          "replies": {
            "cl732io": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl732io/",
              "text": "As a rather successful uni professor in engineering, please let me back up what everyone is saying here. I've completed to date 29 graduate students, many who have gone on to good careers. I have also seen six leave for a variety of reasons, and they are generally happy after having come to terms with leaving. \n\nI'm proud of all of them regardless, and it has been an honor to be entrusted with supervising them. \n\nGetting a PhD won't make you happy, and not getting one sure isn't the end of the world. Sadly, many of my academic colleagues make their second-guessing graduate students feel like dirt for even thinking of giving up. I am continually appalled at their behaviour in pretending that leaving academia is equivalent to abandoning some higher calling in life. It won't define your future and who you are, and for some it will close more doors than it will open. Consider that for many profs, all they have ever known is school, and so they are poorly equipped if at all to advise anyone on what choices are best. Don't you take what they say seriously for a second. Get advice from others. \n\nWhatever you decide, you will be fine because you are you: you had the fortitude to do well in school and that will serve you well into the future. After you set yourself straight, you'll go forth and find a way. \n\nGood luck and hang in there. \n",
              "author": null,
              "created": 1413086155,
              "upvotes": 33,
              "replies": {}
            },
            "cl6ulsq": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ulsq/",
              "text": "I always thought I'd be a Ph.D., but I stopped after my MA. I didn't run out of passion, I ran out patience with the people in the system. Some people think their goal is to make it hard, set up roadblocks. Possibly some of that. But there has to be SOME path to success, and when it's just turns and turns and more turns, there is no path. If it's still possible, retract the formal withdrawal, take a break, and if possible, come back to it when there are new players in the game or you feel re-energized. Nothing is final in education. You have those credits banked, and they can't take them away. Find out how long they are valid and use your time. And smile. Jesus, I know some of reddit have seen this post, but 7.5 billion people aren't watching, don't care, wouldn't care if you asked. And that's kind of freeing. ",
              "author": "MTknowsit",
              "created": 1413066077,
              "upvotes": 122,
              "replies": {
                "cl6xmyg": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6xmyg/",
                  "text": "I felt very similar to you while I was earning my MD.  The preceptors, advisors, faculty always felt like they were against us students.  It was a malignant environment.  You are creating healers but you have jaded them beyond belief.  You have created the most cynical human beings possible and they are charged with caring for other human beings.  The system is pretty fucked up in medicine as well as academia.  Just my two cents.",
                  "author": "Zygomycosis",
                  "created": 1413073070,
                  "upvotes": 48,
                  "replies": {
                    "cl6yqqk": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6yqqk/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1413075622,
                      "upvotes": 12,
                      "replies": {
                        "cl6yzii": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6yzii/",
                          "text": "Maybe things have changed a little bit.  I hope.  It was completely at odds with patient centered care/learning.  Students sabotaging each other, residents/attendings abusing student responsibilities, demoralizing Pimping.  Does that still go on?  I'm not that far out <10 years.\n\n*I had some wonderful attendings that I still attempt to emulate to this day.  They were the minority though.",
                          "author": "Zygomycosis",
                          "created": 1413076200,
                          "upvotes": 9,
                          "replies": {
                            "cl720w5": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl720w5/",
                              "text": "I'm a paramedic, not an MD, but if you were heard complaining about this they'd label you a whiner or that you were making excuses.\n\nI'd say the medical field as a whole is fairly toxic to be in.",
                              "author": "theth1rdchild",
                              "created": 1413083473,
                              "upvotes": 10,
                              "replies": {}
                            },
                            "cl6zf7z": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6zf7z/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1413077236,
                              "upvotes": 5,
                              "replies": {
                                "cl6zm4b": {
                                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6zm4b/",
                                  "text": "That's good to know.  It was basically - throw everyone to the wolves and see who survives, when I was in school.  Nice to see the medical education changing for the better.\n\nIt was basically every man for themselves when I was in school. \n\nGood luck and keep your positive attitude, God knows we need it in modern medicine.",
                                  "author": "Zygomycosis",
                                  "created": 1413077672,
                                  "upvotes": 7,
                                  "replies": {}
                                },
                                "cl77b9b": {
                                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl77b9b/",
                                  "text": "> I chose to go to a lesser known school so I'm not sure if it's worse at top schools or not\n\nFrom what I've heard, it is.  I think if you're not one of those self-righteous douchebags (basically) then you're better off not going to a \"top\" school.  It'll just make you feel like crap.  I've known plenty of people from my uni who were able to go to the top university in the state, but chose not to because the students and teachers were so full of themselves.",
                                  "author": null,
                                  "created": 1413102264,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            },
                            "cl7938d": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7938d/",
                              "text": "That sounds like the school had competitive grading throughout the whole system. The school I went to (top 5 at the time, not sure where they are today) has pass/fail the first 2 years and after that, straight scale. There wasn't any of that competitive bullshit. The schools really need to put more attention into developing supportive physicians who can work as a team rather than fighting against each other. \n\nI'm pretty grateful for my school now, having heard how some other schools are. ",
                              "author": "Junkmunk",
                              "created": 1413113274,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "cl74rg0": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl74rg0/",
                      "text": "You weren't jaded before getting into medical school? Jesus, our country needs so many more doctors we have now and universities are full of smart students that are never going to get into medical school. ",
                      "author": null,
                      "created": 1413091260,
                      "upvotes": 1,
                      "replies": {
                        "cl7n3i9": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7n3i9/",
                          "text": "Yes I was jaded.   Medical school just brought it to an amazing level. I look back and I fucking cringe how mentally unstable I was at the time.  It was honestly a very dark period in my life.   You see how residents and students are offing themselves or at least thinking about it.  Fucking sad.",
                          "author": "Zygomycosis",
                          "created": 1413148248,
                          "upvotes": 1,
                          "replies": {
                            "cl7o2um": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7o2um/",
                              "text": "I have a friend that has an amazing GPA and just did terribly on the MCAT and he's a step short of needing to be put on suicide watch. His entire life just came down to a standardized test and poof!",
                              "author": null,
                              "created": 1413150213,
                              "upvotes": 1,
                              "replies": {
                                "cl7ve6b": {
                                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7ve6b/",
                                  "text": "The stakes only get higher as you go further.  It's a stressful ride.",
                                  "author": "Zygomycosis",
                                  "created": 1413165729,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "cl6x3r8": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6x3r8/",
                  "text": "I love this message, but those \"banked\" credits dissappear over time.",
                  "author": "LadyFaye",
                  "created": 1413071875,
                  "upvotes": 11,
                  "replies": {
                    "cl6zd9r": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6zd9r/",
                      "text": "7 years to complete at my school.  1 year extensions were common.  Additional extensions were heard of, but no one heard or a 3rd extension.\n\nMuch of academic procedures is based on lore, and structures have some flexibility, except when you run into the silverback douchebag.",
                      "author": "Kansas_John",
                      "created": 1413077109,
                      "upvotes": 12,
                      "replies": {
                        "cl778jq": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl778jq/",
                          "text": "> silverback douchebag.\n\nBrilliant.",
                          "author": null,
                          "created": 1413101857,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "cl71piq": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl71piq/",
                      "text": "How long do college credits usually last?",
                      "author": "Griffin-dork",
                      "created": 1413082711,
                      "upvotes": 1,
                      "replies": {
                        "cl7gxkv": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7gxkv/",
                          "text": "It depends on your school. I think it averages about 7 years though.",
                          "author": "LadyFaye",
                          "created": 1413136343,
                          "upvotes": 1,
                          "replies": {
                            "cl7hn5w": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7hn5w/",
                              "text": "Ah okay. Thanks for the reply. Im actually going to be leaving my university after this semester. Im just tired of being unhappy where I am. Im miserable and just tired of it. I will most likely transfer my credits elsewhere and end up finishing my degree down the road a little. Right now however, im not learning anything and im miserable. Its time to make changes.",
                              "author": "Griffin-dork",
                              "created": 1413137675,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "cl6zfql": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6zfql/",
                  "text": "I hit a wall about halfway through my law degree. I needed to stop.  I did eventually come back to it, but it was important at the time that it felt like walking away permanently, so I could grieve for and get over the self I was trying to build when I started the degree as a teenager... and I came back in a few years as a different person and finished it for my own adult reasons.  Whatever you do, the important thing is to own it and don't try to rush through any of the grieving, reflection, and learning processes.",
                  "author": "sayswut",
                  "created": 1413077266,
                  "upvotes": 8,
                  "replies": {
                    "cl8c2wh": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl8c2wh/",
                      "text": "What is law school like?!\n\nI'm in basic sciences and have heard fun things about law school..",
                      "author": "steveysaurus",
                      "created": 1413219406,
                      "upvotes": 1,
                      "replies": {
                        "cl8jkk8": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl8jkk8/",
                          "text": "You might really enjoy it. I found it like having a lobotomy designed to specifically target my common sense, intuition, emotional intelligence and creativity. I'm now studying applied science in public health.  ",
                          "author": "sayswut",
                          "created": 1413233716,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "cl6v68c": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6v68c/",
                  "text": "And lots of those people work in HR",
                  "author": "AHSfav",
                  "created": 1413067412,
                  "upvotes": 9,
                  "replies": {}
                },
                "cl70jfg": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl70jfg/",
                  "text": "What phd program does that?",
                  "author": "nnavroops",
                  "created": 1413079896,
                  "upvotes": 1,
                  "replies": {}
                },
                "cl6xvy3": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6xvy3/",
                  "text": "its not even as if you need to be skilled to get a phd. Connections and enough time is everything you need.\n\nA mate who constantly had worse marks than me (same university course) simply got it offered from a prof where he did his master thesis. Sure thing he took the opportunity .",
                  "author": null,
                  "created": 1413073643,
                  "upvotes": -6,
                  "replies": {}
                }
              }
            },
            "cl6w985": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6w985/",
              "text": "[deleted]",
              "author": null,
              "created": 1413069950,
              "upvotes": 36,
              "replies": {
                "cl6x2ig": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6x2ig/",
                  "text": "What line of work did you go into, if you don't mind my asking?",
                  "author": "justmefishes",
                  "created": 1413071799,
                  "upvotes": 4,
                  "replies": {
                    "cl6xb79": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6xb79/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1413072338,
                      "upvotes": 12,
                      "replies": {
                        "cl6ywy6": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ywy6/",
                          "text": "I just left with an MA in philosophy. That job sounds great! Do you have any advice for getting into that profession?",
                          "author": "drwolffe",
                          "created": 1413076029,
                          "upvotes": 6,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "cl7d6zi": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7d6zi/",
                  "text": "How did you get into technical sales?",
                  "author": "deteugma",
                  "created": 1413128335,
                  "upvotes": 1,
                  "replies": {
                    "cl7dah7": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7dah7/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1413128573,
                      "upvotes": 2,
                      "replies": {
                        "cl7dbd4": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7dbd4/",
                          "text": "Dammit, everybody gets jobs through friends.  Where in the country are you?  Also, your username: high-intensity interval training?",
                          "author": "deteugma",
                          "created": 1413128635,
                          "upvotes": 1,
                          "replies": {
                            "cl7did5": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7did5/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1413129108,
                              "upvotes": 2,
                              "replies": {
                                "cl7dlqd": {
                                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7dlqd/",
                                  "text": "I'm a [redacted] PhD who happens to look like a jocky jerk in real life.  Embrace it.",
                                  "author": "deteugma",
                                  "created": 1413129334,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "cl74jms": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl74jms/",
              "text": "Yeah I quit my Ph.D program in Anthropology 3 years ago. I am about to graduate from nursing school in December.",
              "author": "AzureCuzYeah",
              "created": 1413090533,
              "upvotes": 6,
              "replies": {}
            },
            "cl7bs1g": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7bs1g/",
              "text": "From when I was a kid, I wanted to be a researcher and I wanted to teach at the University level . I was excellent at science and worked in labs as an undergraduate. After my  bachelors, I did some postgraduate research in a new lab. My PI was a micromanager and was difficult to work for. I was applying to various schools for my PhD to keep chugging on this path, did great on my GRE, etc. As I was doing this, I realized that professors saw teaching as a chore and their lives were more papers and grants than wet lab work. I was thinking about my research all the time and I could barely sleep. This career I had wanted for years just wasn't working for me. In the end, I left it and didn't go to grad school. I had realised that getting my PhD would be going deeper down this hole I wasn't enjoying. I was unemployed for a while, thought I'd try teaching, but then I was offered a job in a totally different field (one I knew nothing about and didn't even expect to like). I made more money, and I loved this new job. It was 8-5 (labs never are) and I never worried about it once I left. \n\nComing to terms with such a huge life decision was hard, I felt like I had disappointed my ten year old self, but I'm happy now and I know I made an excellent decision. Things will be okay OP. ",
              "author": "CumquatDangerpants",
              "created": 1413124483,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "cl6wi5s": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6wi5s/",
          "text": "thank you.  ",
          "author": null,
          "created": 1413070519,
          "upvotes": 36,
          "replies": {
            "cl8kgfg": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl8kgfg/",
              "text": "[deleted]",
              "author": null,
              "created": 1413235449,
              "upvotes": 3,
              "replies": {
                "cl8l2mb": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl8l2mb/",
                  "text": "you're very kind.  thank you.",
                  "author": null,
                  "created": 1413236681,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "cl6s8i4": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6s8i4/",
          "text": "Checking in as someone who got his PhD and is now likely leaving academia because adjuncting doesn't pay the bills and higher education is broken ...what you've said is all true, and great advice. The rest of like is there outside of academia.",
          "author": "brotherbock",
          "created": 1413060587,
          "upvotes": 59,
          "replies": {
            "cl6u9jz": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6u9jz/",
              "text": "I hear you my friend. I was in academia 7 years (3.5 as a PhD in the UK and 3.5 as a research fellow in a European Union research project). I jumped into industry after all that time. \n\nThe majority of the colleagues are fine, I also liked that I had the chance to travel to a lot of countries (there were 11 institutions from 9-countries in my project). But I didn't like the general \"publish or perish\" atmosphere which was felt day to day. \n\nNow I am really enjoying myself in a startup which lets me have fun with what I like doing. For me, the main reason to get into the academic route was because my father has been a researchers all his life.  But, after trying it for some time, I think I prefer more \"practical\" stuff and don't enjoy writing reports at all.\n\n\n\n",
              "author": "xtracto",
              "created": 1413065261,
              "upvotes": 6,
              "replies": {}
            },
            "cl6sjql": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6sjql/",
              "text": "what's broken with higher education?",
              "author": "throwapeater",
              "created": 1413061296,
              "upvotes": 12,
              "replies": {
                "cl6tl2q": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6tl2q/",
                  "text": "It's a nasty cycle of being forced to do research and publish, whether or not that research is of high quality or not. This starts at the Masters level and continues all the way up the chain until you finally get tenure. At any point along the line, through masters, phd, assistant professor, associate professor, full professor and tenure, if you fuck up and don't get promoted to the next level, you're pretty much done at the school you're working at.\n\nYou can sink 10-15 years at a university, go in for tenure review, and if you don't get it you *might* get a second shot at it in a year or two, but after that you're basically done. Some schools even go so far as firing you under the premise that if you aren't good enough to get tenure, you aren't good enough to be working at that school.\n\nIt's rough, and that's one of the reasons that I got out of the academics game.",
                  "author": "brilliantjoe",
                  "created": 1413063665,
                  "upvotes": 64,
                  "replies": {
                    "cl6v6ln": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6v6ln/",
                      "text": "This sounds a *lot* different from my father's experience of (medical research) academia (I only have 2xBSc and work in private industry, can't really comment for myself): he's in his late 70s now, and yes, back then it was also publish or perish, but it was also common knowledge that free academic positions were *always* given to outsiders, never promoted from the inside - get fresh blood in the system, move the old hands to fresh pastures before they ossify. This meant that after a few years, he was on the lookout for a new, better position, and this \"you're pretty much done at the school you're working at\" was built into the equation from the beginning - at least until tenure. And even then, he kept moving up by moving out.\n\nSo, I'm curious, has this changed? Is/was it only medical academia? Do you know or know how one could find out?\n\nSide note: this was really hard on us kids - we moved 7 times while I was growing up.",
                      "author": "wh44",
                      "created": 1413067435,
                      "upvotes": 10,
                      "replies": {
                        "cl6w4wi": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6w4wi/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1413069674,
                          "upvotes": 14,
                          "replies": {
                            "cl7506z": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7506z/",
                              "text": "And I think you are encouraged to move around between Master/PhD, Phd/Postdoc, Postdoc/Professor as well.",
                              "author": "ITwitchToo",
                              "created": 1413092100,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        },
                        "cl768c2": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl768c2/",
                          "text": "This certainly also depends on the school.\n\nA lot of the Ivy League schools have been well-known for hiring younger adjuncts and instructors and whatnot, using them for a few years, and then discarding them, and literally never hiring from within, for literally centuries. However, a lot of schools certainly did hire from within 20 years ago (which is when I'm familiar with) and before. If they don't now, that is certainly a new thing. And I suspect your father's experience was at rather high-class (top 50, maybe even top 20) medical research universities exclusively.",
                          "author": "FredFnord",
                          "created": 1413096874,
                          "upvotes": 3,
                          "replies": {
                            "cl77xr8": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl77xr8/",
                              "text": "Nailed it. All of the universities are top 50.",
                              "author": "wh44",
                              "created": 1413105925,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "cl74r2k": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl74r2k/",
                      "text": "In my expense, tenure is typically a very transparent process made at the assistant to associate prof transition some 5 years in. There are committees in place that let you know what you have to do, and it is clear at least two years in advance which way it will go. But yes, unforunately it is highly unlikely you will stick around if you don't get it the first time around, but not the end of the world ",
                      "author": "dr_cpj",
                      "created": 1413091227,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "cl6xl1b": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6xl1b/",
                      "text": "This is depressing :( I didn't realise how hard it is once you're done studying. Maybe this is why there aren't many professors at my university",
                      "author": "ineffable_mystery",
                      "created": 1413072949,
                      "upvotes": 1,
                      "replies": {
                        "cl6xxs5": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6xxs5/",
                          "text": "The most depressing thing is when you realize that you aren't doing research because it's interesting or game changing, but targeting research at what will bring in the most funding from outside sources.",
                          "author": "brilliantjoe",
                          "created": 1413073760,
                          "upvotes": 9,
                          "replies": {
                            "cl6z7ya": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6z7ya/",
                              "text": "My research is interesting (to me at least) but I'm quite aware that it's pharmaceutically funded. It's sad because heaps of my fellow classmates do conservation related study and, while it's important, they don't get nearly the same funding :/",
                              "author": "ineffable_mystery",
                              "created": 1413076765,
                              "upvotes": 4,
                              "replies": {}
                            },
                            "cl7fmbe": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7fmbe/",
                              "text": "If what you're working on is indeed game-changing, it should command a fair amount of outside funding. I'll piss and moan about funding as much as any scientist, but being able to sell yourself to NSF/NIH isn't a skill to neglect.",
                              "author": "aurochal",
                              "created": 1413133832,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "cl72z2v": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl72z2v/",
                      "text": "I was so happy to read this. Just because research is published, doesn't mean it was good research. My favorite part of my scientific inquiry class while I was working on my masters was comparing research articles. Our professor actually gave us an assignment to find all the research mistakes in a horribly written article that actually made it to publication. ",
                      "author": "aggr1103",
                      "created": 1413085902,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "cl6uott": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6uott/",
                      "text": "This nasty cycle you speak of, isn't that just a function of the American culture and its inability to make \"tough\" decisions in hiring/firing/promoting?  \n\nAlthough the internal processes of academic administration are faulty; I don't see how this is enough proof to justify the brokenness of the whole system.",
                      "author": "throwapeater",
                      "created": 1413066273,
                      "upvotes": -3,
                      "replies": {
                        "cl6vpvj": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vpvj/",
                          "text": "It also promotes itself as a game, which is a huge problem.  When I have advisers telling me to take x class because \"It's an Easy A\", you're basically telling me \"The way to get ahead is to cut corners\".",
                          "author": null,
                          "created": 1413068705,
                          "upvotes": 12,
                          "replies": {}
                        },
                        "cl6wnz2": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6wnz2/",
                          "text": "There is far more mobility in industry; it's possible to become virtually promoted by simply changing jobs every few years and accumulating experience. Not so in academia. It's grad school -> (usually, now) post-doc -> assistant professor -> tenure. Fuck up and it's like that period of your life simply didn't happen.",
                          "author": "commentguy123",
                          "created": 1413070896,
                          "upvotes": 4,
                          "replies": {
                            "cl6xhfm": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6xhfm/",
                              "text": "Yep. Or get tired of your old ass sexist advisers lab and tell him you are sick of it. Works the same.",
                              "author": "LadyFaye",
                              "created": 1413072726,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        },
                        "cl769nq": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl769nq/",
                          "text": "> This nasty cycle you speak of, isn't that just a function of the American culture and its inability to make \"tough\" decisions in hiring/firing/promoting?\n\nNo. In a lot of cases, schools hire people who they have no intention of ever offering tenure to... they just want to use them up and then toss them away. Women tend to get this much more often than men, especially in the hard sciences but often elsewhere as well. Some schools have a reputation for this (coughPrincetoncough) but in other places you just have to be psychic to know when you're about to waste X years of your life chasing tenure that has already been preemptively denied you.",
                          "author": "FredFnord",
                          "created": 1413097036,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "cl6tug0": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6tug0/",
                  "text": "What /u/brilliantjoe said, plus many universities are cutting costs by hiring adjuncts (lecturers, instructors, \"visiting\" profs) instead of actual professors, or alternatively ditching adjuncts and making the profs take on more or larger classes. Either way it means there's a shrinking supply of decent jobs in the field.",
                  "author": "editer63",
                  "created": 1413064270,
                  "upvotes": 17,
                  "replies": {
                    "cl6uqlq": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6uqlq/",
                      "text": "You and brilliantjoe are addressing problems with administrative part of higher education.  Is this the root of the brokenness of the higher education system?\n\nAlso, PhD's have a lot more options than the academic track.",
                      "author": "throwapeater",
                      "created": 1413066393,
                      "upvotes": 2,
                      "replies": {
                        "cl733po": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl733po/",
                          "text": "They do have more options, but those options aren't always easy.  In scientific fields, for example, scientist positions in industry aren't growing a whole lot faster than academic positions are.  So you're left with movement into more diverse things, like technical writing, consulting, etc.  And there you meet a whole slew of new problems:\n\nWhere in academia, you're qualified, but everyone's always asking \"are you good enough to get this fellowship/tenure/promotion?\", in outside industries people always admit your intelligence/capability, but ask \"why should we believe you're qualified to do this job if you've never done it before\"?\n\nSo although there are options, the path of moving towards them is anything but direct.  Particularly in the current hire-by-numbers environment where most HR people try to hire people who are already doing the particular job.\n\nSource: Ph.D who's desperately trying to transition out of science altogether, because of the poor direction the job market is going.",
                          "author": "YoohooCthulhu",
                          "created": 1413086245,
                          "upvotes": 6,
                          "replies": {
                            "cl872w7": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl872w7/",
                              "text": "What was your dissertation on?",
                              "author": "throwapeater",
                              "created": 1413208203,
                              "upvotes": 1,
                              "replies": {
                                "cl87q77": {
                                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl87q77/",
                                  "text": "Kinase inhibitors that inhibit hepatitis c infection.  I now work in a similar area of cell signaling in neurodegenerative disease.",
                                  "author": "YoohooCthulhu",
                                  "created": 1413209981,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "cl6ywg1": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ywg1/",
                          "text": "ehh, kinda depends on the field",
                          "author": "AoE-Priest",
                          "created": 1413075996,
                          "upvotes": 3,
                          "replies": {
                            "cl87341": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl87341/",
                              "text": "wololol",
                              "author": "throwapeater",
                              "created": 1413208222,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "cl6v1xh": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6v1xh/",
                          "text": "I don't know that there's one root, unless it's the slowness of the institution to adapt to external changes. Administration is part of it.\n\nAnd PhDs have more options, and I mentioned some resources in another comment. But the system is heavily biased toward steering them into teaching jobs outside STEM and to a great extent within it.",
                          "author": "editer63",
                          "created": 1413067134,
                          "upvotes": 2,
                          "replies": {
                            "cl736dc": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl736dc/",
                              "text": "Not the system, the job market in general.  A lot of scientific companies employ Ph.Ds, but it's always with the attitude \"if you wanted to work here, why did you bother and get an academic degree\"? (Ph.D is considered more of an \"academic\" degree than an M.S. is)",
                              "author": "YoohooCthulhu",
                              "created": 1413086448,
                              "upvotes": 2,
                              "replies": {
                                "cl7cr2f": {
                                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7cr2f/",
                                  "text": "Interesting. I'd have thought the extra few years of learning research would be more valued, sort of treating the PhD programs like farm systems in baseball (free training!). But I don't know as much about STEM as I'd like.",
                                  "author": "editer63",
                                  "created": 1413127214,
                                  "upvotes": 1,
                                  "replies": {
                                    "cl7m4b6": {
                                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7m4b6/",
                                      "text": "Well, it's a function of wanting to fit people into neat little boxes to hire them.  PhDs are about an order of magnitude more rare than bachelor's our master's level scientists (although they're still overproduced), and their experience tends to be quite broad or deep by comparison.  This makes it complicated to fit them into specialized roles in industry.",
                                      "author": "YoohooCthulhu",
                                      "created": 1413146330,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "cl6v5o6": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6v5o6/",
                              "text": "I like your answer, but when you say \"the system\" are you in essence saying the path of least resistance?",
                              "author": "throwapeater",
                              "created": 1413067374,
                              "upvotes": 1,
                              "replies": {
                                "cl6vrnw": {
                                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vrnw/",
                                  "text": "Going into education is anything *but* the path of least resistance. ",
                                  "author": null,
                                  "created": 1413068819,
                                  "upvotes": 5,
                                  "replies": {
                                    "cl6vwut": {
                                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vwut/",
                                      "text": "My matriculation origin story was based on the path of least resistance.",
                                      "author": "throwapeater",
                                      "created": 1413069154,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                },
                                "cl6wkr2": {
                                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6wkr2/",
                                  "text": "When I say \"the system is heavily biased\" that's probably right. In most fields there's a quite reasonable assumption that if you enter the a PhD program you're looking for an institutional teaching or research career, since that's what they're there to prepare people for, and going a different route takes extra effort.",
                                  "author": "editer63",
                                  "created": 1413070689,
                                  "upvotes": 2,
                                  "replies": {
                                    "cl6x5a4": {
                                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6x5a4/",
                                      "text": "Exactly: *that's what they are there to prepare people for*. Going outside the lines is possible, but not really a viable option. It would be like going to culinary school and looking for a job outside the food service industry. Yes, you could. But you don't.",
                                      "author": null,
                                      "created": 1413071970,
                                      "upvotes": 2,
                                      "replies": {
                                        "cl6xeer": {
                                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6xeer/",
                                          "text": "What's odd about grad school is that you can find out when you're still partway through that it's not working out, but pushing through can seem like a less-bad option than dropping out. There's some sunk-cost fallacy going on there, though that's not all there is to it. But once you're in that situation your life can seem aimless.",
                                          "author": "editer63",
                                          "created": 1413072540,
                                          "upvotes": 7,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "cl6u81z": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6u81z/",
                  "text": "yes, but in this case, OP is working on a dissertation - the very, very end of earning the PhD; the most daunting of all tasks to complete - it's not about smarts its about a person's ability to persevere...many crack and fade away",
                  "author": "THE_Aft_io9_Giz",
                  "created": 1413065165,
                  "upvotes": 8,
                  "replies": {
                    "cl6uiqq": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6uiqq/",
                      "text": "I don't doubt that smart people drop out, the question was what's broken with higher education?  \n\nHaving a horrible advisor, an indefensible dissertation, or writer's block, etc., have always been aspects of a doctoral pursuit.\n\nI think defending the dissertation is more daunting.",
                      "author": "throwapeater",
                      "created": 1413065871,
                      "upvotes": 3,
                      "replies": {
                        "cl6uvh9": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6uvh9/",
                          "text": "I always thought this was a good site showing the ups and downs of higher education:\n[The Chronicles of Higher Education](http://chronicle.com/section/Home/5)\n",
                          "author": "THE_Aft_io9_Giz",
                          "created": 1413066715,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "cl6tn1t": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6tn1t/",
                  "text": "Instead of just downvoting this guy and moving on, can somebody please just fucking explain?",
                  "author": "Chenge14",
                  "created": 1413063788,
                  "upvotes": 2,
                  "replies": {
                    "cl7533y": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7533y/",
                      "text": "My two cents: higher education is being touted as a goal in itself, good students are encouraged to pursue academic research, when in fact the jobs are few and not very well paid, the research itself has questionable value, and you miss out on valuable working experience in other fields (that you'll need once you drop out).",
                      "author": "ITwitchToo",
                      "created": 1413092379,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "cl7144i": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7144i/",
                      "text": "I'm assuming they found the comment distasteful. It sounds like the user is being overly, and coldly, critical of OP. I didn't downvote the person, but that seems to be a way someone might read the comment and downvote it. ",
                      "author": "drwolffe",
                      "created": 1413081285,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "cl71y0o": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl71y0o/",
                  "text": "Seriously???",
                  "author": "StayPuftMM",
                  "created": 1413083275,
                  "upvotes": -1,
                  "replies": {
                    "cl871ac": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl871ac/",
                      "text": "yes",
                      "author": "throwapeater",
                      "created": 1413208072,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "cl6qusy": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6qusy/",
          "text": "As someone who is so close to quitting/getting kicked out of a masters programme I hate. Thank you. \n\nSeriously. ",
          "author": "biwhiningII",
          "created": 1413057399,
          "upvotes": 80,
          "replies": {
            "cl6shhg": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6shhg/",
              "text": "As someone in the same exact situation as you right now, thank you to OP as well. I needed this more than anything.",
              "author": "mulch17",
              "created": 1413061152,
              "upvotes": 24,
              "replies": {
                "cl6vnjj": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vnjj/",
                  "text": "As someone in something that i something, I somethinged that something more than something something.",
                  "author": null,
                  "created": 1413068554,
                  "upvotes": -30,
                  "replies": {
                    "cl6whwh": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6whwh/",
                      "text": "Haha, /r/circlejerk, except this was just two levels down so you should not have done so. Wait until four levels at least (or three if someone just goes \"Me too\").",
                      "author": null,
                      "created": 1413070503,
                      "upvotes": -4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "cl6tb7k": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6tb7k/",
              "text": "I am comforted in knowing in not alone in my struggle with grad school. I feel like everyone else in my cohort is flying and I'm the only one drowning. \n",
              "author": "thetiffany",
              "created": 1413063027,
              "upvotes": 21,
              "replies": {
                "cl6tret": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6tret/",
                  "text": "At least one-third of your colleagues feel the same way, possibly more. People just don't feel safe talking about it so they keep it to themselves. ",
                  "author": "editer63",
                  "created": 1413064073,
                  "upvotes": 30,
                  "replies": {
                    "cl6u1j2": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6u1j2/",
                      "text": "Here's the thing: we openly talk about it but they don't seem to struggle as much as I do. If they are, they're good at hiding it. ",
                      "author": "thetiffany",
                      "created": 1413064744,
                      "upvotes": 6,
                      "replies": {
                        "cl6wx4w": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6wx4w/",
                          "text": "People put their best face forward. You have perfect knowledge of your own situation, thoughts, and concerns but only perceptions of theirs.",
                          "author": "fishling",
                          "created": 1413071466,
                          "upvotes": 16,
                          "replies": {
                            "cl72ozf": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl72ozf/",
                              "text": "I once heard it said that when you're comparing, you see everyone else's highlight reels and your blooper takes.",
                              "author": "sk_2013",
                              "created": 1413085176,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "cl6txh7": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6txh7/",
                  "text": "I feel exactly the same. But I need to keep telling myself that everyone is different and does things at their own pace in their own way. Cut yourself some slack (I need to follow this advice myself). \n\nYou can do this. Honestly. You've gotten so far (so much farther than most people). Acknowledge that. \n\nPM if need be. Honestly. I'm right there with you. ",
                  "author": "biwhiningII",
                  "created": 1413064476,
                  "upvotes": 8,
                  "replies": {}
                },
                "cl6web8": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6web8/",
                  "text": "I am in your boat, feel like I am on the edge of failing out. It's an insanely depressing feeling. ",
                  "author": "DivinityGod",
                  "created": 1413070274,
                  "upvotes": 2,
                  "replies": {
                    "cl77cf5": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl77cf5/",
                      "text": "Why?\n\nSeriously, ask yourself that and/or reply with why exactly it's depressing.",
                      "author": null,
                      "created": 1413102447,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "cl6u0iz": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6u0iz/",
              "text": "I just finished my MSc, but I stuck with it even though I wanted to give up so many times. I wish I'd quit, because it's one of those things where you get out of it roughly what you put into it, and I put in the minimum. Now? I have no clue what to do with my life. Best of luck, man. Maybe it'll be different for you.",
              "author": "mindbesideitself",
              "created": 1413064678,
              "upvotes": 9,
              "replies": {}
            },
            "cl6vrze": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vrze/",
              "text": "As somebody who was there, was on academic probation, and actually finished it... stick it out, if you can. My degree helped get me in the door at a couple places for interviews, and I got a couple jobs because of it - even if anything I learned was, well, kinda useless. (Communications).\n\nBut in the short term, seriously, worse things can happen than leaving a master's program. it's not the end of the world if you leave, or get kicked out. It's the start of a new one. Good luck.",
              "author": "lonewolfandpub",
              "created": 1413068838,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "cl6ucdr": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ucdr/",
          "text": "The only complaint I've heard from friends that have quit grad programs in academia are not that they've quit, they just wish they quit earlier.",
          "author": "Copernican",
          "created": 1413065447,
          "upvotes": 12,
          "replies": {}
        },
        "cl6vaxe": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vaxe/",
          "text": "Just a quick flipside for those that are on the fence that think they can still finish:  If it's something that you've wanted badly and you're not 100% sure that you're done, the ache of walking away can stay with you for years.  And it can hurt pretty badly.  Especially if you have friends that finish and stay in the field.  Worse if you're around other reasonably-educated people and they already have an impression of what an ABD person is (which is someone not quite good enough, almost talented, a woulda/coulda/shoulda kind of person).\n\nI have a friend who quit out of kind of apathy (I've been led to believe).  Married to a PhD, most friends are PhDs, and he has a permanent sad look on his face, and seems to resent it quite a bit.  He talks all the time about how he wished he had finished.\n\nI also have three friends that finished their PhD and immediately walked away from academia with no regrets.  And they're all glad that they can say that they finished and quit on their own terms, that they got the degree and know it wasn't for them, and nobody can accuse them of sour grapes.  I could elaborate on this, but don't want a wall of text here.\n\ntl;dr Some people are happy quitting, some people aren't.  Walking away is a great idea for some, and can lead to a lifetime of regret for others.  Make sure you know yourself before making such a significant decision.",
          "author": "Fireplace_",
          "created": 1413067727,
          "upvotes": 21,
          "replies": {
            "cl8kj6n": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl8kj6n/",
              "text": "Yes, this is a valuable point. It's not a decision to make lightly, and I definitely wasn't aiming to suggest that. \n\nI was aiming more along the lines \"it's not worth damaging your mental health over\"... but obviously I hadn't expected so many people to see it, so I didn't write it as carefully as I ought.",
              "author": "RedBugs",
              "created": 1413235602,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "cl6scwp": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6scwp/",
          "text": "Thank you for this.  I've had to recently decide not to get my PhD, after getting to the ABT stage twice.  I finally did have to realize that it's a means to an end, and that I didn't need it to do what I want to do.  It hurt, since it felt like I was pissing away 10 years of my life, but at the same point, I'm not completely pissing it away.",
          "author": "nuclearalchemist",
          "created": 1413060868,
          "upvotes": 8,
          "replies": {}
        },
        "cl6rbq1": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6rbq1/",
          "text": "Wow, I also needed to hear this thanks for the pick-me-up Redbugs!",
          "author": "tystick3",
          "created": 1413058502,
          "upvotes": 8,
          "replies": {}
        },
        "cl6s53h": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6s53h/",
          "text": "Yes. All of this this this.   Source: struggling Ph.D. student who took one term off last year to get her head together (my program allows students to take a total of six).",
          "author": "DaSHmith",
          "created": 1413060363,
          "upvotes": 6,
          "replies": {}
        },
        "cl6yw68": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6yw68/",
          "text": "I felt like such a failure when I quit my Ph.D. program. You're right - every one of my role models was a career academic, so it was hard to imagine anything else.\n\nYears later I ended up at Google, and guess what? I'm surrounded by other PhD dropouts!\n\nA lot of people say \"I got my Ph.Don't!\"\n\nThere's absolutely no stigma to doing some graduate work and not finishing if you work in industry.",
          "author": "dmazzoni",
          "created": 1413075977,
          "upvotes": 7,
          "replies": {}
        },
        "cl6kbag": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6kbag/",
          "text": "This thread has been linked to from elsewhere on reddit.\n\n\n - [/r/bestof] [RedBugs offers solace to a user who gave up on their PhD, and provides tremendous advice for anyone facing a major setback in life](http://np.reddit.com/r/bestof/comments/2iy80c/redbugs_offers_solace_to_a_user_who_gave_up_on/)\n\n\n*^If ^you ^follow ^any ^of ^the ^above ^links, ^respect ^the ^rules ^of ^reddit ^and ^don't ^vote ^or ^comment. ^Questions? ^Abuse? [^Message ^me ^here.](http://www.reddit.com/message/compose?to=%2Fr%2Fmeta_bot_mailbag)*\n\n",
          "author": "totes_meta_bot",
          "created": 1413041622,
          "upvotes": 22,
          "replies": {}
        },
        "cl6swgr": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6swgr/",
          "text": "I originally went to do my phd in econ in '97. I didn't realize being a professor meant doing research. WIthin a few weeks, I realized I hated most econ research. I held on for the year but didn't put a lot of effort in. My grades were so-so. I left after the first year and did a variety of things. I left the department on good terms and in 2001, they gave me back my funding to finish my masters (which they didn't have to do and was super nice of them). I then got married, had my kids, and was home with them.\n\n\nMy ex was in academia and an opportunity arose to go back and get a degree in a business field where the job market had high demand.I went back and just defended my dissertation and am now Dr. livvey. The difference is that now I knew what to expect and I picked a field based on liking the research and having a good chance of landing a tenure track job.\n\n\nMy path to academia was a zigzag. If you would have told me in 1998 when I left the program that I'd have a PhD in a totally different field in 2014, I'd never have believed you. I guarantee that I'm happier than I would have been if I would have originally gotten that PhD in econ way back when. it's ok for your path to diverge off from your original plan. I wouldn't be who I am today without that happening. Credentials aside, I'm happy with who I am at this point in my life. Some paths may lead you back to acadmics, some may not. Either way, it's up to people what they want to achieve after leaving a PhD program without diploma in hand.\n\n\nDon't let anyone convince you that you will never get a job in academics - if you are in a field with a well-paying outside market, academics can be very lucrative. Not as lucrative as industry, but still lucrative. I had over 20 interviews the year I was on the market - 3 early flyouts and 2 offers, along with multiple flyout offers after I already accepted a job. FIrst year assistants make 6 figures and chaired seniors with good records can make 300k/year. However if someone insists on a field with more supply than demand, their academic career will always be a struggle and they may never get on the tenure track.\n\nEta..i should mention business school fields often have better job markets.  The reason for that is there is a separate accreditation for business schools,  AACSB. One of the requirements is that a high number of faculty have to have the highest degree in their field and must be tenured or tenure track (i can't remember the exact number and a new benchmark is being phased in). Therefore, we don't have a glut of people with masters willing to work for half the pay while teaching twice as much.  A school can't do that and hang on to their accreditation. Business schools are also not like the sciences because you don't have to do a post doc or chase grant money. We get treated like the prima donnas of academia. ",
          "author": null,
          "created": 1413062093,
          "upvotes": 20,
          "replies": {
            "cl6uj7w": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6uj7w/",
              "text": "What did you end up doing your PhD in if not econ?",
              "author": "hey_mister",
              "created": 1413065904,
              "upvotes": 7,
              "replies": {
                "cl6v9za": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6v9za/",
                  "text": "I'll pm you.",
                  "author": null,
                  "created": 1413067662,
                  "upvotes": -2,
                  "replies": {
                    "cl6wn0m": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6wn0m/",
                      "text": "C'mon, is your choice of phd really that personal? How arcane is the field?",
                      "author": null,
                      "created": 1413070834,
                      "upvotes": 16,
                      "replies": {}
                    },
                    "cl71m0v": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl71m0v/",
                      "text": "Pm me too please!",
                      "author": "TissueReligion",
                      "created": 1413082481,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "cl6vhwn": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vhwn/",
          "text": "Thanks also. I right now am hating my PhD. It's really frustrating because I'm in my sixth year, with no solid results (mainly because my hands suck). My friends all have their Cell, Nature or Science paper. My advisor is frustrated, as am I. Then I get sucked into the working 90 hours a week mode to try to make up for it, which means I have no time to go out and have fun. But I don't know, I don't know if I could leave academia. I love learning and the thrill of making discoveries but I suck at it.",
          "author": null,
          "created": 1413068188,
          "upvotes": 6,
          "replies": {
            "cl6vzor": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vzor/",
              "text": "[deleted]",
              "author": null,
              "created": 1413069343,
              "upvotes": 6,
              "replies": {
                "clp2lzn": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/clp2lzn/",
                  "text": "WHERE? Guide me, oh wise one.",
                  "author": "FishInABowl",
                  "created": 1414755896,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "cl73ivm": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl73ivm/",
              "text": "Well, in this environment, finishing--even with a C/S/N paper--is somewhere between a mixed blessing and a backhanded complement at best.  And not just in academia.  The industry employment situation for Ph.D scientists is somewhat of a disaster, as I've learned over the last couple years.  \n\n(Check out this disaster of an infographic: http://www.ascb.org/ascbpost/index.php/compass-points/item/285-where-will-a-biology-phd-take-you)\n\nSo I'm on my way out.  Consulting, medical writing, whatever scientific type thing I can find that's not bench research.\n\nThe thing that did it for me is when I asked a speaker who came for one of our weekly seminars (who's pretty successful in his field, even now)  about his tips on surviving in the disastrous funding/job environment.  His answer was to work harder.  \"If you keep publishing Cell/Nature papers, you see, people will have to let you succeed\".  It was one of the most tone-deaf pieces of advice I'd heard.\n\nIt, of course, ignores the fact that the impact of your findings is ultimately beyond your control.  Which is something that the successful people don't like to think too much about--there but for the grace of god go I, and all similar sentiments.  You can work on a high impact project, but you aren't guaranteed to make any headway on it; you can also work on an easier project that may or may not have a high impact result, but you can't control which payout you'll get.  \n\nEveryone wants to think this is just a temporary thing and that if they work harder, they'll survive the winnowing and things will go back to \"normal\".  But they won't.  If the environment is such that the only advice is to work harder, not to work smarter, it's a sign opportunities are declining.  \n\nLook, I work amid the tech boom.  I see the freedom, the creativity that happens in industries where opportunities are growing, where the attitude is \"this is a great idea, let's take a chance on it!\", where companies are looking for good, competent people rather than trying to shoot them down.  And science is the complete opposite.  \n\nWhat kind of promotion, salary negotiation leverage, and creative opportunities are on the table if I stay in an area that's headed in this direction?  Not many.\n\nYou might not be able to control your success, but you can stack the deck by choosing an industry where the chances of success are higher.  Which makes it insanity to stay in the scientific workforce these days.",
              "author": "YoohooCthulhu",
              "created": 1413087430,
              "upvotes": 6,
              "replies": {}
            },
            "cl6xzwa": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6xzwa/",
              "text": "Surely after 6 years you would have enough work to submit as a PhD thesis? My supervisor told me she's examined countless theses with no solid findings and that it's not the end of the world if you don't have anything meaningful findings to show for at the end of your PhD. I submitted my thesis after 4.5 years of work and only 1 publication and I feel that not everyone can aspire to publish in cell, nature or science.",
              "author": "jazban",
              "created": 1413073893,
              "upvotes": 2,
              "replies": {
                "cl73ncf": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl73ncf/",
                  "text": "In this environment, AP should consider if it's actually more lucrative for him to leave with a master's.  Ph.Ds who finish with less than stellar publication records look like losers to certain people, but Master's level scientists who come from dropping out of a Ph.D  program are usually at the very top of the MS workforce.",
                  "author": "YoohooCthulhu",
                  "created": 1413087791,
                  "upvotes": 3,
                  "replies": {
                    "cl75o7t": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl75o7t/",
                      "text": "I have a friend who considered exactly the same thing after 5.5 years. I don't doubt the fact that PhD graduates with a poor publication track record will look like losers to certain people, I'm sure they feel like losers too when stuck with a project that ends up like flogging a dead horse and like you said in your other comment where the impact of your findings are out of your own control.",
                      "author": "jazban",
                      "created": 1413094551,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "cl6ytmf": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ytmf/",
              "text": "I knew a guy who graduated from medical school, but then went into venture capital specializing in medical technology.  Also, there are a lot of ways to be a doctor.  You could also look at administration of a school or hospital.",
              "author": "cardinal29",
              "created": 1413075808,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "cl712k8": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl712k8/",
          "text": ">Being smart and good at your subject... is probably a major part of your identity, and a big source of self-respect. With so much of your identity tied up in your status as a grad student, it's easy to think \"I'm doing badly at school so I'm a worthless person\". This is NOT true. Sure, being a grad student has sucked up a lot of your attention, but it's not the sum total of who you are. Your friends and family don't love your ability to bash out an essay after three hours' sleep, they love and respect you for who you are, and still will tomorrow. \n\nThank you for saying that. I feel like this is a really important insight, not just for grad students, but for anyone moving away from an ardently pursued career path.",
          "author": "marshmallowbunnies",
          "created": 1413081179,
          "upvotes": 8,
          "replies": {
            "cl77an0": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl77an0/",
              "text": "Yep, I have a BA in Graphic Design with no outside experience since graduation almost 7 years ago. Noone wants a fresh newbie without experience, and noone wants someone who is 'old' in the sense that all the learned material is almost a decade out of date. Really sucks, but now I've managed (due to personal experience) to get into a career as a domicilary carer. Really different, probably even more rewarding.",
              "author": "rhamanachan",
              "created": 1413102173,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "cl6z1ns": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6z1ns/",
          "text": "This really is uplifting to hear, as well as something I've been afraid to admit. I've always worked towards pursuing an MD and finally have a BS in biomedical engineering. However, there's been issues with my application process preventing me from applying, the biggest being my lower MCAT scores. I've gotten really discouraged, but have been afraid to quit because its all I've seen myself doing in my future and it's what everyone thinks I'll do. Yet its not something I've truly felt passionate about and have always felt a disconnect with that image of myself.\n\nIn the meantime between application cycles, I've been applying to related engineering jobs to try to find other things I may be interested, but nothing feels right. However, just last week I was interviewed for a field clinical engineer position and I've never been so excited for such an opportunity. It's a great mix of everything I've grown to love and have considered putting med school on hold for a few years to experiment in other career paths. If I hear back with a job offer, I think I'll take it. If I don't, I'll look into other similar positions. It's a scary decision, but even more exciting and something I never knew I wanted to do. \n\nHopefully I can finally find what I really want to do in life and your post helps me believe everything up until now hasn't been a waste. Thank you for your words, I'll always keep them in mind.",
          "author": "KazeMaru77",
          "created": 1413076342,
          "upvotes": 7,
          "replies": {}
        },
        "cl6ta72": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ta72/",
          "text": "For someone who's been a major screw-up for years and is only just getting back into getting my bachelor's at 26, this is good to hear. I'm not a screw-up, I just screwed up.",
          "author": "MisterSnoogans",
          "created": 1413062965,
          "upvotes": 9,
          "replies": {}
        },
        "cl6u5lf": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6u5lf/",
          "text": "grad school like the military and other difficult to tolerate situations for those suffering through them - great place to be from, not necessarily a great place to be;  \n\nwhat's the best thing about submarine service/military/grad school/(any other difficult life challenge) ----best response ever:  \"It builds character.\"\n\n",
          "author": "THE_Aft_io9_Giz",
          "created": 1413065006,
          "upvotes": 4,
          "replies": {}
        },
        "cl6vfyp": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vfyp/",
          "text": "Thank you so much. I'm not ready to give up yet, but I got 2 papers back this week with the lowest grades of my academic career and half of last year's cohort failed their first comprehensive exam, so things are looking a little bleak right now. I really needed this reminder.",
          "author": "queeraspie",
          "created": 1413068065,
          "upvotes": 6,
          "replies": {}
        },
        "cl6sepw": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6sepw/",
          "text": "Current PhD student here, I enjoyed your post its good stuff.",
          "author": "tpn86",
          "created": 1413060980,
          "upvotes": 3,
          "replies": {}
        },
        "cl6te9b": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6te9b/",
          "text": "Thank you!",
          "author": "themoreyouignoreme",
          "created": 1413063224,
          "upvotes": 3,
          "replies": {}
        },
        "cl6tp44": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6tp44/",
          "text": "A thousand thanks, I really needed some motivation to keep going on with my PhD though my situation is not as bad as OP's. Thank you.",
          "author": "coyotzin",
          "created": 1413063920,
          "upvotes": 3,
          "replies": {}
        },
        "cl6v7ah": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6v7ah/",
          "text": "I really needed this 2 years ago. I could be in grad school right now if I took this advice, but now I have no idea how I'd get back.",
          "author": "umopapsidn",
          "created": 1413067479,
          "upvotes": 3,
          "replies": {}
        },
        "cl6wm9w": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6wm9w/",
          "text": "[deleted]",
          "author": null,
          "created": 1413070787,
          "upvotes": 3,
          "replies": {
            "cl6y4rh": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6y4rh/",
              "text": "Law school is a huge circle jerk. Find an area of law that interests you and you can basically aim your whole 2L and 3L year at only that. \n\nI've met like 3 people per year that *liked* law review. Most people don't even like law school and even those who do seem to be jaded on the legal industry.",
              "author": "wanderingtroglodyte",
              "created": 1413074207,
              "upvotes": 3,
              "replies": {
                "cl6yjhk": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6yjhk/",
                  "text": "Good advice, thank you. It is hard to cut through all of the weird, self important law school bull shit. ",
                  "author": "cursive12",
                  "created": 1413075151,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "cl784sh": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl784sh/",
              "text": "Your comment reminds me very strongly of myself when I was going to school several years ago (in a very different field). I really, really thought I wanted to have a career in musical theatre. I was going to a fabulous triple-threat school with excellent faculty and hands-on classes. However, I loathed acting class. Everybody else seemed to me to be just thriving: they were living the dream! They were having such a good time! But I was in constant misery. I didn't want to have anything to do with the acting work we were assigned. Reading scripts felt like reading Greek. I went through psychological agonies trying to wrap my mind around the phenomenon of trying to *be another person* - and I failed (quite literally). \n\nIt turns out I don't like acting. It took me that year and a half of struggling (so hard!) to like it, and probably another year or so of pondering after I quit school, to figure that out. Pretending to be another person is so contrary to who I am that it nearly made me self-destruct, *even though I was good at it!*\n\nNow, I don't know a darn thing about law school so I have no idea if there is any correlation between your situation and mine, but I recognized a lot of the thought patterns in your comment. Sometimes, knowing when to get out is important. Of course, there are a lot more financial reasons to stay in law than there are to stay in acting, so your mileage may vary. \n\nAnother thought: We tend to think other people actually *are* the shiny, polished selves they present to the world and that we're the only ones with flaws or doubts. Maybe the people who seem to be enjoying themselves aren't flying through as easily as you think!",
              "author": null,
              "created": 1413107197,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "cl6x2d5": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6x2d5/",
          "text": "I'm actually suffering through a big life change right, up to and including changing my entire career/future as well as having to spend the next 6-7 months away from the love of my life. It's been incredibly depressing, distressing, and crushing and I've never been so torn apart in my life, but I'm able to relate your advice to my situation and it's very helpful. Thank you.",
          "author": "Dr-Knockers",
          "created": 1413071789,
          "upvotes": 3,
          "replies": {
            "cl6yolq": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6yolq/",
              "text": "Hang in there Doctor knockers, I just successfully defended my viva last week and have a fiancée from outside Europe (I'm UK based) which meant that during the write up period we couldn't see each other for months due to visa troubles.\n\nDepression, distressing and crushing are all too familiar feelings, try to focus on what is important right now and best of luck to you!",
              "author": "QuickyBaby",
              "created": 1413075484,
              "upvotes": 2,
              "replies": {
                "cl8a2rm": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl8a2rm/",
                  "text": "Thank you so much for the kind words. What hurts right now is looking in to the future and wanting it so bad, and then returning to reality to realize where I am and how far I have to go. It helps knowing that other people such as yourself have accomplished it though.",
                  "author": "Dr-Knockers",
                  "created": 1413215323,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "cl6sy77": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6sy77/",
          "text": "I wish reddit was made up entirely of people like you. ",
          "author": null,
          "created": 1413062199,
          "upvotes": 7,
          "replies": {}
        },
        "cl6s5h4": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6s5h4/",
          "text": "starting my PhD in a month, saving it for later :/ (hope not)",
          "author": "anxiousalpaca",
          "created": 1413060389,
          "upvotes": 6,
          "replies": {}
        },
        "cl6tp3j": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6tp3j/",
          "text": "Wanted to voice my own thanks here as a PhD student entering his 6th year. I essentially have to collect enough data for a paper before the end of this year (which I've been unsuccessful at for the past 5), so I'm almost positive I'll simply have to give up on my degree. Reading your post has removed most of my panic about this possibility. ",
          "author": "cycloethane",
          "created": 1413063919,
          "upvotes": 4,
          "replies": {
            "cl739em": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl739em/",
              "text": "In this current market, leaving with a master's is almost certainly a net positive; the number of job openings is about an order of magnitude larger than those for Ph.Ds, if they're not as senior.  And ultimately, the number of job openings increases your ability to bargain...a lot.\n\n\n\n",
              "author": "YoohooCthulhu",
              "created": 1413086688,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "cl76aos": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl76aos/",
          "text": "T.S. Eliot completed a Ph.D. dissertation on the works of F.H. Bradley, and failed to show for his oral defense.  He walked awy from a Ph.D., because he'd already learned what he needed to know, and having 3 letters after his name would be no guarantee of success.  He paid his tuition, learned as much as they could teach him, told them all go fuck themselves, and made a poet of himself.",
          "author": null,
          "created": 1413097158,
          "upvotes": 6,
          "replies": {}
        },
        "cl6ugj6": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ugj6/",
          "text": "I'm aiming to get my PhD soon. Thank you for the advice, I really appreciate this.",
          "author": null,
          "created": 1413065720,
          "upvotes": 2,
          "replies": {}
        },
        "cl6vcmr": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vcmr/",
          "text": "Saving this for when I inevitably burn out after working towards my PhD.\n\nYour words are amazingly kind.",
          "author": "frawks",
          "created": 1413067842,
          "upvotes": 2,
          "replies": {}
        },
        "cl6w31o": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6w31o/",
          "text": "Bra-fucking-vo you nailed it with this.  Thank you!",
          "author": "I_want_hard_work",
          "created": 1413069557,
          "upvotes": 2,
          "replies": {}
        },
        "cl70dr4": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl70dr4/",
          "text": "I really needed to hear this.  My business has failed, I have a $15,000 business loan to pay back with intense interest starting in February, I have no job and I'm moving back in with my parents this month.  I put everything I had on black and it came up red.\n\nBut you're right.  This is my first great failure.  I've never experienced this before.  I've come out of this with a perspective that wouldn't have been possible otherwise.  Life goes on, but at least I'm living an interesting one.",
          "author": "Donahue2",
          "created": 1413079506,
          "upvotes": 2,
          "replies": {}
        },
        "cl72cxl": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl72cxl/",
          "text": "You bring up great points and gave great advice. However, not every program/school adheres to this \"academia cult\" mindset. I'm perfectly content where I am, and I have received excellent mentoring about career paths, science, life etc. from numerous people at my university. Not one of them claims that industry is a failure. It is just plain wrong to assert this notion to all of academia. ",
          "author": "rickpat12",
          "created": 1413084317,
          "upvotes": 2,
          "replies": {}
        },
        "cl76u36": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl76u36/",
          "text": "Commenting to save. Need shit like this in my tough times. ",
          "author": null,
          "created": 1413099719,
          "upvotes": 2,
          "replies": {}
        },
        "cl796i1": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl796i1/",
          "text": "Somehow, you have managed to make plain what two years of soul-searching has not.  ",
          "author": "Durbee",
          "created": 1413113785,
          "upvotes": 2,
          "replies": {}
        },
        "cl6yf0e": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6yf0e/",
          "text": "Been struggling with college for 4 years, don't even know what I want to do in life. Still waiting for my path to appear. ",
          "author": "dublohseven",
          "created": 1413074865,
          "upvotes": 1,
          "replies": {}
        },
        "cl704o3": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl704o3/",
          "text": "I decided not to go to law school a few months ago after being accepted  to a pretty good school due to the costs. It's tough to deal with. For a while I was a bit lost on what the hell I was going to do next, having thoughts like, \"Whats the point of ever reading a book again?\", \"I should burn all of my suits and ties because I'll never use them.\", and other fucked up thoughts. It's really been the first thing I didn't accomplish that I had set out to accomplish, and I've had a pretty good track record up until that point, so your post rings true with me. New goals are beginning to emerge, but I still can't help feel a bit of a sting when I think about it. Thanks for the thoughtful post. It probably helped more people than you realize. ",
          "author": "Motafication",
          "created": 1413078896,
          "upvotes": 1,
          "replies": {}
        },
        "cl70pfh": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl70pfh/",
          "text": "aaaaand I'm crying. thank-you.",
          "author": "ms_breeks",
          "created": 1413080301,
          "upvotes": 1,
          "replies": {}
        },
        "cl70raf": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl70raf/",
          "text": "this is why I love reddit. good folk.",
          "author": "seamus-fisher",
          "created": 1413080424,
          "upvotes": 1,
          "replies": {}
        },
        "cl746q9": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl746q9/",
          "text": ">  People miss life goals, have major setbacks, and experience soul-crushing failures all the time. But we pick ourselves up, dust off, and slowly a new path and a new goal appear. It's possible that you don't have the practice at that, at least not with stuff that feels this big.\n\nThat's why me and my ex split.  She'd faced adversity in her life but never lost.  ",
          "author": "Safety_Dancer",
          "created": 1413089413,
          "upvotes": 1,
          "replies": {}
        },
        "cl74gnh": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl74gnh/",
          "text": "You are amazing this touched on a subject for me",
          "author": "ponderpondering",
          "created": 1413090265,
          "upvotes": 1,
          "replies": {}
        },
        "cl74l7y": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl74l7y/",
          "text": "I just finished my PhD and am now tackling the possibility that I won't use it for anything, this post helped me and I want to thank you.",
          "author": "Wookiee81",
          "created": 1413090684,
          "upvotes": 1,
          "replies": {}
        },
        "cl75g10": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl75g10/",
          "text": "I have no way if expressing how much this both helped, and fit me 100%. I got really depressed during my phd due to lousy people at my research facility, causing me to quit. I felt, and still feel, like I quit ME. It was such a huge part of my identity.\n\nRight now I got an ok job that I love while I get back on my feet, before probably taking another masters in an unrelated field. But I will never do a phd again  :(",
          "author": null,
          "created": 1413093684,
          "upvotes": 1,
          "replies": {}
        },
        "cl76420": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl76420/",
          "text": "Thank you. I truly wish I had this to read 3 years ago when I left my PhD. I'm now finishing a Master's degree in an entirely different field, but I certainly felt a huge amount of loss and shame when I made my decision to leave. ",
          "author": "glitterfelcher",
          "created": 1413096349,
          "upvotes": 1,
          "replies": {}
        },
        "cl7a39q": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7a39q/",
          "text": "I cannot upvote this enough.",
          "author": "Moosebites",
          "created": 1413118407,
          "upvotes": 1,
          "replies": {}
        },
        "cl7aepd": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7aepd/",
          "text": "I started my first semester of grad school two years ago and halfway through I realized that it wasn't for me. The same spark and energy I had for undergraduate studies just wasn't there. The more I sat in the classroom the more I kept thinking about teaching and doing what I wanted to do. By the end of the semester I made the choice of getting my teaching license and start looking for jobs. It was one of the hardest choices I had ever made. I could feel the disappointment from my family when I told them and I felt like a complete failure. But like you said, there are some friends and family members that only care about you being okay and that was my brother. \n\nI was lying in bed at 1 in the morning figuring out my life when my brother texted me asking me what my plan was. I explained it to him and all he said was, \"awesome, let me know if you need anything.\" Man it was a weight off my shoulders, I felt this sadness slowly wash away and could feel my usual self coming back again.\n\nFast forward to now: I am teaching and I absolutely love my job. Haven't regretted my decision one bit.",
          "author": "SirKnightPedro",
          "created": 1413119715,
          "upvotes": 1,
          "replies": {}
        },
        "cl7agkk": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7agkk/",
          "text": "Wow. Thank you so so much. I needed to hear this. I'm in a totally different situation and this is exactly what I needed. Thanks. ",
          "author": null,
          "created": 1413119908,
          "upvotes": 1,
          "replies": {}
        },
        "cl7b1b5": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7b1b5/",
          "text": "This is the best comment on reddit.  I wish I had read this 2 years ago when I found myself in the depths of self-doubt you so expertly describe.  Thank you /u/RedBugs !",
          "author": "Barbaryan",
          "created": 1413122042,
          "upvotes": 1,
          "replies": {}
        },
        "cl6w47c": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6w47c/",
          "text": "Horrible advice. This girl got everything wrong and didn't understand a thing about what she's even writing.  \n  \nAnd now reverse everything I just wrote.",
          "author": "jojoga",
          "created": 1413069630,
          "upvotes": -12,
          "replies": {}
        },
        "cl71eao": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl71eao/",
          "text": "Most people can't write either cause stress or cause they don't want to give reasons as to why that happened because they think that that will make them be seen as pathetic.",
          "author": null,
          "created": 1413081962,
          "upvotes": -2,
          "replies": {
            "cl7303d": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7303d/",
              "text": "Your comment is pathetic.  Don't assume anything.  While at my grad/doc school my roommate, boyfriend and 5 friends fiend in a plane crash, I was raped and assaulted and my whole department either left or quit.  My dissrtation is finished but no one will read it because I didn't study with them and I go to the top music school in the country.  So don't do the disservice of saying stress is the reason people don't finish.  Red tape is why I and many others are trapped in ABD status!",
              "author": "Rachdickey",
              "created": 1413085975,
              "upvotes": -1,
              "replies": {
                "cl7c1ab": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7c1ab/",
                  "text": "Are you stupid or something? when did i said that stress is the reason why they can't finish studying, i said that stress/ cause they don't want to be seen as pathetic is the reason that they don't write about it on the internet or tell others, also i said MOST not all.\n\n\nYou're the pathetic.",
                  "author": null,
                  "created": 1413125247,
                  "upvotes": 0,
                  "replies": {
                    "cl9tw8k": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl9tw8k/",
                      "text": "Wow, got some inner rage problems there, eh.  I tell you about my issues and you start the name calling to a rape victim.  Way to go, buddy!  No, I am not stupid.  About to graduate with a doctorate despite my obstacles from the top music school in the country.  Have fun and learn to do some real research.\n",
                      "author": "Rachdickey",
                      "created": 1413343703,
                      "upvotes": 1,
                      "replies": {
                        "cl9us83": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl9us83/",
                          "text": "What does that have to do with anything i said? i don't care if you're a fucking rape victim, that doesn't excuse you from doing retarded comments, i don't even know why i bother answering, you're not a special little snowflake everyone has issues.",
                          "author": null,
                          "created": 1413345785,
                          "upvotes": 0,
                          "replies": {
                            "cl9w4r9": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl9w4r9/",
                              "text": "Hope you feel good about yourself today.  ",
                              "author": "Rachdickey",
                              "created": 1413349392,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "cl73mzj": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl73mzj/",
          "text": "Seriously man, the whole reason this kid is still in academia is because he has (more than likely, gets) too much money to care about having to support himself or he's to scared to take the next step. \nIn my private-side years and on into my entrepreneurial years, there has nothing that has been a better teacher and judge of future employee ability than that of their time in the 'ol school of hard knocks (ie real world) ... People who spend their time in academia struggle to actually capture the truth in experience and the false in books. \nI'm not sure why I responded other than to say... For fucks sake, stop coddling these children and get them out in the water... CONTRIBUTE",
          "author": "gingerankles",
          "created": 1413087761,
          "upvotes": -13,
          "replies": {
            "cl75gnk": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl75gnk/",
              "text": "You're an asshole, and have no idea what anybody's circumstances are. \n\nEdit: also step off of you're private sector high horse",
              "author": "somethingcleverer",
              "created": 1413093750,
              "upvotes": 2,
              "replies": {
                "cl76x8y": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl76x8y/",
                  "text": "An asshole with a job thoughhhh",
                  "author": "gingerankles",
                  "created": 1413100177,
                  "upvotes": -4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "cl6r0s2": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6r0s2/",
      "text": "I'll second especially what /u/RedBugs said and others. I left my program after 7 years when my diss proposal wasn't accepted. I'd been at it too long to have come up with so little, so there was no point in continuing. Fortunately I had been applying for non-academic jobs just in case, partly because I wasn't sure I wanted to be a professor anyway. Two days after my proposal died I had my first job interview, and I got hired and started work within a few weeks. The pay isn't quite what I'd hoped, and I'll be dealing with student loans for a while, but as I look back I realize I'm doing work I like in the city where I've always wanted to live, and I doubt that would have happened so quickly if I'd gotten the degree. \n\nI'm already making more contacts in my non-academic field, and things are looking fairly bright from here. \n\nOh, a word about grief and shame: They are both natural in your situation, and they suck, but you don't need to feel bad *about* having those feelings. It's like breaking up with your SO after 8 years. You'll feel a deep sense of loss for a while, then eventually things will get better. Not today, probably not tomorrow, but not too long from now.\n\nOne more thing: check with your school to see if they provide access to the services at [Versatile PhD](http://versatilephd.com/); their rasion d'etre is helping academics, both PhDs and ABDs, to find good careers in the \"real world.\" You can pay for your own subscription if need be, and it may be worth it to you. I was lucky to get a job before I needed their services much, but I'm pretty impressed with their resources.",
      "author": "editer63",
      "created": 1413057790,
      "upvotes": 15,
      "replies": {
        "cl6w6dg": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6w6dg/",
          "text": "thank you so much for the suggestion.",
          "author": null,
          "created": 1413069767,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "cl6xg8z": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6xg8z/",
      "text": "Edit: sorry, this is about me, not you.  Just stuff I was getting off my chest.  I feel a little awkard about posting it, and I'm tempted to take it down.  But I'll leave it up for a little while at least, in case you find it helpful to have a window into the mind of someone who finished the PhD but still feels like shit.\n===\n[redacted]",
      "author": "deteugma",
      "created": 1413072655,
      "upvotes": 12,
      "replies": {
        "cl6ywoa": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ywoa/",
          "text": "thank you for writing all of this -- it's greatly appreciated -- I'm sorry to hear you're suffering in ways that are ALL TOO FAMILIAR to me.  you have a fair amount of insight about it.  Yes it's definitely me and not my work.  Although I was horribly inadequate in many way, I hope it doesn't sound arrogant for me to say that my scholarship was quite strong.  I had many profs tell me so.   I love ideas.  I love good writing.  (I don't like jargony writing.)  \n\nIt's nearly impossible when you're in the midst of it to develop equanimity but even so I wish equanimity for you.  \n\nI think the biggest blow, personally, was even beyond the degree itself (which was a HUGE blow) but the way most of my profs were like: \"OK well keep in touch.\"  They meant a lot to me but it was not returned.  I feel like I've lost my whole community, profs, students and peers.  It feels like  total exile and it HURTS.",
          "author": null,
          "created": 1413076010,
          "upvotes": 7,
          "replies": {}
        },
        "cl6ya8n": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ya8n/",
          "text": "I just submitted my thesis for examination about a month ago and I can totally relate to how you feel about your PhD. You're definitely not alone, I've got friends and colleagues who feel the same way about their work.",
          "author": "jazban",
          "created": 1413074556,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "cl6p8yd": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6p8yd/",
      "text": "There is still hope.\n\nI gave up after about four years of work. Five years later I returned to university, choosing a different subject. A year ago I submitted my dissertation.",
      "author": "Glimt",
      "created": 1413053622,
      "upvotes": 11,
      "replies": {}
    },
    "cl6sxiu": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6sxiu/",
      "text": "I know what you're going through. \n\nI made the decision to quit about 3 years ago. By then, I had invested approximately 7 years of my life into the process. I cobbled together what coursework I had, re-submitted a degree plan and walked out with a masters. I didn't even write a thesis; just couldn't bring myself to pen another thought even though all I had to do was essentially re-write one of my papers. I was done; I signed the paperwork, and five years were gone, just like that.\n\nAnd it was the best decision of my life.\n\nIt didn't feel like it at the time, that is for certain. I thought for sure this decision would come back to haunt me, that it would be a fiery brand upon me for the rest of my life, reflecting on everything I do from that moment on. In reality, even a year later it was nothing but a scar. Nowadays, I rarely think about it, and when I do it is without regret. I have moved several times since then, switched jobs, began and ended relationships. The worries of today far outweigh the regrets of yesteryear.\n\nYou'll be alright, man. Take a deep breath, chill for a little while, then get back on your feet. Take the time to figure out what it is that you actually want to *do*. Your life will fall back into place.",
      "author": "grumpy_hedgehog",
      "created": 1413062157,
      "upvotes": 9,
      "replies": {}
    },
    "cl6h9w5": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6h9w5/",
      "text": "Why did you withdraw it?",
      "author": "xeroblaze0",
      "created": 1413030706,
      "upvotes": 8,
      "replies": {
        "cl6hg1d": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6hg1d/",
          "text": "I just couldn't seem to write it.  I liked my subject.  I'm a good writer.  I don't suffer from writer's block.  I liked my advisor.\n\nAnd yet....\n\nIt seems to be related to fear, but otherwise, I can't explain it...\n",
          "author": null,
          "created": 1413031558,
          "upvotes": 10,
          "replies": {
            "cl6qq7b": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6qq7b/",
              "text": "Been there. For some of us there's just some mental block about actually Getting It Done that we can't go around. I've heard it called Dissertation Paralysis. I talked a psychologist at my school into starting a support group for just that sort of thing, and (irony of ironies) it didn't get me over the hump, but a couple of other people in the group said they probably wouldn't have finished without it. \n\nOne difficulty we face as PhD students is that \"diss paralysis\" is never talked about; either you're making progress or you're not, and the professors (who all *did* succeed so they may not \"get it\") have a limited set of ways to deal with it. I'm hoping that that support group, which is still up and running (and spawned at least one offshoot writing group), will lead to more openness and support in that area.\n\nOnce I recognized the diss paralysis problem for what it is I started talking it up at academic conferences. Some people seemed interested in learning more, because they do want to help the students finish and graduate, but it's still a ways from being seen as a normal thing that happens to many of us.",
              "author": "editer63",
              "created": 1413057097,
              "upvotes": 8,
              "replies": {}
            },
            "cl6hmiz": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6hmiz/",
              "text": "I believe you have thought this through and then made the decision. The most important thing is that you should be at peace with your choice. All the best for whatever you wish to do in the future!",
              "author": "myrmecologist",
              "created": 1413032403,
              "upvotes": 7,
              "replies": {}
            },
            "cl6v235": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6v235/",
              "text": "Perfectionism? Procrastination? \u007fOverwhelmed? Didn't know where to start? Distractions?",
              "author": "Roadside-Strelok",
              "created": 1413067145,
              "upvotes": 2,
              "replies": {}
            },
            "cl6xjuq": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6xjuq/",
              "text": "Fear of success is a thing. And more common amongst females than males for some reason.",
              "author": "retumbler",
              "created": 1413072876,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "cl6rnv4": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6rnv4/",
      "text": "You've received a lot of good advice here but I just wanted to chime in with an e-hug.\n\nYour worth as a human being is **not** your field, your degree, or your dissertation. Sometimes walking away is the bravest, hardest, and best decision. There is no shame in doing whats best for you and your future happiness.",
      "author": null,
      "created": 1413059276,
      "upvotes": 6,
      "replies": {}
    },
    "cl6si5d": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6si5d/",
      "text": "A handful of years ago I quit my masters program because the stress, anxiety, and self-doubt was too much to bear.  I wasn't sleeping, I was crying a lot, and I was losing tons of weight.  Like /u/RedBugs mentioned, my self identity was so wrapped up in that MA, and I had spent so much time and energy getting to that point, that throwing it all away made me feel like the biggest failure to myself and everyone around me.\n\nWhen you're thrown into the \"unknown\", which I'm sure that's how you feel right now, you end up doing a lot of soul searching.  You learn a lot of things about yourself you may have not known.  And as the haze starts to lift, you start seeing different paths that you'd never seen before.  I ended up choosing one of those paths, and now I do something that I think I was always meant to do (which I would not have pursued had I not ditched the MA), and I couldn't be happier.\n\nSo basically--you will be 100% fine.  Take time to grieve a bit, but be easy on yourself.  No one's ashamed of you, and you're not a failure in the least bit.  ",
      "author": "nipplechips",
      "created": 1413061195,
      "upvotes": 5,
      "replies": {}
    },
    "cl6uq3l": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6uq3l/",
      "text": "I gave up on mine 7 years ago.  Best decision of my life after getting divorced.  Seriously, my whole life got better after giving up two abusive relationships; one with my ex-spouse, and one with myself and my guilt about all the money, time, and effort I'd spent on a PhD that I didn't have the love to finish.\n\nNow I run a small software company and my software makes the world a better place.  My spouse and I moved all the way to our current abode for her PhD program.  Spouse quit and is back in libraries and bakes on the side. \n\nIt's not the kind of thing you will have regrets about for the rest of your life. And it's because of three things:\n\n* You have the dedication to pursue something of value to you.  You learned this while sticking out your PhD for so long.\n* You have the ability to say \"no\" and \"enough is enough.\" You learn this when quitting.\n* You know that failure is not as big a disaster as you fear it will be. You learn this as your friends and new co-workers and such accept you even after giving up on this thing.\n\nHobbies, friends, career, love, and life are ahead of you.  Grab them all and run with them :-).",
      "author": "map_guy",
      "created": 1413066359,
      "upvotes": 6,
      "replies": {}
    },
    "cl6htuc": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6htuc/",
      "text": "Oh no, this is not terrible. I hate how academia pushes the idea that failure matters. It does not. If you want to try somewhere else, you can! Otherwise, do something else. You are allowed to fail as many times as you want. Shame is out of the window. No reason to be ashamed.\nHumans like to think that their lives, achievements and failures are important but they are not. In the long term no matter what you do you cannot have a significant impact on the universe. This is good, because you are free. So enjoy life as much as you can because you have no other choice.",
      "author": "the_morbid_reality",
      "created": 1413033298,
      "upvotes": 24,
      "replies": {
        "cl6i1f3": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6i1f3/",
          "text": "[deleted]",
          "author": null,
          "created": 1413034176,
          "upvotes": -13,
          "replies": {
            "cl6i76s": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6i76s/",
              "text": "This post deftly shows how delusional people in academics really are. McDonalds? This dude almost certainly has a masters degree after being in a doctoral program for eight years. ",
              "author": null,
              "created": 1413034807,
              "upvotes": 18,
              "replies": {}
            },
            "cl6i85i": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6i85i/",
              "text": "Saying that the best job that this person can get is at McDonalds after withdrawing from their PhD program after 8 years is a huge slippery slope fallacy.",
              "author": "Seeker_Of_Wisdom",
              "created": 1413034912,
              "upvotes": 17,
              "replies": {
                "cl6ifkk": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ifkk/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1413035677,
                  "upvotes": -7,
                  "replies": {
                    "cl6ju9h": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ju9h/",
                      "text": "That's a pretty small sample size you got there. ",
                      "author": null,
                      "created": 1413040318,
                      "upvotes": 2,
                      "replies": {
                        "cl6k2nu": {
                          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6k2nu/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1413040965,
                          "upvotes": 1,
                          "replies": {
                            "cl6k5mg": {
                              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6k5mg/",
                              "text": "Or maybe you just have a flair for the dramatic. However pure your intentions may be, telling someone who is in a vulnerable state and at a major in crossroads in life that his/her options are either to keep slaving away at it, or end up flipping burgers at McDonalds, is simply not helpful. ",
                              "author": null,
                              "created": 1413041193,
                              "upvotes": 4,
                              "replies": {
                                "cl6ocyo": {
                                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ocyo/",
                                  "text": "If all his/her problems are all due to health issues, and nothing to do with his/her own psychology, attitudes and efforts then a university degree wouldn't fix that anyway. Not to mention that the person this thread is about does already have a university degree, most likely two actually, just not a doctorate. \n\nThe tiniest minority of successful and financially secure people in the world have doctorates and many with doctorates are even part of the unsuccessful portion of the world. PhDs aren't a panacea and they are utterly irrelevant to nearly all the multitude avenues for fulfillment and comfort in life. \n\nThat guy/gal's comments here were absurdly wrong and make it evident that he /she is in no position to be offering OP or anyone else advice on this topic and indicate he/she would likely benefit from mental health help to address his/her wildly skewed views on life and their own agency in it.",
                                  "author": "OnStilts",
                                  "created": 1413051500,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "cl6i2yr": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6i2yr/",
              "text": "maybe they like gardening, start a successful landscaping business, make a shit ton of money and enjoy life",
              "author": "tardarsource",
              "created": 1413034349,
              "upvotes": 1,
              "replies": {
                "cl6i53j": {
                  "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6i53j/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1413034585,
                  "upvotes": -3,
                  "replies": {
                    "cl6iknz": {
                      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6iknz/",
                      "text": "you can get a PhD and then become homeless too",
                      "author": "tardarsource",
                      "created": 1413036203,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "cl6ipas": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ipas/",
              "text": "Most of what you can do outside of academia is just as possible with a MA",
              "author": "urnbabyurn",
              "created": 1413036670,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "cl74e75": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl74e75/",
      "text": "I actually got my PhD, and I wish I didn't. Maybe that's a consolation, maybe it's irrelevant, but at least personally I'm seeing a lot of comments here that give me some comfort and empathy.\n\nPerhaps I should elaborate - I finished my STEM PhD about three years ago, my thesis was very well received, my publication history in major journals was extensive, and I found myself in a very promising postdoc specialising in renewable energy. So far so good, but in many ways things get much worse in your first academic role. Contracts are quite a lot shorter than a PhD, you can't take time off and pick up where you left off if circumstances dictate it, you're thrown in the middle of petty factional politics that you were largely insulated from as a student, and it really is \"publish or perish\". The stakes are high, and any significant setback means failure and a ruined career.\n\nLet's just say I faced a few setbacks. It didn't help when the welcoming committee to the new city was waking up to a home invasion that cost me a few thousand dollars all up (without insurance) and left me pretty shaken up. Not long after that, I found out my mother was dying of breast cancer and spent most weekends back home helping to look after her (and took further time off near the end). While we were fortunate enough to get a few more months than we thought, and my supervisors were genuinely nice enough to say \"take as much time as you need\", realistically it would have been more helpful to add \"unless you still want a career at the end\". Because you can't succeed at that point in career unless your career comes first, second and third.\n\nWithout elaborating too much, more family tragedies and scares kept coming and with the election of an anti-science, anti-renewable energy government here in Australia, the final nails were put in the coffin. Funding cuts meant swift reductions had to be made in the staff budget,  and the logical choice was letting go of the inexperienced staff who weren't entitled to termination benefits and hadn't secured funding of their own. So the last few months of my contract were spent as a dead man walking, severely depressed and without the experience, research history, or connections to keep my new career alive. \n\nIt's been another few months since I finished, and I'm back living with my father in my 30s, getting nothing but rejections from job applications (with all the cuts and sackings in Australia, the job market is pretty brutal) and finding it harder and harder to remain optimistic.\n\nNot sure if this really helps, it was more to get it off my chest than anything, but if it wasn't meant to be it's better to find out sooner rather than later. The fall is that much greater the closer you fly to the sun. I'm sure I'll find something, but not without feeling that I've wasted far more of my life than I would have liked.",
      "author": null,
      "created": 1413090052,
      "upvotes": 5,
      "replies": {}
    },
    "cl6rqo8": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6rqo8/",
      "text": "You're allowed to grieve the loss of your imagined future, the vision you once had; it's wrenching to change your image of yourself. But DON'T feel shame. A PhD is just one of a million possible paths. Plus you have probably learned all sorts of skills that will still stand you in good stead in the future(I mean, not just specific skills but also cognitive skills, how to read and think, how to plan a project). Don't think of those years as a waste - you learned a ton.\n\nAnd as someone who did get the PhD and has \"succeeded\" since according to the standard benchmarks, I still think about leaving constantly. In fact I did quit science for 3 years to play music. Then I drifted back into science. I'll very likely quit again about 3 more years; I've got a new dream in yet another field now. There's so many other things out there.",
      "author": "99trumpets",
      "created": 1413059449,
      "upvotes": 3,
      "replies": {}
    },
    "cl6ucms": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ucms/",
      "text": "I left a Ph.D. program after 5 years, and it was one of the hardest decisions of my life. I can completely relate to how you are feeling right now.\n\nOn the flip side, I've got a great job and am extremely happy where I am. Sometimes failing at something can be the best thing for you. It's scary, but the fact that you made it 8 years means you are intelligent and hard working. You will bounce back!",
      "author": "hoogamaphone",
      "created": 1413065463,
      "upvotes": 5,
      "replies": {}
    },
    "cl6vdv0": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vdv0/",
      "text": "I feel your pain, and I will defend in December.  I'm leaving academia and what I've worked towards for the better part of my life because, frankly, I can't stand the idea of missing out on having a family while I fritter away my life on adjunct/sessional work, waiting for the elusive TT job.  I don't know what your field is, but jobs are scarce even if you finish.  It may not seem it from the inside of the tower, but we live in an age of anti-intellectualism; TT jobs are becoming scarce while exploitative adjunct jobs are proliferating.  I stuck with my degree for 7 years because I couldn't stand the idea of failure, but honestly, I wish I withdrew in year 2.  I'm 35 now, and I can't live the rest of my life in a holding pattern.  If you are like me, the PhD was a means to a great teaching job - the joy of teaching smart people complex ideas, and watching them grow intellectually.  Now I only feel exploited by my university, and so angry about the way they've used up my time.  \n\nConsider that you may be saving yourself, rather than losing yourself.  An Academic life is not the only way.",
      "author": null,
      "created": 1413067926,
      "upvotes": 4,
      "replies": {}
    },
    "cl727xh": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl727xh/",
      "text": "This is a beautiful thread. Seriously. I've read every comment, and feel compelled to add another, even though it's at the bottom of such a page of compassion and encouragement that says what I could say much better.\n\nOnce you've started a PhD, I'm not sure there's a graceful way out. The deeper you get, the more you think that finishing is that thing that will make it all worth it.\n\nI finished my dissertation, and my PhD was awarded with distinction. I had a great job, though not a traditional TT job. Things went south not for the \"normal\" reasons (lack of jobs, lack of TT track jobs, too much teaching, not enough publishing, working 80+ hours/week), but because I blew the whistle on a well-known academic in my field, and the university did everything in its power to bury it. So I left on cobbled-together funding to write, found I hated writing in isolation anyway, and decided that setting myself up for a career based on this was a bad, bad idea.\n\nI'd love to write a \"and now I have a magnificent career I never dreamed was possible\" finale, but I'm not there yet. It's hard to imagine what a different career should look like, and applying for \"regular\" jobs with a PhD in my field isn't standard. I can recognize that feeling embarrassed or ashamed is just plain stupid, and yet I still feel that way, 18+ months later. A decade sunk into a career is a long time.\n\nAll of which is to say: be so very gentle with yourself. It's okay to leave. More than okay, actually. It's okay to stay if you *really really* want to write a dissertation. If you stay, you need a solid plan to treat writing like a 9-5 job, and a plan for making connections that lead to jobs after you finish. The job market... well, I think buying lottery tickets to fund a retirement is a safer bet than counting on a well-paying TT job at this point. And writing for publication is how your career advances in the TT. It doesn't magically stop with the dissertation. No matter what you choose, you should be prepared for some emotional and mental fallout. That  Greek chorus sitting on your shoulder telling you how inferior you are if you can't get it together to write/research/finish/stay in/quit/whatever: they're going to be with you a while, and you may as well train those voices to be supportive and understanding.",
      "author": null,
      "created": 1413083954,
      "upvotes": 5,
      "replies": {}
    },
    "cl6io3c": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6io3c/",
      "text": "What's your field?",
      "author": "atleroge",
      "created": 1413036550,
      "upvotes": 6,
      "replies": {}
    },
    "cl6l4qk": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6l4qk/",
      "text": "I don't have any advice to offer honestly, but I believe that life does not depend on just a degree on paper. Im sure you learnt a lot in these 8 years and that is going to stay with you and help you irrespective of whether you get the degree or not. All the best for your future endeavours.",
      "author": "crazyMadBOFA",
      "created": 1413043765,
      "upvotes": 3,
      "replies": {}
    },
    "cl6s2y7": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6s2y7/",
      "text": "I quit mine a couple years ago.  Pm me if you wanna talk. ",
      "author": "thedeejus",
      "created": 1413060227,
      "upvotes": 3,
      "replies": {}
    },
    "cl6shqq": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6shqq/",
      "text": "what was your dissertation on and what was the final straw?  If you want to disclose any prior straws that would be helpful.",
      "author": "throwapeater",
      "created": 1413061167,
      "upvotes": 3,
      "replies": {}
    },
    "cl6t2v1": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6t2v1/",
      "text": "-internet hug-",
      "author": "Coz7",
      "created": 1413062500,
      "upvotes": 3,
      "replies": {}
    },
    "cl6vgzd": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vgzd/",
      "text": "When you consider the number of founders of tech companies who quit before a bachelors was completed, and the enormous costs ( loss of income)  by staying there, It stands to reason that as soon as your not learning something, or big $$$ is suddenly offered, it's time to say goodbye.\n\nI had several engineering friends with the mind set that if they just got straight A, they would be offered free tuition, and then living pay, and then a teaching position and the would never really have to look for work. Instead they be free to design freelance and never do the corporate grind. \n\nDidn't really work out that way for them.",
      "author": "Comdvr34",
      "created": 1413068128,
      "upvotes": 3,
      "replies": {}
    },
    "cl706da": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl706da/",
      "text": "I feel for you.  I'm glad everyone has given you such great advice! I thought that I would chime in with my thoughts as well.  I'm ABD as well and working on my dissertation in a social science and in all honesty I completely envy you for leaving and I'm so happy you have gotten out! I wish I had the courage to do the same thing, but I don't.  I know you will be better off in the end.  I don't think academia in the liberal arts is quite what people claim it to be. \n\nEdit: Forgot an important word ",
      "author": "BLB99",
      "created": 1413079010,
      "upvotes": 3,
      "replies": {}
    },
    "cl6xxnw": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6xxnw/",
      "text": "Ever heard of \"completionist anxiety?\" Where you kind of shut down before the end of a big project/life moment? It has happened to me a few times.",
      "author": "pickupyourpackage",
      "created": 1413073753,
      "upvotes": 5,
      "replies": {
        "cl6yz9p": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6yz9p/",
          "text": "never knew there was a term for this, thanks.",
          "author": "iamaxc",
          "created": 1413076184,
          "upvotes": 2,
          "replies": {
            "cl78tvp": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl78tvp/",
              "text": "Neither did I, but I can totally relate.",
              "author": "Pobeda_nad_Solntsem",
              "created": 1413111716,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "cl6hmia": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6hmia/",
      "text": "I had a very hard time writing my dissertation. I loved my research. I can write well, but for some reason I'd find something else to do when it came to writing my dissertation. Over and over again. It became such a burden. It had to come down to reaching the absolute deadline to actually finish and defend. I'm glad I did because I love the job I have and I wouldn't have it if I didn't have my degree.  I never published papers from my dissertation, which is unfortunate and my big regret in life.  However I'm glad that I did bear down for that one time to finish. ",
      "author": "UHadMeAtHyomandibula",
      "created": 1413032400,
      "upvotes": 6,
      "replies": {}
    },
    "cl6sjdh": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6sjdh/",
      "text": "Perspective, man. You're upset because you were identifying yourself by a label and now you don't fit that label. That's not important. What is important is that you do things that bring you actual happiness, not that you follow some preconceived path. Nobody said you had to do the PhD, and nobody will care that you're doing something else.\n\nYou're not the same person now as when you entered. You've had experiences that have changed how you think, and that can be very valuable. You'll also keep on learning outside of grad school.",
      "author": "Workaphobia",
      "created": 1413061273,
      "upvotes": 2,
      "replies": {}
    },
    "cl6tlsf": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6tlsf/",
      "text": "I gave up mine too 2 years ago. I know how you feel. If I could turn back time, i would change nothing. It was a journey that got me to where I am now.\nEverything is going to be just fine, believe me",
      "author": "provatidis",
      "created": 1413063709,
      "upvotes": 2,
      "replies": {}
    },
    "cl6tpq0": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6tpq0/",
      "text": "Joseph Campbell, one of the most important thinkers of the 20th C didn't finish his PhD because it would have required him to do things he had outgrown.",
      "author": "redidnot",
      "created": 1413063960,
      "upvotes": 2,
      "replies": {}
    },
    "cl6u0ue": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6u0ue/",
      "text": "What was it in? Also I think its something you can go back too if you ever wanted to, school is always going to be around. Stay positive!!! ",
      "author": "thezion",
      "created": 1413064698,
      "upvotes": 2,
      "replies": {}
    },
    "cl6u6s7": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6u6s7/",
      "text": "Growing up, it was always preached to me that \"quitters never win and winners never quit.\" It was only recently that I understood this to be bullshit and that there are times when it's perfectly acceptable to quit when what you're doing isn't working. The analogy that got me to change my thinking was one mention on an episode of The Survival Podcast where the host said made a comparison to a fly. Think of that annoying fly that gets in your house, the one that keeps pounding itself into the window and making that annoying \"thump thump thump\" sound at all hours of the night. Does it make any sense for him to keep trying? The fly doesn't realize it, but if the door or window is closed, there's not a solution to his problem and it would be fruitless to keep trying (because winners never quit). Even if it was open, if he's trying to break through the same pane of glass, he's not going to see any success by staying on his current course. I'm not saying your situation doesn't have a solution and there can't be success in your future. What sounds like a better course of action (and what looks to have been said here be a few people) is to take a step back and examine your life from a different perspective. Maybe you're just having trouble with this particular pane of glass and a wider view would show you the cracked door or window that would help you move forward. Best of luck to you, OP.",
      "author": "redchiron",
      "created": 1413065083,
      "upvotes": 2,
      "replies": {}
    },
    "cl6v0ut": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6v0ut/",
      "text": "I dropped out of my Ph.D. program because I just couldn't force myself to sit down and do the work necessary. Ultimately, that was because I'd lost my passion and didn't *want* to do it, deep down. I love, love, love my new path - I'm about to finish veterinary school and couldn't imagine doing anything else so fun and rewarding - it's also incredibly difficult, but I love it, and that makes all the difference in the world. The structure is also helpful - I don't work well when left to my own devices for long periods of time, so academia really wasn't for me also due to my working style, though I know I was smart enough. \n\nAdvice: take some time off to sit on your own and think about what's next, and try to imagine/visualize yourself doing something and being happy. Even if that's making pizza and hiking on all your days off, that's legitimate and you should go for it, see where that vision takes you. Take yourself offline and allow yourself to reboot naturally. \n\nI'm rooting for you, sincerely.",
      "author": "always_onward",
      "created": 1413067067,
      "upvotes": 2,
      "replies": {}
    },
    "cl6vlv9": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vlv9/",
      "text": "Don't feel too bad: I got my PhD 1.5 years ago and have been out of a job since then. I've basically left academia, as there are very little jobs available and next to no career security. Getting into the commercial sector is difficult, though, as my thesis subject wasn't commercially attractive and a lot of employer put little to no value on a PhD (or even worse, consider you overeducated).\n\nGetting a PhD isn't all wonderful and sunshine, as many PhDs can attest. So please don't be too hard on yourself not getting a PhD: you're not missing that much.\n\n",
      "author": "-Knul-",
      "created": 1413068445,
      "upvotes": 2,
      "replies": {}
    },
    "cl6wvvp": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6wvvp/",
      "text": "Was in a similar position to OP about 2-3 weeks ago. Wanted to drop out of my honours thesis as I was in a state of permanent stress, dreading getting out of bed and I thought I hadnt written enough and would never get close.\n\nSat down a few days ago and totted up the amount of actual words that I had written. It came out to something like 13,000 words. The actual thesis is meant to be anywhere from 15k-18k words. That flipped a switch and now I've got two weeks to finish it off.",
      "author": null,
      "created": 1413071387,
      "upvotes": 2,
      "replies": {}
    },
    "cl6yywm": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6yywm/",
      "text": "I gave up an English PhD when I was 28. Was absolutely devastated by it at the time. Took me a year or so to shrug off the shame. Looking back now, I'm completely relieved it didn't work out. Have spent the last 15 years in interesting and intellectually challenging roles. Academia isn't the only place to express your smarts and creativity... Plus it pays shit. ",
      "author": null,
      "created": 1413076158,
      "upvotes": 2,
      "replies": {}
    },
    "cl6zsbn": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6zsbn/",
      "text": "Sometimes I wish I'd given up on my Ph.D. because in some fields, it's harder to find a job WITH a Ph.D. than with just a masters--you're overqualified for a lot of things you might enjoy, which limits you to jobs that require Ph.D.s, and there aren't very many of those (in my field anyway).",
      "author": "coldgator",
      "created": 1413078069,
      "upvotes": 2,
      "replies": {}
    },
    "cl706t0": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl706t0/",
      "text": "Rhet/comper here.  Sending all of the sympathy.",
      "author": "Not_Han_Solo",
      "created": 1413079037,
      "upvotes": 2,
      "replies": {}
    },
    "cl70hyn": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl70hyn/",
      "text": "I became intensely paranoid in my 3rd year. My experiments were not working. People kept asking me when I was defending and I was sure they were laughing at me. They weren't. The stress made me feel that way. There's no shame in not graduating. There's so much luck involved in getting a Ph.D. It doesn't reflect on your character. \nMy best advice is to not be bitter in the future work environment. I worked with a guy who didn't get his Ph.D and was really bitter about it. He blamed everyone, and ranted about how he was robbed. No one cared. They wanted him to be a good scientist and pleasant coworker. \nIt will all work out for the best. ",
      "author": "MassSpecFella",
      "created": 1413079793,
      "upvotes": 2,
      "replies": {}
    },
    "cl720c4": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl720c4/",
      "text": "I have an incredibly motivated friend who has an incredible capacity to keep pushing her way through the stress. She just finished her Ph.D.\n\n\nWhy am I telling you this, you may wonder. Am I deliberately trying to troll you?\n\n\nOh my, no. See, I thought that once she was done, we would go out and have all kinds of fun, she though she would be free to work at a couple of odd adjunct teaching jobs, relax, travel a bit...\n\n\nNope. It's the same grind for her, just less focused and structured. Applying for jobs, applying for grants, there's still an incomprehensible and unending mountain of bureaucratic errands to do to allow her to teach her adjunct courses...she has barely any money, is incredibly stressed about her courses, the deadlines for the grants and job applications are often tight and they involve a ton of intricate and labor intensive preparation,  and then she has to keep up with every conference she can, to give her the best shot at a job.\n\n\nWhat I'm trying to tell you is that once a person gets a Ph.D, they aren't done. The same grind goes on and on and on. If you don't like it and want to get off, you will always feel bad about it.\n\n\nIf you don't like writing, research, a series of open-ended, unstructured tasks in a competitive environment, then now is as good of a time to quit as any.\n\n\nWhen I was a small child, I loved school. I thought school was for the pursuit of knowledge. I assumed I wouldbe some kind of academic.\n\n\nI was a little child, but it took until I got my Master's almost 20 years ago to give up on my childish ideas. They were part of another age that existed a long time ago. \n\n\nIf you want to learn, understand and write, you don't need a the abusive university structure to do so. I am with a man who grew up in a small village in another country. He is a very literate person because he has been educating himself ever since he had to drop out of school after 6th grade in order to support his family. He would look words up in the dictionary to compensate for the education he fantasized he woukd have been getting. \n\n\nIf you want to learn something, go learn it. There are many situations that are learning situations, if that's what you are looking for. It looks like formal education may have run out of things to teach you, at least for now.",
      "author": "Floomby",
      "created": 1413083435,
      "upvotes": 2,
      "replies": {}
    },
    "cl732sy": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl732sy/",
      "text": "If its any consolation I have chosen to withdraw from this semester of my Ph.D program. I've been going to school and working full time since 2006. My wife was in a car accident the first night of my classes this semester and I've felt off ever since. It's time for a break. I talked it over with my advisor and put my paperwork in last week. Hopefully come January I will feel refreshed and ready to tackle the last of it all before comps. \n\nYou're not alone in how you feel. ",
      "author": "aggr1103",
      "created": 1413086176,
      "upvotes": 2,
      "replies": {}
    },
    "cl83c14": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl83c14/",
      "text": "This post is maybe somehow the most important thread I've ever read. Really helped me out, especially /u/RedBugs. Thanks for that, brother. ",
      "author": "TelevisionAntichrist",
      "created": 1413190352,
      "upvotes": 2,
      "replies": {}
    },
    "cl73yi8": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl73yi8/",
      "text": "WOW.  This hit home hard.  I haven't told anyone any of this...\n\nWhen I was finishing my PhD, I was sitting at home all day trying to write my thesis, cutting myself off from my friends thinking buckling down would help me.  I was almost 7 years in, and for some reason I felt as though I couldn't finish... or at least that I wouldn't finish.\n\nI made it through, but it was probably the darkest time in my life.  I don't know if I was actually suicidal, but for some reason still unbeknownst to me, I couldn't see myself finishing my thesis and starting a career.  I had a job waiting for me, my advisor said I was doing fine, but for some reason I thought I would die before I finished.  \n\nIt didn't help much that I had to cross a very high bridge twice a day when I did go into the lab.  I started to fear that bridge, so much so that I avoided it at all costs.  I was afraid that I would fall off, or jump off, that bridge one day.  \n\nI ended up having horrible writer's block due to what I think was severe anxiety, which delayed my defense enough to cause me to lose my potential job.  It got rescinded when I called to ask if I could start on my intended start date and then take a day off 3 weeks later to defend my thesis.  Soon after, my lease was up and I ended up moving in with a friend.  That, and the fact that I had a persistent girlfriend who wouldn't give up on me, wouldn't let me cut her out of my life, and wouldn't leave me alone, probably saved my life.\n\nIn the end, I took an extra month to write an additional chapter that probably wasn't needed.  I didn't answer my phone or go into school for a few weeks and almost lost my funding.  I caught my adviser as he was completing the forms to cut me off financially.  Luckily, he was understanding of the fact that I had cut off communications to concentrate on finishing.\n\nSoon after, I lucked out and got a job at a small company that was local.  I still work there.  I married my then girlfriend and we had a couple kids.  Life isn't bad now, but I am still haunted by that time.  Things could have gone much worse.\n\nThanks for sharing, and I hope everything works out for you.  You may have done the best thing for you, psychologically speaking.  Life can go on, and you can still be successful.  You obviously are very intelligent, you wouldn't have been in a PhD program if you weren't.",
      "author": "villain75",
      "created": 1413088705,
      "upvotes": 3,
      "replies": {}
    },
    "cl6ry3p": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ry3p/",
      "text": "What were the subject and field? You really made me (us, I think) curious!",
      "author": "KarnickelEater",
      "created": 1413059922,
      "upvotes": 2,
      "replies": {}
    },
    "cl6vdwh": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6vdwh/",
      "text": "What kind of program? What year were you? How old are you? What now?",
      "author": "sexy_nerd",
      "created": 1413067928,
      "upvotes": 1,
      "replies": {}
    },
    "cl6x6ja": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6x6ja/",
      "text": "It's funny this came up because just yesterday I looked up a friend of mine who had been doing a Ph.D. in English lit--she finished in 2012. She's now an adjunct professor at a liberal arts college in a rural town in the deep south. I think she's probably making about $15k/yr.\n\nI know another guy who was in the same Ph.D. program, and who quit to take a job in finance. He was about 16 months from finishing. He now makes $120k/yr.\n\nSo, don't sweat it. Life doesn't end because you didn't finish--and quite possibly, it could become a very good thing for you.",
      "author": "13104598210",
      "created": 1413072048,
      "upvotes": 1,
      "replies": {}
    },
    "cl6ybjn": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6ybjn/",
      "text": "I'm year 6 of s PhD - ABD at this point\n\nI have to finish this year, although they would certainly let me re-enter and finish - and with my work schedule (got a job at the Univ while I was still in school), I really don't have time to finish right now. I guess I am just going to have to neglect some duties to get finished.\n\nit is time for me to move on, anyway.",
      "author": "uncle_stinky",
      "created": 1413074641,
      "upvotes": 1,
      "replies": {}
    },
    "cl6yp2g": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6yp2g/",
      "text": "This is probably going to be a good move in the long run. \n\nEnglish lit Phds are worthless, so by actually not having one, you can truthfully never mention it; unlike so many people out there that *hide* their Phds.... ",
      "author": "7thst",
      "created": 1413075515,
      "upvotes": 1,
      "replies": {}
    },
    "cl71opb": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl71opb/",
      "text": "As someone that's in the 8th of a phd program and still going, I know what is like and have contemplated quitting countless times.  I think the last time it was just a month ago.  The stress, pressure ad self doubt are daunting.  On top I have to compare myself with others in our group as well as fellow classmates and friends whom by now have mostly moved on and graduated.  Your selfesteem definitely decreases everytime someone you know who came later than you graduates.  The only thing that's saving me from quitting is my husband who constantly encourages me and cheer me up.  I've learned that you absolutely need a good support group to finish.",
      "author": "RobertFreh",
      "created": 1413082658,
      "upvotes": 1,
      "replies": {}
    },
    "cl78l1s": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl78l1s/",
      "text": "In my life I gave up 3 separate years at school before finishing my exams, 1 at university before finishing my first year and a lot of other activities I did.\n\nSometimes fear cripples you and the only thing you are trying to do is dodge the situations you know you will have to face.\nI know my time would have been much better spent actually facing the situation and finding ways to deal with it instead of imaginating everything that could go wrong.\nThe worst is that you feel you can't do anything about it and it just so happened that way, while you KNOW you actually did let it happen.\n\nI know that feel.\n\nJust don't tell yourself that there was no way to prevent it, that's a lie.\n\nThe first year I didn't even realize why I did it.\nThe second year I actually realized that I should be ashamed.\nThe third year at school that I didn't finish I felt helpless and went to counseling (did help but much later, when I actually figured that thinking is not the solution but acting is. I then had the tools to help myself)\n\nAfter getting to university, I realized that I still had that tendency but I tried to fight it and it didn't work.\nThis year I am finally putting an end to that motherfucking tendency.\n\nGood luck to you mate.\n\n\n",
      "author": "Hoburame",
      "created": 1413110130,
      "upvotes": 1,
      "replies": {}
    },
    "cl7cclw": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7cclw/",
      "text": "Way too late on this, but...\nI'm 50 now.  I have a broken thing in my brain - sometimes - that won't let me do something I don't want to do, or that doesn't feel right.  Even when I am very far down a path, at the very end, sometimes, I simply can't \"pull the trigger.\"  25 yrs ago I was asked to leave an institution of higher learning (for the 2nd time) because I just stopped doing the work I was supposed to be doing.  Just stopped.  My lovely wife (I broke up with the woman I'd been dating for a year, the day I met her, truly love at first sight) was finishing her Masters, but suddenly all the academia wasn't for me.  Fast forward to today: I am President of the company I founded several years ago.  It's my third company, each one a little more successful than the last.  I've met the President (Obama), am an occasional talking head on TV, my wife travels the world doing work that she loves.  I'm not a billionaire or anything, but we're having a great life.  You will too!",
      "author": "BigMickPlympton",
      "created": 1413126143,
      "upvotes": 1,
      "replies": {
        "cl7jr5y": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7jr5y/",
          "text": "you're very kind.  are you hiring?",
          "author": null,
          "created": 1413141807,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "cl7cu85": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7cu85/",
      "text": "RemindMe! 1 year \"Check up on u/addcream and see how ~~he's~~ she's doing.\"",
      "author": "mikelybarger",
      "created": 1413127436,
      "upvotes": 1,
      "replies": {
        "cl7cuc7": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7cuc7/",
          "text": "Messaging you on [**2015-10-12 15:23:58 UTC**](http://www.wolframalpha.com/input/?i=2015-10-12 15:23:58 UTC To Local Time) to remind you of [**this comment.**](http://www.reddit.com/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7cu85)\n\n[**CLICK THIS LINK**](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[http://www.reddit.com/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7cu85]%0A%0ARemindMe!  1 year ) to send a PM to also be reminded and to reduce spam.\n\n_____\n\n[^([FAQs])](http://www.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/) ^| [^([Custom Reminder])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!) ^| [^([Feedback])](http://www.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback) ^| [^([Code])](https://github.com/SIlver--/remindmebot-reddit)",
          "author": "RemindMeBot",
          "created": 1413127443,
          "upvotes": 1,
          "replies": {}
        },
        "cl7js7w": {
          "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7js7w/",
          "text": "she",
          "author": null,
          "created": 1413141865,
          "upvotes": 1,
          "replies": {
            "cl7judc": {
              "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl7judc/",
              "text": "Damn it. I meant to avoid using gender specific pronouns. I apologize. ",
              "author": "mikelybarger",
              "created": 1413141978,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "cl6up8w": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl6up8w/",
      "text": "I'm not saying all graduates are snobs, but the worst snobs I ever met were all graduates.",
      "author": "warpfield",
      "created": 1413066301,
      "upvotes": 1,
      "replies": {}
    },
    "cl78vst": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl78vst/",
      "text": "I'm sure this will be buried in the /r/bestof avalance, but I'll pitch it anyway: there's a credo I hold true, ever since my wife gave up on her PhD: *the only correct response to hearing someone gave up on their PhD is \"congratulations, you got out.\"*\n\nIt doesn't matter how you got out. You got out. Good on you!",
      "author": "kaosjester",
      "created": 1413112049,
      "upvotes": 0,
      "replies": {}
    },
    "cl886wb": {
      "link": "/r/AskAcademia/comments/2ixv41/i_just_gave_up_on_my_dissertation/cl886wb/",
      "text": "> It was English Lit\n\nDon't worry then, it's all sunk costs anyway :)",
      "author": null,
      "created": 1413211155,
      "upvotes": -2,
      "replies": {}
    }
  }
}