{
  "sid": "ptaemi",
  "link": "/r/AskAcademia/comments/ptaemi/are_review_papers_not_real_papers/",
  "title:": "Are review papers not \"real\" papers?",
  "text": "I just finished a committee meeting to discuss when I can defend. My external mentioned that I should have 3 \"real\" journal publications before I am ready to defend. He said that my review paper doesn't count towards that. Are review papers seen as less than technical communications?\n\n&#x200B;\n\nThe funny thing is, my review paper is my highest cited paper, with over 40 citations since 2020.",
  "author": "ekpg",
  "created": 1632325875,
  "updated": 1634078883,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.7,
  "comments": {
    "hduwaiy": {
      "link": "/r/AskAcademia/comments/ptaemi/are_review_papers_not_real_papers/hduwaiy/",
      "text": "It's not that they are \"less than\", but that a review paper doesn't reflect the impact of your PhD research - in other words, your new and original research contributions to the field. \"Real\" is maybe not the best word to use here but the idea is not wrong. The goal is that your actual research is peer-reviewed, published, and available to the scientific community, not locked away in a dusty dissertation that few people will ever read.",
      "author": "nuclearslurpee",
      "created": 1632326286,
      "upvotes": 33,
      "replies": {}
    },
    "hdv8f53": {
      "link": "/r/AskAcademia/comments/ptaemi/are_review_papers_not_real_papers/hdv8f53/",
      "text": "Review papers are important, but they're not novel research. A PhD is training in producing novel research, so it shouldn't be surprising that a review paper doesn't count toward your dissertation chapters.\n\nOn the other hand, the intro for your dissertation should basically be done.",
      "author": "aggressive-teaspoon",
      "created": 1632331210,
      "upvotes": 16,
      "replies": {}
    },
    "hdvhjus": {
      "link": "/r/AskAcademia/comments/ptaemi/are_review_papers_not_real_papers/hdvhjus/",
      "text": "They're real papers, but the goal of a PhD is research. You should be adding some sort of new information or analysis to the world. Understanding and summarize other people's work is often a pre-req to doing it so it might go in an intro chapter, but doesn't count towards your \"real\" work.",
      "author": "mediocre-spice",
      "created": 1632334892,
      "upvotes": 8,
      "replies": {
        "hdyp9ew": {
          "link": "/r/AskAcademia/comments/ptaemi/are_review_papers_not_real_papers/hdyp9ew/",
          "text": "I wish sorting, organizing was more \"real\" research than it is currently considered. Reducing a bunch of papers into a few pages maybe isn't new information, but if it does so intelligently it can be very beneficial. A model of other papers in some sense.",
          "author": "Benaxle",
          "created": 1632404927,
          "upvotes": 1,
          "replies": {
            "hdypzrt": {
              "link": "/r/AskAcademia/comments/ptaemi/are_review_papers_not_real_papers/hdypzrt/",
              "text": "I mean, you still get big benefits from it. You can publish review papers, get lots of citations, and it's an essential skill for writing intros/discussions in papers and grants. It's just not the goal of a PhD dissertation.",
              "author": "mediocre-spice",
              "created": 1632405255,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hduz8ez": {
      "link": "/r/AskAcademia/comments/ptaemi/are_review_papers_not_real_papers/hduz8ez/",
      "text": "A Ph.D. is a research-focused degree based on generating new data. A review doesn’t generate new data, so isn’t relevant to whether you have accomplished the goal of the Ph.D.",
      "author": "WoodwardHoffmannRule",
      "created": 1632327484,
      "upvotes": 12,
      "replies": {}
    },
    "hdxikc1": {
      "link": "/r/AskAcademia/comments/ptaemi/are_review_papers_not_real_papers/hdxikc1/",
      "text": "Narrative reviews are often highly cited as the authors' opinions can be helpful summaries or syntheses of a topic, but are not usually considered novel research, as this type of paper is undermined by biases. Systematic reviews with quantitative meta analysis are original research because they have repeatable protocols and solid statistical methods for summarizing and synthesizing the results of the reviewed published works.",
      "author": "ScienceRulzTheWorld",
      "created": 1632373890,
      "upvotes": 2,
      "replies": {}
    },
    "hdvjvpf": {
      "link": "/r/AskAcademia/comments/ptaemi/are_review_papers_not_real_papers/hdvjvpf/",
      "text": "What is considered a review paper, the criteria you have to abide by, and its status differs massively per field.\n\nWhat was the review paper like and in which discipline do you work?",
      "author": "doornroosje",
      "created": 1632335835,
      "upvotes": 2,
      "replies": {}
    },
    "hdwnhbu": {
      "link": "/r/AskAcademia/comments/ptaemi/are_review_papers_not_real_papers/hdwnhbu/",
      "text": "Use review papers as confirmation of established ideas to show continuity within field with regard to research, but don’t lean on them directly.",
      "author": "BaddestBrian",
      "created": 1632357375,
      "upvotes": 1,
      "replies": {}
    },
    "he38ayb": {
      "link": "/r/AskAcademia/comments/ptaemi/are_review_papers_not_real_papers/he38ayb/",
      "text": "Review papers may be highly cited because they are easy to cite. They are broad, so they are useful when writing introductions.",
      "author": "nc_bound",
      "created": 1632490359,
      "upvotes": 1,
      "replies": {}
    },
    "he78rs4": {
      "link": "/r/AskAcademia/comments/ptaemi/are_review_papers_not_real_papers/he78rs4/",
      "text": "My University has a publication requirement for PhD student graduation, and reviews are not considered as a qualifying publication.",
      "author": "Life_time_learner",
      "created": 1632560760,
      "upvotes": 1,
      "replies": {}
    }
  }
}