{
  "sid": "qxdxme",
  "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/",
  "title:": "European PhDs - can supervisors/reviewers prevent students from defending or passing the defense even if they have completed all the requirements?",
  "text": "The reason I specify European programs is because I think that the requirements for US PhDs (not sure about other countries) are a bit more vague. \n\nMy funding runs out in just over 3 months, and I've published more than the paper minimum needed to defend. However, I'm wondering if supervisors can prevent students from defending anyway if they feel that they haven't done enough work or if they feel the student hasn't mastered a certain subject.\n\nMy supervisors have been pretty vocal about the fact that I haven't done enough work for the PhD, which I feel is unfair for a number of reasons. Also, while editing a paper of mine recently, it became crystal clear to my supervisors and me that I am missing some pretty fundamental knowledge relating to my field (it's just not an aspect that I've focused on during my work). \n\nSo can my supervisors tell the doctoral school or my thesis reviewers that I am not ready to defend? Can they tell my reviewers not to pass me because I don't have a solid-enough understanding of this field? Can reviewers decide on their own that a student hasn't done enough work even if they have published more than enough papers?\n\nFor what it's worth, I am not only planning on leaving academia afterward but also this field entirely.",
  "author": "goatsnboots",
  "created": 1637319895,
  "updated": 1639839237,
  "over_18": false,
  "upvotes": 19,
  "upvote_ratio": 0.85,
  "comments": {
    "hl8pz1l": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl8pz1l/",
      "text": "I don't know for all Europe, each country and fields have their own way to do it. In France, a lot of Doctoral schools need your supervisor's approval to allow your thesis defense.",
      "author": "Sapinzeus",
      "created": 1637320452,
      "upvotes": 20,
      "replies": {
        "hl8q966": {
          "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl8q966/",
          "text": "I'm in France as well, so that's good to know.",
          "author": "goatsnboots",
          "created": 1637320663,
          "upvotes": 3,
          "replies": {
            "hl8qcm2": {
              "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl8qcm2/",
              "text": "In STEM, it's nearly impossible to defend if your supervisor doesn't approve.\n\nIn Humanities, it's easier but you need to convince the doctoral school... it's hard.\n\nLike I said: it depends a lot on the doctoral school.",
              "author": "Sapinzeus",
              "created": 1637320732,
              "upvotes": 18,
              "replies": {}
            },
            "hl8qj5z": {
              "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl8qj5z/",
              "text": "I'm not in France. Where I'm at, you would have the right to defend even if the department said no. However, this would lead to a fail and no degree 99 times out of 100.",
              "author": "molobodd",
              "created": 1637320864,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "hl99w1j": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl99w1j/",
      "text": "Just FYI, the only time I’ve seen people outright fail is when they submit without their supervisors approval. They know when you and the thesis are ready.",
      "author": "ardbeg",
      "created": 1637331810,
      "upvotes": 18,
      "replies": {}
    },
    "hl8z1uu": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl8z1uu/",
      "text": "> European programs\n\nI'll answer from the German perspective since you're not telling us the country.\n\n> My supervisors have been pretty vocal about the fact that I haven't done enough work for the PhD, which I feel is unfair for a number of reasons.\n\nIt doesn't matter you think it's unfair, it's your supervisor who decides whether you did enough work or not. If you go behind their back and submit they can simply fail you and you're fucked. There is nothing worse than failing your PhD defense. \n\n> Can they tell my reviewers not to pass me because I don't have a solid-enough understanding of this field? \n\nNo. But they can ask really mean questions during your defense and it will be plainly obvious for everyone that you do not deserve a doctorate.\n\n> Can reviewers decide on their own that a student hasn't done enough work even if they have published more than enough papers?\n\nYes. Enough work is not measured by the number of papers but by the aggregated contribution to our understanding of the field in question.",
      "author": "cat-head",
      "created": 1637326311,
      "upvotes": 9,
      "replies": {
        "hl90jlb": {
          "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl90jlb/",
          "text": ">Enough work is not measured by the number of papers but by the aggregated contribution to our understanding of the field in question. \n\n\nThis is where I'm confused I guess. I have friends who are doing or did PhDs in Ireland, and they were told that the paper minimum was 4 but that if they published 7, they couldn't be denied the PhD because publication=contribution. So it's strange to me to say that someone could have published a ton of papers, meaning that peers determined the contribution to be enough, but that the supervisors don't agree with the peer reviewers.\n\n\nI'm in France by the way. \n\n\nPart of what is driving this question is that my visa is also up in three months, so if I don't finish the work my supervisors want before then, I don't know what I'm going to do.",
          "author": "goatsnboots",
          "created": 1637327137,
          "upvotes": 3,
          "replies": {
            "hl9163l": {
              "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl9163l/",
              "text": "> So it's strange to me to say that someone could have published a ton of papers, meaning that peers determined the contribution to be enough, but that the supervisors don't agree with the peer reviewers\n\nit's not that they don't agree, it's that they think the papers you published were just not very good, in not very good journals, or not very wide in scope. I cannot tell you which one it is, you'd have to ask them.\n\n> I'm in France by the way.\n\nI am less familiar with France, but I think the gist of it is the same. The supervisor decides whether you're ready to graduate or not.\n\n> Part of what is driving this question is that my visa is also up in three months, so if I don't finish the work my supervisors want before then, I don't know what I'm going to do.\n\nBeen there, done that. It sucks big time to work in academia in Europe as a non-EU citizen. Try to talk your supervisor about this concrete issue. Ask them whether they can employ you as a student assistant or some other type of position which would give you the right to stay and finish properly. Do not tell them that you want to submit now because of the visa, that will not go down well.",
              "author": "cat-head",
              "created": 1637327474,
              "upvotes": 5,
              "replies": {
                "hl91y2k": {
                  "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl91y2k/",
                  "text": ">Do not tell them that you want to submit now because of the visa, that will not go down well.\n\nWell the good(ish) news is that we've already discussed this. They will not employ me further and even if I find extra funding myself, they seem to want me to finish asap just as much as I do. So there's that. I have a few other things going for me that should get me to finish on time, but I wanted to understand the actual rules in case that plan doesn't work out.",
                  "author": "goatsnboots",
                  "created": 1637327897,
                  "upvotes": 5,
                  "replies": {
                    "hldccyx": {
                      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hldccyx/",
                      "text": "If they want you to finish asap that is the best news. Listen to them and make a good effort to meet their demands, even if they seem too high.",
                      "author": "ndrsng",
                      "created": 1637402580,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hl8sl73": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl8sl73/",
      "text": "In my country it's basically your dissertation's reviewers who decide if you need more time.",
      "author": "Normal_Kaleidoscope",
      "created": 1637322260,
      "upvotes": 5,
      "replies": {
        "hl905rr": {
          "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl905rr/",
          "text": "Can I ask where that is? In Germany, once the reviewers get the diss, they write a report and a grade. They don't tell you \"nice try, revise and resubmit\".",
          "author": "cat-head",
          "created": 1637326925,
          "upvotes": 5,
          "replies": {
            "hl92ggy": {
              "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl92ggy/",
              "text": "I didn't realize people got grades for PhDs. Not sure about the person you replied to, but it's the same where I am (France). The rule is if you fail the defense, you can't defend again for 6 months.",
              "author": "goatsnboots",
              "created": 1637328166,
              "upvotes": 2,
              "replies": {
                "hl937t9": {
                  "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl937t9/",
                  "text": "I am 100% sure that also the UK has revise & resubmit for PhD dissertations.",
                  "author": "Normal_Kaleidoscope",
                  "created": 1637328562,
                  "upvotes": 3,
                  "replies": {
                    "hl99rft": {
                      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl99rft/",
                      "text": "If the thesis is substandard you can resubmit. If the viva is substandard you can try again. If both are substandard, you’re shit out of luck usually.",
                      "author": "ardbeg",
                      "created": 1637331751,
                      "upvotes": 3,
                      "replies": {
                        "hlb7z5l": {
                          "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hlb7z5l/",
                          "text": "Option two sounds terrible to be in",
                          "author": "Normal_Kaleidoscope",
                          "created": 1637359360,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hl9jmo2": {
                  "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl9jmo2/",
                  "text": "Germans like their grades in their Dr. It's a bit weird since they don't play a role outside of German academia.\n\n> The rule is if you fail the defense, you can't defend again for 6 months.\n\nThat's interesting. I honestly don't know whether they let you resubmit in Germany if you fail. I think you need a new thesis. I've never heard of anyone actually failing, only of people getting 'spite grades' and passing with the worst passing grade.",
                  "author": "cat-head",
                  "created": 1637336059,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "hl928wg": {
              "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl928wg/",
              "text": "Italy. Once they're done writing them, they will send the reviews to you. They can actually suggest to revise and resubmit.",
              "author": "Normal_Kaleidoscope",
              "created": 1637328057,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hl94mq7": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl94mq7/",
      "text": "It's maybe University-dependent, but in the UK, your supervisor's agreeement/signature is required to submit your thesis (and the supervisor arranges the viva).\n\nAlso, your supervisor knows far better than you what it takes to pass. Listen to them. If you're not ready, you're not ready.",
      "author": "Broric",
      "created": 1637329277,
      "upvotes": 4,
      "replies": {
        "hl97l1h": {
          "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl97l1h/",
          "text": "You can, if you insist, go forward without your supervisors sign off but there's usually a whole process involved to make it clear that you shouldn't\n\nMy PhD institution said there was no recourse should you fail after insisting on a viva, if you have your supervisors ok and fail there are options",
          "author": "tc1991",
          "created": 1637330721,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hl9j8fc": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl9j8fc/",
      "text": "I had a similar issue in the past, so I contacted the head of the PhD program. She said that my supervisor could make things difficult for me, and even stop me from defending, but changing supervisors would not be impossible. She asked me to try to sort things out with my supervisor, and so I did. My advice for you: inform whoever it is that's above your supervisor (Head of the program, university's ombudsman...) of what's going on and ask what your options are.",
      "author": "janegeladao",
      "created": 1637335894,
      "upvotes": 2,
      "replies": {}
    },
    "hl9k7vx": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl9k7vx/",
      "text": "In the UK, you can certainly submit without your supervisor’s approval. Often this is only done for international students whose visas are expiring, but I’ve seen it happen for a student who just never checked in with their supervisor. Obviously that guy didn’t pass. \n\nBut no, a belligerent or obstructive supervisor can’t stop a student from submitting and passing the viva",
      "author": "legendfriend",
      "created": 1637336303,
      "upvotes": 2,
      "replies": {}
    },
    "hl9qodp": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl9qodp/",
      "text": "I see you're in France, so it will probably be different from my experience in the UK. Here, at least in my university, I was possible to submit without your supervisor signing it off (they are not actually involved when you do the final submission) - but it was definitely highly frowned upon generally, and could create problems. Also, the supervisor did have to sign-off on the selection for the viva panel. So it would definitely be a difficult process to manage, and generally ill-advised, even if techinically possible.\n\nJust to counter some other views here - while normally your supervisior is the best person to judge whether you are ready, it is not always the case. Some supervisors (many in fact) are bad. I've definitely seen some who discourage students from submitting early, even if they are ready, so they can get more work out of them. Looking at work OP has written in some of the responses, this may be the case. I've also seen cases of perfectionist supervisors who constantly find new things to add or correct, even if it is not necessary to pass the PhD (PhD theses don't need to be quite the same standard as publicstions).\n\nIt's hard to judge without being in your lab though.",
      "author": "gc12847",
      "created": 1637338883,
      "upvotes": 2,
      "replies": {}
    },
    "hl9y8bn": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl9y8bn/",
      "text": "I have no idea if your supervisor can block you from defending but even if they can’t if you go a head with a defence against your supervisor’s recommendation then you are probably going to fail the defence?\n\nIn Canada you only get 2 tries at the oral defence. After that it’s game over no PhD for you, 5 years down the drain. Not sure about Europe but is this a risk you want to take?",
      "author": "Substantial_Pilot759",
      "created": 1637341851,
      "upvotes": 2,
      "replies": {}
    },
    "hl9b709": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl9b709/",
      "text": "What do you gain by not listening to the judgment and advice of your supervisors? What makes you think that other experts in the field will not agree with them.\n\nYou seem to think the the Phd metric is publishing one paper (or whatever).\n\nIf that were true, there would be no thesis and no defense.\n\nIt doesn't matter what you intend to do with your PhD after, it matters if you have demonstrated the criteria necessary to be pass the defense etc.\n\nGenerally your supervisor is not going to purposely try to sink you, and they wont have to becasue it will be obvious to the external reviewers and your internal committee that you haven't met the milestones if you haven't .  These people typically can recommend a fail, a major revise and resubmit (i.e. requiring more experiments etc) or a minor revise and resubmit.\n\nYou have a thesis / grad ed department of some kind and the rules should be also stated, so ask this office. This not only varies by country but also by discipline and department.",
      "author": "PersephoneIsNotHome",
      "created": 1637332404,
      "upvotes": 1,
      "replies": {
        "hl9dwyp": {
          "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl9dwyp/",
          "text": "I think some context about what I'm dealing with from my perspective might help. My PhD is funded for three years, and I am 3 months shy of that deadline right now. My lab is very paper-focused. When I joined, I was told by all three of my supervisors as well as current students that all you had to do was published 1 paper to get a PhD. The students in this lab were really struggling to get anything published. The \"amazing\" defenses that I went to were by students who managed to get 2. The lab was struggling, and I was told repeatedly that all they wanted to see were publications.\n\nWhen I got my first paper published, my supervisors were delighted with me. When I got two published (just after a year of my PhD), my supervisors' attitudes completely changed. I was then told that they would not allow me to defend until I had three total papers published and that they were not going to count my two existing publications. At this point, I went to my doctoral school and asked them if my publications thus far sufficed, and they confirmed that they did.\n\nJust a note - the actual work of my PhD was *never* mentioned. It was obviously the topic of meetings and my presentations, but my supervisors *not once* mentioned needing to see specific work from me in order to validate my thesis.\n\nRight now, I have four papers total published. I have *by far* the most publications by students in this lab. Two others are in review, and I plan to submit another in December. Because my supervisors and the lab as a whole have been so focused on me and other students publishing, that's also what I was focusing on. That said, I think my work is strong, I've gotten good reviews from peers outside my lab, so I don't feel like my sense of my work is inflated.\n\nThen, two months ago, my supervisors said they wanted to see some specific work from me in order to validate my thesis. That wasn't a problem for me, and I started working on it. I won't go into too much detail on this part, but this work they requested required the help of a specific faculty member who is very cagey about his work. Other faculty members are not \"allowed\" to work with the materials this guy \"owns\", so any work in this realm has to go through him. He's a nice guy, but he's very busy. We agreed months ago to do this last bit of work in November when he'd be free to do it. Well, he just went out on unexpected leave a couple weeks ago and likely won't be back for a while (possibly before Christmas but also maybe not until the new year). I've asked other faculty members and post-docs that I work with for their help on this, but I kid you not, not a single person even knows this stuff well enough to be able to help me.\n\nSo this is where I'm at. This obviously requires an honest conversation with my supervisors about where they see this going because I don't think it's fair to hold me back for reasons entirely outside my control. This is why my question is basically \"I've published enough papers; does that mean I can just defend and be done\".\n\nThat's the context, now onto your comment.\n\n>What do you gain by not listening to the judgment and advice of your supervisors? What makes you think that other experts in the field will not agree with them.\n\nI gain the ability to actually finish the PhD. I mentioned in another comment that my visa is also expiring and my supervisors don't want to keep me employed here, so I either finish in three months or I don't finish at all.\n\n>You seem to think the the Phd metric is publishing one paper (or whatever).\n\nAbsolutely true until a couple months ago, because that is just how my lab communicates things to their students.\n\n>Generally your supervisor is not going to purposely try to sink you\n\nGonna be honest here - it really feels like they are out to get me a bit, considering that I am being held to a standard way higher than any of the other students here.",
          "author": "goatsnboots",
          "created": 1637333617,
          "upvotes": 2,
          "replies": {
            "hla97z2": {
              "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hla97z2/",
              "text": "Can I ask for a bit more information about your papers? Are they in quality journals, and did any of your supervisors contribute to the papers, are they listed as coauthors? From reading this, it even sounds like your supervisors may doubt some of your work, is that possible? I'm sure this is all very stressful.",
              "author": "The-very-naughtyduck",
              "created": 1637346133,
              "upvotes": 1,
              "replies": {
                "hlafoip": {
                  "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hlafoip/",
                  "text": "My lab pushes students to publish in conferences only, and my supervisors have been heavily involved in everything. Two of them are in high-quality conferences, one is in a more mid-tier conference, and one is in a crap conference. However, even the crap conference would have sufficed for the doctoral school.",
                  "author": "goatsnboots",
                  "created": 1637348482,
                  "upvotes": 1,
                  "replies": {
                    "hlalguf": {
                      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hlalguf/",
                      "text": "Got it. Normally where I am and in my field (it might be different in yours), conference papers wouldn't be, on their own, much evidence of PhD quality as they're not peer reviewed. I'm not sure about your field. You could potentially also recycle material between different conferences, so one piece of work can result in several papers (but I don't know your work, I don't know if any of this is a factor here or not). \n\nIt might be that they've seen conference papers as sufficient for other students, but they could have genuine concerns about your work (quantity or quality) despite the conference papers. But it's impossible for anyone here to really know. There have certainly been cases where supervisors have been completely unreasonable regarding student submission. \n\nI think in this case you would benefit from a confidential second opinion from an academic who isn't your supervisors, but who can review your thesis plan and discuss your concerns. Is that possible? Because if their concerns have merit, then you don't want to go scorched earth with your supervisors as you'll need their help to finish up. But if they're being unreasonable you will need to escalate.",
                      "author": "The-very-naughtyduck",
                      "created": 1637350594,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hl9rzst": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hl9rzst/",
      "text": "Answering for Sweden: Your advisor cannot stop you from defending your dissertation. In fact, you can schedule a defense for any dissertation and thesis, but if you fail you may have to pay the costs associated with the defense (printing copies of the dissertation etc).\n\nAs mentioned by /u/ardbeg it is generally *very* inadvisable to defend without the go-ahead from your advisor since you are *highly* likely to fail.",
      "author": "Irlut",
      "created": 1637339410,
      "upvotes": 1,
      "replies": {}
    },
    "hlb95l8": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hlb95l8/",
      "text": "I would assume no committee would put you through if your supervisor says you aren’t ready",
      "author": "Sad-Dot9620",
      "created": 1637359853,
      "upvotes": 1,
      "replies": {}
    },
    "hlc0m12": {
      "link": "/r/AskAcademia/comments/qxdxme/european_phds_can_supervisorsreviewers_prevent/hlc0m12/",
      "text": "The primary requirement to compete a PhD is to convince your supervisor and committee that you are capable of being an academically mature and independent contributor to your field. \n\nYou can do this with zero papers, with 1-2, or with a dozen. Each paper should mean you've contributed something rigorous and novel to the field. But, not all papers are equal, nor all authorship contributions. You can't just count and say the proof is there. \n\nSo, yeah. A supervisor can look at your body of work and say that you're not ready. You can not force their signature on your materials, and you need their signature. This means you don't graduate. In cases where the supervisor is being abusive, you could file a formal grievance and get some options there - but it seems as though this isn't the case here.\n\nIf your funding is running out, you may be able to get funding from your institution or your supervisor's grants. Many programs have guaranteed funding which gives them an obligation to keep you paid. \n\nDo talk about your career goals with your supervisors too. Make sure they know what you're aimed at.",
      "author": "cactusmittens",
      "created": 1637371784,
      "upvotes": 1,
      "replies": {}
    }
  }
}