{
  "sid": "qhpak9",
  "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/",
  "title:": "Your best/worst conference experiences?",
  "text": "Hi all,\n\nU.K. undergrad here - I'm part of the organising committee for a finance conference taking place early next year.\n\nAs someone who obviously hasn't had much personal experience at conferences/recruitment fairs or similar - it'd be great to know what the sub's experiences have been of those kind of events (I know a lot take place in the world of academia) in the past and anything particularly good/bad that stuck with you - right down to the smallest details!\n\nThank you in advance :)",
  "author": "afaqa-y13",
  "created": 1635434146,
  "updated": 1636174334,
  "over_18": false,
  "upvotes": 35,
  "upvote_ratio": 0.97,
  "comments": {
    "hie3p8i": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hie3p8i/",
      "text": "In my first conference presentation I was so nervous that I spoke way too fast and gave an 18 minute talk in about 11 minutes. No one had any questions and I bolted out of the room as soon as it was over.",
      "author": "RenegadeBevo",
      "created": 1635434943,
      "upvotes": 47,
      "replies": {
        "hiemzyi": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiemzyi/",
          "text": "OK, now what was your worst conference?",
          "author": "01010100111011011011",
          "created": 1635442492,
          "upvotes": 42,
          "replies": {
            "hievz8e": {
              "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hievz8e/",
              "text": "Thankfully the first was the worst, so far had been pretty smooth after that!",
              "author": "RenegadeBevo",
              "created": 1635445972,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "hieuj9z": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hieuj9z/",
          "text": "My first conference talk was on day 3 at 7pm at a conference that started at 7 am. I was pretty wrecked and someone asked a question that just wouldn't compute no matter how much they rephrased. I didn't get it until the next morning. Mortifying.",
          "author": "NosemaCeranae",
          "created": 1635445404,
          "upvotes": 14,
          "replies": {}
        },
        "hieuk1y": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hieuk1y/",
          "text": "My first presentation at a conference was in the morning of the first day after the plenary.  The breakout room had been set up but evidently not tested.  The mic kept going in and out and at random intervals loud music would blast.  I was a nervous wreck by the end.",
          "author": "Ocean2731",
          "created": 1635445412,
          "upvotes": 6,
          "replies": {
            "hifnbfg": {
              "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hifnbfg/",
              "text": "This made me laugh so hard!",
              "author": "chicajajaja",
              "created": 1635456967,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "hif09zl": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hif09zl/",
          "text": "I feel this! I gave a 12 min talk in 6 minutes with a migraine. Then I immediately ran out of the room and threw up in a potted plant.",
          "author": "DessertGhost",
          "created": 1635447671,
          "upvotes": 4,
          "replies": {}
        },
        "higno7m": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/higno7m/",
          "text": "Aw ♡ ! I'm sure you're much better, now, right?",
          "author": "lelebeariel",
          "created": 1635473641,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiedo9j": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiedo9j/",
      "text": "Worst at a conference itself: they had barely any food for vegetarians or vegans. The first night included a dinner with a massive buffet. The vegetarian option was a salad with cheese in it. For the vegans, it was grapes and bread.\n\n\nWorst personal experience: Gave a 20-minute presentation during a doctoral consortium. Spent the next 40 minutes listening to everyone tear my project apart. The worst part is that they had major problems with my project itself, which I had nothing to do with. So I couldn't even defend myself. One guy started laughing at me saying that he'd be embarrassed to have me as his student.",
      "author": "goatsnboots",
      "created": 1635438874,
      "upvotes": 43,
      "replies": {
        "hiegg7u": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiegg7u/",
          "text": "I just do not get that level of rudeness and negative criticism in some fields.  IDK, maybe my field (composition/rhetoric) has a different way of thinking about feedback; we largely don't use conference QandA to tear people down.  Criticism should be constructive, not destructive ffs.  On a funny note, my father-in-law runs a small military museum in a college town and was invited to attend an academic history conference at the university. Apparently, he was so horrified by how mean the historians were to each other (hostile questioning and such) that he started to worry that was what I was going through every time I presented at a conference. He was very relieved to hear that my conferences were not like that!",
          "author": "thetornadoissleeping",
          "created": 1635439951,
          "upvotes": 28,
          "replies": {}
        },
        "hieji4s": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hieji4s/",
          "text": ">he'd be embarrassed to have me as his student.  \n\n\n\"I bet your wife is embarrassed to have you in bed\"  \n\n\nseriously, what a dick wow",
          "author": "Alephnaught_",
          "created": 1635441137,
          "upvotes": 20,
          "replies": {}
        }
      }
    },
    "hie7edu": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hie7edu/",
      "text": "Worst- a PI I had just met asked me if I wanted to go back to his hotel to have sex with him when I was an undergrad.",
      "author": "MercuriousPhantasm",
      "created": 1635436411,
      "upvotes": 62,
      "replies": {
        "hie9sof": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hie9sof/",
          "text": "I don't think it can get much worse than that.",
          "author": "CootaCoo",
          "created": 1635437358,
          "upvotes": 24,
          "replies": {}
        },
        "hiee9t7": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiee9t7/",
          "text": "Oh my god. Did you say something to anyone?",
          "author": "goatsnboots",
          "created": 1635439110,
          "upvotes": 4,
          "replies": {
            "hier04x": {
              "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hier04x/",
              "text": "No, this was pre-\"Me Too\"/ \"Time's up\" so it basically would have only harmed my career prospects. I was in the process of submitting grad applications too, so I wasn't willing to take any risks. At the time I was actually concerned that I had \"led him on\" by letting him pay for drinks (I had assumed he was just being nice because I was a poor undergrad.\")",
              "author": "MercuriousPhantasm",
              "created": 1635444025,
              "upvotes": 14,
              "replies": {}
            }
          }
        },
        "hieynaf": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hieynaf/",
          "text": "That's absolutely disgusting. So sorry this happened to you.",
          "author": "Aliudnomen",
          "created": 1635447021,
          "upvotes": 1,
          "replies": {
            "higab3w": {
              "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/higab3w/",
              "text": "I’m so sorry about this happened to you. \n\nIn one of my previous lab the PI asked one of the female students to sit into the same hotel room with him. The female student was too afraid to say anything. I only got to know this years later. We really need a system to allow victims to report incidences safely and actually punish these PI craps.",
              "author": "rietveldrefinement",
              "created": 1635467524,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "hieglbg": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hieglbg/",
      "text": "At my first conference as a grad student, presenting what little data I had gathered to that point, I had two senior PIs approach my poster and just rip me to shreds.  I mentioned it to my advisor and she recognized them and said they were probably still holding a grudge against her.  They were all part of a pioneering generation in that field, all know each other, reviewed each other's grants and so on, and consequently all despise each other now.  I've witnessed the pettiness among them other times since and feel so happy I was able to get out of that field.  It was a pretty big confidence killer though!",
      "author": "tamelotus",
      "created": 1635440004,
      "upvotes": 16,
      "replies": {
        "hiila2o": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiila2o/",
          "text": "I know I would have burst into tears if that happened to me. Sorry you bore the brunt of someone else’s grudge ://",
          "author": "allevana",
          "created": 1635517493,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hiefu16": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiefu16/",
      "text": "Worst was at my first conference, I (F) was early 20s. One man, in his 50s made an extreme and obvious effort to accompany me on all of the social excursions. I was visibly uncomfortable. At dinner, on a round table with 6 other men, including conference organiser, the man asked me if I would be \"opposed to marrying his son\". Everyone just listened to our interaction, then continued on with their conversations.",
      "author": "Fun-Scholar7132",
      "created": 1635439712,
      "upvotes": 14,
      "replies": {}
    },
    "hiec67c": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiec67c/",
      "text": "The most important thing for my experience at a conference mostly based around talks IMO is having humane timings that are rigorously kept to. You can't have sessions overrunning so participants get no coffee breaks, or 15 minutes to eat lunch.\n\nParticipants need to be able to efficiently get food and coffee in breaks. I would much prefer an option for not-great food that is faster than needing to sit for an hour and a half to get a sit-down meal when I really need to catch up on emails, work on my talk or take some personal time in the lunch break.\n\nA good conference dinner and some evening activities are also great for building connections. For example I've been to some good evening poster sessions with freely flowing local beer and nibbles facilitating a well attended poster session with lots of great exchange. Ideally posters should be hanging around in the coffee break area for a couple of days before the session so people get a chance to look around and decide which posters they specifically want to talk to people at.",
      "author": "nickbob00",
      "created": 1635438289,
      "upvotes": 11,
      "replies": {
        "hih5ad9": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hih5ad9/",
          "text": "Yes! Time management and good moderation so people actually stay on point make or break a conference.",
          "author": "doornroosje",
          "created": 1635482698,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hie6xig": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hie6xig/",
      "text": "Last year at the EGU they had this online conference, and the sessions consisted of everyone giving a 2 minute talk (this bit was 45 mins long) and then 15 mins of questions. Cos everyone was together, as in students together with professors and their million pound grants, I did my 2 minute talk to a wall of blank camera off zoom boxes, when I finished there was just silence before the next talk, and at the end obviously everyone had questions about the sexy expensive stuff. \nIt cost several hundred pounds, despite me messaging a few folks whose work I was interested in I got no replies, no engagement at all and spoke to noone. Worst experience of my PhD to be honest.",
      "author": "2xw",
      "created": 1635436227,
      "upvotes": 28,
      "replies": {
        "hiejsqz": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiejsqz/",
          "text": "This is my experience with a virtual talks and posters. Crickets.",
          "author": "IceCreamPeace",
          "created": 1635441252,
          "upvotes": 15,
          "replies": {
            "higai9s": {
              "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/higai9s/",
              "text": "I presented a poster at a virtual conference session this summer. They actually had two sessions, one ok for American time zones and one ok for Asia. They told us to attend both sessions. I wake up at the crack of dawn in the US to attend the Asian session. There’s literally no one there \n\nApparently the web platform they were using was blocked by the Chinese firewall, LOL",
              "author": "magnetic-nebula",
              "created": 1635467616,
              "upvotes": 11,
              "replies": {}
            }
          }
        },
        "hie9pce": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hie9pce/",
          "text": "AGU last year was similar unfortunately!",
          "author": "CootaCoo",
          "created": 1635437322,
          "upvotes": 1,
          "replies": {
            "higrjki": {
              "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/higrjki/",
              "text": "Hey I was also at that AGU and gave a 2 min talk to blank cameras. Weirdest presentation I ever did, with the online html poster we had to walk people through. I also did it at like 10 pm, some person from Germany was in my section and it was 3 am for them. What a mess.",
              "author": "Ut_Prosim",
              "created": 1635475432,
              "upvotes": 3,
              "replies": {
                "hiio0oe": {
                  "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiio0oe/",
                  "text": "Yeah, I appreciate the effort they put in trying to get everything to work online, but it was just a bizarre experience. And I felt like they made the posters needlessly complicated. I decided not to present at this year's AGU since I'm unable to travel to the US right now and I don't want a repeat of last year.",
                  "author": "CootaCoo",
                  "created": 1635518624,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hierqro": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hierqro/",
      "text": "This is just more things I don't like. \n\nMy biggest pet peeve is just how they cram so many talks into one session. You know they are going to go over and be rushed.\n\nAlso, not enough time between sessions. I need basic bio/cognitive breaks and will just have to skip things to do so. \n\nSTOP giving so much lame swag! You are just spending limited money unnecessarily to hand me what will ultimately just be trash.",
      "author": "EccentricName",
      "created": 1635444312,
      "upvotes": 9,
      "replies": {
        "hiflfk6": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiflfk6/",
          "text": "I feel like the swag is almost all stuff from the sponsors and if there's any sort of trade fair or exhibition, the vendors there.",
          "author": "JHT230",
          "created": 1635456180,
          "upvotes": 1,
          "replies": {}
        },
        "hih82jk": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hih82jk/",
          "text": "I completely agree! Spend the money on coffee/snacks instead of cheap plastic swag/trash",
          "author": "DockingBay_94",
          "created": 1635484548,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiehuei": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiehuei/",
      "text": "Thought it would be fun to enter a niche competition at a conference as a grad student. Group organizer says judges notes will be made available so that participants know where they need to improve. 2 of 3 judges were Penn State alumni. Penn State grad student congratulated me on most likely winning (all the grad students thought I had won). Penn State grad student wins. I request judges notes multiple times. Never received them. Ran into the Penn State grad student at a mixer a year later. Grad Student concedes they probably won because 2 of 3 judges were Penn State alumni. They also asked to see the judges notes and never got them. \n\nNot the most egregious incident here. But it always stuck with me.",
      "author": "sinnayre",
      "created": 1635440489,
      "upvotes": 21,
      "replies": {}
    },
    "hieafmo": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hieafmo/",
      "text": "In my own experience smaller conferences are a much better experience than large conferences (although I haven't been to very many due to the pandemic). The main advantage of going to a conference is to network, form collaborations, and get feedback on your work. It's very hard to do that at some of the big conferences when you have 10,000+ attendees spread out over hundreds of sessions. So if you're organising one I would say make sure there are plenty of opportunities for attendees to interact and ask each other questions, rather than just having an endless blitz of presentations and posters.",
      "author": "CootaCoo",
      "created": 1635437610,
      "upvotes": 8,
      "replies": {
        "hih5l9i": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hih5l9i/",
          "text": "Big conferences are amazing for meeting your cross continental academic friends, showcasing yourself to the world, learning about new approaches, and expanding your network in breadth. \n\nSmaller conferences are amazing for in-depth discussions with people who know their shit, getting feedback on your work, and enhancing your network in depth. \n\nEvening drinks are the best part of both conferences ;).",
          "author": "doornroosje",
          "created": 1635482895,
          "upvotes": 3,
          "replies": {
            "hiinikv": {
              "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiinikv/",
              "text": "I completely agree with your second and third points, unfortunately I have not found the larger conferences to be as useful. I'm talking BIG though, the main conference in my field typically has upwards of 25,000 attendees. It's basically a small city.",
              "author": "CootaCoo",
              "created": 1635518414,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hie7319": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hie7319/",
      "text": "I've only had one conference, which was a mix of a good and bad experience. I think the biggest thing I wished was different was giving us more break times in between all the events, and maybe less events overall. I understand the value of having so many talks, but at the same time, conferences are also places to foster networking. I felt like I didn't have the time or energy to do so at the end of each day. Additionally, it wasn't very accessible for people with joint issues, as we would basically have like 5 minutes to run between conference rooms on the other end of the building or up/down 2 flights of stairs, so more time in between would've immensely helped with that.",
      "author": "valryuu",
      "created": 1635436286,
      "upvotes": 4,
      "replies": {
        "hie87c6": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hie87c6/",
          "text": "My approach to conferences has evolved over the years. I now prioritize networking. I only go to presentations if I'm presenting or can't find someone to talk to.",
          "author": "junkdun",
          "created": 1635436728,
          "upvotes": 8,
          "replies": {
            "hieahn8": {
              "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hieahn8/",
              "text": "I'd do the same, but for me, the trouble was that most people were in the talks at the conference I was at, so there was barely anyone in the halls/foyers to network with!",
              "author": "valryuu",
              "created": 1635437631,
              "upvotes": 6,
              "replies": {
                "hiev7ff": {
                  "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiev7ff/",
                  "text": "The solution for this is that conference organizers should keep snacks and coffee in the hallways, and don't take it away when the talks start ;)",
                  "author": "alexandroid0",
                  "created": 1635445669,
                  "upvotes": 1,
                  "replies": {
                    "hiey0qx": {
                      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiey0qx/",
                      "text": "There were for mine, but idk, I guess my field is workaholic or something? :/ The foyers were basically empty between presentations aside from people who got lost. (Tbf, the snacks weren't great either lol)",
                      "author": "valryuu",
                      "created": 1635446773,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hieqgso": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hieqgso/",
      "text": "Structure your programme around when you expect people to be hungry, coffee thirsty or need the bathroom. 10 min breaks are too short if they are to get coffee AND use the bathroom, and they are because conference people have lots of needs. Even a break in the middle of a panel might be a good idea, like 2 minutes to allow people to stretch their legs. \n\nDon’t make the schedule run too late in the evening and start very early in the morning, be reasonable. Most people have to take an hour or so morning and evening to answer emails and look after job duties. \n\nGood luck and remeber to have fun and talk to as many people as you can!",
      "author": "BarbaraMerkin",
      "created": 1635443817,
      "upvotes": 5,
      "replies": {}
    },
    "hies5qd": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hies5qd/",
      "text": "Probably two experiences (both at virtual conferences) jump out at me as bad so far:\n\n1) I was presenting at a famous international conference in my discipline; our 20-minute talks were pre-recorded, and we would attend a live Q&A session on the day. I went to one of the morning Q&A sessions, and every single chair expected presenters to have a truncated 5-minute version of their talk ready (including slides etc.), which wasn't stipulated in the conference guidelines. Everyone then panicked and many presenters ended up repeating their 20-minute talks as they couldn't ad-lib at such short notice. I think every single session ended up running over by at least half an hour. I was lucky to be in one of the last sessions, so I could cobble something together, but it sucked to have that sudden stress when we thought we were all set.\n\n2) A small postgrad conference I was presenting at had issues with many of their presenters: either they didn't respond to their acceptance emails and never showed up, or had terrible connection issues. I couldn't attend for the whole conference as I was teaching that day, and when I turned up at my timeslot, the screen told me that everyone was on lunch break. I messaged one of the organisers, and they told me that they had been forced to move everyone's slot forward 1.5 hours to fill the vacant times, so I had long since missed mine. They never sent me any warning emails or suggested that this might happen during the organisation process.",
      "author": "3calico3",
      "created": 1635444476,
      "upvotes": 5,
      "replies": {}
    },
    "hieq2wo": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hieq2wo/",
      "text": "Been to a few conferences and still don't understand the point of them.\n\nIt appears to be where famous professors introduce their PhD students to other famous professors.\n\nAnd then the PhD students are like, \"I networked\".",
      "author": "radionul",
      "created": 1635443667,
      "upvotes": 9,
      "replies": {
        "hifcqf8": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hifcqf8/",
          "text": "I found conferences useless for about 80 percent of the time. But occasionally you would be in a session with people working on similar stuff with similar problems and everyone would brainstorm solutions to common issues.",
          "author": "RenegadeBevo",
          "created": 1635452653,
          "upvotes": 6,
          "replies": {
            "hifljcc": {
              "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hifljcc/",
              "text": "I could see that happening in a field where people aren't braindead.",
              "author": "radionul",
              "created": 1635456223,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hiene9d": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiene9d/",
      "text": "Based on experiences:\n\n- have a code of conduct AND a process for people reporting problems and how you'll deal with them\n\n- make speakers stick to time\n\n- have gender balanced sessions (and ideally ethnicity)\n\n- subsidies for students who can't afford to come (if possible)\n\n- subsidies to allow individuals to bring their babies/partner to care for baby (if possible)\n\n- facilities for breast pumping\n\n- software to provide subtitles for talks\n\n- alternatives to cheese and wine networking\n\n- secure areas to store bags\n\n- provide snacks and lots of water and hot drinks\n\n- pay speakers some of their expenses",
      "author": "ACatGod",
      "created": 1635442643,
      "upvotes": 14,
      "replies": {}
    },
    "hif3kw8": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hif3kw8/",
      "text": "At my second or third conference, I didn't get any questions after my talk. It was a bit surprising because first it was a good and interesting talk for the audience and second if nobody asks a question then the chair was asking something for sure. I mentioned this to my advisor and he told me that I could have gotten a few questions if I hadn't leave there in 3 seconds. Apparently I left the stage as soon as I finished the presentation haha. He is a chill guy so didn't care and people asked questions in-person. So it was fine overall. But boy, I used to very nervous at presentations and I'm still quite uncomfortable so I work a lot for the presentation.",
      "author": "atrlrgn_",
      "created": 1635448991,
      "upvotes": 3,
      "replies": {}
    },
    "hif65xw": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hif65xw/",
      "text": "Speakers not staying to their allotted time limit.\n\nI was one of three speakers in a session. We were each given 20 minutes for our talk. The first speaker spoke for 45 minutes. The facilitator did not enforce the time limit upon this person. As the last speaker, I was rushed because there was hardly any time left in the session. As a result, you could hear the nerves in my voice, I stumbled over my words, and I even skipped over entire sections of my talk (all the more mortifying for me, as a distinguished and respected scholar in my field was sitting in the audience). And it wouldn't have been that way had I been given my allotted amount of time to present my paper.",
      "author": "mhfc",
      "created": 1635450021,
      "upvotes": 3,
      "replies": {
        "hiho1lx": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiho1lx/",
          "text": "This happened during an online conference I attended: the last presenter had 5 minutes rather than his allotted 20, and most of the Zoom audience had already left by that point. I think chairing is tricky, but they need to be confident enough to interrupt or give time warnings without thinking that it's rude.",
          "author": "3calico3",
          "created": 1635497446,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hiffw9d": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiffw9d/",
      "text": "The best one was a small conference with a specific scope and a nice group of people. Everyone attended everyone else's presentations then had active conversation afterward, sometimes referencing other presentations from earlier in the day. \"I had a question about _____, now John, you talked about this yesterday so maybe you'll have a comment too\" It was nice. \n\nWorst was a huge conference with a big emphasis on networking. As soon as people learned I was an adjunct at a school they hadn't heard of they almost physically turned away to find someone else to chat with. That one also had terrible wifi that half of the hundreds of attendees couldn't connect to.",
      "author": "KiltedLady",
      "created": 1635453916,
      "upvotes": 3,
      "replies": {}
    },
    "hie4n26": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hie4n26/",
      "text": "Are you asking what we expect? Or what we wish had been different? I’m trying to understand if you’re asking about our personal experiences AT a conference or if you’re asking about we experience THE conference. Does that make sense? Like the difference between the time I had a PowerPoint with spelling errors and how awful that was to see on the projection vs. the lack of guests at an 8am panel because the organizers, for some awful reason, thought people would want to be at a panel that early. One is me, the other is the conference organizers.",
      "author": "crepuscularsounds",
      "created": 1635435320,
      "upvotes": 5,
      "replies": {}
    },
    "hieagr0": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hieagr0/",
      "text": "I was chair or vice chair on several 500 to 700 attendee conferences in the usa. Happy to answer questions. What size is yours? Do you have a tradition or template to follow from past conferences? Is it f2f or virtual?\n\nWill you have invited keynote speakers? Are meals involved if f2f?\n\nIs it weekdays or weekends?\n\nYou can DM me questions.",
      "author": "AliasNefertiti",
      "created": 1635437622,
      "upvotes": 2,
      "replies": {}
    },
    "hiealqo": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiealqo/",
      "text": "The time constraint for me sucked. I had 10 minutes (including questions) to present a new publication in biophysics so I literally had 5 minutes to present an entire paper and give 5 for questions.",
      "author": "FeLoNy111",
      "created": 1635437677,
      "upvotes": 2,
      "replies": {
        "hiegos7": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiegos7/",
          "text": "Was that the planned time allotment , or did someone on your panel go over time and leave you with so little?",
          "author": "thetornadoissleeping",
          "created": 1635440040,
          "upvotes": 3,
          "replies": {
            "hieh2dy": {
              "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hieh2dy/",
              "text": "That was the planned allotment",
              "author": "FeLoNy111",
              "created": 1635440184,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hif3cjz": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hif3cjz/",
          "text": "I get that that's annoying, but on the other hand, being able to present why your work is interesting and what you've found in a short amount of time is an essential part of doing science. If people are interested, you can always whip out the bonus slides or direct them to your new publication.",
          "author": "axialintellectual",
          "created": 1635448900,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hies8ve": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hies8ve/",
      "text": "we were strongly encouraged and pressured to man a bank of phones to make cold calls for a particular presidential candidate; during the conference",
      "author": "04221970",
      "created": 1635444510,
      "upvotes": 1,
      "replies": {}
    },
    "hiej731": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiej731/",
      "text": "Just to demonstrate the difference between what men and women experience, my worst conference experience was the session moderator asking what amounted to “ok, but what’s the point?” at the end of my talk. I thought it was understood that sometimes science is done for it’s own sake.\n\nI’ll take that over sexual harassment and assault any day of the week.\n\n-----\n\nMy best conference experience was giving a talk at a national conference about a particular teaching technique I’ve been developing, where the researcher whose work largely informed what I do was in the audience, I had lots of good questions, and I could see her look of approval with my work and the responses I gave. I have “only” a Master’s degree, and this experience was very validating.",
      "author": "ProbabilisticWorld",
      "created": 1635441018,
      "upvotes": -2,
      "replies": {}
    },
    "hificqc": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hificqc/",
      "text": "I organized a small conference when in grad school for several years. I think people appreciate:\n\n* food and other refreshments--make sure the coffee (and hot water for tea) stay out\n\n* at least one extended break between panels, so people aren't always plunging from thing to thing after 15 minutes\n\n* enforcement of time limits: I never like it when the chair for the session is also one of the presenters; it needs to be an outside party (we used to recruit grad students in our program to do it; at one society I go to, they typically solicit volunteers ahead, which I like)\n\n* try to make sure panels on similar topics are not programmed against each other; if there are only two sessions on a certain subfield, they should not be at the same time!\n\n* if there's a keynote, try to pick a good time for it; at our one-day conference mostly attended by people in driving distance, we did a lunch keynote, so that people who came for just half the day could attend it whether they did just the morning or just the afternoon\n\n* have fewer concurrent panels later in the day, since you will have fewer attendees during that time",
      "author": "BewareTheSphere",
      "created": 1635454909,
      "upvotes": 1,
      "replies": {}
    },
    "hig0zsk": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hig0zsk/",
      "text": "My worst conference experience is that I’m supposed to pay for it all up front out of my own pocket as a graduate student. I make $24,000 a year: the cost to go to AGU is over 1/12th of my annual wage. And, somehow, I’m supposed to make it in academia when I’m effectively priced out of the career path.\n\nMy advice is to make it affordable. I want to drop out over the expenses that come with the PhD that no one told me about when I accepted my offer.",
      "author": "stackofwits",
      "created": 1635463140,
      "upvotes": 8,
      "replies": {}
    },
    "hifopts": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hifopts/",
      "text": "I know you're asking for experiences as someone attending a conference but I thought I'd reply as someone who's organized a conference. Things I learned were that just because the conference may go from 8am to 8pm doesn't mean you should be the one there an hour early and an hour late for all 3 days of the conference. I've never been so tired in my entire life. Don't forgot to schedule breaks into your day, and allow yourself to actually attend sessions of the conference you helped put together. Celebrate the end of the conference with the committee privately once it's all done. You guys will be exhausted and worked so hard to pull it together, remember to celebrate that. Yes it's ok to fire a volunteer, not all volunteers are worth the effort. And you can't please everyone but most attending the conference will enjoy it :)",
      "author": "SuchAGeoNerd",
      "created": 1635457563,
      "upvotes": 7,
      "replies": {}
    },
    "hifrc06": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hifrc06/",
      "text": "I once had someone fall asleep and start snoring loudly! I have a loud voice, I'm good at projection, I was using a microphone. He still drowned me out!",
      "author": "zzeeaa",
      "created": 1635458713,
      "upvotes": 5,
      "replies": {
        "hih3i2n": {
          "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hih3i2n/",
          "text": "I kinda feel sorry for the guy. He must've been so exhausted if he fell asleep with so much going on around him. Another reason that frequent breaks are so necessary.",
          "author": "valryuu",
          "created": 1635481621,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "higb65r": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/higb65r/",
      "text": "1. Organizers usually assign younger students and researchers to be the last presenters in last sessions. So usually there’s only a handful folks sitting in the room and no one ask questions. …:( \n\n\n\n2. Went to a small conference and figured out the attendees already know each other so well…kinda feel like an outsider initially. \n\nSo ended up grabbing the other outsiders and formed a group. That was quite fun actually.",
      "author": "rietveldrefinement",
      "created": 1635467922,
      "upvotes": 5,
      "replies": {}
    },
    "hig2apn": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hig2apn/",
      "text": "I was chair for a Thursday 8:30 AM panel (Thursday-Sunday conference). There was a huge snowstorm that cancelled flights in the area. I ended up with 2 panelists presenting over Zoom, myself and one other presenting in person, and 2 audience members who were presenting in the next panel slot in that room.",
      "author": "honkoku",
      "created": 1635463749,
      "upvotes": 4,
      "replies": {}
    },
    "hig491x": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hig491x/",
      "text": "I went to a conference in San Jose I think but turns out that the timing was the absolute worst because there was a wildfire pretty close at that time. At least close enough that there was a ton of smoke in the air. It was bad enough that I was sick as a dog by the time I got home. Because of that, I had to cancel any activity I had planned for outside the conference and I'm glad I didn't go on the excursions the conference planned. \n\nThough it was fine because there were some really cool talks given. Also one of the sets of bathrooms were not differentiated as Male and Female. Bother we're multi-stall and unisex. It was kind of interesting to people watch for a bit to see how they decided which one to use. It was an anthropology conference so I was fine and I was only watching from across the hall. Though if I wasn't burnt out from academia, it would have made for an interesting research project idea.",
      "author": "megers67",
      "created": 1635464660,
      "upvotes": 3,
      "replies": {}
    },
    "hih53tl": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hih53tl/",
      "text": "Best:  that one time I was on a panel that was so popular people were standing in the doorway to listen, and sitting on the floor.\n\nWorst: all those stupid online conferences",
      "author": "doornroosje",
      "created": 1635482586,
      "upvotes": 2,
      "replies": {}
    },
    "higvdnz": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/higvdnz/",
      "text": "I'm actually at a work conference this week. This is also my first conference in my professional career, so forgive me for any ignorance I may have. \n\nI'm so glad we found a venue that fed us so well. We have breakfast and lunch at the hotel where we held the conference and the food was unique in that it went the extra mile, catered for different diets, and all of it was so delicious. There was a coffee bar and snacks throughout the day too.\n\nIf you have a hybrid audience of virtual and in-person attendees, the conference made a good effort to include virtual as part of the discussions and presentations. Note, this is also a smaller group of 36 in-person and about 15 virtual. This may not be feasible for larger conferences.\n\nThis conference also made space for wellness by having a coloring book at every table. We also had a mini workshop that involved Play-Doh and the rest of the conference there were a number of people that used the Play-Doh as a fidget/ sensory tool to stay focused. Of course, you may want to know the maturity level of your crowd ahead of time.\n\nWe also made a strong effort to stick to the schedule, down to the minute, if we could. This was for the virtual participants, but I think both groups appreciated the structure.",
      "author": "lilycris",
      "created": 1635477296,
      "upvotes": 1,
      "replies": {}
    },
    "hii0ekb": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hii0ekb/",
      "text": "Depending on the location please be aware of how people get back to their hotels.\n\nI had a conference where the hotel it was in was booked up. To get back to the nearest village and then on to my hotel I needed to walk down a 1 mile pitch black wood driveway and cut through an abandoned train station before getting to the tram station. I had to leave the socialising early to try and get back before the sun set.\n\nI’m a lone female traveller. A male conference goer offer to walk with me but I decided to take the chances of going alone. I think he was just being thoughtless, but he’d told me how the woods reminded him of how his grandma was raped by soviet soldiers at the end of ww2, possibly in the same woods! \n\nAlso human breaks please and remember to organise regular food and coffee in them.",
      "author": "PristineAnt9",
      "created": 1635507242,
      "upvotes": 1,
      "replies": {}
    },
    "hiikafd": {
      "link": "/r/AskAcademia/comments/qhpak9/your_bestworst_conference_experiences/hiikafd/",
      "text": "Best: my first conference presentation — I felt prepared, arrived at the room early to set up, and prayed someone would show up. To my shock, it was standing room only, well received, and I got several consult invites from it. \n\nWorst: I co-presented at a national conference with colleagues on a topic we’d presented at several smaller conferences, so we felt comfortable and well prepared. During the ending q&a, an attendee (a former instructor of mine with whom I had a contentious relationship) asked a question, then twisted my response, which seemed to negate our central thesis. The more I tried to defend our position, the deeper I sunk into a pit - mortifying! Thankfully one of co-presenters quickly shut him down so we could move on. Lesson learned: be prepared to cut off attention seeking hecklers with a “that’s outside of the scope of our study” or similar line.",
      "author": "Prestigious_Ad3780",
      "created": 1635517086,
      "upvotes": 1,
      "replies": {}
    }
  }
}