{
  "sid": "adw7sl",
  "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/",
  "title:": "Update: \"A PhD program posted the wrong deadline on their website. They won't consider my application after I missed the true deadline. Do I have options?\"",
  "text": "\\*\\*Update to previous post regarding a program that had posted the wrong PhD application deadline: [https://www.reddit.com/r/AskAcademia/comments/a7d269/a\\_phd\\_program\\_posted\\_the\\_wrong\\_deadline\\_on\\_their/](https://www.reddit.com/r/AskAcademia/comments/a7d269/a_phd_program_posted_the_wrong_deadline_on_their/) \n\n&#x200B;\n\nAfter hearing from you all and talking with a mentor, I ended up sending my application materials to the two faculty members I was applying to work with, explaining my situation, and asking for their help. It appeared to work at first--a professor responded sympathetically and said he would do what he could, as I must not have been the only applicant to miss the deadline. The head of the graduate college (who had been ignoring all emails until this point) then got in touch with me to apologize for being out of the country and that he would make a decision after the holidays. So, I was hopeful someone was working on my behalf behind the scenes.\n\nBut I got the final word a few days ago: the university says they have to treat the true deadline as final, and won't accept my application. To say I'm disappointed is an understatement, especially since this was my top program and applying to others without being considered at my top choice feels a little empty at this point. But I'm tired of fighting it. Hard not to feel completely turned off by academia after all this, too, so also considering applying to other jobs.\n\nAnyway, I wanted to thank everyone for their responses and advice. Here's to new things in the new year...!",
  "author": "aformalfeeling",
  "created": 1546966517,
  "updated": 1634080731,
  "over_18": false,
  "upvotes": 189,
  "upvote_ratio": 0.98,
  "comments": {
    "edklj4n": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edklj4n/",
      "text": "Fucking ridiculous. I'd drop a line to the professor who you've been in contact with: \"Dear Professor XYZ, Thank you for your help with this matter. Unfortunately, ABC of the Graduate College has just informed me that my application will not be considered after all. I was very disappointed to hear this as I was hoping to work with you.\" Let them know that the grad college is fucking up the admissions process to their department.",
      "author": "sighing_sage",
      "created": 1546968101,
      "upvotes": 360,
      "replies": {
        "edkmpcr": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkmpcr/",
          "text": "This is the best advice. There’s no way a good program is happy to lose potential PhD applicants. Many programs make hiring justifications for new TT lines depending in part on the amount of PhD applications (or more accurately, the converse: a program that no one applies to will be under a lot of scrutiny and won’t receive resources, including new lines). The faculty are 100% the people that need to be alerted to this, as it’s their jobs and reputation on the line moreso than anyone’s. ",
          "author": "scd",
          "created": 1546968916,
          "upvotes": 143,
          "replies": {
            "edl4ftj": {
              "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edl4ftj/",
              "text": "Be sure to include the evidence. I know a few of my colleagues and I would rip admissions a new one if this happened, and we can sometimes beat them into submission on things like this.",
              "author": "MuchArmadillo",
              "created": 1546981448,
              "upvotes": 39,
              "replies": {
                "edlznpk": {
                  "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlznpk/",
                  "text": "It seems the false date was set by the department though, so admissions demanding the department adhere to university deadlines (if that’s what this is) really goes back to the department having caused the problem. Although it’s very strange that a program would be that beholden to a deadline set by administration. It’s a weird situation.",
                  "author": "Xpress_interest",
                  "created": 1547005755,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "edkpeng": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkpeng/",
          "text": "This.\n\nProfessors have a lot of pull with such issues. Professors are the ones that drive in grants and students.",
          "author": "anotherbozo",
          "created": 1546970789,
          "upvotes": 44,
          "replies": {
            "edlne1c": {
              "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlne1c/",
              "text": "Good professors are also the ones who know how to gauge exactly how incompetent the admin are being on any particular issue.",
              "author": null,
              "created": 1546995876,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "edktu0f": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edktu0f/",
          "text": "This is so ridiculous it could only happen in Academia. ",
          "author": "TheRoboticsGuy",
          "created": 1546973914,
          "upvotes": 11,
          "replies": {
            "edkwrxm": {
              "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkwrxm/",
              "text": "Eh. I wouldn't say that. Petty arbitrary crap happens in industry just as often, if not more, in my experience..",
              "author": null,
              "created": 1546976050,
              "upvotes": 37,
              "replies": {
                "edkyg8o": {
                  "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkyg8o/",
                  "text": "I know, I worked in industry for 3 years until I came back.\n\n\nIm just frustrated right now with a project.",
                  "author": "TheRoboticsGuy",
                  "created": 1546977250,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "edkkxkw": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkkxkw/",
      "text": "If I were you: name and shame on things like grad cafe. These places deserve to be held accountable for crap behavior like this. The professors in the department are ashamed, I'm sure. That being said, deadlines are almost *always* flexible for outstanding applicants (any place that doesn't do this is just shooting itself in the foot).\n\nOn the other hand: do you really want to  be at a place that would act like this?\n",
      "author": null,
      "created": 1546967670,
      "upvotes": 155,
      "replies": {
        "edkskmw": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkskmw/",
          "text": ">On the other hand: do you really want to  be at a place that would act like this?\n\nThis is a good metric, imho, for approaching things like this. \n\nI remember a similar application of that rule of thumb that I saw when applying to programs. Because of the nature of my field at the time, reading research statements or talking with people directly were essential to figuring out someone's interests (recent publications were useless, and past work was hit-and-miss at best, to gauge current/future work). I came across a department that interested me but had a chronically out-of-date website –– most recent research statements were \\~4 years old, some older, faculty who had since retired were still listed as active, etc. \n\nI emailed a few professors in my sub-field with whom I thought my interests would align, and I emailed a handful of administrative folks with the college and department about the website issues. And then I followed-up. And then followed-up again with the department administrator. \n\nOf the nearly 20 programs I contacted, this was the only place from which I couldn't get a reply. It was also the only place with a website in such a state of disrepair. While I had talked to one or more professors from a dozen other places over the phone, I could find no evidence that anyone was alive at this place. \n\nAt that point, I stepped back and asked \"does this seem like a place that I would want to be a student?\", and then I promptly crossed the program off my list.",
          "author": "2_7182818",
          "created": 1546973010,
          "upvotes": 71,
          "replies": {}
        },
        "edlgxy9": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlgxy9/",
          "text": "Thanks for the advice-- I'm getting lots of suggestions to name and shame the program. However, my field is very small, and should I have any luck getting into other programs (and in my career afterward) I will almost certainly encounter this program's faculty in the future in professional situations. I've been such a (polite) thorn in their sides these last few weeks I'm sure they'd know any post like that came from me, even if I did it anonymously. ",
          "author": "aformalfeeling",
          "created": 1546990593,
          "upvotes": 16,
          "replies": {
            "edlhq6d": {
              "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlhq6d/",
              "text": "for what it's worth, if the faculty are at all respectable, they will be ashamed of their institution for doing this.",
              "author": null,
              "created": 1546991227,
              "upvotes": 17,
              "replies": {}
            }
          }
        },
        "edkn1le": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkn1le/",
          "text": "Seriously. See if the news wants to do a story on it. ",
          "author": "IamRick_Deckard",
          "created": 1546969151,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "edkvamk": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkvamk/",
      "text": "Welcome to academia where a low level admin is having a power trip (I assure you, no dean likely saw your complaint).  Contact your potential PI and let them deal with the stupidity.",
      "author": "k0np",
      "created": 1546974981,
      "upvotes": 31,
      "replies": {
        "edkvwcy": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkvwcy/",
          "text": "The online portion of academic websites are often run by staff, no less. We see tons of dead links and outdated information on our website.   \n\n\nI say email the graduate studies director of both the program and if they have a council or committee, I would email every member there, as well as the program Chair, and the Dean of the School, and I would be very polite and say something short to explain, with the purpose of \"informing them,\" if they did not already know, that it may have impacted other potential applicants adversely. I would also request my application fees back.",
          "author": "the_latest_greatest",
          "created": 1546975415,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "edks8ko": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edks8ko/",
      "text": "> Hard not to feel completely turned off by academia after all this, too, so also considering applying to other jobs.\n\nWord of advice: if this is enough to turn you off of grad school, don't go.  There are many setbacks and frustrations ahead if you do.  I'd only recommend grad school to people who are completely sure it's what they want, who know what it entails, and who know the job prospects afterwards. :)\n\nBut unlike others on this thread, I wouldn't recommend naming and shaming unless you're 100% sure it either would never be linked to you or that you don't want to try again in the future. \n\nSorry you had this experience. :(",
      "author": "aabbccbb",
      "created": 1546972776,
      "upvotes": 71,
      "replies": {
        "edmaweg": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edmaweg/",
          "text": "Probably the only comment I can get behind... I would second this motion; just move on. This comes from a recent PhD graduate who had to move universities because his undergraduate university screwed him over hard.",
          "author": null,
          "created": 1547017962,
          "upvotes": 7,
          "replies": {}
        },
        "ednbz28": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/ednbz28/",
          "text": "indeed. welcome to academia. this is not, unfortunately, atypical. and as you're seeing on this very thread, your interest in fairness, in holding the culpable party accountable is being mightily discouraged. this is par for the course in academia. \n\nyou'll also notice people telling you that you should only go into academia if you're \"sure it's what you want.\" \n\nwhat they generally mean is, \"only go into academia if you are willing to put up with this kind of abuse and unfairness, keep your mouth shut, toe the line, and maintain the status quo.\" \n\nand they are right. academia is very, very conservative. it is very beholden to rules, and very beholden to hierarchies. in a way, it's like the army, but with fifty cent words. \n\nkeep this in mind if you choose to proceed. ",
          "author": "episcopa",
          "created": 1547055409,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "edkl43w": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkl43w/",
      "text": "what dicks.\n\nname and shame. ",
      "author": "EctonMiner",
      "created": 1546967802,
      "upvotes": 58,
      "replies": {
        "edksr75": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edksr75/",
          "text": "Please. It might help spare the rest of us. Talk about a nightmare situation...",
          "author": "volumineer",
          "created": 1546973141,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "edkn8p6": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkn8p6/",
      "text": "It's unbelievable. If they post two different deadlines, they should use the later one after realizing their mistake. I second *name and shame*. ",
      "author": "rpfflgt",
      "created": 1546969286,
      "upvotes": 35,
      "replies": {}
    },
    "edls1kt": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edls1kt/",
      "text": "As a professor I would be really pissed off at this. I don't know what the difference in posted versus true deadlines was, but I know that abut half of our applications are submitted in the two weeks before our deadline. No way we'd want to miss out on half our applicants! \n\nThat said, this wouldn't happen at my program, because we have control.",
      "author": "Wobbleshoom",
      "created": 1546999687,
      "upvotes": 9,
      "replies": {}
    },
    "edl7foz": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edl7foz/",
      "text": "I'm going to say something different than most others: this incident might not say much about the Program. Academia is a nightmare of administrators. I go to a so-called \"Southern Ivy.\" If something like this were to happen in my Department, I could see the mistake being any of the following: The Department (giving wrong info); Web Communications (posting the wrong info); The Graduate School (posting the wrong info); or upper Admin (not setting way to resolve this but having a clear \"no exceptions\" rule). Without more details, it's hard to say who fucked up. And the Program might, legitimately, not be able to do anything about it. I never understood Franz Kafka until I did two things: got a visa in a foreign country and tried to change policies at the university level. Bureaucratic tape is everywhere.\n\nThat said, you might not want to go somewhere where the adminsitrative channels are so convoluted. But I have a feeling you'll run into this kind of stuff almost anywhere you go if they're a PhD-granting institution. Had a friend, for example, lose a fellowship opportunity. He submitted his application at 11:30 PM Central of the deadline date, but it was rejected because the application was being run through a portal on Eastern time, despite the university being in Central.",
      "author": "GWFKegel",
      "created": 1546983572,
      "upvotes": 15,
      "replies": {}
    },
    "edkt531": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkt531/",
      "text": "Get the department chair for the program you were applying for involved as well. This is absolutely unacceptable. ",
      "author": "ferevus",
      "created": 1546973418,
      "upvotes": 5,
      "replies": {
        "edky7fj": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edky7fj/",
          "text": "She's been involved since the beginning! She was the first person I emailed. ",
          "author": "aformalfeeling",
          "created": 1546977072,
          "upvotes": 10,
          "replies": {
            "edkyvcy": {
              "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkyvcy/",
              "text": "make sure to forward her the email that you had with graduate admissions if you haven’t done so already.\n\nBest of luck my friend! ",
              "author": "ferevus",
              "created": 1546977551,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "edkqcba": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkqcba/",
      "text": "Do you really want to go to a program that won’t properly resolve their mistakes? ",
      "author": "aelendel",
      "created": 1546971444,
      "upvotes": 8,
      "replies": {}
    },
    "edkuth7": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkuth7/",
      "text": "That's a big red flag. What country is this in? What kind of university is this? ",
      "author": "Lonelobo",
      "created": 1546974634,
      "upvotes": 3,
      "replies": {
        "edkv548": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkv548/",
          "text": "USA, smallish private research university. It's a program in the humanities ",
          "author": "aformalfeeling",
          "created": 1546974869,
          "upvotes": 7,
          "replies": {
            "edkw5es": {
              "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkw5es/",
              "text": "Can you say which one? ",
              "author": "Antonomon",
              "created": 1546975596,
              "upvotes": 2,
              "replies": {}
            },
            "edn9t03": {
              "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edn9t03/",
              "text": "That makes it even more ridiculous.  \n\nI'm normally against naming programs, but I really think you should. ",
              "author": "psstein",
              "created": 1547053998,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "edky9k0": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edky9k0/",
      "text": ">that he would make a decision after the holidays.\n\nOf course, fixing mistakes by delaying decisions after the holidays. ",
      "author": "tomas0821",
      "created": 1546977116,
      "upvotes": 3,
      "replies": {}
    },
    "edkuyqm": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkuyqm/",
      "text": "This is a horrible situation. You have good grounds to continue fighting this, but you’re in a catch 22 because they may not seriously consider you if you keep complaining to them. I recently applied to PhD programs and it would be heart breaking if I wasn’t considered for my top choice. If it’s any consolation, it’s their loss. Go kick ass at another program.",
      "author": "somecasualbro",
      "created": 1546974740,
      "upvotes": 2,
      "replies": {}
    },
    "edkoc25": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkoc25/",
      "text": "I'm really sorry for you and I'm sure that you will find a better opportunity somewhere else. Also, while this might have been your top program, I think that what happened made you reevaluate the program and you might have been giving them credit and expectations that they don't deserve. Being a graduate student myself, let me assure you that you don't want to join a program with such bureaucracy. Lack of flexibility is one of the big hurdles that could lead you to quit med way. All in all, best of luck with your career/academia journey! ",
      "author": "DontUseYourNameIdiot",
      "created": 1546970042,
      "upvotes": 2,
      "replies": {}
    },
    "edkxe1o": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkxe1o/",
      "text": "For everyone being so harsh and saying to name and shame the department, I can almost guarantee it was some poor secretary who messed up the posting and they feel absolutely awful about it. They can’t extend the deadline, although they probably want to, because then it opens the door for extending it for everyone. A tough situation for sure, but people make mistakes and we should be understanding about those mistakes. ",
      "author": "Tatta_Tatta",
      "created": 1546976492,
      "upvotes": 0,
      "replies": {
        "edkz2xt": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkz2xt/",
          "text": "You don't get it. **Yes, they should extend it for everybody**. I'm sorry about the poor secretary. I'm not saying they should be fired, just that they made a mistake and they have to honor that or their institutional reputation now suffers. It says more that they are reluctant to move it than that they made the mistake in the first place.",
          "author": null,
          "created": 1546977707,
          "upvotes": 26,
          "replies": {
            "edlfl9w": {
              "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlfl9w/",
              "text": "There are bigger issues at play, beyond the departmental level. The department can’t unilaterally decide to change their deadline, even if they fucked up. That’s my main point. ",
              "author": "Tatta_Tatta",
              "created": 1546989522,
              "upvotes": 2,
              "replies": {
                "edlfz29": {
                  "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlfz29/",
                  "text": "You're saying all of this like any of this is okay. No, if that's the case, and the department really can't change it then the university is worthless at it's one job and wow--the faculty must really be pissed to have to deal with that.",
                  "author": null,
                  "created": 1546989820,
                  "upvotes": 3,
                  "replies": {
                    "edloxu3": {
                      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edloxu3/",
                      "text": "You’re very naive. No point discussing this further. ",
                      "author": "Tatta_Tatta",
                      "created": 1546997168,
                      "upvotes": -3,
                      "replies": {
                        "edlp5vg": {
                          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlp5vg/",
                          "text": "I think the fact that I've got a lot of people agreeing with me is probably pissing you off and causing to lash out at me personally, characterizing me as naive. If this happened in my department I'd complain loudly to the deans and let them know that they were actively derailing the university's mission. Any school where arbitrary rules go counter to the mission is basically total shit, and not somewhere worth working as a faculty member..",
                          "author": null,
                          "created": 1546997356,
                          "upvotes": 1,
                          "replies": {
                            "edlpe1r": {
                              "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlpe1r/",
                              "text": "I don’t care about who is agreeing with who. I called you naive because you are clearly naive, especially about the nuances of university governance. I don’t mean it as a personal insult, but just a statement of fact about your lack of demonstrated knowledge. I’m sure you’re knowledgeable in other areas, but not this area. Have a nice day. ",
                              "author": "Tatta_Tatta",
                              "created": 1546997539,
                              "upvotes": 4,
                              "replies": {
                                "edlpjem": {
                                  "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlpjem/",
                                  "text": "I've been on enough crap committees to realize that university governance is complicated, and that's no defense for what is a crap decision.",
                                  "author": null,
                                  "created": 1546997665,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "edlgukq": {
                  "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlgukq/",
                  "text": "Since when can we not extend deadlines? Academia extends deadlines all the time! I get at least one \"CFA/CFP deadline extended!\" email a day.\n\nWhy wouldn't you want to consider those candidates who are serious enough in their application that they are willing to put as much time, energy and emotion into it as OP? It shows he's an excellent candidate!",
                  "author": "link0007",
                  "created": 1546990516,
                  "upvotes": 6,
                  "replies": {
                    "edlier5": {
                      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlier5/",
                      "text": "I'm actually a woman-- but thanks, that's very nice! :) ",
                      "author": "aformalfeeling",
                      "created": 1546991777,
                      "upvotes": 7,
                      "replies": {}
                    },
                    "edlp4ie": {
                      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlp4ie/",
                      "text": "What the hell is “academia”? Paint with broad strokes much? University governance is complicated. We have no idea what went on in this specific case. Assuming it’s simple to change a deadline, even if it was a bad mistake, is very naive. ",
                      "author": "Tatta_Tatta",
                      "created": 1546997325,
                      "upvotes": -1,
                      "replies": {
                        "edlp9fx": {
                          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlp9fx/",
                          "text": "University governance is complicated, but this issue is not. If you lie to applicants about the deadline and then choose to enforce an earlier one then university governance is broken, period. Yes, yes, we've been to faculty meetings too.",
                          "author": null,
                          "created": 1546997435,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "edl1gb9": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edl1gb9/",
      "text": "Hey if that’s how things are in that institution the. Consider it a blessing in disguise. Trust me that is not where you want to be. ",
      "author": "menchcata",
      "created": 1546979391,
      "upvotes": 1,
      "replies": {}
    },
    "edm8son": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edm8son/",
      "text": "It might be possible for you to get into the lab as an intern or lab tech or something in some science fields (there may be analogs for other fields) without being a student of the university.  Since the professors want you on their team, you could ask them if there exists such an avenue for you to work with them; I know a few students that have gotten their foot in the door this way.  The pros/cons are that you have a leg up on your research work (or whatever work you're doing), but of course you wouldn't start classes until later.  And of course if this ends up being the best option, you might have that avenue open.  You haven't burned any bridges or anything, so it seems like this would be a chance to open up your opportunities with no risk.  ",
      "author": "helasraizam",
      "created": 1547015105,
      "upvotes": 1,
      "replies": {
        "edmqdi4": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edmqdi4/",
          "text": "Thanks! This isn't how my field works, unfortunately. The professors have been sympathetic to my situation but haven't said they want me. ",
          "author": "aformalfeeling",
          "created": 1547039936,
          "upvotes": 1,
          "replies": {
            "edn7we9": {
              "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edn7we9/",
              "text": "Any professor that lifts a finger for a student that hasn't been admitted is interested.  It still wouldn't hurt; \"Professor, since the school isn't budging on the deadline, I'll have to reapply next year.  I'm still very interested in your work, let me know if there's anyway I could work with you in an unofficial capacity to make good use of my time while I wait to reapply.\"  This might open up the mentioned possibility, and it also lets the professor know you're very interested in their work, which might encourage them to fight for you some more (especially if they weren't CC'd on the later emails).",
              "author": "helasraizam",
              "created": 1547052674,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ednbowr": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/ednbowr/",
      "text": "This is ridiculous but not out of character for academia, honestly. \n\nAcademia, at its heart, is very conservative, and very fixated on rules. ",
      "author": "episcopa",
      "created": 1547055225,
      "upvotes": 1,
      "replies": {}
    },
    "edlqbcx": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlqbcx/",
      "text": "Typical academia bureaucratic bullcrap.",
      "author": "TakeOffYourMask",
      "created": 1546998298,
      "upvotes": 1,
      "replies": {}
    },
    "edknh6g": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edknh6g/",
      "text": "True it sucks but also it shows it’s best not to wait till the last minute to turn crap in ",
      "author": "itsdatoneguy",
      "created": 1546969451,
      "upvotes": -21,
      "replies": {
        "edkocf9": {
          "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkocf9/",
          "text": "Do you submit grant applications a day early? I wouldn't - I'd spend an extra day making my grant just that little bit better. And I'd be mad as hell if the granting council refused to abide by a deadline that they posted \"by accident\".",
          "author": "drmarcj",
          "created": 1546970049,
          "upvotes": 25,
          "replies": {
            "edkwz0v": {
              "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkwz0v/",
              "text": "I  don't submit a day early, but I also log into the website a few days in advance to scope out weird  stuff that I hadn't noticed.  That being said, it sounds like there was literally no way for OP to have known.",
              "author": null,
              "created": 1546976191,
              "upvotes": 5,
              "replies": {}
            },
            "edkt82m": {
              "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edkt82m/",
              "text": "Nope but I also didn’t wait till the last minute to submit a simple application packet. You can be as upset as you want but it still stands that this is on op. You guys can cry, rant, and rave all you want about some advertised deadline being wrong, but at the end of the day the university has so many more potential applicants that got their documents in on time to chose from. ",
              "author": "itsdatoneguy",
              "created": 1546973477,
              "upvotes": -10,
              "replies": {
                "edmb85i": {
                  "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edmb85i/",
                  "text": "Depends on the situation; OP wasn’t clear. If the difference in dates is only a day or two, I side with you on this. If it’s at least 4-5 days difference, then it’s a big problem on the university’s end.",
                  "author": null,
                  "created": 1547018441,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "edlt80l": {
      "link": "/r/AskAcademia/comments/adw7sl/update_a_phd_program_posted_the_wrong_deadline_on/edlt80l/",
      "text": "Is there a legal case for false advertising?",
      "author": "BeatriceBernardo",
      "created": 1547000576,
      "upvotes": -2,
      "replies": {}
    }
  }
}