{
  "sid": "qt59dd",
  "link": "/r/AskAcademia/comments/qt59dd/prof_reference/",
  "title:": "Prof Reference",
  "text": "I needed a reference (not a reference letter), just a reference who can positively vouch for me, and I want to ask a prof I had last year because I remember really enjoying her class, and I did fairly well. She even inspired me to take more classes this year in that discipline. I reached out to her a few times last year, but because of Covid, she doesn't know what I look like. I would prefer to ask in her person for this reason, but I'm not on campus yet because of Covid and online courses, so I would need to ask her through email. It's not ideal, but I don't really have another professor I would feel comfortable enough asking about because it's the same thing with everyone else except they're all unfriendly, or I never reached out to them. I really require this reference, but given my circumstances would it even be worth it?",
  "author": "flowerfaire",
  "created": 1636822643,
  "updated": 1637180911,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hkh70dn": {
      "link": "/r/AskAcademia/comments/qt59dd/prof_reference/hkh70dn/",
      "text": "If all of your interactions have been virtual, it seems that an email request would be appropriate. Or consider reaching out to her via email and requesting a 5-10 minute zoom meeting (or attend her virtual office hours if she has them) to tell her about your new job/academic opportunity and how you see yourself fitting into it. Then you can ask her if she would be willing to provide a strong, positive recommendation or serve as a reference for you. Note: I know COVID is weird, but it’s a little concerning to me that you perceive this person to be the only one who can serve as a positive reference for you. Moving forward it may help you to build more positive professional relationships with those you work for/with and learn from to gain positive networking opportunities and contacts.",
      "author": "REC_HLTH",
      "created": 1636824166,
      "upvotes": 7,
      "replies": {
        "hkhaoy8": {
          "link": "/r/AskAcademia/comments/qt59dd/prof_reference/hkhaoy8/",
          "text": "Okay, thank you. And, I don't know. I feel like I've done a lot of stuff like I did/am doing some online volunteering, but it's been student-run, so I don't know if they'd be the best option for me. I was told by the people at school that a prof would be better, but I also have a job, so it's not like this prof is the only person I have to go to. Sorry, I should've specified that in the original text.",
          "author": "flowerfaire",
          "created": 1636825714,
          "upvotes": 2,
          "replies": {}
        },
        "hki6f6p": {
          "link": "/r/AskAcademia/comments/qt59dd/prof_reference/hki6f6p/",
          "text": "I have to agree. I have had a really inordinate number of requests for recommendations. I think this is because I am “nice” and approachable.  But I get the same 24 hour day that everyone else gets, so I’ve had to turn people down. They seem to get hurt and even a bit angry.\n \nLook, people. If we are nice, we are nice to hundreds of students. Yes, you and I have a rapport, but it’s my job to do that. I cannot write 100 letters of rec. Please ask others.",
          "author": "DntfrgtTheMotorCity",
          "created": 1636839331,
          "upvotes": 1,
          "replies": {
            "hkiqzy0": {
              "link": "/r/AskAcademia/comments/qt59dd/prof_reference/hkiqzy0/",
              "text": "I'm not asking for a letter of recommendation, that's not what they're looking for. I just need someone to back me up saying that I did all the work I needed to do in previous classes/activities. It's not like a big, crazy, huge, high-end thing. I'm doing something for school, so it's a lot less formal than most jobs. I understand that this is a less than ideal choice, but it was just a question.",
              "author": "flowerfaire",
              "created": 1636848060,
              "upvotes": 1,
              "replies": {
                "hkizwgf": {
                  "link": "/r/AskAcademia/comments/qt59dd/prof_reference/hkizwgf/",
                  "text": "Gotcha.",
                  "author": "DntfrgtTheMotorCity",
                  "created": 1636852059,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "hkhxdlg": {
          "link": "/r/AskAcademia/comments/qt59dd/prof_reference/hkhxdlg/",
          "text": ">Note: I know COVID is weird, but it’s a little concerning to me that you perceive this person to be the only one who can serve as a positive reference for you. \n\nThis is a bigger problem than just COVID, but esp. due to covid I wouldn't harp on this too much.  How can you build those relationships on Zoom when your \"teachers\" may not even know how zoom works?  The \"younger generations\" (at least in the U.S.) have trouble with f2f interactions.  That is because of the scourge of the phones.\n\nI agree, however, with this commenters 1st point.  If your only interaction has been virtual, then a virtual ask is not a bad thing. Esp. if you preface it with a shorter version of \"so, I'd rather do this in person, but due to COVID I know we can't. That said...\" or request the zoom chat if that's something you've done.",
          "author": "winterneuro",
          "created": 1636835400,
          "upvotes": -1,
          "replies": {
            "hkirftg": {
              "link": "/r/AskAcademia/comments/qt59dd/prof_reference/hkirftg/",
              "text": "Thank you so much for this!",
              "author": "flowerfaire",
              "created": 1636848254,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hkjxck5": {
      "link": "/r/AskAcademia/comments/qt59dd/prof_reference/hkjxck5/",
      "text": "Written (email) request preferred. Even if you were on campus.\n\nWith a written request way you can include the relevant details so she doesn't need to remember them. \n\nYou can add a brief meeting request with the reference request so that you can talk about the opportunity and your goals. But no need to save the asking part for face-to-face.",
      "author": "IAmAQuailBiologist",
      "created": 1636867955,
      "upvotes": 1,
      "replies": {}
    },
    "hkkrqxo": {
      "link": "/r/AskAcademia/comments/qt59dd/prof_reference/hkkrqxo/",
      "text": "I’d add that when you write your email request to your prof, you should include your current CV or resume, as well as some pertinent info about whatever position or program you need this reference for. This will help her understand what she’s vouching for and give her a little more context. Even though there does not appear to be a letter required at the moment, I’ve (I’m a prof) definitely experienced being asked for a letter, phone interview, or to fill out a specific questionnaire by the school or program later in the process, and it’s taken both me and the student by surprise. Best to be prepared! Good luck! And don’t feel bad a lot asking for a ref: it’s part of our job! Sometimes we can’t do it or can’t make the deadline, but it’s always ok to ask.",
      "author": "ElizaAuk",
      "created": 1636889346,
      "upvotes": 1,
      "replies": {}
    }
  }
}