{
  "sid": "inl0aa",
  "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/",
  "title:": "Scientists who left academia for the corporate world, did you find your education to be helpful?",
  "text": "Im talking about chemists/biochemists/geneticists and others involved in laboratory related sciences rather than CS/Engineering academics. \n\nIf you've left the academic world, do you believe your experiences in science have benefited you in your new roles?",
  "author": "SoybeanCola1933",
  "created": 1599394382,
  "updated": 1634081153,
  "over_18": false,
  "upvotes": 165,
  "upvote_ratio": 0.98,
  "comments": {
    "g48codn": {
      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g48codn/",
      "text": "I always targeted industrial RnD roles right from the get go when I started my PhD so that’s the perspective my answer is coming from. My experience has been that if you want a job in a hard science (like chemistry, biochemistry, genetics etc. as you say) you basically need a PhD in order to have any meaningful career progression, at least in large companies.\n\nBS and to a lesser extent MS holders do not get promoted into management and have much lower salaries (like 50% of PhD holders). It’s not fair, but that’s what it’s looked like to me from the inside.\n\nYou basically need a PhD to do my job (physical chemistry RnD) but not every job. You can definitely get there and be competent at my and other jobs where the employee has a PhD but it’s a lot easier to start with a PhD since you have a lot of background to understand what you’re doing and more importantly design and analyze your experiments in any meaningful way. Most industrial RnD (in chemistry) is largely streamlined anyway with most cutting edge stuff being acquired or assimilated through industry-academic collaborations (which again a PhD is helpful for).",
      "author": "ColickingSeahorse",
      "created": 1599401242,
      "upvotes": 86,
      "replies": {
        "g48xen8": {
          "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g48xen8/",
          "text": "Private PhD gang represent.\n\nImagine begging for double the work, half the pay, and virtually zero job security. Couldn’t be me.",
          "author": null,
          "created": 1599411736,
          "upvotes": 33,
          "replies": {
            "g491y70": {
              "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g491y70/",
              "text": "Sure...but there are upsides if you make it as an academic - chief among them being total job security, good pay and the freedom to do literally any research you want.\n\nAs an aside, the disparaging tone for people following their dreams, as hard as it might be is a bit obnoxious, no?",
              "author": "ColickingSeahorse",
              "created": 1599413951,
              "upvotes": 23,
              "replies": {
                "g49cspp": {
                  "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49cspp/",
                  "text": "I would say the freedom to do any research you want is limited by what the funding agencies want to fund, so it's not entirely true that there is total freedom.",
                  "author": null,
                  "created": 1599419745,
                  "upvotes": 23,
                  "replies": {
                    "g4a6esc": {
                      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4a6esc/",
                      "text": "True, but there is freedom in the day-to-day work. As long as the results are fundable, how you achieve them is up to you.",
                      "author": "foradil",
                      "created": 1599436930,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                },
                "g492uod": {
                  "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g492uod/",
                  "text": "There are upsides to making it into the NFL from college football, and the odds for becoming a TT professor in some engineering fields are only ~~twice~~ x3 as good so...\n\nhttps://www.nytimes.com/2016/07/14/upshot/so-many-research-scientists-so-few-openings-as-professors.html",
                  "author": null,
                  "created": 1599414391,
                  "upvotes": 11,
                  "replies": {
                    "g497x7f": {
                      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g497x7f/",
                      "text": "Sure, but if everyone was put off by the odds we wouldn’t have professors :)",
                      "author": "ColickingSeahorse",
                      "created": 1599417065,
                      "upvotes": 7,
                      "replies": {
                        "g49lgna": {
                          "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49lgna/",
                          "text": "Right, except its pretty much standard in academia to only prepare for and encourage academic pathways.  When 95% of your workforce will not be going that route, it is a reality that ought to be acknowledged, especially among so called intellectuals.",
                          "author": null,
                          "created": 1599424558,
                          "upvotes": 5,
                          "replies": {
                            "g49okgr": {
                              "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49okgr/",
                              "text": "Yeah I totally agree with this. The one thing academia never prepared me for was how to navigate the job market. I went to an R1 university and there was no career coaching whatsoever for us when we were in school and no acknowledgment about what the odds were about making it as an academic. There wasn’t any coaching for how to make it in industry either which is (was) frustrating.\n\nI basically shotgun blasted applications. Had a bunch of interviews but no idea on how to interview properly until I basically got better by practicing by failing until I landed my current role.",
                              "author": "ColickingSeahorse",
                              "created": 1599426284,
                              "upvotes": 6,
                              "replies": {
                                "g5gxolc": {
                                  "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g5gxolc/",
                                  "text": "To be fair, many people in STEM have the industry option, so they can still work in their fields. I feel like those numbers may be misleading when many of those people may choose industry for the higher salaries and room for growth. The real issue is humanities Ph.Ds who may be forced into adjuncting for the rest of their lives.",
                                  "author": "catfeinee",
                                  "created": 1600263934,
                                  "upvotes": 1,
                                  "replies": {
                                    "g5gydfr": {
                                      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g5gydfr/",
                                      "text": "Yep that's true, although based on my experience in industry thus far, in some STEM fields, you're better off just getting a BS and starting work outright rather than going the circuitous way of getting a PhD first if money is the motivator. \n\nI do more interesting work than people with a BS, but my salary cap and salary potential is much lower.",
                                      "author": "ColickingSeahorse",
                                      "created": 1600264329,
                                      "upvotes": 1,
                                      "replies": {
                                        "g5h0c1p": {
                                          "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g5h0c1p/",
                                          "text": "It depends, for engineering that may be true, but for chemistry, physics, and biology, it’s less common.",
                                          "author": "catfeinee",
                                          "created": 1600265439,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "g49ikbs": {
                          "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49ikbs/",
                          "text": "My professor went to MIT, then Harvard, then Karolinka institute (world's best med school) and now she works in the UKs 65th best university (out of 120) in the absolute middle of nowhere. You have to literally go to Harvard to even just be a professor at a shitty University",
                          "author": "idk7643",
                          "created": 1599422964,
                          "upvotes": 15,
                          "replies": {
                            "g49oq5v": {
                              "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49oq5v/",
                              "text": "That’s not that bad, it’s a mid-tier uni by your own admission.",
                              "author": "ColickingSeahorse",
                              "created": 1599426374,
                              "upvotes": 1,
                              "replies": {
                                "g4bp21c": {
                                  "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4bp21c/",
                                  "text": "Nah, it's in the absolute middle of nowhere. It's a tiny village 3h away from the next real city. I don't think anybody who didn't grow up here would actually want to live here for 5+ years, because you go through everything there is to see within the first 2 months",
                                  "author": "idk7643",
                                  "created": 1599481877,
                                  "upvotes": 1,
                                  "replies": {
                                    "g4bthvl": {
                                      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4bthvl/",
                                      "text": "Yeah but she’s doing intellectual labor so it’s all worth it! /s",
                                      "author": null,
                                      "created": 1599485199,
                                      "upvotes": 2,
                                      "replies": {}
                                    },
                                    "g4dsg57": {
                                      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4dsg57/",
                                      "text": "Few places in the UK are 3 hrs from a major city. Where is she located, the Outer Hebrides?",
                                      "author": "dapt",
                                      "created": 1599515961,
                                      "upvotes": 1,
                                      "replies": {
                                        "g4dtlzw": {
                                          "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4dtlzw/",
                                          "text": "Northern Wales. 3h away from Manchester. In between are just more tiny pretty useless villages",
                                          "author": "idk7643",
                                          "created": 1599516649,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "g49q5u3": {
                          "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49q5u3/",
                          "text": "We'd probably have better ones",
                          "author": "radionul",
                          "created": 1599427189,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "g49a7da": {
                          "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49a7da/",
                          "text": "No, we will have some chinese or Indians profs.",
                          "author": "nieburhlung",
                          "created": 1599418314,
                          "upvotes": -3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g49ps5f": {
                  "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49ps5f/",
                  "text": "The only way to make it as an academic is to sell your soul to corporate publishers and play departmental politics. Freedom it ain't.\n\nI didn't see any \"disparaging tone\" in the post you replied to.",
                  "author": "radionul",
                  "created": 1599426971,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "g49suk7": {
              "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49suk7/",
              "text": "I’m currently applying to PhD programs in MechE with the goal of working in industry. Can I PM you with questions?",
              "author": "jRawr13",
              "created": 1599428728,
              "upvotes": 1,
              "replies": {
                "g4btbi7": {
                  "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4btbi7/",
                  "text": "Sure",
                  "author": null,
                  "created": 1599485107,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g49ip92": {
          "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49ip92/",
          "text": "Do you know anything about the pharmaceutical industry? I often read in job descriptions that a masters is also OK if you just have a few more years experience",
          "author": "idk7643",
          "created": 1599423040,
          "upvotes": 3,
          "replies": {
            "g49o1jc": {
              "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49o1jc/",
              "text": "I work in biotechnology (agrochemical which are typically spin-offs from pharma business). It’s a tough job market out there and because there are so many PhDs you’ll be competing against (because academia is pumping out so many of them these days), you’ll either have to set yourself apart from them somehow or have some connections within the company to get hired.",
              "author": "ColickingSeahorse",
              "created": 1599425986,
              "upvotes": 7,
              "replies": {
                "g49on2o": {
                  "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49on2o/",
                  "text": "Interesting. I fear that if I do a PhD straight after my masters, I'll be simultaneously over qualified and under qualified due to lack of work experience. My plan was to try to find an entry job after my masters, but if I can't find a job, do a PhD. \n\nIf that area is a hard job market, do you have any suggestions for what isn't? Any areas that these companies struggle to find the right people for?",
                  "author": "idk7643",
                  "created": 1599426324,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g48cc6g": {
      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g48cc6g/",
      "text": "Of course. During grad school I developed technical skills (data analysis, programming) but also the ability to learn new things independently (some of the new machine learning techniques I use today I first learned about during literature reviews).\n\nWhile I don't use them as much as I might have in academia, my writing and presentation skills are also generally better than my colleagues with less academic training.\n\nThings like working on a deadline, etc. are also useful skills I developed both in my upper undergraduate and graduate studies.",
      "author": "jorgethetalkinggoat",
      "created": 1599401038,
      "upvotes": 43,
      "replies": {}
    },
    "g48m4pf": {
      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g48m4pf/",
      "text": "I left a PhD program in STEM early because a dream job in digital media and outside science fell into my lap.\n\nA lot of the organizational skills have served me well. Also being trained in STEM means anticipating potential pitfalls and having solutions to them before you start, which is an invaluable skill in ALL kinds of jobs. there have been lots more specific skills that I haven’t seen mentioned yet too:\n- Adobe Photoshop and Illustrator I still use pretty often and got good at with images in grad school\n- Data analysis is always a plus (to the point that I got my bosses to pay for some stats programs for me) because we do a lot of “customer surveys”\n- speaking of surveys, knowing how to ask questions in an effective and non-biased manner is important and something I learned in STEM\n- Database building and coding- I have worked with some data that we use and reference regularly so I put it into an extremely basic database. I regret not taking more classes in Python because I probably could do more with that\n- Also, this is a bit more wild, knowledge and comfort of handling dry ice safely. We wanted to get some footage of something small and have smoke/fog in the shot so we used dry ice and water. My bosses probably could have done it without me, but also 100% would have used more ice than they needed and burned their hands on it multiple times because laypeople are silly sometimes",
      "author": "daughteroftheamazon",
      "created": 1599406357,
      "upvotes": 19,
      "replies": {}
    },
    "g491rho": {
      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g491rho/",
      "text": "Im a scientist on the business development/ internal marketing/ R&D team for a device company and I work with clients to ensure their assays work.\n\nI literally could not have my job without a PhD and my previous experience in drug development.",
      "author": "airwalker12",
      "created": 1599413854,
      "upvotes": 10,
      "replies": {
        "g49j9jb": {
          "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g49j9jb/",
          "text": "I'm an biomed undergraduate looking to do a masters in drug development soon. Any advice for how to get into that field, or which skills employers look for the most?\n\nI read many senior position job descriptions for this field to get a feeling for it, and saw that almost always they say that just a masters is also OK, if you just have a few more years of work experience (e.g. \"PhD or masters with 6 instead of 3 years of work experience\"). Is that generally true?",
          "author": "idk7643",
          "created": 1599423345,
          "upvotes": 1,
          "replies": {
            "g4akzf0": {
              "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4akzf0/",
              "text": "If you are in the US you won't ever be a lead scientist or C-suite level with only a MS. Yes you can get entry and second level jobs but then you start competing with people with PhDs and full postdocs. Sure some people with MS make it very far, but if I'm the hiring manager the PhD wins every time for a research role",
              "author": "airwalker12",
              "created": 1599445905,
              "upvotes": 1,
              "replies": {
                "g4botwk": {
                  "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4botwk/",
                  "text": "I'm in Europe. But if I get a PhD without any work experience, won't I be over qualified for entry level jobs because I won't know anything?",
                  "author": "idk7643",
                  "created": 1599481690,
                  "upvotes": 0,
                  "replies": {
                    "g4bozc4": {
                      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4bozc4/",
                      "text": "It doesn't really work that way.\n\nI don't have a ton of experience with the EU hierarchy, but there are rarely people without PhDs making meaningful decisions in the companies I work with over there.",
                      "author": "airwalker12",
                      "created": 1599481816,
                      "upvotes": 1,
                      "replies": {
                        "g4bpatr": {
                          "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4bpatr/",
                          "text": "So a PhD is the minimum requirement for entry level jobs?\n\nThe problem is that in Europe there's laws that someone with a PhD automatically needs to be paid more than someone with a masters. So I asked around and a lot of people regretted their PhD outside of academia because it meant that nobody wanted to hire them for entry level stuff, because there's tons of master students who are equally qualified for the job who can be paid less",
                          "author": "idk7643",
                          "created": 1599482081,
                          "upvotes": 1,
                          "replies": {
                            "g4bpgy5": {
                              "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4bpgy5/",
                              "text": "What do you want to do? \"Entry level\" is completely relative and completely non descriptive.\n\nIf you want to run assays, and be in the lab all day then yes a MS is fine, but if you want to design research programs, be a team lead etc you will need a PhD. Additionally if you want to transition into a technical sales or marketing role a MS may work, but a PhD will always be preferred. There are some things you (should) learn during a PhD that you may not be able to during your career.\n\nI generally discourage people from getting a PhD unless they are SURE they want to do research- which it sounds like you do. There really are no shortcuts to a research career, in my opinion you need the degree. Sure that is a bit of dogmatism from stodgy academics and some people with only a BS can be terrific directors. However, the majority of people leading in drug devo are either PhDs or MBA types",
                              "author": "airwalker12",
                              "created": 1599482219,
                              "upvotes": 1,
                              "replies": {}
                            },
                            "g4bpro6": {
                              "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4bpro6/",
                              "text": "There is also no such law or regulation (outside of an academic institution) that you have to be paid more with a PhD",
                              "author": "airwalker12",
                              "created": 1599482463,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g4cf3mc": {
      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4cf3mc/",
      "text": "I guess it'll depend on your exact job. A lot of my Neuroscience friends went for jobs like quality assurance or project management and while they did not pick up the formal qualifications for such a job (at least in Germany companies usually ask for some kind of certification from a qualifications board or industry job experience) those are skills they started to develop when they had to work on their own projects.  \nAnother friend became a medical writer and while she never had to write documentations for new drugs, writing scientific papers helped her immensely to get started.  \nSince we work with brain data from monkeys, two former lab members of my current lab became data scientists after their PhD. They formally aren't computer scientists but handling TBs of monkey brain recordings helped them to get into that occupation.\n\nAdditionally you can find other skills that every employer likes to see, such as the ability to pick up new skills quickly, a general interest in learning new things, collaborative skills and more.",
      "author": "LittlePrimate",
      "created": 1599494684,
      "upvotes": 3,
      "replies": {}
    },
    "g4af6wg": {
      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4af6wg/",
      "text": "Anyone done any RSD(Research Software Development) work ?",
      "author": "Zophike1",
      "created": 1599442342,
      "upvotes": 1,
      "replies": {}
    },
    "g4a22a6": {
      "link": "/r/AskAcademia/comments/inl0aa/scientists_who_left_academia_for_the_corporate/g4a22a6/",
      "text": "Ouch.",
      "author": "wordoper",
      "created": 1599434138,
      "upvotes": 0,
      "replies": {}
    }
  }
}