{
  "sid": "i4oiuc",
  "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/",
  "title:": "Is it normal to accomplish effectively nothing in a summer internship?",
  "text": "I did a research project (physics) over the summer in high school and then continued on the same one after my first year in college and effectively was able to get no results despite working quite hard. In all fairness, no way I could’ve expected to get anything back then.\n\nI’m doing a different project this summer with a different professor after just finishing my bachelors and it doesn’t seem like I am going to get anything this time either. How often does this happen? \n\nSide ?: Will all this time spent help my PhD app at all if I didn’t accomplish anything?",
  "author": null,
  "created": 1596705554,
  "updated": 1634080676,
  "over_18": false,
  "upvotes": 206,
  "upvote_ratio": 0.99,
  "comments": {
    "g0jtfo0": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0jtfo0/",
      "text": "Absolutely!!!!! I had several internships during which I accomplished fuck all scientifically. The overall experience is what matters.",
      "author": "Aubenabee",
      "created": 1596715361,
      "upvotes": 175,
      "replies": {}
    },
    "g0jpdsj": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0jpdsj/",
      "text": "I say in experiment intensive fields it is quite common. Typically internships last only a few months (2-3 mostly) and since most you are relatively new therefore you need to learn a few new methodologies, get acquainted with the experimental tools etc. which could take a couple of weeks. Also, most internship projects aim to figure out something new so even the investigators are not sure if the results would be positive. You will have to be extremely lucky in order to get something useful out of any such project in 3 months. In my experience most such projects are dedicated towards finding if or not a certain method works or a certain technique is promising as such so the findings, even if not as expected, would help the group adjust the direction of their research efforts. Also, most such projects would be a part of the principal investigator's post doc or PhD's work. So rather, just focus on acquiring skills. Learn to operate that new instrument, analyse data and build network with the people in general. Learn about the place, what other kind of facilities exist there and try to build connections for future collab, perhaps a thesis or maybe even PhD if it is promising and you like it.",
      "author": "__jaykay__",
      "created": 1596712593,
      "upvotes": 67,
      "replies": {}
    },
    "g0jvopb": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0jvopb/",
      "text": "Some internships can be more about gaining experience and getting a feel for how research is done. If you want to accomplish anything meaningful then sign up for undergraduate research credit and join the lab and put in 10+ hours a week. Research can be hard and you can may only scratch the surface with short internships.",
      "author": "biodataguy",
      "created": 1596716535,
      "upvotes": 26,
      "replies": {}
    },
    "g0k0uo2": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0k0uo2/",
      "text": "During 2/3 internships in undergrad, the PI was not invested in what I did, offered next to zero mentorship and left me to my devices with a grad student that was constantly on vacation and the lab coordinator.  In the end, I learned to code, started side projects to prep my PhD project, acquainted myself with new methods, etc. I found the internship itself unpleasant, unrewarding and overall an inefficient use of my time. They probably thought I was not intelligent/focused/driven/passionate enough about the field to succeed, too, so we were not setup for success. \n\nScientifically, I accomplished exactly nothing of significance over two summers. I got my name on a poster and in the acknowledgments on a paper, so there's that. I never worked with these groups again and it showed me that their brand of experimental science was not something I could ever do for a living. \n\nThe fact that I GOT these competitive internships is what mattered for my PhD application and subsequent scholarships, by demonstrating that I can proactively get funding for research and use this time on taxpayer's money to develop new skills.",
      "author": "generalalcazar1337",
      "created": 1596719082,
      "upvotes": 16,
      "replies": {
        "g0kr8j6": {
          "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0kr8j6/",
          "text": "Same here. One of my PIs was out of town for most of my internship (not necessarily her choice, she had family issues to attend to) and my main PI had so many teaching responsibilities that I was basically the only person ever working on the project...thankfully I should get my manuscript out this year, but he hasn’t been very helpful in terms of feedback and support.",
          "author": "weathermac",
          "created": 1596730571,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g0k7cou": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0k7cou/",
      "text": "At first I was disappointed with my undergraduate internship experiences, mostly because I didn't get results for the figure panel in a paper I was promised. This is super normal. PIs tend to dangle the excitement of publishable results in front of undergrads - but this case is **extremely** rare. My internship was even funded by the government, and we still came up short of that goal. \n\n  \nWhat we gain from these internships is experimental technique, independence and scientific thinking, which is **so invaluable** for those PhD apps. It will show both on your CV and in your interviews. \n\n  \nMy shitty-no-results-internships landed me a competitive MSc position, and both the top federal *and* top provincial grants to accompany it. It will help assloads. Keep fighting that imposter syndrome OP!!",
      "author": "blovaird",
      "created": 1596722026,
      "upvotes": 8,
      "replies": {}
    },
    "g0l4wqh": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0l4wqh/",
      "text": "The common saying is a PhD is about 6 months orf work spread out over 6 years.  As someone who is finishing up his PhD, that is entirely true.  There have been whole months where I did Jack-all scientifically.  Don't feel bad.",
      "author": "Arminius2436",
      "created": 1596736653,
      "upvotes": 6,
      "replies": {}
    },
    "g0k5l3n": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0k5l3n/",
      "text": "Oh yeah. I would say it’s more over less common. As such summer projects (at least good ones) are usually designed to give you skills and maybe develop something the lab/group can use after you’re gone. \n\nYou don’t know going into research what will be fruitful at first glance and that’s not personal at all. But with such a short time line it’s tough to pivot when an avenue isn’t any good. \n\nFinally I will point out most letters that are good can detail what a student did in terms of “they learned this code and wrote a script in it” or something. If you did accomplish some things like that this summer I’d say it’s been fruitful.",
      "author": "Andromeda321",
      "created": 1596721280,
      "upvotes": 4,
      "replies": {}
    },
    "g0k8r0v": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0k8r0v/",
      "text": "I had a pretty similar experience - I did chemistry research in undergrad (summer + academic year in one lab, one summer internship and a ~2 year post-bacc in another). Most of my work was one leg of a 12-15 person project in the lab, so it was effectively 'rinse and repeat' so the other group members, mostly postdocs, could keep moving forward with their chunks. A lot of this depends on who you're working for/with, what needs to be done on the project, and your skillset. For summer internships, there's not much time to get training and build up enough trust to accomplish much more than that, but it is a great opportunity to prove that you're willing to work hard, make some connections in the field, and learn some valuable techniques that might be useful to you later. \n\nIn terms of PhD applications, the best thing you can use summer internships for is building relationships with people in the industry to write strong letters of rec. I felt like I hadn't accomplished anything in my research (0 publications), but I still managed to get into a top 10 program in my field that I start in a month! Just try to make the experience meaningful for you, whether or not you have meaningful scientific data. Best of luck with your future applications!",
      "author": "ceg247",
      "created": 1596722634,
      "upvotes": 3,
      "replies": {
        "g0ks7cf": {
          "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0ks7cf/",
          "text": "I totally agree regarding summer internships! 10 weeks seems like a decent amount of time, but during my last internship my lab decided it was too much work to fill out all the paperwork for me to work with live mice, so I had to wait on my postdoc to prep the conditions necessary for my project and sack them before I could really get started. Thankfully it worked out that I had other things to do to keep me busy (finals were postponed at my school and I ended up taking them remotely).",
          "author": "weathermac",
          "created": 1596730986,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g0kg2hy": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0kg2hy/",
      "text": "You can be a good scientist and struggle to get results, especially with the time limitations of a summer internship. That's a major reason why PhD admissions committees usually care more about your letters of recommendations than just a publication count. \n\nTwo of my internships during high school & undergrad had no useful results and my undergrad thesis, while it technically had results, was kind of pathetic compared to some other summer internships. I think these experiences were still helpful to me in that (1) I still learned enough to guide and develop my research interests, and (2) I still could get strong rec letters, since my PIs saw the way I worked.",
      "author": "aggressive-teaspoon",
      "created": 1596725781,
      "upvotes": 3,
      "replies": {}
    },
    "g0l4070": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0l4070/",
      "text": "Did 2 academic internships (not STEM, though). One resulted in some excellent changes, and the other in nothing. It was incredibly repetitive and I didn't enjoy it that much, but the transcription and admin I did helped the staff out a lot.",
      "author": "edminzodo",
      "created": 1596736272,
      "upvotes": 3,
      "replies": {}
    },
    "g0kvcmh": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0kvcmh/",
      "text": "I've spent one summer internship at least where the project I spent the entire time designing and producing and spending the labs money on didn't even work for the experiment and they had to toss it.\n\nMy other summer internships were spent doing something for the entire 3 months that would likely take my mentors 2 hours to do and had varying but low levels of use to the research in general. So based on only my experience, this is pretty common.",
      "author": "peregrin5",
      "created": 1596732374,
      "upvotes": 2,
      "replies": {}
    },
    "g0lzq1g": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0lzq1g/",
      "text": "A summer is usually enough time to figure out what doesn’t work...",
      "author": "felicitousfrog",
      "created": 1596750517,
      "upvotes": 2,
      "replies": {}
    },
    "g0mebf3": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0mebf3/",
      "text": "This is both my personal experience and I've had about 10 undergrads/high school students rotate through my lab and the only one who really seriously got results spent two continuous years in the lab (40 hours/week in the summer, 20 hours/week during the year...or at least that's what I paid her. I think secretly she was there more)",
      "author": "pteradactylitis",
      "created": 1596758420,
      "upvotes": 2,
      "replies": {}
    },
    "g0kzlba": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0kzlba/",
      "text": "Absolutely. I got nothing done during my summer internship in undergrad. Going in my mentor and I were hoping to get a paper out of it, so that was really disappointing and I felt pretty down about it at first. But the experience I gained from it was still super valuable - computing skills, experience with research in general, getting familiar with the concepts and terminology for the specific research topic, etc. \n\nFor applications/your resume you should just make sure to spin it as positively as possible and focus on what you gained over what you didn’t do. That’s pretty much what I did and I think that internship is actually the reason I got into my grad program! The work was very similar to what my advisor does and having that experience showed I was interested in that topic and had the skills to do further research on it.",
      "author": "radiansplusc",
      "created": 1596734321,
      "upvotes": 1,
      "replies": {}
    },
    "g0loc1z": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0loc1z/",
      "text": "honestly depends on sooo many factors but i honestly think the overwhelming minority of internships ends up with, say, a coauthorship. but if you continue your relationship with the lab/pi/postdoc/grad student past the internship more stuff may happen. it just feels like you have to put so much time in to get anything out",
      "author": "f33dmewifi",
      "created": 1596745070,
      "upvotes": 1,
      "replies": {}
    },
    "g0m3msa": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0m3msa/",
      "text": "I was a pretty successful PhD student (experimental physics), published several papers as first author, some of which were cited hundreds of times.\n\nI did not publish a paper or have my name on a paper as an undergrad.\n\nI did two summer internships at national labs, one was SULI, the other was similar, and both were very valuable.  I got to learn what research was like, I got to work at huge facilities, and I did help out a bit.\n\nOne was a theory/simulation internship.  In the very beginning of the internship they outlined what they thought my project should be, so I sat down and wrote out the equations, and proved that it would actually be impossible to accomplish experimentally (the energy requirement blew up to infinity).  Oops.  So then they were like, OK, why don't you try this other thing and just see if you can help us with our main project.  So I did that.  I wrote some simulations and played with the results, saw a couple of cool things.  I told the grad student I was working with that I saw an interesting trend, and he exclaimed, \"That must mean there's a conservation law!\"  So he sat down and proved it.  It didn't go into a paper but he put it into his thesis, and I was just happy to be helpful at that point.  It was just the two of them working on it and they were happy to have me.\n\nMy other internship was experimental.  I worked on some impressive machines and tried to test some stuff.  I never really got it working but I showed that one setup was better than another.  So at least that was useful.  It was also my first time doing any sort of experimental work (I didn't have a garage or shop class at school growing up), so that gave me a taste of it.  We also spent a few hours chatting with the lead researcher while he was running his own experiment, and that was actually just as valuable as doing it myself I think.\n\nOverall I was really happy with both experiences and got into a lot of good graduate schools.  I asked both professors to write recommendations for my PhDs, so I think that probably helped.  I don't know what the competition is like these days.  I do genetics work now and the biologists all seem to have papers as undergrads, but I think that's pretty field specific.  It seems a bit implausible.\n\nGood luck!",
      "author": "dampew",
      "created": 1596752566,
      "upvotes": 1,
      "replies": {}
    },
    "g0m8x6c": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0m8x6c/",
      "text": "Yep. Very normal.",
      "author": null,
      "created": 1596755313,
      "upvotes": 1,
      "replies": {}
    },
    "g0m8za7": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0m8za7/",
      "text": "Yes. That’s normal. \nBut, it doesn’t mean you can’t capitalize on it.\nBe sure to try to present a poster about it if you can, since there is no obligation to have finished results at most conferences that are open to undergrads. \n\nAlso, it’s not wasted at all if you can get a reference letter from your mentor",
      "author": "UnexpectedClock",
      "created": 1596755347,
      "upvotes": 1,
      "replies": {}
    },
    "g0kr8fe": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0kr8fe/",
      "text": "During COVID? - yes \n\nDuring normal times? - yes",
      "author": "the_mullet_fondler",
      "created": 1596730569,
      "upvotes": 1,
      "replies": {}
    },
    "g0kymz0": {
      "link": "/r/AskAcademia/comments/i4oiuc/is_it_normal_to_accomplish_effectively_nothing_in/g0kymz0/",
      "text": "Yep",
      "author": "ModeHopper",
      "created": 1596733887,
      "upvotes": 0,
      "replies": {}
    }
  }
}