{
  "sid": "p7xiu1",
  "link": "/r/AskAcademia/comments/p7xiu1/credibility_of_dutch_masters_in_the_us/",
  "title:": "Credibility of Dutch masters in the US",
  "text": "Hi everybody,\n\nThere are similar topics, but older.In a few years, I plan to move to the US to work and live. I have an American wife and by then kids, so that'll be no issue.\n\nBy the time we will move I have 2-4 years of industry experience at master level and 5 years at lower education level.\n\nI have a 4-year bachelor in Industrial Engineering and Management and currently finishing two master degrees. One Master of Science in Technology & Operations Management and one in Supply Chain Management.\n\nI am not worried, but rather curious about how US companies would perceive this. Is it often asked to let it be evaluated by a certain company or does no company care about that?\n\nI study at the University of Groningen. The university rankings are:\n\nARWU University rankings #64Times Higher Education #80QS World University Ranking #122\n\nDoes anyone have an idea?",
  "author": "ikwilstufi",
  "created": 1629445477,
  "updated": 1634079552,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "h9mxzi2": {
      "link": "/r/AskAcademia/comments/p7xiu1/credibility_of_dutch_masters_in_the_us/h9mxzi2/",
      "text": "The university of Groningen corresponds to what in the US would be an R1 university, but you can bet most Americans in industry are clueless about that. I think you will have a tough time getting hired for a job at your education level without first getting relevant industry experience in the Netherlands.",
      "author": "Hapankaali",
      "created": 1629445862,
      "upvotes": 6,
      "replies": {
        "h9my2yq": {
          "link": "/r/AskAcademia/comments/p7xiu1/credibility_of_dutch_masters_in_the_us/h9my2yq/",
          "text": "Thank you for responding. I will definitely go there with experience. By then I will have worked for 2-4 years at master level. Also, I have lower education working experience of 5 years.\n\n&#x200B;\n\nedit: I edited my post and added it.",
          "author": "ikwilstufi",
          "created": 1629445946,
          "upvotes": 2,
          "replies": {
            "h9n0z2p": {
              "link": "/r/AskAcademia/comments/p7xiu1/credibility_of_dutch_masters_in_the_us/h9n0z2p/",
              "text": "I think it depends on the company. Microsoft, Google, AstraZeneca, Sigma, they're all going to get it. They're big international companies with a diverse workforce and a relatively worldly leadership. Antibodies-R-Us, Missouri not so much. I'm a US citizen who grew up overseas, and my fellow country folk have many wonderful attritibutes but unfortunately they can be very insular.",
              "author": "ACatGod",
              "created": 1629448418,
              "upvotes": 3,
              "replies": {
                "h9n98za": {
                  "link": "/r/AskAcademia/comments/p7xiu1/credibility_of_dutch_masters_in_the_us/h9n98za/",
                  "text": "Alright, thanks for your reply.\n\nWorking at FAANG would be an option later in my career. Not a goal right now.  \nWe will definitely move to the east coast, around the Princeton area. I am aiming to work for larger companies, probably you're right about them not being so anal about it. They understand and might even appreciate it.\n\nMy goal is one of the bigger multinationals and I might even have a transition from Abbvie, Abbot or whatever from here (NL) to there (US).",
                  "author": "ikwilstufi",
                  "created": 1629455610,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h9nbt2e": {
      "link": "/r/AskAcademia/comments/p7xiu1/credibility_of_dutch_masters_in_the_us/h9nbt2e/",
      "text": "[removed]",
      "author": null,
      "created": 1629457501,
      "upvotes": 4,
      "replies": {
        "h9nrljv": {
          "link": "/r/AskAcademia/comments/p7xiu1/credibility_of_dutch_masters_in_the_us/h9nrljv/",
          "text": "Haha. Second world. Have you ever been in the Netherlands?",
          "author": "ikwilstufi",
          "created": 1629466337,
          "upvotes": 3,
          "replies": {
            "h9pn1id": {
              "link": "/r/AskAcademia/comments/p7xiu1/credibility_of_dutch_masters_in_the_us/h9pn1id/",
              "text": "It's not about me, it is how the people in industry sector I worked (and working) with value universities outside USA. \n\nIt's not uncommon to see, e.g. ETH masters got turned down and some random US university candidates got hired, because \"ETH might be a good university, but I do not know it well, so I go for US-made candidates.\"",
              "author": "COFenirr",
              "created": 1629494035,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "h9oc4cc": {
          "link": "/r/AskAcademia/comments/p7xiu1/credibility_of_dutch_masters_in_the_us/h9oc4cc/",
          "text": "Lol second world?",
          "author": "Maliawka",
          "created": 1629474889,
          "upvotes": 3,
          "replies": {
            "h9pnkhn": {
              "link": "/r/AskAcademia/comments/p7xiu1/credibility_of_dutch_masters_in_the_us/h9pnkhn/",
              "text": "Edited, added quotation mark. It's just what hiring manager said, for ETH...I bet U of Gron won't get better response in this case.",
              "author": "COFenirr",
              "created": 1629494264,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h9o5gsb": {
      "link": "/r/AskAcademia/comments/p7xiu1/credibility_of_dutch_masters_in_the_us/h9o5gsb/",
      "text": "You're probably fine, but there is one big caveat; you may not have an ABET-accredited undergraduate degree, which in the US is rather significant for some engineering fields. You essentially cannot get PE licensure without an accredited degree. Industrial engineering is a field where PE's are generally liked, but they may not be that essential. That may mean you can't advance that high in engineering per-se, but even if you couldn't you'd still be perfectly suited in the various roles immediately adjacent to industrial engineering that wouldn't require a PE.\n\nFurther, companies know what they're getting when they bring on ABET-trained engineers, so if your school isn't ABET then it'll require their HR people to do a little digging to establish if it's good enough or not. If they don't feel like doing that digging, they may just bin your resume.\n\nHowever, if your undergrad is ABET accredited; you're fine.",
      "author": "r3dl3g",
      "created": 1629472208,
      "upvotes": 2,
      "replies": {}
    }
  }
}