{
  "sid": "on1og8",
  "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/",
  "title:": "Q about personal websites",
  "text": "Hi everyone,\n\nI've created a personal website for myself, just out of curiosity. I used Hugo, Netlify, and Git + Blogdown. \n\nI was wondering what kind of things do people like to see in a personal website? So far, I have added links to published+working papers and conference presentations, plus some essays and press coverage. \n\nShould there be other things that I *should* include? How formal/informal is okay? \n\nTo reiterate, it's made out of curiosity. I'm really not sure how I'd be leveraging it at all (tips appreciated), but I'm assuming that other academics + maybe others interested in my work may check it out.",
  "author": "golddustwoman211",
  "created": 1626649692,
  "updated": 1634082510,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "h5p28rt": {
      "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/h5p28rt/",
      "text": "Freelance researcher here ...key elements are bio, photo and then a page with more details about all the interesting stuff you do or have written.  I guess you could have a news / blog page but honestly it's a lot of work to keep on top of. If you are a particularly good speaker videos of your presentations can be good to. \n\nYour website is a secondary source that people go to after they are interested in you to find out more. Usually you drive them there from social media.",
      "author": "zukerblerg",
      "created": 1626654142,
      "upvotes": 6,
      "replies": {
        "h5q8dc7": {
          "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/h5q8dc7/",
          "text": "Okay awesome- I think I've covered most of that!\nI've also added links to where people might find more about a particular project/presentation etc. in case they're interested \n\n🤞🏽",
          "author": "golddustwoman211",
          "created": 1626680103,
          "upvotes": 2,
          "replies": {
            "h5s863v": {
              "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/h5s863v/",
              "text": "Oh I forgot the important thing ! Contact details !",
              "author": "zukerblerg",
              "created": 1626720519,
              "upvotes": 3,
              "replies": {
                "h5wwf8q": {
                  "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/h5wwf8q/",
                  "text": "yes, that's done, thanks!",
                  "author": "golddustwoman211",
                  "created": 1626810458,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h5p8878": {
      "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/h5p8878/",
      "text": "If you are a PhD candidate entering the job market, being more formal is better. If you are a tenured professor, you can have a blog, photos of your pets, a link to your novel written as a hobby, etc. It is your freedom to do whatever you want, but if I was personally advising my PhD student, I would recommend this to reduce the chances of rubbing the people the wrong way on the job market (there are many \"old-fashioned\" academics in the field higher up in the Department hierarchy).\n\nWhat you have done sounds great (e.g., published and working papers, conference presentations, etc.). Make sure to also add a dated CV on the website, so search committees can routinely check your website for updates.",
      "author": "Matricized",
      "created": 1626657103,
      "upvotes": 5,
      "replies": {
        "h5q8lnd": {
          "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/h5q8lnd/",
          "text": "Thanks so much! I'm actually pre-doctoral, but working in a rather productive lab. Have kept the informal stuff to a minimum (just a sentence at the end of the bio) and when introducing the essays I've written for newspapers etc. so that the website doesn't read like a glorified CV.\n\nHope that's ok 🤞🏽",
          "author": "golddustwoman211",
          "created": 1626680312,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h5qoxw3": {
      "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/h5qoxw3/",
      "text": "This is just my opinion, but when I am going through a prof's website I'm always interested to see a few things apart from the ones I expect (CV, publications, research interests, teaching material). Often, at least for students, papers are largely inaccessible and don't provide a glimpse at how the professor thinks. I try to see if there's maybe an article that's about something general/out of their academic area, or their favourite music/films/interests. Just something that helps me learn a little bit about them or about how they think. \n\n&#x200B;\n\nBut as I said this is just my preference and it's certainly not required off of a personal webpage. As someone else mentioned, it might be frowned upon to have a slightly informal website as a young researcher/academic.",
      "author": "Quaternion253",
      "created": 1626694264,
      "upvotes": 3,
      "replies": {
        "h5s329m": {
          "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/h5s329m/",
          "text": "that makes sense - I'll put up whatever I'm allowed to and ask people to email me for copies of other things.\n\nI've added a short sentence on non-academic interests (so it's not a lot but it is something). More can be inferred from the essays I've written. Don't think I should add more given my career stage :(",
          "author": "golddustwoman211",
          "created": 1626718333,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h5r4sft": {
      "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/h5r4sft/",
      "text": "Numbers/names of students supervised and links to their real world social media (if possible) so that it's verifiable that they exist. There's credit to be had in having supervised.",
      "author": "sbw2012",
      "created": 1626703424,
      "upvotes": 3,
      "replies": {
        "h5s3h2b": {
          "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/h5s3h2b/",
          "text": "I don't supervise students, but have supervised undergrads who work in my lab + others. Most are currently working with me so I'm not sure such a section makes sense (given my career stage which is pre-doctoral). What do you think?",
          "author": "golddustwoman211",
          "created": 1626718510,
          "upvotes": 2,
          "replies": {
            "h5s88wy": {
              "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/h5s88wy/",
              "text": "Include them (undergrads are students). You are trying to describe your experience.  Think of a website as an extended and structured CV.",
              "author": "sbw2012",
              "created": 1626720552,
              "upvotes": 3,
              "replies": {
                "h5wwioh": {
                  "link": "/r/AskAcademia/comments/on1og8/q_about_personal_websites/h5wwioh/",
                  "text": "okay that makes sense! thank you!",
                  "author": "golddustwoman211",
                  "created": 1626810497,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}