{
  "sid": "kcbe13",
  "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/",
  "title:": "How do I come up with a research topic for my PhD?",
  "text": "I want to start a PhD but I am having trouble with coming up with a research proposal. I have a vague idea about what I want my research to be about but I can't come up with a concrete research topic. All suggestions are welcome!",
  "author": "abnl1497",
  "created": 1607869298,
  "updated": 1634081284,
  "over_18": false,
  "upvotes": 144,
  "upvote_ratio": 0.94,
  "comments": {
    "gfp66p7": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfp66p7/",
      "text": "Try to catch up on the recent literature on that topic. You'll quickly recognize gaps in the knowledge, sometimes they're even pointed out directly by the authors 'xyz is currently understudied', 'this is not yet well understood', 'more research is needed on this'",
      "author": "DeepSeaDarkness",
      "created": 1607869697,
      "upvotes": 80,
      "replies": {}
    },
    "gfpokqe": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfpokqe/",
      "text": "Hello there!\n\nResearch is a matter of momentum (or inertia if you will), topics will come to you by themselves while you keep reading literature. You can't find a topic by sitting on a desk and asking yourself what to write. If you ask your mentor, you'll probably end up with a topic you aren't really curious about (and believe me, curiosity is very important for a PHD thesis!).\n\nThink about a general topic in your area, even an abstract one. Start to read without a real purpose, just read what you want to read. If something catches your attention, go deeper. Rinse and repeat. Keep doing this and you'll have *more than one* topic in no time and these will not be just any topics, these will be the ones that keep you interested!\n\nEdit: Thanks for the hug! :)",
      "author": "Sicsoline",
      "created": 1607878055,
      "upvotes": 168,
      "replies": {
        "gfqpjyw": {
          "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfqpjyw/",
          "text": "Dammit reddit! Stop giving me homework I want to do over Christmas!",
          "author": "InfuriatingComma",
          "created": 1607893354,
          "upvotes": 33,
          "replies": {}
        },
        "gfrp686": {
          "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfrp686/",
          "text": "Thank you for this advice!",
          "author": "smutst",
          "created": 1607911648,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gfq0aog": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfq0aog/",
      "text": "You have to read. Reading is everything. From \"I have a vague idea..\" you should read everything you possibly can related to the vague idea. This exposes the missing links and fills in the gaps in your understanding. After 100 papers or a dozen monographs the idea will no longer be vague, and you'll have a concrete proposal.",
      "author": "herbertwillyworth",
      "created": 1607883557,
      "upvotes": 49,
      "replies": {
        "gfqm3mp": {
          "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfqm3mp/",
          "text": ">You have to read. Reading is everything. From \"I hae a vague idea..\" you should read everything you possibly can related to the vague idea. This exposes the missing links and fills in the gaps in your understanding. After 100 papers or a dozen monographs the idea will no longer be vague, and you'll have a concrete proposal.\n\nAgree - It helps to look at systematic reviews (SLRs) on a research question and they usually identify gaps in the literature really well. My PhD proposal is based on gaps I identified in an SLR that I conducted.",
          "author": "adisturbedsoul",
          "created": 1607891696,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "gfp632j": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfp632j/",
      "text": "Talk to your peers and mentor about it a lot! You don’t need a perfect idea when you start (or even when you finish) just a good one. And then work to make it better and better as you go.",
      "author": "MinisterOfSillyGait",
      "created": 1607869656,
      "upvotes": 22,
      "replies": {}
    },
    "gfqhcpj": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfqhcpj/",
      "text": "Are you about to apply to a program, or are you already in a program?\n\n  \nIf you are applying to PhD programs in the U.S., you don't need a clear dissertation topic in your statement of purpose. You only need a general idea of an area or direction that's grounded in familiarity with the field and theories--like looking at queer studies in Victorian literature, especially considering author's X, Y, and Z seem to traffic in lots of queer language and behavior as can be seen in this book and this book. This would mean you know a bit about queer theory and Victorian studies. \n\nIf you are in the U.K. then you need a specific project. If you're not at that point yet maybe an M.A. would be better for you now.",
      "author": "gggggggggggfff",
      "created": 1607889418,
      "upvotes": 17,
      "replies": {}
    },
    "gfq4uyj": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfq4uyj/",
      "text": "In the same boat, friend. The process I have followed is:  \n1) Identify field and sub-field (and maybe sub-sub-field) of interest.  \n2) Identify giants in said field.  \n3) Read their stuff and see what they are saying would be good places to research.  \n4) Choose directions and create several different questions and ideas to pursue.  \n5) Develop logical next step in this area.  \n6) From that step, considering your resources, what is an aspect that you could take on?",
      "author": "kitten_twinkletoes",
      "created": 1607885461,
      "upvotes": 14,
      "replies": {}
    },
    "gfq4xzk": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfq4xzk/",
      "text": "There are many great opinions, but I will tell you what I did. I am from a social science background, and my research is around the social institution of marriage and family, and the role of women in those. I did my M.Phil on a topic of my interest, on a fairly new topic that was not explored well in my country. Had some great insights and started reading more on that. \n\nFor my Ph.D. (which was postponed due to Covid) whatever vague idea I had, I just kept writing it down. Then did a review of literature on those broad areas. Started finding papers around that and then Professors who were working on similar lines in their countries. (Approached one of the professors who agreed to supervise me in the UK meanwhile). Read about their work and it kept getting clear what I wanted to do, something which has potential, interests me and I can work enthusiastically on it for a few years. Most importantly that you can have easy access to participants for your research too. \n\nAlso, don't hurry. It took me seven months from the first vague idea to my final research proposal. You will get there. All the best.",
      "author": "cuttothechasealready",
      "created": 1607885489,
      "upvotes": 11,
      "replies": {}
    },
    "gfpe6sy": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfpe6sy/",
      "text": "Find the boundaries of your current field of interest.\n\nFind what lies beyond those boundaries.\n\nPick one of those topics.\n\nCurrent (2020) *good* long reviews are very helpful.  Find one from a giant in your field and dig into a nice 10-90 page review.  They’ll point out what’s missing or elude to it.",
      "author": "anthony1988",
      "created": 1607873419,
      "upvotes": 18,
      "replies": {
        "gfq0mih": {
          "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfq0mih/",
          "text": "My field is shit at doing these big reviews. :(",
          "author": "passwordistako",
          "created": 1607883720,
          "upvotes": 4,
          "replies": {
            "gfq1d0n": {
              "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfq1d0n/",
              "text": "Then do the legwork yourself.\n\nDig up the biggest papers in your field in 2020/2019, read them, see where they come from, see what’s missing in the field.  Read the introductions for what is there and what is missing.",
              "author": "anthony1988",
              "created": 1607884074,
              "upvotes": 7,
              "replies": {
                "gfrstge": {
                  "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfrstge/",
                  "text": "And perhaps write the review you wish to see in the world :-)",
                  "author": "WildlifePhysics",
                  "created": 1607913631,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gfpb93i": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfpb93i/",
      "text": "I always found review current dissertations a great way to understand what research exist out there and were the gaps are.",
      "author": "DijonDeLaPorte",
      "created": 1607871894,
      "upvotes": 5,
      "replies": {}
    },
    "gfqkz0x": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfqkz0x/",
      "text": "If you're just applying, the trick is to not imagine that you need to have it all that perfectly figured out. What they are going to look for is not a sign that you know exactly what you want to do — if you knew that, why would you need to be a grad student? What they want is potential, and to be able to determine where to slot you. Who would you be working with? What time period? What kind of approach? That's more important to them than a specific research topic (that they will expect you to change later) or whether you have identified a gap in the field or whatever. \n\nI would try to figure out: what do you really like researching? _Why_ do you like it? Dive deep into these kinds of things, because that's where you're going to find a research proposal. They are not looking for evidence that you know exactly what you will be doing. They are looking for evidence that you are intellectually mature and promising.\n\nMany of the answers here are good for people who are _already in grad school_ but that is a different sort of thing than people who are _looking to get into it_.",
      "author": "restricteddata",
      "created": 1607891166,
      "upvotes": 2,
      "replies": {}
    },
    "gfqiyq7": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfqiyq7/",
      "text": "Can you turn your research interest into a puzzle question? Rather than finding a gap in the literature (just because there's a lacuna doesn't logically mean it needs to be filled), I recommend you find an apparently contradiction or paradox in the field of your interest--this will strengthen the raison d'etre of your paper as well as make your readers invested in what you have to say. A couple of political scientists wrote the [most useful article](https://link.springer.com/article/10.1057/s41304-017-0130-y#Sec6) I've come across about how to make a puzzle question, but I think their points are valid across many disciplines: \n\n> We propose that the following formula succinctly captures what research puzzles look like: ‘Why x despite y?’, or ‘How did x become possible despite y?’ A puzzle thus formulated is admittedly a research question, but one requiring much closer familiarity with the state of the art than a ‘why x-question’. The researcher considers the phenomenon x puzzling since it happens despite y – that is, previous knowledge that would seem contradicted by its occurrence. Hence, puzzlement arises when things do not fit together as anticipated, challenging existing knowledge.",
      "author": "Rlyeh_Dispatcher",
      "created": 1607890178,
      "upvotes": 1,
      "replies": {}
    },
    "gfrooeg": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfrooeg/",
      "text": "In my experience (when I was in the humanities), and in the experience of people I've known in philosophy, they often stumbled on a research topic because they believed many people in the literature were wrong in a way that annoyed them, and they tried to articulate why they thought that.\n\nThat can work in other disciplines, although maybe not as well, but you don't specify beyond humanities so I hope this observation is fruitful!",
      "author": "willbell",
      "created": 1607911374,
      "upvotes": 1,
      "replies": {}
    },
    "gfs06i3": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfs06i3/",
      "text": "Take the vague idea you have and do a search in Google Scholar for papers related to that. Find 3ish articles that are interesting to you and pay attention to the limitations the authors give and think of ways you could build on the research. From there you can cultivate a more narrow focus to point you towards your dissertation topic.",
      "author": "socialistjones",
      "created": 1607917706,
      "upvotes": 1,
      "replies": {}
    },
    "gfpmkeh": {
      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfpmkeh/",
      "text": "Are you really asking reddit for a thesis topic?",
      "author": "Donald_J_Putin",
      "created": 1607877235,
      "upvotes": -7,
      "replies": {
        "gfq0qtg": {
          "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfq0qtg/",
          "text": "Gotta start somewhere. \n\nIt’s not asking for the topic. It’s asking how to go about the search for a topic. \n\nLike, “I’ve never written an academic essay, where can I find structure guides” isn’t the same as “please write my essay”.",
          "author": "passwordistako",
          "created": 1607883778,
          "upvotes": 12,
          "replies": {
            "gfqpvjz": {
              "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfqpvjz/",
              "text": "Honestly, that’s why you are in a PhD program. You are learning how to conduct research. The resources here are not going to replace that.",
              "author": "Donald_J_Putin",
              "created": 1607893513,
              "upvotes": 0,
              "replies": {
                "gfqxxys": {
                  "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfqxxys/",
                  "text": "Sounded to me like OP isn’t in a PhD program.",
                  "author": "passwordistako",
                  "created": 1607897416,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "gfq020x": {
          "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfq020x/",
          "text": "Haha I came here to say this.. not to be a jerk or anything but giving no info about field/subject and just generally saying “give me ideas” is so ridiculous. I would feel bad about even asking this of my lab members. Not to mention this is pretty much decided by your PI in a PhD program and your choice will be in which lab to join. OP if you really want to try to come up with your own idea, look into which labs you might want to join and their recent work. Then you can try to expand on what they are doing, but it is usually better to accept direct guidance from people in your field with expertise.",
          "author": "ellaAir",
          "created": 1607883439,
          "upvotes": 1,
          "replies": {
            "gfqmt8v": {
              "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfqmt8v/",
              "text": "I think you misunderstood the question. OP is not looking for a topic but instead looking for a way to find a topic.",
              "author": "StormSheep77",
              "created": 1607892041,
              "upvotes": 6,
              "replies": {
                "gfqq1u4": {
                  "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfqq1u4/",
                  "text": "Which is what a PHD program is for. It’s not simply about conducting the research on the topic. RAs and lab assistants do a lot of that. It’s about finding a topic and how to structure that search and decide on a topic. Pretty much what a PhD is training you for.",
                  "author": "Donald_J_Putin",
                  "created": 1607893598,
                  "upvotes": -1,
                  "replies": {
                    "gfr2osa": {
                      "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfr2osa/",
                      "text": "OP is asking for tips on how to do that. You still misunderstand.",
                      "author": "StormSheep77",
                      "created": 1607899758,
                      "upvotes": 3,
                      "replies": {
                        "gfr327w": {
                          "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfr327w/",
                          "text": "I understand that. And the answer is that is what they will teach you in a PhD program. Explaining how the initial phase of beginning research such as finding a topic is so varied by discipline and not a simple “read and find stuff you like, that it can’t be provided in any useful or practical way in a reddit post.",
                          "author": "Donald_J_Putin",
                          "created": 1607899943,
                          "upvotes": -2,
                          "replies": {
                            "gfrf1xa": {
                              "link": "/r/AskAcademia/comments/kcbe13/how_do_i_come_up_with_a_research_topic_for_my_phd/gfrf1xa/",
                              "text": "There have been plenty of useful answers from people who understand OP's question in this thread. It was a good question and there were some great answers. \n\nI don't think you understand the question still but it's chill; you don't have to.",
                              "author": "StormSheep77",
                              "created": 1607906081,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}