{
  "sid": "dfesw3",
  "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/",
  "title:": "I'm a master's student and my advisor just put me as a PhD candidate in a project",
  "text": "Hi!\n\nI'm a computer engineer, working on a government funded project in a lab and also doing my master's at the same time. However, my advisor just put me on the project as a PhD candidate. When I asked him why, he told me that everything stays the same, it's just for funding. \n\nNow, what do you guys think about it? It sounded strange to me, honestly. Do you think I'd have any implications?\n\nThanks!",
  "author": "jacarebs",
  "created": 1570614725,
  "updated": 1634081789,
  "over_18": false,
  "upvotes": 116,
  "upvote_ratio": 0.94,
  "comments": {
    "f32m8ta": {
      "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32m8ta/",
      "text": "He’s attempting to scam the government for extra funding. Nothing for you to worry about, but it is very dickheaded of them.",
      "author": "FJLyons",
      "created": 1570617560,
      "upvotes": 190,
      "replies": {
        "f32qicg": {
          "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32qicg/",
          "text": "oh... damn. I mean.. damn. Highly unethical...",
          "author": "jacarebs",
          "created": 1570622664,
          "upvotes": 64,
          "replies": {
            "f32yp4h": {
              "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32yp4h/",
              "text": "This grant will be funded in the future, possibly not for many months - Do you intend to do a PhD? Did he write it in a way that suggests it would provide support for you as a PhD student if you were to continue? It is a bit of scam if you clearly won't continue and he knows that, but if you *might* then it is a standard approach to secure support for an MS student to transition to PhD.",
              "author": "Jon3141592653589",
              "created": 1570628672,
              "upvotes": 69,
              "replies": {
                "f32yxej": {
                  "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32yxej/",
                  "text": "Yeah, you have a good point. I actually came here because I wanted a PhD at first, but I didn't want to run the credits equivalence (I'm not from Europe) and I started a master before the PhD, but I'm completely certain on a PhD.",
                  "author": "jacarebs",
                  "created": 1570628787,
                  "upvotes": 49,
                  "replies": {
                    "f32zise": {
                      "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32zise/",
                      "text": "Ah, then this sounds totally normal! Grants are generally stronger when they can name the student who will do the PhD work; so, yes, it increases the chances of funding. But, if you're already there and will likely do a PhD, it is certainly most appropriate to list you as the one who will be that student. It also is a vote of confidence from your advisor that they trust your work/future well enough to name you in their proposal as the student who will participate.",
                      "author": "Jon3141592653589",
                      "created": 1570629088,
                      "upvotes": 91,
                      "replies": {
                        "f32ztiz": {
                          "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32ztiz/",
                          "text": "It definitely is, actually. Thanks a lot, man. I didn't see it that way at first and was really confused: I mean, at first I though I was starting some sort of PhD or securing a spot for it. I believe that since he is listing me as a PhD candidate, I might as well have some security that he is liking my job and wants to continue working with me, so that's really good, right?",
                          "author": "jacarebs",
                          "created": 1570629239,
                          "upvotes": 44,
                          "replies": {
                            "f330dft": {
                              "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f330dft/",
                              "text": "Yup, most likely he's trusting/assuming/hoping that you'll stick around after the MS. He probably reassured you that \"everything stays the same\" as a way to say \"no pressure, no presumption\" for you to continue (since he could support another student instead if you really, truly wanted to leave after MS). So, congrats on your advisor's intention to find funding for your PhD!",
                              "author": "Jon3141592653589",
                              "created": 1570629518,
                              "upvotes": 36,
                              "replies": {
                                "f33h4ns": {
                                  "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f33h4ns/",
                                  "text": "Thanks a lot!! Hehehe, that is pretty exciting!!",
                                  "author": "jacarebs",
                                  "created": 1570638491,
                                  "upvotes": 11,
                                  "replies": {}
                                },
                                "f34heyp": {
                                  "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f34heyp/",
                                  "text": "Good on you before Reddit crucifies someone for a good faith attempt.",
                                  "author": "TheGreatRao",
                                  "created": 1570654337,
                                  "upvotes": 6,
                                  "replies": {}
                                }
                              }
                            },
                            "f33g0pd": {
                              "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f33g0pd/",
                              "text": "Yes it's definitely a positive. It typically also means that, since you're named in the grant, you don't have to go through the usual application process. This should make it a lot easier for you to switch to a PhD programme.",
                              "author": "bu_J",
                              "created": 1570637928,
                              "upvotes": 15,
                              "replies": {
                                "f33h5tk": {
                                  "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f33h5tk/",
                                  "text": "Great!! Thanks a lot :D",
                                  "author": "jacarebs",
                                  "created": 1570638508,
                                  "upvotes": 5,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "f32thii": {
              "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32thii/",
              "text": "It may be the only way for you to keep getting paid as long as you need to finish that master's.",
              "author": "AstraGlacialia",
              "created": 1570625473,
              "upvotes": 27,
              "replies": {
                "f32tk4j": {
                  "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32tk4j/",
                  "text": "Yeah, totally. I mean, it's not like I can straight out reject the position I'm in, but it is something to be learned and not done in the future.",
                  "author": "jacarebs",
                  "created": 1570625538,
                  "upvotes": 12,
                  "replies": {
                    "f33mcu2": {
                      "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f33mcu2/",
                      "text": "Actually, as I see others here explained to you better in the meantime, it is usually the right thing to do.",
                      "author": "AstraGlacialia",
                      "created": 1570641101,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "f32zto5": {
          "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32zto5/",
          "text": "Not necessarily the government. Advisor may be trying to have more bodies as PhD students on his roster for real estate purposes (keep lab space). It could also be to help the student get funding — masters students have fewer opportunities and priority than PhD students. Never know!",
          "author": "ethanfinni",
          "created": 1570629241,
          "upvotes": 8,
          "replies": {
            "f33h8fg": {
              "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f33h8fg/",
              "text": "Yeah, I believe he's trying to secure a spot for a potential phd I might do :DD.",
              "author": "jacarebs",
              "created": 1570638550,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "f33djry": {
      "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f33djry/",
      "text": "Are you in a program that expects you to continue from masters to PhD? \n\nFor instance, I was in a lab at UIUC.  They don’t allow you to enter the PhD program directly. Instead, you have to apply to the master’s program and then once you graduate they automatically transfer you to the PhD program. When applying for fellowships, I was told to put PhD student, because it’s the technical equivalent to a program where you get a masters along the way.",
      "author": "pencan",
      "created": 1570636585,
      "upvotes": 14,
      "replies": {
        "f33hbkr": {
          "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f33hbkr/",
          "text": "Hummmm, got it. Yeah, that's probably the case, actually. I believe he's securing funding for my PhD.",
          "author": "jacarebs",
          "created": 1570638598,
          "upvotes": 15,
          "replies": {
            "f33m086": {
              "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f33m086/",
              "text": "Initially it sounded like you were suggesting he put you down as a PhD candidate while knowing you were gone, say, next semester before the project even starts. That's unethical. But it's pretty standard if you are a current graduate student looking for PhD funding to be put down as a PhD candidate.",
              "author": "RieszRepresent",
              "created": 1570640944,
              "upvotes": 12,
              "replies": {}
            }
          }
        }
      }
    },
    "f32p384": {
      "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32p384/",
      "text": "As long as you didn't sign anything (where it clearly says that you are a phd candidate), you should be fine.",
      "author": "shitstorm-kurwa",
      "created": 1570621148,
      "upvotes": 16,
      "replies": {
        "f32qh9z": {
          "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32qh9z/",
          "text": "well, I gave some details to him. Am I liable for something?",
          "author": "jacarebs",
          "created": 1570622633,
          "upvotes": 8,
          "replies": {
            "f32ygte": {
              "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32ygte/",
              "text": "I think you’re good. It sounds like if something goes wrong, your professor will be the one in trouble but honestly it’s very unlikely that anything will happen at all. Calm your nerves and accept the money!",
              "author": "NearbyConcept",
              "created": 1570628557,
              "upvotes": 11,
              "replies": {
                "f32z5h5": {
                  "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f32z5h5/",
                  "text": "Alright, it seems like so, hehe. I mean, I understand him in the sense that funding for research is rarely an abundant resource, so you do what you gotta do to keep researching. I was just taken by surprise because I actually saw it in his computer on a meeting we had and I pointed it out and asked what was that.",
                  "author": "jacarebs",
                  "created": 1570628901,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f33jjh9": {
      "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f33jjh9/",
      "text": "It's difficult to sort out the details and OP probably doesn't know all of them. But, it's impossible to write a proposal, have it awarded many months later, and then get the money and have everything play out the way you anticipated. So there always is some wiggle room to adjust how the money awarded is used to reach the goals of the proposal. Additionally, in my experience, program officers have no problem with student money being moved between different types of students. If the PI tried to move money from student pay to faculty pay, however, that would raise eye brows and likely not be allowed. \n\nOP should ask questions, but from what they've said I don't see anything that makes be suspicious yet.",
      "author": "Jurassic_Eric",
      "created": 1570639742,
      "upvotes": 3,
      "replies": {}
    },
    "f34yuui": {
      "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f34yuui/",
      "text": "on a proposal?   That could very well take a year to get funded, then last 3 years after that.  He is probably just planning ahead.   If it is a proposal then your name is just a name holder.  People often just put \"grad student\" on a proposal.   Depending on who is funding, students are an important aspect (like NSF for instance).",
      "author": "NiceSasquatch",
      "created": 1570664126,
      "upvotes": 1,
      "replies": {}
    },
    "f33st8j": {
      "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f33st8j/",
      "text": "Just means when you graduate they should write \"PhD\" and not \"MSc\"",
      "author": "Corgisauron",
      "created": 1570644466,
      "upvotes": 1,
      "replies": {}
    },
    "f337l04": {
      "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f337l04/",
      "text": "[deleted]",
      "author": null,
      "created": 1570633288,
      "upvotes": -4,
      "replies": {
        "f33euj0": {
          "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f33euj0/",
          "text": "If it's for a proposal, he could be saying if this grant is funded it will be for this student who will then be a phd candidate. Which is OP's plan. In that case, I see nothing wrong with it.",
          "author": "Average650",
          "created": 1570637295,
          "upvotes": 11,
          "replies": {
            "f34z1ib": {
              "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f34z1ib/",
              "text": "exactly.   It is a lot of time from writing a proposal to finishing the project.   One often just puts down \"grad student\" in the proposal budget.   If OP doesn't follow that PhD path, another student will.",
              "author": "NiceSasquatch",
              "created": 1570664261,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "f33g1er": {
          "link": "/r/AskAcademia/comments/dfesw3/im_a_masters_student_and_my_advisor_just_put_me/f33g1er/",
          "text": "It *depends*. There's nothing in this post that actually suggests anything is outright wrong, instead it seems likely the student is slightly misunderstanding the nature of the grant.\n\nFrom other comments, it seems like this student is *planning on* getting a Ph.D. and their advisor is submitting a grant that would fund that plan. **That's entirely normal**. \n\nNow, if the advisor is listing them as a *current Ph.D. candidate* in order to *qualify* for the grant, then that is wrong; but, there's nothing said here that suggests that is the case (yet).",
          "author": "WrestlingStuffGuy",
          "created": 1570637938,
          "upvotes": 9,
          "replies": {}
        }
      }
    }
  }
}