{
  "sid": "j3uhzl",
  "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/",
  "title:": "What would you think and do if a student [30/F] confessed to a criminal history?",
  "text": "Hi everyone,\n\nI am a current postgraduate psychology student, and I am training to become a psychologist. I am looking for the perspectives of academics.\n\nI have a complex medical history, and I take multiple medications to manage my health. The university are aware of this. In 2015, the police caught me at the airport in Australia headed for the UK with opioids. I had a prescription, but it wasn't on me. They charged me with unlawful possession of a controlled substance. I went to court with a lawyer, and the charge was withdrawn.\n\nWhen I applied to become a provisional psychologist, my application was significantly delayed because I had to declare my medical history, incase it was considered an 'impairment'. They were not, however, concerned by my criminal history once they understood the circumstances. I am now a registered provisional psychologist.\n\nI also applied for a Working With Children Check in October last year. They wrote to me and asked me to explain the charges. They said I had no proof that I had a prescription, so they were going to reject my application, but my lawyer and I decided to hire a forensic psychiatrist. He wrote to them, and said I am no risk to children, and I sometimes take opioids to manage severe pain, but I am not addicted to opioids. We sent the report in July, and have not heard from them since.\n\nThe university have forgotten about the WWCC, and have organised a placement as a provisional psychologist. I contacted my lawyer, and she said it is illegal for me to commence the placement. WWCC are not answerable to anyone, and are unwilling to provide a timeline.\n\nI think I need to tell the university, but I am nervous. I am worried they will think I am addicted to opioids. I am worried they will think I am lying about my criminal history - because, really, how are opioids related to working with children? I am also worried they will think the reason my registration took so long to process was because of my history. Ultimately, I am worried I will lose my place in the course.\n\nWhat are your thoughts? What should I do?\n\nMany thanks in advance.",
  "author": "Working_Relation477",
  "created": 1601645481,
  "updated": 1634080776,
  "over_18": false,
  "upvotes": 182,
  "upvote_ratio": 0.97,
  "comments": {
    "g7efyll": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7efyll/",
      "text": "This situation sounds infuriating. It sounds like you are doing everything exactly correctly (and at personal expense) and still getting punished for it. I'm sorry for that.\n\nI think that you do absolutely have to disclose this to the university, even if there is some risk involved. On the other hand, if I were a supervising professor in this scenario, I would be enthusiastic about providing resources to the student. So, you could look at this as an opportunity to gain additional support.",
      "author": null,
      "created": 1601646094,
      "upvotes": 189,
      "replies": {}
    },
    "g7eiu8v": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7eiu8v/",
      "text": "There are a few things to consider.\n\nFirst, you don't have to disclose to the University the reason the WWDC is delayed; with COVID and everything else at the moment it is a natural to assume that there is a snafu somewhere. \n\nHowever, having a medical condition and having to take medication for it is common enough. You don't have to disclose the condition or the medication. \n\nThe problem is that if you don't disclose people's imagination can be worse than the reality. \n\nThey are likely to have dealt with this before. But if you are unsure - try going to the University counselling service first, the student guild, or someone you trust in a similar position at another university in a similar program and find out the norms for your discipline in this situation.",
      "author": "ourldyofnoassumption",
      "created": 1601647755,
      "upvotes": 73,
      "replies": {
        "g7ep4iy": {
          "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7ep4iy/",
          "text": "I think the COVID idea is a great one.\n\nAnd also the \"it sounds a lot worse in imagination\"... As everyone who clicked on this thread will agree.",
          "author": "pressed",
          "created": 1601651142,
          "upvotes": 31,
          "replies": {}
        }
      }
    },
    "g7ekl7i": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7ekl7i/",
      "text": "You are caught in a really unfortunate bureaucratic mess, but you need to listen to your lawyer.  Don’t make things worse by knowingly doing something wrong now.  The thing is, you do not have a criminal history.  You had some charges that were withdrawn once the truth was known.  If you explained things as you did here, I wouldn’t have any problem with that.",
      "author": "bigrottentuna",
      "created": 1601648727,
      "upvotes": 56,
      "replies": {}
    },
    "g7f83pf": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7f83pf/",
      "text": "I could be waaay off here... and so please, don't take my word for it. \n\nBut my understanding of \"criminal history\" is that it is all about *convictions.* \n\nAnyone can be charged with anything, for any number of erroneous reasons.  Nowhere have I ever seen anyone ask \"have you ever been charged/accused of a crime?\"  It is always, do you have a *criminal* history, i.e. have you ever been convicted of a crime.\n\nThat said, FULL disclosure (to everyone, with lots of detail) is always the best option, because that just avoids trouble.  \n\nIf it were me (and I am not a psychologist nor versed in law or psychology) I would tell your advisor/relevant people about the WWCC... BUT, you can frame it appropriately, i.e. \"this stupid, idiotic bureacratically-incompetant organization has not yet signed off, for a ridiculous reason.  <explain>   Is there any way that you can help me to pressure them to get their shit together and act like the professionally-competent organization they are supposed to be?\" \n\nagain, just an opinion.",
      "author": "DerProfessor",
      "created": 1601660448,
      "upvotes": 22,
      "replies": {
        "g7f9zyc": {
          "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7f9zyc/",
          "text": "I was confused by this too. If yp8 were never charged, I'm confused as to how it was flagged on your WWCC? In my area, it wouldn't even be listed and this wouldn't be a concern.\n\nNot trying to diminish your experiences, OP. This is definitely stressful but I think you have a lot of ways to fight it or would at least have luck with another agency, perhaps?",
          "author": "frankie_prince164",
          "created": 1601661415,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "g7fn8lb": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7fn8lb/",
      "text": "If you decide to tell the university, don’t just email the admin person in charge of this. Start by taking to your course coordinator, supervisor, professors, fellow students. One at a time. Build some support and then have someone high ranking approach the admin people.\n\nI think most academics would be overwhelmingly on your side.\n\nAlso - I know your not, but I wouldn’t actually give a fuck if someone was on opioids if they were doing good work.",
      "author": "rainbowWar",
      "created": 1601667079,
      "upvotes": 11,
      "replies": {}
    },
    "g7eqrgf": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7eqrgf/",
      "text": "Actually one of my favourite ever students was on day release from jail. He was absolutely driven, and he spent all his free time locked up with nothing to do but read. He was incredibly secretive about it at the start but eased up as time went on. \nNot really the same situation- he had committed a serious crime, but people make mistakes.",
      "author": "imaginesomethinwitty",
      "created": 1601651991,
      "upvotes": 21,
      "replies": {}
    },
    "g7gie9t": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7gie9t/",
      "text": "sounds like they’re discriminating against you for your disability.",
      "author": "f33dmewifi",
      "created": 1601678673,
      "upvotes": 7,
      "replies": {}
    },
    "g7gzm5s": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7gzm5s/",
      "text": "> In 2015, the police caught me at the airport in Australia headed for the UK with opioids. I had a prescription, but it wasn't on me. They charged me with unlawful possession of a controlled substance. I went to court with a lawyer, and **the charge was withdrawn.**\n\n> They were not, however, concerned by my criminal history once they understood the circumstances\n\nWhat criminal history? Is this how the law works in Australia? If a charge is formally withdrawn then how can it be on your record or indicate criminality in any way? Sorry for the lack of help, just that is some fucking bs legal crap right there. You have my sympathies.",
      "author": null,
      "created": 1601689177,
      "upvotes": 6,
      "replies": {}
    },
    "g7fb9fj": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7fb9fj/",
      "text": "Can you use the findings of the forensic psychiatrist to support what you tell the university?  I think, if you still feel you need to tell them, that you should be completely transparent and tell the entire story at once and provide all of the documentation.",
      "author": "TourmalineTart",
      "created": 1601662060,
      "upvotes": 3,
      "replies": {}
    },
    "g7fi157": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7fi157/",
      "text": "I have a MS in biology and an MAT in secondary science. Academics are a pretty liberal bunch from my experience. I would just tell your story. In the U.S. it is illegal to discriminate based on medical history. Sounds like you live elsewhere though.  Your placement may be delayed since it sounds like there is a valid legal reason (cruddy background check board) to delay it. Maybe there is a work around? Perhaps a private school would be willing to allow your placement given your note from a forensic psychologist? You won't know unless you ask.",
      "author": "anemone_rue",
      "created": 1601665100,
      "upvotes": 2,
      "replies": {}
    },
    "g7gtqge": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7gtqge/",
      "text": "I would talk with your director of training and/or your major professor (these are US terms, either who is the head professor of the program or the professor that you directly report to).  Explain the situation exactly as you described it, there were charges for not having your prescription on you and then they were dropped. You can tell them that this gets flagged in background checks but you have a lawyer that has been helping you.  Most importantly, that your lawyer advises you not to start any placement until everything is resolved.  \n\nAt least speaking for the clinical psychology faculty I work with, this would not negatively impact you in the program.  They would have probably said they wished you told them earlier so they knew you would probably need more lead time before placements to work things out.  \n\nThat being said, there is no reason to tell others beyond what you feel comfortable sharing.  There could a single administrator that would have to know to help facilitate something, but we know how to deal with confidential things.",
      "author": "manova",
      "created": 1601685446,
      "upvotes": 2,
      "replies": {}
    },
    "g7gu288": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7gu288/",
      "text": "If you had a legit prescription can't you just get a copy of it?",
      "author": "CABGX4",
      "created": 1601685650,
      "upvotes": 2,
      "replies": {}
    },
    "g7id9x4": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7id9x4/",
      "text": "This won't help this situation since you've already disclosed, but in the future make sure you only disclose if they ask if you've been arrested specifically, not if you have a criminal history or were convicted.\n\nYou don't have a criminal history since the charges were dropped. It's a simple case of a mistaken arrest. You aren't required to disclose that unless they specifically ask for previous arrests",
      "author": "Dr_Silk",
      "created": 1601730139,
      "upvotes": 2,
      "replies": {}
    },
    "g7h97f1": {
      "link": "/r/AskAcademia/comments/j3uhzl/what_would_you_think_and_do_if_a_student_30f/g7h97f1/",
      "text": "The WWCC don't reject applications, they process it and have it listed on your WWCC that you are barred from working with children. That's the whole point of them. And having a criminal history doesn't automatically bar you from working with children (unless it's an offence against a child). \n\nThey come under the Office of the Children's Guardian and there is an appeals process (through NCAT), so not sure any of the advice you received was accurate and I'd contact the OCG and check the status of your application, as they should notify you directly if you have recieved a bar against working with children of if your situation has to have a risk assessment.",
      "author": "koalafied_duck",
      "created": 1601694861,
      "upvotes": 1,
      "replies": {}
    }
  }
}