{
  "sid": "rbe4xc",
  "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/",
  "title:": "Gift for my Professor who changed my life.",
  "text": "I want to give an RBG bobble head to my Professor who has impacted me so much. She has championed for me, and given me great opportunities as being her TA and a scholarship. I want to give her a gift for winter break, so I got her an RBG bobble head, as she is a feminist activist and a lawyer. But I don’t want to cross any boundaries or make her uncomfortable. I know there is some policy that professors can’t accept gifts, or overall some professors get uncomfortable. \n\nI have a nice, but cheap candle that I can give her as a second option. What do you think?",
  "author": "memeyourtrauma17",
  "created": 1638924281,
  "updated": 1639515546,
  "over_18": false,
  "upvotes": 151,
  "upvote_ratio": 0.92,
  "comments": {
    "hnnwj2p": {
      "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnnwj2p/",
      "text": "Little token gifts like that are much appreciated. As long as they aren’t super extravagant it’s not generally an issue. I have a number of trinkets and things students have given me and I treasure them all—pens, mugs, magnets, little toys, etc.",
      "author": "eightwednesday",
      "created": 1638925853,
      "upvotes": 146,
      "replies": {
        "hnnwsuz": {
          "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnnwsuz/",
          "text": "Yes! Every since I saw the bobble head, I thought of giving it to her. It’s my last year, and she has continue to encourage me through hard times. Thank you!",
          "author": "memeyourtrauma17",
          "created": 1638925991,
          "upvotes": 57,
          "replies": {
            "hno1sfm": {
              "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hno1sfm/",
              "text": "Do give it to her. I am certain that she will appreciate it, and remember you whenever she looks at it.",
              "author": "CrankyReviewerTwo",
              "created": 1638928493,
              "upvotes": 30,
              "replies": {}
            },
            "hnp6enq": {
              "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnp6enq/",
              "text": "Can I be your professor? I want an RBG bobble head. \n\nI'm normally all about small fairly generic gifts but the jealousy is strong with this one.",
              "author": "ACatGod",
              "created": 1638955131,
              "upvotes": 9,
              "replies": {}
            },
            "hnnwww7": {
              "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnnwww7/",
              "text": "She sounds awesome, I think she’ll love it :)",
              "author": "eightwednesday",
              "created": 1638926047,
              "upvotes": 21,
              "replies": {}
            }
          }
        }
      }
    },
    "hno34cn": {
      "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hno34cn/",
      "text": "Especially since it’s your last year, it’s a nice thank you token.",
      "author": "big-wide-eyes",
      "created": 1638929159,
      "upvotes": 28,
      "replies": {}
    },
    "hnogdlq": {
      "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnogdlq/",
      "text": "As long as it's under the state ethics law maximum value (and a bobblehead almost certainly is), you're fine.\n\nWhat will be more important for their memory will be the earnest thank-you note that you give her along with it. She'll keep that RBG bobblehead on her desk or a shelf, and every time she sees it she'll remember that it came from someone who genuinely appreciated the time and effort she put in.",
      "author": "feralparakeet",
      "created": 1638936014,
      "upvotes": 16,
      "replies": {}
    },
    "hnobh7k": {
      "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnobh7k/",
      "text": "I totally echo the previous commenters who said that small, thoughtful, gifts like this are absolutely appropriate after final grades are in - I agree it's a really sweet thought, and that she will love it. I am only chiming in to say that if this is something that feels comfortable for you, another very thoughtful thing to do is to email her department chair and tell her chair how wonderful she was and how much she impacted you. Glad you've had such a lovely experience!",
      "author": "BucketFullofSunshine",
      "created": 1638933405,
      "upvotes": 26,
      "replies": {}
    },
    "hno9scw": {
      "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hno9scw/",
      "text": "A card here would also work if you’re worried. Write a sincere note in it and it will convey the message without you worrying about whether you’ve crossed any boundaries or made the prof uncomfortable. Plenty of faculty I know still have cards they’ve received from students over the years displayed in their offices.",
      "author": "ahaajmta",
      "created": 1638932538,
      "upvotes": 8,
      "replies": {}
    },
    "hno36pg": {
      "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hno36pg/",
      "text": "At public institutions, we do have an upper limit on what we can accept... maybe the equivalent of $40 or so?\n\nEthically we can't accept anything till after grades are submitted etc.\n\nThis sounds like a really heartfelt gift, it will mean something to both of you, so I think you should give it to her. Wait until after she has entered any final grades for you (if she's still your instructor). I've gotten a couple gifts like these - they truly mean a lot. Your prof will love it.",
      "author": "boilerlashes",
      "created": 1638929190,
      "upvotes": 34,
      "replies": {
        "hno59s4": {
          "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hno59s4/",
          "text": "It’s definitely a thought that counts thing. Even a simple thank you card is greatly appreciated.",
          "author": "davesoverhere",
          "created": 1638930235,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hnp7fat": {
      "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnp7fat/",
      "text": "A hand written note would also go a long way. \n\nSource: someone that got one.",
      "author": "Lazaryx",
      "created": 1638956047,
      "upvotes": 7,
      "replies": {
        "hnqwbjv": {
          "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnqwbjv/",
          "text": "Seconding this! Having a handwritten note is such an inspiration and motivation.",
          "author": "wantonyak",
          "created": 1638987499,
          "upvotes": 1,
          "replies": {
            "hnqyj66": {
              "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnqyj66/",
              "text": "Yes. I keep mine over my computer screen.",
              "author": "Lazaryx",
              "created": 1638988341,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hnochl3": {
      "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnochl3/",
      "text": "You could also think about giving something homemade. I gifted cross stitch microbes to three of my letter writers earlier this year and they all loved them. It went over really well!  \n\n\nThat being said, I think the RBG bobblehead sounds great. :)",
      "author": "bobandtheburgers",
      "created": 1638933930,
      "upvotes": 11,
      "replies": {
        "hnq8895": {
          "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnq8895/",
          "text": "i am not your professor. I am not a professor. I will not write your LOR's. I will accept your microbe cross stitches. Thank you.",
          "author": "PhuckedinPhilly",
          "created": 1638978136,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hnolzl5": {
      "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnolzl5/",
      "text": "I think it's fine!",
      "author": "TourmalineTart",
      "created": 1638939274,
      "upvotes": 4,
      "replies": {}
    },
    "hnqrvti": {
      "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnqrvti/",
      "text": "I had a student hand make a sign with my future son’s initials on it when I was pregnant. It’s one of my most sentimental possessions. I’ve never heard of a professor not being allowed to take gifts from students (UNLESS the professor is in charge of a grade in your current class and you haven’t gotten your grade yet. Some of my students took me out for wings last week but only after I had submitted their final grades. In that case, just wait till after grades are submitted). You should definitely do it, it will mean so much to them!!",
      "author": "torrentialwx",
      "created": 1638985808,
      "upvotes": 1,
      "replies": {}
    },
    "ho1xrkl": {
      "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/ho1xrkl/",
      "text": "Bobblehead!  Bobblehead!  That's the kind of gift I would like!\n\nNot too personal, like a candle that I would use at home.  Not impersonal like a gift card (I don't want your money).  Fun.  It's perfect.",
      "author": "x47126g",
      "created": 1639180027,
      "upvotes": 1,
      "replies": {}
    },
    "hnq7v5p": {
      "link": "/r/AskAcademia/comments/rbe4xc/gift_for_my_professor_who_changed_my_life/hnq7v5p/",
      "text": "I just spent like. sixty something bucks back in september on a bunch of little shit for my professor's birthday. Origami sea turtles and tulips. Three small paintings of tulips. He's got a big thing about flowers. A wooden chess set cause he's only ever played online. A few small joke things, a bright pink sparkly glitter pimp cup and a plastic piggy bank for when he's too old to work anymore he can fall back on his change savings. And then I handmade sea turtle shaped chocolate bars for him. And he said, \"I don't deserve this.\" And I said, \"no, you do not, but all that could change when you let me set up my saltwater tank in your lab.\"    \n\n\nGive her both the gifts. She works her ass off and doesn't make nearly enough money for it or get nearly enough appreciation for it.",
      "author": "PhuckedinPhilly",
      "created": 1638977988,
      "upvotes": 0,
      "replies": {}
    }
  }
}