{
  "sid": "ql51pz",
  "link": "/r/AskAcademia/comments/ql51pz/job_market_timeline/",
  "title:": "Job Market Timeline",
  "text": "&#x200B;\n\nI'm in the final year of a Ph.D. program (my university is in the U.S. and I am only applying to jobs in the U.S.). I've been applying to tenure track jobs, some with September deadlines, others with October/November deadlines. I know that the timeline for these positions can vary wildly.  However, now that it is November, it feels like it is a little late to hear from positions I applied for in September. \n\n&#x200B;\n\nCurious what general timelines other people have experienced? And, how do you keep from getting discouraged? At what point should I shift towards putting more effort into finding jobs outside of academia?\n\n&#x200B;\n\nAny thoughts or advice would be greatly appreciated! Thanks, all.",
  "author": "Worried_Discount_900",
  "created": 1635862170,
  "updated": 1636173557,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hj0povr": {
      "link": "/r/AskAcademia/comments/ql51pz/job_market_timeline/hj0povr/",
      "text": "I would wait until the holidays for a job with a September deadline. You can also monitor the jobs wiki in your discipline to see whether or not you're still in the running. Unfortunately Covid has really messed with hiring timelines. Some are early, many are later. Unfortunately it's a crap shoot, like much of the job application process. Solidarity.",
      "author": "jmgbam21",
      "created": 1635865783,
      "upvotes": 1,
      "replies": {
        "hj25ro2": {
          "link": "/r/AskAcademia/comments/ql51pz/job_market_timeline/hj25ro2/",
          "text": "This is very helpful. Thanks!",
          "author": "Worried_Discount_900",
          "created": 1635886299,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj1005p": {
      "link": "/r/AskAcademia/comments/ql51pz/job_market_timeline/hj1005p/",
      "text": "Things will differ a bit from school to school, etc., but in my field (rhetoric & composition / English), it generally tends to look like this:\n\n1. Deadlines anywhere from Sept-Feb., but let's work with Sept. 30\n2. Applications are read when committee members are able to look over them and meet to determine potential interviewees\n3. Interviews are scheduled, often when convenient (aka around school breaks/holidays)--so perhaps right before Thanksgiving or right before a winter break/semester end\n4. Campus visit candidates are determined ASAP to schedule visits, which may be as soon as mid-January (maybe a week or so after the semester kicks back in)\n5. Dept. faculty votes on/ranks candidate preferences, which then go to the Dean's office for approval, and then an offer is extended (which might be incredibly quick or might take another month, depending on how many other candidates still need to visit and how quickly the dept. can take its vote)\n\nThis 'radio silent' period is the worst, to be sure. I found myself reconsidering jobs that I didn't want and wouldn't have applied to otherwise (as the desperation to hear _something_ steadily increased).\n\nIf you check the Academic Jobs Wiki, please do not do so more than once a week. I got really anxious from constantly refreshing it and developed HBP from the ordeal.",
      "author": "herennius",
      "created": 1635870032,
      "upvotes": 1,
      "replies": {
        "hj25ny5": {
          "link": "/r/AskAcademia/comments/ql51pz/job_market_timeline/hj25ny5/",
          "text": "Seconding your advice on the jobs wiki. It's easy to turn into something where you're checking it multiple times a day, which is not good for your sanity and not a good use of your time.",
          "author": "mormoerotic",
          "created": 1635886262,
          "upvotes": 2,
          "replies": {}
        },
        "hj263pm": {
          "link": "/r/AskAcademia/comments/ql51pz/job_market_timeline/hj263pm/",
          "text": "Thanks so much. The silence is terrible!!\n\n&#x200B;\n\nI went through a period of obsessively checking the academic jobs wiki after applying for dissertation completion fellowships... awful!! Looking once a week sounds good.",
          "author": "Worried_Discount_900",
          "created": 1635886423,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj3hz0i": {
      "link": "/r/AskAcademia/comments/ql51pz/job_market_timeline/hj3hz0i/",
      "text": "The job market is awful, and the fact that you never hear anything from about 90% of the places you apply makes it so much worse. In my experience, if something had a September deadline, they’ve almost certainly made calls by now. October deadlines may still be in play. \n\nWhen I’ve been on search committees, we’ve usually tried to schedule a meeting about a week or two after the deadline. If there are a lot of applications, we might have two meetings to get to the short list. But that should all be complete within about three weeks. Then we would report to the chair and he/she would get in contact with the candidates that week. This could be idiosyncratic, but that’s my experience.",
      "author": "EconGuy82",
      "created": 1635905909,
      "upvotes": 2,
      "replies": {}
    }
  }
}