{
  "sid": "pba3a5",
  "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/",
  "title:": "What do you typically do with grants in the humanities that don't involve travel?",
  "text": " \n\nHi all,\n\nI received a $12k grant a year ago, which was delayed due to covid. I'd like to get started buying research materials, but I'm wondering if I should try to delay the grant further, because travel still isn't happening and I don't really want to gamble on that fact changing.\n\nI can use a small portion of it for a summer stipend, but I cannot use it for a course release.\n\nI had $7k of the grant dedicated to travel.\n\nAre there any creative ways of spending grant money for folks in the humanities? If there were no restrictions, I'd spend it all on course release and research materials.",
  "author": "HumanitiesGrant",
  "created": 1629894021,
  "updated": 1634079490,
  "over_18": false,
  "upvotes": 33,
  "upvote_ratio": 0.93,
  "comments": {
    "haa9ifc": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haa9ifc/",
      "text": "Conference fees, software, payment for a student research assistant",
      "author": "DeepSeaDarkness",
      "created": 1629894812,
      "upvotes": 31,
      "replies": {
        "haaa560": {
          "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haaa560/",
          "text": "What software do you use in the humanities? \n\nAnd what type of work do you have students do? I have grad students with hours that the grant doesn't need to pay for. I could pay a grad student to do more substantial work, but I'm not sure they have the right skillset yet.\n\nConference fees were part of the travel, but that's not happening now, so that's what I'm trying to rebudget.",
          "author": "HumanitiesGrant",
          "created": 1629895149,
          "upvotes": 6,
          "replies": {
            "haaajpq": {
              "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haaajpq/",
              "text": "My boyfriend does lots of interviews so he has software for transcribing for example",
              "author": "DeepSeaDarkness",
              "created": 1629895362,
              "upvotes": 15,
              "replies": {
                "haankqf": {
                  "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haankqf/",
                  "text": "Which software does he use for speech-to-text transcribing?",
                  "author": "brazenhead93",
                  "created": 1629901331,
                  "upvotes": 1,
                  "replies": {
                    "haatxgp": {
                      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haatxgp/",
                      "text": "Not OP but otter.ai is shockingly good and shockingly cheap. I’m in an industry job with lots of transcribing and Otter is the best bang for your buck. If you want a human to transcribe it though, it can get pretty expensive — Rev is good for that.",
                      "author": "idislikekittens",
                      "created": 1629903978,
                      "upvotes": 8,
                      "replies": {
                        "haazgrq": {
                          "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haazgrq/",
                          "text": "Frankly, this is one of the biggest game changers in qualatative / interview-based work in decades. The cost of transcribing has been reduced by more than 90%. I run a project that has conducted more than 200 interviews in the past year. Total cost for transcription: $500. A human transcriptionist would cost about £7,500 easy for that. Time has to be spent correcting the transcript, but frankly you have to do that with human-transcribed work anyways.",
                          "author": "bad_jew",
                          "created": 1629906247,
                          "upvotes": 7,
                          "replies": {}
                        },
                        "hada9xx": {
                          "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/hada9xx/",
                          "text": "Otter's Zoom integration has been a lifesaver too. We'd have events with, like, a host, three presenters, and ten live questions, and a little while after you stop recording on Zoom, Otter has done its thing and used Zoom attendee names to correctly tag all the speakers. When captioning requirements became a thing, I figured we'd have to stop posting recordings because who has time to transcribe weekly 1.5 hour talks? But with Otter, I'm done with the transcript by noon the next day.",
                          "author": "dcgrey",
                          "created": 1629940842,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hacu7qd": {
              "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/hacu7qd/",
              "text": "I was a grad student RA for both semesters of my final year of my masters. The first one I was logging and creating an archive/database with newspaper articles so the researcher didn’t have to shift through materials that weren’t relevant. The second time I was part of a research team and ran a section of the research under one of the PIs that included some R statistics, citation checking, general research etc. And culminated in a final report they’re using to write a white paper. Most students are happy for the opportunity and know that they’re there for grunt work. All the stuff you don’t want to do, scanning, statistics, archiving, or whatever we are happy to do.",
              "author": "honestly_can_I_not",
              "created": 1629933545,
              "upvotes": 3,
              "replies": {}
            },
            "hacxo96": {
              "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/hacxo96/",
              "text": "Even if your student’s hours are taken care of you could probably find another grad student or undergrad interested in doing a summer project who can’t because they need funding.",
              "author": "hippomancy",
              "created": 1629935139,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "haaeh6t": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haaeh6t/",
      "text": "Research assistant? Even if you don't really need one. I funnel a good chunk of funding to PhDs this way, typically doing things that I don't 100% *need* but that are helpful in ancillary ways.",
      "author": "LookingOutFromDia",
      "created": 1629897319,
      "upvotes": 17,
      "replies": {}
    },
    "haacbru": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haacbru/",
      "text": "Books... also think about alternatives, I'm having a series of 'explainer videos' produced, and have spent travel money on stuff like a good microphone, Bluetooth headphones and a good webcam",
      "author": "IntLawprof",
      "created": 1629896270,
      "upvotes": 9,
      "replies": {}
    },
    "haas7re": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haas7re/",
      "text": "Depends on what youre field is, what materials you need, and what the current status of your research is.\n\nFor me in History, my current project still requires a bunch of access to non-digitized archives. With that kind of money and travel restrictions I would try to hire out a remote research assistant whose task was just digitize as much as they could lay their hands on and send it to me. If you still need to go somewhere to obtain materials or conduct data collection, and you are in a field where you can trust an assistant to do that collection, you can investigate the possibility of hiring someone for you. I've not done this personally, but because of recent events my department have all been investigating this possibility. Generally you may want to reach out to a local university department, preferably in your field, and see if they have any starving grad students who would take you up on the job. Then youd negotiate an hourly rate, provide them with some equipment (if youre making large PDF docs you might need to provide them with an HDD to load the materials onto and then physically mail that drive to you. Depending on volume you may be able to also use a cloud-based solution, but to my knowledge they also cost money for an enlarged storage option.), etc.\n\nConversely you could ask the institution directly to do the digitization for you. However in my experience, most institutions are reluctant to do big scanning jobs for researchers, paid or not. I asked two separate places this past summer and was told they were willing to do small scans for free but would not under any circumstances do a bigger projects. So YMMV. \n\nOutside of that a travel grant is hard money to spend when travel is so difficult. It really depends on the stipulations of the grant and how much theyre willing to work with you on spending the money. You may consider additional database access, 'would be nice' technology that would make collection and processing easier, a local assistant if data entry or coding is a potential hurdle, books or other published document collections where available, etc. \n\nBut I feel your pain. I let about half of a (much smaller) travel award expire over the summer because there just wasn't anywhere that I could go or that would even *let* someone in. Ive heard some places are already beginning to shut back down as well. Places like the National Archives may well not open back up for public access the rest of this year.",
      "author": "BeondTheGrave",
      "created": 1629903264,
      "upvotes": 7,
      "replies": {
        "haavm9r": {
          "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haavm9r/",
          "text": "This sounds like my experience exactly - I might be able to get them to postpone the grant, so it sounds like I should push for that, but I'm not sure if or how long they'll be willing to do that, PLUS delaying the funds means I can't buy the research materials I actually could use right now... ha! The dilemma.",
          "author": "HumanitiesGrant",
          "created": 1629904680,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "haamrfh": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haamrfh/",
      "text": "What were you planning to travel for? If you were planning to visit archives and the materials are not digitized, perhaps the archive will digitize the material for a fee.",
      "author": "big_red_nerd_alert",
      "created": 1629900987,
      "upvotes": 7,
      "replies": {
        "haaob59": {
          "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haaob59/",
          "text": "Yes, and I had the same thought! I started to pursue this angle, but the materials I was traveling for have since been digitized anyway. A fortunate turn in the end, but it counts out that particular angle.",
          "author": "HumanitiesGrant",
          "created": 1629901636,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "haazy7m": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haazy7m/",
      "text": "Research materials — every book you'll ever need\n\nA new computer\n\nUndergraduate student workers \n\nA good camera for taking pictures of documents\n\nAudio equipment for a multimedia experience or whatever\n\nA really awesome webcam\n\nEditing services (if you have something to edit)\n\nManuscript consulting services\n\nArchival reproduction services\n\nWeb server space for a few years\n\nA really bitchin' tattoo of whomever you are studying (just kidding)",
      "author": "restricteddata",
      "created": 1629906441,
      "upvotes": 5,
      "replies": {}
    },
    "haavomt": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haavomt/",
      "text": "Student research assistant, software licenses for the lab (e.g. Slack, SPSS, etc) and other ICT equipment (e.g. laptops), books, journal open-access fees, etc.",
      "author": "RecklessCoding",
      "created": 1629904707,
      "upvotes": 5,
      "replies": {}
    },
    "hab8pax": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/hab8pax/",
      "text": "👃🏻❄️",
      "author": "TakeOffYourMask",
      "created": 1629909954,
      "upvotes": 4,
      "replies": {}
    },
    "haaweko": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haaweko/",
      "text": "Books, software, updating tech equipment, hiring grad students to do simple but time-consuming stuff like data entry, transcribing, inventorying your library. Occasionally I've been able to get funding bodies to extend a deadline if it meant the funds could be used more efficiently.",
      "author": "Readerokie",
      "created": 1629905000,
      "upvotes": 2,
      "replies": {}
    },
    "habtyup": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/habtyup/",
      "text": "Software (NVivo, ATLAS.ti) that my institution doesn't have  \nSubscriptions to databases or other resources that my library doesn't have  \nProfessional indexing (for a book)  \nResearch assistant",
      "author": "honeywort",
      "created": 1629918477,
      "upvotes": 2,
      "replies": {}
    },
    "haaw7xf": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haaw7xf/",
      "text": "(not in humanities) Publication fees? $7k should cover 2-3 open access journal APCs lol",
      "author": "CptSmarty",
      "created": 1629904925,
      "upvotes": 3,
      "replies": {
        "haf3hxm": {
          "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/haf3hxm/",
          "text": ">Publication fees?\n\nLuckily we rarely have to contend with these! Our journals tend to make their money from libraries, not authors.",
          "author": "CruxAveSpesUnica",
          "created": 1629982797,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "habdtoy": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/habdtoy/",
      "text": "Some software: Scrivener for writing, Zotero Cloud Storage, Raindrop.io for bookmarks, your website, maybe rapidweaver software to build a website, Final Cut pro to make outreach videos. Lots of things that can be very useful but in the grand scheme of things people often don't budget for.",
      "author": "frugalacademic",
      "created": 1629912002,
      "upvotes": 1,
      "replies": {}
    },
    "habjibl": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/habjibl/",
      "text": "Can you use it for durable equipment (a new computer, a camera, quality sound recorders, etc.)? Software is perhaps a good use of it, but you've got a lot to spend down. Can you put a student to work for you for a semester, and put this toward their tuition and stipend?\n\nNo matter what, your first call should be to the administrator of the grant itself. Check with them - and with your university grants office - about allowable expenses on this grant before you start writing your shopping list. A lot of federal grants are touchy about durable equipment, software, consulting fees, and publication fees. You don't want to accidentally break the rules.",
      "author": "Greenmantle22",
      "created": 1629914272,
      "upvotes": 1,
      "replies": {}
    },
    "habv9d9": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/habv9d9/",
      "text": "Is there any sort of exhibition output you could produce? The money may well be very welcome by local artists or venues who you could collaborate with!",
      "author": "cuccir",
      "created": 1629918990,
      "upvotes": 1,
      "replies": {}
    },
    "hacsnif": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/hacsnif/",
      "text": "Professional editing or indexing work.",
      "author": "CruxAveSpesUnica",
      "created": 1629932830,
      "upvotes": 1,
      "replies": {}
    },
    "hao3dii": {
      "link": "/r/AskAcademia/comments/pba3a5/what_do_you_typically_do_with_grants_in_the/hao3dii/",
      "text": "Research assistants, translation, books, software, equipment (monitor, e-reader, printer, tablet, computer), conference fees, professional org membership.",
      "author": "TheoryProf",
      "created": 1630148421,
      "upvotes": 1,
      "replies": {}
    }
  }
}