{
  "sid": "hgyovo",
  "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/",
  "title:": "By this time next year I plan to resign from my TT position and relocate back to my hometown. I'm embarking on a new career path in search of newer opportunities that don't place me in a position of severe economic impoverishment and overwork. How do I resign without sabotaging my reputation?",
  "text": "How do continue to work throughout the year, showing \"productivity\" while knowing deep down that I will be resigning by the academic-year's end? When do I submit my letter of resignation, to give the department enough time to adjust? What do I say in my letter of resignation? \n\nTruth is, I hate my job. I hate being a professor. I hate working as hard as I do, and still I'm begging federal institutions for grants and money. I hate making exams, and grading papers. I hate my life. I'm planning to leave whether or not I have a job lined up because I'm just that miserable. But I want to do it in a way that doesn't sabotage my reputation. \n\nAdvice please.",
  "author": "honestblackman",
  "created": 1593282493,
  "updated": 1634080539,
  "over_18": false,
  "upvotes": 259,
  "upvote_ratio": 0.96,
  "comments": {
    "fw6xogh": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw6xogh/",
      "text": "Don't over think it. I was in a similar position, knowing for almost a year that I was going to leave. You can avoid most long term commitments if you just tell people that your plate is too full to take on new projects. You don't owe the department anything beyond professional courtesy - that means do your best to ensure a smooth transition of your responsibilities. But the will be loose ends, and that's just the nature of leaving a job.\n\nRegarding your resignation, all you need to do is give them the amount of notice your contract specifies, and your resignation letter just needs to say that you're leaving to pursue other opportunities. It's a formality, not a chance to express your feelings.",
      "author": "flyingfaraway",
      "created": 1593284711,
      "upvotes": 185,
      "replies": {}
    },
    "fw719tz": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw719tz/",
      "text": "I think if you leave and aren't a jerk about it, you'll be fine.   \n\n\nNot your question, but have you worked outside of academia before? I say this as somebody who had a ten year career in a completely different field before getting my PhD and it sucked. I know some non-academics love their jobs, so obviously my experience isn't everybody's, but if there's any way to test the waters a bit before you make the leap, I would encourage it. Anyway, good luck!!",
      "author": "doctork1885",
      "created": 1593286618,
      "upvotes": 63,
      "replies": {
        "fw72ja6": {
          "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw72ja6/",
          "text": "Yeah, I worked in Corporate and it was kind of a wash.  The parts that sucked were different, but it wasn't the case that it didn't suck.",
          "author": "karenaviva",
          "created": 1593287252,
          "upvotes": 28,
          "replies": {}
        }
      }
    },
    "fw6wjz1": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw6wjz1/",
      "text": "Does your reputation really matter if you hate your career so much?",
      "author": "tamirabeth",
      "created": 1593284111,
      "upvotes": 190,
      "replies": {
        "fw98zkj": {
          "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw98zkj/",
          "text": "Perhaps 'reputation' isn't the best word, but OP obviously want to leave in a respectful and drama-free way. That's at least how I interpret the question.",
          "author": null,
          "created": 1593342929,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "fw7w8og": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw7w8og/",
      "text": "Chair here. I've had colleagues resign. No hard feelings, but I'd personally *absolutely* prefer to have a private heads-up as far in advance as possible because if someone leaves without warning in late spring I'd have to scramble to cover their classes for fall, or even risk losing the line. It wouldn't be a problem to keep that info confidential, but even better if the dean knew too so we could start conversations about a term hire to cover the classes.\n\nNobody I know has resigned from a tenure-track position *without* telling the chair in advance at my school. It's a courtesy to do so. I've had no problems providing positive references for people who have left of their own accord that way. If someone simply bailed in May and left us hanging, though, I'd consider that unprofessional and would be much less willing to provide more than a basic \"yes, she worked here\" sort of reference.\n\nPeople leave academia all the time. Two friends of my did so one year after earning tenure. It's not uncommon, but doing it professionally will make it easier for everyone.",
      "author": "SnowblindAlbino",
      "created": 1593303630,
      "upvotes": 30,
      "replies": {
        "fw9925e": {
          "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw9925e/",
          "text": "I would add:\n\n\\- check HBR for some advice, like here:[https://hbr.org/podcast/2018/09/resignations](https://hbr.org/podcast/2018/09/resignations)\n\nI would evaluate speaking with the chair and create an exit plan. This might shift you work to help him plan for succession and alternatives, bring up some points for you and new experiences, which might help you somewhere else. This would also sit well with other future employers, showing you have an understanding of how organizations evolve and are a team player to the end.\n\nSaid this, I don't have a clue about the situation you are in, who and how you are, so weight it with the customary grain of salt. This is an internet forum anyway. All the best to you and your goals.",
          "author": "ricardojndosreis",
          "created": 1593343000,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fw6zi4w": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw6zi4w/",
      "text": "I don't have any advice but I just wanted to say I am sorry you're miserable and I hope you find your way to a job that makes you happier.",
      "author": "crackmethisnut",
      "created": 1593285718,
      "upvotes": 28,
      "replies": {}
    },
    "fw6vuob": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw6vuob/",
      "text": "If you can, take a sabbatical first! Grass is always greener on the other side but it might not end up being the case.",
      "author": "djinni574",
      "created": 1593283731,
      "upvotes": 80,
      "replies": {
        "fw6yrf9": {
          "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw6yrf9/",
          "text": "The fine print with many institutions’ sabbaticals is that if you leave after the sabbatical year you have to pay the income for that period back. This has kept me from taking one, despite being overdue. Instead, I’m trying to just find soft money for a while to focus on research, especially with Covid to worry about.",
          "author": "Jon3141592653589",
          "created": 1593285306,
          "upvotes": 54,
          "replies": {}
        },
        "fw6ylnk": {
          "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw6ylnk/",
          "text": "Also, 'a new career path in search of newer opportunities' is super vague - it sounds like you don't know what you want.  It sounds more like burnout and so you really should take a break. After that, slow down your research - it's a marathon, not a sprint, and only work on things you really want to work on and also believe will be impactful.",
          "author": "djinni574",
          "created": 1593285218,
          "upvotes": 52,
          "replies": {}
        }
      }
    },
    "fw6zsd1": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw6zsd1/",
      "text": "You dont owe anyone anything, but it is a small world and you could conceivably need a LOR.\n\nIn any case, it doesn't really hurt to be considerate.\n\nIf you are really sure that you want to leave, I would at least tell your chair so that they have some heads up that they will have to replace you.  But that is only my 2 cents.\n\nIf you have the chance to get out and do some consulting or job interview before you pull the plug, even if the things you get are not your long term goals,  I would really advise you strongly to see if the other options are actually worse.\n\n Also advise at least a perfunctory job search in whatever you think the alternatives are to get a feeling for if they are alternatives for you.\n\nBut this is in the context that I would not quit a job without having another job under any circumstances .",
      "author": "PersephoneIsNotHome",
      "created": 1593285874,
      "upvotes": 13,
      "replies": {}
    },
    "fw70p4d": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw70p4d/",
      "text": "You might want to look into your institution’s leave of absence policy. You might be able to take a year’s leave of absence that way if your new opportunity doesn’t work out, you’d still have a job to go back to. I am a bit risk adverse when it comes to jobs and so I’d feel more comfortable with a safety net. Of course, everyone’s different when it comes to these kinds of things. I wish you the best of luck sorting this out. I know how hard this can be.",
      "author": "phyziksdoc",
      "created": 1593286330,
      "upvotes": 28,
      "replies": {}
    },
    "fw75bnl": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw75bnl/",
      "text": "\"Relocating back to my hometown\" is sufficient to avoid ill will. \n\nFor timing, if this were my school, you would want to tell your chair as soon as you feel your decision is final. There's always negotiating going on between deans, chairs, and colleagues that you're not privy to, and a TT line is a big card, especially during a recession.\n\nBut in informing yourself about timing, see if you can dig up the posting date of your position and other faculty postings from the past few years. At my school, I'd mentally backdate the posting date by two months; that's the lead time a chair needed to get approvals, have a couple faculty meetings with the job on the agenda, etc. before they were ready to post the job. For us that meant jobs were posted in mid-fall, job talks in December or early January.\n\nI'll also mention that anecdotally we get more and better-qualified non-white non-binary candidates when there's more lead time. When there's a time crunch to fill a slot, the listing is seen mostly by people faculty already know, which may be a less diverse pool that your dept would like to see.",
      "author": "dcgrey",
      "created": 1593288678,
      "upvotes": 20,
      "replies": {
        "fw7wmky": {
          "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw7wmky/",
          "text": ">At my school, I'd mentally backdate the posting date by two months; that's the lead time a chair needed to get approvals, \n\nAt mine it's usually more like a year-- I have to get the dean on board about six months before we make the formal request or there's no point. Those requests are due in April for fall hires to start a year later. So we're talking 18 months, more or less, between the initial request and the new hiring getting an ID card.\n\nAs a chair I'd simply want to know as soon as possible. Ideally *at least* a semester so I could work on the politics of the replacement hire. Much less than that would have a potentially negative impact on our department.",
          "author": "SnowblindAlbino",
          "created": 1593303875,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fw6z7zs": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw6z7zs/",
      "text": "[deleted]",
      "author": null,
      "created": 1593285563,
      "upvotes": 10,
      "replies": {
        "fwae05a": {
          "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fwae05a/",
          "text": ">I think a sabbatical or some kind of distance would be good first. \n\nNo sabbaticals at many institutions if you don't come back full time for the following year. At mine you actually have to pay back your sabbatical salary if you don't return-- it's written into the contract.  Also pretty hard to get a sabbatical at all unless you're in line for it (seven years since prior one), and under current economic conditions some schools have limited or even eliminated sabbaticals entirely for the coming year.",
          "author": "SnowblindAlbino",
          "created": 1593368731,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fw7y5nk": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw7y5nk/",
      "text": "I really understand what you're feeling. The responses you received pretty much cover what you need so I don't have much to add. Agree completely with flyingfaraway. Just expressing solidarity. I wish I left earlier but some plans fell through and I'm still there. Just be professional and kind. You can be brief. There's rarely a good reason to give too much advance notice, because who knows what might happen in a year. Give the notice that your contract requires, no more.",
      "author": "FearlessBasil",
      "created": 1593304843,
      "upvotes": 5,
      "replies": {}
    },
    "fw8kgx9": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw8kgx9/",
      "text": "I would start the job search now in a quiet way and test the waters. The economy is a POS right now and unless you have “a unique skillset” private employers may not be as welcoming as you would like.\n\nIf you’re looking for a government job you might not have as much trouble but may not get the level of pay initially that you would like. \n\nAre you sure that it’s academics and not just your present institution that you don’t like? Give it some thought before you walk out of a job. I would want one lined up before I quit one.",
      "author": "sigholmes",
      "created": 1593319656,
      "upvotes": 4,
      "replies": {}
    },
    "fw8kyol": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw8kyol/",
      "text": "Your colleagues may be disappointed to lose a friend, or a hard working colleague, but many of them will be sympathetic whatever you do. I think there's a lot of us getting more and more frustrated with academia - we have to work harder than ever, achieve more to get any recognition and are paid less. It's also incredibly easy to see - I'd say I'm average among academics in my age range. However, in my department I'm sick of the amount of people being paid 10s of thousands more than me, while being lazy and incompetent by comparison, simply because they are older.",
      "author": "serennow",
      "created": 1593320018,
      "upvotes": 3,
      "replies": {
        "fwaeejt": {
          "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fwaeejt/",
          "text": "> in my department I'm sick of the amount of people being paid 10s of thousands more than me, while being lazy and incompetent by comparison, simply because they are older.\n\nAre your salaries based on rank only, or years of service, or some other metric?  We have a ladder system so each year of service nets you another $1,000 or so. Promotions in rank vary; it's about $2K for promotion to associate but 12-13% for promotion to full. I hit full around age 45 so am topped out; all I can get now are the step raises. But the gap between a new hire (zero experience,  assistant professor) and myself (\\~25 years experience, full professor) is only about $25K annually. We do have some dead weight on the faculty but none of them make it to full, so they are all making less than those who were promoted to full...almost all of whom are quite productive or are carrying serious service loads or both.",
          "author": "SnowblindAlbino",
          "created": 1593368939,
          "upvotes": 1,
          "replies": {
            "fwcauqu": {
              "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fwcauqu/",
              "text": "Different country but it's similar. Yearly (in ordinary times) increments and then relatively steep hurdles and decent pay jumps going from, let's call them, assistant-prof to associate prof and then to full professor. The full prof salary range starts at around double the incoming assistant-prof salary and can go up a lot from there.\n\nI'm 35 and to be honest I'm mainly whining about the undefined \"sustained contribution\" clause in our promotions criteria - \"oh yes, you bring in more grant money, do more service and get better teaching evals than most of our profs, but you haven't done it for a sustained period of time\". (It's also true but I left out papers from that since more does not necessarily equal better.)",
              "author": "serennow",
              "created": 1593409539,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fw7xz2r": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw7xz2r/",
      "text": "You should have a job offer before you quit. It doesn’t sound like you do.",
      "author": "ThatProfessor3301",
      "created": 1593304726,
      "upvotes": 5,
      "replies": {}
    },
    "fw8k1pi": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw8k1pi/",
      "text": "I would say considering current job scenario, make sure you have enough money in hand and preferably a job before making such decision",
      "author": "big_man123",
      "created": 1593319336,
      "upvotes": 1,
      "replies": {}
    },
    "fw9ypvn": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw9ypvn/",
      "text": "Letting your college/department know during Winter break will give them time to put it in their budget, hire someone new, and get the new person ready for Fall. That is probably the most professional thing you can do. In academia, people join, leave, or move all the time. It's normal, so try not to sweat it. \n\nOtherwise, I would say that burnout can happen in any FT position, especially if it is salaried and not hourly. If you haven't yet, learning how to say \"no\" or finding workarounds during a job you are going to quit could be an awesome learning experience for your long-term career satisfaction.",
      "author": "zifmer",
      "created": 1593360745,
      "upvotes": 1,
      "replies": {}
    },
    "fw7riap": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw7riap/",
      "text": "If you hate everything about your job, why do you care ?",
      "author": "Aubenabee",
      "created": 1593300751,
      "upvotes": -1,
      "replies": {}
    },
    "fw7zf6m": {
      "link": "/r/AskAcademia/comments/hgyovo/by_this_time_next_year_i_plan_to_resign_from_my/fw7zf6m/",
      "text": "Why do you give a fuck about your academic reputation, in this case? Would it matter? Are you staying in the same field?",
      "author": "imhereforthevotes",
      "created": 1593305655,
      "upvotes": -4,
      "replies": {}
    }
  }
}