{
  "sid": "mh84rx",
  "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/",
  "title:": "Didn't get an authors approval of a manuscript - how big a deal is this?",
  "text": "I am in the process of submitting a revision for work I did while in undergrad. The whole time I was writing the paper I was mainly corresponding with my PI. I did send an early draft to the rest of the authors (who were involved with creating the dataset I used, but that don't know who I am), one of whom gave feedback and the rest didn't. From that point on, I just assumed that my PI knew I was only sending drafts to her. When I originally submitted the manuscript a confirmation email went out to all the authors, so they all know about the submission, but I never emailed the final draft for approval before submitting. Now, just before submitting the revision, my PI goes \"just to confirm, so and so saw and signed off on the original submission, correct?\" I don't know if I'm catastrophizing, but I feel like I really screwed up. Is this a big academia faux pas?? I have no idea why she's only asking about the one author. It doesn't help that I'm not even apart of the lab anymore so the communication is not the best. Any advice is welcome.",
  "author": "staringatathewall27",
  "created": 1617203270,
  "updated": 1634081771,
  "over_18": false,
  "upvotes": 116,
  "upvote_ratio": 0.97,
  "comments": {
    "gsx8ej9": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsx8ej9/",
      "text": "Generally, you should give everyone named on it a week or so to comment on the final version prior to submission. If you did this as an experienced researcher it might ruffle a few feathers, as an undergrad then I wouldn't worry at all. People should be forgiving that you got the process a little wrong. Just apologise and make sure everyone is happy moving forward. \n\nIf you've not submitted the revisions yet, I would delay it for a week and give people time to comment.",
      "author": "Broric",
      "created": 1617203864,
      "upvotes": 215,
      "replies": {
        "gsxse11": {
          "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsxse11/",
          "text": "Don't forget the sentence stating that a lack of a reply will be interpreted as an OK.",
          "author": "noknam",
          "created": 1617212844,
          "upvotes": 167,
          "replies": {
            "gsxy0wi": {
              "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsxy0wi/",
              "text": "Yeah 100% agree. \n\nThere are so many people who just don’t reply. Then at the last moment jumped out shouting that why don’t u just do XYZ. \n\nAnother trick adds on:\n\n“Please reply with your comments within this week. If I don’t hear anything else, I plan to submit this manuscript by 04/02. “ And you can do another follow up with same content when the  time is approaching. \n\nThen by 04/02 you happily submit the manuscript. Anyone shouting, show this person your email. \n\nThis is to protect yourself from those troubles.",
              "author": "rietveldrefinement",
              "created": 1617215416,
              "upvotes": 118,
              "replies": {
                "gsy30ne": {
                  "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsy30ne/",
                  "text": "Totally agree with this!!!",
                  "author": "Puzzlehead_Rest_18",
                  "created": 1617217699,
                  "upvotes": 14,
                  "replies": {}
                }
              }
            }
          }
        },
        "gsxsl0v": {
          "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsxsl0v/",
          "text": "Agreed....not a catastrophe, but fix it now if you can.",
          "author": "AgoRelative",
          "created": 1617212932,
          "upvotes": 22,
          "replies": {}
        },
        "gt0ria2": {
          "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gt0ria2/",
          "text": "This will also be smoothed over by the fact that they are getting a free publication that they barely worked on. How mad can they be?",
          "author": "fredwbaker",
          "created": 1617277068,
          "upvotes": 2,
          "replies": {
            "gtbm3ib": {
              "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gtbm3ib/",
              "text": "Depends on the content of the publication. I dont want my name attached to shitty conclusions or poor statistics",
              "author": "DeepSeaDarkness",
              "created": 1617515826,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gsx9xv4": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsx9xv4/",
      "text": "She probably only mentioned that one author because they said something to her about it, or asked a question about it.\n\nIt's a pretty big faux pas (in my field at least), but also it was her job to guide your through the process, including the step where you get the final sign-off from all authors. It's understandable that she forgot to tell you that detail, and it's also understandable that you didn't think to do it (especially if you've never been on anyone else's papers and seen them do that).\n\nYou should tell her clearly what you did (and didn't) do, so she can do a good job answering questions from the other authors. She might be frustrated or a little angry at the error, but if she's a good mentor, she will not take that out on you. Similar things happened with me and my PhD supervisor, and the sequence of events usually went like this:\n\n1. I explain what happened, he tells me I messed up, he acknowledges that he too messed up. In this conversation he is pretty clearly frustrated and holding it in, but he doesn't yell at me or say anything mean or say anything like \"you should have known\". I am not thick-skinned, so I would feel a bit scared during this (and I'm sure he could tell), and I would feel like crying but I wouldn't.\n\n2. We continue our regular meeting schedule (no avoidance). In our next meeting, he would apologize for being frustrated, and reiterate that it was his fault for not clearly explaining to me what I should do. Sometimes he'll give some constructive criticism like, \"next time, if you notice this thing, just write to me right away...\"\n\n3. In all subsequent meetings, he totally frames the error as 100% his fault. It's clear that he's written the incident in his memory that way.\n\nIn my opinion this was a pretty good way to handle it, and if a supervisor expresses any more anger than I described above in item 1 then I would have a low opinion of their mentoring ability (that would be kind of toxic).",
      "author": "pb-pretzels",
      "created": 1617204565,
      "upvotes": 90,
      "replies": {
        "gsxck3e": {
          "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsxck3e/",
          "text": "Thank you very much. This seems like a reasonable sequence of events to expect. Luckily this will all be done over email, I would definitely cry if it was in-person. Frig.",
          "author": "staringatathewall27",
          "created": 1617205744,
          "upvotes": 25,
          "replies": {
            "gsxmejy": {
              "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsxmejy/",
              "text": "Good! Honestly I posted it because I know how easy it is to catastrophize a situation, especially if you have time to anticipate the events. It always helps me to visualize an example of how it could go.\n\nI would be crying a couple times over this particular situation too, even knowing it's not really my fault. It's stressful and we want to do well.",
              "author": "pb-pretzels",
              "created": 1617210154,
              "upvotes": 12,
              "replies": {}
            }
          }
        }
      }
    },
    "gsxcy7t": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsxcy7t/",
      "text": "Admission of error sent. Avoiding my email for the next hour while fielding a panic attack, woo hoo.",
      "author": "staringatathewall27",
      "created": 1617205920,
      "upvotes": 56,
      "replies": {
        "gsylplc": {
          "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsylplc/",
          "text": "Nobody but you will remember this happened in 6 months from now, just so you have some context on how not big of a deal it is. \n\nDon't avoid emails/responses from them that is the only way you could make this minor inconvenience into an actual problem.",
          "author": "entropyStable",
          "created": 1617226336,
          "upvotes": 24,
          "replies": {}
        }
      }
    },
    "gsx8na5": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsx8na5/",
      "text": "It’s not great. Its less bad if they approved the first submission and were left out of the loop for the revision, but it’s not good. However it’s not a “catastrophe” and will be fine.\n\nWho knows why she’s asking at this point, she probably should’ve asked before (and you also should’ve known - it generally says that on the online submission portal and the author instructions).\n\nNonetheless, email your PI and tell the truth - no, I got approval from them earlier on in the process but didn’t realize I needed them to sign off on the final submission. How should we proceed? \n\nAnd follow her instructions from there.",
      "author": "ProbablyNotAPuffin",
      "created": 1617203974,
      "upvotes": 30,
      "replies": {
        "gsx99c5": {
          "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsx99c5/",
          "text": "Thank you for the advice. I don't know what I was thinking, it's so obvious that all the authors should have seen the original submission. Will proceed with honesty.",
          "author": "staringatathewall27",
          "created": 1617204254,
          "upvotes": 14,
          "replies": {
            "gsxdb4d": {
              "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsxdb4d/",
              "text": "It's ok. Remember you are still learning the system and mistakes are an intrinsic part of the learning process. My PI tells us to fail early and often, just make sure we learn something every time.",
              "author": "sailingpj",
              "created": 1617206078,
              "upvotes": 15,
              "replies": {}
            }
          }
        }
      }
    },
    "gsxtjzr": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsxtjzr/",
      "text": "It's not good, but isn't catastropic. In general, I want to have a look at the final version to make sure that there aren't any factually incorrect statements, and there is a high degree of professionalism in the paper. If your PI is competent, then these two issues aren't generally a problem, and any remaining minor corrections can be addressed during the page proof stage (not ideal, but possible).",
      "author": "mleok",
      "created": 1617213368,
      "upvotes": 11,
      "replies": {}
    },
    "gsy3745": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsy3745/",
      "text": "Like others have said, it is a big faux pas but it is also super common. I have been on the other side of the issue more than once, and mostly I am just happy to have a paper in a final-ish form. In fact, my first-ever publication was a paper that I didn't know existed until I searched my name on pubmed -- the PI just assumed I'd be ok with everything and never showed me the manuscript!\n\nSome people will be grumpier than others. I bet that is why the PI highlighted one person in particular -- an especially grumpy person. You can reach out to them, apologize, and see how grumpy they are. If they feel especially strongly you can always offer to retract the submission for their review but most people don't want to do that much work and will just give you a \"don't let it happen again\" or something.",
      "author": "zinfandelightful",
      "created": 1617217782,
      "upvotes": 9,
      "replies": {}
    },
    "gsy7u8u": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsy7u8u/",
      "text": "It's a little faux pas I think, but just say sorry and email them all the final draft now. You're new, don't be so hard on yourself. It's okay.\n\nEdit: PI may be asking about that author because they may be the most uptight or smth",
      "author": "notjennyschecter",
      "created": 1617219913,
      "upvotes": 4,
      "replies": {}
    },
    "gsz3b04": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsz3b04/",
      "text": "I got called out on this in my first first author paper (medical sciences). We had a culture of adding people to the work who’s contributions to processing the data had been used, even if they had no input on the actual research question. Anyway, my supervisor was very disorganised and never really explained the process, only that we had to get the paper in quickly. So I only sent it round the authors that had contributed to the actual analysis / research question thus 2 middle authors didn’t get to read it. One of them handled it with a quiet word saying I don’t mind but it’s bad etiquette, the other had a shitty fit. Me and my supervisor both agreed his reaction was way over the top and decided not to use his contributions again.",
      "author": "HailMary74",
      "created": 1617235513,
      "upvotes": 5,
      "replies": {
        "gt10il2": {
          "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gt10il2/",
          "text": "Yes this was the exact scenario! Throughout my time in the lab I would sent all the authors my abstracts, posters etc. for review and would never get any feedback. Once I didn't hear from them after the early draft, I wasn't going to cc them on everything. Obviously, I still messed up big time and I very much accept and realize that, but I was under pressure from my PI to submit and I allowed myself to believe the other authors A) didn't care and B) were consenting by not responding.",
          "author": "staringatathewall27",
          "created": 1617283028,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gsy7d1r": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsy7d1r/",
      "text": "I'll note also that even if it gets straight-up accepted you will still have a chance to do minor grammatical revisions and may be able to change other small things too if any of your co-authors need you to make edits. So don't worry too much.",
      "author": "tishtok",
      "created": 1617219695,
      "upvotes": 4,
      "replies": {}
    },
    "gsyl7kr": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsyl7kr/",
      "text": "Yeah you screwed up but it is only a really big deal if you publish without getting approval, so send an email to everyone getting approval ASAP! They will all approve of the current version with minor corrections/suggestions at worst.",
      "author": "entropyStable",
      "created": 1617226092,
      "upvotes": -1,
      "replies": {}
    },
    "gsz8z6u": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsz8z6u/",
      "text": "That’s a huge academia screw up. You need to have everyone’s written approval to submit for every submission to the journal, including resubmissions.",
      "author": "MyHeartIsByTheOcean",
      "created": 1617238521,
      "upvotes": -2,
      "replies": {
        "gt0e5kx": {
          "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gt0e5kx/",
          "text": "written approval? lmaooo",
          "author": "VanillaRaccoon",
          "created": 1617267278,
          "upvotes": 3,
          "replies": {
            "gt12u3a": {
              "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gt12u3a/",
              "text": "Oi, laugh all you want. When you have to experience first hand authors fighting over stuff like that to the point it goes all the way up administrative chain and threatens someone’s tenure prospects because submitting w/o approval is, after all, wrong, it’s not as funny.",
              "author": "MyHeartIsByTheOcean",
              "created": 1617284312,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gsxw2yl": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsxw2yl/",
      "text": "How is an undergrad publishing?",
      "author": "Luis_McLovin",
      "created": 1617214524,
      "upvotes": -13,
      "replies": {
        "gsy3k0z": {
          "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsy3k0z/",
          "text": "How are you asking this? I published in undergrad with relative ease...",
          "author": "giganticoranges",
          "created": 1617217947,
          "upvotes": 7,
          "replies": {
            "gsy6toq": {
              "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsy6toq/",
              "text": "Sorry, I was unconcerned at undergrad, only later in life did I ever care about this and at the time it never occured that it could be done.",
              "author": "Luis_McLovin",
              "created": 1617219449,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gsy0dfc": {
      "link": "/r/AskAcademia/comments/mh84rx/didnt_get_an_authors_approval_of_a_manuscript_how/gsy0dfc/",
      "text": "The worst. You are risking your reputation and career. Advise them ASAP and stress that it's under review as opposed to accepted.",
      "author": "Henry_Blair",
      "created": 1617216492,
      "upvotes": -20,
      "replies": {}
    }
  }
}