{
  "sid": "rh5iw1",
  "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/",
  "title:": "Is it normal to not complete everything in your dissertation proposal?",
  "text": "I submitted and defended my research proposal right when covid shut everything down, so the planning of projects and methods was thought through before the world changed. Further, my family had a few medical emergencies I had to help with (including open heart surgery). I’m also a slower worker to begin with so these other things did not help. My original proposal consisted of three overlapping, but distinct, projects. But i’m only done with one and a little halfway through my second project. I am already in my fifth year and my advisor does not want me to delay graduation any further. She wants me to drop my third project all together and modify the second slightly so I can graduate sooner rather than later and graduate in May. \nHowever, I am worried that this looks bad and makes me seem like a lazy, incompetent grad student. Is it normal to not complete everything in a proposal, even when there is not a world wide pandemic. Overall what I have done, while similar to other research, does look at different fields and expands up knowledge in its domain. I just feel bad and worried that I did not do as much as I originally planned.\n\nEdit to add: I have some presentation experience but no publications. I am working on getting an online portfolio set up. That being said, I have no plans to stay in academia and am looking at jobs in the private/government sector. My skill set, much gained from the research I have completed for my dissertation, is in demand. Im not sure if any of that makes a difference.",
  "author": "inconspicuous_spidey",
  "created": 1639592298,
  "updated": 1639787265,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.88,
  "comments": {
    "hoodcug": {
      "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hoodcug/",
      "text": "The stuff in my thesis was perhaps not wholly unrelated to what was in my proposal.",
      "author": "Spambot0",
      "created": 1639593682,
      "upvotes": 28,
      "replies": {}
    },
    "hooeld2": {
      "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hooeld2/",
      "text": "My initial dissertation proposal only has a vague resemblance with the contents of my dissertation. This is totally normal.\n\nIn general, it is also better to have one project done really well instead of having three half-assed projects. During my time as a grad student, we have done so many experiments, measured so many samples - and how many have made it into the thesis? Barely a handful of them.",
      "author": "territrades",
      "created": 1639594155,
      "upvotes": 19,
      "replies": {}
    },
    "hoompmw": {
      "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hoompmw/",
      "text": "My then-supervisor called research proposals \"creative writing exercises\" - I ended up doing something vaguely related but different to what was in my proposal because my data and methods took some unexpected turns. It's no biggie.",
      "author": "Pentagonal_Plankton",
      "created": 1639597270,
      "upvotes": 10,
      "replies": {
        "hooxnhn": {
          "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hooxnhn/",
          "text": "They're an important test of whether you can come up with a plausible project; if your proposal wouldn't be a good thesis it's a big red flag that you're not prepared for what you're getting into.",
          "author": "Spambot0",
          "created": 1639601486,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hooq8fo": {
      "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hooq8fo/",
      "text": "I did literally none of what was in my dissertation proposal. In the department where I did my PhD most dissertation proposals are considered entirely theoretical, then your dissertation work is whatever your advisor already has grants for.",
      "author": "WoodwardHoffmannRule",
      "created": 1639598614,
      "upvotes": 5,
      "replies": {}
    },
    "hop2c91": {
      "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hop2c91/",
      "text": "Your proposal is intended to demonstrate that you have a good understanding of the research in your area, a good research topic, and a good research plan. Your dissertation is intended to show that you have done a body of research worthy of a PhD. Nobody really cares if it is what you proposed or not and it would be shocking and even disappointing if you learned so little in the process that your dissertation reflected exactly and only what you outlined in your proposal. \n\nThe only time the proposal might come up would be if someone felt that your dissertation reflected too little work or intellectual progress. Then they might look back and note that you proposed more than you actually did and ask why you did not do all that you planned. That's not a death sentence, though, because there could be plenty of excellent reasons for the change of plans: it wasn't feasible, it became obvious that it wouldn't produce interesting results, someone else did it in the mean time, something else became more interesting, etc.",
      "author": "bigrottentuna",
      "created": 1639603304,
      "upvotes": 5,
      "replies": {}
    },
    "hoq1az7": {
      "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hoq1az7/",
      "text": "My proposal is a shadow of my dissertation",
      "author": "UNC1112",
      "created": 1639618246,
      "upvotes": 3,
      "replies": {}
    },
    "hoq45r0": {
      "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hoq45r0/",
      "text": "Absolutely.  Next question...",
      "author": "neurotim",
      "created": 1639619526,
      "upvotes": 3,
      "replies": {}
    },
    "hop3s61": {
      "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hop3s61/",
      "text": "This is entirely normal. It is only through fortune, circumstance, and a lack of ambition that everything in a dissertation proposal ends up being in the thesis.",
      "author": "mleok",
      "created": 1639603847,
      "upvotes": 2,
      "replies": {}
    },
    "hopjjox": {
      "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hopjjox/",
      "text": "Yes.",
      "author": "ilikroxnmfrenslikrox",
      "created": 1639610270,
      "upvotes": 2,
      "replies": {}
    },
    "hor0pwc": {
      "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hor0pwc/",
      "text": "To give an additional perspective, it can depend on your committee. If everyone is in the loop and knows about the changes, then it’s fine. That said, a committee member can be a an ass about it and say they signed off on the proposal and the dissertation should match it. Your advisor/chair is there to make sure it doesn’t happen, but make sure. \n\nAs for the other stuff about seeming lazy, etc., no one cares. Don’t use excuses because with COVID literally everyone has the same one and productivity has still varied, like it always does. Moreover no one will *ever* read your proposal. If you’re not doing the academic path then it *really* doesn’t matter. Just finish.",
      "author": "Cicero314",
      "created": 1639635823,
      "upvotes": 1,
      "replies": {
        "hot1kbm": {
          "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hot1kbm/",
          "text": "It seems my advisor has my back with the committee. She said she will stress to them the merits and everything.\n\nAnd in terms of not going the academic route, I’m most likely not, but I did hear of an interesting position opening up near me that I may apply for.",
          "author": "inconspicuous_spidey",
          "created": 1639676860,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hot1n99": {
      "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/hot1n99/",
      "text": "Thanks everyone! All your answers make me feel better and I realize now I just need to get things done. And then gain confidence.",
      "author": "inconspicuous_spidey",
      "created": 1639676892,
      "upvotes": 1,
      "replies": {}
    },
    "houlp46": {
      "link": "/r/AskAcademia/comments/rh5iw1/is_it_normal_to_not_complete_everything_in_your/houlp46/",
      "text": "The opinion of your advisor and your committee matters most here but I think most people understand that the dissertation is an evolving organism. You discover new things, unforeseen things, new pathways. The key is making sure that everybody on your committee is in sync with your direction.",
      "author": "DavidDPerlmutter",
      "created": 1639699490,
      "upvotes": 1,
      "replies": {}
    }
  }
}