{
  "sid": "q37yut",
  "link": "/r/AskAcademia/comments/q37yut/idk_wtf_to_do_with_my_bsch_in_biomed/",
  "title:": "Idk wtf to do with my BSCH in biomed",
  "text": "Hi academics.\n\nSo I’m currently an international student and I know that my chances of getting to med school’s very slim and I don’t want to be a medical doctor either. \n\nBut that seems to be the most common path to take for most people in this major.\n\nBut I chose this major (and minoring in neuroscience) to have a broad field of opportunities in my scientific career.\n\nI’m in my second year (currently a 94 cumulative avg) and I’d say money does matter to me especially as an immigrant and not having a lot of financial support.\n\nI’m only in my second year. But idk what to pick for my masters to be both interesting and have a stable income. \n\nAre they any related fields you’d recommend? Thanks!",
  "author": "El_Lie_F",
  "created": 1633609577,
  "updated": 1634580591,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hfq0j6l": {
      "link": "/r/AskAcademia/comments/q37yut/idk_wtf_to_do_with_my_bsch_in_biomed/hfq0j6l/",
      "text": "I don’t have a masters but did do the med school thing. I didn’t have a neuroscience undergraduate degree (wasn’t really widespread when I trained) but took a neuroscience heavy courseload. There are quite a few folks I work with who have masters and doctoral degrees. While they don’t practice clinical medicine, obviously, they are heavily involved with research and clinical trials. I’ve also interviewed many prospective medical school candidates who had very positive experiences working in the private sector doing biomed research. We have several PhD neuroscience staff who absoutely love the research they do and are compensated well, though, as you may know, doctoral work can be a long and financially unrewarding path. Anecdotally, I see candidates and employees who finished masters level work and are quite happy being clinical research coordinators or are directly involved in benchtop research. Private jobs have a lot to offer in neuroscience and pharmaceutical research. My old college roommate did bioinformatics IT masters before med school. Some people are happy working on bioengineering software/AI applications. So many options! What interests you the most in the sciences?",
      "author": "T1T2GRE",
      "created": 1633610699,
      "upvotes": 1,
      "replies": {
        "hfq1tgg": {
          "link": "/r/AskAcademia/comments/q37yut/idk_wtf_to_do_with_my_bsch_in_biomed/hfq1tgg/",
          "text": "Thank you for your response! \n\nI’d say in terms of compensation, I don’t have to necessarily make 6 figures. Put plainly, I just want a life without money problems. \n\nI’m very interested in a neuro-scientific path and I’d love to be involved in research. My worries are about the processes of getting involved in research alone. I find it very intimidating which might be due to my age and inexperience. \n\nAlso, pharmaceuticals are also an area of interest, as well as genetical studies. But I don’t know how to be involved in research as a stable career. \n\nI would say that unfortunately, I’m just not aware what my potentials are atm. \n\nI’m going to book an appointment with my undergrad councillor. \n\nFor us science folks the path is definitely less straightforward than the engineer counterparts.\n\nThank you, again.",
          "author": "El_Lie_F",
          "created": 1633611378,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfxfvpn": {
      "link": "/r/AskAcademia/comments/q37yut/idk_wtf_to_do_with_my_bsch_in_biomed/hfxfvpn/",
      "text": "I'm not sure where your university is located, but if you're interested in neuroscience research, definitely start putting in 20+ hours/week in a lab as an undergrad volunteer. This research experience will be a prerequisite for most of your career options.",
      "author": "NorthAd7013",
      "created": 1633743307,
      "upvotes": 1,
      "replies": {}
    },
    "hgulwmc": {
      "link": "/r/AskAcademia/comments/q37yut/idk_wtf_to_do_with_my_bsch_in_biomed/hgulwmc/",
      "text": "What about nursing? Not sure where you are located but there are lots of fast-track programs that you can do with some university under your belt. Nursing shortages everywhere and lota of interesting career options!",
      "author": "Street_Tourist7317",
      "created": 1634384298,
      "upvotes": 1,
      "replies": {}
    }
  }
}