{
  "sid": "oy3lnp",
  "link": "/r/AskAcademia/comments/oy3lnp/are_t32_acceptances_binding_officially_and/",
  "title:": "Are T32 acceptances binding? (officially and 'unofficially')?",
  "text": "I am currently searching for postdoc positions and prospect PI's are mentioning that I could apply for a T32. I want to eventually be my own PI so having a track record of grant writing (and successful awards) is highly important to me. I can't seem to find this answer looking at T32 descriptions of my prospect institutions, but if I did apply, and then did successfully get the T32, am I obligated to accept the award and that PI as my postdoc mentor? Not just on an official level (i.e., application \"fine lines\" stating acceptance is binding of use), but unofficial as well? By \"unofficial\" I mean \"unspoken rules of academia.\" My subfield of translational biomedical sciences is a close network and I don't want to create a bad reputation for myself.  \n\nBasically, if applying for T32 with a prospect mentor, are you committing to that mentor if the T32 is awarded? And any other postdoc prospects are inherently 2nd-tier back-ups? Or are you free to choose (based on contract and/or academia 'acceptable practice')?",
  "author": "squirrelynugget",
  "created": 1628114895,
  "updated": 1634080012,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "h7qdhb1": {
      "link": "/r/AskAcademia/comments/oy3lnp/are_t32_acceptances_binding_officially_and/h7qdhb1/",
      "text": "[deleted]",
      "author": null,
      "created": 1628115153,
      "upvotes": 6,
      "replies": {
        "h7qeks5": {
          "link": "/r/AskAcademia/comments/oy3lnp/are_t32_acceptances_binding_officially_and/h7qeks5/",
          "text": "Not OP, but I would say that there are downsides to a T32 if one has other options:\n\n* Since a T32 is an institutional training grant, it may not be viewed as strongly as an individual training award like an F or K award. \n* Again due to the institutional nature, many T32 slots bind your work to a certain area. There is less research area flexibility and more oversight than with individual awards.\n* T32s usually have a set pay rate that may be lower than other funding options, whether institutional or individual.\n\nI don't know well enough what the etiquette should be around all of this, but the advice I've always gotten is that individual fellowhips should be prioritized over T awards.",
          "author": "aggressive-teaspoon",
          "created": 1628115643,
          "upvotes": 6,
          "replies": {
            "h7qezbl": {
              "link": "/r/AskAcademia/comments/oy3lnp/are_t32_acceptances_binding_officially_and/h7qezbl/",
              "text": "[deleted]",
              "author": null,
              "created": 1628115828,
              "upvotes": 6,
              "replies": {
                "h7qg1r9": {
                  "link": "/r/AskAcademia/comments/oy3lnp/are_t32_acceptances_binding_officially_and/h7qg1r9/",
                  "text": "You're certainly right about all of that! After re-considering the post, I think OP hasn't actually commited to this PI and/or project plan yet and wants to keep options open. The post seems to focus on whether or not s/he is, whether formally or informally, in any way locked into working with this PI by applying for and being offered a T32 slot. \n\nSo, I guess, either way, \"Why would you not accept the T32?\" probably comes down to hoping that one can \"do better\" in some sense, whether by getting more explicit support from the prospective PI in pursuing individual awards directly or by getting a different postdoc offer entirely.",
                  "author": "aggressive-teaspoon",
                  "created": 1628116318,
                  "upvotes": 4,
                  "replies": {
                    "h7qiw1k": {
                      "link": "/r/AskAcademia/comments/oy3lnp/are_t32_acceptances_binding_officially_and/h7qiw1k/",
                      "text": "Exactly! I do like the prospect PI/project that I potentially apply for the T32 with (X). But obviously for my own professional assurance I should be keeping my options open. There are other PIs (Y) I am interested in and if during this postdoc search process Y ends up being a better fit for me than X, am I free to choose professor Y over X despite (potentially) receiving a T32 with X? Or is this bad practice and and would ruin my reputation among senior PIs?",
                      "author": "squirrelynugget",
                      "created": 1628117625,
                      "upvotes": 3,
                      "replies": {
                        "h7qwaub": {
                          "link": "/r/AskAcademia/comments/oy3lnp/are_t32_acceptances_binding_officially_and/h7qwaub/",
                          "text": "As long as you have signed formally with neither X nor the T32, then I'd say you're free to switch. Once you've started working with X formally (signing anything, starting the institution onboarding process, etc.), then backing out is not kosher regardless of the T32 status. Being offered the T32 and declining it outright is also fine. (Being general because timeline is unclear to me here, i.e., if you would need the T32 in order to work with X at all, etc.)\n\nAlso, at least in some fields it's increasingly common or even advantageous to do two shorter postdocs instead of a really long one.",
                          "author": "aggressive-teaspoon",
                          "created": 1628123948,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h7qj1og": {
      "link": "/r/AskAcademia/comments/oy3lnp/are_t32_acceptances_binding_officially_and/h7qj1og/",
      "text": "Up until you sign the payback form, you can technically do what ever you want. Once your appointment is processed, you’ve committed for the duration. Switching mentors is program specific. \n\nJust know, the amount of paperwork that goes into managing one of these is insane. PI’s need to maintain data tables (up until recently, a table in a word document) with information on all of your trainees, all trainees participating in the T32, trainee publications while in the program, the demographics of ALL applicants to your school (including school name and average GPA) **for the past 5 years.**…It’s a ton of work. \n\nWhen a PI agrees to sponsor someone, they’re saying “I am committing to provide funds, time, and effort **in addition** to the T32, to support this person’s career”. It may not be written in a contract but it given all the administrative crap they went through to get to that point would be stupid to mess with intentionally. \n\nAlso it’s really annoying to find a trainee at the last minute. Please don’t do that.",
      "author": "c_hampagne",
      "created": 1628117698,
      "upvotes": 3,
      "replies": {
        "h7qlv1a": {
          "link": "/r/AskAcademia/comments/oy3lnp/are_t32_acceptances_binding_officially_and/h7qlv1a/",
          "text": "Thank you for the information! I agree, I should not back out **after** accepting the NoA. \n\nThis prospect PI doesn't have postdoc funds in current grants, so a successful T32 (or first-submission NRSA, which is far less likely) is my only option to train in that lab. \n\nBut upon NoA (prior to signing off), am I still free to choose other postdoc offers in good conscience? Or is it poor taste/bad for my professional reputation?",
          "author": "squirrelynugget",
          "created": 1628119018,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}