{
  "sid": "kb35fo",
  "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/",
  "title:": "I Hate Rejecting Papers",
  "text": "So I became a reviewer for one of the journals I published to during my PhD and I'm happy to be doing it, but I find that I reject far more papers than I accept and it's bothering me. I can always tell when a great deal of work and thought has gone into a manuscript and it makes me sad to send a rejection recommendation. Obviously, the field would not necessarily benefit if I lowered my standards (assuming they are calibrated properly), and I do make sure to find and note aspects of the paper I like and give grace where I can, but even so, rejecting doesn't feel great, especially when you've been on the other side of it, as we all have I'm sure. Any way to get over this while making sure I stay a quality reviewer?",
  "author": "vaughn22",
  "created": 1607694717,
  "updated": 1634080555,
  "over_18": false,
  "upvotes": 251,
  "upvote_ratio": 0.95,
  "comments": {
    "gfebyec": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfebyec/",
      "text": "I think it's important to keep in mind that you aren't rejecting any papers as a reviewer. That's not your role. You are simply giving evidence-based (hopefully) recommendations, and the editor is the one making the final decision. A good editor should not choose to reject only because a reviewer recommended it, and there are certainly cases where editors overrule reviewers. As you gain experience in the field, you will start to better calibrate your standards to those of the specific journal, but in the meantime, remember that you are a reviewer to assess the facts, not the amount of effort that authors put in.",
      "author": "late4dinner",
      "created": 1607699668,
      "upvotes": 103,
      "replies": {
        "gfegiew": {
          "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfegiew/",
          "text": "I want to emphasize this sentiment from u/late4dinner: you, as a reviewer, are making a recommendation to the editor, but the editor is the one making the decision.\n\nInevitably, there are times in which one or more reviewers will recommend a revise and resubmit and one or more reviewers will recommend a rejection, so it is not uncommon for an editor to have to make a decision contrary to at least one reviewer's recommendation. Which is to say that your recommendation is just that: a recommendation.\n\nI don't think anyone takes joy in recommending that papers be rejected, whereas it can be fulfilling to see a paper through the review process and go from an initial manuscript to something that is published, but it is an important part of the process.\n\nOne thing you can do, if you don't already, is to provide constructive feedback about things that the authors can do to strengthen the article. As you can imagine, a rejection that comes with concrete steps to improve the manuscript for my next submission (or improve my research going forward) feels better than having a rejection without any ideas of where to go from there. Think of your role as a reviewer as, yes, someone who helps to make sure that articles that are published meet the standards of your discipline, but also as someone who can help researchers whose studies are not at that point to reach that point in the future.",
          "author": "jogam",
          "created": 1607702012,
          "upvotes": 37,
          "replies": {
            "gfer2lx": {
              "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfer2lx/",
              "text": ">if you don't already, is to provide constructive feedback about things that the authors can do to strengthen the article.\n\nYes, this. It's a learning opportunity. By rejecting the paper and then providing feedback on how to improve, you are helping your colleagues to do better.\n\n\\*edit: quote indicator",
              "author": "bluegreyfixation",
              "created": 1607706757,
              "upvotes": 7,
              "replies": {
                "gfi5h0k": {
                  "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfi5h0k/",
                  "text": "This. Please please give detailed feedback so we can improve. It’s a lot of work, but it will be immensely appreciated.",
                  "author": "anonthrowaway1984",
                  "created": 1607763687,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gfe3zwz": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfe3zwz/",
      "text": "There is too much published junk out there, keep your standards where they are and let the chips fall where they may. Don't make it personal.\n\nPlus, the editor makes the final decision. I've asked papers to be rejected that were  published.",
      "author": "__x0x__",
      "created": 1607695171,
      "upvotes": 199,
      "replies": {
        "gfe79fj": {
          "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfe79fj/",
          "text": "Yes, we have too admit, it is our responsibility as reviewer to reject low quality papers. It is important to maintain the publications standard",
          "author": "piqa1234",
          "created": 1607697067,
          "upvotes": 49,
          "replies": {
            "gfef6ud": {
              "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfef6ud/",
              "text": "lol a little late for that, no?",
              "author": "Blindfide",
              "created": 1607701348,
              "upvotes": 18,
              "replies": {
                "gfi5kq0": {
                  "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfi5kq0/",
                  "text": "Beat me to it",
                  "author": "anonthrowaway1984",
                  "created": 1607763797,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gfef1f7": {
          "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfef1f7/",
          "text": "> Plus, the editor makes the final decision. I've asked papers to be rejected that were published.\n\nHaven't we all?",
          "author": "zzay",
          "created": 1607701274,
          "upvotes": 4,
          "replies": {}
        },
        "gfem9aj": {
          "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfem9aj/",
          "text": "I second this!",
          "author": "quarky-physicist",
          "created": 1607704831,
          "upvotes": 1,
          "replies": {}
        },
        "gfecp1a": {
          "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfecp1a/",
          "text": "[deleted]",
          "author": null,
          "created": 1607700062,
          "upvotes": 1,
          "replies": {
            "gfegj01": {
              "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfegj01/",
              "text": "It’s fairly common. I’m used to there being two reviewers or more, so a recommendation is simply one more source for the editor to draw on when deciding whether to publish or reject. I’ve recommended rejection or major reviews only to see the article published in a slightly more polished state. I’m chalking it up to either an academic disagreement between me and/or the other reviewer, and/or the editor, or one of a host of other factors that make the journal want to publish. I’m only there to make a well-founded recommendation.",
              "author": "rauhaal",
              "created": 1607702020,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gfe7unn": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfe7unn/",
      "text": "It might vary by discipline, but in my discipline it's normal for papers to be rejected once. Unless people are trying to get their papers published quickly, most of my colleagues will aim for a journal that they don't realistically expect to be accepted by, and then quickly resubmit to a more realistic second choice. Rejection is infuriating the first few times it happens, but researchers should soon learn that it's part of the process. The fact that people have put a lot of work in shouldn't concern you - it's not like all that work evaporates when you reject the paper. As long as you give them constructive criticism they can tighten up the paper and resubmit it elsewhere, and that hard work was still worthwhile. It's important to be courteous and constructive, but I don't think you'd be posting this question in the first place if you were an arsehole!\n\nThe standards calibration thing is always a challenge for me. Perfect research is very rare, and you can pick apart anything if you want to. It is hard to get the right balance between letting minor things go but being strict about the things that really matter. I don't want to be the one arsehole reviewer that tears a paper apart when the other reviewers were fine with it, and likewise I don't want to be the one soft touch who misses something important.",
      "author": "EmileDorkheim",
      "created": 1607697409,
      "upvotes": 39,
      "replies": {
        "gfehbui": {
          "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfehbui/",
          "text": "I’ve stopped submitting to that initial outlet expecting rejection. I suspect if I had graduate student energy to burn I might be more apt to do so, but I’d rather just dispense with the aggravation and get on with my life.\n\nI get that some are chasing H-index and getting papers into high-impact journals can have huge consequences on a career, but for me I’m not convinced the aggravation is worth it. (It probably is, I just don’t have the energy.)",
          "author": "Frogmarsh",
          "created": 1607702417,
          "upvotes": 11,
          "replies": {
            "gfeo8lh": {
              "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfeo8lh/",
              "text": "That's probably wise for your own mental wellbeing! Impact factor feels pretty antiquated anyway. In the days where people got a physical copy of a journal and leafed through the whole thing it made sense, but these days who cares whether a paper is in Science or in some open access journal that publishes everything, as long as the paper itself is useful and good.",
              "author": "EmileDorkheim",
              "created": 1607705772,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "gfea3ry": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfea3ry/",
      "text": "I think that as long as you point out shortfalls/strengths/impact and give constructive criticism, any editor would be well happy with your reviews. \n\nIt is not always easy to calibrate your expectations according to the specific journal (especially if you are using your own work as reference it might be a bit trickier to not be biased), but if you feel that rejection is appropriate after comparing to similar articles on the same field I would not think twice about it. As another reply said, there is so much junk being published that proper peer-review is essential to weed out what has been properly done (and in the end, it's up to the editor anyway).",
      "author": "StabilGlidare",
      "created": 1607698665,
      "upvotes": 12,
      "replies": {}
    },
    "gfeetqy": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfeetqy/",
      "text": "[deleted]",
      "author": null,
      "created": 1607701165,
      "upvotes": 19,
      "replies": {
        "gfeihub": {
          "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfeihub/",
          "text": "I agree with most of your points, except the part about suggesting more work. I feel like if a paper title is “we saw this and found this protein is doing it” they better have good evidence to show it. Often I see paper with catchy headlines linking a protein to a phenotype just because it changes with the phenotype, more correlative than cause and effect. If they try to draw the conclusion that it’s through that protein without determining how dependent the phenotype is actually on that protein - I will always ask for more experiments, the claims in the title need to match the data shown.",
          "author": "MeikoD",
          "created": 1607703001,
          "upvotes": 5,
          "replies": {
            "gfepxch": {
              "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfepxch/",
              "text": "[deleted]",
              "author": null,
              "created": 1607706401,
              "upvotes": 12,
              "replies": {
                "gfeunk4": {
                  "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfeunk4/",
                  "text": "Hahaha, no worries!",
                  "author": "MeikoD",
                  "created": 1607707861,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gfedf1p": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfedf1p/",
      "text": "As long as you are proving constructive criticism, it is fine. For example, if they are missing citations, provide a few (and ideally not yours).\n\nAlso, review what they sent and not what you would had liked them to do or what you would have done. \n\nThink really well why is the paper you are reviewing rejecting. Can this be fixed in 30 minutes, in two weeks, does it need a new experiment? \n\nI would also add that paper’s sort themselves out. Citations of the paper will determine the usefulness and quality over time. So, if a paper is accepted that you think is not your “standards”, it may not have the impact. \n\nI notice PhD students reviewing or just graduated PhDs tend to be harsher with work. \n\nAlways remember how to hep them. And be very careful with your words. This may be a phd or master student or even an undergrad. There is no reason to be harsh or mean. Always be constructive and thanks the author for their hard work. \n\nI tell you what, when you are writing your journals, you think of them a lot better than other people, and I’m sure it happens to you. Overtime, you learn what work goes where and the quality. \n\nDon’t reject papers because of grammar, formatting issues, etc. First, not everyone comes from an english speaking country. Second, top people in the field are horrible even with spelling and grammar. \n\nI hope this is helpful.",
      "author": "FoCoCS",
      "created": 1607700439,
      "upvotes": 8,
      "replies": {}
    },
    "gffh9qy": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gffh9qy/",
      "text": "I follow the golden rule: write the review you want to get. The review that I want is honest, thoughtful, and delivered with respect. I end each of my reviews with something like “I hope these comments are helpful, and I wish you the best of luck as you move your work forward.” That’s how I approach the whole thing: how can I help move this work forward?",
      "author": "Sociosmith",
      "created": 1607714993,
      "upvotes": 7,
      "replies": {}
    },
    "gfeuj3k": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfeuj3k/",
      "text": "I’ve been an associate editor for a well-respected journal in my field and I’ve reviewed for most of the top ones. As an editor, I reject around 80/100 papers before review, another 10 after review. Of the 10 that aren’t rejected, 8 are major revisions and 2 minor. Of those 8 major revisions, I’d say 5-6 are eventually accepted, as are the 2 minor revisions. So the publication rate is 10% at best. Discussions with other editors at the journal and at several others suggest this is typical. \n\nAs a reviewer, I’d say I find issues substantial enough to recommend rejection in 60-70% of papers I look at. \n\nResearch is hard. Writing it up is even harder. The best you can do is provide some constructive feedback, and remember your job isn’t to tell the authors what you would have done in their place, but to assess if the claims they are making are supported by the evidence provided.",
      "author": "ccots",
      "created": 1607707822,
      "upvotes": 6,
      "replies": {}
    },
    "gffxad4": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gffxad4/",
      "text": "New PhDs always seem to be tougher reviewers. Don’t forget that while you worked for years on your research, many papers you will review are smaller or exploratory projects and not all papers need to have the same depth as a paper produced from a dissertation. Don’t have unfair expectations, because that is going to be you on the other end when you have published everything you can from your dissertation and/or start new projects. \n\nThat being said, if it is bad science, flawed methodology, misinterpretation of a theoretical framework, etc., of course you don’t want to recommend publication - I just caution you not to be too critical. You make it sound as if you are outright rejecting far more papers than are getting an R&R. \n\nThere are of course differences between disciplines and among journals, and among journal editors, but If the editor didn’t desk reject most of these papers he/she must have thought these papers had a chance at publication. I would have concerns if an editor keeps sending out garbage papers for review and wasting my time.",
      "author": "AcademicX",
      "created": 1607720123,
      "upvotes": 6,
      "replies": {
        "gfjlkme": {
          "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfjlkme/",
          "text": "THIS! THIS! A lot of reviewers I got were like, \"why did you not add this variable or that variable?\" \n\nI'm in Criminology and I was interested to see how parents' roles in monitoring adolescents' activity at night could reduce delinquent behaviour and the reviewer I got was like, \"well, why did you not add teachers' roles too?\" Who do you think the teachers are? Oh and why don't you stop there? Why did you not also suggest the police, neighbors, the adolescents' siblings, the uncles, the aunties, and whatnot. \n\nObviously I could rebut this comment but having to answer this type of comments infuriated me. The power could get to some reviewers' heads sometimes.\n\nP.s: the paper's published even after a lot of rebuttals. I'm thankful.",
          "author": "thesocialworkout",
          "created": 1607789557,
          "upvotes": 2,
          "replies": {
            "gfk3d8o": {
              "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfk3d8o/",
              "text": "Yes, this is a great example of what I am referring to; people who are new to a topic or discipline are often not going to have the same depth in their papers as someone who just finished a PhD or someone who has worked on the same topic for many years. \n\nI reviewed a paper once in which the author missed some key things, and I suspected either he/she was trained in a different discipline, or this paper was on an entirely new topic and the writer was just oblivious. It only took me 30 minutes to provide a “read/incorporate this,” list, highlighted the readings that need to be discussed/addressed in the methodology, etc. I gave that person an R/R under the condition that they add the items I listed and mentioned the paper was exploratory (since it was light in certain areas.) \n\nIt would be great if every paper submitted to a journal was as polished as a dissertation chapter, but given P/T publication requirements, most people have to crank out papers faster than they prefer. A rejected paper could be the difference between someone getting tenure or getting fired, so I try to identify changes that would make a paper publishable whenever possible.\n\nCongratulations on your pub!",
              "author": "AcademicX",
              "created": 1607795460,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gfeb0wi": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfeb0wi/",
      "text": "[deleted]",
      "author": null,
      "created": 1607699164,
      "upvotes": 5,
      "replies": {
        "gfg8jzm": {
          "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfg8jzm/",
          "text": "Likewise, as a reviewer, it can be infuriating to read a paper where the authors have clearly not done their homework or gamble that they can get away with overhyped claims that have little to do with the work presented or shamelessly misrepresent other published work. That's how you get a short review from me.",
          "author": "ColourlessGreenIdeas",
          "created": 1607725284,
          "upvotes": 2,
          "replies": {
            "gfi6v4s": {
              "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfi6v4s/",
              "text": "[deleted]",
              "author": null,
              "created": 1607765185,
              "upvotes": 1,
              "replies": {
                "gfi9d8v": {
                  "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfi9d8v/",
                  "text": "The onus is on the author to convince me. If there are wild claims without proof or glaring gaps in the argumentation, then this is one sentence in my review (plus examples copied+pasted from the paper). If the paper is entirely bullshit, then that's already my entire review.\n\nThe really tough cases are papers that do something worthwhile, but have many issues. These take the most work.",
                  "author": "ColourlessGreenIdeas",
                  "created": 1607767927,
                  "upvotes": 1,
                  "replies": {
                    "gfjn0a1": {
                      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfjn0a1/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1607790048,
                      "upvotes": 1,
                      "replies": {
                        "gfk2h8n": {
                          "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfk2h8n/",
                          "text": "The editor's job is to filter out obvious bullshit before any reviewer sees it.\n\nAn example for something that is not obvious bullshit, but calls for a brief disqualifying review is when the authors clearly misrepresent the state of the art, to an extent that it's unclear if they add anything new. Then I will just point out the paper they omitted or misrepresented, with appropriate pointers. Editors then usually agree with my reject recommendation.",
                          "author": "ColourlessGreenIdeas",
                          "created": 1607795165,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gfeb1co": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfeb1co/",
      "text": "Remember that you are helping the public and the submitter when you reject the paper - you are improving the quality of knowledge and quality of work.",
      "author": "Karsticles",
      "created": 1607699171,
      "upvotes": 5,
      "replies": {}
    },
    "gfg4qfa": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfg4qfa/",
      "text": "It sounds like you are doing a good job, and it sounds like you have empathy for the struggles involved in publishing. \n\nPeer review needs more people who refuse to take out their anger on other people's work.",
      "author": "gggggggggggfff",
      "created": 1607723321,
      "upvotes": 4,
      "replies": {}
    },
    "gfegdk4": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfegdk4/",
      "text": "I go in to every review hoping to read a great paper. I comment and suggest edits in the hope that my suggestions can help to make it a great paper. I really only ever suggest rejection when there are critical/substantial technical flaws not easily addressed or obvious omissions. For instance, my most recent review led to a suggested Major Revision (I debated recommending Reject) because I could not understand the degree of overlap between the authors’ new manuscript and a previous publication of theirs. And the advancement they made wasn’t clearly couched relative to their previous paper. After much consideration, I figured there was a path to making that distinction but it’ll require considerable reconstruction. Nevertheless, the ideas they were advancing were interesting and by suggesting Major Revision rather than Reject, I’m hoping that they tackle the revision in good faith rather than send unchanged elsewhere. The only time I easily reject papers is when they propose baseless notions that contravene logic - rare, but happens.",
      "author": "Frogmarsh",
      "created": 1607701943,
      "upvotes": 3,
      "replies": {}
    },
    "gffnugp": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gffnugp/",
      "text": "I've almost never rejected a paper. I write a long review explaining what is wrong and how it can be fixed, and usually just say revise. My job is to review, not to judge.\n\nThe only two times I've rejected is when the authors obviously tried to republish existing data that they had already published.",
      "author": "radionul",
      "created": 1607717059,
      "upvotes": 3,
      "replies": {}
    },
    "gfeii8z": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfeii8z/",
      "text": "If you're that emotionally affected by rejecting a paper, select major revisions instead and include a comment to the editor that you feel the paper has potential but needs substantial work. The editor will make the decision for you.\n\nI review a good number of papers that suck, and need to be rejected. I have no qualms about rejecting those.",
      "author": null,
      "created": 1607703006,
      "upvotes": 2,
      "replies": {}
    },
    "gfeil79": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfeil79/",
      "text": "If the paper can be remediated by 1) adding something or taking something away 2) changing the analysis 3) modifying the interpretation and still has value why reject outright?\n\nIf something else is actually really needed for the experiment do a revision.\n\nI reject outright stuff that is not salvageable or is badly thought out and poorly designed .",
      "author": "PersephoneIsNotHome",
      "created": 1607703046,
      "upvotes": 2,
      "replies": {}
    },
    "gfeilng": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfeilng/",
      "text": "Just started my PHD journey. Could you tell me how you become a reviewer for a journal?",
      "author": "zoeyzl",
      "created": 1607703052,
      "upvotes": 2,
      "replies": {
        "gff1pdk": {
          "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gff1pdk/",
          "text": "So for me, I published to this journal and then I was requested to give a review a couple months after. Since then, I’ve been getting requests from this journal periodically. So the best advice I can give is to publish.\n\nNow, there are probably other avenues to start reviewing, but have a publication in a peer-reviewed journal is a first step I would say.",
          "author": "vaughn22",
          "created": 1607710158,
          "upvotes": 5,
          "replies": {
            "gfgcgpx": {
              "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfgcgpx/",
              "text": "Yep. Once you start publishing, the requests to review will come. The more you publish, the more you will be asked to review because you will be seen as an expert in whatever area that you publish. Reviewing is very time consuming though (if you do it right) so be selective once those requests start to come in.",
              "author": "CuriousCat9673",
              "created": 1607726969,
              "upvotes": 3,
              "replies": {}
            },
            "gffnh88": {
              "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gffnh88/",
              "text": "Thanks!",
              "author": "zoeyzl",
              "created": 1607716934,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gff8fp0": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gff8fp0/",
      "text": "I think you should be recommending \"reject\" more than \"accept\" for a few reasons: 1) research is hard, we're not here to answer easy questions; 2) there is a perverse incentive to submit a paper to a stronger journal than it perhaps deserves, because of the way academia works in the modern world.",
      "author": "l_lecrup",
      "created": 1607712200,
      "upvotes": 2,
      "replies": {}
    },
    "gfgk9oc": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfgk9oc/",
      "text": "You're a valve to authentic helpful science. You're a gatekeeper. You're at the only place someone could actually have an impact on the Publish-Perish theme in Academia. You get to have a bit of a say - not always - of whether a work is authentic or not, contributive or not, worthwhile or not. You get to help academia overcome great issues like politics, pseudo-science, reproducibility crisis, etc. \n\nYou're at a critical place for our field, you're at a critical place for academia. Good, honest reviewers who give constructive feedback are the best thing that can happen. \n\nPlease, do not feel bad rejecting a paper. But when you do reject a paper, give as much constructive feedback as you could. Make sure that the student doesn't feel horribly bad, yet tell him that his work is shit and not worth publishing, and tell him why it is so, and tell him what it misses to be worth publishing. Don't worry about giving ideas here and there and not getting the credit for them - you are a reviewer, you are an authority; you can generate an abundance of ideas.\n\nThanks for reviewing others' work.",
      "author": "EgyptianPhD",
      "created": 1607729859,
      "upvotes": 2,
      "replies": {}
    },
    "gfefl8o": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfefl8o/",
      "text": "pigging back on what /u/cactusmittens wrote more than making my rejections fair I try to give the authors a way out of the rejection.\n\nThe last article I reviewed the authors did not understand their data and did not found the conclusions that were easily given by the results. \n\nPeople sometimes are so absorbed in writing that don't stand back and reread their work with a reviewers eye. \n\nI too get papers rejected and I always end up saying how the heck did I miss that.",
      "author": "zzay",
      "created": 1607701550,
      "upvotes": 1,
      "replies": {}
    },
    "gfepa3x": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfepa3x/",
      "text": "People can be overly harsh.  I don't know what standards you have or what types of journals you're reviewing for, so it's hard for me to comment.  The worst type of rejection for me is when the reviewer's criticisms are easily addressable.  The best is when it's a high impact journal and the reviewers say something like, \"Nice paper, but not appropriate for this journal.\"",
      "author": "dampew",
      "created": 1607706191,
      "upvotes": 1,
      "replies": {}
    },
    "gff2cvv": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gff2cvv/",
      "text": "Failure does suck but it's important. it's important because someone can learn from it. You are providing these people an opportunity to learn. Do not put yourself down you are doing the work that many others can't.",
      "author": "ReVaas",
      "created": 1607710355,
      "upvotes": 1,
      "replies": {}
    },
    "gfg4pc7": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfg4pc7/",
      "text": "I thought this was jim Carrey coming out of hibernation",
      "author": "Black_wdw",
      "created": 1607723305,
      "upvotes": 1,
      "replies": {}
    },
    "gfgjuka": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfgjuka/",
      "text": "Having sent papers to journals, I hate getting rejections as with rejections in anything. However, it is better to say that you recommend to reject outright than to make so many rough comments and criticisms without coming to the fact that you do not like the paper. Those are the toughest as the editor and the authors know you don't like the paper but those writing the paper do not have finality.",
      "author": "TheAzrael2013",
      "created": 1607729673,
      "upvotes": 1,
      "replies": {}
    },
    "gfeatcf": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gfeatcf/",
      "text": "So my opinion may be worth nothing since I have never reviewed a paper and am currently on my way to submitting my first one, but I have heard from colleagues  and am familiar with the process. I think that if you provide good constructive criticism and aren't unnecessarily harsh then you are doing your job, rejections  are just part of the process.  Noting the stuff that they did well seems to be more than what a lot of other reviewers do. I think that caring about rejecting papers that obviously took a lot of work makes you a compassionate person and that is not a bad thing, use that to your advantage with providing good positive feedback  and being satisfied that you are doing a good job.",
      "author": "hippybilly_0",
      "created": 1607699049,
      "upvotes": 1,
      "replies": {}
    },
    "gffs03h": {
      "link": "/r/AskAcademia/comments/kb35fo/i_hate_rejecting_papers/gffs03h/",
      "text": "I have reviewed about 20 papers and only recommended one for revise and resubmit. All others I recommended rejection. Doesn’t bother me anymore. I certainly have gotten better at giving constructive feedback and not wasting my time on minutia.",
      "author": "nc_bound",
      "created": 1607718425,
      "upvotes": -1,
      "replies": {}
    }
  }
}