{
  "sid": "rgeeqw",
  "link": "/r/AskAcademia/comments/rgeeqw/is_it_okay_to_email_researchers_using_similar/",
  "title:": "Is It Okay to Email Researchers Using Similar Methods to Yours for Advice?",
  "text": "I'm in a STEM graduate program and I'm currently using a method my PI is not familiar at all, but he advised to reach out to other professors at my university to ask to set up a short meeting for further advice on using the method and to briefly discuss some of my data, to see if they could provide insight. I did find a few researchers at my university who might be good to contact, though I have never met them (though for one researcher, I did a summer undergraduate project with their colleague). Is this okay for a graduate student to cold email other researchers? Are most open to this?",
  "author": "SilentPapaya",
  "created": 1639508045,
  "updated": 1639842642,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hojmwfs": {
      "link": "/r/AskAcademia/comments/rgeeqw/is_it_okay_to_email_researchers_using_similar/hojmwfs/",
      "text": "Absolutely.",
      "author": "tiebow5",
      "created": 1639508388,
      "upvotes": 3,
      "replies": {
        "hokgx5y": {
          "link": "/r/AskAcademia/comments/rgeeqw/is_it_okay_to_email_researchers_using_similar/hokgx5y/",
          "text": "Thread over.",
          "author": "johnnydaggers",
          "created": 1639520416,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "hojnl57": {
      "link": "/r/AskAcademia/comments/rgeeqw/is_it_okay_to_email_researchers_using_similar/hojnl57/",
      "text": "In general I would say yes. There can be nuances, in terms of how proprietary the methods/their applications might be, or if your research areas are so aligned as to make you competitors. But the fact that you're at the same institution makes that less likely a concern.",
      "author": "Honestaltly",
      "created": 1639508662,
      "upvotes": 1,
      "replies": {}
    },
    "hojv4t3": {
      "link": "/r/AskAcademia/comments/rgeeqw/is_it_okay_to_email_researchers_using_similar/hojv4t3/",
      "text": "Absolutely 100% okay.  Trust your PI.",
      "author": "bigrottentuna",
      "created": 1639511609,
      "upvotes": 1,
      "replies": {}
    },
    "hok2oe1": {
      "link": "/r/AskAcademia/comments/rgeeqw/is_it_okay_to_email_researchers_using_similar/hok2oe1/",
      "text": "Yup. My only experience doing this was very positive. I wanted to compare my model to that of another researcher and he sent me the MATLAB figures for all the figures from his paper. I was able to easily overlay both sets of data.",
      "author": "CheeseWheels38",
      "created": 1639514572,
      "upvotes": 1,
      "replies": {}
    },
    "hojwnjg": {
      "link": "/r/AskAcademia/comments/rgeeqw/is_it_okay_to_email_researchers_using_similar/hojwnjg/",
      "text": "That's what Researchgate is for. A post on there *will* lead to emails if you're interested enough to find a solution.",
      "author": "benemivikai4eezaet0",
      "created": 1639512202,
      "upvotes": 0,
      "replies": {}
    },
    "hol4724": {
      "link": "/r/AskAcademia/comments/rgeeqw/is_it_okay_to_email_researchers_using_similar/hol4724/",
      "text": "I’ve had other professors’ grad students email me for help with methods and topics related to papers I’ve published. I’m usually happy to respond and exchange a few emails or a phone call. I did have one student though ask for really involved help and oversight to the point where it was taking time away from my students, so I wasn’t able to accommodate that.",
      "author": "tomatocatbutt",
      "created": 1639530783,
      "upvotes": 3,
      "replies": {}
    },
    "hokwwri": {
      "link": "/r/AskAcademia/comments/rgeeqw/is_it_okay_to_email_researchers_using_similar/hokwwri/",
      "text": "yes, and also it's a great way to network with other researchers. You'd be surprised at the kinds of opportunities can open up this way.",
      "author": "apple-masher",
      "created": 1639527444,
      "upvotes": 2,
      "replies": {
        "hoo452b": {
          "link": "/r/AskAcademia/comments/rgeeqw/is_it_okay_to_email_researchers_using_similar/hoo452b/",
          "text": "This. I'm in the Humanities and in Europe (where travel distances are relatively short). But what we'd usually do in situations like the one described by OP is organize a small workshop and invite 2-4 people doing the stuff we want to learn about. The guests arrive in the early afternoon, we give/hear some talks and have good discussions, continue more casually over dinner at a nice restaurant, and then they can return home the following day (or may decide to stay the weekend in town). We pay for travel, dinner, and the hotel, and try to communicate in our invitations that everything is quite low-stakes.",
          "author": "No-Heart-1454",
          "created": 1639590119,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hokzeny": {
      "link": "/r/AskAcademia/comments/rgeeqw/is_it_okay_to_email_researchers_using_similar/hokzeny/",
      "text": "Yep. I'm pretty responsive to code and data requests, as well as insights into what I've done. But please, for the love of god, don't send it from [ILovePorn696969@hotmail.com](mailto:ILovePorn696969@hotmail.com). Use your school account. \n\nI get way too many of those with cringeworthy e-mails...",
      "author": "EconomistPunter",
      "created": 1639528586,
      "upvotes": 1,
      "replies": {}
    },
    "hokkm2q": {
      "link": "/r/AskAcademia/comments/rgeeqw/is_it_okay_to_email_researchers_using_similar/hokkm2q/",
      "text": "It is fine to do this. Many researchers get more emails than they can respond to so do not take it personally if you do not get a reply. The more specific your email the better.",
      "author": "professorbix",
      "created": 1639521976,
      "upvotes": 0,
      "replies": {}
    }
  }
}