{
  "sid": "q4kobi",
  "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/",
  "title:": "Improving technical writing of non-native English speaking students",
  "text": "I’m a TT prof at an R1 and have a PhD student who is interested in pursuing academia. They have all the right motivation and technical ability but they are just, forgive my frankness, a God awful writer.\n\nI feel I’m letting this student down because I really don’t know how to teach writing to non-native speakers. Every year in my lab I give a couple presentations on scientific writing. And I work with this student week after week on their writing during our weekly meetings but nothing seems to move the needle.\n\nSo I’m looking for any tips or advice that could be helpful. I have plenty of funds to send the student to workshops or seminars or whatever will work.\n\nAnyone have success stories to share with similar experiences?",
  "author": "RadDadJr",
  "created": 1633783750,
  "updated": 1634078398,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 1.0,
  "comments": {
    "hfz6fzo": {
      "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hfz6fzo/",
      "text": "Most universities have workshops that help students with academic writing. These are geared towards grad students who work on writing their papers/ thesis under professional guidance. Since you are in an R1, your university probably has a few of these programs. You can ask your student to look for these programs and join them. I did this when I was a grad student and now I ask my students to do it too.",
      "author": "aaryal0",
      "created": 1633784189,
      "upvotes": 13,
      "replies": {
        "hfz813r": {
          "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hfz813r/",
          "text": "Thanks I’ll look into it. My own experience with University writing workshops as a PhD student was one that was led by an English lit grad student and really wasn’t relevant for technical writing.",
          "author": "RadDadJr",
          "created": 1633785090,
          "upvotes": 3,
          "replies": {
            "hg0jdio": {
              "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hg0jdio/",
              "text": "Great thought",
              "author": "HasbachAlex",
              "created": 1633807054,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hfzitqs": {
      "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hfzitqs/",
      "text": "One technique that has proven somewhat useful is to assign them reading (I usually tell them them to initially read 100 journal articles in earnest). When they begin scientific writing, if they are not a native English speaker, I tell them NOT to write using their own style/voice.  Rather, to imitate other successful authors’ styles.  Once they have published 3 journal papers, I think it is ok to use their own voice.\n\nThe success of the student and their development is highly dependent on their dedication, English proficiency, and overall intellect. Results vary wildly.",
      "author": "MarineProf",
      "created": 1633790636,
      "upvotes": 7,
      "replies": {}
    },
    "hg0a0x8": {
      "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hg0a0x8/",
      "text": "You may want to look at Swales and Feak's _Academic Writing for Graduate Students_, which is geared in part to non-native speakers.",
      "author": "herennius",
      "created": 1633802861,
      "upvotes": 5,
      "replies": {
        "hg0f8wp": {
          "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hg0f8wp/",
          "text": "Ordered!",
          "author": "RadDadJr",
          "created": 1633805203,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hg0k1uw": {
      "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hg0k1uw/",
      "text": "Is their English bad or is their writing bad? If it's actually that their English is bad then you may need to suggest additional language lessons. If it's that their writing is bad, stop focussing on the fact they aren't a native English speaker and focus on helping them structure and frame their writing, and how to develop an argument etc as you would with any native speaking student.",
      "author": "ACatGod",
      "created": 1633807356,
      "upvotes": 5,
      "replies": {
        "hg1kivj": {
          "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hg1kivj/",
          "text": "It’s really their English that is bad. They can communicate perfectly well, but it’s not up to a level that will cut it in a manuscript.\n\nMy own experience with foreign language though is that writing is easier than speaking since you have more time to think about how to say what you want to say. Doesn’t seem to be the case for this student.",
          "author": "RadDadJr",
          "created": 1633824092,
          "upvotes": 2,
          "replies": {
            "hg3li8c": {
              "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hg3li8c/",
              "text": "Then they need to improve their language skills and you need to be clear that's the issue. At the same time you probably need to accept that you're going to have to provide a lot of editorial support in the meantime.",
              "author": "ACatGod",
              "created": 1633871368,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hg02wc9": {
      "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hg02wc9/",
      "text": "Send them to the writing center at your university for a start. They usually have people dedicated to working with technical writers whose first language is not English.\n\nMy office bought a subscription to Grammarly to help our GRAs, and it seems to be helping them over time.",
      "author": "Greenmantle22",
      "created": 1633799753,
      "upvotes": 3,
      "replies": {}
    },
    "hg06yrt": {
      "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hg06yrt/",
      "text": "Many universities have “ English as a Second Language for Academics” just for this purpose.  It’s focused on foreign grad students and often encourages them to use or practice with relevant professional topics.",
      "author": "Decisionsota",
      "created": 1633801526,
      "upvotes": 2,
      "replies": {}
    },
    "hgbt50k": {
      "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hgbt50k/",
      "text": "I used to be an academic writing tutor and in my experience, most of my ESL students really struggled with definite and indefinite articles (the, a, an) and prepositions (as, at, by, etc). I found showing School House Rock videos and doing some very basic worksheets intended for grade school helped more than any college level type stuff - when students are struggling with basic concepts, you have to meet them where they are at, regardless of how silly it seems. The children’s activities were a fun way to introduce and practice concepts, and the School House Rock songs are really catchy. \n\nAlso, the students will absolutely hate it, but, having them read their essays out loud to you will increase their skills tenfold, regardless of their ESL status. It just seriously improves all types of writing for all individuals, because it forces you to read what you actually wrote, not let your brain correct it to what you meant to write. I used to tell my students on day 1 of tutoring, we will be reading all assignments out loud every day, and they literally all fought me on it, but I didn’t make it optional - it’s really important and without that skill, their writing won’t improve. Every single student over the years thanked me for that eventually and told me how much it helped.",
      "author": "I_can_get_loud_too",
      "created": 1634021960,
      "upvotes": 2,
      "replies": {}
    },
    "hg0j8uw": {
      "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hg0j8uw/",
      "text": "A brilliant idea to pursue",
      "author": "HasbachAlex",
      "created": 1633806995,
      "upvotes": 1,
      "replies": {}
    },
    "hg1if7n": {
      "link": "/r/AskAcademia/comments/q4kobi/improving_technical_writing_of_nonnative_english/hg1if7n/",
      "text": "Not particularly designed for non-native speakers, but search for “The Engineering Method of Technical Writing.”. You should find a guide for learners and a guide for teachers. In our R1 CS department, several non-native PhD students have gotten a lot of value from this course.",
      "author": "nrnrnr",
      "created": 1633823053,
      "upvotes": 1,
      "replies": {}
    }
  }
}