{
  "sid": "mds5c2",
  "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/",
  "title:": "trapped in the humanities—success elsewhere feels impossible",
  "text": "hi everyone! throwaway account. 4th year Phd candidate in English lit/communication studies. I’ll start off by saying, i come from a working class background in which anyone in the family going to grad school, regardless of discipline/field, was met with showers of unquestioned approval/“we’re so proud”/etc. i fully know that nobody twisted my arm to come to a program and field where the chances of getting a job afterward are so slim, but i also KNOW for a fact that academia propagandizes itself as a way to distinguish yourself among a sea of less credentialed competitors. anyway. \n\nI am absolutely miserable in my program, and in academia in general. nothing about it makes me happy or fulfilled at all other than my own research projects—but that is an increasingly lonely, unrewarding pursuit too. My “top 50” program is an absolute joke. i knew i didn’t really fit in super well here after just a semester but have really tried to chin up and make the best of it. But there’s things going on that feel downright neglectful, and not at all a product of me just being a “complainer”: i haven’t received a single word of feedback on the FIVE semester papers worth of more-than-full-time classes i was required  to take even as i came in with a masters. I also received about 2-5 sentences total of time & attention on the comprehensive exams i spent a whole semester completing. My comp exams were so insulting, i’ve never felt so isolated or uncared for in my life. Working myself to the bone for all these pointless check points, producing a paper i was really proud of, just to have my advisor respond “yes this looks fine.” \n\nI’m now trying to complete my dissertation but i’ve found no mentors and have almost zero feedback over the last four years to judge how i am progressing and if the claims im making are sound. It is incredibly isolating and depressing to be working from home, completely estranged from the sorry excuse for “community” academia can muster, and basically having to beg my advisors to pay a moments attention to my pursuits. I’ve gone the entire semester now without hearing from my dis. chair, even after multiple, multiple emails both to her directly and to administrative people in my dept to make sure she still even freaking works here. \n\nSome of this might be completely standard for academia, and more power to it—i just don’t want to be apart of it any longer. But especially coming from an exceptionally undervalued and underfunded part of the humanities and with no savings to hold me over if i don’t find a job, i feel completely trapped. There’s nothing on my resume that is applicable to stuff outside of teaching and waiting tables, lol, and i don’t feel adequately credentialed to be a competitive candidate for teaching jobs.\n\nHas anyone left academia/the humanities, even temporarily, with a pretty tiny resume? Is the world as cruel and punishing as i expect it to be if i leave a degree? I have 8 semesters of experience instructing independent sections (i.e i am the instructor on record, not working under someone tenured) if that helps. any responses at all are super helpful. Thank you for reading :)",
  "author": "rivers_roads_____",
  "created": 1616775256,
  "updated": 1634081294,
  "over_18": false,
  "upvotes": 146,
  "upvote_ratio": 0.99,
  "comments": {
    "gsby75h": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsby75h/",
      "text": "Rhetoric/Composition person here. I know a couple of people who left academia to do other stuff. To be honest, it's hard. A lot of people I know are over-educated for what they do. One person went back for an MA in Education and got a teaching certificate, and is now in the public high schools. Another person went into copy writing and now works for a marketing firm. Another person opened a restaurant. So, you can kind of see that it's all over the place in terms of using the training/degree.\n\nThat said, to be brutally honest I would finish out the degree in your place. You might find more happiness actually working once you get away from your institution. And if you're ABD, you're really close to done. I personally think it looks better on your resume to have the degree rather than not. I don't know if either one of those factors would sway me individually, but together I think they're enough that I probably would finish out the dissertation unless I thought things were going really badly and/or I had an abusive committee chair.\n\nI'm sorry. It's a damn hard life.",
      "author": "Ethan-Wakefield",
      "created": 1616789379,
      "upvotes": 37,
      "replies": {}
    },
    "gsbvd39": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbvd39/",
      "text": "Re: mentorship. Have you tried reaching out to other faculty members in your dept or even in other fields related to your diss topic (someone who works in the same time period/region/methodology in history/theater/etc)? I have a stable of 3-4 people to call on for different needs, one for teaching help, one for career advice, one for writing/editing help. I realize everyone is busy but I can’t imagine people not be amenable to you making a 20 minute appointment during their office hours. You just might need to seek out more than person to get all the mentoring you need.\n\nRe: alt-ac jobs, I’m in art history so there is a pretty strong grad school to museum work pipeline, so I may be biased but have you considered museums or non-profits? They always need good comms people, most of the staff has grad degrees, and they might provide the intellectual stimulation you crave. Maybe consider doing an internship at one now to feel it out?",
      "author": "artemisiamorisot",
      "created": 1616788299,
      "upvotes": 19,
      "replies": {
        "gsc05y5": {
          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsc05y5/",
          "text": "+1 on reaching out beyond the dept and field. The most heartfelt dissertation acknowledgments I've read/heard were always to that kind of mentor. Beyond the opportunity to stretch one's brain beyond the strictures of a discipline, I get the sense those outside mentors just get to enjoy you and your work...they're not tied to you the way a dissertation advisor is.",
          "author": "dcgrey",
          "created": 1616790123,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "gsbyypu": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbyypu/",
      "text": "If what you say is true and there are no other pertinent details you’ve left out then your program is badly dysfunctional.\n\nThere’s no shame in leaving if that’s what you want to do.",
      "author": "TakeOffYourMask",
      "created": 1616789667,
      "upvotes": 17,
      "replies": {}
    },
    "gsbokoi": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbokoi/",
      "text": "Sounds miserable and, moreover, like it's not going to get less miserable any time soon. \n\nA few quick thoughts: that seems to me like an exceptionally low amount of feedback. That either means there's something wrong with your work or something wrong with your program or both. \n\nNote that there is not really any such thing as a \"top 50\" English program -- most of the desirable jobs are going to people from 25 programs, with a lot more going to the top 10 of those than the bottom ten. And typically, there are signs early on that your department thinks you are a top candidate who will do well on the market -- you will be getting feedback, encouragement, invitations, etc., as well as fellowships to release you from teaching. If you have 8 semesters of experience as an instructor of record and are in your 4th year ... do you even have fellowship years? It sounds like you may not have the kind of funding package required to be competitive on a job market. \n\nIn terms of resume -- I think you are mistaken in assuming that white collar jobs require some sort of specialized background in the American labor market. You are presumably much better than the average American at reading, writing, and analyzing, which are all skills that you can easily parlay into an entry-level position at lots of companies.",
      "author": "Lonelobo",
      "created": 1616785730,
      "upvotes": 83,
      "replies": {
        "gscg5rz": {
          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gscg5rz/",
          "text": "> If you have 8 semesters of experience as an instructor of record and are in your 4th year ... do you even have fellowship years? It sounds like you may not have the kind of funding package required to be competitive on a job market. \n\nNot all programs -- especially public universities -- can afford straight up 'fellowship years'. I am about to become ABD have an extensive teaching record (6+ classes of teacher on record) and I was told that this is a good thing for the market. Can you elaborate on why this may *not* be a good thing?",
          "author": "hillsonn",
          "created": 1616796413,
          "upvotes": 24,
          "replies": {
            "gsd933u": {
              "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsd933u/",
              "text": "Sure, there's lots of programs that can't afford you the trappings of a good PhD experience - and that's an argument to not attend those programs, not an argument to subsidize those programs with your stiffly underpaid labor.\n\n> Can you elaborate on why this may not be a good thing?\n\nIf you have to teach, you have less time to devote to research. There's an assumption in academia that people who have more time to do research produce stronger research, and stronger research means they're more likely to find a job. There's also an argument that programs that have you teaching every semester that you're there are exploiting your labor while selling you an impossible dream.",
              "author": "thegreenaquarium",
              "created": 1616808929,
              "upvotes": 9,
              "replies": {
                "gsdvd9b": {
                  "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsdvd9b/",
                  "text": ">There's also an argument that programs that have you teaching every semester that you're there are exploiting your labor while selling you an impossible dream.\n\nI would argue that while the situation is somewhat better at institutions with fellowship years, these programs' primary purpose is still to exploit your labor rather than to prepare you for a career in academia. If this weren't the case, these programs would not be consistently admitting more candidates than they can realistically place in good positions.\n\n(The number of people from my department who are currently on the market is close to the total number of TT jobs in my field on the U.S. market. Admittedly, this has been a particularly bad year, but still...that's not a good look.)",
                  "author": "possiblegirl",
                  "created": 1616820359,
                  "upvotes": 5,
                  "replies": {
                    "gsgdkhi": {
                      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsgdkhi/",
                      "text": "I don't think \"no ethical consumption under capitalism\"-esque points are a useful addition to this discourse. We are a priori in this system ( as we chose); the only useful distinction is between programs that give you more tools to succeed in the very rough job market vs programs that give you fewer such tools. If you feel that that's not enough of a distinction for you - that's a great argument for leaving the academy imo.",
                      "author": "thegreenaquarium",
                      "created": 1616856475,
                      "upvotes": 1,
                      "replies": {
                        "gsgwpkz": {
                          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsgwpkz/",
                          "text": "I'm not denying that it's a useful distinction, but I think it's important to acknowledge that this is a distinction in degree, not kind.\n\nI'm also not sure that this issue is best understood through the \"no ethical consumption under capitalism\" analogy. There are pretty significant structural differences between labor and consumption (even if sometimes these fields are blurred under late capitalism). Even with protections for organized labor being steadily eroded, a strike still looks different from a boycott.\n\nTo be clear, I'm not suggesting that no one should enter academia. Exploitative labor practices are certainly not unique to academia, and for some, a humanities PhD program may be the best choice given their priorities, means, and other options. But I don't think it does anyone any favors to minimize the degree to which grad programs (including at elite schools) depend upon an economy of precarity.",
                          "author": "possiblegirl",
                          "created": 1616862660,
                          "upvotes": 3,
                          "replies": {
                            "gsh5ea7": {
                              "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsh5ea7/",
                              "text": "> analogy.\n\nI'm using it as an anology of tone, not an analogy of meaning. Sorry if that wasn't clear. I just don't think it's useful to pontificate about how the system is exploitative when we are always already in the system. It's much more useful, for actual people who have to live their lives in the conditions they can't change, to focus on the difference between institutions that exploit their labor and give them something for it and institutions that exploit their labor and sell them a lie.",
                              "author": "thegreenaquarium",
                              "created": 1616864818,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gsd9ka4": {
              "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsd9ka4/",
              "text": ">Not all programs -- especially public universities -- can afford straight up 'fellowship years'. \n\nThe truth is, if you are in a program that \"cannot afford\" fellowship years, then you are probably not in a competitive program. This has nothing to do with public/non-public: Berkeley, Michigan, UVA, UCLA, etc. all offer competitive stipends. Also, the idea that a program \"cannot afford\" fellowship years is a bit like a diner in an American restaurant who says thanks for the meal, but that they \"cannot afford\" to leave a tip. If you can't afford to offer fellowship years, you shouldn't be taking PhD students.  \n\nI could be wrong -- I don't even know your field -- but are most/some/any graduates of your program getting placed in TT jobs at schools you would like to work at? \n\nIn terms of why, there are 2 parts. \n\nFirst, no one running a humanities job search is looking to hire the world's greatest teacher -- they are looking to hire the world's great enough teacher. Having 0-1 classes as instructor of record is a major strike, because it means that you will likely need a lot of handholding from your colleagues and may still be bad at it, causing them aggravation and extra work. At a certain point, however, you encounter diminishing marginal returns. It makes no real difference to a search committee if you've taught 5 classes or 50, provided your teaching evals are positive (and they always are).\n\nThe second part is: you have 6 classes as teacher of record, but those come at a cost -- research and publications. Lots of searches a) want a candidate with evidence of a robust research agenda and b) need some criterion to distinguish 50+ candidates from one another so that they can winnow down the pool. (Everyone has great teaching evals, great LoRs, etc.). So they use pedigree and publications: are you in a strong and well-known graduate program? Has your work appeared in well-known journals? \n\nIf you can teach 6+ classes as instructor of record before you are ABD, have publications in Critical Inquiry and Representations, are finishing in <8 years from start of MA to end of PhD, and can talk comfortably about trends in contemporary fiction, then yeah, you're fine. If not, it's because there's a compromise involved in what you do with your time in graduate school.",
              "author": "Lonelobo",
              "created": 1616809145,
              "upvotes": 8,
              "replies": {
                "gsdohzc": {
                  "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsdohzc/",
                  "text": "A lot of what you write is true for schools hiring that have masters and PhD programs. But liberal arts and regional state schools value teaching and service as much as research. They expect someone to come into a 4/4 load with three different preps a semester and not need to be trained on how to keep up. They aren’t interested in someone who spent the last 1-2 years on fellowship who doesn’t know how to balance a heavy teaching load, a dozen service commitments, and still be able to produce scholarship.",
                  "author": "mylifeisprettyplain",
                  "created": 1616816380,
                  "upvotes": 6,
                  "replies": {}
                },
                "gsra4ap": {
                  "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsra4ap/",
                  "text": "> At a certain point, however, you encounter diminishing marginal returns. It makes no real difference to a search committee if you've taught 5 classes or 50, provided your teaching evals are positive (and they always are).\n\nI call it the \"teaching experience trap,\" many ABDs think they're proving themselves teaching class after class. \"Just one more class and then I'll be able to finish the dissertation\" is usually how that mindset goes. And it's a trap. Institutions look for evidence of an active and fruitful research program. \n\nI had a discussion with a younger grad student in the waning months of my MA about this exact topic. He tried to argue that a senior grad student was better prepared for the job market than an Ivy graduate who published multiple articles in some of the top journals of my field. The senior grad student had taught multiple classes, while the Ivy grad had won a prestigious postdoc and currently worked as a VAP. Well, no shock, the Ivy graduate got a top R1 job (and an offer from my own department). The senior grad student is now in her 9th year. \n\nPut another way: you can outpublish an average teaching record. You can't out teach a bad publishing record.",
                  "author": "psstein",
                  "created": 1617070106,
                  "upvotes": 1,
                  "replies": {
                    "gsrcbca": {
                      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsrcbca/",
                      "text": ">\"Just one more class and then I'll be able to finish the dissertation\" is usually how that mindset goes.\n\nI think a remarkable amount of grad student thinking is coming up with creative ways of explaining why you aren't just working on finishing your diss.\n\nI get it -- it's hard! But all it really takes is being on the other side of the table for 1 or 2 job searches and so much becomes clear that you simply couldn't see as a grad student (and thus were able to delude yourself about).",
                      "author": "Lonelobo",
                      "created": 1617071321,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gscwiab": {
          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gscwiab/",
          "text": ">In terms of resume -- I think you are mistaken in assuming that white collar jobs require some sort of specialized background in the American labor market. You are presumably much better than the average American at reading, writing, and analyzing, which are all skills that you can easily parlay into an entry-level position at lots of companies.\n\nIn my experience as a humanities PhD candidate looking for jobs outside academia, truly entry level positions are frustratingly few and far between. Many jobs listed as \"entry level\" actually want internship experience, experience with industry-specific skills, or \"1-2 years experience\" in the industry. In some ways, I feel like I'm in a worse position now than I would be in if I were graduating with a BA in the same field; at least colleges often provide structured internship opportunities for students. Ageism can also be a thing and [can start as early as one's 30's](https://www.pbs.org/newshour/economy/age-discrimination-in-the-workplace-starts-as-early-as-35).",
          "author": "possiblegirl",
          "created": 1616803350,
          "upvotes": 10,
          "replies": {
            "gsd9l2m": {
              "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsd9l2m/",
              "text": "> at least colleges often provide structured internship opportunities for students\n\nI wouldn't rely on this crutch. Sure, sometimes colleges provide structured internship opportunities (which might not be in what you want to do, or which you might not get), but the overwhelming majority of students find their own internships. At best, the college's support extends to including your resume in a pool.\n\nAlso, if you are a current student, you are likely eligible to use your school's career office. These structured internship opportunities may be accessible to you too.",
              "author": "thegreenaquarium",
              "created": 1616809155,
              "upvotes": 0,
              "replies": {
                "gsdtbgb": {
                  "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsdtbgb/",
                  "text": "Yeah, this is a fair point, and I may well be engaging in some 'grass is greener' thinking here. (I definitely didn't take advantage of internship opportunities in undergrad, which I now regret.)\n\nThat being said, I do think that--regardless of the level of formal institutional support--internships are seen as part of the typical career/study path during an undergraduate degree. This is not the case in a PhD program. I have used my school's career office, and there are some internship opportunities available to PhD students, but many more that are specifically targeted to undergraduates. Moreover it's likely that your advisor will discourage you from pursuing inernships because they'll see it as taking time away from your research/teaching work.\n\nLikewise, none of the several humanities alt-ac workshops I've attended provided much in the way of concrete guidance as to what steps one should take during the PhD in order to identify and pursue a non-academic career path. Sure, you can make the argument that we shouldn't need to be spoon-fed...all I know is that the kind of career support I see the undergraduates I teach receiving looks very different from what my colleagues and I are getting.\n\nIMO, humanities PhD programs do a fair-to-good job at preparing you for an academic career--as long as you can get one.... But they do very little to prepare you for any other kind of career path. Whether or not they should is debatable; you can make the argument that the entire purpose of a PhD program is to prepare people for academic jobs. Personally, I think with the reality of the humanities job market--where even people getting degrees from elite institutions often spend several years and make many compromises in order to finally land a TT job (and a non-trivial number of people never find a TT job at all)--non-academic career paths should be treated as more than an afterthought.",
                  "author": "possiblegirl",
                  "created": 1616818981,
                  "upvotes": 3,
                  "replies": {
                    "gshgcuc": {
                      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gshgcuc/",
                      "text": "I'm not saying that you're saying something inaccurate, but that this reality isn't any harder, in a pareto sense, on PhD students than it is on undergrads, master's students, stay at home moms trying to enter the workforce, laid off 40 year olds... PhDs moving into alt-ac definitely have their unique challenges (just like all groups have their unique challenges), but the challenge of finding something you like and demonstrating your competency in it when your experience doesn't look like the perfect applicant's isn't somehow going to be much harder for you because you have a PhD.\n\n> \nIMO, humanities PhD programs do a fair-to-good job at preparing you for an academic career--as long as you can get one.... But they do very little to prepare you for any other kind of career path.\n\nBut they're not supposed to prepare you for another career path though? Like, even programs in disciplines that have robust industry opportunities don't prepare you for said opportunities, largely because the work itself borrows a lot from academic work, so the necessary preparation is mostly telling students that these jobs exist and they should apply. That's not the situation in fields without industry opps, but that's probably an argument for not getting that PhD, not for your professors to teach you how to get jobs in fields they know nothing about (not least because their advice by that token is worthless). A PhD isn't an extension of undergrad or an opportunity to prepare yourself for the \"real world\". I kind of get why you think it should also provide general professionalization services, but it doesn't. If you don't want to be a professor, just don't go.\n\nOn that note, this is why I kind of side-eye this whole alt-ac thing, especially when it's used to sell people on a humanities PhD. I remember it starting as a way to help people who were already stuck and hopeless find jobs outside the academy, but it morphed into yet another way to justify the recruitment of starry eyed young people into a dying career. The transferable skills you learn in a humanities PhD can be learned on the job or in a professional master's. If you don't get an academic position, getting paid to study some obscure thing you love is the only reward.\n\nAnyway, to answer your actual question, I think you're overstating the power/necessity of career counseling. The quality of career counseling across the board is pretty shit (source: Askamanager), and the good career counseling mostly applies to specific careers, like consulting, at specific companies, like whatever consulting company your school is a target for. Everyone else, undergrads included, is finding their own opportunities and figuring out their life paths on their own, through doing scary shit like getting out of their comfort zone, trying new things, reaching out to people, and being like, I don't know what it's going to be like and I don't know if I'll be successful but I'm doing it anyway. Candidly, a lot of the PhDs I meet (particularly K-PhD) are in their program because they were too scared to look for a job senior year. A lot of undergrads feel like you do. You all are staring down an unfamiliar environment that no type of school, K-12, undergrad, postgrad, prepares you for. And if you really like school, staring down the prospect of starting over after 20+ years of being told you're amazing by your teachers is terrifying. But ime, the people who navigate this successfully make the choice to jump into the deep end and deal with the discomfort for a while. Or they don't navigate it at all.",
                      "author": "thegreenaquarium",
                      "created": 1616867782,
                      "upvotes": 1,
                      "replies": {
                        "gsrazbs": {
                          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsrazbs/",
                          "text": "> On that note, this is why I kind of side-eye this whole alt-ac thing, especially when it's used to sell people on a humanities PhD. I remember it starting as a way to help people who were already stuck and hopeless find jobs outside the academy, but it morphed into yet another way to justify the recruitment of starry eyed young people into a dying career. The transferable skills you learn in a humanities PhD can be learned on the job or in a professional master's. If you don't get an academic position, getting paid to study some obscure thing you love is the only reward.\n\nThis, 100 times over. It's a farce that lets admins and faculty sleep at night. I wish I'd known about my present career (healthcare consulting) while still in college, because I would've gladly done this rather than slogging my way through a MA I hated every single second of.",
                          "author": "psstein",
                          "created": 1617070582,
                          "upvotes": 2,
                          "replies": {
                            "gsrfo6q": {
                              "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsrfo6q/",
                              "text": "> I wish I'd known about my present career (healthcare consulting)\n\nThat's not really realistic as a general solution tbh. There's millions of careers out there, some of which didn't exist a year ago. I don't think the solution lies in spoonfeeding students more content.\n\nI think the proximate cause is that particularly high-achieving students are very comfortable succeeding in this rigid academic structure that they've grown accustomed to over 16 years, so finding a job in the \"real world\" is outside their comfort zone (plus, some of us perhaps naturally are less able to succeed in an ambiguous environment that doesn't have a grading rubric).",
                              "author": "thegreenaquarium",
                              "created": 1617073242,
                              "upvotes": 1,
                              "replies": {
                                "gsrgquh": {
                                  "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsrgquh/",
                                  "text": "Yes, I agree with that.\n\nI think one of the issues, however, is that humanities grads tend to have a very impoverished view of careers. Far too many think that the only options are law school, grad school, or education.",
                                  "author": "psstein",
                                  "created": 1617073876,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gsrahm8": {
                      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsrahm8/",
                      "text": "> Likewise, none of the several humanities alt-ac workshops I've attended provided much in the way of concrete guidance as to what steps one should take during the PhD in order to identify and pursue a non-academic career path.\n\nThe dirty secret is that \"alt-ac\" is a farce. It's designed to make programs/faculty feel better that their students are gainfully employed after they've been exploited as cheap labor. \n\nMost of the jobs that programs sell for \"alt-ac\" are jobs you can hold with a PhD, not ones you need a PhD to hold.",
                      "author": "psstein",
                      "created": 1617070310,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gsbpxn6": {
          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbpxn6/",
          "text": "thanks—i put top 50 in quotes for that very reason, lol. \ni don’t know a single person in my department who had received the kind of feedback you allude to, and frankly i don’t know anyone in my discipline, even at the top-3 ivy level who get that kind of support. usually i see people succeeding in that way in more funded fields where the faculty aren’t stretched so miserably thin all the time. all that just to say, the lack of feedback feels like it has little to do with my own work—it feels systemic, and to have gotten 10x worse during the pandemic.  I have so many years of experience because i did a 3-year masters before this. i’ve been on two fellowship years at my current program.\n\nthanks for the info, and that is good to know about jobs in the ~outside world!!!",
          "author": "rivers_roads_____",
          "created": 1616786265,
          "upvotes": 15,
          "replies": {
            "gsbri5d": {
              "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbri5d/",
              "text": ">i don’t know a single person in my department who had received the kind of feedback you allude to, and frankly i don’t know anyone in my discipline, even at the top-3 ivy level who get that kind of support.\n\nAt the risk of being super blunt: Either some people you know are not being honest with you, or you don't know anyone who is going to end up with a TT job. \n\nThere are systemic problems with grad student advising in the humanities, and lots of faculty are grossly negligent in this regard (and grad students also contribute by being unable or unwilling to hear the kind of feedback that their advisors could give them), but what you are describing are clear signs of the way advisors interact with students that they do not think will go on to academic careers. No news is not good news when you are a grad student.",
              "author": "Lonelobo",
              "created": 1616786848,
              "upvotes": 44,
              "replies": {
                "gscfesd": {
                  "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gscfesd/",
                  "text": "As a science PhD this makes shocking reading. I have daily contact with my supervisor and weekly with my co-supervisor. All feedback is prompt and thorough, why is is like this in the humanities?",
                  "author": "mchugho",
                  "created": 1616796109,
                  "upvotes": 20,
                  "replies": {
                    "gscifra": {
                      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gscifra/",
                      "text": "$$$. We in the sciences/engineering rely on graduate students to accomplish *any* research. My students success is my success. I get grants based not on my work, but the productivity of my students. My job is to make sure they have the tools they need to succeed, not to ever actually do any hands on research of my own. If the students are wasting their time, they're wasting my grant money. It's a great symbiosis that ensures that I want my students to succeed as quickly and cheaply as possible, which means prompt, clear feedback.",
                      "author": "downsideleft",
                      "created": 1616797350,
                      "upvotes": 28,
                      "replies": {}
                    },
                    "gsda7u9": {
                      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsda7u9/",
                      "text": ">. I have daily contact with my supervisor and weekly with my co-supervisor. All feedback is prompt and thorough, why is is like this in the humanities?\n\nWell, what do you imagine that a humanities PhD does from one day to the next?\n\nEdit: this is being downvoted, but I mean it as a serious point. At first glance, this struck me as simply the result of a real misunderstanding of what a humanities PhD is and what one does during it. What would one write to one's advisor? \n>March 26, 2021. Read 10 pages in the Phenomenology of Spirit several times. Tried to both understand the original argument and come up with unique, creative insights, or unsuspected analogies to its historical context. Failed on all fronts. Will try again tomorrow.   \nPS Have you ever read this?\n\nThen, on second thought, it struck me that maybe it is a productive misunderstanding: what if we actually DID try in the humanities to make progress in such a way that daily contact with one's advisor would be a meaningful exchange? Imagine how that would change what you do!",
                      "author": "Lonelobo",
                      "created": 1616809430,
                      "upvotes": 6,
                      "replies": {
                        "gsdrcjl": {
                          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsdrcjl/",
                          "text": "That's actually roughly what it's like, at least in my field. My check-ins with my advisor were like, \"I made this plot of preliminary results on this tiny aspect of the project, what do you think?\" and \"I read this thing in this paper but don't get it, can you explain?\" and \"should we apply for this conference or would you rather save the money/time?\"",
                          "author": "pb-pretzels",
                          "created": 1616817939,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gsbt5pg": {
                  "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbt5pg/",
                  "text": "i mean, i’m not saying you’re not correct—i very much know that this is a thing. i am just noting that this is precisely why i want to get out of this area. it’s disgusting to me that this is how this all plays out, and i think that the “best” level of support i saw my currently TT friends receive is absolutely insulting relative to the effort they put forth. i sort of knew all of this going in, but being a first gen grad student you don’t *really* know until you’ve lived it.",
                  "author": "rivers_roads_____",
                  "created": 1616787464,
                  "upvotes": 10,
                  "replies": {}
                },
                "gsgcqj9": {
                  "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsgcqj9/",
                  "text": "Unfortunately, this is very much how it is in the performing arts as well. Those that show promise (in the eyes of the faculty) are given tons of support. Those that don’t are typically neglected and just pushed through the program to keep completion numbers high.",
                  "author": "GoldenBrahms",
                  "created": 1616856035,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gsbsamh": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbsamh/",
      "text": "That's pretty much exactly how my top-10 humanities Ph.D. went. Everyone they admitted was already a capable writer, so zero feedback on papers. Comps were graded by a field committee, so I got a paragraph back on each of four 8-page essays. My diss defense was largely a conversation about how to revise it for the book to come.  TBH, I got the most \"mentoring\" and formal feedback from a law professor I took some electives from...she was happy to have a Ph.D. student in her 3rd year law electives because I was there out of interest rather than obligation. What you've experienced OP is pretty much what all of my friends did in the 1990s-- though my chair and committee were friendly and happy to talk anytime I wanted to. In reality, I moved 1,500 miles away as soon as I was ABD, took a full-time teaching position, and wrote my diss on the weekends.\n\n\"Has anyone left,\" you know the answer is of course. In fact, of my huge Ph.D. cohort only about 10% ever finished and <5% of us have had traditional academic careers. Of that 90% who didn't finish I have friends who went in all sorts of directions...some taught at private high schools, some at community colleges, some went to work for Amazon (this was the 90s, so not in the warehouse, but at HQ), some are in publishing, many work for the government (feds especially), some went into business, etc. etc. The skills you developed reading and writing all those papers are useful, you just have to find your niche.\n\nBetter to get our now, though, than drag it along for years if you don't want to. The academic market is insane now and there's little chance someone who is halfhearted and coming from a \"top 50\" program is going to have many options in academia. If you don't want to work with college students, don't. Instead get some help (career center?) on how to pitch your fairly extensive/polished skills for other markets and get out there.",
      "author": "SnowblindAlbino",
      "created": 1616787144,
      "upvotes": 36,
      "replies": {}
    },
    "gsccndl": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsccndl/",
      "text": "1) I'm assuming your tuition is covered, so I'd start experimenting with taking classes in other departments that have a more direct non-academic career path.  This might include:\n\n* Technical writing\n* Library Science\n* Human Computer Interaction (look at UX Writing or Content Strategist job)\n* Marketing \n* Public Administration\n* Museum Studies\n\nI had a friend that took so many Library Science courses, that he only had to pay for 1 semester after he finished his PhD to get a Library Science degree.  To be clear some of the above still have VERY competitive job markets, but it at least gives you options and lets you build some more skills. \n\n2) Start applying for internships, you need to get over the catch 22 of \"need experience to get experience\".  You are going to have to cast a wide net, but start looking around.\n\n3) More than a few PhDs end up working at universities in admin roles.  Not as much \"glamour\", but pretty good job stability.  Start networking now and figure out what you need to have in place to get a job as an \"academic program coordinator\" or \"director of student affairs\"",
      "author": "Ethnographic",
      "created": 1616794981,
      "upvotes": 11,
      "replies": {}
    },
    "gscu1hc": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gscu1hc/",
      "text": ">i come from a working class background in which anyone in the family  going to grad school, regardless of discipline/field, was met with  showers of unquestioned approval/“we’re so proud”/etc.\n\n...\n\n>But especially coming from an exceptionally undervalued and underfunded  part of the humanities and with no savings to hold me over if i don’t  find a job, i feel completely trapped. There’s nothing on my resume that  is applicable to stuff outside of teaching and waiting tables, lol, and  i don’t feel adequately credentialed to be a competitive candidate for  teaching jobs.\n\nJust wanted to say that I strongly relate to this, and it sucks. I'm in my finishing year of a humanities PhD at a prestigious institution, and so far my best job prospect is an 18 hr/week job pays $14/hour to help run an after-school literacy program. I think after-school literacy is super important, but that's clearly not enough to live on (even in the low COL area I'm currently in), and it's not a lot more than I made during my high-school job 15 years ago. I'm looking at doing some freelance tutoring and/or proofreading to supplement this, but it's a frustrating situation.\n\nMy parents seem heartbroken when I talk to them about the job market, and in turn that makes me incredibly sad (I'm tearing up just writing this sentence). They truly believed that my degree was going to allow me to have a level of career stability/prestige that they never were able to have, and I think their disillusionment is in some ways harder for me to process than my own. \n\nSomething that I think also gets missed in many discussions of the humanities job market is how much financial resources it takes to be able to manage the precarity of adjuncting or (if you're lucky!) short-term VAP's/post-docs. I've spent the last several months trying to figure out if I qualify for unemployment (probably not) and how to deal with the fact that my student health insurance will end in July, with very little support, and I know that uncertainty has affected the time/energy I have to give to both finishing my dissertation and job searching. \n\nI ended up being able to take out a private student loan that gave me some excess money to put in \"savings,\" which has made this situation feel slightly less immediately dire, but it's obviously not an ideal solution. I'm planning to read through *Leaving Academia: A Practical Guide* in the hopes that it will give me some useful advice. (If you'd like a pdf, let me know and I'd be happy to send one.) I've also been working with a career counselor at my university, which has been helpful in terms of developing my resume and LinkedIn profiles--though I still haven't had much in the way of success as far as outcomes go. \n\nI have also realized that I feel incredibly out-of-place in corporate environments (probably partly a class thing, partly a disposition thing), which I think is part of the reason I went into academia in the first place. As much as I try to shake this feeling, I still have this gut feeling of not belonging when I browse a lot of company websites/LinkedIn profiles, which I don't think is helping my confidence in the job search. I also hate how much academics sometimes make it seem like finding a non-academic job is a *fait accompli*.\n\nAnyway, I really hope something works out for you and that you're able to find some clarity about whether sticking it out in your program or leaving is the right choice for you. Until then, solidarity and feel free to PM me if you ever want to talk more.",
      "author": "possiblegirl",
      "created": 1616802267,
      "upvotes": 8,
      "replies": {}
    },
    "gscjbuc": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gscjbuc/",
      "text": "Your first paragraph is incredibly understated in academia. There’s a rampant problem of false advertising in a way no private industry could easily get away with.",
      "author": "NikeSpeltBackwards",
      "created": 1616797716,
      "upvotes": 7,
      "replies": {}
    },
    "gsc4t7z": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsc4t7z/",
      "text": "[deleted]",
      "author": null,
      "created": 1616791886,
      "upvotes": 5,
      "replies": {
        "gsdiw3v": {
          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsdiw3v/",
          "text": "You got a job teaching CS (to undergraduates?) without any relevant degree or formal work experience in the field?",
          "author": "dowcet",
          "created": 1616813454,
          "upvotes": 2,
          "replies": {
            "gsdu2pw": {
              "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsdu2pw/",
              "text": "Computer science doctoral degree holders can make *way* more money in industry than in academia, so there's actually a shortage of CS professors, especially ones that want to teach introductory CS courses. They often hire people with less experience to teach, especially programming.",
              "author": "roseofjuly",
              "created": 1616819432,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gsc71u7": {
          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsc71u7/",
          "text": "Congrats! Did you have any kind of STEM background prior to leaving and teaching yourself CS? Do you ever find yourself longing to return to the humanities, or doing hobby projects to satiate that side of you, or is that a closed chapter in your life at this point?",
          "author": "AlliumoftheKnife",
          "created": 1616792743,
          "upvotes": 1,
          "replies": {
            "gscb579": {
              "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gscb579/",
              "text": "[deleted]",
              "author": null,
              "created": 1616794378,
              "upvotes": 7,
              "replies": {
                "gscd8kx": {
                  "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gscd8kx/",
                  "text": "That's awesome! Unfortunately I shifted from the social sciences to lit, which often feels like the least practically applicable humanities field, but it's always heartening to hear about folks who are able to translate their skills into parallel areas in industry.\n\nYour new career path sounds quite rewarding; thank you for sharing it!",
                  "author": "AlliumoftheKnife",
                  "created": 1616795226,
                  "upvotes": 3,
                  "replies": {
                    "gsch8ez": {
                      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsch8ez/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1616796853,
                      "upvotes": 3,
                      "replies": {
                        "gsdub1t": {
                          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsdub1t/",
                          "text": "This is it, right here. I'm not saying that leaving is easy, but I *have* often observed that some folks' struggles with finding a new field to go to is limiting their search to things that seem directly related to their work in graduate school. The field I moved to is technically in the same broad field by very different from what I studied in graduate school, but I applied my learning and skills from the doctoral program to learning the new area.\n\nDoctoral degree holders know how to learn, and learn fast. That's the most valuable skill we have, honestly - that plus communication skills.",
                          "author": "roseofjuly",
                          "created": 1616819596,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gsbkn6p": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbkn6p/",
      "text": "Are you close with any recent graduates?  Or with professors from your undergrad or Master's program?  They might be able to give you advice that's more specific to your situation.  You can also check out [The Professor Is In](https://theprofessorisin.com/).  She has a lot of stuff on the non-academic/post-ac job world.",
      "author": "hello_kitteh",
      "created": 1616784043,
      "upvotes": 12,
      "replies": {
        "gsbprl6": {
          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbprl6/",
          "text": "About the Professor Is In – her freely available info is solid, but don’t pay for any additional services. It’s overpriced for the speed and depth of feedback you receive (based on my experience and a few other friends from grad school).",
          "author": "scrumblejumbles",
          "created": 1616786199,
          "upvotes": 27,
          "replies": {}
        },
        "gsbqk1t": {
          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbqk1t/",
          "text": "i’ve been in  school straight since kindergarten with no breaks, and for a lot of that time i’ve been trying to be “competitive,” so a lot of my friends and contacts are people who really believe in the vision of academia, even as it still stands. people who have done well and have been largely rewarded by academia. they can and have listened and supported me, but they are not people who have ever even dreamed of leaving—or who have paid any attention to the job market outside of it. and then my friends outside of academia think i’m nuts for ever having entered it to begin with, ha. i often feel like i hear 1 million stories about STEM or social science folks leaving academia to an amazing job, but those stories seem to never pop up for us english lit folks. thank you for the link, i will check it out",
          "author": "rivers_roads_____",
          "created": 1616786493,
          "upvotes": 6,
          "replies": {
            "gsbss5q": {
              "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbss5q/",
              "text": "> i often feel like i hear 1 million stories about STEM or social science folks leaving academia to an amazing job, but those stories seem to never pop up for us english lit folks.\n\nThat's because there are 95% fewer proportionally-- there is no \"industry path\" in the humanities, not even into publishing. But that doesn't mean there aren't jobs that are good fits for your skillset. I assume the MLA has resources on non-academic employment? I'm a historian and the AHA has been on this for many years now. The skills developed by grads in the humanities are very valuable, but you aren't likely to find many job postings saying \"Wanted: former humanities Ph.D. student, must be ABD.\" You have to go looking for them more aggressively than a STEM grad would.",
              "author": "SnowblindAlbino",
              "created": 1616787324,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "gsc2by5": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsc2by5/",
      "text": "With four years in you may as well finish.  Try not to care too much about your dissertation (no one else will), just write is as fast as possible.  If you get lucky and land a tt job awesome.  If not, at least you’ve got that PhD which will earn you more as a hs teacher or in any government job.  I had a similar experience and you shouldn’t feel like you’re missing something or going crazy.  The system of higher ed in America is badly badly broken; welcome to the casualty list and try to make the best of it.",
      "author": "mbfunke",
      "created": 1616790946,
      "upvotes": 4,
      "replies": {}
    },
    "gsccra5": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsccra5/",
      "text": "Zero feedback? I have no idea what my programs were ranked, but I received tons of feedback and constant interaction with faculty and advisors in the English programs I attended. Sorry to hear about your experiences.\n\n\"There’s nothing on my resume that is applicable to stuff outside of teaching and waiting tables\"\n\nI mean... anything that involves communication, teaching, or research is where I would start. Non-profits, sales, marketing, and customer relations-type things. Depending on your experience and interest, you could look into the publishing industry (editing, copywriting, agenting, etc.).",
      "author": "zifmer",
      "created": 1616795025,
      "upvotes": 4,
      "replies": {}
    },
    "gsbvevi": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbvevi/",
      "text": "My sister left a humanities PhD program to become a high school teacher.  It's not ideal, but it's a steady job with great benefits that pays the bills.  It has also allowed her a lot of time flexibility while raising kids.\n\nAnother possibility is to offer copyediting services for academics.  As more and more international researchers are publishing in English-speaking journals, the demand for this service is going up.  I'm in a business discipline, and we're getting to the point where just about every author team has to hire a professional copyeditor before their paper gets published (that used to be a function of the journal publisher, but don't get me started).\n\nA third possibility would be technical writing.  From what I've heard, there's always a large demand for that.",
      "author": "SmartAZ",
      "created": 1616788317,
      "upvotes": 3,
      "replies": {}
    },
    "gsc11yr": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsc11yr/",
      "text": "So I'm in a similar position. The person I came to my uni to study with left six weeks before I started and tbh I was so discouraged by that I didn't even think of transferring to another program where my advisor could just leave before I started. \n\nSo I've been toying with the possibility of leaving, especially knowing that I'll be applying for TT jobs pretty much at the peak of post-Covid fallout and I want some kind of career stability. \n\nA lot of what I've found is that there are *many* jobs looking for someone who is a good writer above everything else and it seems like you might be. This is especially true in Federal jobs working on policy research (or any non-STEM research job tbh). But on all the Federal jobs I've found (and a lot since the government is basically re-stocking post-45), they're pretty specific that they care more about your demonstrated skills than degree area, and they weigh coursework completion the same as a completed PhD.  80% of people work in a field outside of their major, there's no reason you can't be one of them. \n\nBut I'm sure there are other options. Definitely talk to your University career center--I promise you they've done this a million times.",
      "author": "rotdress",
      "created": 1616790460,
      "upvotes": 3,
      "replies": {
        "gsdulvg": {
          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsdulvg/",
          "text": "Im a tech writer than works in Washington DC at a gov. Contracting firm and this is so accurate... we staff SO many PhDs at my company for gov. positions. It doesnt matter what your phd is in.",
          "author": "lampshademcgeezer",
          "created": 1616819811,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gsc4hca": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsc4hca/",
      "text": "Sounds like a rough situation to be in. Are you part of any professional orgs where you can get feedback from others in your subfield? Can also be a good place to seek support for transitioning out of academia, if your own department/grad division aren't being particularly helpful. Also check out Imagine PhD. Consider also where you're located, and what industries are local to you that you could start feeling out while you teach and take advantage of whatever benefits are worth your time. I'm thinking about this all the time because even coming from a T10, my expectations for a TT job are only slightly higher than winning a three-figure sum from a scratch-off ticket (and with my background and life experiences, I'm unwilling to move to a place that will damage my soul in order to chase a brass ring just to have the rug pulled out from under me when the next round of budget cuts happen).\n\nUntil the bottom gives out, there's always admin. I barely got more pay, but at least there was money for professional development and a retirement match. If you've been part of 3 institutions so far, that's a foot in three different doors.\n\nAlso, worst comes to worst if you went straight through you'll be starting over in your late 20s/early 30s, which is definitely not the worst place to be in (speaking as someone a bit older than that). Might suck now, but start making moves to attain the life you want! Don't be held back by a [cruel attachment](https://blogs.lse.ac.uk/impactofsocialsciences/2018/03/01/is-pursuing-an-academic-career-a-form-of-cruel-optimism/)! (Or the sunk cost fallacy, maybe the PhD will help but anecdotally it sounds like it often doesn't, so why not leave ABD with the intent of finishing it once you're more stable?)",
      "author": "AlliumoftheKnife",
      "created": 1616791763,
      "upvotes": 2,
      "replies": {}
    },
    "gscir3e": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gscir3e/",
      "text": "So, I'm a humanities person as well. Background in creative writing, and was told by my master's mentor (who is a rhet comp person), that basically Ph.D.'s in Lit, and Creative Writing aren't going to be landing anyone TT gigs anytime soon, and that because most English faculty know that, they are giving our less funding for programs, and are becoming less and less competitive. Which I believe translates to your experience: no one cares, because no one actually believes fostering either Ph.D candidates will lead to anything THEY can talk about as an accomplishment (e.g. my recent student got a TT job at an Ivy league all because of ME -- kinda talk). So, since you got into the program, they simply assume you're good a writer, and pass you through hoping you won't want actual mentorship because you should be a good writer since you got into the program. Messed up logic, but that's why I switched my trajectory and only applied to Rhet Comp programs...because more and more schools understand how important it is to hire a Rhet comp person to teach first-year composition (or handled the writing center), then it is having a Lit or Creative Writer teach it.   \n\n\nIf your goal is to stay in academia, I highly suggest trying to see if you can get a rhet comp certificate so you can mark yourself a bit better. If not, use your skills and try to transition to professional writing or even journalism.",
      "author": "Kikisdoingherbest",
      "created": 1616797485,
      "upvotes": 2,
      "replies": {
        "gsged8i": {
          "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsged8i/",
          "text": "> more and more schools understand how important it is to hire a Rhet comp person to teach first-year composition (or handled the writing center), then it is having a Lit or Creative Writer teach it\n\nIn many cases, it's not that (or not only that) it's important for this to be the case, but there's also an increasing number of rhet/comp applicants, so the lit & CW folks appear more and more to be 'out of field' and less competitive for such positions.",
          "author": "herennius",
          "created": 1616856903,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gscwrp6": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gscwrp6/",
      "text": "Sounds like your best bet at this point (assuming you aren’t taking on a lot of debt) is to just finish, try your luck on the job market, but have an exit strategy in place if it doesn’t work out. I have a Ph.D. In English from 2005, with an actually incredibly supportive and engaged department, with publications, but had a two body situation and a young family so just never got a TT job. I left academia, got a second masters and licensure and became a Speech-language pathologist. I stay very busy with my work and find it rewarding but retraining isn’t easy for everyone. But the point is, life goes on and there are SO many opportunities outside the very narrow path academia offers. Good luck!",
      "author": "Chalee7",
      "created": 1616803462,
      "upvotes": 2,
      "replies": {}
    },
    "gsfk7nq": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsfk7nq/",
      "text": "Humanities phd here. After completing my phd, it became clear to me that I would never find a tenure-track job. So at that point I scrambled and found some marketing/communications positions, though I had the advantage of previous work experience in that field.\n\nHere are some possibilities that you might consider in your situation:\n\nSince you are so far into the PhD program, it may be worth just sticking it out to complete your degree. As you finish your degree, you can also begin some professional development to help you land a non-academic job. For example, let's say you find some part-time marketing role that you can do as you complete grad school. In this role, you could amass a portfolio of clips which you could then use to leverage yourself into a full-time marketing job post-graduation. So you would need to identify what field you are interested in and a way to build up your resume in this field that isn't too time consuming.\n\nIf you absolutely hate grad school and want out now, you could simply start applying to f/t jobs now as you continue in your grad program. If/when you find an promising job, quit your grad program. There are positions out there in both private industry and academic administration that value people with academic backgrounds. In the private sector, check out various educational technology companies. Combine a targeted approach--jobs that you could conceivably excel at--with volume: the more positions you apply to , the better your odds.\n\nOverall, keep in mind that being in grad school is proof of extremely advanced skills and capabilities in writing, analysis, organization, etc. You may be able to find an alt-ac job with this alone. If that doesn't pan out for you, there are many \"low-lift\" ways of boosting your non-academic resume to help you pivot into an alt-ac job.\n\nHope this helps. Feel free to message me if you would like to discuss further.",
      "author": "traanquil",
      "created": 1616845546,
      "upvotes": 2,
      "replies": {}
    },
    "gsbuk3d": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsbuk3d/",
      "text": "Okay wow I wish I had some sort of magic wand or some piece of golden advice to tell you. I will say (and you might not find this helpful) that I was 4 years into a program and was pretty unhappy and stressed (I wasn't as neglected as you describe, but my program stopped offering classes lol) and switched universities. It was a super scary and wild decision but I'm \\*so\\* much happier now. I know that I stayed in academia and that you don't want to, my point here is that it will get better once you make your decision // leave!! \n\nI wonder if you would be interested in teaching in an international school? You'd need your teaching certificate, but according to the grapevine that I'm attached to, it can be a neat gig. I'm not sure how one goes about getting a job at an Int'l school, so I apologize. Also: maybe a library? I've already kind of accepted the fact that when it comes my time to be on the market, I'll be applying to research libraries as well as academic jobs lol.",
      "author": "ChezJason",
      "created": 1616787997,
      "upvotes": 1,
      "replies": {}
    },
    "gsc69p5": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsc69p5/",
      "text": "In my opinion, it depends on how close you are to finishing. If you are close, it might be worth getting the degree just so that you don't feel like you wasted that time, even if you end up getting a \"real\" job. \n\nOn the other hand, if you are not close and your chair isn't motivated to move you along, it might be a big waste of time to keep spinning the wheels. \n\n&#x200B;\n\nGood luck, I'm sorry to hear that!",
      "author": "fsu23phd",
      "created": 1616792441,
      "upvotes": 1,
      "replies": {}
    },
    "gsdkfix": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsdkfix/",
      "text": "I'm in the humanities, and if my grad program had been similar to yours, I would have left pretty quickly. So no, not all humanities grad programs are as bad as yours.\n\nHere's one way to get some mentoring as you transition out of academia -- as well you should.\n\n[\\- The Professor Is In](https://theprofessorisin.com/)",
      "author": "matthewsmugmanager",
      "created": 1616814245,
      "upvotes": 1,
      "replies": {}
    },
    "gse2guh": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gse2guh/",
      "text": "First off, I'm sorry to hear you've had such a negative experience with lack of advising from your mentors. Academia seems to be such a crapshoot on whether or not you get mentors who regularly check in or are totally MIA. This year has been especially tough for all of us (including them) so I'm trying to be patient with my similarly MIA mentor. I've had to reach out to other faculty in my dept to get feedback on major papers for my degree. Just mentioning this to say: You're not alone.\n\nI'm not in humanities, but leaving academia is entirely an option if that's what you want. Many companies specifically seek out those with PhDs for their analytical/statistical/problem-solving skills. Maybe others actually in humanities here can recommend some jobs to look for, but start applying early (i.e. a year or so before you graduate).\n\nAlso, check out the sub r/ByeByeAcademia, lots of folks there with similar stories who may be able to lend a hand.",
      "author": "diskprept",
      "created": 1616824076,
      "upvotes": 1,
      "replies": {}
    },
    "gsdrg2a": {
      "link": "/r/AskAcademia/comments/mds5c2/trapped_in_the_humanitiessuccess_elsewhere_feels/gsdrg2a/",
      "text": "Kinda sounds like you're the problem.",
      "author": "ClassyJeffrey",
      "created": 1616817993,
      "upvotes": -4,
      "replies": {}
    }
  }
}