{
  "sid": "qeh1ke",
  "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/",
  "title:": "How does teaching high school compare to teaching at unranked SLAC?",
  "text": "Currently teaching high school and thinking about going back to grad school to ultimately teach college. I know the job market is rough in humanities and assume I’ll end up at an unranked SLAC even coming from, let‘s say, a top 20 graduate program.\n\nI‘m curious about how the quality of students at these schools compares to the average high school student. I’m thinking that they’re about the same, since an average high school student would generally end up at an average undergrad. And unfortunately I feel that many of my average students don’t have the maturity, discipline, or skills for college even by the end of HS.\n\nDo you find yourself often needing to employ high school-like pedagogy and techniques? e.g. hand-holding, graphic organizers, exam retakes, throwing kids out of class due to disruption, curtailing constant talking and phone use, etc?",
  "author": "newtch23",
  "created": 1635034917,
  "updated": 1636172838,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 0.8,
  "comments": {
    "hht3ceh": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hht3ceh/",
      "text": "Teaching at a shitty SLAC may be a poor decision for reasons you haven’t considered. Because of the declining birth rates, especially after the 2008 recession, college enrollment is actually projected to go downwards over the next decade. Obviously, schools like Amherst, Williams, Colby, etc. will not face a big problem, since they’ll always be sought-after, competitive schools. However, the lower tier schools will literally run out of students to admit, and many of them will close down. This process has already started, actually, and the 2008 kids aren’t even college-aged yet. So you may be able to get your PhD or whatever, and you may even land that job at Bumfuck College, but there’s a good chance you won’t be able to keep it. Just a thought. Best of luck.",
      "author": "p53lifraumeni",
      "created": 1635037739,
      "upvotes": 44,
      "replies": {
        "hht9pma": {
          "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hht9pma/",
          "text": "As a professor at Bumfuck SLAC, I'd encourage OP to listen to this guy \\^",
          "author": "tongmengjia",
          "created": 1635040810,
          "upvotes": 35,
          "replies": {}
        },
        "hhz5qfu": {
          "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhz5qfu/",
          "text": "> Obviously, schools like Amherst, Williams, Colby, etc. will not face a big problem, since they’ll always be sought-after, competitive schools.\n\nDo you know, it's not that clear cut. Prestige protects, of course, but any school with an insufficient endowment is in danger. In the past couple of years, I've been reading about how Middlebury and Bucknell have been having trouble squaring budgets.",
          "author": "thegreenaquarium",
          "created": 1635163720,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhtbghb": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhtbghb/",
      "text": ">assume I’ll end up at an unranked SLAC even coming from, let‘s say, a top 20 graduate program\n\nIf you're very, very lucky you will.",
      "author": "JapanOfGreenGables",
      "created": 1635041663,
      "upvotes": 22,
      "replies": {}
    },
    "hhtqpt0": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhtqpt0/",
      "text": "You’re vastly overestimating job prospects. It is unlikely that you will find full time employment in higher education at all. \n\nDo not give up secure employment to pursue academia. In my field, if you’re not coming from a top 10 (and realistically, top 5 if you want the best possible chances), you’re simply not getting a tenure track position. Anywhere. Full stop. \n\nAs far as teaching: I am at an R1, and they either adapt to the reasonable amount “handholding” that I do provide, or they don’t. Most do. Some don’t - but with those students, it’s not typically isolated to my class. Behavior tends not to be an issue 98% of the time.",
      "author": "GoldenBrahms",
      "created": 1635049863,
      "upvotes": 15,
      "replies": {
        "hhx86r4": {
          "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhx86r4/",
          "text": ">It is unlikely that you will find full time employment in higher education at all.\n\nYes, the OP is asking the wrong question. \n\nThe question to ask is \"Will I enjoy teaching an occasional class at adjunct wages while working retail to try to make ends meet?\"",
          "author": "sporkwantsfoon",
          "created": 1635117534,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhsym4g": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhsym4g/",
      "text": "I mean I teach at an R1 and it’s a lot of hand holding and such.",
      "author": "spah33",
      "created": 1635035499,
      "upvotes": 35,
      "replies": {}
    },
    "hht4epj": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hht4epj/",
      "text": "College students are high school students plus 8 weeks. They don't magically acquire maturity, discipline or skills during those 8 weeks.",
      "author": "PurpleGeek",
      "created": 1635038259,
      "upvotes": 34,
      "replies": {}
    },
    "hht0mx5": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hht0mx5/",
      "text": ">I know the job market is rough in humanities and assume I’ll end up at   \nan unranked SLAC even coming from, let‘s say, a top 20 graduate program.\n\nI wouldn't assume this at all.  I would assume that you won't get a full-time job right away, and that you'll most likely have to adjunct, given just how bad the market for humanities Ph.D.s is. Even if you come out of a top 20 school.  Your top 20 school isn't training you to be a teacher, anyway. They're training you to be an academic.\n\nIf you really want to \"just teach,\" you'll be better off getting a master's degree and considering community college.  Your odds might be slightly better.\n\nEither way, it's a crapshoot, and going to the best school is in no way a guarantee that you'll land any kind of job at a 4-year institution.\n\n&#x200B;\n\nTo your other questions, I've had to go as far as banning cell phones and computers from the classroom.  And students **still** use them.  Sadly, the American college student looks very much like the American High School student. I've taught at large state schools and small private SLACs and honestly, *in general*, there's no real difference in the quality of students overall.  Everywhere has their all-stars, their C-is-a-degree floaters, and those who really shouldn't be in college at all. YMMV.",
      "author": "winterneuro",
      "created": 1635036433,
      "upvotes": 27,
      "replies": {
        "hht87vf": {
          "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hht87vf/",
          "text": "Hell, master's and then community college ain't happening either, save for maybe in some of the most remote regions of the country. Community college I was adjuncting for went out and hired a Duke University literature PhD to teach a 4/4/1 load of composition.",
          "author": "headlessparrot",
          "created": 1635040090,
          "upvotes": 15,
          "replies": {
            "hhtc3x2": {
              "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhtc3x2/",
              "text": "Every prof I work with tells me that I should shop for a CC as a first job springboard to something better. It’s been so ubiquitous, and something I’ve seen recommended here frequently enough, that I doubt anyone with only a masters could compete. Likely the majority of applicants even for the adjunct pool are going to have PhDs, and anything that offers online teaching is going to be filled with all kinds of out of state graduates. The only exception to this would probably be people in unique majors, especially more trade focused.",
              "author": "BeondTheGrave",
              "created": 1635041990,
              "upvotes": 5,
              "replies": {
                "hhu5bke": {
                  "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhu5bke/",
                  "text": "Yeah, this is terrible advice. In addition to the stigma against CCs mentioned in the other response, the high teaching load such jobs require would likely keep you from publishing at a rate that is competitive enough for TT jobs outside CCs.",
                  "author": "jmgbam21",
                  "created": 1635060501,
                  "upvotes": 5,
                  "replies": {}
                },
                "hhtjjlr": {
                  "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhtjjlr/",
                  "text": "Shopping for CC jobs first strikes me as weird advice if your plan is to use it as a starting point and climb, for what it's worth: prestige tends to be sticky downward, and having a CC on your CV is probably going to limit rather than open up your options (unfairly, in my opinion). There's still so much of an attitude that it's \"lesser than\" that you could find yourself easily dropped from long lists (which is to say nothing of the fact that it's a different skill set and unfair to so many CC students who deserve faculty who are committed to them and their context).",
                  "author": "headlessparrot",
                  "created": 1635045803,
                  "upvotes": 3,
                  "replies": {
                    "hhv4se0": {
                      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhv4se0/",
                      "text": "I think the idea was youd get a job to start paying bills and teaching experience to say 'hey I've done this before' and parlay that and some work on an article or book into a TT somewhere. I know a few profs who did this themselves but like in the 90s when things were totally different. Still I would suspect that most American CCs are going to fill up with PhDs looking to get *something* rather than MAs. Every grad student from my program has told me they applied for jobs at all the local CCs after graduation and came up with nothing. One said hes applied to every CC in the state.",
                      "author": "BeondTheGrave",
                      "created": 1635085590,
                      "upvotes": 2,
                      "replies": {
                        "hhv6cnr": {
                          "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhv6cnr/",
                          "text": "Yeah, my partner jumped from (full-time but limited-term appointment at) a CC to a TT position at an R2, and by all accounts this makes her an absolute unicorn. People look at her like she's got scales.",
                          "author": "headlessparrot",
                          "created": 1635086322,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hhx8f6h": {
                  "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhx8f6h/",
                  "text": ">Every prof I work with\n\nYour professors have no clue about the academic job market.",
                  "author": "sporkwantsfoon",
                  "created": 1635117646,
                  "upvotes": 1,
                  "replies": {
                    "hhxua9c": {
                      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhxua9c/",
                      "text": "I dont know if thats true, theyve had several students land jobs after graduation. Theyve also been on multiple job search committees. So coming and going. \n\nWhats more accurate to say is that the market has changed radically since they graduated and their advice is outdated.",
                      "author": "BeondTheGrave",
                      "created": 1635128726,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hht4pjm": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hht4pjm/",
      "text": "First, it's right to assume that if you land a TT-job it'll probably be at an unranked SLAC, but even that is an assumption. There are a lot of humanities grads and very very very few humanities jobs.\n\nWRT students, they're better than high school students. They've got an average of 4 years more maturity (yes, a HS senior is only a year more than a college freshman but you get to teach college seniors too, and I assume you teach HS freshman now). And they students who were awful didn't go to college. So you won't see them.\n\nI've not had to throw out anyone from class, ever, never heard of a colleague who has. Occasionally phones are a problem but if they don't pay attention they fail out. Depending on the class they may need good scaffolding, etc.",
      "author": "imhereforthevotes",
      "created": 1635038405,
      "upvotes": 8,
      "replies": {}
    },
    "hhthr3p": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhthr3p/",
      "text": "I teach humanities in a mid-tier SLAC (ranked top 75) and I used to teach at a small private school and I adjuncted at a CC, and I often thought about going back to middle-high school ages.  Most of my current courses fulfill a gen-ed requirement with only a small portion of students that really want to be there.  Most of my middle and high school students were more excited, insightful, and knowledgeable than my SLAC students. My CC students were more mature, knowledgeable, and hardworking than my SLAC students.  I think most of my current students chose a SLAC because they wanted 4 more years of high school and wanted their hands held until their parents' friends offered them a job after graduation.",
      "author": "swinglinestaplerface",
      "created": 1635044825,
      "upvotes": 4,
      "replies": {}
    },
    "hhvmxwo": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhvmxwo/",
      "text": "I think you've gotten a lot of good advice in terms of student quality and job prospects, but financials are another thing to think about.\n\nI'm tenured at a public R2 school, and my partner is a high school teacher. We're in a liberal state with a strong teacher's union and good teacher benefits. I'm also at a unionized campus.\n\nRight now, I make significantly more than my partner, but not a LOT more. My salary is like 30% higher than his (and I have been at my job for 8 years, while he has been at his for only 2). Yes, I can get grants funded for summer salary and significantly increase my salary right now, but grants are very hard to get and I have a lab and grad students to keep funded, meaning my personal summer salary is often at the end of my list of funding priorities.\n\nThe big difference is my partner's benefits: he will have a state funded pension when he retires, which is well-funded and stable, while I just have a 401k and whatever personal contributions I can make. His tenure is easy to get (just based on amount of time) and he'll get a salary bump when he finishes his master's.\n\nAnother person said this as well, but really think about just moving to a state that has better teacher benefits / support. With what you propose, you're not looking at a significantly better salary, you're looking at significantly *worse* job prospects, and working on a PhD you'd be spending years earning *nothing* and losing what are likely really good retirement benefits from being a teacher.\n\nEdit: clarification",
      "author": "boilerlashes",
      "created": 1635093502,
      "upvotes": 3,
      "replies": {}
    },
    "hhuebjk": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhuebjk/",
      "text": "Imo students need to be deprogrammed on day one. Hand holding is the enemy.",
      "author": "molobodd",
      "created": 1635068103,
      "upvotes": 2,
      "replies": {}
    },
    "hhuzyfn": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhuzyfn/",
      "text": "My students are great but I get paid less than I would have if I had stayed a high school teacher.",
      "author": "guitair",
      "created": 1635083202,
      "upvotes": 2,
      "replies": {}
    },
    "hhw0sov": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhw0sov/",
      "text": "I think you have a misinformed perception of just how bad the job market is. Even the \"unranked SLAC\" institutions will end up getting hundreds of highly qualified applicants from Ivy League institutions. Are you prepared to possibly do an adjunct gig at 1, 2, or even 3 institutions to makes ends meet? Are you willing to move around every couple years to do this? \n\nI know you are asking about the quality of students, but I guess I would just hate you to leave a steady job and find yourself disappointed. Many adjunct jobs don't even require a PhD anymore and are hiring Masters students or those with x graduate credits, or even those still in grad school. So you could always see if doing a part time grad degree is possible, or maybe even see if you can shadow a SLAC instructor and see how they teach? I think there are other ways to get a feel of if this is the right kind of job for you before jumping into a grad program. Just my thoughts though!",
      "author": null,
      "created": 1635099074,
      "upvotes": 2,
      "replies": {}
    },
    "hhtgesx": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hhtgesx/",
      "text": "I don't know anything about high school teaching environments apart from having been a high school student, but DO NOT GO INTO HIGHER ED TEACHING. If you want better pay move to a state with a stronger union (i say that knowing that this is an incredibly hard thing to do), because statistically speaking you will NOT GET A PERMANENT JOB unless you adjunct for years, and even then it's unlikely. My friends who have TT jobs now had to go teach in Saudi Arabia or China for years, or they had a rich spouse who could give them the time to research without distraction. Also, depending on how old you are that can also be an unstated disadvantage - TT jobs tend to go to younger phd grads.",
      "author": "talondarkx",
      "created": 1635044150,
      "upvotes": 3,
      "replies": {
        "hi783gh": {
          "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hi783gh/",
          "text": "How young is younger PhD grad?",
          "author": "following_eyes",
          "created": 1635302894,
          "upvotes": 1,
          "replies": {
            "hi7dtdd": {
              "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hi7dtdd/",
              "text": "30-37",
              "author": "talondarkx",
              "created": 1635305737,
              "upvotes": 1,
              "replies": {
                "hi7fc52": {
                  "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hi7fc52/",
                  "text": "Yikes, I'm screwed then. 35 and haven't started. Welp.",
                  "author": "following_eyes",
                  "created": 1635306542,
                  "upvotes": 1,
                  "replies": {
                    "hi8ldhj": {
                      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hi8ldhj/",
                      "text": "Get out while you can",
                      "author": "talondarkx",
                      "created": 1635337137,
                      "upvotes": 3,
                      "replies": {
                        "hibc34z": {
                          "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hibc34z/",
                          "text": "I'm still going in to education, but will be teaching at a foreign school. Looks like going into higher ed in the US is gonna be nuts though.",
                          "author": "following_eyes",
                          "created": 1635378116,
                          "upvotes": 1,
                          "replies": {
                            "hid794o": {
                              "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hid794o/",
                              "text": "Lots of jobs in China. Not too many elsewhere.",
                              "author": "talondarkx",
                              "created": 1635418982,
                              "upvotes": 1,
                              "replies": {
                                "hidf3g4": {
                                  "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hidf3g4/",
                                  "text": "I'm headed off to Moscow.",
                                  "author": "following_eyes",
                                  "created": 1635423869,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hi5khe4": {
      "link": "/r/AskAcademia/comments/qeh1ke/how_does_teaching_high_school_compare_to_teaching/hi5khe4/",
      "text": "Everyone else has spoken to the shit job prospects, so I won’t add to that. But in terms of actual teaching, in high school, students are not actually less mature than a freshman or sophomore in college, but their immaturity is more of your problem because they are legally children and you’re responsible for their general welfare. I taught hs for one year after grad school and that was one of the biggest issues for me— I just wasn’t used to being responsible for my students. There were little issues, like my students having to ask to use the bathroom which feels very creepy to me, and then bigger issues, like going on a field trip and having to walk individual students to their rides so they don’t run away or get kidnapped. I had never heard the phrase “duty of care,” and I didn’t know anything about classroom management (which maybe answers your question about how often you have to employ high school-level pedagogical techniques in college—not often). That was a weird learning curve and something I would never like to go back to. \n\nThat being said, high school students are more fun, and you get to know them a bit better as people, but unless you have an exceptional student, they don’t have the exposure or skillset to have really interesting ideas (this can be rare at the college level too, just to be clear). Because of this, I prefer teaching adults, but I really enjoyed working with high school students once I figured out what the fuck I was doing. \n\nYou would also have a considerable leg up as a former hs teacher, as most grad students never actually learn any real pedagogical skills. I was blown away by how little I knew about teaching compared to my colleagues, and I actually had gone out of my way to take education courses as a TA. I was fortunate to have a really collaborative environment (which is not emphasized much in the humanities in higher Ed), so I learned a ton, but I think the transition is more challenging the way I did it—i.e. it’s “easier” in many respects to go from teaching high school to college than the other way around.",
      "author": "mnhuhj",
      "created": 1635277169,
      "upvotes": 3,
      "replies": {}
    }
  }
}