{
  "sid": "k8h0jd",
  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/",
  "title:": "What are the sketchy, potentially bs parts of your field (could be methods, findings, lines of reasoning)?",
  "text": "I'm in neuroscience. I don't trust the majority of findings in my field anymore and it's upsetting.\n\nRepresentative images are a huge problem IMO. Representative of the effect, not rep of the average cell/tissue.",
  "author": "dreamingtriangle",
  "created": 1607349290,
  "updated": 1634080572,
  "over_18": false,
  "upvotes": 245,
  "upvote_ratio": 0.98,
  "comments": {
    "gey3tqk": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey3tqk/",
      "text": "Paper X - Compound A was synthesised according to paper Y.  \n\nPaper Y - Compound A was synthesised according to paper Z.  \n\nPaper Z - Compound A was synthesised according to a literature procedure.",
      "author": "ardbeg",
      "created": 1607353939,
      "upvotes": 212,
      "replies": {
        "geyn5np": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyn5np/",
          "text": "\"...the reaction was worked up in the usual fashion... \" \n\n?!??!",
          "author": "danesgod",
          "created": 1607362962,
          "upvotes": 76,
          "replies": {
            "gez3umo": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez3umo/",
              "text": "Trigger warnings everywhere",
              "author": null,
              "created": 1607369497,
              "upvotes": 15,
              "replies": {}
            }
          }
        },
        "geybdm0": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geybdm0/",
          "text": "I never do this. I include procedures for everything. Some professors look at me like I’m a time waster and a padder.",
          "author": "FulminicAcid",
          "created": 1607357829,
          "upvotes": 87,
          "replies": {
            "gez3t4m": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez3t4m/",
              "text": "Please never, ever change this. You are right, everybody else is in the wrong. Nobody should have to find 2-3 other papers from same authors just to try to find out how they did the experimental procedure",
              "author": null,
              "created": 1607369481,
              "upvotes": 48,
              "replies": {}
            },
            "geyeg7w": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyeg7w/",
              "text": "You are the hero we need.",
              "author": "fabledpreon",
              "created": 1607359338,
              "upvotes": 34,
              "replies": {}
            },
            "gf4o7zn": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf4o7zn/",
              "text": "My methods section always becomes ridiculously detailed. I've been discouraged from doing it but personally, I write it as if I have full intentions of asking others to reproduce it perfectly. I rather have a detailed methods section than some watered down bs...",
              "author": "kraezic",
              "created": 1607483126,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "geyrpne": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyrpne/",
          "text": "[deleted]",
          "author": null,
          "created": 1607364752,
          "upvotes": 36,
          "replies": {
            "gezuz9s": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezuz9s/",
              "text": "Oh man don't get me started. I wrote a paper on how some immunological biomarker X doesn't really predict outcomes well in disease Y. It frequently gets cited but in more than half of the citations it says something like \"biomarker X predicts outcome of disease Y well [n23_ et al]\". It's so frustrating how people take your paper to support the opposite of your conclusion.",
              "author": "n23_",
              "created": 1607382772,
              "upvotes": 12,
              "replies": {}
            }
          }
        },
        "geyslz9": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyslz9/",
          "text": "I had to deal with this once for a project.. PO asked me to find some preparation methods for a compound.. FML I didn’t know what to tell my PI after I had gone through tons of paragraphs on synthesis of the kind of MW CNTs that we wanted.. the PI just said, meh.. you just do it the way I did in my grad school 😂",
          "author": null,
          "created": 1607365104,
          "upvotes": 10,
          "replies": {}
        },
        "gez3no5": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez3no5/",
          "text": "Hello and go to hell organic chemistry",
          "author": null,
          "created": 1607369424,
          "upvotes": 4,
          "replies": {}
        },
        "gf0syc9": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0syc9/",
          "text": "At least partly to blame are word limits in Journals. Writing up my doctoral dissertation i was not only allowed but expected to include exhaustive methods.",
          "author": null,
          "created": 1607401222,
          "upvotes": 3,
          "replies": {
            "gf17l6e": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf17l6e/",
              "text": "Electronic supplementary information has been commonplace for >20 years. No excuse now.",
              "author": "ardbeg",
              "created": 1607412155,
              "upvotes": 6,
              "replies": {}
            },
            "gf16bfk": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf16bfk/",
              "text": "And that's where we got our big fat supplementary materials from.",
              "author": "WavesWashSands",
              "created": 1607410994,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gf0lz92": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0lz92/",
          "text": "\"as described elsewhere\" ... like wtf",
          "author": "mysteriousKM",
          "created": 1607397255,
          "upvotes": 3,
          "replies": {}
        },
        "gf19bw8": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf19bw8/",
          "text": "From chemistry or nanomaterials:\n\n\"This is shown here by using elements X y and z.\" \n\nGo to the cited paper, and find not a single one of those elements.",
          "author": "sidamott",
          "created": 1607413758,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gey2jud": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey2jud/",
      "text": "The push to make an AI/machine learning application for every problem, regardless of how (in)effective it may be.",
      "author": null,
      "created": 1607353227,
      "upvotes": 246,
      "replies": {
        "gey61co": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey61co/",
          "text": "LOL, our model predicted the calibration dataset with r2 of 0.95 and the validation dataset with r2 of 0.1, will you accept our paper!?!?",
          "author": "BananasonThebrain",
          "created": 1607355122,
          "upvotes": 73,
          "replies": {
            "gezu52u": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezu52u/",
              "text": "Honestly as a reviewer I'd be pleasantly surprised there was a validation set at all. Too many papers in medicine just skip that part.",
              "author": "n23_",
              "created": 1607382352,
              "upvotes": 19,
              "replies": {}
            }
          }
        },
        "geycq97": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geycq97/",
          "text": "This pisses off everyone in other fields as well. \n\nEvery ML sycophant thinks they can do X better than career researchers in X.",
          "author": "Overunderrated",
          "created": 1607358494,
          "upvotes": 62,
          "replies": {
            "geyg0yr": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyg0yr/",
              "text": "You mean I can’t use my dEeP lEaRnInG model to find aliens!?",
              "author": null,
              "created": 1607360101,
              "upvotes": 45,
              "replies": {
                "geyim5x": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyim5x/",
                  "text": "I could, and have (and do) rant about this for *years*. I work in computational fluid dynamics (*extremely* computationally intensive) and cut-rate academics, and even famous ones, just vomit out papers purporting ML to be the magical solution to everything in my field.\n\nAnd invariably their \"results\" take this approach: (1) do lots of very expensive CFD, (2) apply ML to those answers in some fashion, (3) \"recreate\" the results of (1) using (2) and proclaim victory, ignoring the fact that they had to do (1) to begin with so (2) and (3) are outright wastes of time.\n\nI would laugh instead of cry except these people soak up research funds for their garbage, and I have honestly *never* seen a single convincing application of ML to CFD that held up to the tiniest bit of scrutiny.",
                  "author": "Overunderrated",
                  "created": 1607361193,
                  "upvotes": 48,
                  "replies": {
                    "gez9jao": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez9jao/",
                      "text": "YES people do this ALL THE TIME in geomechanics and it drives me crazy. It's getting better and people are doing better model validation,\n\nbut as it \"gets better\" people actually start to realize that ML is really not a better solution than all the much simpler, much less data intensive methods that already exist.",
                      "author": "EphemeralEarth",
                      "created": 1607371797,
                      "upvotes": 14,
                      "replies": {
                        "gezcmk1": {
                          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezcmk1/",
                          "text": "I think CFD/numerical methods people are very specifically attuned to this because our work is so heavily centered around approximation theory and curve-fitting type things in general. We know very well how the more complex the fitting you attempt the more horrible problem you'll have. So we get these ML people pushing glorified nonlinear regression models that they don't even understand, and our bullshit meters redline.",
                          "author": "Overunderrated",
                          "created": 1607373276,
                          "upvotes": 10,
                          "replies": {
                            "gf0816r": {
                              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0816r/",
                              "text": "One ML application that I think is mostly valid is when they fit an ML regression to a series of numerical model input/output combinations (e.g. input rock strength parameters and output displacement/strain). That way you can estimate parameter combinations and outputs in the parameter space in-between actual model results. It's not claiming to replace or somehow circumvent the actual physical modeling, it's just a convenient way to interpret results. (in other words, they're not claiming that you no longer have to run the initial models)\n\nThe problems with this are it isn't really physically justified and can't be used for any sort of extrapolation, plus in reality it's not something you couldn't do with classical regression techniques with similar results. It just has the \"AI\" brand recognition ($$)\n\n&#x200B;\n\nEDIT: found the paper [Surrogate models](https://www.onepetro.org/conference-paper/ARMA-2020-2010?sort=&start=0&q=surrogate&from_year=&peer_reviewed=&published_between=&fromSearchResults=true&to_year=&rows=10#)",
                              "author": "EphemeralEarth",
                              "created": 1607389728,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "geyocg7": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyocg7/",
                      "text": "For someone who doesn't know, what is \"\"CFD\"?",
                      "author": "secretpoop75",
                      "created": 1607363428,
                      "upvotes": 6,
                      "replies": {
                        "geyoulj": {
                          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyoulj/",
                          "text": "Computational fluid dynamics, second sentence above.",
                          "author": "Overunderrated",
                          "created": 1607363625,
                          "upvotes": 9,
                          "replies": {
                            "geyr8pf": {
                              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyr8pf/",
                              "text": "Gah, thank you! Time to get another cup of coffee ;-)",
                              "author": "secretpoop75",
                              "created": 1607364566,
                              "upvotes": 6,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "gez8wor": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez8wor/",
                      "text": "I also do CFD on a huge scale and share your cynicism almost to a tee.\n\nHowever I see stuff like this and I wonder if maybe things are getting better: [https://arxiv.org/abs/2010.08895](https://arxiv.org/abs/2010.08895) \\- would be curious whether you categorize this as one of those crap papers or not (I don't, but I am not versed in ML/AI).",
                      "author": "__x0x__",
                      "created": 1607371509,
                      "upvotes": 6,
                      "replies": {
                        "geza35a": {
                          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geza35a/",
                          "text": "Same thing. Correct me if I'm wrong because I only skimmed it, but...\n\n>On a 256×256 grid, the Fourier neural operator has an inference time of only 0.005s compared to the 2.2s of the pseudo-spectral method used to solve Navier-Stokes.  Despite its tremendous speed advantage, [...]\n\nThey used a solution created by the pseudo-spectral method, trained their operator on that data, and then evaluated their operator and call it a \"speed advantage\" vis a vis 0.005s vs 2.2s. But they're just ignoring the fact that they needed wildly in excess of that original 2.2s to train the initial model, so in any real sense it's absurdly slower.\n\nEffectively they're pointing out it's faster to evaluate a curve fit than it is to come up with the original data for the curve fit, like no shit.\n\n\nI saw a conceptually similar study recently where a group did something like 20,000 CFD runs over months, trained a model on the results, and then claimed their evaluation of the neural net (with seriously shitty accuracy) only took seconds and was therefor faster. I wanted to throw a chair.\n\nAlso, join us on /r/cfd",
                          "author": "Overunderrated",
                          "created": 1607372059,
                          "upvotes": 5,
                          "replies": {
                            "gezbaow": {
                              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezbaow/",
                              "text": "Hey thanks for your perspective. I am currently finishing up a proposal to use a different method (not AI/ML; it's Bayesian) to analyze a metric fuckton of model output. Eventually I'll probably apply ML/AI to my work but I'm waiting for the smoke to clear first. And thanks, I'm now subbed to r/cfd!",
                              "author": "__x0x__",
                              "created": 1607372637,
                              "upvotes": 6,
                              "replies": {}
                            },
                            "gf2pzwb": {
                              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf2pzwb/",
                              "text": "I can't believe I'm defending ML in physics, but this isn't completely fair. Obviously it is a fancy curve fit and the speed advantage is there purely because you're solving a curve fit and not the actual physical system, but that's not necessarily a bad thing. To use a chemistry example because that's what I know, if you have a model that truly gets within ~1 kcal/mol of DFT in \"small\" molecules, that's massive for pharma and all the training required is 100% worth it. That's not something I expect to see in the next two decades, but that would still be a game changer. I don't know if that's a realistic thing in CFD, but apparently that has happened in quantum chemistry. It's not actually useful because there's not enough computational power to do the training on a sufficiently large bond basis, but it worked. You gave it a structure and it spit out an answer that is similar quality to DFT.\n\nAnd while this isn't \"dEeP lEaRnInG\", I also think there's a lot of potential value in taking ideas from compressed sensing to get real simulation speed up. With judicious sampling choices, you can get a completely solvable undetermined system which saves you from having to solve for however many points with the real model.\n\nWhile this is an ongoing thing, graph theory is also proving to be the answer to \"how do we deal with systematic errors in thermochemistry?\" The data requirements are pretty extreme for that, but you create a \"thermochemical network\", solve it for self consistency, and now you can immediately see whether or not your experiment/calculation for a new quantity is sensible. It's probably still not perfect, but it's a hell of a lot better than the old method which was \"we have two conflicting values here. One was taken by a lab with an h-index of 116 and the other by an h-index of 15, so I guess we'll go with the 116 data.\"\n\nAlso, not coincidentally, if a paper uses the words \"deep learning\" and it's not explicitly an ML researcher, you can pretty safely not read it because it's a trash paper using a model that is ill suited for the system in question. Now if you'll excuse me, I need to take a shower after this post.",
                              "author": "Mezmorizor",
                              "created": 1607450368,
                              "upvotes": 4,
                              "replies": {
                                "gf30d7y": {
                                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf30d7y/",
                                  "text": "> Now if you'll excuse me, I need to take a shower after this post.\n\nHaha, very well understood.\n\n> I don't know if that's a realistic thing in CFD [...] And while this isn't \"dEeP lEaRnInG\", I also think there's a lot of potential value in taking ideas from compressed sensing to get real simulation speed up. \n\nWorth more like a multi-beer rant, but there's a whole host of reasons why I don't see this being feasible in CFD.",
                                  "author": "Overunderrated",
                                  "created": 1607455054,
                                  "upvotes": 2,
                                  "replies": {}
                                },
                                "gf5ccbq": {
                                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf5ccbq/",
                                  "text": "Have they really been successful in predicting DFT values? I find that questionable. Optimizing desired properties calculable with DFT using machine learning was one of the things I became very interested in in undergrad.\n\nThe last I looked at machine learning in DFT, they were training on high-throughput data and tried to identify candidate materials for whatever niche they wanted. While this is interesting, it is not the same as performing self-consistent calculations from scratch. Considering all the variables (pseudopotential, Wigner-Seitz cell optimization, etc.), I can't imagine they would have much success convincing me to use their data. \n\nIf you have a source, I would be excited to read it though!",
                                  "author": "stochastic-student",
                                  "created": 1607499787,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            },
                            "gf16kon": {
                              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf16kon/",
                              "text": "The important factor is whether the model is generalizable. I imagine they are hoping to work towards a neural network that can predict the outcome of new CFD calculations after learning on this data set.\n\nDisclaimer: I’m not in CFD or ML/AI but previously did some ML projects. My program chair and program in general is very interested in these types of applications. I actually saw a colloquium recently by a guy at Columbia doing what you guys are talking about. His goal, however, was a more broad functional minimization scheme that took advantage of what we know from ML. Anyway, I share you cynicism in some ways.",
                              "author": "stochastic-student",
                              "created": 1607411220,
                              "upvotes": 3,
                              "replies": {
                                "gf1ffxc": {
                                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1ffxc/",
                                  "text": "> The important factor is whether the model is generalizable. I imagine they are hoping to work towards a neural network that can predict the outcome of new CFD calculations after learning on this data set.\n\nRight, this is the stated hope of every publication in this field, and none of them have shown even the slightest plausibility of ever becoming predictive tools. And if you spend some time in fluid mechanics, the core concept of extrapolating a data set looks absurd.",
                                  "author": "Overunderrated",
                                  "created": 1607420067,
                                  "upvotes": 1,
                                  "replies": {
                                    "gf23qlw": {
                                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf23qlw/",
                                      "text": "Solaris.m4v\n\n||||\n|:-|:-|:-|\n||||",
                                      "author": "sci-fi-rec",
                                      "created": 1607439744,
                                      "upvotes": 1,
                                      "replies": {}
                                    },
                                    "gf5faiy": {
                                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf5faiy/",
                                      "text": "I share the cynicism because of all the buzz, but I have a hard time deciphering whether some of the hype is justified.\n\nI found the colloquium speaker (he was the guy from Brown not Columbia) but couldn't find the talk to look over. He publishes an absurd amount, but I found an example of what he spoke about [here](https://arxiv.org/pdf/2003.06496.pdf). I recall a lot of handwaving with absurd looking graphs, and 10-20% error for turbulent flow sounds like it would be useless to me. I am genuinely interested in your thoughts.\n\nBy the way, I previously applied some simple neural networks to spectroscopy data but suspect simpler methods were more reasonable. I do computational physics (optics now) and wonder whether there is value in applications to nonlinear PDEs. I am more interested in [this](https://arxiv.org/pdf/1909.10145.pdf), but can't help thinking a discretized spectral method is better anyway.",
                                      "author": "stochastic-student",
                                      "created": 1607502557,
                                      "upvotes": 1,
                                      "replies": {
                                        "gf5mram": {
                                          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf5mram/",
                                          "text": "> I found the colloquium speaker (he was the guy from Brown not Columbia) \n\nOh, Karniadakis. He's so full of shit his eyes are brown.\n\n>I recall a lot of handwaving with absurd looking graphs, and 10-20% error for turbulent flow sounds like it would be useless to me. \n\nYup, and those are the \"best\" results being shown.",
                                          "author": "Overunderrated",
                                          "created": 1607510465,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gf0g5la": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0g5la/",
              "text": "I'm in linguistics. Some scholars spend 20 years working in a remote endangered language community to collect primary data, write grammars and dictionaries, and do collaborative community language documentation, while others sit in their office making up algorithms without doing any actual primary research, and the latter get most of the prestige and funding.",
              "author": "encom-mcp",
              "created": 1607394035,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "gey7z8j": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey7z8j/",
          "text": "[deleted]",
          "author": null,
          "created": 1607356124,
          "upvotes": 53,
          "replies": {
            "geyre61": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyre61/",
              "text": "Deep networks are just fancy regression",
              "author": "LetThereBeNick",
              "created": 1607364625,
              "upvotes": 18,
              "replies": {
                "gf0a4ij": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0a4ij/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1607390833,
                  "upvotes": 6,
                  "replies": {
                    "gf0mtq2": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0mtq2/",
                      "text": "this is literally a guy in my lab. Went back and forth for a whole year with my supervisor and now finally got a brand new desktop with a powerful GPU... to run some basic matlab NN.",
                      "author": "mysteriousKM",
                      "created": 1607397724,
                      "upvotes": 5,
                      "replies": {
                        "gf11qmp": {
                          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf11qmp/",
                          "text": "his code will now run I'm 8 seconds instead of 30 seconds. Very impt",
                          "author": "Wu-Tang_Hoplite",
                          "created": 1607407159,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gf2m120": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf2m120/",
                  "text": "The main difference I always think is that you can easily strike a node from a network and it won't break it, or reduce the bit depth of your numbers, etc, and it still runs okay.  It has a different set of advantages and disadvantages from modelling with multiple multiple regressions.\n\n20 years ago, you needed to write \"nano-technology\" or \"dynamical systems\" in your proposals.  10 years ago, and for awhile, it was \"Neural networks\" (Though I have a friend in medicine and she says \"gut bacteria\" has been a big one for about five years).\n\nThere's always going to be some level of marketing horseshit in academic fads.",
                  "author": "quantum_prankster",
                  "created": 1607448545,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "gezwgl7": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezwgl7/",
              "text": "\"Hey I've heard of logistic regression! I guess I'm an AI expert too!\"",
              "author": "MillennialScientist",
              "created": 1607383523,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gf0ftt5": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0ftt5/",
          "text": "This is a big deal and a big problem in some areas of linguistics these days. Many people don't actually do detailed fieldwork on diverse world languages and understand them, they find some public data to scrape where the coding is inevitably reductionist to the point of being meaningless (and that's if they are lucky and it is not riddled with errors). Then when the real experts in the language point out all the problems with the data set, instead of correcting the data, they say \"The Algorithm was designed to cancel out the noise in the data\" and just go ahead anyway. Nope, sorry, garbage in, garbage out.",
          "author": "encom-mcp",
          "created": 1607393856,
          "upvotes": 4,
          "replies": {
            "gf13zfw": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf13zfw/",
              "text": "I agree there's a fair bit of not-enlightening work that uses ML, but I'd like to defend at least some of the people you're talking about here. There are certain questions that can only be tackled on a large scale and that inevitably means losing a lot of the local context and details. It would be difficult to imagine how we would be able to achieve something like Widmer et al. (2017) by hand, for example. And a lot of the time, when experts on a specific language disagree with some of the codings, it's because the way that typological categories are defined as comparative concepts doesn't match up with the local, emic categories used in linguistic description. But different language systems are incommensurate, especially when it's across language families and areas, so this is a necessary evil whenever one is doing large-scale comparative work.\n\nAlso, at least a subset of the people who work on large-scale computational typology/hist ling have had much experience producing detailed descriptions of particular languages themselves. For example, I'm not sure how well-known this is outside of the TB community, but Bickel has a lot of important work on Kiranti grammar. Those people *can* draw from their knowledge working on particular languages in their typological work. And there are more and more people who have mostly worked with relatively 'traditional' linguistics in their careers but have lately teamed up with people with computational skills (Claire Bowern obviously, but lately I've also seen papers from people like Lyle Campbell and Laurent Sagart), which just further shows that there is value in such methods.\n\nSo I don't think the situation in linguistics is quite the same as e.g. what the fluid dynamics person above said.",
              "author": "WavesWashSands",
              "created": 1607408981,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gf12qdr": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf12qdr/",
          "text": "In my undergrad, my PI once got a grant application rejected, and one of the reviewers' comments was 'why aren't you using deep learning'.\n\nI'm in humanities.",
          "author": "WavesWashSands",
          "created": 1607407945,
          "upvotes": 4,
          "replies": {
            "gf18v6g": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf18v6g/",
              "text": "In psych deep learning is a thing that’s unrelated to machine learning.",
              "author": "justfreehouse",
              "created": 1607413322,
              "upvotes": 1,
              "replies": {
                "gf1962t": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1962t/",
                  "text": "I'm not familiar with this sense of 'deep learning', but from context it was clear they meant deep learning in the sense of neural networks with multiple hidden layers.\n\nTo be fair, I have nothing against neural networks. I'm a pretty big fan of connectionism, and I think neural language models are massively useful even when they're not particularly interpretable (it finds use, for example, in creating information-theoretic measures like entropy and surprisal more accurately that traditional n-grams do). In fact, I did end up running a few recurrent neural networks (though not deep ones) at one point in that project, though that part was abandoned early on and didn't go into our final paper (which will be out at the end of this month). It's just the knee-jerk reaction ('why use something else when you could use deep learning' with no justification) that I find problematic.",
                  "author": "WavesWashSands",
                  "created": 1607413603,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gf0m5kz": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0m5kz/",
          "text": "these papers get easily published because the reviewers and editor of the journal fall for the hype and may not be experienced with ML stuff.",
          "author": "mysteriousKM",
          "created": 1607397356,
          "upvotes": 3,
          "replies": {}
        },
        "geyo478": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyo478/",
          "text": "[deleted]",
          "author": null,
          "created": 1607363338,
          "upvotes": -12,
          "replies": {
            "geyyzq4": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyyzq4/",
              "text": "Many of the absolute best ML papers are also by Chinese authors. It's a big country.",
              "author": "k10ftw",
              "created": 1607367599,
              "upvotes": 14,
              "replies": {
                "gez1b3d": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez1b3d/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1607368502,
                  "upvotes": -9,
                  "replies": {
                    "gezwimt": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezwimt/",
                      "text": ".... no?",
                      "author": "MillennialScientist",
                      "created": 1607383552,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gezbr29": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezbr29/",
              "text": "> If you look through an ML conference right now almost every paper will have a Chinese name\n\n\nChina accounts for almost 20% of the global population. I'm not even remotely surprised.",
              "author": null,
              "created": 1607372854,
              "upvotes": 9,
              "replies": {}
            },
            "geyps6e": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyps6e/",
              "text": "I completely agree on the reproducibility part.  It happens a lot in my field too (embedded systems). I would think it’s the latter part? Although we can’t be 100% sure",
              "author": null,
              "created": 1607363989,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gey6fvr": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey6fvr/",
      "text": "Systems neuro: peer reviewers pretty much have to take it on faith that nothing's horribly wrong with the heaps of custom Matlab/Python code that researchers created to analyze their data.  Occasionally the code will be requested and provided, but to my knowledge it's never really tested as part of the review.  \n\nAs someone who does electrophysiology/calcium imaging in rodents, I think fMRI is a very weak technique that gets way too much funding simply because it's the best non-invasive way to get data from humans.  Lots of issues with interpretation of fMRI.  Really bothers me when people talk about things like \"pattern separation\" interchangeably between physiology and fMRI, when one is looking at neurons firing and the other is looking at voxel activity.",
      "author": "TurnsOutImAScientist",
      "created": 1607355331,
      "upvotes": 82,
      "replies": {
        "geyb9ls": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyb9ls/",
          "text": "YES. Should definitely be required to submit code and data for publication. Ideally journals would also have a set of editors that specifically evaluate code (I want stats editors, too). Unfortunately journals have no incentive to provide these services...",
          "author": "dreamingtriangle",
          "created": 1607357774,
          "upvotes": 35,
          "replies": {
            "geytcby": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geytcby/",
              "text": "I agree in principle, but in practice it'd be too cumbersome/expensive for reviewers to really understand someone else's code.  Doing a review would become a project, whereas now it's more of a task.  It's just unfeasible given how precious time and money already are in science.",
              "author": "TurnsOutImAScientist",
              "created": 1607365391,
              "upvotes": 15,
              "replies": {
                "gezojny": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezojny/",
                  "text": "Plus while I typically hand calculate a few things from first principles to check my results (can be easier said than done in some cases!), my code is a mess.",
                  "author": "0bAtomHeart",
                  "created": 1607379475,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "geywgk8": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geywgk8/",
          "text": "Clinical neuroscientist here. Agree that fMRI can be sus, but so can ephys! Seen many a paper with super inconsistent data, inappropriate stats, and trying to weave a story from what looks to me like a collection of artifacts.\n\nI think we can both agree that fMRI in rats needs to stop getting funded ASAP, though... talk about worst of both worlds.",
          "author": "trevorefg",
          "created": 1607366610,
          "upvotes": 9,
          "replies": {}
        },
        "gezp7u8": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezp7u8/",
          "text": "I reviewed a paper that had very suspicious figures, so I did not recommended it for publication, arguing those results could not be right. It was not published. 2 months later I recieved an email to review the revised paper because the authors found an error in the code, so they redid all of it.\n\nThe other reviewer did not see the suspicion. There were 7 or 8 authors. Really nobody catched it? This made me realise how little sometimes people care about the papers",
          "author": "Zifnab_palmesano",
          "created": 1607379823,
          "upvotes": 5,
          "replies": {
            "gf0fhs0": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0fhs0/",
              "text": ">There were 7 or 8 authors\n\nHow dare you question the academic ability of my trusted friend, Mr. B. Worth. \n\nHe may actually be my pet dog, Mr. Bigglesworth, but he provided me invaluable emotional support during the writing of the paper so deserves to be credited as an author.",
              "author": "drwarrengphd",
              "created": 1607393674,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "gezx3ee": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezx3ee/",
          "text": "I've been publishing my code on my own and linking to it in my papers. When I can, I publish the data too, or at least demo the results on public data when that's possible. Sometimes we gotta just start doing it and hope it catches on.",
          "author": "MillennialScientist",
          "created": 1607383849,
          "upvotes": 6,
          "replies": {
            "gf0i26e": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0i26e/",
              "text": "I think this is a great idea. What field are you in? Do you use a preprint server or a personal blog?",
              "author": "agpharm17",
              "created": 1607395069,
              "upvotes": 4,
              "replies": {
                "gf1z6o1": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1z6o1/",
                  "text": "I'm kinda weird in that I work in a few fields. I do this in machine learning, in neuroscience, and in some medical research. Machine learning is the easiest, and code submission is required for some journals. In fact, the reviewer has to be able to run your code and get the correct result, either on the original data, or public data you use for validation. In neuroscience, fewer people care, but I think it's still a good thing.\n\nI use my personal github and website, plus public repositories, plus lab websites. Basically wherever it makes sense, and multiple locations is best. It's extra work, but I think we need to make this the norm.",
                  "author": "MillennialScientist",
                  "created": 1607437198,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "gf1kkvc": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1kkvc/",
          "text": "I agree with everything being BS, especially the super advanced image analysis techniques (I know because I do them for a living).\n\nBut... I don't think it would be fair to ask researches to share their code. Most processing I do is command batches written on the spot to automate processing if not command line one-time steps that get lost in 5 minutes. You can't \"share\" them.",
          "author": "lucaxx85",
          "created": 1607425630,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gey4mzr": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey4mzr/",
      "text": "Most papers published produce significant results. Barely any papers that produce non-significant results are published, when non-significant results can be just as important. \n\nThis is probably why we have such low replicability in my field... for every significant result from one paper, there must be a dozen non-significant results in unpublished papers out there.",
      "author": "staringspace",
      "created": 1607354383,
      "upvotes": 162,
      "replies": {
        "gey7b0v": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey7b0v/",
          "text": "I tried to discuss non-sig findings among those that were significant. Basically I tried to contextualize the results in their entirety. I was told to remove it before review.",
          "author": "HoosierTrip",
          "created": 1607355779,
          "upvotes": 53,
          "replies": {
            "gf13cwc": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf13cwc/",
              "text": "We need something like a nonprofit digital journal of non-significant results, where anything methodologically solid gets put up. Of course it wouldn't exactly be prestigious to publish there, but having something with the express purpose of collecting knowledge about what *doesn't* work I feel like could be an important part of the solution to the replication crisis.",
              "author": "TrekkiMonstr",
              "created": 1607408459,
              "upvotes": 9,
              "replies": {
                "gf1iy78": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1iy78/",
                  "text": "https://www.jasnh.com/\n\nSeriously, though, more and more journals are accepting registered reports where the paper can still be considered if you get a null result (last time I checked the list included *Cognitive Linguistics*, *Discourse Processes*, *Journal of Child Language* and *Language Learning*, though there could defo be more than there currently is). Also a while ago I saw a null result published in *Journal of Memory and Language*. So things are definitely moving the right way, just not very quickly.",
                  "author": "WavesWashSands",
                  "created": 1607423889,
                  "upvotes": 5,
                  "replies": {
                    "gf2pv5p": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf2pv5p/",
                      "text": "I've always been baffled that journals don't want non-significant results. You can save other researchers the headache of finding the same thing. Also, those results lead to other questions to be explored.",
                      "author": "HoosierTrip",
                      "created": 1607450308,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gey6rs2": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey6rs2/",
          "text": "Related paper (figure 1 is really cool): https://arxiv.org/pdf/2009.09440.pdf",
          "author": "baseball155",
          "created": 1607355504,
          "upvotes": 18,
          "replies": {
            "gez8mhl": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez8mhl/",
              "text": "Thanks!",
              "author": "-Gravitropism",
              "created": 1607371392,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gez9b9i": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez9b9i/",
          "text": "This! We need more papers about failures to find anything.",
          "author": "TakeOffYourMask",
          "created": 1607371689,
          "upvotes": 9,
          "replies": {}
        },
        "geyhzpz": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyhzpz/",
          "text": "[deleted]",
          "author": null,
          "created": 1607360957,
          "upvotes": 19,
          "replies": {
            "gf0j127": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0j127/",
              "text": "If you think that's only a problem in Psychology, you're in for a surprise. That's a problem in almost every field that uses inferential stats. Just from my experience massively so in biomed, neuroscience, nutrition science, public health and health economics. It's a fundamental flaw in the thinking about hypothesis testing that is extremely widespread.",
              "author": "Timguin",
              "created": 1607395603,
              "upvotes": 16,
              "replies": {
                "gf0wr6d": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0wr6d/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1607403606,
                  "upvotes": -2,
                  "replies": {
                    "gf1p7zq": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1p7zq/",
                      "text": "I'm at the intersection of the fields I mentioned, depending on project. Hence, the experience with that research.",
                      "author": "Timguin",
                      "created": 1607430088,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gf18hqo": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf18hqo/",
              "text": "I might be misinterpreting the intent behind your comment, so my apologies if you meant it more lovingly/playfully than I took it, but the problem isn’t Psychology as a discipline at large.\n\nRather, the problem is a certification and publication system that is groaning under the ever-increasing bloat of the university bubble. This is a huge generalization, of course, but one could make a career out of writing on this subject so please forgive my reduction. \n\nUltimately, all methods of inquiry have the same ends: Increasing our understanding and knowledge of ourselves and the world we live in. The means differ, naturally, but it’s important to zoom out from time to time and remember that all of our fields and disciplines and subdisciplines are fundamentally connected and contribute to one another constantly.  \n\nAlso: a science is only as good as its scientists. So, if you’re making a roundabout critique of the tendency for pseudoscientists to gravitate towards Psychology, then... Yeah, fuckin’ tell me about it. APA last year was frankly horrific. Someone needs to take a bullhorn to next year’s convention and stand outside screaming “JUST BECAUSE YOU ‘COMPUTED INTERNAL CONSISTENCY ESTIMATES’ FOR THE SHITTY INDEX OF *insert attitude or trait here* THAT YOU VERY WELL MIGHT HAVE JUST SCRIBBLED UP WHILST ON THE TOILET DOESN’T MEAN THAT ITS A VALID MEASURE”\n\nOr idk something that has a better ring to it.",
              "author": "crobtennis",
              "created": 1607412981,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gey1rx9": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey1rx9/",
      "text": "Details of growth conditions being conveniently left out of papers, and simply saying \"standard growth conditions\"",
      "author": "Hayw00dUBl0wMe",
      "created": 1607352794,
      "upvotes": 77,
      "replies": {
        "gey4xbu": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey4xbu/",
          "text": "My favorite is the \"as previously described (ref)\" and you end up going through a chain of like 4 papers piecemealling a method into something coherent and have to use \"as previously described (ref) with the following adjustments\" for your work. Then your paper becomes the latest to be referenced \"as previously described\".  Then some poor rotation student somewhere is tasked with getting the method up and running for a lab and they spend 3 weeks with the papers spread across their bedroom floor while continuously re-drafting an email to the lab manager about ordering reagents.",
          "author": "pastaandpizza",
          "created": 1607354536,
          "upvotes": 96,
          "replies": {
            "gey5vua": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey5vua/",
              "text": "Damn this felt too real",
              "author": "scienceislice",
              "created": 1607355042,
              "upvotes": 22,
              "replies": {}
            },
            "geyh4gd": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyh4gd/",
              "text": "Not specific to methods, but my advisor was big on citing the original paper, not just any old paper with the information we were referring to. This meant writing the introduction to my thesis was basically chasing down references to papers that referenced earlier papers that referenced other papers and so on in a maddeningly long trail to get to the original paper.",
              "author": "Maddprofessor",
              "created": 1607360586,
              "upvotes": 10,
              "replies": {
                "gezo7ab": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezo7ab/",
                  "text": "The first reference in my most recent paper (currently in R&R purgatory) is from 1943 for this reason. My grad student co-author wrote a sentence that said something was a long-standing problem. \n\nMe: \"how long-standing?\"\n\nHer: [blank stare via Zoom]",
                  "author": "justaboringname",
                  "created": 1607379292,
                  "upvotes": 8,
                  "replies": {}
                },
                "gezobrw": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezobrw/",
                  "text": "I ended up citing a letter from 1581....in a physiology dissertation",
                  "author": "0bAtomHeart",
                  "created": 1607379358,
                  "upvotes": 8,
                  "replies": {
                    "gf0ht65": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0ht65/",
                      "text": "I get a smug grin every time I cite something from the '80s. The 1980s.",
                      "author": "agpharm17",
                      "created": 1607394935,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gey34di": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey34di/",
          "text": "What field is this?",
          "author": "CESTLAVIEBABE",
          "created": 1607353548,
          "upvotes": 9,
          "replies": {
            "gezgthr": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezgthr/",
              "text": "I don't know if this is OPs field, but this is way too common in microbiology (nowadays not so much)",
              "author": "trobial",
              "created": 1607375375,
              "upvotes": 5,
              "replies": {
                "gf5guh2": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf5guh2/",
                  "text": "Can confirm this is common in solid-state physics as well.",
                  "author": "stochastic-student",
                  "created": 1607504121,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gey33rf": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey33rf/",
      "text": "I'm in writing studies, with an emphasis on writing center administration. We (as a field) have no idea what's happening in writing centers or why. Much of the scholarship produced is bullshit survey method stuff that points to very sketchy outcomes. \n\nI use big data/textual analytics to study a corpus of 10 years of my own writing center data and it runs counter to almost everything that gets published. I'm met with dismissive/angry questions at conferences about those findings all the time. \n\nWe know that tutoring is effective, generally, but we have very little idea of why and how people seek it out, or why it actually works.",
      "author": "cdb3492",
      "created": 1607353539,
      "upvotes": 65,
      "replies": {
        "gey8wi3": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey8wi3/",
          "text": "As a grad student, my favorite is the recursive loop for undergraduate students.\n\nWriting professor: I will not teach you MLA because you should know it already, go to the writing center for that.\n\nWriting center: We can't teach you MLA, we're here to help you write.",
          "author": "silversatire",
          "created": 1607356588,
          "upvotes": 42,
          "replies": {
            "geyhoky": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyhoky/",
              "text": "Most of the data that I have indicates that professors tend to equate format with good writing (even though that's silly). Format thus becomes a high stakes issue for students. My writing center spends a lot of time addressing format, and we do lots of sessions where we are simply tweaking some format issues. In my local context, that will likely mean better grades for students that use the writing center. Unfortunately, that metric becomes fairly meaningless in relation to student learning.",
              "author": "cdb3492",
              "created": 1607360825,
              "upvotes": 28,
              "replies": {
                "gf0r84l": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0r84l/",
                  "text": "That's fascinating but I have observed that. I used to support early college HS students and they were always so confused at why their professors had lower standards for their actual writing as compared to our 12th grade English teacher...but God forbid the format was off",
                  "author": "wayfaringpassenger",
                  "created": 1607400210,
                  "upvotes": 4,
                  "replies": {}
                },
                "gez76zk": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez76zk/",
                  "text": "It's not silly. A student who cares enough to write a strong essay will care enough to cite sources properly.",
                  "author": "catnamedpants",
                  "created": 1607370829,
                  "upvotes": 0,
                  "replies": {
                    "gezju53": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezju53/",
                      "text": "I mean, I think that whether you put a comma or a colon after the issue number of a journal is quite silly, in the sense of immaterial. It's a format issue, not an issue of plagiarism or something.",
                      "author": "kmalevich",
                      "created": 1607376939,
                      "upvotes": 12,
                      "replies": {
                        "gezlspr": {
                          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezlspr/",
                          "text": "I agree entirely. It's not like I'm suddenly going to be unable to discern that \"2018\" is the date of publication based on whether it is in parentheses or not, followed by a comma v. a period, immediately follows the author list or falls at the end of the citation...\n\nEven distinguishing between a journal article and a book chapter is not especially important in this day and age, not to mention I can't remember which of those titles goes in quotes and which in italics or is is the parent source that is in quotes or italics, anyway?",
                          "author": "Zoethor2",
                          "created": 1607377968,
                          "upvotes": 8,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gezg4o2": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezg4o2/",
              "text": "I’ve run into the opposite thing with trying to convince my peers from the student union that we should look into providing writing workshops for undergrads (specifically first years) so they can break the bad writing habits and start university on the right foot.\n\nBasically my fellow students told me that professors would likely object that they already teach students how to write, but we have concrete evidence and testimonials that they don’t do it properly or systematically. It’s basically a...\n\n* 1st year undergrad: “mom, can we have writing lessons?”\n* Mom: “we already have writing lessons at home”\n* Writing lessons at home: *sparsely disseminated, punctual advice with no systematization that leaves a shit-ton of blank spots if people don’t happen to take the right classes at the right time*\n\n... situation.",
              "author": "spacenb",
              "created": 1607375024,
              "upvotes": 10,
              "replies": {
                "gezscb7": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezscb7/",
                  "text": "I’m in Jewish Studies, and I specifically run a multi-day writing workshop at the beginning of each academic year for grad students for this reason. We get very poor papers (many from students for whom English is a foreign language) that are both formally and stylistically inconsistent. In my lessons I emphasize concrete processes on accomplishing good style, formatting, and planning and organization of arguments. My main goal is to demystify the process for students, who tend to think it’s a gift or some sort of product of inspiration to be able to write well. I can’t say the papers we get are great after that class, but they are markedly improved.",
                  "author": "fraxbo",
                  "created": 1607381426,
                  "upvotes": 7,
                  "replies": {
                    "gezuq1e": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezuq1e/",
                      "text": "This is kind of the stuff we’d like to do. In my country people go through a 2-year degree before arriving in undergrad where they have “literature” classes (very basic stuff) and the writing conventions they teach are just not adequate for academic writing and undergrad papers, so students tend to come in with very clunky and formulaic writing habits, and they also tend to all make the same (types) of grammar mistakes that are more advanced than what they usually teach before they reach undergrad. The goal would be to teach them a basic term paper structure and educate them on common grammar or stylistic mistakes people make.",
                      "author": "spacenb",
                      "created": 1607382643,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "gf2n1gc": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf2n1gc/",
                      "text": "Working on second masters, TAing in another department (first time as a TA)\n\nHoly Effing Poop, I have to read really horrible writing sometimes.  It's just sad.  I mean it's a state school, however these are grad students and I would never have assumed someone could get through undergrad and be as bad as the bottom 25% of students.\n\nI schooled at a higher bar than I think most people at my uni did.",
                      "author": "quantum_prankster",
                      "created": 1607449010,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gf016i2": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf016i2/",
              "text": "I'm glad I'm in CS where citations are done using bibtex.",
              "author": "zacker150",
              "created": 1607386016,
              "upvotes": 3,
              "replies": {}
            },
            "geyfnue": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyfnue/",
              "text": "I don't understand why MLA is even a thing anymore, now that the internet lets you find almost any paper in seconds.",
              "author": "AgoRelative",
              "created": 1607359927,
              "upvotes": -1,
              "replies": {
                "geyh7by": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyh7by/",
                  "text": "Ehh, I do disagree. First and foremost, it makes it very clear whose ideas are whose. Second, it provides professional credit to the cited author (particularly in formal venues). Third, it helps people find the exact work you're talking about. Saying, \"According to Robert Kohn\" isn't enough. Which Robert Kohn? Which year? Which paper? Which journal? Is it a book? Who knows without MLA (or APA etc)?",
                  "author": "silversatire",
                  "created": 1607360623,
                  "upvotes": 14,
                  "replies": {
                    "geyuxzv": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyuxzv/",
                      "text": "I mean the nuances of the formatting, MLA vs. APA vs. Chicago Style -- it seems unnecessary.",
                      "author": "AgoRelative",
                      "created": 1607366013,
                      "upvotes": 7,
                      "replies": {
                        "gez1mde": {
                          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez1mde/",
                          "text": "You mean that's not just a bibliography style in your .tex file?",
                          "author": "axialintellectual",
                          "created": 1607368625,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "gezqjd9": {
                          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezqjd9/",
                          "text": "Except different styles highlight different info as appropriate to various disciplines.\n\nI agree that a comma vs a colon in a bibliography is inconsequential, but seeing the point of the pattern is legit. Especially when trying to ensure students (in particular) understand the differently kinds of documents and the variation in value in some of those (academic vs grey vs white vs non academic).",
                          "author": "WDersUnite",
                          "created": 1607380509,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "geyttba": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyttba/",
                  "text": "I don't know what field you're in where you're finding every paper in seconds. A lot of things I'm citing are only available in hard copies or random scans from a library in Germany. But we don't use MLA, we use Chicago. There really isn't a need for multiple citation standards in my book.",
                  "author": "ExtraSmooth",
                  "created": 1607365573,
                  "upvotes": 6,
                  "replies": {}
                },
                "geyqi6g": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyqi6g/",
                  "text": "Citations point you to a source in case you want to read more about that specific topic. They do this in an easy to use format, including providing a hyperlink if one is available, to make it simple for the audience to find the information if they want to.",
                  "author": "phoenix-corn",
                  "created": 1607364275,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "gey6gau": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey6gau/",
          "text": "Hear hear.  Plenty of data showing that it works.  Not a goddamn thing on why.\n\nLearning Center Administrator here.  As far as why tutoring works, my intuitive explanations, supported by observational anecdata, are just as likely to be valid as any of the 'studies' published in field journals.  One of our Assistant Directors was hired because they had just finished a doctorate in Rhet/Comp with an emphasis on assessment.  In four years, we've come absolutely no closer to knowing why it works.",
          "author": "lucianbelew",
          "created": 1607355337,
          "upvotes": 13,
          "replies": {
            "geyhxdy": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyhxdy/",
              "text": "I've drawn up some pretty good plans to study this (at least in my local context). The problem is that it would require the administration of my university to give a shit. As long as the numbers look okay-ish, they really have no interest in getting at the \"why\" and \"how\" of student support (or learning, in general).",
              "author": "cdb3492",
              "created": 1607360930,
              "upvotes": 7,
              "replies": {
                "geyikko": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyikko/",
                  "text": "Yeah.  One major point of resistance we've found is that faculty are awfully cagey about collaborating, or even vouching for the merit and worth of such inquiry.  They tend to view anything like that as a trojan horse for efforts to exert administrative control over their pedagogy.",
                  "author": "lucianbelew",
                  "created": 1607361176,
                  "upvotes": 6,
                  "replies": {}
                },
                "gezok3b": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezok3b/",
                  "text": "A couple years ago I ended up as the chair of the external review of my university's writing program. Everybody had so many great suggestions, precisely zero of which have been acted on because of issues with funding or the potential to start a war with multiple unions. Talk about a great time.",
                  "author": "justaboringname",
                  "created": 1607379481,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gey3yu6": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey3yu6/",
      "text": "Also - no-one knows how to run actual control experiments and I don't feel like I can ever trust SEM/TEM images in low impact nano journals.",
      "author": "ardbeg",
      "created": 1607354017,
      "upvotes": 54,
      "replies": {
        "gf039dm": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf039dm/",
          "text": "Old classic:\n\n\"Fig. 1 show representative images obtained under conditions xyz.\"\n\nModern version:\n\n\"Fig. 1 shows the absolute best images we could find.  The others were all incomprehensible garbage.\"\n\nDepressingly common version:\n\n\"Fig. 1 shows the absolute best images we could find, which we then modified in Photoshop to get rid of all the undesirable features that contradict our conclusions.\"",
          "author": "ChemMJW",
          "created": 1607387144,
          "upvotes": 4,
          "replies": {}
        },
        "gf0lxgj": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0lxgj/",
          "text": "i hear you with SEM/TEM. The entire sample may be garbage, but you can zoom into a cherry picked spot to perfectly explain whatever you need.",
          "author": "mysteriousKM",
          "created": 1607397226,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "geyb975": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyb975/",
      "text": "[deleted]",
      "author": null,
      "created": 1607357769,
      "upvotes": 45,
      "replies": {
        "gezgfjx": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezgfjx/",
          "text": "This reminds me of my first public health research position after completing my Anthropology degree (which involved in-depth fieldwork) and someone in the org starts explaining how great their qualitative research in their 'mixed method' approach is because wait for it... they called up a 'stakeholder' and asked them a question...",
          "author": "fedawi",
          "created": 1607375177,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "gey3662": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey3662/",
      "text": "[deleted]",
      "author": null,
      "created": 1607353576,
      "upvotes": 35,
      "replies": {
        "gey44e8": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey44e8/",
          "text": "You’re right. I know statisticians who are working hard on developing models involving heavy tailed distributions for spatial/spatiotemporal modeling for this exact reason.",
          "author": "for_real_analysis",
          "created": 1607354102,
          "upvotes": 9,
          "replies": {}
        },
        "gez9xgm": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez9xgm/",
          "text": "You're damned right about that (atmospheric scientist here). Then again the stuff I model only lasts a couple hours, haha. And I worry about getting the turbulence and microphysics characteristics just right.... the parameterizations in climate models are many, and  these parameterizations can interact in weird unphysical ways. Still, it's a ton better than it used to be. But attributing severe weather events in these climate models to AGW is, I agree, a bit of a stretch with the current models/hardware.",
          "author": "__x0x__",
          "created": 1607371983,
          "upvotes": 5,
          "replies": {
            "gf5hbks": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf5hbks/",
              "text": "Forgive me for my ignorance. What is AGW?",
              "author": "stochastic-student",
              "created": 1607504609,
              "upvotes": 1,
              "replies": {
                "gf633xv": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf633xv/",
                  "text": "Anthropogenic global warming",
                  "author": "__x0x__",
                  "created": 1607523526,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gey6i9g": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey6i9g/",
      "text": "Computational Fluid Dynamics: the amount of papers which do not list all relevant schemes or solution methods is insane. At least 1/3 of these papers cannot be reproduced with the info available. Also, sometimes authors blatantly lie about their mesh resolution, which greatly influences the result. Since there's not really a way to check this, no one can do anything about this issue.",
      "author": null,
      "created": 1607355366,
      "upvotes": 34,
      "replies": {
        "gezrcmu": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezrcmu/",
          "text": "Would love it if there was a journal that shared case files and meshes. I've found some particularly shitty studies recently with some very over fitted parameters.",
          "author": "spice_up_your_life",
          "created": 1607380922,
          "upvotes": 3,
          "replies": {
            "geztj4h": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geztj4h/",
              "text": "There's this new OpenFOAM journal which was just launched by the Openfoam founders. They have these exact goals, I'm really curious if this takes off. \n\n\nhttps://journal.openfoam.com/index.php/ofj/about\n\nProbably not though, because a huge part of the community doesn't want to be publicly embarrassed.",
              "author": null,
              "created": 1607382036,
              "upvotes": 3,
              "replies": {
                "gf12wog": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf12wog/",
                  "text": "Yeah I have actually subscribed.\n\nAnd being at the more applied end of cfd, I'm terrified of publishing and putting my self out there in journalsimr this because I feel like what I do isn't up to scratch!",
                  "author": "spice_up_your_life",
                  "created": 1607408088,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gey33q9": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey33q9/",
      "text": "aspiring eating disorder specialist here. what frustrates me is the way that some things that should probably have clearer definitions, on the academic side at least, seem to be completely subjective. example: i'm working on research about the effects of exercise during the recovery process, and there seems to be no absolute metric for what counts as \"excessive exercise\" in patients. i read a meta-analysis of hundreds of studies across about four decades and they might say anywhere between 3-10 hours a week is \"excessive,\" or not give any quantifiable definition of excessive at all. no wonder treatment options can be so shoddy, everything beyond the generic DSM guidelines seems open to interpretation.",
      "author": "slime__cube",
      "created": 1607353538,
      "upvotes": 60,
      "replies": {
        "gey7bc1": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey7bc1/",
          "text": "That sounds like an opportunity for scholarship. Define that shit in a paper that everyone will cite henceforth.",
          "author": "Frogmarsh",
          "created": 1607355784,
          "upvotes": 57,
          "replies": {}
        },
        "gey7tb9": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey7tb9/",
          "text": "Wow, and 3 hours of exercise per week (~30 min/day) is literally what my doctor told me to do! For general health, no eating disorder. So funny that in some stuff you're reading that's considered \"excessive\".",
          "author": "pb-pretzels",
          "created": 1607356040,
          "upvotes": 27,
          "replies": {
            "geyao7r": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyao7r/",
              "text": "Excessive in the context of a person recovering from an eating disorder, in which they presumably aren’t supposed to be burning too many extra calories. Patients with restrictive eating disorders can use excessive exercise as a way to feel less guilty about what they are eating in recovery, so I can imagine that even small-ish amounts of exercise could be mentally detrimental to the process.",
              "author": "BovineAlex",
              "created": 1607357482,
              "upvotes": 21,
              "replies": {}
            }
          }
        },
        "gezl7sd": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezl7sd/",
          "text": "As someone that went thru a ton of eating disorder treatment... can you guys get your shit together lmao. Not you specifically but what you write here doesn't surprise me, just that there's a lot of ED specialists who don't agree with each other or really know what they're doing.\n\nI also feel like a lot of ED specialists/clinicians don't really understand EDs very well or the motivation behind them... research should probably consist of more fieldwork / surveys of current and former ED patients.",
          "author": "kmalevich",
          "created": 1607377660,
          "upvotes": 4,
          "replies": {}
        },
        "gez0l9s": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez0l9s/",
          "text": "Have you checked any guidelines set forth by the American College of Sports Medicine with regards to eating disorders?",
          "author": "dr_exercise",
          "created": 1607368224,
          "upvotes": 3,
          "replies": {}
        },
        "geypp15": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geypp15/",
          "text": "I agree with this but studied experimental psychology and am pursuing my PhD in Educational Leadership/Evaluation",
          "author": "PenguinFeather4",
          "created": 1607363955,
          "upvotes": 2,
          "replies": {}
        },
        "geyddhz": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyddhz/",
          "text": "I'm sorta in your area! At one point I was looking into taste disorders and how that affected aversions to foods. As someone from a wet lab background, I banged my head against the desk too many times from the amount of poorly executed studies that took two or more barely-correlating variables and brought them together. Don't even get me started on the dietetics crowd..",
          "author": "ladypimo",
          "created": 1607358813,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gey4g4y": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey4g4y/",
      "text": "Single case study analyses of some sort of intervention designed to evoke a target behavior.  You mean you can condition someone to show the behavior that you want with several weeks of prompting that exact behavior?!?  Who would have ever thought that would work!?  Bonus points when they don't even include a maintenance period, so the entirety of the study is whether or not they could get someone to increase their behaviors while they were being directly prompted to do so with no follow-up.",
      "author": "ohbonobo",
      "created": 1607354280,
      "upvotes": 24,
      "replies": {
        "geyswj9": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyswj9/",
          "text": "Fellow behavioral scientist here, I feel you...",
          "author": "Feigenbaum-derAmsel",
          "created": 1607365219,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "geypxxi": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geypxxi/",
      "text": "Anybody who presents numbers on human trafficking is full of it.  Nobody knows and everybody guesses.  (And most of these guesses are based on ideological assumptions about what constitutes \"trafficking\".)",
      "author": "Remansilent",
      "created": 1607364052,
      "upvotes": 25,
      "replies": {
        "gf0azc3": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0azc3/",
          "text": "I'm a graph theorist and have a colleague who works in human trafficking research. I approached them about looking at networks together, and they just said that we don't know anything. We just don't. There's not enough information to do the most basic modeling.\n\nBummer, because I wanted to actually contribute to society. Guess it's back to dots and lines.",
          "author": "AerosolHubris",
          "created": 1607391271,
          "upvotes": 5,
          "replies": {}
        },
        "gf1zsxl": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1zsxl/",
          "text": "I've had to sit through a few human trafficking presentations as part of my hospitality studies, and I always wonder how they're able to get such specific numbers on a nationwide or even worldwide basis... Guess they're full of shit.",
          "author": "comped",
          "created": 1607437561,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "geylzvo": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geylzvo/",
      "text": "I’m in neuroscience but I think this affects many fields: competition where only people/labs that publish  positive results in “high-impact” journals get to have stable funding/employment. This leads to tons of overselling, p-hacking, and alienation of good scientists. To fix this, we desperately need to change the way we evaluate science and scientists.\n\nWhat if there is a scientist or lab that chooses an important topic, develops a thoughtful hypothesis, successfully applies the appropriate methods to address the hypothesis, and then gets negative results? Our current system makes this person/lab ineligible to continue doing science. Meanwhile, if this person or lab happens to lack integrity or is (willfully?) ignorant of what makes research reproducible, they can go ahead and publish some irreproducible p-hacked BS, polluting the literature for the sake of their own academic survival.",
      "author": "illmaticrabbit",
      "created": 1607362507,
      "upvotes": 18,
      "replies": {
        "gezmvt6": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezmvt6/",
          "text": "> To fix this, we desperately need to change the way we evaluate science and scientists.\n\nI've had this crazy idea that the NIH ought to be running journals, thereby closing the loop, maybe even allowing the paper submission and grant submission/renewal processes to be combined, to a degree.  Taking it further, they could ban grantees from publishing in for-profit journals and basically force people to treat these NIH journals as the new Nature/Science/Cell.",
          "author": "TurnsOutImAScientist",
          "created": 1607378556,
          "upvotes": 8,
          "replies": {
            "gf01lfr": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf01lfr/",
              "text": "I don’t think that’s a crazy idea at all. I think what’s crazy is that we allow these private companies to have such an outsized and undeserved influence on publicly-funded science. \n\nUnfortunately, NIH’s evaluation of scientists/grants is also pretty flawed. The NIH and its study sections also love to count publications and are biased towards positive results.",
              "author": "illmaticrabbit",
              "created": 1607386244,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gey91fm": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey91fm/",
      "text": "[deleted]",
      "author": null,
      "created": 1607356657,
      "upvotes": 38,
      "replies": {
        "geycdl2": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geycdl2/",
          "text": "That fish example though was about the dangers of not doing multiple comparison correction and was done a decade ago. Everyone's been doing correction for a while now. That's not a problem with the field anymore, and I believe parameter flexibility is also getting better as people learn to do reproducible pipelines and preregistration (e.g. [this](https://psyarxiv.com/9eaxk) showing how careful modern multivariate methods are so much more reliable than univariate approaches). I don't really have faith in small-sample univariate findings, but that's not the entirety of the field. It's just a shame the vast amount of grant money it's taken to iterate and realize mistakes like that for neuroimaging vs. behavioral data.",
          "author": "smbtuckma",
          "created": 1607358322,
          "upvotes": 20,
          "replies": {
            "geyzri9": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyzri9/",
              "text": "[deleted]",
              "author": null,
              "created": 1607367899,
              "upvotes": 13,
              "replies": {
                "gezb080": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezb080/",
                  "text": "Were those papers you're working with published recently? I guess \"everyone\" is too simple to say (I for sure reject a few papers a year as a reviewer for not doing it), and it's better to say instead that \"the field\" at least knows its necessary, in the sense that almost everyone learns about it and you're more likely than not to be criticized for its absence. \n\nYour post-doc story just gave me flashbacks to this four-page round 2 review I submitted last month explaining exactly how and why double-dipping data is bad, cuz after the first round the authors were like \"but we've always done it that way and otherwise we don't get results so we think you're wrong.\" Ugh.",
                  "author": "smbtuckma",
                  "created": 1607372499,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gf1k9yu": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1k9yu/",
              "text": "Yeah no. I get paid to \"do algorithms on images\" for a group of neuroscientists and, as the algorithms get more advanced everything gets more and more bullshit.\n\nI spend my days screaming \"YOU CAN'T DO THAT. IT IS OUTRIGHT WRONG\" and nobody listens to me...But they get published in high IF journals!!",
              "author": "lucaxx85",
              "created": 1607425310,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "geybj06": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geybj06/",
          "text": "The dead salmon is such a great example. Ugh, I sometimes (like today) just get so discouraged by these known problems. How do we save neuroscience?!",
          "author": "dreamingtriangle",
          "created": 1607357903,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "geyleay": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyleay/",
      "text": "Ecologist here, the number of people who don’t understand basic linear models and are sloppy with their analyses is infuriating. Ecological data is COMPLEX. If you are have a faculty position and I have to explain to you what a beta coefficient is you should have your job taken away.",
      "author": "zabulon_",
      "created": 1607362276,
      "upvotes": 18,
      "replies": {
        "gf0tz0g": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0tz0g/",
          "text": "Can you elaborate on not understanding basic linear models and analysis sloppiness?  Is there a source you would recommend to outline best practices?",
          "author": "Melivora_capensis",
          "created": 1607401837,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gey9c64": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey9c64/",
      "text": "Economics: Pretending that people behave according to mathematical models.\n\nIt ain't so.",
      "author": "davidzet",
      "created": 1607356809,
      "upvotes": 75,
      "replies": {
        "geytggi": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geytggi/",
          "text": "Having listened to a lot of economics podcasts (which obviously makes me an expert, /s), I always feel like economists make a lot of big generalizations about what people want. Most people are not thinking about how to maximize their productivity all the time",
          "author": "ExtraSmooth",
          "created": 1607365436,
          "upvotes": 20,
          "replies": {
            "gezguvc": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezguvc/",
              "text": "That’s my point. Hopefully those podcasts are talking about all the “weird” (but explainable) things people do. The trouble is that people follow different decision algorithms that are internally consistent (rational) but not always visible to outsiders. \n\nAgent based models are trying to reproduce group dynamics but they suffer GIGO modeling as well as training data bias.",
              "author": "davidzet",
              "created": 1607375395,
              "upvotes": 6,
              "replies": {
                "gezle1a": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezle1a/",
                  "text": "I would argue that people are often NOT internally consistent",
                  "author": "kmalevich",
                  "created": 1607377751,
                  "upvotes": 3,
                  "replies": {
                    "gf19uen": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf19uen/",
                      "text": "So would Daniel Kahnneman and Amos Tversky",
                      "author": "justfreehouse",
                      "created": 1607414251,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "gf1kghy": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1kghy/",
                      "text": "Although that seems right (many Trump supporters with respect to what he says vs does), I think there's also a need to get \"deeper\" into WHY they have \"conflicting\" perspectives on topics.",
                      "author": "davidzet",
                      "created": 1607425498,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "geztswj": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geztswj/",
          "text": "[deleted]",
          "author": null,
          "created": 1607382176,
          "upvotes": 13,
          "replies": {
            "gf1a8w1": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1a8w1/",
              "text": "They do but they don’t. There’s a history and tradition of the neoclassical view that is predicated on human beings as rational actors. As behavioral economists like Kahnneman, Tversky, and Thaler showed otherwise, those steeped in the original neoclassical tradition have had difficulty accepting that their paradigm is incorrect. Their work would no longer apply if so. It would be incorrect (because it is incorrect). In short, there are reasons economists don’t know, or choose to not know, that their paradigm is wrong. However, events (like the recession) have begun to force them to see the reality, and accept the technocratic position of behavioral economists. If it is a sea change it is a slow one, though.\n\nHope I got all that right. It’s not my field.",
              "author": "justfreehouse",
              "created": 1607414646,
              "upvotes": 2,
              "replies": {}
            },
            "gf12e9z": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf12e9z/",
              "text": "When ppl try to tell me markets are good for healthcare my brain goes straight to this.",
              "author": "Wu-Tang_Hoplite",
              "created": 1607407670,
              "upvotes": 1,
              "replies": {}
            },
            "gf1kiy9": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1kiy9/",
              "text": "Sadly, his work is NOT often taught in basic (Principles) courses, so that \"knowledge\" is not transmitted to students, many of whom are \"done\" with \"useless\" economics after one class...",
              "author": "davidzet",
              "created": 1607425571,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gf1qzyc": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1qzyc/",
          "text": "yeah, they are so blind to it that they gave Robert Schiller a \"Nobel\" Prize for pointing out the obvious",
          "author": "radionul",
          "created": 1607431589,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gexxipa": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gexxipa/",
      "text": "The fact that many of the researchers are completely unable to put their recommendations into practice, or even prove that their theory works.\n\n(Interdisciplinary scholar, but originally from management/commerce)\n\nedit: many, not all. Some are legitimately spectacular, but I've worked with enough sketchy 'paper mill' professors to be wary, now",
      "author": "NeoPagan94",
      "created": 1607350243,
      "upvotes": 48,
      "replies": {
        "gey9uc1": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey9uc1/",
          "text": "This is so true in the business field (I’m in accounting).  I’ve seen presentations where the author was asked point blank to give a real life example of their theory in practice, and they simply could not.",
          "author": "JimmyThePete",
          "created": 1607357066,
          "upvotes": 23,
          "replies": {
            "gf0wbjw": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0wbjw/",
              "text": "It's so embarrassing, and sad! I've blacklisted work from professors who have openly ridiculed the fact that their work has no applications but publishing 'research' on it gets them tenure. It just makes a mockery of the point of empirical work, and genuine attempts to advance the field. And universities being ivory towers that are separate from industry is a biiiig part of it. You've got all these experts crowded in a building together - use them!",
              "author": "NeoPagan94",
              "created": 1607403319,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "geyb9ym": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyb9ym/",
          "text": "[deleted]",
          "author": null,
          "created": 1607357779,
          "upvotes": 11,
          "replies": {
            "gf0w02s": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0w02s/",
              "text": "Godspeed to you my friend, the industry desperately needs people like you who can actually access, and read, the research we're churning out. What's the point if nobody uses it?? Hopefully I can join you in the reasonable walls of 9-5 someday too.",
              "author": "NeoPagan94",
              "created": 1607403112,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gf21v4h": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf21v4h/",
          "text": "This applies like hell in hospitality.",
          "author": "comped",
          "created": 1607438732,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "geysxiw": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geysxiw/",
      "text": "Wow so many fields in STEM are struggling with non-replicable results in academic literature.. it’s a crisis in making",
      "author": null,
      "created": 1607365230,
      "upvotes": 17,
      "replies": {
        "gf0b33i": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0b33i/",
          "text": "[deleted]",
          "author": null,
          "created": 1607391325,
          "upvotes": 11,
          "replies": {
            "gf0ctpc": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0ctpc/",
              "text": "Yeah true haha",
              "author": null,
              "created": 1607392234,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gf0lifr": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0lifr/",
          "text": "no one seems to care. its a well known secret.",
          "author": "mysteriousKM",
          "created": 1607396996,
          "upvotes": 2,
          "replies": {}
        },
        "ggv8s8t": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/ggv8s8t/",
          "text": "I’d agree with this, but there is a wide variety. If you consider psych STEM, then that alone has so many BS, p-hacked papers, it’s insane. It generally gets better as you move towards chem and physics, but still..",
          "author": "jadedplutonomy",
          "created": 1608782195,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gey7mjg": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey7mjg/",
      "text": "The new methods being introduced. They are extremely complicated and the methods that grad students adopt barely scratch the surface of the method. When we attend webinars on the method, I almost always feel like I know nothing. But I just go with it.... because you know, you have to.\n\nAlso, every year there are new sub-methods being introduced under the parent method. New reporting measures that are incredibly confusing and complex. Constantly changes and it is full of jargons that no average grad student will be able to catch up. Not to mention attending the conferences with the latest update on the method cost a lot $$$$$. \n\nBusiness student here. Still have no idea what the method is truly about.",
      "author": "givemeyourdonut",
      "created": 1607355944,
      "upvotes": 15,
      "replies": {
        "gezcaat": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezcaat/",
          "text": "*Bayesian has entered the chat...*",
          "author": "TrillaryBlinton",
          "created": 1607373111,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "gey3dzr": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey3dzr/",
      "text": "I am in economics. If you see a recent empirical paper without a theoretical model (their estimation would be called \"reduced form\" as opposed to structural in this case), don't bother reading it. It is just a bunch of regressions and some BS interpretations.",
      "author": "amhotw",
      "created": 1607353698,
      "upvotes": 29,
      "replies": {
        "gey5yd5": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey5yd5/",
          "text": "Can confirm, but even then, I hate it when theoretical models make very strong assumptions and casually drop something of the sort \"loosening this assumption might be more adequate, but make the model analytically and computationally intractable, therefore we won't try it, and we have reason to believe it won't change the results\"",
          "author": "Tryrshaugh",
          "created": 1607355078,
          "upvotes": 13,
          "replies": {}
        },
        "gf0473l": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0473l/",
          "text": "Interesting.  Can you say more about what you mean?  I'm not in economics, so the territory isn't familiar to me.  In my field, one would absolutely trust the empirical data over a theoretical model any day of the week.  We have a saying that you fit theory to the data, you don't twist data to fit the theory.",
          "author": "ChemMJW",
          "created": 1607387663,
          "upvotes": 1,
          "replies": {
            "gf114x9": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf114x9/",
              "text": "You can get almost any result from a purely empirical or purely theoretical work if you torture your data/model enough. However, if you estimate a theoretical model, then there will be less room for you to exploit and your parameters will have real interpretations, so your results will be more meaningful. Of course, you can still fake a lot of things but it becomes more difficult and in case you are not faking, your results are easier to interprete.",
              "author": "amhotw",
              "created": 1607406694,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gey9npq": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey9npq/",
      "text": "[deleted]",
      "author": null,
      "created": 1607356972,
      "upvotes": 27,
      "replies": {
        "gezy9xc": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezy9xc/",
          "text": "I’m in developmental genetics and see the same thing! Everyone has gotten so much better about including data and code in their pubs. But GOs/pathways are used in (IMO) really inappropriate ways as are gene expression data. Lots of untested assumptions that drive some aspects of the field.",
          "author": "Lamalaju",
          "created": 1607384469,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gey6875": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey6875/",
      "text": "I'm in host-microbe interactions and we have a \"fold change\" problem. The physiological relevance of a fold change is almost never clear, but by golly we're gonna make 3, 8 panel figures about them. \n\nMy more jaded side would also say the size of a publishable fold change is inversely correlated to the prestige of your lab/uni.",
      "author": "pastaandpizza",
      "created": 1607355221,
      "upvotes": 14,
      "replies": {
        "gf12n8e": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf12n8e/",
          "text": "My favorite sus data in this category is fold change of flow cytometry data normalized to a control and none of the bounding/ raw data is shown. I'm in chemical biology/ pharmacology.",
          "author": "Wu-Tang_Hoplite",
          "created": 1607407873,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "geyibl4": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyibl4/",
      "text": "Simply not containing enough information to reproduce methods. If methods are listed in papers I read (which are math and pseudocode in my field), they will only list one formula with no way to know how it was derived, or they'll start with something insanely fundamental like one of Maxwell's equations and then jump to their new formula while skipping all of the intermediate math. Whenever I review papers, I will keep requesting more details until I can either run through the math myself or I can confidently understand how to implement the code. I get so much pushback from every author, and many say they can't provide those details because it's proprietary to their lab. But luckily I've always been backed up by the other reviewers.",
      "author": "OpticaScientiae",
      "created": 1607361080,
      "upvotes": 13,
      "replies": {
        "gezmk5a": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezmk5a/",
          "text": "This. If you can’t put the equations out there because they’re proprietary, sell them to a software company, don’t try and publish that shit.",
          "author": "QuoVaddisLaddie",
          "created": 1607378378,
          "upvotes": 5,
          "replies": {}
        },
        "gf5iz5i": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf5iz5i/",
          "text": "I feel this so much as I try to re-implement a spectral solver a post-doc did.. We are trying to figure his algorithm and code out, even in the same lab group. \n\nMe: Okay, start from scratch. Here are Maxwell's, which I Fourier transform. Wait, where did that term come from?\n\nEdit: I didn't even touch on how the principal paper states it can be solved by a scheme that isn't described.",
          "author": "stochastic-student",
          "created": 1607506358,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gey5aa1": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey5aa1/",
      "text": "I’m in population studies/demography.\nI’m finding the use of big data to model demographic behaviours particularly hard to comprehend.",
      "author": "ExoticExchange",
      "created": 1607354728,
      "upvotes": 12,
      "replies": {}
    },
    "gey4jrg": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey4jrg/",
      "text": "Deaf Education here. I'm utterly done with medical docs, particularly pediatrics and early intervention audiologists, who deliberately neglect to read or willfully misread the massive corpus of ASL (and other sign language) research and its positive affects on deaf neurological and sociocultural development. One cannot ethically act or advise if one is ignorant. Yet they do. All the fucking time. And refuse to be accountable or take responsibility for their failures. (Then teachers and students get blamed).",
      "author": "ocherthulu",
      "created": 1607354335,
      "upvotes": 33,
      "replies": {
        "gf2pckc": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf2pckc/",
          "text": "If only Doctors would be liable for malpractice for giving advice when not versed in the most current knowledge -- at least they would be equal to lawyers, who must give advice with up-to-date information concerning case laws and codes (and very often need to research prior to advising as a result).",
          "author": "quantum_prankster",
          "created": 1607450073,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gez8yeq": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez8yeq/",
      "text": "Publication bias (insignificant results not published).",
      "author": "isaac-get-the-golem",
      "created": 1607371528,
      "upvotes": 10,
      "replies": {}
    },
    "geza430": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geza430/",
      "text": "Work that didn’t result in publication = literally no work. Nobody got time to care for the actual work done.",
      "author": "chengstark",
      "created": 1607372071,
      "upvotes": 10,
      "replies": {}
    },
    "geyu11y": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyu11y/",
      "text": "In systems neuroscience, a typical experiment will do this:\n* stick a recording electrode into a new brain region\n* manipulate some environmental variable, and see correlated neural activity\n* lesion/inactivate the brain region and observe disrupted performance in some behavior that uses the environmental variable\n\n==> this brain region *does* this thing\n\nWhen in fact, two giant things are left untested:\n- are there other brain regions doing the same thing?\n- are there other stimuli which would produce the same results?\n\nIt’s impractical to test every brain region and every combination of stimuli, but we are left with false conclusions about the function of a brain area. Movement signals, for example, are broadcast all over cortex, even in sensory regions. Inactivating a region only proves that it’s part of a network of areas (possibly the whole brain) which must be functioning in order for the task to work.",
      "author": "LetThereBeNick",
      "created": 1607365656,
      "upvotes": 8,
      "replies": {}
    },
    "gey80qa": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey80qa/",
      "text": "I was in neuroscience for a while before I switched to the humanities. Ultimately what did it for me was the realization that who funds the project conclusively determines the results published.\n\nI was working on a project in a lab and was finding no significance but was told by the PI and my postdoc supervisor to manipulate the data in an unethical way so as to reach the conclusion the grant donors wanted to reach.",
      "author": "heckingfriendd",
      "created": 1607356145,
      "upvotes": 13,
      "replies": {
        "gezync2": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezync2/",
          "text": "That's some seriously fraudulent behaviour that would have the prof and postdoc lose their careers forever.  You concluded that this is how all neuroscience works?",
          "author": "MillennialScientist",
          "created": 1607384666,
          "upvotes": 6,
          "replies": {
            "gf07ij1": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf07ij1/",
              "text": "Sure it may be fraudulent, but that doesn't mean it's not common. I'm not the only one with this experience. The school I attended had a very strong neuro department (it was part of a major medical campus), and this was a common narrative passed around campus and at conferences attended. This was something that floated juuust under the surface at all times. My experience that I mention here which made me realize that I was not happy in the field was the breaking point because I was in disbelief that they would be that overt about it.\n\nAs for your other question... It is my hope that there are some pure studies and labs out there, but you have got to be some sort of naive if you live in the US or any other highly industrialized heavily capitalistic society and still think money doesn't affect scientific and even some (if not most) academic studies. Unfortunately, who funds a project can tell you a whole lot about a study and the validity. I find [this](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3954632/) NIH publication to be quite helpful if it is your first time encountering the 'money issue.' I didn't just \\~decide\\~ all of neuroscience works like this, this is common knowledge in most fields. Even if it wasn't, this is how my well-respected department worked, and that is disturbing in and of itself as many people take what the department puts out to be God's truth (whether or not they should).\n\nI take it that you're a scientist from your username, so I am honestly shocked you've never come across this issue before!\n\nEdit: to be fair, I guess I could have always moved to a country where this isn't an issue (if there is one), but I wasn't that dedicated and I have a partner that needs to be here in the US.",
              "author": "heckingfriendd",
              "created": 1607389448,
              "upvotes": 2,
              "replies": {
                "gf7438m": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf7438m/",
                  "text": "You are 100% on the money. The book Science on Stage by Stephen Hilgartner does a really good job on explaining how scientific authority is rhetorically expressed within academic writing. It sucks because this is very prominent in the grant-heavy sciences and thus a lot of the tension around discussing the influence of money is at times conflated with someone's personal career success and perception of themselves. My department (communication/social science) is trying to push for the discipline to resemble this grant system and I definitely fear the overall impact it will have.",
                  "author": "ketamet",
                  "created": 1607541184,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gezh2pc": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezh2pc/",
          "text": "(The fact that academia and science are being controlled and changed for economic profit is of course horrible) but I still find it kinda funny how the humanities are often labelled as “fake science, just made up to push (the left) agenda” when “real” science is, well, that",
          "author": "alviisen",
          "created": 1607375503,
          "upvotes": 4,
          "replies": {
            "gf0mj9k": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0mj9k/",
              "text": "Good point. The difference is that the hard sciences could be “real” in theory. The humanities are truly not sciences at all.",
              "author": "faze_not_phase_123",
              "created": 1607397563,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "geyhg7s": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyhg7s/",
      "text": "I'm in management. Many things are problematic to say the least. \n\nOne that bothers me a great deal is the idea that you need to justify diversity in the workplace. In other words, if it doesn't make the corporation money, then why would you treat minorities and women fairly?\n\nMethods and theory can be a problem but underlying assumptions are problematic as well.\n\nEdited because I misspelled “words “.",
      "author": "ThatProfessor3301",
      "created": 1607360731,
      "upvotes": 13,
      "replies": {
        "gf01r7d": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf01r7d/",
          "text": "Not an expert, but also did some business administration and management during my undergrad. Soooo much just felt so wrong, especially the unquestioned principle that profit needs to be maximized and costs need to be minimized ALWAYS. And any type of humane decision making was just seen as a cost.",
          "author": "Neckfold",
          "created": 1607386330,
          "upvotes": 1,
          "replies": {
            "gf1vmcg": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1vmcg/",
              "text": "I’m trying to teach it differently than this but students fight it. I’m in Texas so ...",
              "author": "ThatProfessor3301",
              "created": 1607434970,
              "upvotes": 2,
              "replies": {
                "gf5rghl": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf5rghl/",
                  "text": "Great to hear that you are making an effort though! Business education is in urgent need of an update. Keep it up.",
                  "author": "Neckfold",
                  "created": 1607515135,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "geyjlag": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyjlag/",
      "text": "Confirmation bias and disconnect between theoretical and applied archaeology. It's been a big one for a while, fitting the data to an assumed idea/pattern. Whilst there was a huge push back on this, at one point with a lot of archaeologists challenging our own bias of perception, it seemed to lead to an unproductive split.\n\nThere are those who bring on questions of ontology and epistemology and end up stuck in that loop of 'but can really know' and others who try and stick to the facts and reporting data, but still referencing assumed models. The former is important, but we need to work on how we apply it effectively, whilst the latter helps limit bold claims and unsubstantiated rumination, but is still working under assumptions that often can be dismantled with some research into the former group. Furthermore the former group really helps in engaging the public and bringing to light research (which I argue is pretty key to archaeology), whilst the latter group provides that strong evidence to document and is excellent commercial research projects outside universities. I'd really like there to be a shift where the two sides intermingle more within individual papers and reports, to help reduce confirmation bias, whilst still clearly presenting the raw data.",
      "author": "TheArcheoPhilomath",
      "created": 1607361572,
      "upvotes": 7,
      "replies": {}
    },
    "gez7dhf": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez7dhf/",
      "text": "Y'all I dunno if it makes me feel better or worse that there are problems in all of our fields. Maybe I need to ask another question (maybe in own post): how do you stay driven despite the widespread bs?",
      "author": "dreamingtriangle",
      "created": 1607370900,
      "upvotes": 7,
      "replies": {
        "gf2q9xw": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf2q9xw/",
          "text": "You can know you're doing good work.  In my case, I was an educator for ten years and in education management for six.  Now I am applying principles of systems engineering to education design.  \n\nI mean, in some broad sense, we haven't gotten systemically much better at education since the 1940s, not like breakthroughs in medicine and other sciences -- if what I do can contribute to wasting less educational time and resources in someone's life, then what do I care what BS some other person is up to?",
          "author": "quantum_prankster",
          "created": 1607450496,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gey3oq3": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey3oq3/",
      "text": "This is minor but it makes me crazy that almost all of our hypotheses are one-tailed but we use two-sided t-tests because they are more \"conservative\". I know that there are a lot of bigger issues with p-values, null hypothesis testing, etc, but I find this to be especially annoying for some reason.",
      "author": "geneusutwerk",
      "created": 1607353863,
      "upvotes": 21,
      "replies": {
        "gezp8z6": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezp8z6/",
          "text": "I agree, it effectively reduces alpha to 0.025. I think that may be a good thing but there was a good link above to arxiv showing a plot of the last million z scores published in medline - you can guess where the gap is!",
          "author": "0bAtomHeart",
          "created": 1607379838,
          "upvotes": 2,
          "replies": {
            "gf34c7l": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf34c7l/",
              "text": "Why is alpha 0.025?",
              "author": "Hoelie",
              "created": 1607456876,
              "upvotes": 1,
              "replies": {
                "gf39fqe": {
                  "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf39fqe/",
                  "text": "On a two tailed test you're splitting alpha between the upper and lower tails so alpha is effectively halved. However you usually have an apriori hypothesis about the direction of the effect. I think it changes the critical value? A statistician would be able to explain better (and I may be wrong nonetheless)",
                  "author": "0bAtomHeart",
                  "created": 1607459284,
                  "upvotes": 1,
                  "replies": {
                    "gf3b060": {
                      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf3b060/",
                      "text": "But alpha is only relevant under the null hypothesis and in that case the direction of the alternative doesnt matter as there is only a random direction. It is true that power is less than it could be with the same alpha so that is a waste but you are not more conservative.",
                      "author": "Hoelie",
                      "created": 1607460017,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gf15vjm": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf15vjm/",
          "text": "I agree this is a super minor thing compared to the larger issues, but I've definitely got confused faces for using one-tailed tests.",
          "author": "WavesWashSands",
          "created": 1607410605,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gexx7qc": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gexx7qc/",
      "text": "Extrapolating from the best piece of a single sample, claiming it's an established, reproducible and controllable process (photonics).",
      "author": "Why_So_Slow",
      "created": 1607350051,
      "upvotes": 16,
      "replies": {}
    },
    "gey9c4n": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey9c4n/",
      "text": "Multi-reference quantum chemistry methods.  It's unfortunate because the problems that need it are actually intractable without them, but they're still effectively p-hacking. You change your active space until you get your right answer, so you have to have a pretty large benchmark using the same active space on the same class of molecules before you can feel comfortable saying \"yes, this calculation is correct.\"",
      "author": "Mezmorizor",
      "created": 1607356808,
      "upvotes": 5,
      "replies": {}
    },
    "gez8udn": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez8udn/",
      "text": "Publishing ML paper without publish the code is the biggest BS I’ve seen. So many results on the papers are just nit picked that are unreproducible when you run the implementation yourself. What is the point in that if you write a paper about something that is not reproducible?",
      "author": "chengstark",
      "created": 1607371482,
      "upvotes": 6,
      "replies": {
        "gf0lb14": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0lb14/",
          "text": "or publishing a study that uses an application of ML/NN in a completely unrelated field, but the reviewers will have no clue about it so they will never question it and accept it cuz it sounds fancy and cool.",
          "author": "mysteriousKM",
          "created": 1607396878,
          "upvotes": 1,
          "replies": {
            "gf0sqzw": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0sqzw/",
              "text": "I do agree that these publications should not focus solely on ML or make the ML the major ‘selling point,’ since the field of study is not ML in the first place. However, if say it is an interdisciplinary study that does involve ML, it is still crucial to explain the validity of the process, since the conclusion depends on the result of a ML model.",
              "author": "chengstark",
              "created": 1607401104,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gf0l03t": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0l03t/",
      "text": "in material science, Xray photoelectron spectroscopy is completely subjective to the user doing the analysis. So easy to fudge the numbers in your favor, and no reviewer will ever question it. \n\nAnother one that ive recently realized is it that it literally doesnt matter how my fabricated device performs, ill find a reason in literature that supports whatever happens.",
      "author": "mysteriousKM",
      "created": 1607396704,
      "upvotes": 4,
      "replies": {}
    },
    "gey8rpk": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey8rpk/",
      "text": "Reference implementation of an interatomic potential (linked to in the paper) giving different results than shown in the paper. My pet peeve.\n\nShowing success stories of a method/approach, hiding failures under the rug.",
      "author": "Belzeturtle",
      "created": 1607356522,
      "upvotes": 5,
      "replies": {}
    },
    "geyx1e1": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyx1e1/",
      "text": "Oh I'm actually really glad that someone else feels the same way. I only work tangentially to the field I did my PhD in partially for this reason. I encountered so many practices and behaviors that could be considered \"sketchy\" that I lost all my enthusiasm for research. I really don't trust the majority of what is published anymore. If I pick a random paper out of a pile I feel like the chances that it's utter bs, even if it is written soundly, are pretty high-there's so much the reviewers never see and so much you aren't told. But that's why scientific consensus is so important. Unfortunately it's not very easy to express this opinion without sounding like some sort of conspiracy theorist",
      "author": "throwawaygrad001",
      "created": 1607366840,
      "upvotes": 3,
      "replies": {}
    },
    "gez5omn": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gez5omn/",
      "text": "I am in seismology. I have many reservations about b-value. The \"fact\" that earthquake recurrence is a stress meter without ever being able to quantify that stress in any way is sketchy at best...",
      "author": null,
      "created": 1607370227,
      "upvotes": 5,
      "replies": {}
    },
    "gf0wmv6": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0wmv6/",
      "text": "I'm in math. I wouldn't call bs, but sometimes I have the existential fear that the ZFC axioms are inconsistent, andb thus, much of the modern math research is void.\n\nWorst part is that there's no way to show the axioms are consistent. You can only know that they're inconsistent once you find a contradiction in the axioms.",
      "author": "handres112",
      "created": 1607403525,
      "upvotes": 5,
      "replies": {}
    },
    "geypj9p": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geypj9p/",
      "text": "Clearly defining exactly what is meant by whatever term. Social science terms and concepts can have many meanings in research and popular culture. \n(Phd student in Ed Leadership/evaluation)",
      "author": "PenguinFeather4",
      "created": 1607363893,
      "upvotes": 3,
      "replies": {}
    },
    "gezgmy0": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezgmy0/",
      "text": "[Engine research/automotive engineering]\n\nLiterally every single automaker cheats on their emissions tests, and almost everyone (from regular engineers to the EPA's own testing staff) knows exactly how they do it and exactly where to check to see if a cheat is being used. They get away with it because the policymakers at the EPA and CARB don't have the faintest idea what they're actually doing, and don't actually care about emissions targets so long as they can push along their own pet projects. Further, most of the cheats are relatively small, but now everyone's looking over their shoulders thanks to VW being idiots.",
      "author": "r3dl3g",
      "created": 1607375282,
      "upvotes": 3,
      "replies": {
        "gezlw7s": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezlw7s/",
          "text": "That’s neither a method, a finding or a line of reasoning though; that’s barely a field at all. Academic research in that field is about finding ways to help lower emissions. If companies choose to pay for that research, look at it, decide it’s too expensive or time-consuming and then cheat on their emissions tests, that’s not an academic failing. That’s corporate greed combined with regulatory oversight failures. Assuming it’s present in as large a scale as you claim, that is (I’ve only ever been on the research side, I don’t know if it is or not). It would be like blaming the tutor for the kid cheating on a test at school.",
          "author": "QuoVaddisLaddie",
          "created": 1607378019,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "gezi50r": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezi50r/",
      "text": "A lot of results are taken on trust in chip design. I've never been asked to provide proof of my designs working, schematics, or anything. As long as it looks right you can get published.",
      "author": "Matthew94",
      "created": 1607376050,
      "upvotes": 3,
      "replies": {}
    },
    "gezsnwx": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezsnwx/",
      "text": "I'm in mathematics which in principle should be all about precision and verification. Let's leave aside the question of how many mistakes get published. This is a question of human fallibility, laziness, and/or lack of care, and as such I imagine is transversal across all fields.\n\nWhat I feel is particular BS about math is how arbitrary and subjective is determining what is interesting or relevant. At some point it becomes an argument that something is interesting because X professor is thinking about it.",
      "author": "FilemonNeira",
      "created": 1607381592,
      "upvotes": 3,
      "replies": {
        "geztpf6": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geztpf6/",
          "text": "Thanks for your response! Good to hear from someone in math. I assumed math was somewhat immune to the kind of sloppy bs that pervades the biological sciences (poor quantitative analysis, bad stats practices if not outright p-hacking). Your answer nuances my assumption a bit. Interesting that you've identified a different source of bs. Is the significance of a topic being interesting/relevant related to the ability to publish on that topic? In other words (because I know that didn't make sense, hah), is it irksome that topics become undeservedly popularized when X prof is working on them, or are there external consequences of what the field finds interesting (limits your invitations to give talks or publish)?",
          "author": "dreamingtriangle",
          "created": 1607382127,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gezubyd": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezubyd/",
      "text": "Not my field but anything on the Behaviorist branch of psychology just stinks of pseudoscience.",
      "author": "TibiaKing",
      "created": 1607382449,
      "upvotes": 3,
      "replies": {}
    },
    "gf01sec": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf01sec/",
      "text": "qPCR for comparing/contrasting gene expression levels.  \n\nOne of my favorite horror stories of all time happened less than a year ago.  My institute got two new qPCR instruments, and a field engineer and application scientist were there to install them and conduct training.\n\nApplication scientist was talking about the importance of running melt curves after qPCR to make sure you're actually measuring what you think you're measuring.  She notices a lot of blank stares in the group of \\~20 people.  Asks how many of them are in the habit of performing melt curve analysis after each experiment.  My hand goes up immediately, along with maybe 2 or 3 others.  You can see that she's visibly stunned at how many people completely skip qPCR quality control and blindly trust whatever numbers the machine spits out.  Some people didn't even know what melt analysis was or why they should be doing it.  The trainer couldn't even manage to speak for 5-10 seconds, at which point she just stumbled forward in her presentation.  Later, I spoke to her one-on-one and asked how common an issue this is in the field.  She tells me that she's a field specialist for the USA and Canada and travels all over both countries doing qPCR training, anything from small schools to the highest reputation institutions there are, and is shocked at how little understanding most bioscientists have of what qPCR is and how it works.  I asked her point blank how much confidence she has in a standard qPCR data appearing in the literature.  Her response?  Maybe 25%.  Because people don't do quality control, and so they don't have the slightest clue whether their data are of even minimally acceptable quality.  That tells you all you need to know right there.  A field application scientist doing training at institutions all over North America doesn't believe the overwhelming majority of the qPCR data that make it into the literature.  And people win millions in grants and make their entire careers on this stuff, the vast majority of which may turn out to be irreproducible garbage.",
      "author": "ChemMJW",
      "created": 1607386347,
      "upvotes": 3,
      "replies": {}
    },
    "gf14psi": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf14psi/",
      "text": "Most people talking about the replicability crisis and similar, but honestly that's nothing compared to what we have in linguistics, in particular in syntax. There are decades of 'research' where the source of data is the linguist's own judgements of the grammaticality of sentences they constructed themselves (perhaps along with some judgements elicited from colleagues). In other words, an ultra-WEIRD population that puts the white American undergrad bias in fields like psychology to shame, miniscule sample sizes, and it's not just bad statistics - it's no statistics at all. Then there's the related line of research where weird decontexualised sentences are presented to language consultants to judge their grammaticality, or whether two referring expressions can be coreferential, or whatever, or where weird sentences are presented in a contact language like English or Spanish and all the research consists of is eliciting translations for those weird sentences. These types of research may tell us a lot about how weird sentences are judged and translated and how structures of English/Spanish/whatever are reflected in other languages, but they don't tell us much about how language works.",
      "author": "WavesWashSands",
      "created": 1607409600,
      "upvotes": 3,
      "replies": {}
    },
    "geyf7jd": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyf7jd/",
      "text": "In the field of Theology the pitfalls are many, from quacks who has no interest in a academical approach to biased professors which a score to settle on a specific area of religion.   \nThat said the constant oversight of religious studies have meant that Theology is a rather scientific study now, seeing we constantly have to give good, grounded arguments and can't just fling around ideas and statements compared to say Philosophy which as a more \"anything goes\" approach at my uni.",
      "author": "Jonas1412jensen",
      "created": 1607359708,
      "upvotes": 6,
      "replies": {}
    },
    "gezrjvo": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gezrjvo/",
      "text": "Numerical simulations that perfectly fit the analytical solutions, but conveniently omit parts of mathematical schema to be actually reproducible 1:1.",
      "author": "hbrgnarius",
      "created": 1607381025,
      "upvotes": 2,
      "replies": {}
    },
    "gf0ufq5": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf0ufq5/",
      "text": "Immunology. ILCs. Most papers that claimed they had a huge impact on disease only actually saw a response when most other leukocytes were removed from mouse models. Which of course confounds things/can have off-target effects that can impact immune responses. They were a hot-button item for awhile, but it seems like people are starting to move away from them (for now).",
      "author": "snazzyscientist",
      "created": 1607402129,
      "upvotes": 2,
      "replies": {}
    },
    "gf1436p": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf1436p/",
      "text": "Well sounds like you're in a similar field, but I'll say fMRI studies are always kinda suspect.",
      "author": "freet0",
      "created": 1607409068,
      "upvotes": 2,
      "replies": {}
    },
    "gf17zyc": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gf17zyc/",
      "text": "Business studies:\nIt's ok to ignore companies' adverse effects on climate and society and analyse managerial decisions as if they were separate from everything else that's going on in the world.",
      "author": "toutain",
      "created": 1607412531,
      "upvotes": 2,
      "replies": {}
    },
    "gey15w6": {
      "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey15w6/",
      "text": "Honestly, I can't remember ever believing any single finding in the literature in my field, that got thrashed out early. It's all guilty until proven innocent, in so far possible. Preferably in my own data, otherwise it's about gathering supporting \"meta\"-evidence - who did it (was it a slimy superstar type? Or was it a boring old nerd?), do other labs use the finding/method for their work, has it been systematically successfully used outside academia, what does the gossip network say, are there open debates about it (which I'd take as a good sign)... There's no Sola Scriptura in science.\n\nThe worse bullshit though? That's the post-truth stuff where they've degenerated so far they've rejected the whole concept of right versus wrong, true versus false, reliable versus unreliable - it's overtly, if not using the same brevity of terminology, bullshit. It's really not just a Jordan Petersonic fantasy.",
      "author": "waterless3",
      "created": 1607352442,
      "upvotes": 4,
      "replies": {
        "gey3tvt": {
          "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/gey3tvt/",
          "text": "> Honestly, I can't remember ever believing any single finding in the literature in my field\n\nAlright I know this sub is a support group for people who hate being in academia but this is extreme lol \n\n> The worse bullshit though? That's the post-truth stuff where they've degenerated so far they've rejected the whole concept of right versus wrong, true versus false, reliable versus unreliable - it's overtly, if not using the same brevity of terminology, bullshit.\n\nWhat field? It must be incredibly difficult to do experiments in your field? In mine after a few groups can't repeat another labs results they get taken to the cleaners the next time a paper from them goes through peer review.",
          "author": "pastaandpizza",
          "created": 1607353941,
          "upvotes": 19,
          "replies": {
            "geyu560": {
              "link": "/r/AskAcademia/comments/k8h0jd/what_are_the_sketchy_potentially_bs_parts_of_your/geyu560/",
              "text": "I think they're talking about postmodernism.",
              "author": "ExtraSmooth",
              "created": 1607365702,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    }
  }
}