{
  "sid": "rfvsln",
  "link": "/r/AskAcademia/comments/rfvsln/my_partners_failed_incomplete_philosophy_qp_and/",
  "title:": "My partner’s Failed + incomplete philosophy QP and strange circumstances",
  "text": "\nTL;DR: my partner’s department seems to be setting them up for failure constantly and I don’t know why or what to do. This includes failing a QP after giving not enough help to pass it as well as not allowing an appeal or any way to make it up; counting it as if it’s an incomplete class. Can’t tell if this is normal or completely out of line. Not sure how or if to try and appeal/fight it or let it go. Not sure if there is something political going on we don’t understand.\n\n\n—-\n\nI am not in academia; I have a bachelors from a lowkey school and now I’m working. But my partner is in grad school in the US for philosophy and is having an extremely rough time. I’m going to try and convey this all correctly but please forgive anything confusing because I don’t understand grad school structure very well. I’m going to try and leave out any identifiers because I don’t want any retaliation against my babe. They (my partner) didn’t ask me to write this so if anyone from the school happens to see this; this is just my account of the situation.\n\nPartner (X) is doing a masters in philosophy at a very decent school for philosophy in the northeast. X came from a disadvantaged educational and income background and went through a lot to get here. In order to graduate with this master’s on this specific concentration they have to complete 3 Qualifying Papers. This is their 3rd out of 4 semesters and their first QP went well and was passed. This semester they did their second QP.\n\nThis school has a consortium where you can take a limited number of classes at other local universities. X chose to take a class last semester and this semester at a great local university well known for philosophy. Their 2nd QP originated as a final paper from one of these consortium classes.\n\nThe QP team for this QP (in charge of whipping the paper into publishing shape and then grading it) consists of two professors that are teaching the two classes X is in this semester. One of which somewhat specializes in the subject of the QP. \n\nThe QP team gave X a series of very strange directions throughout the semester of how to improve the QP, including: read 20 more sources, create an annotated bibliography, and rewrite the paper to include the new sources and exclude a major core part of the original idea. At each step of the way they said they didn’t understand what X wrote. They said they didn’t understand the idea, they didn’t think X understood the sources correctly in the annotated bibliography, and they didn’t think the idea after revision was correct. A ton of time was spent on grammar, clarity, and source reading so by the end of the semester they had lots of praise for the improvement on the paper. They then proceeded to fail the paper.\n\nAlso of note is that X knows they need writing improvement because they communicate better verbally and asked to try to verbally explain the idea so that they could all get on the same page about how. to express it. The team ignored this request. The team also asked questions repeatedly that had already been answered to their satsifaction, as if they forgot. Meanwhile, X took the paper to two other relatively well-known and respected philosophers/professors that they are friends with and they had much more feedback and detailed notes than the QP team and liked and understood the paper.\n\nWhen X went to the team after the QP was failed, the reasons one professor said verbally was why it failed were different and didn’t align with the written reason the QP failed. Other professors outside of the university (from 2 other places) disagree with this failure, including the professor of the class the QP was based on who has the most expert knowledge of the subject.\n\nX asked to appeal the failure and was told no because there is no appeal process. X was also told that because it failed, they would have to either take a 5th semester (can’t afford) to redo it or do both an internship and the 3rd QP at the same time. This is not stipulated or implied in the grad student handbook and was a complete shock to X, who now has a month to get an internship together before school starts. \n\nX told one person in the dept. that they were considering doing their 3rd QP based off the class from the same consortium university. The same week they got advice out of the blue from 2 professors they had not spoken to “strongly recommending” they base their QP off of a class taken at their actual school. No sufficient reason for this advice was given.\n\nAnother strange happening this semester was one of the professors on the QP team, in their respective class X took this semester, gave a bad grade and really strange feedback on a class paper. The paper was in reference to a gender identity that X identifies as and the professor also identifies as. However, X does not do much outwardly to show they have this gender identity, and the professor does. Professor told X that the paper was disrespectful for critically interrogating certain aspects of the identity and offensive because X misspelled someone’s name due to autocorrect. This seems like a ridiculous reason to fail a paper considering 1. You’re supposed to be critical in philosophy and 2. Why would you assume someone is being offensive to people of their own identity group? \n\nMy questions are:\n\n- Is this normal behavior for a QP team?\n- Do you think they are retaliating/offended at X for basing the 2nd QP off a class from a consortium university?\n- Could there be gender/racial/economic discrimination at play? (Said university has one recent rumour of racial discrimination)\n- Is there any recourse for X to not have to redo this QP/take an internship due to the facts that: it is not explained in written policy; the evaluation of the paper varied so much from person to person; the QP team did not respond to all requests for assistance or provide even as much assistance and feedback as other tangential contacts? \n\nThank you so much.",
  "author": "nannerooni",
  "created": 1639445712,
  "updated": 1639515487,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hogelo4": {
      "link": "/r/AskAcademia/comments/rfvsln/my_partners_failed_incomplete_philosophy_qp_and/hogelo4/",
      "text": "I can't help with this issue, but major kudos to you for the way you're trying to support your partner!",
      "author": "winterneuro",
      "created": 1639445973,
      "upvotes": 3,
      "replies": {
        "hogeqt9": {
          "link": "/r/AskAcademia/comments/rfvsln/my_partners_failed_incomplete_philosophy_qp_and/hogeqt9/",
          "text": "Thank you and happy cake!",
          "author": "nannerooni",
          "created": 1639446038,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hogixxz": {
      "link": "/r/AskAcademia/comments/rfvsln/my_partners_failed_incomplete_philosophy_qp_and/hogixxz/",
      "text": "Here's my (cynical 4th year PhD candidate in a humanities field) few cents. \n\nIt definitely sounds like some of these professors are being assholes and unreasonable.\n\nAt best, they're blowing X off and not working with them/providing meaningful feedback because teaching isn't that high on their priority list. Wanting to do research (and being good at it) doesn't always correlate with the desire or ability to teach well, and for some profs, it's just not that high on their priority list. \n\nAt worst, they're trying to nudge X out of the program by not passing them and then also not helping them improve. It's a really shady thing that some profs to weasel their way around formal departmental procedures for removing people from grad programs, which are usually set by the university and involve a lot of bureaucracy. I've seen it happen a couple of times - basically, they give really negative feedback without a lot of guidance about how to improve so that students don't meet program deadlines and then either are kicked out for that reason, lose their funding, or drop out themselves. \n\nThere are a couple of things that X can do that *might* help. \n\nFirst, they can see if their university has an ombuds (ombudsman), and contact that person. Ombuds are a kind of confidential advisor/conflict mediator in universities. The upside of talking to them is that they work for the university itself and generally have quite a bit of independence re: the hierarchy, so they have no personal or professional stake in the politics of any particular department. They can be genuinely neutral in a way that others may not be able to be. The downside is that they often have very little actual power; they can offer advice, facilitate communication, and advocate for people, but they can't actually make anyone do anything.\n\nSecond, they can go over the heads of individual professors to either the director of graduate studies for their department or the chair of the department. It's a bit of a risky move and requires some politicking, because professors can sometimes be reluctant directly confront or go against their colleagues, especially on behalf of graduate students. The chair (and to a lesser extent the DGS) is a leadership position, but again, depending on the composition of the department (how many tenured, TT, + nonTT faculty there are), they may not have a whole lot of authority. They can advocate on behalf of students, but they likely can't actually force other professors to change their behavior. \n\nThird, they can go to the/a dean of the graduate school. It's kind of a crapshoot whether this person will bother getting involved. Depending on the status of the professors who are doing the thing, even they may not be able to do a lot beyond advocating. \n\nFourth, there might be a university process for filing a formal complaint against someone. It's kind of a nuclear option - happened in my department a couple of years ago and a bunch of people got dragged in for interviews with an official HR investigator, and so on and so forth. A professor was formally sanctioned and removed from a couple of fancy positions, but they didn't lose their job and the person who complained was left more or less in the same position. \n\nAnd TL;DR this is the really shitty thing about graduate school. You cannot force people to teach you. It's possible for a crappy professor to have some sort of come to jesus moment and change their ways, but I don't know of any formula for making this happen. My personal actual advice in this situation would be for X to try every option to minimize contact with these professors and work with other examiners. If this isn't possible, they might have to swallow some really tough shit. They have very little recourse and no power in this situation. \n\nAlso, sidebar, I've been in/around academia forever and I've never heard of a philosophy program requiring students to complete internships. Do they mean TA/RAship?",
      "author": "parsleybutter",
      "created": 1639447946,
      "upvotes": 2,
      "replies": {
        "hoi0tri": {
          "link": "/r/AskAcademia/comments/rfvsln/my_partners_failed_incomplete_philosophy_qp_and/hoi0tri/",
          "text": "Thank you so much for weighing in here. The head of the philosophy dept was of no assistance but I’ll look into other people that X could contact.\n\nIt really sucks that X had the back luck to spend sooo much money they don’t have on this program to get treatment like this.\n\nAlso, yes, I’m pretty sure its an internship. It’s completely ludicrous. It’s part of one of two(?) tracks someone can go and you’re supposed to intern for a specifically non-academic institution and then write about your experience in a philosophical way. It’s super vague and to X it is frustrating because it seems like a waste of time that could be spent TAing.",
          "author": "nannerooni",
          "created": 1639482216,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hogxbi4": {
      "link": "/r/AskAcademia/comments/rfvsln/my_partners_failed_incomplete_philosophy_qp_and/hogxbi4/",
      "text": "The process for QPs differs a lot from department to department, so take everything I say here with a grain of salt. Two things that you don't mention that are important for figuring out both what may have happened and what your partner should do are (1) who in the department has a say in whether a QP passes, and (2) is your partner just getting a masters or are they also planning on doing a PhD in the same department?\n\nIn my department, QPs were voted on by the entire department and passing was determined by a simple majority vote. As such, determining why a QP didn't pass was not a simple matter. Different professors may have had very different reasons for failing it. The department may have been split, with some wanting to pass and others not. The official reasons given for the QP failing were usually little more than a summary of some of the few points of agreement among those who failed it, not an accurate representation of exactly why they voted to fail or what the discussions were like. \n\nSo the fact that the people in charge of overseeing the writing and revising of the QP signed off on it may not mean much at the end of the day. I've seen this happen to peers, where they have an advocate or two but most of the department remains opposed. Sometimes this can also be a result of departmental politics if the department is polarized enough. If the two people in charge of overseeing the QP also had sole say over whether or not it passed, then that's more problematic, and in that case they should have made clear to your partner that in their eyes the work was not of passing quality. \n\nRegarding retaliation, there may have been some, but I highly doubt it would be over basing the QP on a paper written for an outside course. It seems unlikely to me that anyone would care about something like that, but I have also seen some very petty attitudes in academia so anything's possible. It is often recommended that you base your QP on a paper written for a course in your department. But that's mostly because then your paper has at least one professor who has already read and evaluated it, likely signed off on the main ideas, and who can advocate for it. \n\nThe advice on revising the QP strikes me as entirely normal. Being asked to incorporate more sources and engage with the literature more is the single most common criticism of academic work, whether it be from commenters at a conference or reviewers for an academic journal, so I don't think there's anything there. One of the biggest failings of QPs generally in my experience is a failure to really connect what's being said with the relevant academic literature, and since the QP is meant to gauge your ability to do academic research and making those connections is absolutely necessary to have any hope of being published and getting a job, stressing those aspects and giving that advice seems sound.\n\nRegarding recourse, a lot of it depends on whether they want to get a PhD there as well. If yes, then it might be best to consider just transferring out. The reason is that they need to spend another three to four years with these people and get at least a couple of them to agree to being on their dissertation committee and ultimately writing letters of recommendation. Professors aren't required to do either, so if your partner is in a hostile department with professors who don't think highly of their work, they are probably not going to have much success either assembling a committee or passing their defense, let alone getting positive letters. Writing a dissertation is already enough of a nightmare without adding in hostile and unhelpful advisers. \n\nUltimately though, I don't think there's much that can be said with confidence here as there really isn't much information to go off of. I've definitely seen some really questionable reasons for QP's failing, such as \"This QP is on such-and-such philosopher, and I hate that philosopher.\" But so much of it depends on exactly who's in charge of passing the QP, what the department's politics are, the personal relation of your partner to these people, and so on.",
      "author": "BandiriaTraveler",
      "created": 1639454533,
      "upvotes": 1,
      "replies": {
        "hoi18ia": {
          "link": "/r/AskAcademia/comments/rfvsln/my_partners_failed_incomplete_philosophy_qp_and/hoi18ia/",
          "text": "Thanks so much for your response. In this case there are two people who review and pass the QP and then I think the head of the dept. has some authority but doesn’t read it themselves. \n\nX would like to get a PhD at a different institution after this.\n\nI wish that these two folks had indicated earlier on how seemingly hopeless this paper was to them so that X didn’t have to stress and spend so much time and energy over something that would ultimately fail. They didn’t even prep X beforehand by saying they were about to fail it. So sad. \n\n\nThank you for the advice",
          "author": "nannerooni",
          "created": 1639482507,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hohqv88": {
      "link": "/r/AskAcademia/comments/rfvsln/my_partners_failed_incomplete_philosophy_qp_and/hohqv88/",
      "text": "That was the tl;dr?!?!",
      "author": "phonograhy",
      "created": 1639474099,
      "upvotes": 1,
      "replies": {
        "hoi19bx": {
          "link": "/r/AskAcademia/comments/rfvsln/my_partners_failed_incomplete_philosophy_qp_and/hoi19bx/",
          "text": "No i just forgot to separate it",
          "author": "nannerooni",
          "created": 1639482524,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}