{
  "sid": "pg56x9",
  "link": "/r/AskAcademia/comments/pg56x9/what_are_the_most_important_factors_to_consider/",
  "title:": "What are the most important factors to consider when choosing between different postdoc offers?",
  "text": "I have a few post-doc offers but two of them are more attractive to me than the others and it's hard to decide which one is going to help me better:\n\nA) A postdoc with a famous PI in a rank-20 university with many other students and postdocs in the lab. The work/life balance is a little concerning to me though only because they are extraordinarily productive (I may or may not be wrong). \n\nB) A very nice and cool professor but with  little experience in the area she is going to hire me for (the research area is still what I like to work on). The university is the top-1 though. The brand of the university and the personality of the professor is very attractive to me. The projects are interesting, but she is definitely not an expert in that area and non of the lab members are expert in that area either.  \n\nI have a few other postdoc options as well. I appreciate any comment on what are the most important factors in choosing a postdoc.",
  "author": "always_developing",
  "created": 1630537056,
  "updated": 1634079435,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hb9ezh4": {
      "link": "/r/AskAcademia/comments/pg56x9/what_are_the_most_important_factors_to_consider/hb9ezh4/",
      "text": "IMO the most important thing to consider is your relationship with the PI. If you feel like one PI will have your back and support your career more than the other, I personally would go with that one. You can usually find training in whatever specific thing you want to do (go to a workshop etc.) and it's actually good to be doing something a bit different than your PI in terms of demonstrating independence for faculty positions later on.",
      "author": "firegoddess333",
      "created": 1630545898,
      "upvotes": 5,
      "replies": {}
    },
    "hbadsv1": {
      "link": "/r/AskAcademia/comments/pg56x9/what_are_the_most_important_factors_to_consider/hbadsv1/",
      "text": "I think it comes down to personal preference. I would choose option two. I am not fond of a paper machinery where you are a very insignificant part of a huge machinery. With so many people you can be almost sure there will be little to no supervision or mentoring whatsoever. Keep in mind a Postdoc is still to teach you necessary skills to \"survive\" in academia. I thin in big labs that usually does not happen. Also dynamics in big groups can be very challenging and its hard to get along with everyone. I think in smaller groups you have better chances.",
      "author": "CreepyBumblebee31",
      "created": 1630566213,
      "upvotes": 3,
      "replies": {
        "hbc9xy8": {
          "link": "/r/AskAcademia/comments/pg56x9/what_are_the_most_important_factors_to_consider/hbc9xy8/",
          "text": "Eh, I think it depends. One might say a benefit to being in a \"paper machinery\" is that you will likely get lots of papers, which are still important for academic jobs. You may learn in a stepwise fashion, where you start working on pieces of a paper and gradually work your way up to leading one - if you have little to no experience with this, that could be really helpful vs. having to strike it out on your own right away. One could also argue that with so many people there may be *more* supervision and mentoring: not just from the PI, but more advanced postdocs and junior faculty members who are in this PI's orbit.\n\nDynamics in large groups are no more or less challenging than dynamics in small groups. I have observed and been in small groups with toxic, cliquish, and/or exclusive atmospheres. In a large group it's easier to avoid someone that you don't like or don't get along with, whereas in a small group it's nearly impossible. One could also argue that larger groups many result in the proliferation of more ideas and more projects to work on.",
          "author": "roseofjuly",
          "created": 1630603835,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hbc9e75": {
      "link": "/r/AskAcademia/comments/pg56x9/what_are_the_most_important_factors_to_consider/hbc9e75/",
      "text": "Depends on what you want to do career-wise, as well as your personal preferences. I'm assuming that all other factors like location, pay, connection with the PI, etc. are comparable in this case. In both cases, I would also ask the professors about where their postdocs tend to go after graduation.\n\nFor an academic career, I might lean towards A. Frankly, if your goal is academia, your work/life balance as a postdoc is bound to be a little...out there. I'm not saying that should be a goal, but if you want to compete for top academic jobs at R1s or whatnot, you also need to be extraordinarily productive. If most people coming out of that lab are extraordinarily productive, that's a good sign. Having a famous PI is also useful; I had a famous PI in graduate school, and they can introduce you to a lot of people and really help grow your network.\n\nOption B needs a little explanation and questioning, but honestly in all other circumstances I would probably lean towards option B (and honestly, even for certain permutations of academia). How close to your area is the the area in which she has experience? I did a postdoc at a place where my PIs did not have any experience in the area they directly hired me for, but my topic was pretty close to theirs and there was so much synergy in the research topics - plus I had some well-known collaborators from my grad institution - so it didn't matter that much. But had I gone to work with someone whose work was further afield, it might be harder to get grants, get published, organize symposia, etc.\n\nHow independent are you as a researcher? People are in different places and have different needs when they are a postdoc. If your graduate program was pretty low-key, and/or you are someone who wants or needs a little more support and scaffolding in developing into an independent researcher with an agenda, option A (without more details) may be better suited for you. However, all we know about option B is that it's not super close to what you do - it's possible that this professor is very productive and effective, too, just not in your specific area.\n\nMake sure that the brand of the university isn't the overwhelming factor in this case, because while university brand definitely means something in both academia and industry, it isn't the single most important factor in the job hunt. This really depends on your field, too - in some fields there's a vast gap between the top 5 and everyone else in terms of academic jobs, while in others the top 20 in general are pretty safe choices even for academia.",
      "author": "roseofjuly",
      "created": 1630603621,
      "upvotes": 3,
      "replies": {}
    },
    "hbbhjxh": {
      "link": "/r/AskAcademia/comments/pg56x9/what_are_the_most_important_factors_to_consider/hbbhjxh/",
      "text": "Above all, choose based on the advisor. Then, assuming that you're looking for a tenure track PI position after the postdoc, then choose based on whether previous postdocs have gone on to tenure track positions. The university name doesn't matter too much, but the name of the PI tends to matter.",
      "author": "NorthAd7013",
      "created": 1630592318,
      "upvotes": 1,
      "replies": {}
    }
  }
}