{
  "sid": "pkv578",
  "link": "/r/AskAcademia/comments/pkv578/how_to_ask_an_undergrad_student_for_a/",
  "title:": "How to ask an undergrad student for a reco/evaluation letter for postdoc applications?",
  "text": "&#x200B;\n\nI'm a PhD candidate in the Humanities at a US, R1 University. This is my last year so it means it's postdoc and job application season for me, the first one ever.\n\nLast year, I taught my own course, with my own syllabus and everything. I had a low enrollment but the students I had seemed enthusiastic and I think they overall liked the course. I asked my University if the students had provided any written evaluations for my course, but apparently they didn't; it is not mandatory. I asked the career development department of the University about this and they say I could always contact directly the student and ask for a reco/evaluation letter from them, if they are willing to write one of course.\n\n**My question is**, how do I go about this? Of course, I know that writing to them, but: are there specific points that I could/should ask them to try touch upon on their letter? what are committees expecting to read in such letters? And while I'm here already: do these kind of letters (students' evaluations) count much towards getting or being reject from a postdoc? \n\nThanks a lot!",
  "author": "radiolalo",
  "created": 1631183311,
  "updated": 1634079352,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hc6ezi4": {
      "link": "/r/AskAcademia/comments/pkv578/how_to_ask_an_undergrad_student_for_a/hc6ezi4/",
      "text": ">do these kind of letters (students' evaluations) count much towards getting or being reject from a postdoc?\n\nDepends. Is it a teaching postdoc? If so, they will definitely want to see some kind of evaluation of your teaching. Did you have a faculty member do some classroom observation of you so they can write about you as a teacher? If not, did you record your classes so one of your letter writers can watch a video now to write the letter?\n\nIf you didn't get any kind of evaluation of your teaching, then I'm afraid your grad program seriously dropped the ball. It won't help you, but for the sake of the students coming up behind you, reach out to the program leaders and say that this is holding you back, and let the students behind you know to ask for this.",
      "author": "CruxAveSpesUnica",
      "created": 1631193413,
      "upvotes": 3,
      "replies": {
        "hc6gicy": {
          "link": "/r/AskAcademia/comments/pkv578/how_to_ask_an_undergrad_student_for_a/hc6gicy/",
          "text": "I did have a member of some teaching center watch and write feedback on one of the classes I TAed for, but I didn't ask for the same center to do that for my class and, honestly, that's on me, I figured out that that would have been great but after the fact. \n\nThank you for this, yeah usually my program is not very helpful when it comes to professionalize students... they outsource that to the grad career development center, which is good albeit, well, \"generic,\" in that it serves the whole university. Again, thank you for your comment, really appreciated.",
          "author": "radiolalo",
          "created": 1631194182,
          "upvotes": 1,
          "replies": {
            "hc6gz1g": {
              "link": "/r/AskAcademia/comments/pkv578/how_to_ask_an_undergrad_student_for_a/hc6gz1g/",
              "text": ">I did have a member of some teaching center watch and write feedback on one of the classes I TAed for\n\nIf you're applying for a teaching positions, I would definitely meet with this person again and ask if they could write for you, maybe after a discussion about what you learned from your experience teaching your own class, how you're continuing to grow as a teacher, etc.",
              "author": "CruxAveSpesUnica",
              "created": 1631194412,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hc6ddzx": {
      "link": "/r/AskAcademia/comments/pkv578/how_to_ask_an_undergrad_student_for_a/hc6ddzx/",
      "text": "Not all, but most universities petition green cards only for tenure track faculty, and those positions are hard to get.",
      "author": "e_lunitari",
      "created": 1631192560,
      "upvotes": -3,
      "replies": {}
    }
  }
}