{
  "sid": "prl6yf",
  "link": "/r/AskAcademia/comments/prl6yf/can_someone_suggest_a_natural_sounding_text_to/",
  "title:": "Can someone suggest a natural sounding text to speech app for proofing papers?",
  "text": "I am posting this here because I specifically need a text to speech  program, or a website, that I can paste or upload my papers into and  have them read back to me, but in a very natural voice. I have tried a  company called Natural Voices and they are anything but natural. I don't  need to convert them to MP3 or use them for voice overs like many  services provide, I don't even need to save them. I just want to listen  to my papers for clarity and flow. Paid is fine, I do not need free. I  figured maybe grad students would have ideas. If it matters, I am using  Linux as my OS.",
  "author": "ostrogotha",
  "created": 1632102529,
  "updated": 1634078925,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hdsz453": {
      "link": "/r/AskAcademia/comments/prl6yf/can_someone_suggest_a_natural_sounding_text_to/hdsz453/",
      "text": "Anyone? Bueller?",
      "author": "ostrogotha",
      "created": 1632282165,
      "upvotes": 2,
      "replies": {}
    },
    "hdmjen8": {
      "link": "/r/AskAcademia/comments/prl6yf/can_someone_suggest_a_natural_sounding_text_to/hdmjen8/",
      "text": "This is probably not very helpful but I've always found reading my stuff out loud is sufficient for editing. I don't need someone (something) else to read it out and actually that act of stumbling over my words as I try to read it is the most useful part of it.",
      "author": "ACatGod",
      "created": 1632164868,
      "upvotes": 1,
      "replies": {
        "hdmjqnq": {
          "link": "/r/AskAcademia/comments/prl6yf/can_someone_suggest_a_natural_sounding_text_to/hdmjqnq/",
          "text": "The problem with that is you read right past your own mistakes. Your brain created them so your eyes don’t see them. The idea is to listen to a different voice because things like missing or repeated words or the wrong tense will be jarring when you hear it.",
          "author": "ostrogotha",
          "created": 1632165007,
          "upvotes": 2,
          "replies": {
            "hdmk9b7": {
              "link": "/r/AskAcademia/comments/prl6yf/can_someone_suggest_a_natural_sounding_text_to/hdmk9b7/",
              "text": "I find not if I read out loud. I definitely do when I'm silently reading, but if I read it out loud then it's like seeing it with new eyes. I always recommend it to my students. I find it works best to print stuff out, but on the screen works as well.",
              "author": "ACatGod",
              "created": 1632165220,
              "upvotes": 1,
              "replies": {
                "hdmkvgi": {
                  "link": "/r/AskAcademia/comments/prl6yf/can_someone_suggest_a_natural_sounding_text_to/hdmkvgi/",
                  "text": "Your eye generally won’t catch a repeated word like “and and” or the difference between “marches” and “marched” but your ear will. When you’re reading your own work out loud you’re using your eyes not your ears. I do read my stuff out loud but it’s nowhere near as helpful as hearing it in another voice. Your own eyes are too forgiving.",
                  "author": "ostrogotha",
                  "created": 1632165476,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}