{
  "sid": "pjem8n",
  "link": "/r/AskAcademia/comments/pjem8n/taking_a_break_from_grad_school_for_a_oneyear_job/",
  "title:": "Taking a break from grad school for a one-year job contract. Is this a wise decision?",
  "text": "Since COVID, my grad school in New York has been operating fully remote/online for a whole academic year. However, I'm an international student from Hong Kong, so my Zoom classes were held between 10 pm - 2 am every night due to time zone differences.\n\nAs I have some free time during the day, I decided to work at a day job and to take classes on Zoom at night. This continued for a year... Even though I still managed to get straight A's, I am starting to feel a bit burnt out and depressed because of how routine-like my life has become.\n\nFall semester is approaching, and now I am stuck in a weird situation. My original plan is to go back to New York to start taking classes in person again, but my grad school recently announced very last minute that our fall semester will be held fully **online** as well. However, my international student friends still decided to return anyway because they wanted to get that \"living in the US\" experience.\n\nLast week, I got a new job offer from a pretty nice company in my home country. It is a great opportunity because 1) the job title is in the field that I've always wanted to work in 2) the salary is pretty good. It is on a one-year contract basis which is actually perfect for me because I can just take a gap year and then go back to grad school afterwards.\n\nHowever, almost everyone in my life is telling me that this would be a great mistake because I would not graduate on time and I may also miss out on new opportunities in the US. Whenever I see my classmates posting Instagram stories of how much fun they are having in New York, I cannot help but feel a bit jealous of them. A change of scenery may also be nice for my mental health as well.\n\nShould I take this new job offer or should I go back to New York to finish my Master's program? I honestly don't know what to do anymore. Any advice would be greatly appreciated.\n\nContext: My field of research is in linguistics and I am currently a second-year Master's student at Columbia University.",
  "author": "Youngdumbskinny",
  "created": 1630984034,
  "updated": 1634079369,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hbws3ps": {
      "link": "/r/AskAcademia/comments/pjem8n/taking_a_break_from_grad_school_for_a_oneyear_job/hbws3ps/",
      "text": "Are you rich? If you're not, then I think that working a good job for a year and saving some money so be much better than dealing with NYC cost of living just to study online.\n\n> However, almost everyone in my life is telling me that this would be a great mistake because I would not graduate on time and I may also miss out on new opportunities in the US.\n\nWhat opportunities do they think you're missing out on that won't be there when you graduate with the masters and the extra work experience? Just a vague idea of \"living in NYC\"? In general, people give pretty awful advice.",
      "author": "CheeseWheels38",
      "created": 1631004514,
      "upvotes": 7,
      "replies": {
        "hc1hco1": {
          "link": "/r/AskAcademia/comments/pjem8n/taking_a_break_from_grad_school_for_a_oneyear_job/hc1hco1/",
          "text": "Totally agree. Plus what does \"not graduate on time\" even mean. So you'll graduate a year later than everyone else but you'll be on the job market with a degree and relevant experience. You'll be ahead. \n\nIt's a very institutionalised view that you must go to university at 18. You must complete your degree in X time and graduate on Y date, the same as everyone you went to school with. But the world isn't school, and it doesn't work like that or care about those rules. \n\nPeople often give bad advice because they're either intimidated by the fact you're going against the grain or they see your choice as some kind of judgment on their choice.",
          "author": "ACatGod",
          "created": 1631094927,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hbxb3ry": {
      "link": "/r/AskAcademia/comments/pjem8n/taking_a_break_from_grad_school_for_a_oneyear_job/hbxb3ry/",
      "text": "I’d say do not listen to the advice. They may be mistaking that you’d not continue your study. But as long as you plan to keep studying, you will spend a much more meaningful year next year assuming you can get on the campus. This is more likely since my university (Washington university) and other universities are holding some physical classes. It’s likely you’d have physical classes. \n\nPerhaps more importantly, life does end with the masters degree. If you are to be successful and indeed build meaningful relationships in the US, you’d need something unique on your own. This work experience can be that edge you have.",
      "author": "yrs00191",
      "created": 1631018718,
      "upvotes": 1,
      "replies": {}
    }
  }
}