{
  "sid": "peshzm",
  "link": "/r/AskAcademia/comments/peshzm/affiliations_to_list_on_an_old_manuscript_as_a/",
  "title:": "Affiliations to list on an old manuscript as a new graduate student?",
  "text": "Hello! Field is philosophy, title is first-year graduate student (I guess?), and country is United States.\n\nJust wondering how I should list my affiliation(s) when I submit a manuscript to a journal; their policy isn't delineated clearly enough for me to be sure in this particular case. University names are all de-identified. \n\nI just graduated from University A earlier this year. I was studying psychology and philosophy. I wrote a paper as a final for a philosophy course back in 2020 that I was really proud of and wanted to submit to a journal, so I revised it, fleshed it out a bit, and found a journal that the material would suit. However, since graduating from University A, I have started as a psychology PhD student at University B. Some of the revisions have been done during my time at University B, but I had no supervision from my major professor here, nor did I have any financial support from Universities A or B. I had minimal oversight at University A (it was a very broad prompt from a professor, and I wrote on a very specific topic). Should I list University A as my affiliation? Should I list University B? Both? Should I be listed as independent? Thanks!",
  "author": "cosmicist_at_heart",
  "created": 1630361615,
  "updated": 1634079444,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hb06813": {
      "link": "/r/AskAcademia/comments/peshzm/affiliations_to_list_on_an_old_manuscript_as_a/hb06813/",
      "text": "I had a similar situation and I listed my affiliation when most of the work was done (University A)",
      "author": "firegoddess333",
      "created": 1630373973,
      "upvotes": 5,
      "replies": {}
    },
    "hb0ag08": {
      "link": "/r/AskAcademia/comments/peshzm/affiliations_to_list_on_an_old_manuscript_as_a/hb0ag08/",
      "text": "List University A, and with a footnote that you are currently at University B.",
      "author": "OKswimmer2684",
      "created": 1630375957,
      "upvotes": 5,
      "replies": {}
    },
    "hb1r34i": {
      "link": "/r/AskAcademia/comments/peshzm/affiliations_to_list_on_an_old_manuscript_as_a/hb1r34i/",
      "text": "AFfiliations should recognise the university at which the work was conducted. In this case, it would be both A and B. Dual affiliations are really common - almost all of my papers have dual affiliations.\n\nFormatting is usually along the lines of:\n\nAuthor A ^1,2 , Author B ^1, Author C^3\n\n^1 Affiliation A\n\n^2 Affiliation B\n\n^3 Affiliation C",
      "author": "OrbitalPete",
      "created": 1630412250,
      "upvotes": 3,
      "replies": {}
    },
    "hb30o3b": {
      "link": "/r/AskAcademia/comments/peshzm/affiliations_to_list_on_an_old_manuscript_as_a/hb30o3b/",
      "text": "This is a field-dependent convention and you should ask your advisor. In art history you list current affiliation.",
      "author": "pipkin42",
      "created": 1630431879,
      "upvotes": 3,
      "replies": {}
    },
    "hb2ghe7": {
      "link": "/r/AskAcademia/comments/peshzm/affiliations_to_list_on_an_old_manuscript_as_a/hb2ghe7/",
      "text": "I'd use your current affiliation (Univ B) as you submit it and also on the pub, itself if/when it's published. I did this with work that I did as an undergraduate.\n\nYou are going to be evaluated through your grad school career and having a pub under that affiliation will be a minor benefit as people there look at your CV and (hopefully!) read the pub.",
      "author": "rockyfaceprof",
      "created": 1630423769,
      "upvotes": 0,
      "replies": {}
    },
    "hb2p4as": {
      "link": "/r/AskAcademia/comments/peshzm/affiliations_to_list_on_an_old_manuscript_as_a/hb2p4as/",
      "text": "I would go against what people are saying here, and I would put both. That way no one can complain.",
      "author": "ThePhysicistIsIn",
      "created": 1630427252,
      "upvotes": 1,
      "replies": {}
    }
  }
}