{
  "sid": "repcn7",
  "link": "/r/AskAcademia/comments/repcn7/finishing_phd_in_mathematical_physics_want_to/",
  "title:": "Finishing PhD in mathematical physics, want to move towards psychology but..",
  "text": "I have neurological disorders primarily caused by trauma which led me into studying lot of trauma psychology. Even though I have never had psychology as a subject in any of my degrees, I had deep interest in the subject even before I understood my own trauma. I have a few ideas regarding healing modalities that I want to build but at the same time, I don't want to get out of touch with mathematical physics. Assuming that I will be able to cope up with workload, what could be the best way to enter psychology so as to finally develop a method to develop trauma processing but also keep in touch with my base interests. \n\nThank you in advance. FYI, I am 31 y/o and in last semester of my PhD.",
  "author": "DaoDragon",
  "created": 1639316871,
  "updated": 1639515497,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.6,
  "comments": {
    "ho9055o": {
      "link": "/r/AskAcademia/comments/repcn7/finishing_phd_in_mathematical_physics_want_to/ho9055o/",
      "text": "Psychology and physics interface in areas of MRI imaging, brain stimulation, connectome, circuit modeling, etc. That said, if your interest is in your own condition, best way to proceed would be to collaborate with someone.",
      "author": "unreplicate",
      "created": 1639319707,
      "upvotes": 17,
      "replies": {
        "hobarjv": {
          "link": "/r/AskAcademia/comments/repcn7/finishing_phd_in_mathematical_physics_want_to/hobarjv/",
          "text": "Oh hell yes!  Great idea!  Functional MRI would be right up your alley!  You could look at all sorts of stuff, like the effects of microtrauma on systems function or contributions of leaky vessels on cellular connections.  Plus all that stuff listed above.  nb I find fMRI loads of fun, so am biased biased biased.  You could even work in brain-machine systems for the paralyzed!\n\nYou won't be the first from your areas to move into neuroscience.  I've seen any number of physicists do so to great success..   There's a great future for you, full of fun and success.",
          "author": "x47126g",
          "created": 1639353235,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ho91ejg": {
      "link": "/r/AskAcademia/comments/repcn7/finishing_phd_in_mathematical_physics_want_to/ho91ejg/",
      "text": "Off-the top of my head, neurophysics or something nuclear medicine adjacent might be a better option",
      "author": "wetcogbag",
      "created": 1639320195,
      "upvotes": 9,
      "replies": {}
    },
    "ho91jwg": {
      "link": "/r/AskAcademia/comments/repcn7/finishing_phd_in_mathematical_physics_want_to/ho91jwg/",
      "text": "As a grad psych student, I'd say you can be good at computational psychology. For instance, you can build cognitive models of behavioral tasks and pair them with neuroscientistific tools like EEG.",
      "author": "MJORH",
      "created": 1639320256,
      "upvotes": 5,
      "replies": {}
    },
    "ho94uc8": {
      "link": "/r/AskAcademia/comments/repcn7/finishing_phd_in_mathematical_physics_want_to/ho94uc8/",
      "text": "Explore computational cognitive science, perhaps. Cognitive science bridges mind/brain, focusing on cognitive processes such as attention, vision, movement, decision-making. Mathematical modelling is useful in this area, but most cog sci researchers aren’t skilled enough to make an impact. Mathematics is also useful in neuroscience but you’ll find the application is focused more on physiology and medical issues, or on animal nervous systems.\n\nComputational psychology is also another possibility, but I’ll be honest in saying I don’t know the first thing about this. I don’t want to give you much info about computational cog sci because the application can be so broad. This is a very complex area of research. To get an idea, you would want to identify particular researchers or teams/labs applying computational modelling to observational data.\n\nETA: Yes, it’s entirely possible to break into that space with a mathematics PhD, but not with a PhD in cognitive science, psychology or neuroscience and no maths background. The latter three topics can be picked up over time, and you learn about them as you research.",
      "author": "Illustrious-Sale-274",
      "created": 1639321618,
      "upvotes": 2,
      "replies": {}
    },
    "ho95zgj": {
      "link": "/r/AskAcademia/comments/repcn7/finishing_phd_in_mathematical_physics_want_to/ho95zgj/",
      "text": "There are mathematical psychological models inspired by models in physics. Look up quantum models of decision making, for example. That's maybe the most straightforward way to enter the space. You could use your expertise as a way into a postdoc position in a lab that employs these models.\n\nThat won't get you into the study of trauma by itself, but learning how to create mathematical models of cognition would still be quite helpful. You could show, for example, that trauma is related to changes in specific model parameters, which predicts specific deficits in decision making tasks.",
      "author": "Linkuigi",
      "created": 1639322105,
      "upvotes": 2,
      "replies": {}
    },
    "hoam0l4": {
      "link": "/r/AskAcademia/comments/repcn7/finishing_phd_in_mathematical_physics_want_to/hoam0l4/",
      "text": "There's also non-invasive brain stimulation which is a nice compromise between what you've mentioned. You should check transcranial magnetic stimulation and transcranial ultrasound stimulation !",
      "author": "Wasabos",
      "created": 1639342810,
      "upvotes": 2,
      "replies": {}
    },
    "hohbjic": {
      "link": "/r/AskAcademia/comments/repcn7/finishing_phd_in_mathematical_physics_want_to/hohbjic/",
      "text": "My background is in psychology, and I would say it's perhaps not the best idea to enter psychology solely or primarily on the motivation to solve a problem you personally hold, or someone close to you holds. There's a somewhat famous paper passed around in the psych community - the \"kisses of death\" in psychology graduate admissions - that cites this as the first 'kiss of death.'\n\nFrom your post, I'd also wonder whether you're engaged in the literature in the field and are trying to build on the frameworks and knowledge within psychology, rather than coming in with preconceived notions about what should be done. There are shades of that with you \"having a few ideas about the healing modalities \\[you\\] want to build\" and wanting to \"*finally* develop a model to develop trauma processing.\" Are you sure that these things are not already there, after reading in the field - the same way you would at an equivalent stage in your interest in mathematical physics topics? (Edit: On first read I was assuming you were referring to talk therapy healing modalities; on second thought, I realize you may be talking about physically repairing brain function, and there's a lot of research needed in that area.)\n\nWith that said, assuming you do want to transition, you don't necessarily need to completely retrain. There's an entire field of psychology called quantitative psychologists, and these folks are always in high demand - they develop new statistical and mathematical models for social scientists to use to analyze their data and answer new questions. They usually have a strong math background and some grounding in psychology; I wonder if you could get a master's degree or some other kind of education and transition that way. There's the possibility of looking up a postdoc that takes people with strong quantitative training and pivots them to support social or health sciences research. You could look into a master's degree in quantitative methods in the social sciences, or perhaps a degree in biostatistics",
      "author": "roseofjuly",
      "created": 1639462462,
      "upvotes": 2,
      "replies": {}
    },
    "ho8wiao": {
      "link": "/r/AskAcademia/comments/repcn7/finishing_phd_in_mathematical_physics_want_to/ho8wiao/",
      "text": "The world of neuroscience is heavily based in math. Perhaps you could get a research position somewhere. I'm going for my PhD in neuro and I'm also interested in trauma processing. I'd share my thesis concept with you but I'd have to kill you lol. Perhaps one day Maxwells Equations will be used to help us map consciousness",
      "author": "ChickendantZZZ",
      "created": 1639317954,
      "upvotes": 4,
      "replies": {}
    },
    "ho90nru": {
      "link": "/r/AskAcademia/comments/repcn7/finishing_phd_in_mathematical_physics_want_to/ho90nru/",
      "text": "Sounds like more than a few more years of school. You probably don’t have the prerequisites for an undergrad, and an undergrad in psych isn’t going to get you anywhere. You’ve got a long, long road if you want to do any sort of practice. \n\nSource: wife is a PhD psychologist.",
      "author": "cropguru357",
      "created": 1639319892,
      "upvotes": 2,
      "replies": {
        "ho932s2": {
          "link": "/r/AskAcademia/comments/repcn7/finishing_phd_in_mathematical_physics_want_to/ho932s2/",
          "text": "I am an undergrad and I want to do interdisciplinary study in cognitive psychology. The psychology department in my university is quite small and there are few elective courses relevant to cognitive psychology. Actually I start from mathematics and literature. I once looked up several graduate programmes' entry requirements, and I found they need psychology electives. Today when I see your words I feel I waste so many years of my life. 😢",
          "author": "frozenfish_1",
          "created": 1639320885,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}