{
  "sid": "phwgdh",
  "link": "/r/AskAcademia/comments/phwgdh/i_found_a_postdoc_in_the_uk_after_9_months_of/",
  "title:": "I found a postdoc in the UK after 9 months of searching. Now, I am having trouble to switch into \"work\" mode and life/work balance is messed up!",
  "text": "As the title suggests. I was looking for a postdoc in the UK after basically 9 months of searching. Note that I am not from the UK, but I was trying so hard to find a postdoc here and I finally succeeded. The issue is that I am having trouble to sit in the office and work for 7.5 hours everyday like I have on my contract. If it's a busy day or I have a meeting in two or three days, I would go to the lab and work for 6-5 hours at most. As soon as I feel comfortable/confident with my results, I just stop.\n\nBasically, I am following the same strategy I used to do as a PhD student in my country: Work with my own pace (and yeah with my mood). Keep in my mind that I do make  good progress this way, and my postdoc is going good so far with the new project I am assigned on. But I know that I am not a PhD student anymore and I need to get it together. Any suggestions?\n\nPS1: Please keep in mind that some of the reasons to why this is happening is that 1) I was unemployed for +9 months, 2) I am still trying to settle in in the UK and it's so slow and hard.   \n\n\nPS2: About my PhD work strategy, yes, you would argue that if it worked before and is still working for now, so I can just keep doing that, but after doing this for so long I know that I don't have a work/life balance: Yes, I might come to the lab one hour late and leave 1 or hours early, but when I get home, watch something for 1 hour or so/ go to the gym, I fire up my laptop and starting working until I feel sleepy (usually after midnight). So ultimately, I work +10 hours everyday in a \"relaxed manner\".  This is why it never effected my productivity, but again, I wish I can do that work in the lab and get it over with.",
  "author": "No_Conversation_2026",
  "created": 1630778649,
  "updated": 1634079401,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 0.81,
  "comments": {
    "hblfusm": {
      "link": "/r/AskAcademia/comments/phwgdh/i_found_a_postdoc_in_the_uk_after_9_months_of/hblfusm/",
      "text": "Has your supervisor complained? What has stirred these anxieties? Operating under the phantom pressure of what you assume a postdoc should perform or behave like is a recipe for disaster.\n\nI suggest having a conversation with your advisor to ensure that you’re meeting their expectations, and to think through how your current performance aligns with your near- and far-term goals. Otherwise, if you and your boss are both comfortable with the progress you’re making, what’s the issue? I don’t think it’s worth the grief. You should certainly be strategic during your postdoc, but there are ways to do so without working yourself to the bone.",
      "author": "texas-sheetcake",
      "created": 1630779256,
      "upvotes": 11,
      "replies": {
        "hblhvkv": {
          "link": "/r/AskAcademia/comments/phwgdh/i_found_a_postdoc_in_the_uk_after_9_months_of/hblhvkv/",
          "text": "No, actually he is very satisfied, well technically he hasn't raised any issues, but I am definitely meeting the short-term goals. You actually mentioned the issue, I work a lot! No I don't feel any pressure from anyone and no one has complained about my progress. But I wish I can do this differently, get my work done WHILE I am in the lab and leave those issue there when I leave.",
          "author": "No_Conversation_2026",
          "created": 1630780172,
          "upvotes": 4,
          "replies": {
            "hblmy7a": {
              "link": "/r/AskAcademia/comments/phwgdh/i_found_a_postdoc_in_the_uk_after_9_months_of/hblmy7a/",
              "text": "Do you maintain a to-do list? This is also dependent on the lab environment, but it’s important to get in the mindset that tasks completed is more important than time spent working. Some people are just able to work more efficiently, accomplishing more tasks in a shorter time frame. Keeping track of what you’d like to accomplish is one way to help get into that mindset. This may also help you break tasks into smaller pieces so you can achieve more while physically at work, so you can leave it behind when you go home.",
              "author": "texas-sheetcake",
              "created": 1630782473,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hbmad8d": {
      "link": "/r/AskAcademia/comments/phwgdh/i_found_a_postdoc_in_the_uk_after_9_months_of/hbmad8d/",
      "text": "Working from home is also working so I wouldn't stress. But chat to your PI, because it may be that they have expectations of you being in the lab to teach others or do something lab based. If there aren't then, don't stress. Just tell your PI you prefer doing some of the work from home and enjoy life. I think there's so much out there (especially Twitter) on how postdoc life is horrendous that many people think that if they are happy then something must be wrong. But honestly, some fields are worse than others and some PIs are worse than others. I was a pretty happy postdoc.",
      "author": "WhoMeNoMe",
      "created": 1630793219,
      "upvotes": 3,
      "replies": {}
    },
    "hbm6i8i": {
      "link": "/r/AskAcademia/comments/phwgdh/i_found_a_postdoc_in_the_uk_after_9_months_of/hbm6i8i/",
      "text": "Honestly, I wouldn't stress unless your PI complains or raises issues. It's normal for the first year of your postdoc to be less stressful/busy than the last year of your PhD anyway, and they'll likely give you some leeway as you settle into the UK (I moved overseas for a postdoc as well, and the first month or so was a total write-off doing admin things, and it took me a lot longer to 'settle in').\n\nYou didn't say where you did your PhD, but European/UK working cultures are (stereotypically!) a bit more relaxed than US/Asian working cultures, so it might just be a matter of adjusting to that. It will take time to adjust to a new working environment and culture as well.\n\nReading your other reply, if you're worried about setting a more explicit boundary between home and work, part of it comes down to your discipline (i.e. get to work at 9, leave at 5, and when you get home, shut your work computer off and don't check emails). That said, if you work fine, aren't burning yourself out and are getting the work done using your current approach, then what's the issue?",
      "author": "mahler004",
      "created": 1630791397,
      "upvotes": 2,
      "replies": {}
    },
    "hbm8lpw": {
      "link": "/r/AskAcademia/comments/phwgdh/i_found_a_postdoc_in_the_uk_after_9_months_of/hbm8lpw/",
      "text": "We all work at different paces and we all think that everyone else is working harder than we do. After all, we know precisely how much goofing off we do. So give yourself as break. Work out and set REALISTIC goals, then crack on.",
      "author": "dbrq",
      "created": 1630792374,
      "upvotes": 2,
      "replies": {}
    },
    "hboav7n": {
      "link": "/r/AskAcademia/comments/phwgdh/i_found_a_postdoc_in_the_uk_after_9_months_of/hboav7n/",
      "text": "Think about leaving the contract? It’s not like this everywhere. I did a post doc where I had to be in the lab from 9:30 to 3:30 every day, even if I had no lab work that day. It was ridiculous, so I quit and went elsewhere where they appreciated the benefits of flexible working hours.",
      "author": "EmFan1999",
      "created": 1630840144,
      "upvotes": 2,
      "replies": {}
    },
    "hbnmzag": {
      "link": "/r/AskAcademia/comments/phwgdh/i_found_a_postdoc_in_the_uk_after_9_months_of/hbnmzag/",
      "text": "As my PI always says, ‘do whatever floats your boat, as long as you’re making progress’. We all wish we didn’t have to work “extra hours” the reality is academics think about work all the time and I’m not saying it’s a good thing but it’s a cultural norm (just observation no data). I have NEVER met anyone in academia who doesn’t work after they get home. So I wouldn’t fret about it.",
      "author": "Cookeina_92",
      "created": 1630819953,
      "upvotes": 1,
      "replies": {}
    }
  }
}