{
  "sid": "o69fk7",
  "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/",
  "title:": "Professor is either developing dementia or burnt out...",
  "text": "An older professor in our group has always had a very rude character but lately she's been super weird. I've cc'd her in an email to a collaborator about a data transfer and she replied: \"why are you asking him how to handle him the data?? I don't understand!! Didn't I tell you to handle him the data?\". When I asked her what I should present to an online meeting that was about to happen in 6 days she organized she replied \"what on earth are you talking about?\". She had no idea there was a meeting...\n\nI talked to the people she's the PI of and they're desperate. In the last 6 months she's been constantly sending them incoherent emails with contradictory request, if the text even made sense at all. She refuses face to face meetings (both her and her staff have been fully vaccinated for more than 4 months). They've also told me that... In most of these rambling emails she keeps writing \"I don't understand\". A sentence she hasn't ever used before. And all of this of course results in huge delays in all of the projects.\n\nShe's probably got some huge issues... We seriously suspect dementia (she's the PI of a team that studies Alzheimer's disease) or maybe just a burnout due to pandemic stress...  And... How do we tactfully deal with this? What exactly can be done about this?",
  "author": "tAway_552",
  "created": 1624440814,
  "updated": 1634080126,
  "over_18": false,
  "upvotes": 363,
  "upvote_ratio": 0.98,
  "comments": {
    "h2r6nmo": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2r6nmo/",
      "text": "this isn't something that you should be expected to manage on your own. talk to her line manager about your concerns - dean, head of school, whatever it is there for you. approaching this and working to find solutions is their problem, not yours.\n\nlastly, these are very valid concerns and you are 100% justified in approaching a higher-up about them. you might been guilty like you are tattling, but things are dysfunctional right now and it is affecting the work environment, and by taking appropriate measures in a professional way, you are doing the right thing.",
      "author": "pengawin",
      "created": 1624445718,
      "upvotes": 311,
      "replies": {
        "h2rawwf": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rawwf/",
          "text": "An addendum, if possible, don't do this on your own.\n\nTalk to your colleagues, see if they agree and try to act collectively.",
          "author": "Guy_2701",
          "created": 1624449024,
          "upvotes": 177,
          "replies": {}
        }
      }
    },
    "h2rh41a": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rh41a/",
      "text": "Sorry for the long answer, but I have been in a similar situation. My graduate advisor was older, and had always been famously difficult to work with. While prickly and not great at communicating, the first few years were managable. During the last two years of my degree, she became unbelievably difficult to work with. She would disappear for weeks at a time and when she resurfaced she would send incoherent emails, she never provided any feedback on research and clearly was not keeping up with the literature, she would miss important deadlines and come up with wild, implausible excuses as to why - a couple of times I went to her house (she lived alone), and I found her front door open, or other things very out of place. Lots of concerning things, and I firmly believe she had dementia. She ended up retiring before I finished my degree (while I was doing my dissertation research abroad, and she didn't even officially tell me) and I finished with her as my chair but as an emeritus professor. No one ever directly addressed her health, but I had multiple meetings with my other committee members and department chair before defending where it was made clear to me that she would not be an obstacle in me finishing my degree. I also had committee members tell me they would step in and write letters of recommendation (it was not *directly* addressed as to why I would need that) and other such offers that made it clear to me that everyone was aware of the situation. I finished up one paper with her after I graduated, but after that I moved on and found more reliable people to work with. \n\nAt the time it made me absolutely crazy and I could not believe everyone would just let her behave like that, but looking back, I think it was actually handled with a fair amount of grace. She retired (I never got an answer as to whether she was forced to or decided herself she needed to), the department made sure I completed my degree, and my committee helped me get a job. \n\nI would suggest you reach out to the other people she works with and discuss the situation without being to explicit before going to any higher ups. Bring evidence of her behavior with you if you do go to the dean, but only show it if it becomes clear that they are unaware of the behavior (I always had the emails/ texts/ etc. of her communication with me for meetings with other people, but never needed to show them). Figure out which of her students can finish their research with her minimal envolvement, and who may need to transition research groups. If you can, try to finish up or disentangle all of your own research collaborations with her and then cut ties. Also, if you are in a position, think about her current students and if you can offer to be references for them. It was incredibly valuable for me to have other people to step in and write recommendations when she could/ would not. Hope this helps!",
      "author": "sieze_the_clay",
      "created": 1624452968,
      "upvotes": 106,
      "replies": {
        "h2t1aey": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2t1aey/",
          "text": "I've seen a lot of situations with older faculty who ought to retire but have clung to their positions for just a bit too long until they're going on autopilot and barely functioning anymore. \n\nUltimately it's out of their control, and it sounds like their colleagues stepped up to help you finish with as little disruption as possible. No one ever wants to say \"you can't function anymore,\" especially to someone who built their career and life around their mental acuity and intellectual work.",
          "author": "fleemfleemfleemfleem",
          "created": 1624478718,
          "upvotes": 34,
          "replies": {}
        }
      }
    },
    "h2r7rs3": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2r7rs3/",
      "text": "Everyone needs to print their emails and present them as evidence to the dept chair and if necessary the dean.",
      "author": "DickDraper",
      "created": 1624446622,
      "upvotes": 89,
      "replies": {}
    },
    "h2r6dpf": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2r6dpf/",
      "text": "Can you talk to the department head? I'm not sure if you are in the group or a professor (i.e., sort of subordinate vs an equal colleague?).",
      "author": "BananasonThebrain",
      "created": 1624445486,
      "upvotes": 53,
      "replies": {
        "h2r9yk6": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2r9yk6/",
          "text": "I'm lower down the \"chain\" (Research associate), but I'm not along the same one, I'm in a separate group, even if I often collaborate with her. She's full professor and even the head of one unit and one PhD program...",
          "author": "tAway_552",
          "created": 1624448320,
          "upvotes": 14,
          "replies": {
            "h2raj3s": {
              "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2raj3s/",
              "text": "So I'm going against the grain here and I'm not sure there is much you can do. I only say that because if she has collaborators across the dept like you, she's head of a unit and running a PhD program then senior administration must already know there's a problem and either are already doing something about it or are ignoring it. \n\nThat said, does she have a PA and/or does her manager have a PA? If you have a good relationship with either of them they may be able to tell you if something is already happening or may be able to raise it themselves. Good administrators are the life blood of any dept and are a great place for junior staff to get contact with the higher ups. That's also why bad admins are so toxic to an org.",
              "author": "ACatGod",
              "created": 1624448746,
              "upvotes": 20,
              "replies": {
                "h2rbisu": {
                  "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rbisu/",
                  "text": ">senior administration must already know there's a problem and either are already doing something about it or are ignoring it\n\nI'm not sure... She's been starting acting differently last summer, *very* differently by winter and I had the realization about how many times she's said \"I don't understand\" in the last months just yesterday.\n\nConcerning admins, if she kept signing documents on time after being reminded... She's probably not showing *that* much yet.",
                  "author": "tAway_552",
                  "created": 1624449465,
                  "upvotes": 20,
                  "replies": {
                    "h2si4eo": {
                      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2si4eo/",
                      "text": "If she's running a department and a PhD program she will be involved in a lot of decision making, there will be deadlines, reports, meetings, committees etc. I think it's really unlikely you've been seeing altered behaviour for a year but her colleagues haven't noticed anything and her leadership is totally unaffected.\n\nAs for PAs, I think I wasn't being clear. PAs often have much closer relationships with people than other staff plus also tend to know what's going on because they're managing diaries and sometimes are sitting in on meetings. This means that they can sometimes raise stuff that other people can't, and they can sometimes give you a steer about what to say and to who. If the PI has a PA they may have noticed something and/or may be aware that something is being done. If the PI's boss has a PA they may be able to raise the issues with the boss.\n\nI'm fairly senior and I work in the office of the most senior person in my org, I have regular meetings with them and have access to the rest of the senior leadership. I still talk to their PAs all the time to talk about what they have on, what the best timing for something is, gather intelligence, generally find out the lay of the land whenever there's something tricky for me to deal with, and sometimes the PA will raise stuff because it's easier for them to do it.",
                      "author": "ACatGod",
                      "created": 1624470011,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h2r7i8y": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2r7i8y/",
      "text": "Since there's a huge difference between burn out and Alzheimer's but both require help, you or someone else needs to ask her how she's doing. \"How've you been lately? You haven't quite seemed yourself. Feel like you're up for talking to someone?\" That shows others have seen a problem without triggering the defensiveness that comes with questioning the mental health of a person whose identity is tied to high intelligence (professor, lawyer, doctor, etc.). \n\nIt's not the best idea to make guesses about someone's health, let alone tell them your guesses. But it's appropriate to tell them you've seen a change and may want to seek medical or professional advice if they too think it's affecting their work.",
      "author": "dcgrey",
      "created": 1624446413,
      "upvotes": 74,
      "replies": {
        "h2rb7nt": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rb7nt/",
          "text": ">Since there's a huge difference between burn out and Alzheimer's but both require help, you or someone else needs to ask her how she's doing. \n\nThe things is that I'm one of the most senior and... I'm 35 years younger than her! And she's quite old school, so it's not usual to talk to her like that for us.\n\nI'll see if there's a way to convince some people at her same level to talk to her in this friendly way",
          "author": "tAway_552",
          "created": 1624449241,
          "upvotes": 41,
          "replies": {
            "h2reili": {
              "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2reili/",
              "text": "Ah yeah, that's something i should have added. If _you've_ noticed it, it's almost certain her fellow faculty have noticed it too. If they have, they're having this same conversation. Within faculty, it's discussed in a way that most people would think of as gossip, but it's kinda all they've got until the dam breaks. \n\nYou'll be the judge of who's best to ask. If this were a situation my dept, I would handle different faculty, well, differently, knowing that some respond well to colleagues they're friends with and others respond well to those they came up institutionally with.\n\nIf you'd like some more perspective, Google websites that discuss this topic for business partnerships. There's lots out there about medical practices, accountancy firms, etc., and they're more open about it because someone's decline costs money and opens them to liability. And being a partner is the for-profit analogue to tenure.",
              "author": "dcgrey",
              "created": 1624451439,
              "upvotes": 19,
              "replies": {}
            }
          }
        }
      }
    },
    "h2reco3": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2reco3/",
      "text": "my dean had this type of behavior and turns out he was having mini strokes and didn't know it.  took a couple of years and a lot of medical interventions to get him back on track.  I'd say for sure someone should reach out and talk with her and/or her family if anyone is close enough.",
      "author": "printandpolish",
      "created": 1624451336,
      "upvotes": 21,
      "replies": {}
    },
    "h2r8fy1": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2r8fy1/",
      "text": "Talk with someone about it, but don't call it dementia. You aren't in a position to make that assessment - it's like armchair diagnosing of any other mental illness. Completely valid to discuss the disruptive behavior, though.\n\nFwiw, I have a collaborator who is a pain to work with who has always been the way you describe this person - more in times when they are very busy - and it's just their personality as far as I know. Rude, imperious, can't be bothered to stay up to date with what's going on with the project, hopelessly ill-informed, doesn't understand any of our research methods. It makes me think they got into academia at a time when standards were much lower, but I wouldn't make the leap to dementia. There are so many issues someone can have.",
      "author": "uniadminthrowaway",
      "created": 1624447159,
      "upvotes": 37,
      "replies": {
        "h2ra754": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2ra754/",
          "text": ">Talk with someone about it, but don't call it dementia.\n\nWe're a research group about dementia and... One of our basic topics is how outside symptoms are absolutely not specific.\n\nThe fact is that she's have been rude all of her life but she suddendly changed. She quite suddendly went from \"just rude\" to writing down incoherent text, not knowing what she's doing, and talking in a very different way.",
          "author": "tAway_552",
          "created": 1624448499,
          "upvotes": 33,
          "replies": {
            "h2rcls1": {
              "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rcls1/",
              "text": "Wow this gives us a completely different perspective. The fact that you are a professional in this area is an important element. I've dealt with a relative with dementia and I know she felt very bad about treating people badly. You will know that from outside, these people seem rude, but inside their world falls to pieces. I hope you guys can solve this.",
              "author": "Ironrunner16",
              "created": 1624450206,
              "upvotes": 12,
              "replies": {}
            },
            "h2rzste": {
              "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rzste/",
              "text": "The age is cerainly an influencing factor, but are you aware of whether she contracted COVID? I have a friend (a colleague of my spouse) who did something similar post-COVID. She was aware she was \"off\" but didn't realize how much. It has been a slow recovery over the better part of six months, and her writing is still not where it was, but it is improving, and she is far less disoriented now.",
              "author": "halavais",
              "created": 1624462173,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "h2r80bh": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2r80bh/",
      "text": "1. Talk to her as a human being, try to make her feel comfortable and not attacked in a professional space.\n2. However, indicate that lots of people have noticed a significant change in behavior. \n3. Only approach higher authority if the situation does not change at all or if she completely refuses to acknowledge any misgivings. \n4. It might sound silly, but a friend of mine had a similar experience with a boss who has probably alcoholism.",
      "author": "mess92",
      "created": 1624446812,
      "upvotes": 23,
      "replies": {}
    },
    "h2rdhg7": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rdhg7/",
      "text": "This sounds *exactly* like me at the height of my burnout and situational depression. I was a real monster.\n\nI’d frequently use ‘I don’t understand’ as shorthand for ‘I am frustrated that this is all f-ed up and also you are 100% to blame for it being f-ed up, not me.’ I have two Harvard degrees yet I’d make the most basic mistakes with grammar and spelling. I sounded like a crazy person in my emails, because I was shooting them off in a rush and really only half paying attention to what I was writing. I was rude to coworkers and employees, and didn’t mince words because my overall attitude was ‘screw it’ and I couldn’t muster the emotional energy to sugar coat negative feedback.\n\nIt really doesn’t super matter (from a professional/academic standpoint) what the reason for the behavior is. It’s unacceptable and needs to be flagged to someone ‘up the chain.’ I don’t think bringing it up directly with the professor is a good strategy even if it’s a burnout situation.",
      "author": "jennbot3000",
      "created": 1624450788,
      "upvotes": 22,
      "replies": {
        "h2rec2f": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rec2f/",
          "text": "Indeed... Oh the spelling errors she puts in 1 line emails she sends even to famous collaborators from other universities. \n\nDespite being a full professor and head of a PhD program. And she speaks fluently at least 3 languages... That's definitely not her",
          "author": "tAway_552",
          "created": 1624451325,
          "upvotes": 17,
          "replies": {}
        },
        "h2tf7xn": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2tf7xn/",
          "text": "If I can ask, how did you get out of it?",
          "author": "sorrytosaythis_but",
          "created": 1624485009,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h2rkoqr": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rkoqr/",
      "text": "A friend had a coworker go through something similar - onset of unintelligible emails, unable to string sentences together or keep track of things, etc. turns out she has a massive brain tumor. My point is you don’t know what is going on with her so be careful about saying dementia or burnout. Obviously your career and your work is important, but your PI could be in a really bad place medically or even just emotionally. Your work will survive this, so try to figure out the best way to get the PI help.",
      "author": "Takeurvitamins",
      "created": 1624454926,
      "upvotes": 13,
      "replies": {
        "h2rl087": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rl087/",
          "text": "Yeah, I mentioned dementia and burnout just because they're the most likely causes... but of course it can be whatever, including stopping giving a fuck",
          "author": "tAway_552",
          "created": 1624455092,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h2sidgj": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2sidgj/",
      "text": "Just a note to say that if this erratic behaviour has come on only recently, it likely is not dementia, which develops much more slowly.\n\nNevertheless, I do think you should first bring this up with any peer colleague who is close to her, or any other person who might have insight into her personal life before making any kind of official complaint. She may well be somewhat overwhelmed by events or circumstances that have little to do with work *per se*, or dementia.",
      "author": "dapt",
      "created": 1624470126,
      "upvotes": 4,
      "replies": {}
    },
    "h2ry2q1": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2ry2q1/",
      "text": "[deleted]",
      "author": null,
      "created": 1624461404,
      "upvotes": 3,
      "replies": {
        "h2rz1al": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rz1al/",
          "text": "Ok, maybe she used it at times before. I never noticed. Trying to recall things, when she was reviewing our papers she wrote either \"you're not being clear\" or ask a full question like \"if I'm understanding correctly you did this. Why didn't you do that?\"",
          "author": "tAway_552",
          "created": 1624461832,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "h2ucql7": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2ucql7/",
      "text": "I'm an academic, and I've seen similar situations. Academia is not like the business world, in which loss of competence is recognized by various co-workers, including some who are not afraid to address such issues because of impact on the business. In academia, people tend to work longer before they retire and senior, tenured professors are given a lot of independence. Students are probably much more familiar with the competence of faculty members than are their faculty peers, who may only interact closely in occasional meetings. I've seen professors with serious behavioral issues do egregious things yet continuing working for years because no one wanted to intervene. It can be very difficult to motivate a department chair or dean to address problems like this, or even to alert the family. Even if they want to resolve the issue, it can be a long and complicated process. Recently at my university a professor was discovered to have had serial affairs with grad students, but it took almost 3 years to remove them from the department. This one reason why you must alert this woman's chair, and/or dean, and encourage others to join you. It may take a protracted process to see any results. Also, it sounds as though this person may have a serious issue that needs to be addressed-and you can't rely on others to alert people.",
      "author": "wildblueroan",
      "created": 1624502543,
      "upvotes": 3,
      "replies": {}
    },
    "h2rvi9s": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rvi9s/",
      "text": "When I was a freshman in college, I had a freshman seminar with an older professor. He was meant to become my academic advisor, so this was a serious relationship, in a class of 12, seated at a round table. But his class was at 8am and I missed it 8 times in a row- almost three full weeks. I went in desperate to salvage whatever I could of my grade- I took my place at the table and he was discussing our “research papers”, which we had apparently been asked to have an idea for, ready to be approved that day. He looked right at me and said “I had suggested that you might want to do something on entrepreneurship in Meiji Japan, but you didn’t seem to pick up on my suggestion”- and I realized that he DIDN’T KNOW that I’d been absent. So I quickly agreed that that was indeed the topic I had chosen, and he was very pleased.\nA few weeks later, he passed out a “study guide” fir the final. We all studied together. The. We got the actual exam. IT WAS THE EXACT SAME PAPER. \n\nI got an A+ in that class and everyone else failed the final and got a D, because “It SEEMS like some of you worked together!”\n\nWhen I tried to get my schedule signed fir the spring semester, there was a note on the door. He had been diagnosed with a brain tumor. Everyone got a B, except for me. I retained my A+.",
      "author": "hafdedzebra",
      "created": 1624460228,
      "upvotes": 5,
      "replies": {
        "h2whc17": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2whc17/",
          "text": "Entrepreneurship in Meiji Japan is a fascinating topic.",
          "author": "comped",
          "created": 1624552742,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h2rks7p": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rks7p/",
      "text": "There’s a lot of good advice here, but slightly tangentially—why is there not an age limit for tenured professors? Many faculty receive huge salaries (the equivalent of several young assistant professors), massive office spaces they never use, and all the other privileges of professorship at age 80+ and at the same time don’t advise or advise students poorly, don’t teach or teach poorly, etc. It’s ridiculous IMO.",
      "author": "DownrightExogenous",
      "created": 1624454975,
      "upvotes": 9,
      "replies": {
        "h2rlt40": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rlt40/",
          "text": "Good question. I'm extremely conflicted on this. On one side I see the value on keeping around someone with good experience, especially if they're retired so they're working for free. I also remember my grandpa (self-employed engineer, not academic) who retired at 84 and stopping working really killed his spirit. Losing an intellectual job is depressing.\n\nOn the other side, seeing these people ammassing labs and offices for themselves just to do whatever they want if and when they want... Seems outright wrong when you're underpaid!! \nEspecially when they don't really provide their expertise in a constructive manner. Like when they gatekeep what's right and what's wrong according to what they believe based on their 30y/o knowledge.",
          "author": "tAway_552",
          "created": 1624455508,
          "upvotes": 10,
          "replies": {
            "h2rn1hw": {
              "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rn1hw/",
              "text": "Yes, I think if they’re working retired the calculations are a bit different. I hear you on how hard retiring entirely can be, something similar to your uncle happened with my father. Anyway, just thought I’d throw it out there, thanks for replying.",
              "author": "DownrightExogenous",
              "created": 1624456137,
              "upvotes": 2,
              "replies": {}
            },
            "h2t6lzu": {
              "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2t6lzu/",
              "text": "I think emeritus fills this gap though. Many keep their office or have access to an emeritus office, and I’ve known plenty of emeritus academics to keep doing research, keep attending meetings etc. They’re just not in charge of teaching or formal student mentoring anymore. Can still do guest lectures perhaps.",
              "author": "officially_anxious",
              "created": 1624481082,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h2s0pam": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2s0pam/",
          "text": "I am 50. In my unit, some of the most productive faculty are in their late 70s. While age and performance (to include giving significant numbers of fucks) may be correlated, why not base it on what ypu care about: performance.\n\nOne of my profs in grad school was still giving seminars well into his 90s. They forced him out the year before he died. Was he super productive? No. But I was glad to be able to work with someone who had had such a large influence on our field.",
          "author": "halavais",
          "created": 1624462576,
          "upvotes": 8,
          "replies": {
            "h2sa39o": {
              "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2sa39o/",
              "text": "Yes, there are definitely super-productive, elderly professors. But they suck up resources and block the next generation from receiving positions. If they are as great as the ysound, then they should have mentored many people that could carry on their line of work. \n\nUniversities would do well to come up with something other than Prof. Emeritus to keep those people engaged in the university without preventing progress, new hires, etc",
              "author": "urbanevol",
              "created": 1624466679,
              "upvotes": 2,
              "replies": {
                "h2sw1vd": {
                  "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2sw1vd/",
                  "text": "OK, but if they are productive, why replace them (erm, me). That feels pretty plainly ageist to me. If they are in the position, doing the work, they aren't blocking anyone from anything...",
                  "author": "halavais",
                  "created": 1624476459,
                  "upvotes": 2,
                  "replies": {
                    "h2t89zb": {
                      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2t89zb/",
                      "text": "You said you're 50! That's a lot different than someone in their 70's or 80's, especially as serious mental decline sets in at those ages for most people",
                      "author": "urbanevol",
                      "created": 1624481804,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "h2vnj9r": {
              "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2vnj9r/",
              "text": "Fair enough. If there were a way to do that instead just using age as a proxy I’d of course support that—it would require a whole overhaul of tenure though.",
              "author": "DownrightExogenous",
              "created": 1624538573,
              "upvotes": 1,
              "replies": {}
            },
            "h2wh311": {
              "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2wh311/",
              "text": "I've told this story before here, and it's similar to yours. My college has a former dean who still teaches in his 90s - and who was the founding dean of the college from 2003 or 04, up until, I think, 2018. The guy who heads up one of the college's degree program is 83 and not too concerned about retiring in the next few years. We have a number of professors and instructors who are above 70 - I'd say the average age of faculty could receive social security or at least medicare.",
              "author": "comped",
              "created": 1624552631,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h2rpu9w": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rpu9w/",
          "text": "There is in some places. In Germany, for example, professors must retire at the federal retirement age (67; though I think they can extend for a short period). Much better policy.",
          "author": "simoncolumbus",
          "created": 1624457526,
          "upvotes": 2,
          "replies": {
            "h2rrhes": {
              "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rrhes/",
              "text": "Here in Italy employees must retire at 67. Professors fought to keep the limit at 72, with the possibility to extend to 75....",
              "author": "lucaxx85",
              "created": 1624458326,
              "upvotes": 4,
              "replies": {}
            },
            "h2t6uhr": {
              "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2t6uhr/",
              "text": "Similar in the UK too. Can extend if they win a major grant, but not for long.",
              "author": "officially_anxious",
              "created": 1624481190,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h2s9guj": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2s9guj/",
      "text": "I've seen this kind of thing multiple times. Dementia or chronic illnesses basically making it impossible for a professor to do their job properly. It can go on for years if not too bad.\n\nUltimately, you need to get  a department chair, or the next person up the chain (probably a Dean of the school, Provost, etc), on your side to deal with the issue. If it is what you fear (serious, irreversible dementia) then they can try to get them to retire. If they can't get them to retire, then they can start taking away things like leadership positions, access to graduate students and even lab space. If federal grants are involved, then they could potentially be removed as PI or co-PI because the grants technically go to the institution. These things take time, so you would need to find someone on your side with power.",
      "author": "urbanevol",
      "created": 1624466414,
      "upvotes": 2,
      "replies": {}
    },
    "h2txo3q": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2txo3q/",
      "text": "You and some people from her lab need to talk to the department head about 3 months ago and explain all of what's going on, with examples of e-mails, and show that this is coming from a place of genuine concern.",
      "author": "tangentc",
      "created": 1624494539,
      "upvotes": 2,
      "replies": {}
    },
    "h2ulx52": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2ulx52/",
      "text": "I had a professor for statistics for the social sciences. The first half of the semester, he seemed okay. The second half he didn’t show for almost all the classes, he came in for the review and was surprised when we asked why he wasn’t there for the previous classes. He showed up for the final ( which I somehow managed to pass) the problem was my next class was experimental psychology and you need to know the statistics and how to calculate and read them. I had to send an email to the EP professor explaining what happened in my statistics class. I don’t know what happened to that professor but I wished there was someone to go to while the class was in session. They survey you for adjuncts but not tenured professors.",
      "author": "UMOTU",
      "created": 1624507819,
      "upvotes": 2,
      "replies": {}
    },
    "h2v6q9x": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2v6q9x/",
      "text": "Has anyone thought about possible stroke or mild TIA?",
      "author": "pablskeetz",
      "created": 1624524932,
      "upvotes": 2,
      "replies": {}
    },
    "h2rj5a4": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rj5a4/",
      "text": "I had professor resembling these same tendencies, she was renowned and highly regarded due to multiple patents she worked on with Motorola throughout the 80’s and 90’s. But it was said shortly after her divorce, that’s when things started to degrade in her performance. As students we witnessed her verbally abuse other students in the classroom, calling them a disruption, etc. when they were actually quiet. We took the direction of talking with the Deans of the Engineering college we attended, and 1 Dean said often she isn’t what she used to be. She later couldn’t perform lectures anymore and other professors took over her classes at the beginning of the next semester. It was said, because she seemed like a nice woman and awesome professional. Many other students had great things to say about her from years past. We weren’t as fortunate to have that version of her. I hope she’s well now, where ever she is.",
      "author": "tnallen128",
      "created": 1624454108,
      "upvotes": 5,
      "replies": {
        "h2se90x": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2se90x/",
          "text": "I’m reading through this thread thinking what the fuck is going on in academia",
          "author": "temple3489",
          "created": 1624468302,
          "upvotes": 7,
          "replies": {
            "h2u2vle": {
              "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2u2vle/",
              "text": "It's fucked up. The amount of stress people, students and professors alike, deal with is huge. Much of it is related with publish and perish culture. And if something adds on to this daily life stress, it is sure shot recipe for craziness.",
              "author": "watrutalkinabut",
              "created": 1624497349,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h2rpg5k": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rpg5k/",
      "text": "I had a similar situation. I actually took three courses from this professor over the years, in the final course a handful of the same students were in all three courses with me. \n\nThe whole class would talk about the professor, who was ~75 years old, generally being a bit off, and those who'd had the professor in the past corroborated that they didn't use to be like this. Lectures were disjointed at best and sometimes completely nonsensical. Blatant grading errors. Misplaced tests, essays, etc. Eventually we spoke to the dean of academic affairs who I was close with after she helped me resolve an issue with another professor. \n\nThey ended up \"retiring\" at the end of the semester.",
      "author": "djsquilz",
      "created": 1624457332,
      "upvotes": 2,
      "replies": {}
    },
    "h2t13tb": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2t13tb/",
      "text": "How would her specialization affect her diagnosis?  You think that studying Alzheimer’s increases your risk of dementia?",
      "author": "faze_not_phase_123",
      "created": 1624478638,
      "upvotes": 2,
      "replies": {}
    },
    "h2rea94": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rea94/",
      "text": "Know a lot of people that specialized in some pathologies because people close to them have been affected.\nMaybe she has family antecedents? Maybe that's a bit of a stretch",
      "author": "thejuror8",
      "created": 1624451294,
      "upvotes": 1,
      "replies": {}
    },
    "h2rfqa7": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rfqa7/",
      "text": "People with dementia are usually in denial and try to cover it up (in my experience). Add that to the professor personality of resisting being displaced. Definitely put in a note to the chair/dean. They have probably already heard plenty of concerns.",
      "author": "OttawaExpat",
      "created": 1624452166,
      "upvotes": 1,
      "replies": {}
    },
    "h2rbilz": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rbilz/",
      "text": "Maybe her rudeness and confusion are signs of a brain tumor?",
      "author": "skystuff",
      "created": 1624449461,
      "upvotes": 0,
      "replies": {
        "h2rbnyi": {
          "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2rbnyi/",
          "text": "You can never know! But at her age other pathologies are definitely much more common.",
          "author": "tAway_552",
          "created": 1624449566,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h2raf39": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2raf39/",
      "text": "The lack of professionalism is evident there. There's a human element to everything but your supervisor's attitude is awful.",
      "author": "Cute_Ad_7296",
      "created": 1624448664,
      "upvotes": -1,
      "replies": {}
    },
    "h2sh68k": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2sh68k/",
      "text": "I work at a university and we had a similar issue. Talk to the department chair above her. She may need to retire. (Our professor retired.)",
      "author": "MotherHolle",
      "created": 1624469583,
      "upvotes": 1,
      "replies": {}
    },
    "h2szsjl": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2szsjl/",
      "text": "I'd recommend controlling that which you can. Document everything, send confirmations via email and cya.\n\nIf she assigned you to do it verbally, emails \"as per our discussion\". Start document timelines and diary dates and when there are inconsistencies use the evidence.  Also document your workload, and don't cover for her if something goes wrong. Let the administration handle her.",
      "author": "Ok-Refrigerator-2432",
      "created": 1624478078,
      "upvotes": 1,
      "replies": {}
    },
    "h2u5xdm": {
      "link": "/r/AskAcademia/comments/o69fk7/professor_is_either_developing_dementia_or_burnt/h2u5xdm/",
      "text": "She was having a stroke?",
      "author": "kasra545",
      "created": 1624498976,
      "upvotes": 1,
      "replies": {}
    }
  }
}