{
  "sid": "hueqma",
  "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/",
  "title:": "Dealing with research burnout during COVID",
  "text": "Is anyone else experiencing research burnout? Especially in the humanities where most of my research is just staring at a screen. Feel like I can't read a single article without my eyes glossing over. Any tips for dealing with this?",
  "author": "ApartAssumption5",
  "created": 1595218575,
  "updated": 1634080537,
  "over_18": false,
  "upvotes": 261,
  "upvote_ratio": 0.99,
  "comments": {
    "fymnd62": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymnd62/",
      "text": "I don’t know if this qualifies as burnout, but I actually just feel really unmotivated overall. We’ve been shut down for months (STEM lab), and though we are now slowly reopening, I’m finding myself with little excitement to return. Maybe working from home just zapped the fun out of my research, but I’m definitely not in the same “zone” as I was prior to the pandemic.",
      "author": "BiologyPhDHopeful",
      "created": 1595219483,
      "upvotes": 149,
      "replies": {
        "fyn18we": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyn18we/",
          "text": "This is what I hear from all of my colleagues, too. \n\nThe shut down put my lab's progress back by about 3-6 months, and that's not including time lost. Now we're all exhausted, behind, and looking at several months of work just to get back to where we were before the pandemic. \n\nAnd not only that, but there's a large chance the work might be completely in vain if we have to shut down again.",
          "author": "Eigengrad",
          "created": 1595231596,
          "upvotes": 53,
          "replies": {
            "fyndnfr": {
              "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyndnfr/",
              "text": "Hearing that makes me feel better. We’ve been shut down since March, and my motivation to be back in lab has gone to 0%, the fact my graduation will probably be pushed back because of covid kinda depresses me. I’m in a hot spot for covid so our school has been really cautious about it.",
              "author": "youwearajacket",
              "created": 1595244221,
              "upvotes": 14,
              "replies": {}
            },
            "fynei9b": {
              "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynei9b/",
              "text": "this 100000%",
              "author": "lalochezia1",
              "created": 1595244984,
              "upvotes": 8,
              "replies": {}
            },
            "fynrjym": {
              "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynrjym/",
              "text": "This isn’t my experience at all. Everyone I know is champing at the bit to get back to work.",
              "author": "Aubenabee",
              "created": 1595254155,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "fymqkmb": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymqkmb/",
      "text": "[deleted]",
      "author": null,
      "created": 1595221934,
      "upvotes": 65,
      "replies": {
        "fymv4nf": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymv4nf/",
          "text": "Second the tablet suggestion. Took way too long to buy one, but it's way easier to stay engaged. Especially if you only use it for reading papers.",
          "author": null,
          "created": 1595225785,
          "upvotes": 19,
          "replies": {
            "fynejpe": {
              "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynejpe/",
              "text": "I've been thinking of this for ages, I think it would real help me! Any suggestions on brand/model?",
              "author": "magpie2295",
              "created": 1595245021,
              "upvotes": 3,
              "replies": {
                "fynky4t": {
                  "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynky4t/",
                  "text": "If your sole purpose is for marking up papers, go cheap.  Samsung Tab As are quite cheap and last forever.  I bought one that came with a stylus for $200 or so back in 2015 and it's still kickin.  And mobile storage and screen resolution has improved massively since then while maintaining similar prices\n\nE:  I use the Adobe app markup feature.  The frustrating part is mobile Adobe only saves to their cloud, but as soon as you open the adobe app on your computer and sync you can download the mark up to your computer.  I've dabbled with other apps, but I like to keep things simple and you as few platforms/apps as possible.",
                  "author": "thecatofalamogordo",
                  "created": 1595250003,
                  "upvotes": 10,
                  "replies": {
                    "fyp0r1g": {
                      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyp0r1g/",
                      "text": "Second the tab a! It's a game changer!! Especially with xodo PDF reader - it auto syncs annotations to the cloud.",
                      "author": "itsonlyliz",
                      "created": 1595276649,
                      "upvotes": 2,
                      "replies": {
                        "fyp15ls": {
                          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyp15ls/",
                          "text": "I used xoxo for a while and really liked it until I learned how versatile Adobe is.  I had some weird issues with xodo every once in a while though, can't remember what they were off the top of my head",
                          "author": "thecatofalamogordo",
                          "created": 1595276847,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fymv6s9": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymv6s9/",
          "text": "Are there particular types of tablet you can recommend? I'm thinking to get one for this reason but not sure what size screen to go for! I have dainty wrists but detailed diagrams to review",
          "author": "tieflingteeth",
          "created": 1595225839,
          "upvotes": 8,
          "replies": {
            "fyn0rcr": {
              "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyn0rcr/",
              "text": "I got a samsung S4 it is a a great tablet, I am so happy with it, I am also in STEM.\nYou can also take your notes in it, you will not need to carry papers or books anymore.",
              "author": "psupsuisafatkitty",
              "created": 1595231102,
              "upvotes": 7,
              "replies": {
                "fyo7lw5": {
                  "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyo7lw5/",
                  "text": "Thanks!",
                  "author": "tieflingteeth",
                  "created": 1595262521,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "fynv3hf": {
              "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynv3hf/",
              "text": "I can't really recommend specific tablets because I've only ever tried the one I have - you're honestly better off just googling it and getting reviews from people who've tried multiple.",
              "author": null,
              "created": 1595256123,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fynrq4k": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynrq4k/",
          "text": "It's a lot of extra money but I'm starting my PhD this year and am planning to print off most of my articles I need to read. I find it much easier to read, and can make notes on them too. From experience I tend to get through an article about twice as quick when I'm reading a printed and stapled piece rather than on a screen! Won't do it for all of them, though, because of the environment and all that (though the power consumption of a PC vs. paper used would be an interesting comparison in itself)",
          "author": "J-Fox-Writing",
          "created": 1595254252,
          "upvotes": 6,
          "replies": {
            "fyp1crm": {
              "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyp1crm/",
              "text": "I read off both paper and tablet as well.  Depends on what I'm reading and for what situation (my research, seminar, lit club, etc)",
              "author": "thecatofalamogordo",
              "created": 1595276946,
              "upvotes": 1,
              "replies": {}
            },
            "fyyagqy": {
              "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyyagqy/",
              "text": "Not sure about the environmental impact but I bought an $80 printer (that prints double sided) at the beginning of undergrad and it was probably one of the best investments I've made. \n\nI'm still slow either way but at least on paper I'm spacing and thinking about the reading instead of spacing and going on twitter.",
              "author": "ApartAssumption5",
              "created": 1595481499,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fymuvpo": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymuvpo/",
          "text": "Good for you!",
          "author": null,
          "created": 1595225564,
          "upvotes": 3,
          "replies": {}
        },
        "fynofoa": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynofoa/",
          "text": "What tablet do you recommend?",
          "author": "harper_kentucky",
          "created": 1595252300,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fymovgx": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymovgx/",
      "text": "I've completely pivoted my planned summer research agenda to work on COVID stuff and I'm over it. I'm definitely burned out. No tips for dealing with this. Just commiseration.",
      "author": "lh123456789",
      "created": 1595220608,
      "upvotes": 44,
      "replies": {
        "fyn0nqp": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyn0nqp/",
          "text": "I’m in public health too. Same sentiment.",
          "author": "tiensij",
          "created": 1595231001,
          "upvotes": 5,
          "replies": {
            "fyn1iy3": {
              "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyn1iy3/",
              "text": "Have you also written grant applications for COVID projects and thus are now going to be working on this for the foreseeable future even though you want to bail on the topic entirely? That's where I am today :)",
              "author": "lh123456789",
              "created": 1595231881,
              "upvotes": 18,
              "replies": {}
            }
          }
        }
      }
    },
    "fymt8gp": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymt8gp/",
      "text": "I find the days blur together sometimes.  I take random weekdays off sometimes.",
      "author": "dampew",
      "created": 1595224129,
      "upvotes": 41,
      "replies": {
        "fynmnyq": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynmnyq/",
          "text": "I used to call these “burn out Fridays.” Giving myself permission to take a random Friday off was always good for my morale",
          "author": "crimbuscarol",
          "created": 1595251157,
          "upvotes": 11,
          "replies": {}
        },
        "fyoegxe": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyoegxe/",
          "text": "I have been doing it with Mondays pretty often (am doing it right now in fact). If it feels like only half my effort and attention will be available for work, because the other half will be spent managing how much I don't want to do it, all day, why bother?\n\nI just do other stuff most of the day: chores, exercise, recreational reading, so I get the feeling of self-efficacy without the dread. Then Tuesday isn't a big deal.",
          "author": "epieee",
          "created": 1595265854,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "fymtgcs": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymtgcs/",
      "text": "Same here, my PI decided we should start writing a review paper since we can't physically be in lab so I feel like all I do nowadays is read on my laptop. It was starting to burn my eyes. idk if this is a stupid suggestion but I put my laptop on \"night mode\" to reduce the blue light emitting from the screen and now I don't have any problem whatsoever! I also try to get out into nature for at least 30mins everyday (just in my backyard) and not be around any electronics during that time. There are also glasses out there you can buy for super cheap to reduce blue light too",
      "author": "6sudha9",
      "created": 1595224319,
      "upvotes": 24,
      "replies": {
        "fyozl4j": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyozl4j/",
          "text": "I bought a pair of the blue light filtering glasses (€20-25) to wear during the most intense part of thesis writing last year. BUT I also bought lubricating eye drops and used them super often, which I cannot recommend enough. We tend to blink much less often while looking at screens than in other situations, and that can lead to dryness and eye fatigue too. This combination seemed to help a lot for me anyway. Good luck to you, and everyone else in this thread! Burnout is a real b\\*tch.",
          "author": "0hMyGardevoir",
          "created": 1595276078,
          "upvotes": 2,
          "replies": {
            "fyozvoh": {
              "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyozvoh/",
              "text": "Lubricating eye drops, that's genius! Thank you for the suggestion I'm gonna order some right now!!",
              "author": "6sudha9",
              "created": 1595276221,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fymrypv": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymrypv/",
      "text": "I started reading for fun in between my reading for research.",
      "author": "TheDevilsYouDont",
      "created": 1595223060,
      "upvotes": 21,
      "replies": {}
    },
    "fymvquw": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymvquw/",
      "text": "I'm having it as well. Working at home was okay for a few weeks, and then it's just been dragging on. I feel like I have no separation at all between my work and home, I feel isolated, and it's just difficult to stay motivated. \n\nMy supervisor is pretty cool at least. He said that this is understandable and that I shouldn't stress too much... well, I'm a grad student and I have funding for only a limited number of years, so telling me to not stress is not realistic, unfortunately. He has also told me to get outside as much as I can and enjoy the summer. I'm trying to do that, but I still feel stressed and burned out during this whole situation. I just want things to be normal again.",
      "author": "ThePurpleHyacinth",
      "created": 1595226338,
      "upvotes": 19,
      "replies": {}
    },
    "fymsdt2": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymsdt2/",
      "text": "studying clinical psych here and very much feeling this - you're not alone!",
      "author": "emcratic70",
      "created": 1595223409,
      "upvotes": 11,
      "replies": {}
    },
    "fyn229s": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyn229s/",
      "text": "Well, I came back from maternity leave right in the middle of the COVID madness and am just starting to write grants again. I’m more in the camp of “what does all of this mean? It’s clearly all meaningless” phase. I see from your flair you’re a Full! I’m a young one, entering year 3 of my TT. My journey is even longer since I accepted the tenure extension due to COVID.",
      "author": "tiensij",
      "created": 1595232435,
      "upvotes": 11,
      "replies": {}
    },
    "fyn1oaw": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyn1oaw/",
      "text": "I'm having issues as well. I'm also quite stressed because I have a temporary contract that has to be renewed by the end of this year and I feel like I haven't been quite able to fill up this position to justify the pay. My job (that I started at the beginning of the year) is partly administrative/managing and partly \"research\" which would be filled in by myself. However, as we locked down in March and only the most necessary experiments are continuing (e.g. for phd students who need to finish at some point) I haven't been able to set up anything so far. There's talk that with the new academic year there will be more options for working but I'm probably rather low on the priority list. But that means that I'm afraid that when it comes to the contract renewing, I have \"failed\" on the part of the research and that I have to reduce hours and continue with the administrative part (which isn't enough to fill a fulltime position).",
      "author": "alice_in_otherland",
      "created": 1595232034,
      "upvotes": 8,
      "replies": {}
    },
    "fyn1ut7": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyn1ut7/",
      "text": "Its a small thing but I highly recommend setting up a standing desk (or just putting your laptop/monitor on a shelf or some boxes so you're standing up). Somehow just the fact that I can pace in front of my screen, or generally move about more than in a chair, has made the days staring at a computer much more tolerable.",
      "author": "such_science_wow",
      "created": 1595232220,
      "upvotes": 9,
      "replies": {}
    },
    "fynpa88": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynpa88/",
      "text": "Research definitely feels disconnected from reality, so it’s hard to focus. I just used my vacation days to take the last two weeks off even though I can’t go anywhere— just let myself do nothing for a few days, then worked on housekeeping and exercise. I feel a lot more refreshed and ready to restart. If you can take a break, it will probably help with some of the exhaustion.",
      "author": "marbelousgeologist",
      "created": 1595252818,
      "upvotes": 7,
      "replies": {}
    },
    "fynei2r": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynei2r/",
      "text": "I've been feeling so incredibly low about this too, glad/sad to see so many others also struggling.",
      "author": "magpie2295",
      "created": 1595244980,
      "upvotes": 5,
      "replies": {}
    },
    "fynlx32": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynlx32/",
      "text": "I’m doing my first postdoc. And I have the same. \nWhat really helped me was to take a full week using my paid vacation days. Just no thinking about work for a while. \n\nIt was lack of productivity leading to feeling low which led to even lower productivity and a vicious cycle formed. Taking that break broke that cycle.",
      "author": "fiddler013",
      "created": 1595250666,
      "upvotes": 6,
      "replies": {}
    },
    "fyn777u": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyn777u/",
      "text": "Take regular screen breaks - real health and safety thing, not just when you're stressed, you can legit say to your class/meeting \"I have to turn off for a 2 minute screen break every 20 minutes to protect my eyes\"\n\nTry to do an outdoor hobby - depends on your living situation and local covid guidance, but just walking round the block is helpful. Make it a game to see how many neighbours front windows you can look in as you pass and see what their WFH setup is like, or judge their decor, or smile at their pets. Take up gardening - herbs are easy to grow, small, great for food and a useful covid anosmia test!\n\nDesign in and celebrate small wins - if your work has far away deadlines or you are stuck and making little progress, find a side project or online course that you can dedicate half an hour or an hour a day and make some definite useful measurable progress. I did a course on Coursera and it is broken down into lessons and weeks and tests, so you can clearly see your progress.\n\nEdit to add: I release just giving advice might come across as judgy, so I'll add that I totally have the same feeling, it is so hard right now! I hope you have some supportive friends and colleagues you can talk to. The above tips are what I have found helped me these past few months, you might be in a very different situation but I hope you find something here that helps. Be kind to yourself!",
      "author": "Astro_Biscuit",
      "created": 1595237798,
      "upvotes": 7,
      "replies": {
        "fyq2kem": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyq2kem/",
          "text": "I really appreciate your tips, and you didn't come across as judgy at all :)\n\nI really wish it weren't so hot where I am, not only is it making me lethargic but staying indoors all day because of the weather has been the worst part of quarantine by far. \n\nI think I'm going to have to create some deadlines for myself tbh. My work is mostly background research, so there aren't any deadlines nor is there really a sense of urgency, which makes it so hard to concentrate. If anyone has any tips on what kinds of deadlines are helpful to set in history projects (reading individual papers feel too small but I can't think of a bigger deadline that's not just like \"finish the project\"), would love to hear them!",
          "author": "ApartAssumption5",
          "created": 1595296810,
          "upvotes": 1,
          "replies": {
            "fyqwfva": {
              "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyqwfva/",
              "text": "I recently discovered a technique of using \"input goals\" instead of \"output goals\". So instead of your to do list saying \" read 1 paper\" or \"write a page of notes\" it would be \"spend 2 hours reading\" or \"spend 1 hour checking sources\" etc. \n\nI found that useful when the task was just to learn stuff rather than a measurable thing like a set homework assignment",
              "author": "Astro_Biscuit",
              "created": 1595319318,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fynr1hw": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynr1hw/",
      "text": "Molecular modeling / comp chem. I don't care about my PhD project but it is almost done. All I want to do is work on my covid project... Also blue light is evil for the eyes.",
      "author": "Molecular_model_guy",
      "created": 1595253855,
      "upvotes": 4,
      "replies": {}
    },
    "fynp4lw": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynp4lw/",
      "text": "Yeah, hard same. I jumped from the last year of my PhD to the first year of my postdoc on the same project, and now my boss is getting all non-student researchers to look for grant stuff. Even though I have obvious directions I can start taking the research in, I feel paralyzed by a weird feeling of dread. \n\nSo instead I decided to start auditing some coursera classes that are related to my subject, and that broke up some of the paralysis in my mind. I still am super unmotivated to do serious research, but I'm doing enough to keep my boss happy, so I guess that's okay for now.",
      "author": "pocket_world_atlas",
      "created": 1595252724,
      "upvotes": 3,
      "replies": {}
    },
    "fyoffk4": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyoffk4/",
      "text": "I know the feeling. I've always been a half hands-on, half staring-at-the-screen guy. I miss going to the lab, even if it means to sweep the floor or wash some glassware (I suppose I could do that at my house, but it's just different, you know). The quarantine has been hard. I've tried modifying my environment. I would connect my work laptop to my monitor, keyboard and mouse, and would stay like that for a few days, then disconnect and go to the sofa or bed, especially if I only had to read and take light notes. It kinda works, but is not as ergonomic, so I still need to get up and walk around the apartment.\n\nRecently I finished adjusting a paper the boss requested that came back from peer review. I was so fed up with it, I couldn't look at the screen any more. I took to reading a physical book (on statistics and design of experiment, light reading) as a form of \"healing\", and kept use of the notebook to a minimum. Hell, I even took up bookbinding, and made a \"perfect bound\" book that I wanted to read but didn't want to stare at the screen. I plan to do a \"deluxe\" edition of my thesis once I figure out the final kinks in the layout and imposition.\n\nWe are financed by an oil company. The project ends at the end of the year, and they said they expect the full results regardless of when we go back. Well, they're going to be sorely disappointed, but what can you do...",
      "author": "PraecorLoth970",
      "created": 1595266316,
      "upvotes": 3,
      "replies": {}
    },
    "fyn65qp": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyn65qp/",
      "text": "I don't have specific ideas for your \"staring at screens\" issue. I mean... what's different between home and office? What I've found helpful is to have at home an \"ergonomic\" \"office-like\" space. Sofa/table chairs are right out, they tire you. But I do understand (a lot) the motivation issues. Also I can't find the will to work 100% even now, let alone when we were lockdown. \n\nSo, I work in a country that has reopened quite a lot by now and also, I do research in a hospital so we were never really forced to stay at home by law, despite having the strongest lockdown in the world. \n\nSo... I restarted going to the lab ASAP when they reopened because, despite doing computer based research, which I can do 100% from home as effectively as in the office, not being able to interact in person with colleagues just kills you. How can you do research without sitting in front of a whiteboard and getting feedback on your ideas? Is it even theoretically possible?\n\nDuring the full lockdown my scientific productivity has been on a huge rollercoaster. First week: panic attacks, didn't know what to do. Second week till 10th week:  Super high productivity. I gave myself a rigid schedule from waking up to going to bed and I was either indoor training or working or cooking. Nothing else so that my mind could not get depressed by what was happening. No listening to news on the radio or reading newspapers after 10 a.m. 7/7, working like 13 hours a day. I've studied many new topics that I had left behind last year, produced a nice new work.  10th week till end of full lockdown: breakdown, couldn't do anything at all.\n\nRelease of lockdown till now... Despite going to the office 3 times per week, that helped me a lot mentally, I'm like at 50% productivity because I can't focus",
      "author": "lucaxx85",
      "created": 1595236713,
      "upvotes": 5,
      "replies": {}
    },
    "fymmp99": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymmp99/",
      "text": "[deleted]",
      "author": null,
      "created": 1595219000,
      "upvotes": 5,
      "replies": {
        "fymyoa2": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymyoa2/",
          "text": "In my experience, analogue is crucial for serious reading. Like, I skim *a lot* on my computer and even phone, but if I'm really going to engage I need a physical copy. Same thing for substantive edits to a completed draft of my own writing--I just have a hard time seeing it freshly on the screen. Good luck to you in your research ventures, and I hope you find a decent cheap printer!",
          "author": null,
          "created": 1595229053,
          "upvotes": 9,
          "replies": {}
        },
        "fyn7nn8": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyn7nn8/",
          "text": "I posted on our work message board asking if anyone lived near me has a printer and could print a couple of papers for me. If you live close to any colleagues maybe try asking? In this time more than ever people seem happy to help each other out.",
          "author": "Astro_Biscuit",
          "created": 1595238276,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fyo2uak": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyo2uak/",
      "text": "I'm a post-doc in the humanities. The most difficult part is not being able to consult research materials in archives or libraries. I can't do even the most basic stuff, like bibliographic research on a new project, because everything I need has been cleared out of the library, recall has been suspended, and ILL is also down. So if my institution doesn't have digital access to a book that's been checked out then I'm shit out of luck. As a post-doc I don't have the research budget to buy these materials for my personal library, which is what a lot of humanities faculty are doing.\n\nI'm clearing a back-log of projects that built up, but I can't actually do any new research since travel is restricted, archives are closed, and the library is overburdened. I'm basically branching out to other methods or trying to set up completely new lines of research using digital archives that I can access from home. Essentially, this is causing me to retool and that takes an enormous amount of time, effort, and frustration. It sucks.",
      "author": null,
      "created": 1595260163,
      "upvotes": 2,
      "replies": {}
    },
    "fyoix86": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyoix86/",
      "text": "Yeah, I feel this. I took 2 weeks off which was helpful. It allowed me to prioritize self-care and I feel more invigorated now.",
      "author": "justfreehouse",
      "created": 1595268002,
      "upvotes": 2,
      "replies": {}
    },
    "fyoqvlg": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyoqvlg/",
      "text": "Yes. I'm not in the humanities, but every time I sit down to work on a project, it just feels so stupid and inconsequential.",
      "author": "plentypk",
      "created": 1595271832,
      "upvotes": 2,
      "replies": {}
    },
    "fyoziu8": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyoziu8/",
      "text": "For me at least, it's easy to confuse lack of motivation with anxiety over everything right now. Tips?  Take a long break.  It will pay off.",
      "author": "scintor",
      "created": 1595276048,
      "upvotes": 2,
      "replies": {}
    },
    "fymsgmt": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymsgmt/",
      "text": "Lol - I suspect you don't have small children.  Honestly I haven't been able to get anything done. Between childcare,  online class prep and everything else, it's been hard to focus even if I can find an hour or two.",
      "author": "Readerokie",
      "created": 1595223475,
      "upvotes": 6,
      "replies": {
        "fyn7qbu": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyn7qbu/",
          "text": "It must be so hard to be a parent right now, I wish you the best of luck and I hope your employer has the human decency to be understanding about your workload",
          "author": "Astro_Biscuit",
          "created": 1595238355,
          "upvotes": 6,
          "replies": {}
        },
        "fynmyv4": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynmyv4/",
          "text": "I have two kids (one toddler, the other in elementary school) and it’s amazing I get anything done at all. I wish we could legitimately add “homeschool teacher” to our CVs!",
          "author": "konfusion987",
          "created": 1595251356,
          "upvotes": 6,
          "replies": {
            "fynqrbb": {
              "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fynqrbb/",
              "text": "I asked my dept chair \"which form i should have my kids fill out? the course eval or the mentor feedback one?\"",
              "author": "AKANotAValidUsername",
              "created": 1595253686,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "fymw682": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fymw682/",
          "text": "I was looking for a comment like this. Same here! I’ve done no research whatsoever since lockdown. Teaching, administrative BS and keep the kid alive is all I’ve been able to do.",
          "author": "drvinceknight",
          "created": 1595226731,
          "upvotes": 7,
          "replies": {}
        },
        "fyq4rlu": {
          "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyq4rlu/",
          "text": "Definitely do not have small children - I can't imagine how hard that must be. my problem is the opposite: I have unlimited time and still can't focus",
          "author": "ApartAssumption5",
          "created": 1595298103,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fyo94c0": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyo94c0/",
      "text": "I believe there are many who are in the same boat as you. My department had a discussion about this last week. \n\nRight now research really is just staring at a screen and many of us are not trained that way. \n\nI'm lucky that I have a printer in my office and a generous office supply budget, so I've been printing out articles I need to read. That helps me a bit.",
      "author": "GATX303",
      "created": 1595263258,
      "upvotes": 1,
      "replies": {}
    },
    "fyoax4f": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyoax4f/",
      "text": "**Definitely**. Unfortunately no tips as I haven't \"figured it out\" yet, but I can commiserate! \n\nI'm in Education, and after scrambling from March - June to support educators in their move to emergency online teaching, my entire lab was so burnt out that my supervisor closed us down for the summer (once our contracts ended). Luckily, that's meant dedicated time to work on my Master's thesis, however even after taking a week off at the beginning of July to transition, I'm still exhausted, unmotivated, and not making near enough progress. Bleh.",
      "author": "to_neverwhere",
      "created": 1595264128,
      "upvotes": 1,
      "replies": {}
    },
    "fyowtfb": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyowtfb/",
      "text": "Yes burned out for sure. With COVID I stopped doing my routine then when I went back to it I'm just like whats the point",
      "author": "IIIIllllllIIIll",
      "created": 1595274727,
      "upvotes": 1,
      "replies": {}
    },
    "fyoxoi4": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyoxoi4/",
      "text": "I'm supposed to defend my dissertation this week and one of my committee members has already emailed me a small bibliography he wants me to \"brush up on\" in preparation for a \"more productive conversation\" and I'm just....done. No tips, just commiserating.",
      "author": "DrArtyG",
      "created": 1595275146,
      "upvotes": 1,
      "replies": {}
    },
    "fyp3jnj": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyp3jnj/",
      "text": "Yes\n\nThere is nothing for me to do at home, basically. What I could submit I already did, and I need my lab to continue doing stuff. I have completely stopped everything and here we are not even close to begin openning thingd",
      "author": null,
      "created": 1595278032,
      "upvotes": 1,
      "replies": {}
    },
    "fyp3l11": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyp3l11/",
      "text": "Yes yes yes! Humanities here too. I've made slooooww progress the past few months but getting motivated and fending off distractions has become 2/3 of the job. Overall, I think I'm two or so months behind where I wanted to be. It sucks but I've also made peace with it. I think most people I know are in the same laggy / sluggish place.",
      "author": "SoulaBoula",
      "created": 1595278051,
      "upvotes": 1,
      "replies": {}
    },
    "fyvq599": {
      "link": "/r/AskAcademia/comments/hueqma/dealing_with_research_burnout_during_covid/fyvq599/",
      "text": "Something I'd recommend for times when you don't have any choice but to stare at a screen is to try things like Dark Mode viewing (I even write early drafts of my chapter like this--with a dark background and white text instead of vice versa). I've found that the white backgrounds that are the default for some of the online resources we use like articles and books are so glaring that it makes me burn out much more quickly and my eyes don't want to look at the screen even when I do want to do the work.",
      "author": "Biscuits_for_Dragons",
      "created": 1595432079,
      "upvotes": 1,
      "replies": {}
    }
  }
}