{
  "sid": "oiz8qu",
  "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/",
  "title:": "Advisor has taken two years to read my paper",
  "text": "Long story short, my advisor told me to work on a project, I worked on the project, finished it, wrote a paper, got other collaborators to contribute comments, but my advisor still has not read or commented on it in the past two years.  This is the only hurdle to submission.\n\nHe says he wants to do a really deep dive into the background literature first, as he claims he is very worried it will be submitted but a reviewer might claim the background is incomplete or the paper irrelevant.  I have told him that I am 100 times more concerned with being scooped than with a reviewer objecting, but he doesn't budge.\n\nThat would be fine if he \\*\\*were\\*\\* doing the background search, but he isn't.  He is instead working on other projects for other students, some of whom started later than me.\n\nWhenever I raise the issue, of when is he going to read my paper, he accuses me of being disrespectful, and implies we might not be working together in the future.\n\nI presented the research and preliminary results publicly three years ago, saying I'd have results out soon.  I did, but I haven't published them.  I have been turned down in grant proposals, the reviewer mentioning my lack of publication in the notes.  I have to every semester submit submit a progress report to the graduate chair to prove I'm not lazing around, and every semester write that I \\*\\*still\\*\\* haven't submitted the paper.  It's even hurting when I apply to jobs.\n\nIt's been two years, and it's beyond typical absent-minded professor stuff,  to  the level of being deliberately rude and insulting.\n\nWhat do I do?  Is there someone higher up in my university I can report this to, without reprisal?  I just want to publish, graduate, and get a job.\n\nWhat options do I have?\n\nPS. Field is physics, if that helps.",
  "author": "e_ikx",
  "created": 1626120408,
  "updated": 1634080400,
  "over_18": false,
  "upvotes": 267,
  "upvote_ratio": 1.0,
  "comments": {
    "h4ymm8w": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4ymm8w/",
      "text": "So sorry to hear this, how frustrating.\nHave you talked to your other committee members or the chair of your department about this? It could be beneficial to have them “on your side” or even have them address the issue with your advisor themselves since your individual efforts haven’t been successful…",
      "author": "nanaluvr",
      "created": 1626122321,
      "upvotes": 114,
      "replies": {
        "h4ypdnn": {
          "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4ypdnn/",
          "text": "Thanks, I have spoken to one member of my committee who is close to my advisor, and he promised to speak to my advisor about it.  But that was about three weeks ago, and I have not heard anything yet.  I may need to go to the graduate student chair.",
          "author": "e_ikx",
          "created": 1626123568,
          "upvotes": 77,
          "replies": {
            "h4znwdw": {
              "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4znwdw/",
              "text": "Yes you should go talk to the graduate student chair.",
              "author": "Lululalamom",
              "created": 1626141000,
              "upvotes": 30,
              "replies": {}
            }
          }
        }
      }
    },
    "h4yoxwu": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4yoxwu/",
      "text": "[deleted]",
      "author": null,
      "created": 1626123369,
      "upvotes": 79,
      "replies": {
        "h4yt01i": {
          "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4yt01i/",
          "text": "I want to second the suggestions here: be direct in 1) requesting a specific timeline and, 2) conveying how the lack of a publication record is affecting your ability to get grants, as well as your future job prospects. I imagine you've already been direct about wanting him to review the article, but if you haven't been direct about an explicit timeline, collaboratively establishing a deadline in particular may be helpful.\n\nBeyond that, though, there's really not much you can do. What your advisor is doing, while falling far short of good mentorship, is not against any rules.",
          "author": "jogam",
          "created": 1626125251,
          "upvotes": 22,
          "replies": {}
        }
      }
    },
    "h4yt7k3": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4yt7k3/",
      "text": "I had something similar happen -- wrote a paper, co-advisor kept saying it was great and he just needed to make the last 2% of edits... for years. Also gave a talk at a conference many years ago on this work. Unfortunately subsequent papers all explicitly built upon that first one, such that I couldn't really publish the later stuff without either gutting that first paper or else having some really awkward structure. So I kept postponing and postponing.\n\nEnded up getting scooped by a thousand spoons, new papers coming out over the years that steadily siphoned away my work's novelty. Then COVID hit and the co-advisor ghosted me lol. Ended up graduating without actually publishing anything (but 3-4 papers written). Doing a postdoc in a different field now and it's unclear if I'll ever return to that grad school work!",
      "author": "--MCMC--",
      "created": 1626125350,
      "upvotes": 47,
      "replies": {
        "h4z9mi1": {
          "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4z9mi1/",
          "text": "Omgod I’m so sorry to hear that. All i can say as a bystander it sounds like you are capable of excellent work, so I’m sure you’ll have many more publications in the future to make up for this crap. Hope your new field is much better.",
          "author": "dinopastasauce",
          "created": 1626133516,
          "upvotes": 20,
          "replies": {}
        },
        "h4zltvc": {
          "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4zltvc/",
          "text": "[deleted]",
          "author": null,
          "created": 1626139941,
          "upvotes": 1,
          "replies": {
            "h4zontk": {
              "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4zontk/",
              "text": ">Markov chain stuff\n\nMy god, I just read about this and now see it on Reddit. Strong Baader-Meinhoff phenomenon!",
              "author": "winlos",
              "created": 1626141392,
              "upvotes": 1,
              "replies": {
                "h50ev88": {
                  "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h50ev88/",
                  "text": "What happened?",
                  "author": "beautifulnaturekit",
                  "created": 1626158618,
                  "upvotes": 2,
                  "replies": {
                    "h53gp43": {
                      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h53gp43/",
                      "text": "Oh nothing. I am doing Marketing and Big Data for my PhD and read yesterday about using markov chain monte carlo algorithms for the first time. \n\nBaader-Meinhoff is when you learn about something for the first time and suddenly see it everywhere.",
                      "author": "winlos",
                      "created": 1626219656,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h4zok4b": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4zok4b/",
      "text": ">and implies we might not be working together in the future\n\nIs this a concern, because it doesn't really sound like you're working together *now*.",
      "author": "shellexyz",
      "created": 1626141341,
      "upvotes": 27,
      "replies": {}
    },
    "h4z4dzu": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4z4dzu/",
      "text": "I had a similar issue. I wrote a formal letter to my advisor stating the requested timeline and the relevant history of the project. I think the formality was helpful in that it was clear I'd ask for intervention from higher up, if needed, now supported by the letter, if changes weren't made.",
      "author": "UNC1112",
      "created": 1626130790,
      "upvotes": 14,
      "replies": {}
    },
    "h4yva6e": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4yva6e/",
      "text": "I don't understand what does it mean that the background is incomplete or the paper irrelevant. \n\nI face the same situations with advisors working on my papers for 2 years now, like the snails. One of the supervisors - the unresponsive one - just 2 years after waiting for him to do nothing said he is not going to be the corresponding author.!!!!!lol! The other, works on the paper like the snail with 3 experiments over 2 years!!!! In any case corona made things worse! \n\nYou have to do the background search! What does it mean background search? You cannot possibly have all literature in the paper, usually at a point we add reviews. \n\nMaybe you have to find other colleagues that will comment and help you on the paper. Is there anyone with expertise on this subject that is not a competitor and you can ask for help and comments? \n\nIf an advisor says he has to dive into the literature probably it is not in his field of expertise. Usually advisors know every single detail of a paper in their field ( and the stories etc) since the beginning of time. Probably he doesn't like to dive deep into this subject. \n\nLastly. there are persons that influence the advisors. Find who this person is and start crying to her/him so that he/she mediates so that the advisor pities you.",
      "author": "Sufficient_Current",
      "created": 1626126331,
      "upvotes": 6,
      "replies": {}
    },
    "h50cc7u": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h50cc7u/",
      "text": "Ask the collaborators CC'ing your advisor. Although if they found any problem they would have told you. If all collaborators agree, except for your advisor, submit it. Or if you want to be polite, tell him that all collaborators agreed it should/can be submitted and you went ahead. His name will be on the paper and his contribution acknowledged.\n\nThere are advisors who are comfortable in their tenure job, and do not realise other people need stuff out there to get on with their careers.",
      "author": "g33ksc13nt1st",
      "created": 1626156526,
      "upvotes": 3,
      "replies": {}
    },
    "h4yooqg": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4yooqg/",
      "text": "My advisor did this for a long time as well. Firstly, Arxiv is your friend and allows you to at least get the work out for others to see while you apply for other stuff. Secondly, depending on your committee's take on the matter, I'd just submit for review anyway without final approval. If the feedback comes back negative, just redo the background work and resubmit it to a different journal.",
      "author": "greengiant1298",
      "created": 1626123251,
      "upvotes": 36,
      "replies": {}
    },
    "h506017": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h506017/",
      "text": "So sorry.  My dissertation supervisor didn't get back to me about dissertation draft for 7 months.  İ emailed, showed up to his classes, etc etc etc.  Nothing. İ just wanted feedback or at least an acknowledgement that he was reading it. Finally İ told the grad chair the situation.  He got back to me the next day, was apologetic, and İ had defended within 2 months. \n\nSometime you gotta be a snitch.",
      "author": "MercutiaShiva",
      "created": 1626151750,
      "upvotes": 7,
      "replies": {}
    },
    "h4yuvx7": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4yuvx7/",
      "text": "That sucks. Are you working on any other papers? If it makes you feel better we just submitted a paper to a journal that I wrote 3 summers ago. Does your prof have a big name? Maybe he has bigger plans for you and you should just trust him? Also I think physics phds take a while no? Do you think that could be why he’s in no rush?",
      "author": "notjennyschecter",
      "created": 1626126143,
      "upvotes": 6,
      "replies": {
        "h4zklaz": {
          "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4zklaz/",
          "text": "That's a fair point. Program length depends on the subfield. In the US, 5 years is normal for some areas like theoretical particle physics, whereas as others may take 7 or 8 years, depending on availability of data or equipment and how long your advisor is trying to keep students for.\n\nRegardless, I can't think of any subfield where waiting on a completed paper for 2 years is even remotely acceptable. Even 18 months before this point would have been far too long. The advisor's concerns also aren't a very good reason to keep from submitting for so long. If that's a reviewer's feedback, that's a relatively minor change in my opinion, so let the reviewer day that. At worst, it calls for addressing and submitting elsewhere.",
          "author": "physicsknight",
          "created": 1626139299,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h4yoj7f": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4yoj7f/",
      "text": "I don’t know your field or level, and this might be a very unpopular opinion, but if I were in your shoes, I would just submit, get whatever feedback I could from reviewers, and pass it on to your advisor to then get their feedback. Explain at that point you’ve waited for two years but haven’t gotten anywhere and needed to finally take it into your own hands because you’re facing real issues from the delay. You may no longer have a collegial working environment and suffer consequences of no contact, no recommendations, no referrals, etc. later, but it sounds like you already have a shakey relationship and your advisor already isn’t in your corner. Don’t listen to an internet stranger though. Weigh your options. But it sounds like there isn’t much to lose here, at least in my own perspective.",
      "author": "biglybiglytremendous",
      "created": 1626123182,
      "upvotes": 16,
      "replies": {
        "h4yrgwc": {
          "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4yrgwc/",
          "text": "The professor would quite likely just retract the paper. And then throw the student out of the group. I've heard of such cases before where the student unilaterally submitted the paper without the advisor's consent.  It sucks, but that would be a likely scenario too.",
          "author": "dovaahkiin_snowwhite",
          "created": 1626124539,
          "upvotes": 39,
          "replies": {
            "h4z7myk": {
              "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4z7myk/",
              "text": "We had a postdoc try this in our lab, and it was a shitshow (the university had to get involved). The postdoc was accused of stealing because apparently the university owns the data you collect, not you, and any decision to publish must come from the PI.",
              "author": "PiousBlasphemer",
              "created": 1626132459,
              "upvotes": 13,
              "replies": {
                "h64e8kf": {
                  "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h64e8kf/",
                  "text": "I am about to enter a post doc, I’m in applied ML stuff, I am already anxious, as I can output high amount of medium impact papers, but all of them will need the PI consent? Holly crap",
                  "author": "quemacuenta",
                  "created": 1626958710,
                  "upvotes": 2,
                  "replies": {
                    "h6561gx": {
                      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h6561gx/",
                      "text": "As long as you used university property to generate the data, the data belongs to the university. This essentially means “everything” for wet lab projects, but for ML/CS it might be different? I just don’t know enough about the field..",
                      "author": "PiousBlasphemer",
                      "created": 1626971376,
                      "upvotes": 1,
                      "replies": {
                        "h65cuwy": {
                          "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h65cuwy/",
                          "text": "I am in medicine so the data is coming from the wet lab and the associated hospitals. So yeah, I Will need the consent",
                          "author": "quemacuenta",
                          "created": 1626974227,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "h4yznjc": {
          "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4yznjc/",
          "text": "> I would just submit\n\nThis is how to turn an unsatisfying start of an academic career into the end of an academic career.",
          "author": "Chemomechanics",
          "created": 1626128432,
          "upvotes": 23,
          "replies": {
            "h4z166f": {
              "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4z166f/",
              "text": "Perhaps. Perhaps not. When I originally read this, no indication of field was posted, and I commented based on my own experience in an entirely different field. I also wasn’t sure if the advisor’s name was attached to the project, hence my caution for various reasons. Academia is full of insufferable people, so you’re likely right, but some people like a battle now and again to keep things interesting.",
              "author": "biglybiglytremendous",
              "created": 1626129176,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h512mmq": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h512mmq/",
      "text": "Get your committee to tie him up Clock Work Orangy style and force him to read it. (I actually agree with the other comments of setting in stone deadlines to make them more responsible)",
      "author": "GoldenStallions",
      "created": 1626179207,
      "upvotes": 1,
      "replies": {}
    },
    "h50vctn": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h50vctn/",
      "text": "Are you in the US ?",
      "author": "Computer_says_nooo",
      "created": 1626173900,
      "upvotes": 1,
      "replies": {}
    },
    "h50plyn": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h50plyn/",
      "text": "I’m also in physics and this is beyond absurd. I’ve never heard of something like this happening in the hard sciences. Your department’s grad coordinator needs to hear about this. Perhaps a transfer to a new supervisor is in order.",
      "author": "Kvothealar",
      "created": 1626168676,
      "upvotes": 1,
      "replies": {}
    },
    "h504pji": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h504pji/",
      "text": "Fuck him, submit the paper. List yourself or whomever else you collaborated with. If he's got an issue with it you have two years of emails to show him sitting on his hands.",
      "author": "CavalierEternals",
      "created": 1626150849,
      "upvotes": 1,
      "replies": {}
    },
    "h51w5q9": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h51w5q9/",
      "text": "At the speed of university! Now, your PI is a POS. But you allowed this to fester for 2 years. So it's on you, too, for letting this drag on so long. Give your PI a very clear deadline: you've got 2 weeks to get back to me, if not, I'll submit as is. Not a timeline but a *deadline*  \nedit: this guy / gal is so friggin lazy I wouldn't worry about repercussions. Also you can explain what happened here to prospective future employers and that this is why you don't have a letter of recommendation.",
      "author": "tryatriassic",
      "created": 1626193633,
      "upvotes": 0,
      "replies": {}
    },
    "h4zi66o": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4zi66o/",
      "text": "Put it on Arvix.",
      "author": "InsufficientDrama",
      "created": 1626138025,
      "upvotes": 0,
      "replies": {
        "h4zk4k6": {
          "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4zk4k6/",
          "text": "The problem with putting it on arxiv is that in my field arxiv is considered almost equivalent to publishing.  So it'd be roughly the same as just submitting to a journal without approval.",
          "author": "e_ikx",
          "created": 1626139057,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "h4ythmc": {
      "link": "/r/AskAcademia/comments/oiz8qu/advisor_has_taken_two_years_to_read_my_paper/h4ythmc/",
      "text": "We have crummy Prof advisors at my most recent University. If he implies he won't b working w.u in the future I'm pointing out 2 U that he hasn't  been working w. U now or in the past. I know about fallout but isn't there another advisor u can switch 2 (discretely)",
      "author": "MarisaWalker",
      "created": 1626125479,
      "upvotes": -5,
      "replies": {}
    }
  }
}