{
  "sid": "po47cf",
  "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/",
  "title:": "How to deal with an advisor who changes the goalposts?",
  "text": "I am  a chemistry PhD student and I am planning to graduate in December. Months ago my advisor and I sat down and went through all of the milestones he would like me to achieve before writing my thesis. Chief among these was completing a little project to be written up as a communication. The synthesis took a little longer than expected and the project completion got pushed back by about a month but I had everything I needed for the communication. Then a week back he informs me that we are going to be submitting this as a full paper, and here are all of the other experiments that will need to be done. I confronted him on this saying that we had agreed to submit a communication (for which the data is compiled and ready to go), he said \"I know it's hard, quit whining.\" \n\nI have carved out a niche for myself in this lab and made myself highly specialised with respect to what the lab traditionally does. This will be my 7th publication in 4.5 years (5th first author). Haven't I done enough to deserve this degree?  I feel that my PI, fearing the loss of my expertise (there are only 2 other members of our group, I am senior most)  is trying to squeeze any amount of productivity out of me that he can. Essentially I am feeling used and under valued for my labor. Any suggestions for coping and/ or retaining my dignity? \n\nHappy to provide more details in the comments",
  "author": "I_neh",
  "created": 1631630750,
  "updated": 1634078988,
  "over_18": false,
  "upvotes": 68,
  "upvote_ratio": 0.96,
  "comments": {
    "hcujwxb": {
      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcujwxb/",
      "text": "Oh my god this was essentially my situation last year. Small lab, I had been there the longest and had the most accumulated technical expertise, published way more than enough for my degree and my PI wanted me to stay to elongate a small basically completed project into something bigger at my personal expense. The similarities go on. \n\nI went to my committee. Had casual conversations with each of them as well as a conversation with my program director and let them know that my PI was changing the goalposts but I planned to graduate ON TIME and that I had begun discussing postdoctoral fellowship options with potential mentors who had made me offers. I kept the language very nonconfrontational and said something along the lines of \"it's great that PI sees so much potential into what started as a communications level project, but I'm going to make sure (other lab member) is properly trained to carry out the rest of PI's vision if he still wants to work on this after I leave.\" \n\nThat next committee meeting I didn't even have to lobby for myself because my entire committee was asking why I was still there in front of my PI and asking me about next steps/career goals/etc. Then they pushed the message in the closed door part for me. Your committee is there to help you, if you can trust them to.",
      "author": "wild_zebra",
      "created": 1631642653,
      "upvotes": 51,
      "replies": {
        "hcuq3hh": {
          "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcuq3hh/",
          "text": "Congrats for having really nice committee. I am proud of them, and you for doing a good nice job.\n\nHowever, this depends on very different environment. In some scenario the advisor holds a good position and ranking, and no one is going to do it for the PhD student. \n\nThere were two also got this situation, one get the defense by spreading the rumor of \"suspisious action of hurting\", another got defense simply because of another high ranking prof. asked about \"why this guy is still here?\" None of them was supported by the Committee. Therefore it's not easy for everyone. \n\n One unlucky story on Reddit is that this PhD was kicked out by the whole research group.",
          "author": "Metalpen22",
          "created": 1631645106,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "hcu44l5": {
      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcu44l5/",
      "text": ">\"I know it's hard, quit whining\"\n\nMan that's disrespectful.\n\nIf it was me, I'd stick to my guns and submit it as a communications. You already have 7 papers - I imagine you already have what you need to write up your sandwich thesis and defend. You don't need this paper.\n\nYour advisor is being unreasonable and going back on their word. This is not OK. Do not teach them that this is OK, unless you feel like your advisor is the kind of vindictive prick who would use it to delay your graduation.",
      "author": "ThePhysicistIsIn",
      "created": 1631636329,
      "upvotes": 32,
      "replies": {
        "hcu6xlk": {
          "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcu6xlk/",
          "text": "He is petty and he knows he has got me by the balls. It's just awful coming to terms with the power differential between a graduate student and a PI.  It's not normal or ethical and I hope I don't end up in an environment like this when I am out in industry. \n\nHe would definitely try to trip me up and not let me graduate on time. I need to get out of this program for the sake of my mental health so a delayed graduation is not an option for me.\n\nAlso thank you for being validating. This whole experience has warped my psyche. Sometimes it is hard to tell if I am being mistreated or just being soft.",
          "author": "I_neh",
          "created": 1631637446,
          "upvotes": 17,
          "replies": {
            "hcuba3k": {
              "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcuba3k/",
              "text": "No, you're being mistreated. He had agreed to a timetable and is going back on it. \"I have altered the terms of the deal, pray I don't alter them further.\"\n\nI guess there's not much choice but to go forward with it. I like the other suggestion where you graduate on time and stay on longer to finish that paper. Once you have your PhD in hand, your situation improves.\n\nYou know what helped me graduate on time? Having a job offer in hand. How hostile would your PI become once you have a postdoc offer in hand with a set start date?",
              "author": "ThePhysicistIsIn",
              "created": 1631639191,
              "upvotes": 16,
              "replies": {}
            },
            "hcuuknr": {
              "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcuuknr/",
              "text": "Do you have a thesis committee? I can PM about this but I was having issues with my advisor and they helped get me back on track and were on my side. Your thesis committee might commit to a date to defend, so your PI can't delay you any further.",
              "author": "scienceislice",
              "created": 1631646870,
              "upvotes": 7,
              "replies": {}
            },
            "hcuhsip": {
              "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcuhsip/",
              "text": "> he knows he has got me by the balls\n\nNo he doesn't. You really need to understand that *you have tremendous value to him*. He needs you more than you need him. Tell him no. 7 papers is a lot, you've produced way more than your fair share.",
              "author": "tryatriassic",
              "created": 1631641782,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "hcutmwq": {
          "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcutmwq/",
          "text": ">\tIf it was me, I’d stick to my guns and submit it as a communications.\n\n\nI was ready to suggest this if they’re feeling bold enough, but that clause about needing all authors to approve the submission could potentially cause problems. \n\nTbh I think approaching the graduate school Dean would be fair game if this holds up graduation.",
          "author": "tamelotus",
          "created": 1631646495,
          "upvotes": 3,
          "replies": {
            "hcux2gs": {
              "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcux2gs/",
              "text": "Yeah unfortunately it's hard to go Nuclear on this kind of stuff.",
              "author": "ThePhysicistIsIn",
              "created": 1631647857,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hcttb5o": {
      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcttb5o/",
      "text": "I think a good compromise would be for you to graduate in December as planned but stay on for a short postdoc (with the associated salary bump) to finish the project.  Assuming you don't have something else lined up with a conflicting start date.",
      "author": "benjamindallen",
      "created": 1631631954,
      "upvotes": 15,
      "replies": {
        "hctz3jt": {
          "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hctz3jt/",
          "text": "I have asked if we could do that. He says he would like to have me as a post-doc but is not willing to up my salary.",
          "author": "I_neh",
          "created": 1631634316,
          "upvotes": 18,
          "replies": {
            "hcu16m1": {
              "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcu16m1/",
              "text": "Ok that’s...not promising. This is tricky because your advisor is being somewhat unreasonable but you still need to maintain a good relationship for your career. Do you have a good relationship with another member of your committee who could help advocate for you?",
              "author": "benjamindallen",
              "created": 1631635150,
              "upvotes": 13,
              "replies": {
                "hcu70lm": {
                  "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcu70lm/",
                  "text": "That's what sucks. I feel like I cannot really advocate for myself fully because he is the gatekeeper to my PhD.",
                  "author": "I_neh",
                  "created": 1631637480,
                  "upvotes": 9,
                  "replies": {
                    "hcu8fi9": {
                      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcu8fi9/",
                      "text": "That’s exactly right, the power dynamic is such that you really need someone else to advocate on your behalf, unfortunately. If you trust the director of your grad program or the ombudsman of your department/college, one of those might be another possible advocate.",
                      "author": "benjamindallen",
                      "created": 1631638052,
                      "upvotes": 6,
                      "replies": {}
                    },
                    "hd2jvav": {
                      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hd2jvav/",
                      "text": "I will suggest you should get the deal of post doc and finish your phd asap, and then you start to find job without his/her/its letter of recommendation.",
                      "author": "Metalpen22",
                      "created": 1631795218,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "hcuifo8": {
                  "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcuifo8/",
                  "text": "> you still need to maintain a good relationship for your career\n\nNo you don't. My former prof tried to keep us all hostage by threatening not to give a good letter of recommendation unless ...  \n\nGuess what, we all got out, all got good jobs, all without a letter from him. You can explain what happened, and provide other references.",
                  "author": "tryatriassic",
                  "created": 1631642043,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "hcui5s2": {
              "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcui5s2/",
              "text": "> he would like to have me as a post-doc but is not willing to up my salary.\n\nStop all work. You're as productive as a good postdoc, but he doesn't want to pay for that. DON'T LET HIM GET AWAY WITH THIS.   \n\nTime to put your dick on the table. I know this is incredibly hard, but you need to stop kowtowing and say NO MORE.",
              "author": "tryatriassic",
              "created": 1631641932,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "hcuh6qb": {
      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcuh6qb/",
      "text": "He has spent years training you and doesn't want to let you go. I have seen this happen before. Stand up for yourself if you really feel you are right. Also talk to your committee.",
      "author": "BronzeSpoon89",
      "created": 1631641543,
      "upvotes": 5,
      "replies": {}
    },
    "hcvjq7m": {
      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcvjq7m/",
      "text": "Here is a political option: talk to one of the other two students, and convince them to finish the project for you after you leave and you'd make them a co-first author. This way, your PI will have his paper, he'll think he has continuity in his lab (as the next generation will now have your skills) and then you are now seen as an excellent mentor.",
      "author": "heliumagency",
      "created": 1631657089,
      "upvotes": 5,
      "replies": {}
    },
    "hcuhi3w": {
      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcuhi3w/",
      "text": "This is what the committee is for in the USA. At my Uni, you'd need a majority of the committee to sign off on the dissertation. Meaning if your prof tried to hold you captive you can graduate without his consent. Not a great solution, but if you won't get a LOR from him you can explain the situation to prospective employers, they'll almost always understand.   \n\nAs for now, I'd recommend just saying no. It's a bitch and will cause a lot of friction but if you make clear he ain't getting no more slave labor out of you, and that's that, no negotiations, he has no choice.   \n\nAlso, as always, fuck academia.",
      "author": "tryatriassic",
      "created": 1631641668,
      "upvotes": 10,
      "replies": {}
    },
    "hcudlwz": {
      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcudlwz/",
      "text": "> \"I know it's hard, quit whining.\" \n\nSounds like he tried to exit the conversation by saying something deeply inappropriate. You are free to open the conversation again and come back to your previous agreement. Be assertive. If necessary, repeat the same single point over and over, like a vinyl record player that is caught in a loop, until he gets tired with it and eventually gives in. Good luck!",
      "author": "ColourlessGreenIdeas",
      "created": 1631640127,
      "upvotes": 4,
      "replies": {}
    },
    "hcuhm1f": {
      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcuhm1f/",
      "text": "This is a situation where you definitely need to talk to someone you trust from your committee, or the graduate student coordinator from the University. Or if you have a co-supervisor of course speak to them in the first instance. It would be very challenging for your supervisor to argue to your committee that you didn't have enough to graduate with 5 first author papers.",
      "author": "The-very-naughtyduck",
      "created": 1631641712,
      "upvotes": 2,
      "replies": {}
    },
    "hcuxci9": {
      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcuxci9/",
      "text": "\\>Months ago my advisor and I sat down and went through all of the milestones he would like me to achieve before writing my thesis.\n\nDoes your department require any type of paperwork or formal plan that outlines what's required to graduate? I graduated in English, so a totally different field, but there should be some type of documentation that explains the expectations and requirements, precisely to prevent situations like this.",
      "author": "sheath2",
      "created": 1631647969,
      "upvotes": 1,
      "replies": {
        "hcuznqu": {
          "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcuznqu/",
          "text": "There are requirements as far as credits but the degree is much more subjective. It's determined by the opinion of the committee as to whether or not you were productive enough.",
          "author": "I_neh",
          "created": 1631648879,
          "upvotes": 1,
          "replies": {
            "hcvaqmn": {
              "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcvaqmn/",
              "text": "Are there guidelines from your department about the level of research required for the thesis? My department has explicitly prepared for your kind of situation. There's a line in the graduate student handbook that says \"A student may choose to go above and beyond what is required for an acceptable thesis, especially if they intend to pursue a career in Academia. However, this choice rests with the student, not the supervisor.\" Basically this is a contingency to protect students from overly demanding or manipulative PIs.  \n\n\nIf you can trust your committee, I would explain your situation to them. They might be able to keep your PI in check.",
              "author": "CootaCoo",
              "created": 1631653279,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hcwljbm": {
      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcwljbm/",
      "text": "I was in a somewhat similar situation. I would definitely recommend talking with your committee members and possibly department head. I'm using American academic language; I hope that wherever you are, the job titles are understandable. I also really like the political answer, but your timeline seems short for that if your knowledge is very specialized. \n\nIn case my situation is somewhat helpful, my PI suddenly passed away the year I was graduating but before my defense was solidified. Her lab had continued money because of a multilab grant. For the next half a year a was stuck in some strange power grabs with one powerful professor demanding to be advisor/chair of my committee even though his work was really not relevant, a research assistant professor (not tenure track) who kept trying to manipulate me into naming her as my advisor (even going to far as to try to get me to sign fake paperwork implying that I meant for her to advise me), and both of them trying to both convince me not to talk to the rest of my committee and to stay for 1.5 more years even though I'd been there for over 5 years and had met all requirements.\n\nIn retrospect, it would have helped me tremendously to have someone tell me to talk with my department head earlier. Both that and one of my committee members who went to bat for me (at considerable risk to her career) got me out of there.\n\nSorry this is happening. The political maneuverings of academia make things more difficult in an already stressful time.",
      "author": "JealousBenefit8167",
      "created": 1631674593,
      "upvotes": 1,
      "replies": {}
    },
    "hcwl4vz": {
      "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcwl4vz/",
      "text": "[removed]",
      "author": null,
      "created": 1631674389,
      "upvotes": -2,
      "replies": {
        "hcx9fq3": {
          "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcx9fq3/",
          "text": "\n>By the way, the “changing goal post” scenario is super common. \n\nThat doesn't mean that it's ok - it's clearly unprofessional. In the four departments I've seen it's also not common.",
          "author": "ColourlessGreenIdeas",
          "created": 1631689720,
          "upvotes": 1,
          "replies": {}
        },
        "hcy2k8m": {
          "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcy2k8m/",
          "text": "My advisor can suck my balls.",
          "author": "I_neh",
          "created": 1631711394,
          "upvotes": 1,
          "replies": {
            "hcygsot": {
              "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcygsot/",
              "text": "[removed]",
              "author": null,
              "created": 1631717823,
              "upvotes": 0,
              "replies": {
                "hcypkn5": {
                  "link": "/r/AskAcademia/comments/po47cf/how_to_deal_with_an_advisor_who_changes_the/hcypkn5/",
                  "text": "He",
                  "author": "I_neh",
                  "created": 1631721474,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}