{
  "sid": "rinng3",
  "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/",
  "title:": "Second Round TT-job Interviews (Campus Visits) for 2021-2: In-person or Online?",
  "text": "Hello everyone on the job market or in search committees. Have you seen any hints of whether the campus visits for this cycle are going to be in-person or online? I'm looking at jobs in the US and am trying to figure out how I should best arrange my schedule in case these are still going to be in person and involve the hassles of travel. Thanks!",
  "author": "SisuSushi",
  "created": 1639765753,
  "updated": 1639787246,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.74,
  "comments": {
    "hoy7eji": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoy7eji/",
      "text": "In my discipline, the first 20 candidates who are finalists are all zoom. The fly out finalists, which are typically between two and five candidates, are all going to be in person.",
      "author": "EconomistPunter",
      "created": 1639765858,
      "upvotes": 7,
      "replies": {}
    },
    "hoy8fq1": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoy8fq1/",
      "text": "No idea. I am chairing a committee that is doing the first round of interviews via Zoom this week. We would prefer to do the final interviews in person, but given the new variant, are not sure that is a good idea. Either way we decide, we will have to do all the interviews in the same format (in-person or online). I am interested to know how others are thinking about this.",
      "author": "YuritheDestroyer",
      "created": 1639766250,
      "upvotes": 5,
      "replies": {
        "hoyhfuq": {
          "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoyhfuq/",
          "text": "Having the same format for all candidates sounds like it would be more fair. At the end of the day no one really wants to be on a long zoom call, and I feel this would put the candidates interviewing remotely at a disadvantage.",
          "author": "SisuSushi",
          "created": 1639769733,
          "upvotes": 1,
          "replies": {
            "hoykz62": {
              "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoykz62/",
              "text": ">Having the same format for all candidates sounds like it would be more fair. \n\nThat is required by our HR policies and I agree re: fairness. Anyone who zooms in while others are in person will be at a significant disadvantage IMO.",
              "author": "SnowblindAlbino",
              "created": 1639771141,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hoyhhvp": {
          "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoyhhvp/",
          "text": "Same format for everyone seems fair.",
          "author": "dsilesius",
          "created": 1639769755,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hoy8ofb": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoy8ofb/",
      "text": "First round of interviews (semi-Finalists) were all done via Zoom. \n\nFinalists (four of them) are all being brought to campus for in-person interviews. \n\n(This is my 10th hiring committee, and I *massively* prefer in-person to Zoom interviews...  Zoom is it's own skill, and not necessarily related to other more crucial skills/attributes, like classroom presence or collegiality.)",
      "author": "professorburner",
      "created": 1639766341,
      "upvotes": 4,
      "replies": {
        "hoymdyk": {
          "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoymdyk/",
          "text": "We did phone interviews for the prelims from the 1990s into the mid-2000s, then moved to skype. Then to zoom. I really hated Skype, as we often had technical issues-- usually with the candidate's lack of bandwidth --that really made it less useful than a phone call. But zoom has worked well in more recent searches. I think it's fine for the first round, which for us is usually 10-12 candidates who get cut to a short list of five.\n\nThe final interviews really must be on campus though...ours are usually two nights/two full days and there's really no way a zoom would replace the experience of being on campus, getting tours of facilities, meeting various groups, meeting with students, etc.  We pretty much stopped hiring during the lockdown in 2020 but returned (cautiously) to in-person interviews for finalists last year and it worked fine. That said, with the latest variant causing concern I don't know what will happen this winter-- but so far this fall finalists have been on campus for all searches.",
          "author": "SnowblindAlbino",
          "created": 1639771712,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoy7c9u": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoy7c9u/",
      "text": "We're doing them in-person or virtual based on what the candidate prefers.",
      "author": "CerebralBypass",
      "created": 1639765835,
      "upvotes": 2,
      "replies": {}
    },
    "hoyb82y": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoyb82y/",
      "text": "My university has a preference for in-person flyouts, but we will ultimately leave it up to the candidate because some may be located in countries where traveling to the U.S. is not feasible.",
      "author": "variablyinstrumental",
      "created": 1639767312,
      "upvotes": 2,
      "replies": {}
    },
    "hoybdvs": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoybdvs/",
      "text": "We've opened up out-of-state travel this semester and I'm seeing a mix of on-campus and Zoom interviews for positions. University sponsored international travel is still suspended, though, so it'd be online for those folks I suspect.",
      "author": "Gremdelion",
      "created": 1639767375,
      "upvotes": 2,
      "replies": {}
    },
    "hoy8rqy": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoy8rqy/",
      "text": "I had a modified in-person interview.  It was early enough in the season that some meetings could be done outside.  Teaching demo was masked.  I was not comfortable eating in a restaurant (interview was in a US state with a low vax rate) so we skipped most \"group\" meals which is usually part of the process. The school was very willing to work with me and my risk preferences in setting things up, and I was very much appreciative of that.",
      "author": "winterneuro",
      "created": 1639766377,
      "upvotes": 1,
      "replies": {}
    },
    "hoy9v25": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoy9v25/",
      "text": "I believe it is up to the committee, but most so far seem to be in person.",
      "author": "pipkin42",
      "created": 1639766793,
      "upvotes": 1,
      "replies": {}
    },
    "hoyaeww": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoyaeww/",
      "text": "We are running ours all online for now.\n\nedit: Lol at the down vote",
      "author": "AerosolHubris",
      "created": 1639767002,
      "upvotes": 1,
      "replies": {}
    },
    "hoyhzx5": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoyhzx5/",
      "text": "All in Zoom.......even the 3 finalists!",
      "author": "ehossain",
      "created": 1639769953,
      "upvotes": 1,
      "replies": {}
    },
    "hoyzwrh": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoyzwrh/",
      "text": "So far I’ve noticed that first rounds have all been zoom and final rounds have been mixed with a preference for in-person.",
      "author": "Cicero314",
      "created": 1639777173,
      "upvotes": 1,
      "replies": {}
    },
    "hoz4yyq": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoz4yyq/",
      "text": "I was on the TT market last year and now on the other end (on a search committee) this year. When I was on the market, all my final round interviews were entirely online. It looks like we are offering flexibility but trending toward online for the campus visit. I've heard from colleagues on the market that things are trending toward online with significant (though not majority) in-person. A decent amount of places seem to be offering the choice to candidates.",
      "author": "TheWaysInWhich",
      "created": 1639779250,
      "upvotes": 1,
      "replies": {}
    },
    "hoz6qpp": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoz6qpp/",
      "text": "We just did in person finalist interviews on our campus.",
      "author": "Ruby_Ruth",
      "created": 1639779991,
      "upvotes": 1,
      "replies": {}
    },
    "hoyksqu": {
      "link": "/r/AskAcademia/comments/rinng3/second_round_ttjob_interviews_campus_visits_for/hoyksqu/",
      "text": "It's going to vary by campus, geography, COVID situation, and possibly even by search committee. On my campus we continue to bring finalists (three) to campus for in-person interviews. At the other school across town they have been 100% zoom for the last 18 months.  There's no way I think you can generalize on this-- you'll have to ask the specific search committee chair or wait to get an invite unless there is something in the job posting.",
      "author": "SnowblindAlbino",
      "created": 1639771070,
      "upvotes": 0,
      "replies": {}
    }
  }
}