{
  "sid": "pj9qbq",
  "link": "/r/AskAcademia/comments/pj9qbq/what_is_the_covid_status_at_your_uni/",
  "title:": "What is the covid status at your uni?",
  "text": "My Uni has been closed to students for the duration of the pandemic and I had to start my PhD remotely.\n\nThey've just announced that I'll be spending the entity of my second year at home once again because post graduate students aren't a priority (their words). \n\nSuffice it to say I'm feeling really burnt out and sad because I've had to work in a vacuum entirely withkut the support of my faculty. \n\nWhat's more is that the neighbouring university said that it's PhD students can return (my friend studies there and told me), leaving me even further distraught.\n\nIn considering discussing this with my supervisor",
  "author": "Weekend_metalhead",
  "created": 1630966158,
  "updated": 1634079372,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.9,
  "comments": {
    "hbvxs75": {
      "link": "/r/AskAcademia/comments/pj9qbq/what_is_the_covid_status_at_your_uni/hbvxs75/",
      "text": "Our university is pretty much back to normal despite having the highest peak of covid cases since the pandemic began... Lab work and graduate students returned to the lab after only about 5-6 months since the beginning. For grad students course work was online for the first year but it's all back to in person meetings... Vaccines required though.",
      "author": "ActionXPotential",
      "created": 1630983441,
      "upvotes": 5,
      "replies": {}
    },
    "hbvg07g": {
      "link": "/r/AskAcademia/comments/pj9qbq/what_is_the_covid_status_at_your_uni/hbvg07g/",
      "text": "We're fully open with in-person classes, social events, indoor gatherings, etc. Faculty, staff, and grad students who can do their (non-teaching) work remotely are allowed to continue doing so, but no one is being forced to stay off campus en masse. There may be some labs that have worked out lab schedules so only a portion of the group are in on any given day.\n\nWe're accomplishing this through mandatory vaccination, a strict indoor mask mandate, *and* monthly testing at campus health required for students, faculty, and staff who are coming to campus. People with a medical or religious exemption have to do weekly testing and have to fill out a daily symptom screening. There is also additional mandatory testing for any student identified as exposed to a COVID case on campus.",
      "author": "MidnightSlinks",
      "created": 1630974593,
      "upvotes": 3,
      "replies": {}
    },
    "hbvqv5d": {
      "link": "/r/AskAcademia/comments/pj9qbq/what_is_the_covid_status_at_your_uni/hbvqv5d/",
      "text": "Small classes are fully open. Larger classes seem to be online only. Voluntary gatherings like clubs and events are allowed only with the vaccine passport. They are really encouraging people to get vaccinated, although I think they should require vaccination.",
      "author": "OvulatingScrotum",
      "created": 1630979923,
      "upvotes": 2,
      "replies": {}
    },
    "hbvs5lm": {
      "link": "/r/AskAcademia/comments/pj9qbq/what_is_the_covid_status_at_your_uni/hbvs5lm/",
      "text": "Only activities that cannot be held online (labs, practical classes etc.) are happening on campus. Everything else is being held online. [I'm in Brazil.]",
      "author": "DrKratylos",
      "created": 1630980567,
      "upvotes": 1,
      "replies": {}
    },
    "hbwz6n6": {
      "link": "/r/AskAcademia/comments/pj9qbq/what_is_the_covid_status_at_your_uni/hbwz6n6/",
      "text": "We're in a conservative state in the US. Our 29-institution university system declared that all colleges and universities were going to be open and operating classes this fall as they did in Fall, 2019. So, no additional online classes and so on. Each campus can decide whether people need to be masked and almost all have required it. We can't require vaccinations but can require regular testing if not vaccinated. I have no idea how each college/university monitors that since we didn't have to show vaccination cards but rather simply declared whether we're vaccinated or not.",
      "author": "rockyfaceprof",
      "created": 1631010752,
      "upvotes": 1,
      "replies": {}
    },
    "hbx6xav": {
      "link": "/r/AskAcademia/comments/pj9qbq/what_is_the_covid_status_at_your_uni/hbx6xav/",
      "text": "Sydney, Australia. We're totally online :/ It's understandable but yeah it sucks.",
      "author": "HappyAkratic",
      "created": 1631016243,
      "upvotes": 1,
      "replies": {}
    },
    "hbx8alw": {
      "link": "/r/AskAcademia/comments/pj9qbq/what_is_the_covid_status_at_your_uni/hbx8alw/",
      "text": "We've been in the lab essentially full time since June last year. The university deemed us essential (but not worth the essential pay boost!) so we don't really have much choice in the matter",
      "author": "TheScienceMothra",
      "created": 1631017091,
      "upvotes": 1,
      "replies": {}
    },
    "hbx9uty": {
      "link": "/r/AskAcademia/comments/pj9qbq/what_is_the_covid_status_at_your_uni/hbx9uty/",
      "text": "In my country researchers (including PhD students) have been allowed to go back since september 2020, provided some justification, no full time etc... Even when lockdowns were reimposed.\n\nAfter vaccination it's basically a \"do whatever you want\".  After Easter they even allowed students to come back (max 50% attendance) because it's not like you can learn remotely. And labs 100% (provided distancing rules etc...).\n\nIn my specific case... I'm in a (university) hospital therefore we can skip all lockdown regulations when they're imposed! It has been so freaking fundamental for my mental health. Chatting with colleagues, going to lunch together etc...\n\nBeing prevented from coming back now that we're all vaccinated... MAkes no freaking sense whatsoever. Do complain.",
      "author": "lucaxx85",
      "created": 1631018016,
      "upvotes": 1,
      "replies": {}
    },
    "hbxoaz4": {
      "link": "/r/AskAcademia/comments/pj9qbq/what_is_the_covid_status_at_your_uni/hbxoaz4/",
      "text": "I was in close contact with a person with covid, when I started to feel strange in the throat I gargled with water, lemon and salt .... from there I had no discomfort so I do not know what it is to have covid and I vaccinated and the vaccine was worse",
      "author": "Sanshiel",
      "created": 1631025112,
      "upvotes": 1,
      "replies": {}
    },
    "hbwmad1": {
      "link": "/r/AskAcademia/comments/pj9qbq/what_is_the_covid_status_at_your_uni/hbwmad1/",
      "text": "[removed]",
      "author": null,
      "created": 1630999413,
      "upvotes": 0,
      "replies": {
        "hbx17u3": {
          "link": "/r/AskAcademia/comments/pj9qbq/what_is_the_covid_status_at_your_uni/hbx17u3/",
          "text": "May I ask where?",
          "author": "IndependentLinguist",
          "created": 1631012331,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}