{
  "sid": "pdzqa6",
  "link": "/r/AskAcademia/comments/pdzqa6/can_a_lower_quality_degree_by_the_type_of/",
  "title:": "Can a lower quality degree (by the type of accreditation) prevent admission to a high-quality graduate program or sabotage career advancement?",
  "text": " Hi guys,\n\nI currently finished a bachelor's degree (business finance) accredited by ACBPS. This October starting a master's degree (management) at the same college in Europe. Both of these programmes are weekend studies as I currently work in a middle management position (3yrs experience) for a local business unit of a corporate (size of total around 2,5K employees).\n\nMy plan is to continue on the path of education, use the momentum and after finishing the master's, obtain an MBA degree from a European institution. The current programs are being attended during weekends, however, for the MBA I plan to go abroad for the year, fully commit to the programme and return back.\n\nMy question is this: I have recently started to learn about the accreditation importance and quite honestly started to worry whether the current programmes accredited by ACBPS might prevent me from being considered into more prestigious MBA schools (in 2 years time from now).\n\nWould you please give me some insight on the accreditation issue and whether it plays such an important role for:\n\n1. Acceptance into a prestigious MBA programme (for instance a similar level to Rotterdam Business School)\n2. Whether the ACBPS accreditation might have any negative impact in relation to career advancement into higher management in future. (Or to put it differently, in what case might be the ACBPS considered not good enough)\n\nThe point of pursuing the MBA programme is not only to actually acquire wide business knowledge through practical case studies from different fields but to also use it as a career enhancer, given there is some work experience already, this might be the right way how to truly step up the game and have the doors opened to the high-level executive positions.\n\nI will appreciate any answers and insights into the topic.  \nThank you very much!\n\nPS: If you have any other insights concerning the MBA degrees (ranking, the accreditation, the difficulty of the programmes or even an experience/opinion whether there is some kind of \"common practice\" that only \"top 100 Business School\" have an actual impact on substantial career development and the rest might not be the best choice considering needed resources (time and finances) I will be happy to read through it. I will appreciate any experience passed on in the comments.",
  "author": "sptak",
  "created": 1630258480,
  "updated": 1634079456,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hb1xgdj": {
      "link": "/r/AskAcademia/comments/pdzqa6/can_a_lower_quality_degree_by_the_type_of/hb1xgdj/",
      "text": "Can you get a good GMAT score? If yes, then your undergraduate degree won't matter (beyond the fact that you have one).\n\nMy general advice would be only pursue an MBA at a school where you can get the kind of networking opportunities that will lead to the career that you want. This is not to say that you won't learn anything in your MBA, but MBAs tend to be expensive and you want to get a good return.\n\nAnd that usually means rankings are very important (the highest ranked places will have exponentially better networking opportunities).",
      "author": "DeskAccepted",
      "created": 1630415595,
      "upvotes": 1,
      "replies": {
        "hb1y05e": {
          "link": "/r/AskAcademia/comments/pdzqa6/can_a_lower_quality_degree_by_the_type_of/hb1y05e/",
          "text": "Oh and just to clarify when I say rankings are important, if you want this degree to really open doors to high level positions, you should be aiming for *top 10-20*, not top 100.",
          "author": "DeskAccepted",
          "created": 1630415864,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}