{
  "sid": "qsija2",
  "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/",
  "title:": "PEOPLE WITH A MASTERS OR PHD BUT WITHOUT A JOB IN ACADEMIA: Do you still feel like going to grad school was worth it?",
  "text": "I have job security and a decent salary right now, but I have no passion for what I do. I really want to go back to school and ultimately, ideally, work in academia. However, everyone is saying the job market is horrible and only getting worse. So here's my question... Say I *do* get a MA (and maybe eventually a PhD) and I can't land a good job because of the job market in academia... Would it maybe still be worth it? I'd be so much more knowledgeable, I'd have the title (stupid ego bullshit, I know), and I'd have done the thing I set out to do... Or would the pain of the debt and whatnot outweigh that?  Let me know your thoughts.",
  "author": "yungrobot",
  "created": 1636744518,
  "updated": 1639840745,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkd9dsi": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkd9dsi/",
      "text": "In my opinion, the only reason to do a PhD is if you can't bring yourself to do anything else---you want it that much. Then if you get a job or not, it was something you had to do. \n\nAnd then, only do it if you can manage financially **without** taking on debt.",
      "author": "Ike_hike",
      "created": 1636744776,
      "upvotes": 3,
      "replies": {
        "hkdnb8d": {
          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdnb8d/",
          "text": "Oh man, I wanted to do anything but a PhD, but my career de-facto requires the PhD these days.\n\nAnd then I ended up becoming (sort-of) faculty anyway, so it's kinda wild.",
          "author": "ThePhysicistIsIn",
          "created": 1636750730,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hkdapfp": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdapfp/",
      "text": "It was worth it. Went in for the PhD and left with a master's. Thought that was a bad thing until I entered industry. Zero regrets. Academia was miserable compared to what I've done since. The Masters has been very beneficial for job security.",
      "author": "Beakersoverflowing",
      "created": 1636745344,
      "upvotes": 1,
      "replies": {
        "hkdj3le": {
          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdj3le/",
          "text": "That’s great! Academics is pretty brutal and many times very petty.",
          "author": "Selvadoc",
          "created": 1636748929,
          "upvotes": 25,
          "replies": {
            "hkfcfqp": {
              "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkfcfqp/",
              "text": "Oh, in India where I am from, it's viewed as a field that's less stressful. So I'm curious, could you elaborate?",
              "author": "_izameh",
              "created": 1636780801,
              "upvotes": 5,
              "replies": {
                "hkfcnaj": {
                  "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkfcnaj/",
                  "text": "Well, a little. Tenure track faculty members have to be careful as to what they say. Also, moving into administration is tough. Typically, you want to go somewhere else. It’s a big list.",
                  "author": "Selvadoc",
                  "created": 1636780929,
                  "upvotes": 3,
                  "replies": {
                    "hkg5qe5": {
                      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkg5qe5/",
                      "text": "Who wants to move into administration though? Its just a ton of paperwork and meetings and dealing with people's bullshit instead of doing research or teaching which are the good parts of being a prof.",
                      "author": "abandoningeden",
                      "created": 1636804599,
                      "upvotes": 3,
                      "replies": {
                        "hkh0exn": {
                          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkh0exn/",
                          "text": "In my case it was complicated. But, with a family, it’s where the money is (kind of in the big scheme of things) and a chance to move up. It’s like that at a teaching institution.",
                          "author": "Selvadoc",
                          "created": 1636821345,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    },
                    "hkfmvxw": {
                      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkfmvxw/",
                      "text": "Right. Sounds like a lot of people-pleasing would be involved. But, what about research and funding, is there favouratism there? Or is it more transparent?",
                      "author": "_izameh",
                      "created": 1636788253,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "hlsnytm": {
                  "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hlsnytm/",
                  "text": "(I am Indian) One of my sister's professor left his job and started teaching people programming and now makes way more money, he taught at a big university, had a doctorate and everything, but he was extremely sad at that job due to office politics and shit, and not being able to get fundings. I just wanted to share it because its not as good as it seems even in India.\n\nBut again, since everything is exam-based, if you clear whatever UGC exam there is and get in a good government funded university, you will get good pay and benefits as it will be a government job",
                  "author": "Apprehensive_Joke_73",
                  "created": 1637691023,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hke3yiz": {
          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hke3yiz/",
          "text": "As someone in academia with hopes of exiting someday, can you inform me of what it is that you do?",
          "author": "ActionXPotential",
          "created": 1636758127,
          "upvotes": 10,
          "replies": {
            "hkfdenq": {
              "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkfdenq/",
              "text": "Pharmaceutical R&D. Analytical methods.",
              "author": "Beakersoverflowing",
              "created": 1636781410,
              "upvotes": 5,
              "replies": {
                "hkfq02n": {
                  "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkfq02n/",
                  "text": "With what background bach and MA?",
                  "author": "Chrspls",
                  "created": 1636790865,
                  "upvotes": 2,
                  "replies": {
                    "hkgklym": {
                      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgklym/",
                      "text": "Chemistry for both.",
                      "author": "Beakersoverflowing",
                      "created": 1636813970,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                },
                "hkg6zmf": {
                  "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkg6zmf/",
                  "text": "Great! But what does this mean? Like how do you spend your day? What are the actual physical things you do? I understand if anything is proprietary I just don't understand the working day of this stuff.",
                  "author": "ActionXPotential",
                  "created": 1636805572,
                  "upvotes": 1,
                  "replies": {
                    "hkglm73": {
                      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkglm73/",
                      "text": "So, I don't actually do analytical methods anymore. I currently am a little deeper than that, but I like to keep some traceable details of my life off Reddit. So i don't develop analytical methods anymore, but I'm using other people's methods to study drug substances and products.\n\nAnalytical method development can kind of be wrapped up into three tasks. Material receipt, storage, and analysis. Method development, validation, and verification (I did HPLC). And data management (where you keep it, how you access it, processing, summarizing, and reporting). There are a lot of auxiliary tasks on top of that though.",
                      "author": "Beakersoverflowing",
                      "created": 1636814487,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hkdsawv": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdsawv/",
      "text": "Have a Masters and currently work for a National non-profit. Having that higher education definitely led to more knowledge of the profession, plus provided me confidence I had been lacking after my Bachelors. Additionally, my degree made me more competitive during the hiring process and I believe has helped accelerate my promotions through the organization.\nWhen I was considering pursuing my masters, my bachelors advisor gave me some great advice - never pay for tuition. Meaning, there should be avenues available for you to have your tuition waived - whether through leading your own research, being a TA, or a lab apprenticeship (the route I went), to name a few (I’m sure there are other opportunities out there). I fortunately came out of grad school with minimal additional debt thanks to that advice.",
      "author": "Prairiebug",
      "created": 1636752886,
      "upvotes": 48,
      "replies": {
        "hkf9kvw": {
          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkf9kvw/",
          "text": "And depending on your field of work and company you work for, their maybe education support that allows you to cover part of the cost. I am currently pursing a master and work is covering parts of it.",
          "author": "tyfung",
          "created": 1636779055,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hke44y1": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hke44y1/",
      "text": "PhD in engineering; wanted to be a professor, didn't have the kind of publication record that would secure me a faculty spot by the end of my degree. Got a job I love at a national lab, doing pretty much exactly what I wanted to when I was a little kid. PhD was totally worth it to me. May one day try to go back to academia now that I have a substantially better publishing/patent record, and there's a pretty good chance I'd be able to retire fairly early if I want.",
      "author": "racinreaver",
      "created": 1636758209,
      "upvotes": 33,
      "replies": {}
    },
    "hkdxr90": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdxr90/",
      "text": "Hindsight? It was worth for the chance to learn the things I learned. I don't feel like I'm done learning, so it was worth it as a ladder up to more.\n\nIn all other ways? Completely worthless waste of time and a mistake on my end. It cost me such effort and caused so much stress, I'm still recovering from it. No job and no chance at getting one. I have over 200 solicitations in my field, with a 10% succes rate (getting an interview) and a 0% employment succes rate. I've gotten the hint, and I'll try going for some shitty job in order to survive and try to study in my spare time. Let's see how long I'll keep that up. I have grown a little bit bitter about it.",
      "author": "Stomaninoff",
      "created": 1636755311,
      "upvotes": 22,
      "replies": {}
    },
    "hke2vds": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hke2vds/",
      "text": "As a PhD student who wants to continue in outside of academia after PhD, this comment section is depressing..",
      "author": "donuz",
      "created": 1636757628,
      "upvotes": 17,
      "replies": {}
    },
    "hkdt0kp": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdt0kp/",
      "text": "I feel like this depends on a lot of factors, and is maybe not the right question. \n\nI work in industry in a job I likely would not have gotten without a PhD.\n\nDo I feel like getting my PhD was worth it? Yes.\n\nIf I had to do it all over again, knowing what I know now, would I choose to get a PhD again? Probably not.\n\nWhy not? Because I realize that while I was passionate about the area I studied in grad school, and while I love what I do now...there are lots of *other* things I really love and enjoy and I realize now that I could've gotten a fulfilling and wonderful job without having a PhD - without having spent the six years in grad school rather than building my career, gaining experience, and earning money.\n\nThis question has been asked here and elsewhere so many times, but it's such an individual question. There is literally no way to predict how you will feel at the end of *your* PhD. But the way I advise people to think about this is by answering these two questions:\n\nIf at the end of eight or nine years in a PhD program you end up back teaching high school, making perhaps a little more money than you make now, would that be OK with you? and\n\nDo you love academia so much, and want a shot at an academic position *so badly* that you are willing to go through with the above?\n\nIf you have to take on debt to do this, though, the answer is definitely no.",
      "author": "roseofjuly",
      "created": 1636753202,
      "upvotes": 37,
      "replies": {}
    },
    "hkdr5al": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdr5al/",
      "text": "It 100 % depend on your field and country. I don't get why people answers your question without knowing your field and country. A PHD in philosophy and history would get you less jobs then psychology, medicine, pharmacy, biochem, meteorology, geology etc.",
      "author": "oliski2006",
      "created": 1636752382,
      "upvotes": 49,
      "replies": {}
    },
    "hke6q1c": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hke6q1c/",
      "text": "I have a PhD in the biological sciences and left academia within months of graduating (did a short postdoc, but had no desire to spend a few more years culturing cells and running gels). \n\nTook a job as a medical writer for a company creating continuing medical education programs. That led to a career in pharma marketing, where I now lead a department of medical writers and strategists and make a boatload more money that I ever would had I stayed in academia. \n\nAbsolutely worth it, as it opened doors for me that I never even knew existed.",
      "author": "Virian",
      "created": 1636759419,
      "upvotes": 12,
      "replies": {}
    },
    "hkdc70q": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdc70q/",
      "text": "I have a PhD and was a professor, Dean, and VP in a career spanning 30 years. Some of it was good. But, I’d say no. I advise people to not go in to academics, unless they really view it as some kind of calling with a vow of poverty. In these days faculty are being abused more and more by students and administration. In my opinion, there are more rewarding fields of endeavor.",
      "author": "Selvadoc",
      "created": 1636745988,
      "upvotes": 99,
      "replies": {
        "hkdgxkg": {
          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdgxkg/",
          "text": "I'm curious to hear more of your perspective. Almost finished my master's and I am trying to get a job at my university. Everyone I have spoken to, both faculty and administration, has said it is a rewarding career path and they earn good money. I currently work in corporate healthcare, which obviously has nothing to do with my degree path, so I'm kind of feeling like a failure.",
          "author": "comradegayskull",
          "created": 1636748009,
          "upvotes": 14,
          "replies": {
            "hkdtcvm": {
              "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdtcvm/",
              "text": "> Everyone I have spoken to, both faculty and administration, has said it is a rewarding career path and they earn good money.\n\nThat's survivorship bias. Of course it is a rewarding career path to the people who were successful in securing an academic job, but these days, those people are the exception rather than the rule (particularly in the humanities).\n\nAsk some of the contingent faculty how they feel.\n\nAlso, working in a field that's not directly related to your undergrad degree doesn't make you a failure. Very few people can draw a straight line between their undergrad major and their career/job.",
              "author": "roseofjuly",
              "created": 1636753349,
              "upvotes": 62,
              "replies": {
                "hke2iky": {
                  "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hke2iky/",
                  "text": "I appreciate your insight and honesty, thank you so much. \n\nMy degrees are in English, Writing, and Education. It's always been my dream to work in gaming as a narrative designer, but I searched for a year and every job I applied for at the major studios was an instant rejection. I managed to score one interview, and it took them over a month before they threw me a one line email saying \"you've been passed over, thanks.\" The depression was crippling and to be completely transparent, I cried a lot. \n\nEnded up liking academic administration after working in the Workforce Development department at my university, but after getting interviewed and passed over, I lost hope. \n\nForgot about teaching entirely. Covid destroyed that dream. Can't afford to even apply for an adjunct position because after 2 years interning I need to make money. \n\nSo now I'm in corporate healthcare handling Medicare/HMO claims. It just feels like I did everything wrong.",
                  "author": "comradegayskull",
                  "created": 1636757466,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            },
            "hkdijlj": {
              "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdijlj/",
              "text": "Well, it doesn’t sound like you’re a failure. If you like research and are good at it, I think universities are good places. But, you’d be chasing grants. For me, I spent a few years in industry and the pay and experiences were great. I was at a teaching institution and that’s a whole different set of issues.",
              "author": "Selvadoc",
              "created": 1636748693,
              "upvotes": 8,
              "replies": {
                "hke2ntx": {
                  "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hke2ntx/",
                  "text": "I appreciate your response. I have a couple colleagues who are dealing with hunting down grants and they're not having a good time.",
                  "author": "comradegayskull",
                  "created": 1636757533,
                  "upvotes": 4,
                  "replies": {
                    "hke6ll3": {
                      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hke6ll3/",
                      "text": "Yea, it’s tough. The previous administration made the percent of successful funding lower. Industry is great if you like research.",
                      "author": "Selvadoc",
                      "created": 1636759363,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hkdsuhq": {
              "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdsuhq/",
              "text": "I have a Master's and work at a university and love it, so it varies.",
              "author": "MotherHolle",
              "created": 1636753127,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hkdy4jr": {
          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdy4jr/",
          "text": "> In my opinion, there are more rewarding fields of endeavor.\n\nsuch as....\n\nI'm thinking of doing a PhD now mainly because I have no idea what else to do that involves lots of writing, analysing data, and speaking with other experts.",
          "author": "schnebly5",
          "created": 1636755478,
          "upvotes": 2,
          "replies": {
            "hkdyqp7": {
              "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdyqp7/",
              "text": "I have a degree in history. I work in gift card fraud analysis for a Fortune 100 company. I do all of this and make a difference in victim assistance. I also work with law enforcement and prosecutors and write reports for federal cases.",
              "author": "dewitt72",
              "created": 1636755754,
              "upvotes": 11,
              "replies": {
                "hkfqi7p": {
                  "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkfqi7p/",
                  "text": "Super interesting! So is that more data analysis based? Or are you more on the meta level?",
                  "author": "schnebly5",
                  "created": 1636791302,
                  "upvotes": 2,
                  "replies": {
                    "hkglj9b": {
                      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkglj9b/",
                      "text": "Both. I analyze data from my category and connect it to the larger picture. Each of us has a category we work in (resellers, scams, employee theft, etc). I work in scams- those people that call you and say like you owe the IRS money and have to pay in gift cards or you are going to jail. \n\nI work for Best Buy, so once someone buys a BBY gift card, I track where it was bought, where it is being used, and try to recover funds if the person that bought the card was a victim of a scam. I call victims, track warehouses, watch organized crime outfits, review store video, and track online orders. It’s a lot of work, but I can actually see a difference and they are all giant puzzles.",
                      "author": "dewitt72",
                      "created": 1636814444,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hkjyfwh": {
          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkjyfwh/",
          "text": "How are students abusing the PIs?",
          "author": "chillzxzx",
          "created": 1636868565,
          "upvotes": 0,
          "replies": {
            "hkk4d36": {
              "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkk4d36/",
              "text": "Just follow this sub for a while.",
              "author": "Selvadoc",
              "created": 1636872127,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "hke6tw1": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hke6tw1/",
      "text": "Master’s here. Brief stay in PhD before leaving academia.\n\nAbsolutely worth it. I was on fellowship. Learned a ton. Met good people. Loved my experience going back to college. Developed a ton of confidence and a focus for the rest of my life.\n\nI left the PhD program though because money was tight and we wanted more kids. I had a lot of regret for a while, but I’m happier now. We make enough money to reach our financial goals, my retirement is planned for, and I get plenty of time for hobbies and family. I looked into going back for a PhD a year ago and paying for it myself. I estimated $100k in loan debt after tuition, books and supplies, travel, interest. Not worth it, but I still have the itch.",
      "author": "NoPatNoDontSitonThat",
      "created": 1636759469,
      "upvotes": 8,
      "replies": {}
    },
    "hkft0c6": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkft0c6/",
      "text": "You don’t make good money in academia. And no matter what you do in work - it will always suck because you will always prefer lying on your sofa at home sipping tea and eating cookies.",
      "author": "Inccubus99",
      "created": 1636793481,
      "upvotes": 7,
      "replies": {
        "hkgmq0q": {
          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgmq0q/",
          "text": "Can confirm as professor: 10/10 prefer lying on my sofa at home sipping tea and eating biscuits to teaching or doing research.",
          "author": "biglybiglytremendous",
          "created": 1636815056,
          "upvotes": 3,
          "replies": {
            "hki2058": {
              "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hki2058/",
              "text": "Why not just bring a sofa and cookies to class?",
              "author": "Aquahemo",
              "created": 1636837411,
              "upvotes": 2,
              "replies": {
                "hkikcop": {
                  "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkikcop/",
                  "text": "Sounds good to me. Sign me up for cookie and couch funding.",
                  "author": "biglybiglytremendous",
                  "created": 1636845237,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hkdqzp9": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdqzp9/",
      "text": "Currently have a Master’s and am in a US STEM PhD program, but with no intention of going into academia long-term. \n\nEspecially in STEM, having a PhD (from a highly ranked program) opens up many professional doors in industry: industry research or consulting jobs, management positions for domains or products that require specialized technical knowledge, etc.\n\nFrom a lifetime earnings perspective the PhD likely won’t pay off, but I’ve got 30ish years of a career afterwards and would rather have access to what I consider the more exciting jobs. YMMV.",
      "author": "TrafficScales",
      "created": 1636752316,
      "upvotes": 19,
      "replies": {
        "hkdxft3": {
          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdxft3/",
          "text": "Also in STEM with a MS (never intended to go for a PhD). It gave me the chance to explore more specialized topics in my major. Granted, I could have taken some of those as an undergrad, but I used my free electives on other things instead. \n\nThe other big thing was working on a project beyond just one semester. Again, this isn’t exclusive to grad school. But it really makes you stand out if you’re interested in a particular field (like R&D, aerospace, additive manufacturing, medical devices, etc.) and/or don’t have internship experience.",
          "author": "MabelUniverse",
          "created": 1636755166,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hkeapkk": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkeapkk/",
      "text": "I currently work in higher ed, and no, it wasn’t worth it. I’m trying to get out of academia and back into the field I was in before grad school. \n\nSince you mention that you’re interested in either philosophy or literature, I assume that you’re interested in theory. You should understand, OP, that philosophy and literature are very different disciplines with, in the US, almost no overlap. You might be interested in critical theory/continental philosophy; no American philosophy dept does that kind of work or supports students who do. Some English depts with good theory people will take students who do that work, but there are zero theory jobs anymore.",
      "author": "Opening_Doors",
      "created": 1636761303,
      "upvotes": 5,
      "replies": {}
    },
    "hkeftmp": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkeftmp/",
      "text": "PhD in physics.  Yep, worth it.  I would feel like a failure if I hadnt followed through and that internal sense of unworthiness would follow me my whole life.  I also use my degree as a private tutor of highly gifted kids.  The skills I learned have served me very well.  I am treated with an extra level of respect because I have a doctorate.  For instance, I feel like I 'belong' anywhere around anyone and even the most wealthy people speak to me with what seems like an added level of respect.  This is in part because my skills are so rare and they need my services, but also because I achieved the highest level of education and they value that.  I like knowing the things I know, having the skills I have and being able to understand the world better than if I hadnt gone or had dropped out.\n\nTo each their own, but I wouldnt trade it and I dont miss academia itself at all.",
      "author": "bjos144",
      "created": 1636763746,
      "upvotes": 14,
      "replies": {}
    },
    "hkeaa9e": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkeaa9e/",
      "text": "You are going to have some problems reaching a representative section of your target population by asking this here.",
      "author": "ph0rk",
      "created": 1636761099,
      "upvotes": 3,
      "replies": {}
    },
    "hkdo0px": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdo0px/",
      "text": "As others have said, I would not take on debt to do grad school. Depending on your field you have the opportunity cost of the salary/retirement contributions. That's probably a bigger regret for me, I missed 8ish years of decent salary and 401k. However, I have a job in a scientific field where I do not have to do bench work and make 6 figures with growth potential. I do think that was facilitated by the PhD. Otherwise I'd probably still be a bench scientist trying to work my way up.",
      "author": "thrombolytic",
      "created": 1636751034,
      "upvotes": 14,
      "replies": {}
    },
    "hkdqfjh": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdqfjh/",
      "text": "Wanted to do the PhD route, but being married with 2 kids by the time I hit college (was 26 when I left the military) I had to settle at my MA and get working.  \n  \nI have a comfortable federal job, bring home $70k a year, and work from home - without any student loan debt. I do not work over 40hrs a week unless I want to - you won't find that in academia or even private sector.   \n  \nHad I gone the PhD route I would still had 3-4 years of school left - to jump into a job market that is over saturated with crippling debt and a family to raise. Across the board giving up on pursuing a PhD was the best decision for my mental well being, and financial.",
      "author": "Dire88",
      "created": 1636752073,
      "upvotes": 8,
      "replies": {}
    },
    "hke2nr4": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hke2nr4/",
      "text": "I was so worried I made a bad decision. Getting my masters has opened so many doors and I have gain a ton of marketability in the workplace. However, I went for lab sciences.",
      "author": "lazerlass",
      "created": 1636757532,
      "upvotes": 3,
      "replies": {}
    },
    "hke9n74": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hke9n74/",
      "text": "I have a master's and I like academia even with all of its... stuff. I'm back as a student to get a doctorate, but my employer is paying for it. Don't pay for a PhD; but a masters is a good idea. It's hard to do things in higher ed without adding letters to your name. Also, if you like your subject area, more classes can be fun.",
      "author": "ap9981",
      "created": 1636760793,
      "upvotes": 3,
      "replies": {}
    },
    "hkf2566": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkf2566/",
      "text": "Have a Master's and Doctorate in Geological Oceanography. The world travel involved as part of the lab group was worth doing both degrees alone not even considering anything else.",
      "author": "SeaAsh",
      "created": 1636774918,
      "upvotes": 3,
      "replies": {}
    },
    "hkf51j8": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkf51j8/",
      "text": "Definitely worth it. I originally intended to go down an academic path but crashed from burnout following my master's. I just couldn't fathom starting a PhD. Instead, I became an analyst for the government with good pay and a healthy work-life balance. The master's degree gave me so many transferable skills for this job that I wouldn't otherwise have if I never went to grad school.",
      "author": "Gonutsfordoughnuts",
      "created": 1636776444,
      "upvotes": 3,
      "replies": {}
    },
    "hkgffcg": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgffcg/",
      "text": "I wouldn’t recommend ever taking out a student loan for a degree in humanities. You will be in debt the rest of your life, and you will most likely never get a job in academia. If you do, it will likely be an adjunct position that pays poorly, overworks you, has mo benefits, and is in the middle of nowhere. \n\nI went through 6 years of grad school for music. I had high hopes and dreams, busted my ass, and really loved working in academia as a PhD student. I also thought I’d never find myself just not landing a job of some sort, or even an interview at the very least. Like, I was really committed and passionate.\n\nThere was literally nothing. Like sending applications into a void from which they never return. I’ve also never been outside of academia and moved to an entirely new place to find work and make a life after my degree. At least getting to choose where I live. I have had to completely rethink what making a living is like, and how to use my degree somewhat at least and it’s been a rude awakening. Thing is, a lot of my fellow grad students come from affluent backgrounds and have adequate family support. I do not, and I will be royally fucked with debt the rest of my life just from the masters degree. My PhD from Cornell paid me handsomely to be there, but the maters degree is what’s picking at what’s left of my finances now. \n\nAs depressing as this sounds, Honestly, I’m making a pretty good life for myself not using my degree and have recovered from copious amounts of depression over the years. In fact it’s kind of nice to be a normal person, but also have a whole depth of knowledge about music and shit,\n\nAgain, I freaking loved academia and love music. I really would like to be apart of that community and contribute to university life, even now. I’m good at it and it would be so great to have that back. None of this matters though unless you have a bit of good luck, an incredibly helpful and well-regarded advisor, and are a work-a-holic. If you have to take out a loan, don’t go to grad school. Unless it’s a professional degree or with industry options, which yours would not be. If you do decide to pursue this degree, and must take out a loan, I hope you or your family is wealthy. Find your own way, your own happiness, and best of luck!",
      "author": "bsharp250",
      "created": 1636811157,
      "upvotes": 3,
      "replies": {}
    },
    "hkdv15d": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdv15d/",
      "text": "No.",
      "author": "Frandom314",
      "created": 1636754089,
      "upvotes": 6,
      "replies": {}
    },
    "hkduvc4": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkduvc4/",
      "text": "yeah, was necessary for the jobs I was interested in and I got a nice one straight out of my PhD.     \n\nIn Chemistry there are simply no bachelor level jobs where Im from and master level jobs either are in QC/QA (which Im not interested in) or often end in \"lab drone until retirement\" carreers.     \n\nImho its important to be realistic with what the outlook is with a PhD and what your goal is. Then tailor the PhD towards that goal.     \nE.g. if academia is the goal get into a field that is at the beginning of the hype cycle with the biggest name PI you can get into and be ready to suffer for 4+ years.    \n\nIf you wwnt to get into a specific industry try to find a PhD either already in that industry or if that doesnt work out, with a PI that has good connections to the industry.",
      "author": "yopikolinko",
      "created": 1636754017,
      "upvotes": 2,
      "replies": {}
    },
    "hkf02ds": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkf02ds/",
      "text": "100%",
      "author": "a_dog_named_bob",
      "created": 1636773813,
      "upvotes": 2,
      "replies": {}
    },
    "hkf90eg": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkf90eg/",
      "text": "It doesn't seem like you've thought this out. Don't go to grad school until you've talked to people currently in the program you're planning on applying to AND people who have graduated from that program. You seem to have an idealized view of what happens in grad school and in academia in general.",
      "author": "catnamedpants",
      "created": 1636778713,
      "upvotes": 2,
      "replies": {}
    },
    "hkftyx9": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkftyx9/",
      "text": "Yes, but in my current position I feel under utilised based on my education and experience. I'm more on the fence of 'this job wasn't worth it' rather than 'my PhD/postdoc wasn't worth it'.",
      "author": "ANf9YcDp4H3XCMcKEcib",
      "created": 1636794333,
      "upvotes": 2,
      "replies": {}
    },
    "hkgbel0": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgbel0/",
      "text": "I have a PhD and was pursuing an academic career.  It was my postdoc position and it's area of research that led to me taking a job outside of academia.  It opened doors that wouldn't have been available otherwise.\n\nI'm very happy working in industry.  The pay and benefits are much better, and I am not in a publish-or-perish position - which is much less stressful.\n\nI use my education daily in my job, but not necessarily my research area or research skills themselves.  The most valuable component of my PhD that still pays dividends to this day is the soft skills learned and practiced throughout pursuing the degree.  I have been complimented on my ability to communicate complex topics towards audiences of varying levels of technical understanding.  This has let me to not just operate in a technical role, but to also publish and present at conferences, meet and work with clients/customers, present up to C suite leadership, and build a reputation as a valuable employee as evidenced by my connections and compensation.",
      "author": "vitamincheme",
      "created": 1636808687,
      "upvotes": 2,
      "replies": {}
    },
    "hkgnpkt": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgnpkt/",
      "text": "My PhD is in literature and I'm finishing a Masters in Philosophy. I was lucky to get a TT job in a teaching institution, but it was entirely luck (I have a lot of graduate school colleagues who were/are way more accomplished than I), which I mention only because there is no guarantee you'll get a job in higher ed even with the credentials. \n\nThat said, every moment of graduate school has been worth it to me -- not just for the job, but for the knowledge and the intellectual exercise -- which is why I keep going back. I'm thinking a Masters in cognitive neuroscience, with an emphasis on how the brain learns, is the next round of graduate school for me.",
      "author": "1derfulfroward",
      "created": 1636815558,
      "upvotes": 2,
      "replies": {}
    },
    "hkh0zo2": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkh0zo2/",
      "text": "Absolutely. But I went back to a second BA, MA, and PhD half knowing that there wouldn't be a job for me after I finished IN academia. I didn't go back to qualify me for a specific job after my phd (though for a couple of years at the end I got caught up trying to apply to academic jobs and failed), I went back because I wanted to do the learning.  I had been working admin during the tech boom - I'd worked for two different companies that closed their doors. I thought to myself at the time that if I keep working at these kinds of companies I'll still be changing jobs and having all the uncertainty, and not have a degree either, so why not have the degree even if I end up in 10 years looking for a job? \n\nThe academic job situation was grim when I started and worse when I finished, but I loved those years and what I learned/explored/experienced during them. I love the people I met, the people I taught, and the places I went to do all that. I wanted the flexibility of schedule, I wanted to be back in spaces that challenged me to read and learn, and to have the leisure to go down unpredictable paths. \n\nThe toughest part was getting used to how little money even a fully funded phd is, and the only thing I regret even slightly is that I took out a bunch of loans the first three years (tried to keep my same standard of living at first, which you \\*cannot\\* do if you've been making decent money) that I'm going to be paying off forever.",
      "author": "LadyTanizaki",
      "created": 1636821599,
      "upvotes": 2,
      "replies": {}
    },
    "hkh2z2l": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkh2z2l/",
      "text": "Yes. It helped me get an easier job with the U.S Government. AND more importantly, the things i learned were invaluable :) I use it every day in some capacity.",
      "author": "Asiastana",
      "created": 1636822463,
      "upvotes": 2,
      "replies": {}
    },
    "hkh6t0j": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkh6t0j/",
      "text": "I just retired after about 50 years in academia. The profession has gotten worse and more exploitive every decade. If you look at undergraduate course offerings in philosophy or literature you will see that the vast majority of courses are taught by grad students or adjuncts. That means that annual salaries top out at about $35,000.  It will be very hard for you to find good statistics on tenure track placement, but that should be a clue by itself. Everyone in your position thinks they will be The One because everyone in doctoral school had always been the smartest kid. Do it if you want - honestly do it if you need to - but don't expect a quality salary, ever.",
      "author": "ArgumentBoy",
      "created": 1636824080,
      "upvotes": 2,
      "replies": {}
    },
    "hkiguix": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkiguix/",
      "text": "I have a master's and currently an only vaguely academia-adjacent job (which I am...not wild about,  mainly because of my specific situation rather than the work itself, which is okay although not more repetitive than I would like). \n\nMy master's program was an amazing experience and I feel largely worth it, although the debt is not great. It's better to do it without debt if you can. I made some very good friends and connections, it fundamentally changed how I think in many ways, and it opened quite a few doors. \n\nAfter a LOT of thinking and publishing a few papers to be sure I can carry a project through and don't hate doing so, I'm applying for PhDs. However, 1) I'm only applying for funded positions, so no additional debt, and the salary for a PhD researcher in the places I'm applying is better than I make now and includes healthcare (I'm currently self-insured), 2) I want the actual experience of diving into research for about 4 years and at this point have a reasonable sensor for working environment red flags, 3) I am not at all set on a professorship and in fact would prefer something else, 4) I have done my research on the places and kinds of jobs I'd like to work at and where people at them get their PhDs, compared that to the places I think I would have a good PhD experience, and I'm 100% ok with the fact that I would be very unlikely to get a professorship in North America because I don't want one, and 5) I plan to acquire as many versatile and transportable skills as I can during my PhD, so if I have to pivot, I have something to pivot with.\n\nI personally would not do it if I wanted to be a professor and only a professor, if I were currently making buckets of money and happy in my career, if I had to take on more debt, or (at my age) if I had to do a 7-year U.S. PhD while TAing.\n\nThe pros and cons are going to be different for everyone.",
      "author": "threecuttlefish",
      "created": 1636843750,
      "upvotes": 2,
      "replies": {}
    },
    "hkdbb84": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdbb84/",
      "text": "I literally regret my bachelor's... Basically the lowest paid professional workers in our construction business make twice the money I would make with an engineering degree.",
      "author": "sundowner17442",
      "created": 1636745607,
      "upvotes": 1,
      "replies": {}
    },
    "hkdqo52": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdqo52/",
      "text": "I got a Ph.D. in the hard sciences and didn't go into academia.  THe Ph.D. was worth it though.\n\nI also have a Bachelor's in a humanities that was pretty much a waste of a career opportunity.  I can't imagine getting a Ph.D. in that area and thinking any kind of real job would result from it....not only in academia but in anywhere.",
      "author": "04221970",
      "created": 1636752177,
      "upvotes": -6,
      "replies": {}
    },
    "hkdzt3v": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdzt3v/",
      "text": "Yeah",
      "author": "ExtraSmooth",
      "created": 1636756234,
      "upvotes": 1,
      "replies": {}
    },
    "hkerdvs": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkerdvs/",
      "text": "Sure, got a pretty cozy job in government. I have most opportunities that academics have without the extreme pressure from getting tenured etc",
      "author": "tastytastylobster",
      "created": 1636769447,
      "upvotes": 1,
      "replies": {}
    },
    "hkerwgt": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkerwgt/",
      "text": "Yes.\n\nI worked in industry for 4 years before committing to grad school full-time to complete my research intensive MS thesis. I ended up getting a publication based on that these and almost $40K a year more when I returned to industry after graduating compared to what I was making before with my BS. I now work on interesting stuff alongside people with MS and PhD degrees, and there's plenty of room to grow career-wise (but I'm good for now lol).",
      "author": "VentureIndustries",
      "created": 1636769701,
      "upvotes": 1,
      "replies": {}
    },
    "hkevx1g": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkevx1g/",
      "text": "At first it will be tough finding a job, but once you start gaining experience your masters degree will __always__ be a leverage for yourself in terms of compensation.\n\nDown the line you will definitely make more money",
      "author": "kbniz",
      "created": 1636771687,
      "upvotes": 1,
      "replies": {}
    },
    "hkewmub": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkewmub/",
      "text": "I agree it depends on many factors (field, country, flexibility). I’m a place bound, dual academic couple PhD with a degree in a field that is harder to pivot and have found the job search challenging. I’m proud of what I’ve done but question how it is helping me now (hopefully temporarily, but the longer it takes, the harder it is).",
      "author": "ryanamn",
      "created": 1636772042,
      "upvotes": 1,
      "replies": {}
    },
    "hkf6ngr": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkf6ngr/",
      "text": "100%. Academia is a trap. Go to the state government it a private company. You will make more money and so be happier.",
      "author": "BronzeSpoon89",
      "created": 1636777337,
      "upvotes": 1,
      "replies": {}
    },
    "hkfhe3r": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkfhe3r/",
      "text": "I completed a Masters and a PhD in cognitive psychology and then a Masters in statistics. I currently work as a dishwasher for a college cafeteria (not the one where I studied, but in the same city). \n\nI'm still glad I competed grad school, even if I'm sort of the sad academic burnout version of the guys who always reminisce about their high school football days.",
      "author": "PseudobrilliantGuy",
      "created": 1636784090,
      "upvotes": 1,
      "replies": {
        "hkg9kw9": {
          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkg9kw9/",
          "text": "You're kidding?",
          "author": "schumpter81",
          "created": 1636807478,
          "upvotes": 1,
          "replies": {
            "hkghia1": {
              "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkghia1/",
              "text": "What makes you say that?",
              "author": "PseudobrilliantGuy",
              "created": 1636812317,
              "upvotes": 1,
              "replies": {
                "hkgjkql": {
                  "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgjkql/",
                  "text": "You've got a PhD and you're washing pots? There must be something else to the story...",
                  "author": "schumpter81",
                  "created": 1636813429,
                  "upvotes": 2,
                  "replies": {
                    "hkgkrgk": {
                      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgkrgk/",
                      "text": "I mean, I don't have a drivers license because I'm too scared to learn.\n\nAddendum: I'm also not thrilled by the prospect of spending an hour or more filling out an application only to get no response or get told \"Unfortunately, we've gone with someone else for this position, but congratulations on all of your achievements so far.\" Especially after hearing all of that \"apply anyway\" stuff.",
                      "author": "PseudobrilliantGuy",
                      "created": 1636814045,
                      "upvotes": 1,
                      "replies": {
                        "hkhgv5g": {
                          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkhgv5g/",
                          "text": "We've all been there, in my case 100s of applications with no response (or an automated one). 5 years as a postdoc, now tenured. Just do it, gotta be better than washing pots! That said, I'm looking for an industry role ATM as a result of the crappy pay and mental workload in the UK...",
                          "author": "schumpter81",
                          "created": 1636828356,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hkgdg77": {
          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgdg77/",
          "text": "You have a MS in statistics and the only thing you can find is dishwashing? Do you live in a small town or something?",
          "author": "cgroza",
          "created": 1636809971,
          "upvotes": 1,
          "replies": {
            "hkgheyc": {
              "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgheyc/",
              "text": "Small towns don't usually have multiple colleges.",
              "author": "PseudobrilliantGuy",
              "created": 1636812268,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkfhkdr": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkfhkdr/",
      "text": "Yes (MSc in applied maths).",
      "author": "onetwosex",
      "created": 1636784216,
      "upvotes": 1,
      "replies": {}
    },
    "hkfmvc1": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkfmvc1/",
      "text": "Yes, I am late 20s and graduated with my PhD 3 years ago. I probably make about 2-3 times what I would have made in academia and about 3-4 times what I would have made without graduate school. The PhD really helped open the door to these opportunities. I work 25-35 hours a week and have plenty of time to myself. Work is interesting enough and not super stressful most of the time. Life is good.",
      "author": "phdcandi",
      "created": 1636788239,
      "upvotes": 1,
      "replies": {
        "hkgg6qe": {
          "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgg6qe/",
          "text": "What is your PhD in?",
          "author": "yungrobot",
          "created": 1636811590,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkfs1zb": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkfs1zb/",
      "text": "I work in a small pharma company where I'm one of the few PhDs. Seems like people really trust your opinion lol. Except my boss, who is notoriously incompetent lol.",
      "author": "someth1ng_au",
      "created": 1636792641,
      "upvotes": 1,
      "replies": {}
    },
    "hkga1tx": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkga1tx/",
      "text": "My masters 100% without it I would not even meet prerequisite for stuffs i like to work on \nmy dba well we’ll see once it is finished",
      "author": "Important_Ad9897",
      "created": 1636807800,
      "upvotes": 1,
      "replies": {}
    },
    "hkgn4eq": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgn4eq/",
      "text": "You can also get a masters or PhD and not go into academia… plenty of other jobs available that pay way more",
      "author": "m00nchilddd",
      "created": 1636815259,
      "upvotes": 1,
      "replies": {}
    },
    "hkgo103": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgo103/",
      "text": "No do not do a PhD in literature/philosophy. Whatever you do don’t spend your own money on this!!",
      "author": "drtij_dzienz",
      "created": 1636815708,
      "upvotes": 1,
      "replies": {}
    },
    "hkgv6gc": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkgv6gc/",
      "text": "Environmental chemist here, I would say doing a masters can be worth it, you have experience writing papers and such. But my boss always says he regrets getting his PhD. Waste of time and money in his opinion",
      "author": "burntpeaches",
      "created": 1636819064,
      "upvotes": 1,
      "replies": {}
    },
    "hkh2l4b": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkh2l4b/",
      "text": "Depends on what you want. I have a PhD and have been working for a company. If you want to get to the leadership positions in R&D, PhD makes it easier. Other than that even I left academia, I still think the training I got there really shaped who I am as a scientist, so I am glad I did it. However, it will be financially a step back for you if you already have a good paying job. I did it right after undergrad before I care to make money.",
      "author": "Master-Movie9270",
      "created": 1636822294,
      "upvotes": 1,
      "replies": {}
    },
    "hkojs75": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkojs75/",
      "text": "No, was not worth it for me. Although I still work at a University, my current job (which I enjoy) does not need a PhD and I regret every single year I wasted on getting mine.\n\nAll my friends and peers who went straight into workforce after their undergraduate (or perhaps stuck around for a one or two year masters in a professional field) are all way ahead of me in the career/earnings ladder.\n\nI hate to say it but if you're wondering if academia is right for you, then it probably isn't. (based on my own experience only, of course).",
      "author": "thecasualplaya",
      "created": 1636950112,
      "upvotes": 1,
      "replies": {}
    },
    "hke2176": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hke2176/",
      "text": "rofl",
      "author": "541JJW",
      "created": 1636757247,
      "upvotes": 0,
      "replies": {}
    },
    "hlhmj7t": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hlhmj7t/",
      "text": "I don’t have a masters or a PhD, but I do have a job in academia.\n\nI know this is not normal, but I wonder how common it is. I can’t be the only under-qualified academic in the world.",
      "author": "ELI-PGY5",
      "created": 1637484319,
      "upvotes": 1,
      "replies": {}
    }
  }
}