{
  "sid": "p4owq0",
  "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/",
  "title:": "I have been writing cold mails to professors a certain way and I need honest criticism.",
  "text": "I am been trying to secure a masters by research position and writing to professors. After taking my time to re-evaluate my approach, decided to post an example of an email i wrote recently. Would be glad if i could get proper criticism on it.\n\n\"Dear Professor ___ ___, \n\nMy name is ____, and I am a Civil Engineering graduate (B.Eng.) specialising in sustainable structural engineering and currently in my third-year post-graduation at a structural engineering consulting firm.\n\nIt was interesting exploring some of your past research on Digital Twin applications to construction. Have you considered extending in the direction of applications to construction waste management? \n\nIf feasible, I would love to know if there are research opportunities or possible collaborations opportunities within your research group at the _____ of Science and Technology currently or in the future.\n\nRegarding this, would you be able to take some time out of your busy schedule to discuss?\n\nI have also developed a research proposal for a study I would like to conduct under your supervision if the position for a researcher in your current projects are filled.\n\nI hope my past work and research skills make me eligible to carry out research work under your guidance. I am willing to undergo any selection process if required.\n\nAttached to this mail are my research proposal, CV, transcripts, and some of my award certificates. If there is any other information you would like to know, I would be happy to provide it.\n\nThank you for your time and consideration.\n\nWarm Regards,\n\n_____\"\n\n\nI tried my best not to be brief. Is this what a professor wants to see, do I put more? Do I put less? I am really passionate about becoming an academic and I feel like I am failing my first steps. I will appreciate some criticism so i can get back to writing professors.\n\nEdit:\n\nThank you all so much. I am glad I sought out help here. Please feel free to drop as much advice.\n\nI made an update below, I hope its good enough.\n\nDear Dr _______\n\nI am a planning on pursuing a master's and I have a research proposal In the application of Digital Twin to construction management, which I think is interesting and you will be a great supervisor for because of your research background and recent publications on Digital twins, Sustainable Construction and Wearable Sensory Devices. \n\nI find your research on Digital twin-driven framework for improving ____ of _____ risks fascinating, and enjoyed learning about the ___ ____ used for data collection to the digital twin as well as your publication on sustainable construction where you highlighted the exclusion of work place safety in the ____ aspects of sustainable construction.\n\n I am curious about these research areas and wondering if you plan to take master's students in the next year? If so, I would love to discuss the opportunity further.\n\nThank you for your time.\n\n_____ ____.",
  "author": "DarkID1",
  "created": 1629011500,
  "updated": 1634079595,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "h909jk2": {
      "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h909jk2/",
      "text": "This is a very odd email structure. \n\nStart by saying what you are getting in touch with them about. \n\nDon't try and ask them if they've considered moving their research in direction x. Tell them you have a proposal in area Y that you think is interesting and that you think they would be a good supervisor for because of their relevant publications a b and c. Any email needs to have a specific goal in mind and at the moment it's not clear what you are even applying for.",
      "author": "OrbitalPete",
      "created": 1629012784,
      "upvotes": 38,
      "replies": {
        "h91q8lg": {
          "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h91q8lg/",
          "text": "Fully agree with this and personally I don't like it when people start their email \"my name is\" - your email literally told me this when it landed in my inbox and you signed your name at the bottom. \n\nAs a rule of thumb you should always tell the reader why you're writing by the end of the first paragraph - ie I'm looking to do a master's, have a research proposal and wondered if you'd be interested in supervising.\n\nThe other thing OP needs to consider is if cold emails are an allowed route into a masters. The admissions process may require an application through the university.",
          "author": "ACatGod",
          "created": 1629045357,
          "upvotes": 7,
          "replies": {
            "h926olh": {
              "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h926olh/",
              "text": "A lot of places do both cold emails and a formal app. I agree that OP really needs to know what the process is for each potential position though.",
              "author": "mediocre-spice",
              "created": 1629052240,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h908q3e": {
      "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h908q3e/",
      "text": "You haven’t stated clearly that you want a MRes position in your letter. Also the first question you ask is about waste management projects. \nState clearly at the start that you are wishing to do a masters of research, that you are interested in X type of project and that you attach a draft research proposal for their reference. Good luck with your applications.",
      "author": "GalwayGirlOnTheRun23",
      "created": 1629012116,
      "upvotes": 21,
      "replies": {}
    },
    "h90aco3": {
      "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h90aco3/",
      "text": "It's a lot. You have 3 different non-specific requests and 4+ attachments. I'd pare it back to one yes/no question (are there opportunities for master's in a specific time frame?) and your cv. \n\nThis would be plenty: \"Dear so-and-so, I'm an engineer who specializes in x planning to pursue a master's. I like your research on y and am curious about/have written a proposal exploring (proposal topic). Are you planning to take master's students in the next year? If so, I'd love to discuss the opportunity further. Thank you for your time.\"",
      "author": "mediocre-spice",
      "created": 1629013443,
      "upvotes": 19,
      "replies": {
        "h90ahyg": {
          "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h90ahyg/",
          "text": "Would you advice I attach all these documents along or just certain documents ?",
          "author": "DarkID1",
          "created": 1629013564,
          "upvotes": 1,
          "replies": {
            "h90b5mu": {
              "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h90b5mu/",
              "text": "Just cv. Maybe an abstract/summary version of the proposal, especially if a proposal is part of admissions at that school.",
              "author": "mediocre-spice",
              "created": 1629014095,
              "upvotes": 11,
              "replies": {
                "h90bd4k": {
                  "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h90bd4k/",
                  "text": "Thank you",
                  "author": "DarkID1",
                  "created": 1629014264,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h90f8ap": {
      "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h90f8ap/",
      "text": "What you are after - a Masters position - should be in the first sentence of your email.  In fact, reading your email, it seems this is not even explicitly stated (its only in your blurb above the \"Dear Professor\").\n\nThe second problem is that you block yourself into a corner.  Say I do have a position free - but it is not exactly on what you are interested in.  Or even I have something completely different - would you be interested?  From your letter, apparently not.\n\nFinally, you are not after a \"collaboration\" - you are after a learning position.",
      "author": "Life_time_learner",
      "created": 1629017677,
      "upvotes": 19,
      "replies": {
        "h90hmdk": {
          "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h90hmdk/",
          "text": "Thank you, I really appreciate your help and the feedback.",
          "author": "DarkID1",
          "created": 1629019852,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h90v3rq": {
      "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h90v3rq/",
      "text": "In addition to others’ excellent comments: nothing here explains why you are emailing *me*. Anything that reads as if you are sending the same thing to thousands of different potential supervisors goes in the bin. I don’t expect you to be an expert in my field but I expect you to be able to say something more than that my research is “interesting”.",
      "author": "aant",
      "created": 1629030446,
      "upvotes": 10,
      "replies": {
        "h90ygd5": {
          "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h90ygd5/",
          "text": "Thank you, I really appreciate the feedback. I usually read their research extensively, especially their methodology which i find myself very interested in. Do i talk about this and what i learnt from them? Or would it be too lengthy?",
          "author": "DarkID1",
          "created": 1629032481,
          "upvotes": 3,
          "replies": {
            "h918fee": {
              "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h918fee/",
              "text": "You don’t want it to be too long but methodology is a great thing to mention. “I have read some of your work using underwater basket weaving and am very keen to learn this technique myself, because I hope to pursue a career in submarine handicraft.”",
              "author": "aant",
              "created": 1629037660,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "h90mcmi": {
      "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h90mcmi/",
      "text": "In addition to the helpful posts above, I would also avoid wordiness. Professors get hundreds of emails, and if they see a wall of text, they switch off and disregard it. Heck, I do. No one has time for that.",
      "author": "Tortured_scientist",
      "created": 1629023979,
      "upvotes": 7,
      "replies": {}
    },
    "h92kdsh": {
      "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h92kdsh/",
      "text": "I get a lot of cold emails from prospective students and I wouldn't ignore yours but I would eye-roll and would certainly get me disinterested. All others here have given plenty of correct advice. I would also say that I want to see specific evidence that they looked into my research and want to do something that I'm actively doing. I also want to see how they could contribute with skills and/or knowledge. There is very little gain in writing generic email to lots of people. \nAlso, don't ask for a meeting upfront. Nobody wants yet another meeting. If the person is eventually interested in you, they will ask for a meeting.",
      "author": "WhoMeNoMe",
      "created": 1629058183,
      "upvotes": 3,
      "replies": {}
    },
    "h90o84p": {
      "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h90o84p/",
      "text": "1) too long\n2) too generic\n3) no substance\n4) no personality \n\nYou basically get three sentences.  One of those should say something about you. One should say something (substantive) relevant about their research or honest about your thinking toward it.  The third should be to setup a meet.",
      "author": "DesertAlpine",
      "created": 1629025510,
      "upvotes": 5,
      "replies": {
        "h90sbys": {
          "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h90sbys/",
          "text": "I thought if i highlighted more about myself it would be lengthy and since its covered in my cv.",
          "author": "DarkID1",
          "created": 1629028584,
          "upvotes": 2,
          "replies": {
            "h90ti1e": {
              "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h90ti1e/",
              "text": "Three sentences is what you get. How many sentences is yours?  \n\nJust my advice, kid. Take it and make it. Or find another way.  I’m sure there are others.",
              "author": "DesertAlpine",
              "created": 1629029392,
              "upvotes": 4,
              "replies": {
                "h94ikqu": {
                  "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h94ikqu/",
                  "text": "Thanks a lot... I really appreciate the feedback and advice.",
                  "author": "DarkID1",
                  "created": 1629093690,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h928ygh": {
      "link": "/r/AskAcademia/comments/p4owq0/i_have_been_writing_cold_mails_to_professors_a/h928ygh/",
      "text": "   I suspect Prof believes you have to find your own research topics.\n \n  You are working in private industry- you are not a doctoral student with a dissertation committee and chair. \n \n If profs work is published you need not meet or discuss the work with him.\n  \n If you feel you can add to the research and field you can cite the published work as the impetus for your work. \n\n  You really just need a Master's thesis- go to your university library and look at what others have done in a similar area.  \n\n If you are writing to people who do not respond you can assume they will not respond and move on.\n\n  Get the Master's paper done and move on.\n \n When you finish your Master's do some adjunct teaching, preferably not in the US, to make sure you enjoy teaching before enrolling in a doctoral program.  \n\n US public schools are very behind other countries.   Remember garbage in-garbage out?",
      "author": "TSIDATSI",
      "created": 1629053214,
      "upvotes": -1,
      "replies": {}
    }
  }
}