{
  "sid": "oy4jf1",
  "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/",
  "title:": "When do you know it's time to leave? Return from parental leave",
  "text": "I've just come back from mat leave, and I think like with any life changing event (having a baby, death in the family etc. etc.), it makes you view the world in an entirely different light. \n\nI've come back part time which was an excellent decision. But I dread my working days. I'm getting emails about projects that need to be done NOW for some reason. And I'm sitting here thinking, what's the point? How is this work helping people in the community? Why is everything due NOW? Is this just academics keeping busy for the sake of keeping busy?\n\nFor context I did my phd in 3 years and published a bunch of papers, and could count on my hand how many times I worked outside of office hours in that time. So being 'busy' to me doesn't equal 'productive'.  I'm also in Australia so we get paid pretty well and have generous mat leave.\n\nAnyway, I started a business while I was a mat leave, but its going to be years before it's profitable. I'm actually pregnant now with our second baby so will be going back on mat leave in about 7 months so feel like I should just stick it out. I ask my husband about 5 times a day if I can quit though lol. \n\nIs it just the transition back from maternity leave? Or is it something else?! I don't want to waste my life being sucked in to being stressed out about meaningless projects. I don't know if my ramblings make any sense. But I'm sure I'm not the only one!\n\nAny other academics who are parents who had a bit of a change of heart after having a baby?",
  "author": "Mysterious_Spring945",
  "created": 1628117851,
  "updated": 1634080008,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.91,
  "comments": {
    "h7qkstm": {
      "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/h7qkstm/",
      "text": "[deleted]",
      "author": null,
      "created": 1628118516,
      "upvotes": 11,
      "replies": {
        "h7qmphn": {
          "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/h7qmphn/",
          "text": "Thank you for your perspective! Yeah, I look at my supervisor and the other senior academics and I really don't want to be like them. They are all stressed, doing long hours of work, and doing work that I don't particularly find exciting. I guess it doesn't mean I have to be like them necessarily, but I think its easy to get sucked in to get that next big grant. The business that I'm building is really exciting though and I'd love to rely less on an employer over time.",
          "author": "Mysterious_Spring945",
          "created": 1628119412,
          "upvotes": 5,
          "replies": {
            "h7qqew5": {
              "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/h7qqew5/",
              "text": "[deleted]",
              "author": null,
              "created": 1628121158,
              "upvotes": 8,
              "replies": {
                "h7ri3dz": {
                  "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/h7ri3dz/",
                  "text": "Such good advice. Thank you so so much!! You must be such a good mentor!! Haha, yeah I love being a scientist too and adding to the knowledge base :).",
                  "author": "Mysterious_Spring945",
                  "created": 1628134754,
                  "upvotes": 3,
                  "replies": {
                    "h7s1io9": {
                      "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/h7s1io9/",
                      "text": "u/additional-squash-69 is totally right. For me I saw peripheral activities my PI was doing and was interested in those. Initially I thought I'd become a PI who does lots of outside activities but in the end I realised I was more motivated by the other stuff than being a PI and have built a career doing that while remaining in the academic sector. No regrets.",
                      "author": "ACatGod",
                      "created": 1628147656,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h7t8s9m": {
      "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/h7t8s9m/",
      "text": "Hey, if you’re on Facebook I highly recommend the Professor is Out group! Lots of people who have left to start their own business, etc. who may have some insights for you. Also, despite the name, has a lot of people still in academia and isn’t completely “everything in academia is bad and everywhere else is good” - many have been out for years and recognize the pros and cons of each.",
      "author": "womanaction",
      "created": 1628174062,
      "upvotes": 5,
      "replies": {
        "h7vjyev": {
          "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/h7vjyev/",
          "text": "Oooooo I love that!! Thank you so much. Joining rn!!!",
          "author": "Mysterious_Spring945",
          "created": 1628209506,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7v34jk": {
      "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/h7v34jk/",
      "text": "I’m a dad and I don’t necessarily think it’s directly related to being a parent, but I’m also really feeling the absolute futility and uselessness of my position in student affairs. I think my situation is due to rounding the corner to middle age.\n\nBut I have a pretty great job and nothing else really seems appealing either. I think I just honestly don’t want to need to have a job lol.\n\nSome days I feel like I get massive accolades and appreciation from colleagues. Other days it feels like no one respects me and I can’t do anything right. At the end of the day it’s all such horseshit. These students don’t need or want all these ridiculous programs we insist are beneficial and effective and important.\n\nI currently feel very bipolar in my work. It’s like a 3-4 day cycle of loving and hating it.",
      "author": "ilikeyoohoo",
      "created": 1628201480,
      "upvotes": 2,
      "replies": {
        "h7vjuwm": {
          "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/h7vjuwm/",
          "text": "Haha I know exactly what you mean!! It's so up and down. The year before mat leave I applied for countless grants, I think 10 and didn't get any of them. Then I get back from mat leave and fill out a single form as someone returning from parental leave and got awarded money to continue my research. I had to laugh. It's like bread crumbs keeping you interested. \n\nI feel like for the both of us we are working to live. So once our work day is done we should try and forget about work and be with our family/do something we enjoy instead",
          "author": "Mysterious_Spring945",
          "created": 1628209458,
          "upvotes": 2,
          "replies": {
            "h7vll6f": {
              "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/h7vll6f/",
              "text": "> I feel like for the both of us we are working to live. So once our work day is done we should try and forget about work and be with our family/do something we enjoy instead\n\nAbsolutely. For the most part, I’m pretty good at that. But sometimes work stuff does loom over me. \n\nIt’s definitely hard to force a change when you’re uncertain if it’s the best decision. I’m currently grappling with that.",
              "author": "ilikeyoohoo",
              "created": 1628210317,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h7v914u": {
      "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/h7v914u/",
      "text": "Don't let anyones self-inflicted crises waste your time. Most of the time things that are due NOW were known about before, or are intentionally held back until the last minute to get people to agree to things they otherwise wouldn't do. Safety emergencies and equipment outages are the only times in the my 25 years that have required my immediate attention.",
      "author": "Tossoff420",
      "created": 1628204172,
      "upvotes": 2,
      "replies": {
        "h7vj3g3": {
          "link": "/r/AskAcademia/comments/oy4jf1/when_do_you_know_its_time_to_leave_return_from/h7vj3g3/",
          "text": "Oh totally!!! I got asked to put together some exam questions by the 11th of this month because they are desperate!! I asked them weeks ago whether they needed exam questions and they told me no...ahh wtf lol\n\nNo has become my favourite word haha",
          "author": "Mysterious_Spring945",
          "created": 1628209080,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}