{
  "sid": "mgrsso",
  "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/",
  "title:": "Is it a career killer to attend the same school as undergrad for a PhD?",
  "text": "I've been in my current physics research group at an R1 state school for a year. The problem we're working on is a long-term problem that I find inspiring and important. I've also received really strong mentorship here. I got into another school where they'd like me to work on the same problem, if I choose to go there. They said they'd like to collaborate even if I don't go there. I'm not married to the idea of an academic career, but I would consider it if I felt I was competitive. Logistically, staying at my current school would be easier, and I have momentum. Would staying at my current institution be a bad decision? Or is the important thing that I work with other groups of people and broaden my horizons?",
  "author": "Virtual-Aioli",
  "created": 1617143575,
  "updated": 1634080811,
  "over_18": false,
  "upvotes": 174,
  "upvote_ratio": 0.94,
  "comments": {
    "gsuqvuh": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsuqvuh/",
      "text": "I use to hear that was a killer but don't anymore. And when i was on the job market I dont' think many even knew where I did my undergrad (I had gone to different places). I think there are benefits for going elsewhere, but I don't think it'll hurt you if you don't. Go where you think you can be most successful. \n\nIt's funny because I do still hear all the time don't stay in place from PhD to postdoc to faculty position, but man, departments of full of hiring their own!",
      "author": "AwkwardAccountant5",
      "created": 1617144437,
      "upvotes": 161,
      "replies": {
        "gsva1py": {
          "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsva1py/",
          "text": "Yea I also hear this all of the time, but agree that there’s something to be said about departments hiring internally. My PhD advisor did his undergrad, PhD, a short postdoc, assistant professor and is now an associate professor all at the same university! (an R1 in the northeast US).  I think it’s generally preferable to have moved to a new lab at some point as committees will view this as an ability to work independently rather than just piggy backing off your PI the whole time, but I don’t think it’s always necessarily a bad idea to stay at the same school",
          "author": "Dr_Funky",
          "created": 1617154673,
          "upvotes": 51,
          "replies": {
            "gsvf702": {
              "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvf702/",
              "text": "Having moved from one institution to another between PhD and post doc, I will say there is a TON to be gained from working in a new environment, especially if it is a different line of work. I don't know if the gain is quite the same for you as an individual between post doc and faculty, but the gain is definitely there for the department when hiring external. You bring a new line of expertise to a department. Otherwise if you stay in house you will always be considered a mini PI of your post doc mentor (unless you take a huge leap away in research direction which most do not). So you don't really have much new to offer.\n\nFor undergrad to PhD, I don't think it matters much at all. It's too different a training to compare. Just take the offer that will bring the most success.",
              "author": "ActionXPotential",
              "created": 1617157511,
              "upvotes": 36,
              "replies": {
                "gtd7ffc": {
                  "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gtd7ffc/",
                  "text": "Second the postdoc move. For undergrad, if anything, it can give you a head start to stay in the same lab if you’re getting good mentorship. At the postdoc stage, make yourself uncomfortable and switch. Your network will grow immensely.",
                  "author": "Jaxococcus_marinus",
                  "created": 1617557825,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gsvqv1f": {
          "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvqv1f/",
          "text": "Yeah, when I was in grad school, there was one professor associated with our program who did his undergrad, PhD, postdoc, and then went on become a professor all at that same university. He just literally came and never left. He’s had a successful career so it doesn’t seem to have hurt him. Then again, it’s just an anecdote and may be just a fluke, so do with that what you will.",
          "author": "snazzyscientist",
          "created": 1617164666,
          "upvotes": 14,
          "replies": {
            "gsvyzi2": {
              "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvyzi2/",
              "text": "Those were also different times, though. The job market changed a lot, especially in recent years.",
              "author": "Sickened_but_curious",
              "created": 1617170892,
              "upvotes": 8,
              "replies": {
                "gt101kz": {
                  "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gt101kz/",
                  "text": "n=1 is not considered representative and no conclusion can be drawn out of it",
                  "author": "miarao",
                  "created": 1617282757,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gsurtns": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsurtns/",
      "text": "I think it varies a lot between disciplines and other contexts, but this is how I see it.\n\nResearch is research. If you invent a cure for cancer, I don't care if you have worked in different institutions or not. (How mobile were Darwin, Einstein and Wittgenstein? Did it matter?)  Your versatility, narrowness, broadness etc. is pretty much exclusively shown in your published research, in my opinion. This goes for content as well as for co-authors, though. If someone has only published together with one or two others over the years, I may worry a bit about that person's potential as an individual researcher.\n\nWhen it comes to teaching and admin, I tend to see \"mobility\" as a strong plus in itself. When I review applicants for tenure, solid volumes of experiences from different institutions matter - but basically mostly if all things are equal regarding teaching/admin quality. (A good teacher with mostly \"local\" experience is better than a poor teacher who has traveled the world!)",
      "author": "molobodd",
      "created": 1617144933,
      "upvotes": 52,
      "replies": {
        "gsv1ann": {
          "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsv1ann/",
          "text": "This person said everything I came here to say and more.",
          "author": "superchristopherism",
          "created": 1617149917,
          "upvotes": 8,
          "replies": {}
        },
        "gsus6kl": {
          "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsus6kl/",
          "text": "Can I ask why you view mobility in itself so positively?",
          "author": "Virtual-Aioli",
          "created": 1617145122,
          "upvotes": 14,
          "replies": {
            "gsutgxe": {
              "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsutgxe/",
              "text": "We are all super experts in our respective fields, but we are all (relative) hacks when it comes to 70+ % of our real life work - i.e. teaching, admin and management.\n\nWe spend decades on cutting edge research in our respective discipline, but when it comes to the main part of the job (quantitatively) we basically just wing it with the help of reiterations of existing traditions. \n\nFrom that perspective, other lived experiences can make a huge difference. \"No. That is not the only way to do it. When I worked at X, we solved this problem by way of Y.\" \n\nA department dominated by local inbreeds run a serious risk of stagnation when it comes to teaching and management. (They may still find the cure for cancer, though...)",
              "author": "molobodd",
              "created": 1617145803,
              "upvotes": 66,
              "replies": {}
            }
          }
        }
      }
    },
    "gsusv16": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsusv16/",
      "text": "Definitely not a killer! I know folks who have done their undergrad and grad degrees at the same institution and done fine. \n\nI personally have switched university for each of my degrees (currently doing my master's at a different university than I did my undergrad at and will be starting my PhD in September at yet another university). In my experience, there are few plus sides I've found to changing universities:\n\n* more connections with researchers at the new university\n   * while you mentioned they would still want to collaborate, you likely wouldn't get to know other people in their department\n* opportunity to pick up new skills\n   * while the project sounds as though it would be the same, research groups within the same discipline do things differently\n   * important because you never know what skills you'll need in your career\n* more \"life\" experience\n   * experiencing a new city is great, you might find a new hobby or extracurricular",
      "author": "poniesgirl",
      "created": 1617145483,
      "upvotes": 38,
      "replies": {
        "gsvethx": {
          "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvethx/",
          "text": "I agree 100%, it is definitely not a \"killer\". I did my BS, MS and PhD all in the same university, then went to another one for a postdoc and now am a TT in a R1 university (in STEM). I feel if one does PhD and postdoc at the same place it's much more harmful. In my experience few people care about where you did your undergraduate once you have a PhD.",
          "author": "newpua_bie",
          "created": 1617157298,
          "upvotes": 9,
          "replies": {}
        },
        "gswufoq": {
          "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gswufoq/",
          "text": "Totally agree with these advantages. I changed university b/w BS, MS, PhD, postdoc and my current R1 TT position and met great new people each time. In my field (STEM), each school has its own collection of niche subject experts and that really stretched me.\n\nThat said, a friend in my same field did BS/MS/PhD at the same university (postdoc elsewhere) and is now a rising star with a TT job. I think his advantage was unbroken momentum. He had many projects that he continued to develop during that entire period. Each time you move, you learn new things, but there's a transitional period.\n\nSo, play to the situation and you can thrive either way!",
          "author": "hydronater",
          "created": 1617196914,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gsuvmy5": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsuvmy5/",
      "text": "many people are saying schools love to hire their own.\n\nso, if you do undergrad at one school,  grad at another, post doc at a third,  that's three schools that would love to hire you because you are one of their own.    nice.",
      "author": "arachnidtree",
      "created": 1617146929,
      "upvotes": 51,
      "replies": {
        "gsv9hhd": {
          "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsv9hhd/",
          "text": "Right! And the more friends you've made along the way for future collaborations!",
          "author": "rockdoc6881",
          "created": 1617154369,
          "upvotes": 18,
          "replies": {}
        }
      }
    },
    "gsve93c": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsve93c/",
      "text": "Not a career killer, but I do advise looking elsewhere. \n\nIf you're young and do a PhD you're basically spending the first ten years of your adult life on college campuses. The best you can do to experience more of the world is to travel a bit or go to a new city or a new school. \n\nSeeing how another place does things, meeting new people, and making new friends is a very important experience, and traveling for a PhD helps with that.",
      "author": "fleemfleemfleemfleem",
      "created": 1617156979,
      "upvotes": 7,
      "replies": {}
    },
    "gsuxc9l": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsuxc9l/",
      "text": "No, that's an antiquated point of view, based on conversations with professors at both institutions I've been at.\n\nThough I am a proponent of new schools in terms of exposure to new researchers, and exploring a new city gives a good nudge towards making it a new little chapter of life outside of school.",
      "author": "sanctifiedbacon",
      "created": 1617147815,
      "upvotes": 18,
      "replies": {}
    },
    "gsvcqva": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvcqva/",
      "text": "I’ve never heard of this.  We have plenty of undergrads who stay for grad.  The much more common advice is not to do your postdoc at the same place as your PhD.",
      "author": "Useful_Bread_4496",
      "created": 1617156143,
      "upvotes": 5,
      "replies": {
        "gt1vaxh": {
          "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gt1vaxh/",
          "text": "Yeah, my advisor went to the same place for her undergrad in PhD. That's not really an issue, but yes, it is rare that people get TT jobs or postdocs in the same department - internal hires are rare and it's typically frowned upon. However, I know someone who got her PhD in a different department/school at my university who is now a postdoc in my department, though that's much different than staying in the same department as a postdoc.",
          "author": null,
          "created": 1617297563,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gsv1dh3": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsv1dh3/",
      "text": "Go with whoever is funding you",
      "author": "yourmomdotbiz",
      "created": 1617149959,
      "upvotes": 21,
      "replies": {
        "gswuj9i": {
          "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gswuj9i/",
          "text": "This. I stayed at my undergrad university for a PhD because I got offered full funding + accommodation + salary.",
          "author": "sirophiuchus",
          "created": 1617196968,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gsvkjyk": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvkjyk/",
      "text": "The far more influential career killer is that there are far less academic jobs than applicants by the time you will hypothetically finish your program (unless your plan is to go into private industry/corporate). Everything else will probably have a marginal influence on most people's career trajectories.",
      "author": "alwayssalty_",
      "created": 1617160632,
      "upvotes": 4,
      "replies": {}
    },
    "gsurz2p": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsurz2p/",
      "text": "I can’t answer this generally but my I will give a little of my own experience.\n\nI work in both the Microbiology and Food Science departments in a R1 university in the southeast US. Over the past 4 years or so that I have been a grad student I get an email every time a new faculty (teaching and research) is hired by the departments. In these emails they give background for the new hires including where they went to school for undergrad/grad/postdoc. I would say roughly 60% of the hires went to our school for a degree or postdoc and maybe 30% have a degree and postdoc from our school.\n\nMaybe it’s a southern thing but my school loves to hire their own. Why wouldn’t they? They know how good you are, they know if you get along with students/faculty, you likely have recommendations from their own faculty, the hiring committee members might know you personally, and they know if you will fit into the school culture better than they ever could from a few interviews.",
      "author": "HMHype",
      "created": 1617145011,
      "upvotes": 7,
      "replies": {
        "gsv9p34": {
          "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsv9p34/",
          "text": "In my experience (Geology), my former department automatically (off the record) disqualified people who got their PhD from there. They thought it was improper to hire from their own PhD pool.",
          "author": "rockdoc6881",
          "created": 1617154483,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gsv1c65": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsv1c65/",
      "text": "Not if it’s a good school for your PhD area.",
      "author": "Crazy-Analyst",
      "created": 1617149939,
      "upvotes": 8,
      "replies": {}
    },
    "gsuxjg4": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsuxjg4/",
      "text": "Emphasizing it really depends on the expertise. In my area of archaeology, there’s pretty much one person in the States who has published extensively. I got lucky to have met her in undergrad and continue working with her.",
      "author": "cattail31",
      "created": 1617147920,
      "upvotes": 3,
      "replies": {}
    },
    "gsvkiof": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvkiof/",
      "text": "If you're at a big name school like Harvard, MIT, Caltech, Stanford, etc. then no. Not a career-killer. Stay there because \"academic pedigree\" is a real thing that most faculty search committees value more than they should. Anyway...\n\nIf you're at another R1 school, then it might not. But here's my experience/take on this: I had really, really great mentorship at my undergrad institution and I wanted to stay, but after three years in his lab, my advisor said \"Its time for you to go and see how they do it elsewhere, that's how you become a better scientist\". I didn't believe him at first, but I'm now at a different institution doing my PhD. I'm in my first year here and have learned so much. We're doing the same type of research here, but in different ways. Even the way we use the same instruments is radically different. The other members of my lab are from other places too and so I get to learn about how they did things differently elsewhere as well. I've also gotten the chance to learn how to work with new people as opposed to my previous advisor and his close group -- and this has also opened up new avenues for interdisciplinary collaboration. \n\nAs cheesy as it sounds, it has broadened my horizons and made me think about my entire field in a different way.",
      "author": "diskprept",
      "created": 1617160611,
      "upvotes": 3,
      "replies": {}
    },
    "gsvccm5": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvccm5/",
      "text": "Complete myth! I did my BS, MS, and PhD in engineering at the same university and just got a TT offer at an R1.",
      "author": "imaginekat29",
      "created": 1617155929,
      "upvotes": 9,
      "replies": {
        "gswh9ma": {
          "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gswh9ma/",
          "text": "I think if you’re doing all three at MIT or Stanford it’s different.",
          "author": null,
          "created": 1617187610,
          "upvotes": 2,
          "replies": {
            "gswhxzl": {
              "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gswhxzl/",
              "text": "While it is true that MIT and Standford have more traditional hitting practices and paradigms around diversifying experiences, the university I attended and the university I received the offer from are the same Tier. If you are a great researcher who publishes, it doesn't matter where you came from.",
              "author": "imaginekat29",
              "created": 1617188218,
              "upvotes": 2,
              "replies": {
                "gswibv9": {
                  "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gswibv9/",
                  "text": ">\tIf you are a great researcher who publishes, it doesn’t matter where you came from.\n\nAbsolutely right. Where you attend is very often based on privilege. The research you do as a professor is where your real qualities are revealed.",
                  "author": null,
                  "created": 1617188559,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gsvbxv4": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvbxv4/",
      "text": "Mobility is basically mandatory. Preferably international, but within country is better than nothing.\n\nIn the old days you used to go do a PhD elsewhere but nowadays internships or researcher exchanges are a lot easier to organize.\n\nBasically the idea is that you're exposed to other people than your advisor and the 3 students you've been together with for a decade.\n\nAn internship at a non-academic organization and a 3 month researcher visit across the planet & cultures is a lot more valuable than going across town that is technically a different university.\n\nI for example went to Japan for a summer to work with a dude I met at a conference and published a few papers with them and they had a few people visit our lab for a few months and now we got frequent exchanges between our two universities.",
      "author": null,
      "created": 1617155707,
      "upvotes": 7,
      "replies": {
        "gswh6wc": {
          "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gswh6wc/",
          "text": ">\tPreferably international\n\nThis is definitely true in Europe and Asia but Americans are pretty insular (no offence, Americans) and not only do they not reward cosmopolitanism, they seem to punish it. I did my master’s at Oxford and I’ve had Americans tell me it “might not be accepted” by US academics.\n\nMost Americans don’t even leave America. They don’t have the time to travel or any interest in the world outside their own borders.",
          "author": null,
          "created": 1617187540,
          "upvotes": -3,
          "replies": {}
        }
      }
    },
    "gsv2izk": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsv2izk/",
      "text": "It really depends. There are tons of geniuses in many fields that did their PhDs in their alma maters. However, it's worth mentioning that most of these were in top tier schools, and mostly in the West",
      "author": "aNu2001",
      "created": 1617150582,
      "upvotes": 2,
      "replies": {}
    },
    "gsv7g0e": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsv7g0e/",
      "text": "This is not a problem at all in my field, as having momentum and making continued progress matter most. Funding to do an RA (not TA) with proper levels of focus matters, too, and I'm presuming that is part of the offer; if not, though, consider selecting the option with funding. In any case, it is fairly common to stay for a PhD, especially if you are at a school with a strong program aligned with your interests. Do keep in touch with the \"another school\" for a paper or two, and consider that they might be a good target for postdoc opportunity later.",
      "author": "Jon3141592653589",
      "created": 1617153272,
      "upvotes": 2,
      "replies": {}
    },
    "gsve2ds": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsve2ds/",
      "text": "No. If you have a strong dissertation / research profile, nobody cares about your undergrad when it comes to hiring.",
      "author": "tegeus-Cromis_2000",
      "created": 1617156873,
      "upvotes": 1,
      "replies": {}
    },
    "gsvg5u6": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvg5u6/",
      "text": "Nope. I did it (N=1) and I consider myself extremely successful in my academic career.  For context, I am a neuroscientist at an R1, medical campus. Being clear about your reasons and being able to justify your choices helps but I feel like generally, folks are becoming increasingly accommodating of life/personal reasons for staying out.",
      "author": "ScientistLiz",
      "created": 1617158063,
      "upvotes": 1,
      "replies": {}
    },
    "gsvstz6": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvstz6/",
      "text": "I spoke to my previous advisor about that and while I stopped at my MS, we both thought the same thing- \"if it ain't broke, don't fix it.\"  I feel like if you have something good going where are you are right now, which it certainly sounds like you do with good mentorship, see how far that takes you.  I think there's something to be said about learning to work with different people and mentoring styles, bt it sounds like you've got something special here.",
      "author": "stanpiotrowski",
      "created": 1617166095,
      "upvotes": 1,
      "replies": {}
    },
    "gsvytux": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvytux/",
      "text": "Not a killer but moving definitely is something committees like to see, especially if you manage to pad up your pedigree with it. This doesn't have to be between undergrad and PhD, though it can help, too.   \nMoving labs and especially counties are seen as a positive since it means you were exposed to different cultures (lab and country) and were exposed to different ideas, which helps you build your own, instead of just repeating what your one and only PI preached.  \nIt's also a good way to pad up your pedigree, which can have a huge impact on your career and helps building your network, which again will be a huge factor.  \nThe main factor is sadly still luck, I know many great and competitive people who are stuck in Postdoc hell and even though there no big issues with their CV they just don't get anywhere.\n\nAlso don't fall for the trap of looking how current (especially older) PIs did it. These were different times, untess they very recently became a PI their path is nothing to go by. The job market was very different back, especially now that the pandemic killed even more of the market.",
      "author": "LittlePrimate",
      "created": 1617170788,
      "upvotes": 1,
      "replies": {}
    },
    "gswf2xj": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gswf2xj/",
      "text": "In my field - public health - absolutely not. It’s more and more common actually.",
      "author": "debacchatio",
      "created": 1617185522,
      "upvotes": 1,
      "replies": {}
    },
    "gswhpsz": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gswhpsz/",
      "text": "In my experience, people who attended the same school have more time to build connections and eventually find a job faster. But in reality, I think it should be the opposite. In my opinion showing that you thrived as student in different contexts should be an asset.",
      "author": "Normal_Kaleidoscope",
      "created": 1617188014,
      "upvotes": 1,
      "replies": {}
    },
    "gswop76": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gswop76/",
      "text": "What about countries with fewer top universities?\n\nFor instance, a Hungarian staying at ELTE their whole \"learning\" career, then moving abroad for post-doc?",
      "author": "Hoihe",
      "created": 1617193435,
      "upvotes": 1,
      "replies": {}
    },
    "gswp8cf": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gswp8cf/",
      "text": "I did my undergrad, Master's, and PhD all at the same school, and am now tenured at a different school (for context, I got my PhD in 2012, and I did a postdoc after my PhD at a different school). It's definitely not a killer, but you absolutely need to make sure that you network with people from other areas. I spent two semesters of my PhD at other schools working with other professors, and I networked like hell at conferences.",
      "author": "plumpvirgin",
      "created": 1617193786,
      "upvotes": 1,
      "replies": {}
    },
    "gswypjg": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gswypjg/",
      "text": "Absolutely not. This is an old school mindset that doesn’t really apply anymore. The most important thing about your PhD is quality of your supervisor and how productive you are. If your current school has a great situation, go there. If/when you consider academia as a career path, then venture outside this school for a post doc to demonstrate you can be productive and successful in different environments.",
      "author": "WhoCaresWhyBother",
      "created": 1617199200,
      "upvotes": 1,
      "replies": {}
    },
    "gsx25bv": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsx25bv/",
      "text": "Not necessarily, but I wouldn't do it unless it's a very good school. You should go to the highest ranked Ph.D. program that you can get into, period. Yes, moving is inconvenient, but it can make a huge difference on your future employability, coauthor network and earning potential.",
      "author": "fsu23phd",
      "created": 1617200910,
      "upvotes": 1,
      "replies": {}
    },
    "gsx32te": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsx32te/",
      "text": "Completed my undergrad and PhD at same institution. Had no problem finding academic positions.",
      "author": "KenReid",
      "created": 1617201357,
      "upvotes": 1,
      "replies": {}
    },
    "gt3q1cj": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gt3q1cj/",
      "text": "I never understood this Reddit for stuff like this. People say not to do this and to make sure you go to a different school for each step of your academic career. Now they're saying its an old wives tale.\n\nYet I attend a very high ranking Canadian University and at least half of my profs did their bachelors, masters, PhD and post doc at less than 2 institutions (some of them even just 1). I would say it's not necessary whatsoever.",
      "author": "fireguyV2",
      "created": 1617331358,
      "upvotes": 1,
      "replies": {}
    },
    "gsvfcyn": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvfcyn/",
      "text": "No. The important thing is what you accomplish during your Ph.D. Staying in the same lab after a Ph.D can limit your opportunities to learn new things but hey you do you. Publishing is how people measure your value when they look at your CV.",
      "author": "ale890",
      "created": 1617157604,
      "upvotes": 0,
      "replies": {}
    },
    "gsvg1kf": {
      "link": "/r/AskAcademia/comments/mgrsso/is_it_a_career_killer_to_attend_the_same_school/gsvg1kf/",
      "text": "No.",
      "author": "PersonalZebra8993",
      "created": 1617157996,
      "upvotes": 0,
      "replies": {}
    }
  }
}