{
  "sid": "qlut64",
  "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/",
  "title:": "Deciding between two faculty job offers: prioritize salary or opportunity for advancement?",
  "text": "Hi all, I am deciding between two institutions in two very different locations. One offer is for a research assistant professor position so the salary is quite low. Other than the low pay and non-tenure position, it’s a dream. Great mentorship, tons of data, amazing collaborators, lots of internal funding available, and I’m told, high probability of transitioning to tenure-track within the first two years. The other offer is for a tenure-track assistant professor position with a 6-figure salary (although in a slightly higher cost-of-living area). But I would be so much more solitary…there would be mentorship, but not in my exact discipline. Although I’d have start-up funds, I’d really have to make connections and build collaborations independently whereas with option 1, it would be much more organic. I’m torn and change my mind daily. Does anyone have any words of wisdom?",
  "author": "cmb1588",
  "created": 1635947166,
  "updated": 1636136911,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 0.9,
  "comments": {
    "hj5fhed": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj5fhed/",
      "text": "If you are open to  negotiating on your own behalf, you should let the non-tenure track institution know you are leaning toward declining in favor of a tenure track offer elsewhere.  \n\n(Note :  I have a strong bias toward the real opportunity for tenure vs some dangled promise that may not materialize).",
      "author": "crkrshx",
      "created": 1635949029,
      "upvotes": 59,
      "replies": {
        "hj61rln": {
          "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj61rln/",
          "text": "> and I’m told, high probability of transitioning to tenure-track within the first two years\n\nKey words, *you're told,* means zilch if it's not in writing. Tell them about your other offer. Worst case scenario, they back out, which means they were never going to convert to TT anyway.\n\nI don't think the mentorship matters as much as you do, but I don't fully know your situation. And it would be a bit crazy to turn down the security of TT unless there are red flags. I'd also strongly consider quality of living for each place, and things like your probable commute, etc.",
          "author": "scintor",
          "created": 1635957662,
          "upvotes": 37,
          "replies": {
            "hj7797u": {
              "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj7797u/",
              "text": "This. Even if the admin have good intentions and are being honest with you, they cannot control the faculty line possibilities a few years from now. A tenure-track position with them is not guaranteed. They might even have a tt line open that they fill with someone else. One question to ask yourself is how you will feel if you take the non-tt job and it does not turn into a tt job at all, or if they string you along for more years.",
              "author": "professorbix",
              "created": 1635973474,
              "upvotes": 8,
              "replies": {
                "hj9nuks": {
                  "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj9nuks/",
                  "text": "\"They might even have a tt line open that they fill with someone else\"\n\nIndeed. It's possible that they're not even allowed to just give a tt position to a current employee, but are required to do a public search for a candidate.",
                  "author": "ProfOnTheMove",
                  "created": 1636024377,
                  "upvotes": 3,
                  "replies": {
                    "hja1nzt": {
                      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hja1nzt/",
                      "text": "We have a faculty now who is in the position that was theoretically slotted for someone else. They were required to have a public, open search and decided to pick someone external.",
                      "author": "professorbix",
                      "created": 1636032174,
                      "upvotes": 3,
                      "replies": {
                        "hjcdak3": {
                          "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hjcdak3/",
                          "text": "This is so common I've almost never heard of it not going this way. Classic Trap. Cue Admiral Akbar.",
                          "author": "scintor",
                          "created": 1636065562,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hj6wq72": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj6wq72/",
      "text": "I honestly can't imagine even entertaining the NTT position.  The bit about \"high probability of transitioning to tenure track\" is worth \\*zero\\*.  \n\nYou have a TT offer?  Congratulations, you won the lottery.  Go cash in your ticket.",
      "author": "ecklesweb",
      "created": 1635969451,
      "upvotes": 48,
      "replies": {
        "hj8zg77": {
          "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj8zg77/",
          "text": "I *might* take the NTT one over the TT one if it paid substantially more, but there's no way in hell I'd be doing so when it also pays less. \n\nFrankly, I just strongly disagree with the dichotomy presented of \"salary or opportunity for advancement\" since it seems like the higher paying position also has higher opportunity for advancement. It *is* a TT position whereas the other one *might some day* maybe let you be TT.",
          "author": "BarackTrudeau",
          "created": 1636003924,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hj5dg46": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj5dg46/",
      "text": "First of all congrats on the offers! I would go for the tenure-track one, since this is super important, as it means potential job security. You can have/ build your network independently of and beyond the place at which you work.",
      "author": "Matthias_Rillig",
      "created": 1635948185,
      "upvotes": 19,
      "replies": {}
    },
    "hj5g10k": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj5g10k/",
      "text": "If the TT position is in a location you can envision yourself living in and being relatively happy in, I would absolutely take that position over a non-permanent and low-paying job. You'll still be able to meet people, but it will take more effort on your part to make those connections. But you really can't beat the security of knowing that you have a job and a good paycheck.\n\nYou can also, as the other commenter noted, let the RAP job know that you have received a TT offer.",
      "author": "Galactica13x",
      "created": 1635949255,
      "upvotes": 12,
      "replies": {}
    },
    "hj78u28": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj78u28/",
      "text": "Tenure and higher pay? Seems like a no brainer to me unless I really really really hated the location.",
      "author": "WitnessNo8046",
      "created": 1635974103,
      "upvotes": 13,
      "replies": {}
    },
    "hj7gc97": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj7gc97/",
      "text": "The tenure track option. The other is precarious labor dressed up in good clothing and promises of conversion mean absolutely nothing.",
      "author": "anctheblack",
      "created": 1635977087,
      "upvotes": 12,
      "replies": {}
    },
    "hj6vims": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj6vims/",
      "text": "Also consider the financial health of the two institutions. Many places are going through financial restructurings and first people to get cut are NTT positions. Take the cash and TT and do your best to make the other stuff a possibility at the TT job. It’s a lot harder to make the money and TT position a possibility at the NTT place.",
      "author": "psychprof1812",
      "created": 1635968987,
      "upvotes": 10,
      "replies": {}
    },
    "hj70hqs": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj70hqs/",
      "text": "TT. Not even worth considering the first offer unless you don't want an independent position and prefer to work under someone else.",
      "author": "fwafwa",
      "created": 1635970907,
      "upvotes": 8,
      "replies": {}
    },
    "hj6ktkv": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj6ktkv/",
      "text": "Take the TT job. If you’re good your tenure will be transferable at some point.",
      "author": "ohnoyoudin",
      "created": 1635964867,
      "upvotes": 5,
      "replies": {}
    },
    "hj87c23": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj87c23/",
      "text": "The Post-Ac world is absolutely riddled with bitter souls who believed someone that the tenure track part would come along in a couple of years. Don't be like them. Take the TT position.",
      "author": "lucianbelew",
      "created": 1635988817,
      "upvotes": 6,
      "replies": {}
    },
    "hj93any": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj93any/",
      "text": "I had a choice between a TT job and a SIGNIFICANTLY higher-paying VAP at a prestigious school with a \"high probability\" of it turning into a tenure line in 2014. I stayed there two years before taking a different TT gig. \n\nThe person who replaced me is still there as a VAP some years and an adjunct others.\n\nTake the TT job.",
      "author": "PogueMahone82381",
      "created": 1636006911,
      "upvotes": 5,
      "replies": {}
    },
    "hjavmnd": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hjavmnd/",
      "text": "nthing: TT.\n\nGet your mentorship and collabs *from elsewhere in your network* or build a network to do this!. Use some of the time and money that you have in the TT position to pay others to do work for you so you make time to do this.",
      "author": "lalochezia1",
      "created": 1636044333,
      "upvotes": 2,
      "replies": {}
    },
    "hj6kc45": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj6kc45/",
      "text": "Only my opinion - Take the better job with the higher salary. The independence you’ll get over those 2 years will likely be attractive to other employers including the one you hope might turn you to tenure track.",
      "author": "serennow",
      "created": 1635964681,
      "upvotes": 0,
      "replies": {}
    },
    "hj8f7z6": {
      "link": "/r/AskAcademia/comments/qlut64/deciding_between_two_faculty_job_offers/hj8f7z6/",
      "text": "It depends on where you are in your career, your age and personal goals, and your flexibility in moving between jobs.",
      "author": "Ok-Refrigerator-2432",
      "created": 1635992404,
      "upvotes": 0,
      "replies": {}
    }
  }
}