{
  "sid": "p22iet",
  "link": "/r/AskAcademia/comments/p22iet/potentially_biased_examiner_should_i_talk_to_my/",
  "title:": "Potentially biased examiner, should I talk to my supervisor?",
  "text": "(Sorry, a bit of a long read) I recently received the results of my thesis (humanities) and the examiner's reports. While I was semi-disappointed with the mark, it was a decent grade that will hopefully carry me into further study. However, when I read the report from one examiner, I felt as though there were two potential biases in their marking.\n\nIssue 1: Upon reading their report it seemed like I had been marked down, not because of the quality of my writing/ideas/research, but because my marker fundamentally disagreed with my argument. Humanities marking can be controversial and subjective, but you are meant to assess the quality of their argument, evidence, and reasoning. In my report the examiner admitted that these were all the \"strengths of my thesis\", but that they, essentially,  \"could not get past\" my argument. The person I suspect was my examiner (they remained anonymous but it is fairly obvious) also teach a course that essentially opposes my thesis' underlying argument. \n\nIssue 2: If I am correct in my suspicions as to who my examiner was, then I know they are already somewhat biased against me. I turned down working with them for this exact thesis and from then on they actively ignored me whilst I worked and studied in the department. They are also infamous amongst students for marking down/disliking students who disagree with them in class, and having worked with them previously, I have definitely experienced this firsthand. \n\nThe problem is that the examiner has chosen to remain anonymous. I could say with about 95% certainty as to who it was for several reasons, but that 5% doubt makes me think maybe I am being unreasonable or am unwilling to accept my mark. \n\nI just really need an outside perspective—do you think this is worth bringing up with my current supervisor? Are these reasonable concerns? Or do you think I've made the situation bigger in my head than it actually is? Any advice or perspectives would be welcome, thank you! \n\nLet me know if I can give any more info or context, too.",
  "author": "subtle_disgust",
  "created": 1628643540,
  "updated": 1634079938,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.72,
  "comments": {
    "h8hd0zr": {
      "link": "/r/AskAcademia/comments/p22iet/potentially_biased_examiner_should_i_talk_to_my/h8hd0zr/",
      "text": "Many people feel like their readers were biased. Often they aren't.\n\nPart of the job is to convince the skeptical, and rather than avoid that person it would have been good to talk with them and see what kinds of arguments would resonate with them. Not talking with them earlier was probably a mistake if they were working in your area - you could have predicted it would go to them. It's easy to make something your supervisor likes, hard to make something everyone likes, and the only way to make something everyone likes is to talk with everyone.\n\nYou're free to bring up the issue with your supervisor - they've probably heard this kind of issue very often before and don't put much weight on it. But they also won't likely hold it against you since it is so common.",
      "author": "uniadminthrowaway",
      "created": 1628644743,
      "upvotes": 20,
      "replies": {
        "h8hh0xe": {
          "link": "/r/AskAcademia/comments/p22iet/potentially_biased_examiner_should_i_talk_to_my/h8hh0xe/",
          "text": "Thank you for your reply, these are all really great points. I had tried to meet with the past professor previously, but he had put these off or ignored them, and I didn't feel comfortable imposing myself without prior scheduling. \n\nIn hindsight, this is something I should have mentioned to my current supervisor before submission, but at the time I convinced myself I was creating unnecessary drama. At least this whole situation has been a great learning curve around communication and timing, and a good reminder that I am not the only person in the world to have had these problems, haha.",
          "author": "subtle_disgust",
          "created": 1628646719,
          "upvotes": 6,
          "replies": {
            "h8hirba": {
              "link": "/r/AskAcademia/comments/p22iet/potentially_biased_examiner_should_i_talk_to_my/h8hirba/",
              "text": "Good attitude!\n\nIf it helps you feel better, in the long run no one will remember what mark you got, and your supervisor's support will help you if you want to do further study. (They can explain the issue in a reference letter.)",
              "author": "uniadminthrowaway",
              "created": 1628647576,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h8hd493": {
      "link": "/r/AskAcademia/comments/p22iet/potentially_biased_examiner_should_i_talk_to_my/h8hd493/",
      "text": "If you want advice from your advisor about this situation, I'd recommend asking them how you can turn this person around. Taking them head on is unlikely to turn out well for you. But learning the skill of working with people who are unreasonable, biased and have power over you is a lifelong skill that will serve you well in academics and the rest of the petty world.",
      "author": "Jobediah",
      "created": 1628644788,
      "upvotes": 6,
      "replies": {
        "h8hheof": {
          "link": "/r/AskAcademia/comments/p22iet/potentially_biased_examiner_should_i_talk_to_my/h8hheof/",
          "text": "This is true, thank you for your response! I would love the opportunity to talk to my marker about their perspective, not to convince them otherwise, but perhaps to consider how I might better have accounted for it (this is something I've done previously). But unfortunately, as they have chosen to remain anonymous I don't think I would ethically be allowed to make that approach. Learning to work with different opinions is definitely a great lesson to consider, though!",
          "author": "subtle_disgust",
          "created": 1628646908,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h8mdqij": {
      "link": "/r/AskAcademia/comments/p22iet/potentially_biased_examiner_should_i_talk_to_my/h8mdqij/",
      "text": "I think you can discuss with your advisor, but only on how to address the comments, irrespective of whom you think it is.  i.e. you must separate the arguments from the person that you think it is (and you would be stunned at how often people guess wrong).\n\nAs an aside, I would never downgrade a student because they disagreed with me.  But I would downgrade them for being wrong.  A subtle point.",
      "author": "Life_time_learner",
      "created": 1628746033,
      "upvotes": 1,
      "replies": {}
    }
  }
}