{
  "sid": "ez95ak",
  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/",
  "title:": "I have manipulated data in my research paper and it is killing me from inside. What should I do?",
  "text": "Hello everyone,\n\nI am highly embarrassed to post this . I am currently pursuing my masters at a reputed college(I am in my first year), however I had manipulated some data in my undergraduate thesis which would easily be detected if someone looks with a closer eye. It was unfortunately selected for publication in a reputed journal and we have recently received a notification. I honestly had no intent of deceiving anyone, I didn't realize it at all at that time and it was out of my inexperience. I have recently read the consequences of data manipulation while doing my course in ethics. Had I known it earlier, I would have never committed such a sin. The article is yet to be processed and I believe that we can withdraw it. However, I am confused what should I say to my advisor, if I tell him the truth, he will report me to the dean and my degree will be revoked, and I will have to literally beg to survive(I am from a very poor family). Please suggest me what should I do. I fear that in case the journal editors come to know from the reviewers about this, it will destroy my career as well as reputation. Please suggest me what should I do.\n\nPS: I don't have any past history of indiscipline(undegrad GPA\\~3.92), nor have I manipulated any data in my other work. I have just realized what have I done and want to repent for my mistakes. But at the same time I don't want to lose my degree as I am the only one to financially support my family\n\nEdit: Thank you everyone for your comments. Sorry for not being upfront about the details. I am detailing the case here. Basically I had one figure in my bachelor work wherein I tweaked two data points(increased its value by a factor) in order to make my conclusions more justified. The data points if kept unchanged would not change the conclusions. However, recently I realized that I had made a severe error in the paper, the same figure was placed at a different place by mistake and was missed by the reviewers, however, if anyone would look carefully, they would look the same, and when they analyze the value in the figure, one of the data point that I tweaked is impossible to achieve. So if I tell them the reason that the figures are same, a decent person in the field would realize the manipulation. The work that I did was groundbreaking(even if the data remains unchanged), and would receive larger citations if published. But I don't want it to be published as the consequences would be disastrous for me as well as my advisor. I had deleted the raw data once I completed my undergraduate. I have been trying since the past few weeks in order to replicate the work but I am failing(the amount of effort I had put in was quite intensive).\n\nI know that if I confess in front of my advisor, he would report me to the dean and I would be expelled immediately.  I am trying to figure out ways to convince my advisor to withdraw the article. However, my prime concern is that in case the reviewer/editor comes to know about it(before/after withdrawal), the consequences would be even more severe.\n\nEdit2: I e-mailed the dean keeping my advisor in cc and got a reply immediately. They were furious as their e-mail suggested and told me to report to the institute in a week. My advisor called me and told \"I never knew you would turn to be like this\". I am thinking to end my life if they expel me/revoke my degree by taking the entire responsibility on my shoulder and make it public if needed that it was all my fault and my advisor was not involved. I am finally happy that I was able to stop myself from contaminating the literature. Thank you guys for your support. I am ashamed and proud of myself at the same time.",
  "author": "shawna5564",
  "created": 1580907337,
  "updated": 1634080482,
  "over_18": false,
  "upvotes": 264,
  "upvote_ratio": 0.94,
  "comments": {
    "fglqvxk": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglqvxk/",
      "text": "> I honestly had no intent of deceiving anyone, I didn't realize it at all at that time and it was out of my inexperience \n\nYou are kinda saying two things: On the one hand you did it unknowingly (the only way if you didn't intend to deceive anyone); while on the other hand you call it \"data-manipulation\" and unethical, which would be very much intentionally deceiving people. \n\nIf it was because you mis-understood the methods, or your data analysis was flawed, then you have nothing much to fear. You were an undergrad and were still learning how to do research; so mistakes do happen - which is one of the reasons it's unusual that an undergraduate paper get's all the way to publication. If you go to your advisor and say \"in hindsight, and with more experience, I think this and this is wrong\" you should be absolutely fine - much better to find this now instead of during the peer review process. \n\nIf you intentionally changed your data then I can't help you.",
      "author": "LadyNelsonsTea",
      "created": 1580908538,
      "upvotes": 301,
      "replies": {
        "fglrl9z": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglrl9z/",
          "text": "This exactly. Did you actually make data up  or did you just do  bad science?",
          "author": "UnspectacularAim",
          "created": 1580909119,
          "upvotes": 96,
          "replies": {
            "fglu4cv": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglu4cv/",
              "text": "The cover up is often greater than the crime. Is currently springing to mind",
              "author": "Child_of_Gloom",
              "created": 1580910979,
              "upvotes": 42,
              "replies": {}
            }
          }
        },
        "fgm3xob": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm3xob/",
          "text": "I agree 100%, but OP’s story doesn’t add up.  I think they still aren’t taking full responsibility for what they did.  My guess is that it wasn’t a mistake, but a naive decision to do something wrong which may now come to light.",
          "author": "bigrottentuna",
          "created": 1580917559,
          "upvotes": 64,
          "replies": {
            "fgn34bl": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgn34bl/",
              "text": "Happy Cake day!",
              "author": "BlinkPT",
              "created": 1580936783,
              "upvotes": 4,
              "replies": {
                "fgn42jq": {
                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgn42jq/",
                  "text": "Thanks!",
                  "author": "bigrottentuna",
                  "created": 1580937314,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fgmkwjg": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmkwjg/",
      "text": "OP, I don't know if it was intentional, but in your second edit you expressed the thought to end your life over this.\n\nPlease step back and know that people here care and that you can get help. One hotline is here: 1-800-273-8255, many others are available through text or chat",
      "author": "WaylonWillie",
      "created": 1580926654,
      "upvotes": 148,
      "replies": {
        "fgnlfb2": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnlfb2/",
          "text": "OP, please follow this advice above all. No matter how much you messed up and what the consequences might be, nothing is worth ending your life over. There are many more good things you will be able to do with your life and your career, none of which you will be able to try if you're not here. You say your family is depending on you to support them? Think of them. Take a breath. You will make it through this.",
          "author": "MisterSmeeee",
          "created": 1580947365,
          "upvotes": 37,
          "replies": {}
        }
      }
    },
    "fglqzqr": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglqzqr/",
      "text": "You need to tell your advisor and urgently pull your paper from the journal. Their reputation (your advisor, not the journal) is at risk as well and they have as much, if not more, to lose as you do.\n\nData manipulation is a very serious offense among scientists, but there may be a little more understanding when it's done at an undergraduate level. You need to present your situation, show sincere remorse, and hope for the best.\n\nI would also leave out the part where you became concerned about it only \\*after\\* reading of the consequences. That implies you want to avoid consequences, not do what you are morally obliged to do.",
      "author": null,
      "created": 1580908626,
      "upvotes": 128,
      "replies": {
        "fgmvk9r": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmvk9r/",
          "text": "[deleted]",
          "author": null,
          "created": 1580932856,
          "upvotes": 16,
          "replies": {
            "fgnhf8u": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnhf8u/",
              "text": "> This is similar to not sorry for what they did, sorry for getting caught.\n\nBut it's the exact opposite of that. OP hasn't been caught and wants to come forward.",
              "author": "Durendal_et_Joyeuse",
              "created": 1580944945,
              "upvotes": 12,
              "replies": {
                "fgnjqsh": {
                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnjqsh/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1580946309,
                  "upvotes": 7,
                  "replies": {
                    "fgnjty3": {
                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnjty3/",
                      "text": "I didn't say they're coming forward for genuine remorse. It's a simple fact that they're not coming forward because they're sorry for getting caught, as you said. They haven't been caught.",
                      "author": "Durendal_et_Joyeuse",
                      "created": 1580946360,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fglqast": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglqast/",
      "text": "Come clean to someone you trust before it becomes a bigger issue.",
      "author": "frisky_fishy",
      "created": 1580908033,
      "upvotes": 64,
      "replies": {}
    },
    "fgltl8i": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgltl8i/",
      "text": "Pull the paper now. Come clean and explain the situation to your advisor.",
      "author": "sp8rks",
      "created": 1580910617,
      "upvotes": 57,
      "replies": {}
    },
    "fglrda6": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglrda6/",
      "text": "I don't understand. If you never intended to deceive anyone, how is it data manipulation rather than just a mistake? What did you actually do?",
      "author": null,
      "created": 1580908937,
      "upvotes": 85,
      "replies": {
        "fgm4qh2": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm4qh2/",
          "text": "One could potentially manipulate data without realizing its wrong. It’s “error correcting” or “removing obviously biased data pints.”",
          "author": "StellaAthena",
          "created": 1580917957,
          "upvotes": 47,
          "replies": {
            "fgm7sji": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm7sji/",
              "text": "That's true enough, just like unintentional plagiarism is still plagiarism. But I think intent matters when it comes to what consequences would come down on OP when they come clean about it.",
              "author": null,
              "created": 1580919579,
              "upvotes": 22,
              "replies": {}
            }
          }
        },
        "fgmbfkd": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmbfkd/",
          "text": "And had they known the consequences they wouldn’t have done it? That’s not an innocent error.",
          "author": "beeskness420",
          "created": 1580921405,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "fglxtxq": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglxtxq/",
      "text": "In my opinion, your advisor should have been involved in the data analysis if you were an undergraduate when you were analyzing the data. \n\nTalk to your advisor. He might advise you to write to the journal editor and say that recently you have had some concerns about the methodology and that you would like to withdraw your submission until you can (together with your advisor) review the data. \n\nBut do this now. Don't wait until it's published.",
      "author": "imaslp",
      "created": 1580913572,
      "upvotes": 39,
      "replies": {}
    },
    "fgluc0b": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgluc0b/",
      "text": "If you were comfortable hiding it you would not have posted here. You know what the right thing to do is.  Consequences only get worse the longer you wait.",
      "author": "Der_Kommissar73",
      "created": 1580911126,
      "upvotes": 37,
      "replies": {
        "fgmq38o": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmq38o/",
          "text": "One bit of advice I'd give to myself younger: always be transparent, always cc in people if you're unsure.",
          "author": "dl064",
          "created": 1580929754,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "fgmeykv": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmeykv/",
      "text": "What I glean from your post:\n\nYou knowingly changed data to better justify your conclusions.\n\nYou only now consider this an issue because the paper is getting attention and might be found out, not because you discovered something was wrong.\n\nYou tried to cover your tracks by deleting your original data, which is a huge no-no. \n\nThese are not mistakes of inexperience, these are deliberate manipulations for your own benefit, which you are now feeling guilty about. Saying that correcting the data will have no effect on the impact of the paper or that you had no guidance from your PI are not good excuses, and it spits in the faces of scientists who do good work and struggle to publish. You should come clean, sincerely apologize, and learn from your mistakes. The punishment likely only gets worse the longer you wait, especially since it's clear you knew what you did was wrong and tried to delete data that would prove that.\n\nE: from your edit, please do not consider ending your life. Your mistake does not deserve that result. Please talk to a therapist and call 1-800-273-8255 if you are experiencing suicidal thoughts.",
      "author": "Godinjointform",
      "created": 1580923183,
      "upvotes": 66,
      "replies": {
        "fgmflyl": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmflyl/",
          "text": "I deeply regret whatever I did and I just need a second chance. I don't know what will I do if my degree is revoked",
          "author": "shawna5564",
          "created": 1580923546,
          "upvotes": 11,
          "replies": {
            "fgmi6jy": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmi6jy/",
              "text": "You might be able to keep it an internal matter if you inform the relevant people asap. But if that gets published it'll come out and definitely be worse and I imagine your institution would need to make an example as it will be public",
              "author": "Child_of_Gloom",
              "created": 1580925059,
              "upvotes": 26,
              "replies": {}
            },
            "fgmk0ls": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmk0ls/",
              "text": "I'm glad you feel remorse, there are many out there that would do this and feel justified. However, you do need to come clean. If it is a matter of time before your manipulation is discovered, having it uncovered by someone else will lead to much worse consequences. Be honest with your actions and your conscience will thank you. Saying that you \"take full responsibility\" anonymously on a forum is not taking responsibility, that comes from reporting your mistake. I know that the possibility of repercussions is scary, but that is the best course of action.",
              "author": "Godinjointform",
              "created": 1580926136,
              "upvotes": 9,
              "replies": {}
            },
            "fgmmipz": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmmipz/",
              "text": "Don't bet on getting a second chance where you are, or with people who are tied to those in your university. Outside is also unlikely because it'll be marked on your transcript/degree and any LoRs will mention it too. You've burned those bridges. You have unequivocally proven yourself to be untrustworthy in science. It's one of those things where if you cross the barrier just one time, it's so much easier to do it again and again for the rest of your life. \n\nThere is one rule that we all (well, most of us) hold sacred: you present the truth of the data. You don't purposely move bad points around to fit your narrative, and you certainly don't do it in secret, with no justification and no raw data presented. But you *have* done this, and that makes you fundamentally different to the rest of us. \n\nThey can never trust you again. To be honest, I don't think you can ever trust yourself again either. There is endless temptation to fabricate data or fudge the facts a little bit, and if you've given in when the stakes were so incredibly low, how can you possibly resist when it feels like your career or funding is relying on you getting a certain result? Will you have the strength to tell the truth of the data or will you try to move points around to suit your pre-arranged conclusion again? \n\nYou can't answer this and neither can anyone else, and the risk of a \"no\" answer is enough to dissuade anyone from working with you.",
              "author": "NoxiousQuadrumvirate",
              "created": 1580927619,
              "upvotes": 4,
              "replies": {
                "fgmwlqm": {
                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmwlqm/",
                  "text": "Hey, maybe you're right, but I would urge you to consider wording differently. OP has made a mistake, but is moving in the proper direction by owning up to it towards the authorities. He expressed thoughts of ending his life over this, which I hope we can all agree on is far out of bounds for what happened - but he also might need to hear some less painful words from us. I'm specifically talking about \"I don't think you can ever trust yourself again either.\" Do you mean in science, or in general? I don't think OP needs to think he can never trust himself again. People make mistakes, and people change.",
                  "author": "Applejuicyz",
                  "created": 1580933421,
                  "upvotes": 42,
                  "replies": {
                    "fgmz0qg": {
                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmz0qg/",
                      "text": ">I'm specifically talking about \"I don't think you can ever trust yourself again either.\" Do you mean in science, or in general?\n\nI mean in science. If OP fabricated data when there was no clear need to do so, academia likely isn't the right place for them anyway. There's a lot of temptation and not a lot of checks and balances, so our conscience is really the only thing stopping us from doing the same thing every day. Like a student who skips class for the first time, OP is probably going to struggle to resist that temptation again in the future. \n\nKnowing what things tempt you and avoiding them isn't weakness, it's the height of strength. I avoid alcohol because I know it will tempt me. I avoid weed because I know it will tempt me. There are many other paths OP can take that won't involve their temptations or require a regular struggle against them.\n\nI hadn't seen the edit, so I apologise if my tone was too harsh. OP should look into counselling to help them disentangle personal value from just normal, human fallibility. It helped me a lot to learn to see my weaknesses as things to manage, not as a death sentence.",
                      "author": "NoxiousQuadrumvirate",
                      "created": 1580934637,
                      "upvotes": 11,
                      "replies": {
                        "fgmzgpi": {
                          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmzgpi/",
                          "text": "I think the point is fair to make within science. From your original message it wasn't entirely clear to me if that was indeed what you were talking about, my apologies. \n\nAlso, I'm not sure if your claims are true. Do you have any data to back it up, out of curiousity?",
                          "author": "Applejuicyz",
                          "created": 1580934857,
                          "upvotes": 4,
                          "replies": {
                            "fgn1s8g": {
                              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgn1s8g/",
                              "text": "There are [a lot of studies](https://www.ncbi.nlm.nih.gov/pubmed?linkname=pubmed_pubmed&from_uid=22642485) out there looking at things like cheating in relationships, cheating on tests, and [lying](https://www.ncbi.nlm.nih.gov/pubmed/27775721) in general, showing that you're more likely to \"re-offend\" with every offense. I think the same broadly applies to any bad habits, and if you know you tend towards one bad habit then you really have to go out of your way to avoid the temptation and put failsafes in place. Habits are very easy to form and very hard to break. \n\nThere might be some cases where someone e.g. cheats on an exam under a moment of sheer panic and then can't take it back, and maybe they wouldn't be as likely to cheat again in the future, but if it's a very carefully-made choice over many months, that person has really thought it through and has still chosen to do the wrong thing. In their eyes, it is justified. They can come up with the same justifications in the future.",
                              "author": "NoxiousQuadrumvirate",
                              "created": 1580936045,
                              "upvotes": 10,
                              "replies": {
                                "fgn48q1": {
                                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgn48q1/",
                                  "text": "Interesting. From what I can tell, many of the studies you linked precluded any interventions (or maybe even simply negative feedback on their dishonest action(s)) to test their effect.. Many studies also have found effective ways to reduce recidivism (here's two [\\[1\\]](https://www.sciencedirect.com/science/article/pii/S0047235297000755) [\\[2\\]](https://psycnet.apa.org/record/1988-02488-001)). I wonder if this would also be relevant for OP's case; considering they are at least receiving negative feedback for their actions.\n\nEither way, interesting talk, thank you for your time and perspective!",
                                  "author": "Applejuicyz",
                                  "created": 1580937409,
                                  "upvotes": 4,
                                  "replies": {
                                    "fgn4w0s": {
                                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgn4w0s/",
                                      "text": "I think the downside here is that the negative feedback for OP is going to be punishment: losing the final part of their undergrad, maybe having the entire degree revoked. If they just get a stern talking to but otherwise \"get away with it\", that might not really count as negative feedback. Being caught and punished is simultaneously the best and worst thing for them as a researcher. \n\nI would be wary of comparing exact treatments that involve alcohol and drugs. There's an element of physical addiction there that can trump willpower, and that has to be treated alongside the willpower issues. It's unlikely that you'd be addicted to cheating on your spouse though, or raping people, which your second example says punishment seems to work for.",
                                      "author": "NoxiousQuadrumvirate",
                                      "created": 1580937761,
                                      "upvotes": 6,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fgmeg19": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmeg19/",
      "text": "Honestly, if you manipulated data to make your research seem more prestigious--you call it 'groundbreaking work', but this claim is suspect at best given that you had to manipulate your data to 'make it more justified'--and used this research to get your bachelor's, secure a spot in your grad program, AND lay the foundation of your first publication, I think you're in trouble. Trying to hide behind 'inexperience' probably isn't the best route either, given that even in this post it's pretty clear that its only something you're worried about now that you realize the repercussions if you get caught by the journal. I'm not sure if anyone can help you dig yourself out of this one. All you can really do is be honest, and prepare yourself for whatever consequences are coming your way.",
      "author": null,
      "created": 1580922931,
      "upvotes": 26,
      "replies": {}
    },
    "fgly0nv": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgly0nv/",
      "text": "I feel like most people want to help but you haven't given enough information. This site is obviously anonymous so you don't have to worry about that.\n\nNow what was the exact nature of this manipulation, were questionnaire values changed, were inappropriate analyses chosen, does the raw data even correspond to the final input?",
      "author": "rmczpp",
      "created": 1580913702,
      "upvotes": 23,
      "replies": {}
    },
    "fgmlwxl": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmlwxl/",
      "text": "Do the right thing and pull the paper, but don't martyr yourself on the alter of science.\n\nGive a reason for the withdrawal. Say you can't repeat the strength of the effect (which would be true) and maybe substitute the data with an unmanipulated repeat of the experiment (if the directionality of the result is truly the same as you say).\n\nWhatever you decide, from here on you need to be honest with yourself before you can be honest with others. \"I didn't realize it at all at that time and it was out of my inexperience.\" Really?",
      "author": "the_custom_concern",
      "created": 1580927260,
      "upvotes": 19,
      "replies": {}
    },
    "fglqkgz": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglqkgz/",
      "text": "Oooofff... Not going to lie, that's a bad situation you're in. \n\nYou're going to have to own up to it, you can't just sit on this because eventually it will come back to bite you in the ass. \n\nTo minimise the consequences for yourself, maybe frame it like you made an error copying data or you used the wrong data or the manipulation was in good faith but incorrect. \n\nThere's no easy way out of this i'm afraid.",
      "author": "Oppqrx",
      "created": 1580908263,
      "upvotes": 74,
      "replies": {
        "fgmus3s": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmus3s/",
          "text": "This is really good advice.",
          "author": "MickyWasTaken",
          "created": 1580932453,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fgmu3of": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmu3of/",
      "text": "OP, you made a really stupid mistake but this is not worth your life. I would strongly suggest that you talk about this to a staff member you trust/are on good terms with and talk to them about this. I'm not really sure what else to suggest because now that you've literally admitted to falsifying data there's not a great deal of smoothing out that you can do, but please talk about this to an academic who knows you and your department and maybe they might be able to help somewhat.",
      "author": "Chlorophilia",
      "created": 1580932082,
      "upvotes": 20,
      "replies": {}
    },
    "fgmamq8": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmamq8/",
      "text": "When I fucked up I wrote an erratum, I didnt pull the paper. Or are the conclusions entirely overturned by your error?",
      "author": "ThePhysicistIsIn",
      "created": 1580921007,
      "upvotes": 19,
      "replies": {
        "fgnmzbf": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnmzbf/",
          "text": "There’s no erratum that would explain such blatant manipulation though. The social behavior research debacle revolving around Jonathan Pruitt right not makes it pretty clear that manipulation this obvious is a retraction.",
          "author": "Mallornthetree",
          "created": 1580948393,
          "upvotes": 6,
          "replies": {
            "fgnqw6x": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnqw6x/",
              "text": "Right. I'm talking about genuine mistakes - not faked data. OP is cagey about exactly what they did. They say it wasn't their intent to mislead, which seems to indicate it's a mistake, not faked data.\n\nPruitt seems to have genuinely faked all of his data in all of his papers.",
              "author": "ThePhysicistIsIn",
              "created": 1580950896,
              "upvotes": 5,
              "replies": {
                "fgnw5oq": {
                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnw5oq/",
                  "text": "I see what you’re saying. I read the update as being a deliberate manipulation. Mistakes happen all the time, and errata are for those instances. This seems like more of a Pruitt sort of situation from how I’m reading the update.",
                  "author": "Mallornthetree",
                  "created": 1580954203,
                  "upvotes": 5,
                  "replies": {
                    "fgnyghr": {
                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnyghr/",
                      "text": "I agree - I had missed the edits from OP. OP's supervisor and dean wouldn't be pissed at him if he'd just fucked up his methodology.",
                      "author": "ThePhysicistIsIn",
                      "created": 1580955667,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fgmwyh7": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmwyh7/",
          "text": "^ I think this is the best course of action.",
          "author": "VentureIndustries",
          "created": 1580933611,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fglq8tl": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglq8tl/",
      "text": "Is there any way you can frame the incorrect data as an honest mistake that you now want to clean up?",
      "author": "Quarle",
      "created": 1580907983,
      "upvotes": 54,
      "replies": {
        "fglqs68": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglqs68/",
          "text": "I tried to frame few mistakes but it didn't work. I fear that he might catch me if I keep  doing this",
          "author": "shawna5564",
          "created": 1580908450,
          "upvotes": 13,
          "replies": {
            "fglrrv3": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglrrv3/",
              "text": "From your explanation, I suspect that admitting to having made an error in methodology or data collection, even a major error, that you have only fully realized now that you’re reviewing your work as part of the publication process, will be the best way out of this. See if you can’t find an honest explanation for the problems, and then inform the publication and your advisor.",
              "author": "Quarle",
              "created": 1580909269,
              "upvotes": 61,
              "replies": {
                "fglrzbb": {
                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglrzbb/",
                  "text": "But what if they ask for the raw data if we withdraw our paper?",
                  "author": "shawna5564",
                  "created": 1580909440,
                  "upvotes": 11,
                  "replies": {
                    "fgltt2i": {
                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgltt2i/",
                      "text": "What's wrong with the raw data? This is at least partially the responsibility of whoever approved/submitted the paper. \nIt is definitely better to withdraw it than to be in a position where it's published (shouldn't happen because of peer review but technically possible) and someone else identifies the issues.",
                      "author": "Child_of_Gloom",
                      "created": 1580910767,
                      "upvotes": 53,
                      "replies": {
                        "fgmbh28": {
                          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmbh28/",
                          "text": "Apparently, OP already deleted the raw data.",
                          "author": "valryuu",
                          "created": 1580921426,
                          "upvotes": 22,
                          "replies": {
                            "fgmbr4f": {
                              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmbr4f/",
                              "text": "Ah well that seals it rather",
                              "author": "Child_of_Gloom",
                              "created": 1580921561,
                              "upvotes": 16,
                              "replies": {}
                            },
                            "fgmolrs": {
                              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmolrs/",
                              "text": "Honestly, if the OP isn't lying now, and all the problem is in **two data points** that don't change the main conclusion, I would be tempted to reconstruct raw data back from the plot (using datathief or ImageJ or any other similar program), move those two data points back to their original values (even if approximately), then re-analyze the part that depends on these data points to make sure everything makes sense. Release this data. And in the methods, say that all data was analyzed, then lost, then recovered from the images, and released. It's a mess, but with the data in the open, maybe this extra openness and transparency would kinda compensate, at least partially, for the original mess.\n\nBut that's assuming that the OP is saying the truth, and it's really just 2 data points in one figure. Some parts of this thread read as if there's more to this story, and the maze of lies is harder to untangle... In which case retracting the paper altogether would be the only option.",
                              "author": "ampanmdagaba",
                              "created": 1580928861,
                              "upvotes": 21,
                              "replies": {
                                "fgmqn31": {
                                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmqn31/",
                                  "text": "I mean: no raw data any more? Game over, man.",
                                  "author": "dl064",
                                  "created": 1580930074,
                                  "upvotes": 30,
                                  "replies": {
                                    "fgo2cih": {
                                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgo2cih/",
                                      "text": "Not necessarily; depends on the nature of the data, on the circumstances, on so many factors. To play devil's advocate, sometimes raw data are hours of boring videos, or some giant datasets that are hard to store and easy to lose. In which case half-processed data may be a reasonable proxy, to be stored in the long-term. But YMMV; so much depends on the context.",
                                      "author": "ampanmdagaba",
                                      "created": 1580958147,
                                      "upvotes": -1,
                                      "replies": {
                                        "fgoccro": {
                                          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgoccro/",
                                          "text": "I have to disagree there. It doesn't matter how \"boring\" the videos are or how big the dataset is. Data servers with terabytes of storage space exist for a reason. Any competent lab that works with large datasets should absolutely have their raw data backed up with multiple redundancies. Anything less is negligence.",
                                          "author": "Killer_Sloth",
                                          "created": 1580965440,
                                          "upvotes": 3,
                                          "replies": {
                                            "fgop7s6": {
                                              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgop7s6/",
                                              "text": "Added to which, it's fairly evident from retractionwatch that if there are queries about the data, and you can't return it, it tips the balance to retraction quite often.\n\nI mean, many journals now require the data to be OA.",
                                              "author": "dl064",
                                              "created": 1580979736,
                                              "upvotes": 3,
                                              "replies": {}
                                            },
                                            "fgoie0g": {
                                              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgoie0g/",
                                              "text": "Not every lab can afford it. It is nice to keep everything, but it's not always possible, and accidents also happen.\n\nYou can think of it another way. If ethograms without videos are acceptable as primary data, then it is OK if you first record videos, then process them into ethograms, then delete the videos. I'm not saying it's a good pipeline, but I insist that it would not invalidate the results. Neither would an accidental loss of some primary data if secondary data is released and open for review, and the process is consistent and well documented.",
                                              "author": "ampanmdagaba",
                                              "created": 1580971077,
                                              "upvotes": 0,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                },
                                "fgnn82e": {
                                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnn82e/",
                                  "text": "I would agree, if the assumption is correct that it doesn’t change the conclusions. I just can’t figure out why you’d change data points unless they DID change the conclusions. Why make stuff up if it’s not helping? This person needs to take a serious assessment of why they are in grad school and doing research. It just might not be for them.",
                                  "author": "Mallornthetree",
                                  "created": 1580948552,
                                  "upvotes": 8,
                                  "replies": {
                                    "fgo20dp": {
                                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgo20dp/",
                                      "text": "My guess (but it's charitable) is that 2 data points changed some p from 0.055 to 0.045 in some t-test somewhere. In which case, indeed, admitting 0.055 wouldn't, technically, change the conclusions, if it's just one of the effects, and go you a wee bit Fisherian.\n\nBut because the OP never mentioned that, honestly, I'm not too hopeful. Unfortunately :( Because it is a sad situation, for the OP, for their PI, for everyone. So much drama that could have been so easily avoided.",
                                      "author": "ampanmdagaba",
                                      "created": 1580957936,
                                      "upvotes": 3,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "fgmqkux": {
                              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmqkux/",
                              "text": "I feel like, if he (probably he, let's face it lads), sat me down and actually explained the whole thing top to bottom, I'd either think they were over-reacting, or need a stiff drink. Nowhere in between.",
                              "author": "dl064",
                              "created": 1580930037,
                              "upvotes": 14,
                              "replies": {
                                "fgmuyy4": {
                                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmuyy4/",
                                  "text": "Same.",
                                  "author": "MickyWasTaken",
                                  "created": 1580932548,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fgm0llt": {
                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm0llt/",
                      "text": "You would have no obligation.\n\nI think the best case scenario here is as others have said: 'I made a mistake; the paper should be withdrawn from review'. You owe the journal nothing.",
                      "author": "dl064",
                      "created": 1580915447,
                      "upvotes": 22,
                      "replies": {}
                    },
                    "fgm3ma4": {
                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm3ma4/",
                      "text": "well, *what* if? what's in the raw data?",
                      "author": "100011101011",
                      "created": 1580917373,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fgm4fqj": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm4fqj/",
              "text": "So this isn’t the first time you’ve done this? You have a history of manipulating data or other kinds of unethical practices and trying to represent them as mistakes?",
              "author": "StellaAthena",
              "created": 1580917805,
              "upvotes": 8,
              "replies": {}
            },
            "fgluehb": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgluehb/",
              "text": "As someone whose paper with real data was just rejected for what I consider specious reasons, I hope you get caught and expelled.",
              "author": null,
              "created": 1580911174,
              "upvotes": 18,
              "replies": {
                "fglv58u": {
                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglv58u/",
                  "text": "If it was a mistake, I could understand but actually manipulating data messes with so many careers. My PI was telling me the other day that she knows people who had papers rejected because their data wasn't as good as Jonathan Pruitt's data, but it's coming out that a ton of data from him has been manipulated. I think OP manipulated data and doesn't want to face the consequences, that's why they're being so cagey about it.",
                  "author": "Littlefingersthroat",
                  "created": 1580911683,
                  "upvotes": 54,
                  "replies": {
                    "fgmqr14": {
                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmqr14/",
                      "text": "I just don't get how folk can be that fucking daft. I've done alright in my career and I've never had absolutely stellar, bonkers results. If I got an amazing result I'd be more nervous what I'd missed.",
                      "author": "dl064",
                      "created": 1580930136,
                      "upvotes": 23,
                      "replies": {
                        "fgnnd1n": {
                          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnnd1n/",
                          "text": "^ This guy/gal does science. I feel so worried when my results aren’t messy!",
                          "author": "Mallornthetree",
                          "created": 1580948642,
                          "upvotes": 9,
                          "replies": {
                            "fgop240": {
                              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgop240/",
                              "text": "I had a good one once, where I seemed to show this incredible effect of a particular (common) genetic mutation. I left on Friday like 'Jesus!'\n\nThen on monday I realized the stats package had taken \"   \" as a group. I hadn't shown an effect of genotype: I'd shown an effect of not having genetic data at all.\n\n #Science",
                              "author": "dl064",
                              "created": 1580979504,
                              "upvotes": 6,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fgmterh": {
                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmterh/",
                  "text": "Haha you lot are repulsive, wouldn't care if he was supporting his poor family in the slightest and yet you claim fabricating data is the worst of sins. Stem at its finest.",
                  "author": "basinchampagne",
                  "created": 1580931680,
                  "upvotes": -27,
                  "replies": {
                    "fgmw1sp": {
                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmw1sp/",
                      "text": "This *is* the worst of sins for a researcher. \n\nThe entire system is based on trust. Normally, when we have to alter the data (e.g. removing clear outliers), we explain our reasons for removing some points *and* we provide the complete raw data so that reviewers/readers can reanalyse it their own way. But for this to work, they have to trust that the raw data we've provided is real. OP hasn't just made a little mistake, been a bit overzealous with the outlier removal, or made a poor judgement call on the method of analysis: they have tampered with the original data, are passing it off as real, *and* have destroyed all of the untampered data to cover their tracks. \n\nThe editors can't tell that the raw data itself has been manipulated or fabricated. Readers can't tell either until they fail to reproduce the results, which might not be until millions of dollars are handed out in grant money worldwide, especially if the result is as \"ground-breaking\" as OP claims. This is *public, tax-payer money* that would be wasted just to prove OP is a liar. Even just to publish a paper showing OP is wrong costs *you* money. So you really want to hope that we're not all pussy-footing around, making up data for our own personal gain. Lying isn't some minor annoyance to us, it costs a lot of people their time and money and sets the field back. It is the worst thing you can do in research.",
                      "author": "NoxiousQuadrumvirate",
                      "created": 1580933118,
                      "upvotes": 15,
                      "replies": {
                        "fgmwfw3": {
                          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmwfw3/",
                          "text": "Yes, as I said, you lot don't care if this will cause his family and him being out on the streets. The data is what matters, capital is what matters, humans don't. Thanks for exemplifying that!",
                          "author": "basinchampagne",
                          "created": 1580933329,
                          "upvotes": -20,
                          "replies": {
                            "fgn2eli": {
                              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgn2eli/",
                              "text": "In many areas of research, there can be real-world effects of data manipulation. \n\nIf you're working with health data and you fake points that make something look safe when it is not, you can cause significant harm to a number of other people who will be treated based on your results. \n\n\"data\" matters because we use data to make decisions. When we lie about the data, decisions that effect peoples lives are made based on lies, and that's bad.",
                              "author": "Eigengrad",
                              "created": 1580936387,
                              "upvotes": 12,
                              "replies": {}
                            },
                            "fgmy7xg": {
                              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmy7xg/",
                              "text": "That sucks, but it was OP's choice the entire time and \"inexperience\" frankly isn't an excuse here. Toddlers know that lying is wrong. There is no way someone could think manipulating data for their own gain was the right thing to do. They chose to lie and cheat. They then made the exact same choice every second since then when they didn't fix it and didn't retract the work. *They* submitted it to a journal or gave permission for it to be submitted. And they didn't fabricate data because of any worry about being homeless, since they've admitted the fake data doesn't change the results. They just lied for the sake of it. It wasn't a decision made under duress. \n\nMaybe their degree will be revoked. Maybe they'll just lose whatever their undergraduate thesis was worth and have to do it again, or have their grade/classification adjusted. Fixing what they have done will be a long and difficult job, but they do need to fix it. They can't be given a slap on the wrist and allowed to continue. At best, they keep their previous degree but do not continue with the Masters, which may be reasonable if it's just one part of the thesis. \n\nThis is the exact same argument students give when they \"really need\" an A in some class and think that their need for an A is enough reason to get one. If you really need a good grade, show up and do the work and earn that grade. If you really need a degree, don't lie and cheat and then make many decisions which lead to those lies being discovered. When you make a choice, you accept the consequences, *all of them*.",
                              "author": "NoxiousQuadrumvirate",
                              "created": 1580934240,
                              "upvotes": 14,
                              "replies": {
                                "fgmyqhm": {
                                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmyqhm/",
                                  "text": "Indeed; even if he ends his life, so be it. Right? That'd just 'suck' as well. Comparing it to a student who thinks the ends justify the means again exemplifies how empty and devoid of feeling you are, as if that comparison holds up. You'd do better sticking to your field.",
                                  "author": "basinchampagne",
                                  "created": 1580934496,
                                  "upvotes": -18,
                                  "replies": {
                                    "fgnadqh": {
                                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnadqh/",
                                      "text": "Obviously we’re all hoping that OP doesn’t take their life over this. Stop putting words in our mouths. What pretty much everyone here is saying is that *research is not the field this person should be in any longer*.\n\nIt’s not the only career in the world. Life might be bumpy for OP for a while, and frankly they brought these consequences upon themselves (an innocent mistake is one thing, but frankly it seems like there’s still much OP isn’t sharing with us about why this is so serious (and why they didn’t own up sooner)). But bumps happen. There’s still a whole wide world outside of scientific research that is open to OP.\n\nLying about data is the worst thing you can do in research. It can and does have real-world effects. Scientific research isn’t a fun little game of who can get the most publications, whose data looks the prettiest, who made the best points. It’s a furthering of our understanding of the world, our ability to manipulate it, and our ability to *survive* in it. Falsified data, depending on the field, can jeopardize the survival of individuals, species, economies, countries. It’s not something you can or should take lightly, and people who do it should not be allowed to participate in further data collection, analyzing, or communicating it.\n\n*But research is not the only thing that exists in the world.* You wouldn’t let a money-embezzling employee continue to work in finances, even if that’s how they were supporting their family. You’d fire them. You’d ensure they don’t get the same job with the same opportunities for embezzlement elsewhere. BUT THEY COULD STILL WORK A DIFFERENT JOB IN A DIFFERENT FIELD. (After the whole “that’s a crime” thing is over, anyway.)\n\nI’m not sure why you’re speaking as though OP would never be able to do anything else to provide for their family after facing the consequences of their actions. Again: obviously we do not want OP to take their life. This, frankly, is no reason to do so. There’s a whole world of careers out there that are not research/data based.",
                                      "author": "functionalatbest",
                                      "created": 1580940742,
                                      "upvotes": 7,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fgn0vc7": {
                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgn0vc7/",
                      "text": "Oh, come on.  OP is not the only first-college-grad-in-his-family in academia, and there are myriad who do it *honestly*.  It is likely an honest person, possibly in the same financial situation, was passed over for OP due to OP's \"great data.\"",
                      "author": "forever_erratic",
                      "created": 1580935552,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fgm8zky": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm8zky/",
      "text": "I'm picking up a lot of anxiety, catastrophising and jumping-to-conclusions in your post and comments. People are telling you to withdraw your paper without you even explaining what it is that you think you have done wrong. \n\n\"Data manipulation\" is a continuum from necessary (outlier remover is \"manipulation\") up to complete fraud, with many shades of grey in between. \n\nIs what you have done really so bad that it will lead to a report a revoked degree? If so, you would (should) have known at the time that you were doing something wrong. I am not sure what could lead revokation other than something really egregious like falsifying data or plagarism. \n\nIt's not uncommon for students to be anxious about whether you have done something correctly.  The best thing to do is explain what you think you might have done wrong to your supervisor, and ask for their opinion on how to proceed.",
      "author": "Doofangoodle",
      "created": 1580920155,
      "upvotes": 29,
      "replies": {}
    },
    "fgm6kz9": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm6kz9/",
      "text": "Jonathan?",
      "author": "guttata",
      "created": 1580918917,
      "upvotes": 37,
      "replies": {
        "fgmvtn5": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmvtn5/",
          "text": "[deleted]",
          "author": null,
          "created": 1580932996,
          "upvotes": 15,
          "replies": {
            "fgncvup": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgncvup/",
              "text": "This poster is probably referring to Jonathan Pruitt, a well-known behavioral ecologist under investigation for data manipulation in several papers. Really fascinating, and honestly likely what OP talked about in their ethics class. Check out the story [here](https://www.sciencemag.org/news/2020/01/spider-biologist-denies-suspicions-widespread-data-fraud-his-animal-personality).",
              "author": "AvianFidelity",
              "created": 1580942192,
              "upvotes": 15,
              "replies": {
                "fgnh4pk": {
                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnh4pk/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1580944765,
                  "upvotes": 5,
                  "replies": {}
                },
                "fgpwvff": {
                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgpwvff/",
                  "text": "[look at you](https://thumbs.gfycat.com/ImpartialGoldenCattle-size_restricted.gif)",
                  "author": "guttata",
                  "created": 1581013551,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fgm0k1i": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm0k1i/",
      "text": "Unless you provide details about what’s occurred, it’s going to be difficult for anyone to give you advice. Is there raw data that exists, but is different from the data you showed? Is there no raw data at all and you just made up values? Did you use software to manipulate an image? What exactly is the issue?",
      "author": "AuspiciousToad",
      "created": 1580915419,
      "upvotes": 10,
      "replies": {}
    },
    "fgmt91k": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmt91k/",
      "text": "As a junior researcher myself I understand the pressure of \"publish or perish\" which has led some researchers to commit similar \"sins\" . This doesn't justify your actions but a poor decision you made in your life should not make you end your life. People make bad decisions. Face the consequences, move on and be an honest, good and ethical researcher from now on.",
      "author": "linguistontherun",
      "created": 1580931589,
      "upvotes": 10,
      "replies": {}
    },
    "fgng62e": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgng62e/",
      "text": "> I am thinking to end my life if they expel me\n\nOP, you did the right thing now. There may be consequences and it's up to your institution to determine what they are. It's out of your hands now, so do not punish yourself any further, and take it easy.",
      "author": "100011101011",
      "created": 1580944174,
      "upvotes": 12,
      "replies": {}
    },
    "fgm7c3z": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm7c3z/",
      "text": "How did you 'manipulate' your data? It appears that it is image based so did you play around with Photoshop sliders to exaggerate something? Created something that did not exist in the first place? Removed something? Swapped images around? Misrepresented or mislabeled samples?\n\nSome of these are more serious than the others and what you could possibly do to salvage the situation depends largely on what you actually did.",
      "author": "Typrix",
      "created": 1580919330,
      "upvotes": 10,
      "replies": {}
    },
    "fgngm4r": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgngm4r/",
      "text": "> I am thinking to end my life if they expel me/revoke my degree by taking the entire responsibility on my shoulder and make it public if needed that it was all my fault and my advisor was not involved.\n\nKilling yourself won't do much to fix it. You'll be dead. then what? Live instead.",
      "author": "rumplepilskin",
      "created": 1580944449,
      "upvotes": 8,
      "replies": {}
    },
    "fglqm24": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglqm24/",
      "text": "this is a really tough question. If I take what you say at face value the consequences of doing the right thing might mean the punishment is more severe than the crime. On the other hand, the consequences of publishing a paper with manipulated data might be very severe for your co-author and the field.\n\n\nIn all fairness, if it was easy to spot than it should have been spotted in the review process. the fact that is hasn't been tells me the outlet isn't super-high quality.  Or the manipulation was more insidious than you're letting on here. \n\nThe way forward is probably to reconsider how you manipulated the data, and see if it is a deadly sin (did you absolutely set out to deceive?) or maybe a mistake made out of inexperience (something you only learned after completing the study?). If the latter, they won't take back the degree.\n\nThink of a strategy to fix and *then* take it to your advisor. Admit you made a mistake and explain how the ethics course sensitized you to this. \n\nDo all this before final acceptance of the manuscript.",
      "author": "100011101011",
      "created": 1580908301,
      "upvotes": 21,
      "replies": {}
    },
    "fgmn4la": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmn4la/",
      "text": "Listen, even if the worst thing happens, do not end your life over this. You expressed that it would be bad as you are the main source of income for your family but you aren’t seeing how important of a person you are to your family. Your loss will affect them more than you can know. \n\nYou did the right thing letting them know, please use your family for support or friends or a therapist. They are of course going to be angry at first but maybe it won’t be the worst case scenario.",
      "author": "crossmaddsheart",
      "created": 1580927980,
      "upvotes": 21,
      "replies": {}
    },
    "fglu6yk": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglu6yk/",
      "text": "In this case, honesty is the best policy. If you’re worried about how this will effect you now, imagine how it would effect you in 20 years if you’re a successful scientist. Come clean now before people start citing your work and it affects other people’s careers",
      "author": "who392",
      "created": 1580911030,
      "upvotes": 14,
      "replies": {
        "fglzu8b": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglzu8b/",
          "text": "Affect*",
          "author": "camilo16",
          "created": 1580914944,
          "upvotes": 10,
          "replies": {
            "fgm4q6o": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm4q6o/",
              "text": "Thank you! I always mix those up",
              "author": "who392",
              "created": 1580917953,
              "upvotes": 7,
              "replies": {
                "fgm7b14": {
                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm7b14/",
                  "text": "(I only ever remember because I think **A**ffect - A for action, which means it's the verb one. :D )",
                  "author": "poeticbrawler",
                  "created": 1580919314,
                  "upvotes": 7,
                  "replies": {
                    "fgnaylo": {
                      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnaylo/",
                      "text": "But also, both affect and effect can be either nouns or verbs, just to mess with you. Affect as a verb and effect as a noun are the most commonly used, but they're not the only :)",
                      "author": "teaandtalk",
                      "created": 1580941075,
                      "upvotes": 3,
                      "replies": {
                        "fgo2j7o": {
                          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgo2j7o/",
                          "text": "True, but effect is only rarely used in its verb form. \"Affect\" as \"to impact/influence\" is far more common than \"effect\" as \"cause.\" Just like \"effect\" as \"result\" is far more common than \"affect\" as \"outward appearance\" or however you would technically define the noun affect. I still think it's easier to remember their common uses this way.",
                          "author": "poeticbrawler",
                          "created": 1580958269,
                          "upvotes": 1,
                          "replies": {
                            "fgodztu": {
                              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgodztu/",
                              "text": "Sounds like you've got a system that works for you, then! :)",
                              "author": "teaandtalk",
                              "created": 1580966843,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fgm02de": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm02de/",
      "text": "1) withdraw the paper immediately.   You could state that you think the methodology was flawed (which is very vague - you'll have to come up with better reasons).  Were you biased in your analysis - perhaps had a 'confirmation bias' where you selected 'good' data and rejected 'bad' data?\n\n2) it is hard to suggest a course of action because we don't have the details on the data manipulation.   Did you do these measurements yourself?   How egregious was the manipulation - did you selectively choose the data that gave you 'the right answer' like I just mentioned?   Or did you flat out create numbers, is the data set fake?",
      "author": "arachnidtree",
      "created": 1580915094,
      "upvotes": 5,
      "replies": {}
    },
    "fgm33t1": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm33t1/",
      "text": "Honesty is the best policy, but try to be honest in the right way. I wouldn't go in accusing yourself of data manipulation. \n\nI would explain what you did and say that it wasn't until your ethics paper that you realised your blunder and you wanted to stop it now before there were any further repoccusions. \n\nYou've done something wrong, you have to face the consequences. It's better that you are the one that alerts them to the error than someone else. \n\nBut you should ask yourself; were you really naive in your actions? Or was there a part of you that knew what you did was wrong.",
      "author": "DrRobotniksMachine",
      "created": 1580917052,
      "upvotes": 6,
      "replies": {}
    },
    "fgme6re": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgme6re/",
      "text": "Go to your advisors and tell that you are not comfortable with the current results because you can't produce the results and you deleted the raw data. If you say your methodology is flawed, your advisor would go through the methodology and see that everything is fine. Instead of it, you can say there is probably a bug in the code (which you can't find at the moment because you were a stupid undergrad and couldn't organize your stuff well) you used for post-processing and at the moment it is impossible to produce the data.\n\nIt is is against any kind of ethics you can imagine, but it is a way to get rid of this problem without harming anyone and keeping your degree. What you did was incredibly stupid and it is fair that you face the consequences but losing your degree over something like that would be probably too much. I hope you solve your problem and don't do something like that ever.",
      "author": "atrlrgn_",
      "created": 1580922799,
      "upvotes": 9,
      "replies": {}
    },
    "fgnuhvs": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnuhvs/",
      "text": "This is why we do ethics case studies in my research group. In fact we had one discussing the effects of data manipulation and what counts.  It may seem obvious to older members but I still think discussing it preemptively erases any tendencies, at least I hope it does.",
      "author": "RaddishEater666",
      "created": 1580953181,
      "upvotes": 6,
      "replies": {}
    },
    "fgnmosy": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnmosy/",
      "text": "I’m sorry, you deleted the raw data after completing the project? So there was manipulation AND a cover up? This needs to be withdrawn ASAP.",
      "author": "Mallornthetree",
      "created": 1580948200,
      "upvotes": 6,
      "replies": {}
    },
    "fgo6p2f": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgo6p2f/",
      "text": "Seriously ?  I was doing my undergrad research project and I messed up massively and my supervisor thought it was really good results, but I didn’t even hesitate I told my supervisor it wouldn’t work. Although I didn’t produce good results, I instead moved on from this mistake and re-enrolled a new project with another supervisor, I would never ever imagined misleading people with sneaky lies like what you did.  I really don’t want to leave any negative comments to anyone, I hope it you won’t take it offensive. But , to be honest, what if you’re the people who engineered Apollo 11 spacecraft, or the managers who neglected the existing problems of the o-ring, you could be bringing disasters to others. Sorry but your attitude, attempt to shy away from your mistake and dishonesty are really triggering.",
      "author": "_haarp_",
      "created": 1580961112,
      "upvotes": 5,
      "replies": {}
    },
    "fgmc0ni": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmc0ni/",
      "text": "> I honestly had no intent of deceiving anyone\n\nSo, based on your edit, we all know this isn't true. \n\nYou need to tell your advisor now, before anything spins further out of control. Then take a long look in the mirror, and see if you can find a place of integrity from which to move forward.",
      "author": "lucianbelew",
      "created": 1580921690,
      "upvotes": 11,
      "replies": {}
    },
    "fgm1159": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm1159/",
      "text": "You need to find a way to pull the paper. It could be as simple as saying you're not sure you want to publish this early on incase you change your mind on certain things later on, or you're not sure the paper is your best work, or be semi-honest and say you think you made some errors, or be really honest and say you lied to get a better grade for your BA. Can't advise which of those options is best, but if you publish that paper you're in trouble. If you pull it, you can continue your masters and publish later on.",
      "author": "LiftingHistorian",
      "created": 1580915730,
      "upvotes": 5,
      "replies": {}
    },
    "fglqazj": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglqazj/",
      "text": "How could it be easily detected",
      "author": "corncornhell",
      "created": 1580908037,
      "upvotes": 10,
      "replies": {
        "fglqztn": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglqztn/",
          "text": "Two images look similar, and that's not the only issue. There are severe issues in the methodology. I was inexperienced and made several mistakes, but this one is something that is killing me. I didn't get any guidance from his end, but I take the entire responsibility",
          "author": "shawna5564",
          "created": 1580908628,
          "upvotes": 10,
          "replies": {
            "fgm3jkt": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm3jkt/",
              "text": "nobody understands what you're saying when \"two images look similar\". you're being really unforthcoming about what you did, and its hampering this community's ability to give you the best possible advice.",
              "author": "100011101011",
              "created": 1580917327,
              "upvotes": 27,
              "replies": {}
            },
            "fglross": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglross/",
              "text": "Are they images or figures, and did you Photoshop an image? If not then just point it out to your advisor, and ask him what to do or if it's even a problem. Is the methodology not what you used, or is it just not the best? \n\nI'm failing to see the data manipulation you mentioned in your post, so can you be more specific about what it is that you did that makes you concerned?",
              "author": "Littlefingersthroat",
              "created": 1580909200,
              "upvotes": 32,
              "replies": {
                "fglzxj8": {
                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglzxj8/",
                  "text": "Yeah, I'm not following the issue here either. If the manipulation would be easy to find, then their advisor should have seen it. If it's an issue of bad methods/methodology, advisor should have caught that, too. The \"images are similar\" thing sounds more like plagiarism to me.\n\nOP, we need to know what exactly is making you feel like you \"accidentally manipulated data.\"",
                  "author": "glass-o-sass",
                  "created": 1580915005,
                  "upvotes": 27,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fgmtqp3": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmtqp3/",
      "text": "What a horrible situation to be in. You have my sympathies OP, but you need to try and calm down. Whatever happens will not be so bad you won’t be able to carry on living.\n\nBe honest, try to hold your head up and face whatever comes as a consequence head-on. \n\nThe severity of your actions is only just hitting you and I do believe you didn’t genuinely intend to hurt anyone. \n\nYou are human, and you fucked up. \n\nOthers would double down on the deceit and try to hide it while it ate away at them, eventually getting found out and subsequently being seen as an absolute liar and charlatan. You’ve done the right thing, and that does show integrity, even in at a later stage than ideal. \n\nFace the music. Don’t panic. Don’t do anything stupid. You made a stupid decision but there must have been a real reason behind it, other than ignorance. Was it simply that you had nothing and did this just to get through? Or did you want to excel with groundbreaking research? Ask yourself what your motives were and be honest about them with yourself, and with those that question you. \n\nYou will be ok.",
      "author": "MickyWasTaken",
      "created": 1580931873,
      "upvotes": 10,
      "replies": {}
    },
    "fgmccdm": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmccdm/",
      "text": "Why are people trying to help this cheater deceive his advisor, the journal, and everyone that’s cites their paper?  \n\nIf their false data gets published and later must be withdrawn it will hurt everyone who cites your work. \n\nYou need to own up to what you did. Being an undergrad is not an excuse for cheating. Hundreds of undergrads publish work that is fine. You went out of your way to manipulate your data to lie to your advisor and  now because you lied to them about your results you are going to lie to more people? \n\nCome clean now and hope that your advisor will take it as a learning experience. Otherwise you will get found out and your career will be over.",
      "author": "Pr3ttyWild",
      "created": 1580921865,
      "upvotes": 13,
      "replies": {
        "fgmr0xz": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmr0xz/",
          "text": "And why come here now? Even a little earlier in the process is much easier to help with. \n\nAssuming you even take the stance that it's worth helping. It's so daft to do it at this stage in your career, given the thesis isn't even marked on how sexy the results are.",
          "author": "dl064",
          "created": 1580930297,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fgoeckz": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgoeckz/",
      "text": "Regardless of what decisions you made before, I think it takes much courage to be honest and let your advisor and dean know about this situation. Echoing what many people have already mention, please take this slow and take care of your mental health. This would allow you to handle the consequences and what comes next properly - remember that other people might also need some time to calm down and process this situation rationally (like you had to experience when making the decision to be honest), so it's understandable that they've reacted strongly to the news at first. Besides immediate actions that need to be taken (e.g., withdrawing the paper), I think you should continue communicating with your advisor and be open to discuss next steps to move forward.\n\nOn the note about taking care of your mental health, try taking a step back and consider how this single event might not be reflective of your life as a whole. You are a human being with multiple values and purposes - your life is meaningful. Think of the reasons why you are living besides academics (e.g., your family and what they would want for you, your important values and how what you are doing right now upholds them). Reach out for help if you need it.\n\n[https://suicidepreventionlifeline.org](https://suicidepreventionlifeline.org)",
      "author": "HugeKaleidoscope",
      "created": 1580967157,
      "upvotes": 6,
      "replies": {}
    },
    "fgm1nty": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm1nty/",
      "text": "Do the right thing. Withdraw the paper.",
      "author": "BananasonThebrain",
      "created": 1580916136,
      "upvotes": 3,
      "replies": {}
    },
    "fgmbbqj": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmbbqj/",
      "text": "Well, someone's gonna figure it out eventually, as you pointed out. Either a reviewer, someone in your field, or you fess up to your advisor. The difference is that if it does get published, you can cause harm to the science community, *and* you'll probably still get in trouble with your advisor reporting you to the dean or whatever. If you fess up now, and explain how exactly it was unintentional (you're gonna have to be clear and completely honest on that), then best case is that it gets pulled, fixed, and resubmitted, and you get a harsh reprimand. Worst case is you still end up getting reported and whatever, but at least it won't be as severe and your action doesn't affect people outside your circle.",
      "author": "valryuu",
      "created": 1580921352,
      "upvotes": 3,
      "replies": {}
    },
    "fglvp81": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglvp81/",
      "text": "I agree with the commenters that it’s difficult to offer advice without knowing exactly what your concern is. I have an unfortunate amount of experience with data manipulation (being pressured to do it, to which I have not relented, and because of that I have few publications...but that’s a story for a different day...sigh)",
      "author": "phdfirst",
      "created": 1580912069,
      "upvotes": 8,
      "replies": {}
    },
    "fglqgxh": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglqgxh/",
      "text": "If it's something that can easily be detected by a quick look, this is largely your advisor's fault.  Nobody should just take data from an undergrad thesis without carefully examining it.",
      "author": "journalofassociation",
      "created": 1580908180,
      "upvotes": 16,
      "replies": {}
    },
    "fglw910": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglw910/",
      "text": "Think about possible sources of error. Write them that you went through the numbers and realised you did a big mistake because you mistook/miscalculated XYZ.",
      "author": "idk7643",
      "created": 1580912453,
      "upvotes": 5,
      "replies": {}
    },
    "fgnjokr": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnjokr/",
      "text": "I took a course on teaching that taught us what happens when you report a student for academic cheating (like on tests), and oftentimes, the student goes to counseling to get to the real issues behind the cheating. Cheating is often a product of overly stressful work environments. \n\nI am not here to say that what happened is okay. But I really hope your advisor and the dean can take some time and read some literature and approach this better. They may not. This was a serious thing that happened, but I am SO PROUD of you for doing the right thing. These are the kinds of stories we need to be sharing in the academic community: stories of what went wrong and how to solve them. Having extremely harsh measures for someone who was falsifying data will only make others go to greater lengths to cover their tracks instead of making science more transparent. \n\nIf worse comes to worst and you struggle to get a career in research after this, consider some tangential careers. This experience may make you an empathetic, understanding, and wonderful teacher of your own ethics class. \n\nThis situation must feel so overwhelming right now, but you are doing as well as you can under the circumstances. Hang in there. Go to your support group and get the support you need.",
      "author": "OptimalDimension1",
      "created": 1580946274,
      "upvotes": 7,
      "replies": {}
    },
    "fgojm6b": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgojm6b/",
      "text": "I have seen your edits. You need to speak to the welfare office or a counselling service. This is 100% not worth ending your life over. Things like this happen and people go on to fulfil successful careers. Don't let this defeat you, it's a hard lesson but one you will grow from. \n\nI have had my fair share of humiliating setbacks but I have come out the other side. You can too. \n\nLook after yourself, owning up to your mistake is hard but it's worth it and you did the right thing.",
      "author": "DrRobotniksMachine",
      "created": 1580972435,
      "upvotes": 6,
      "replies": {}
    },
    "fgn1f95": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgn1f95/",
      "text": "It is important to know that you can come clean and recover professionally from this.  I have a colleague who had a plagiarism/data manipulation-type issue that came out, and after acknowledging it, went on to re-build and have a decades-long successful and respected career in academia in the same field.\n\nEdit: omitted word inserted.",
      "author": "today888",
      "created": 1580935847,
      "upvotes": 2,
      "replies": {}
    },
    "fgm35sn": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm35sn/",
      "text": "Tell your adviser that you have concerns about the data, as has been mentioned. Without knowing for sure what you did it is hard to say how to go about it. Reading through the comments you may duplicated an image? If so tell your adviser that you think that those images are not representative of the results. More information needed though to give thorough advise.",
      "author": "Pop_pop_pop",
      "created": 1580917087,
      "upvotes": 2,
      "replies": {}
    },
    "fgm8rib": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm8rib/",
      "text": "You may first realize what kind of data manipulation you did, like making up data, changing some results, reporting only good results,... There are some different ways, and consequences might be different. You might tell this to a person that might know these issues and you trust or get some information from some authorized person in your university about these. At least you have an idea what would be the situation if things get worse.",
      "author": "shipleyD",
      "created": 1580920049,
      "upvotes": 2,
      "replies": {}
    },
    "fgn42fj": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgn42fj/",
      "text": "Coming clean is the best course of action--for yourself, your conscience, and your career.\n\nIf this is discovered by another person (especially a Reviewer) first, before you own the mistake, then the consequences will be far worse for you, your reputation, and your career.\n\nYou were an undergraduate, and your PI should have been more involved in your data analysis in my opinion, so this is not entirely your own fault.  But, regardless, YOU still committed a scientific sin, and that cannot be overlooked.\n\nBut if this error/manipulation TRULY doesn't change your scientific conclusions AT ALL, then I would suggest that you suggest submitting an erratum to the Journal and to your Advisor.  Cell regularly publishes these erratums for papers that have been previously accepted/published.",
      "author": "_Doctor_D",
      "created": 1580937312,
      "upvotes": 2,
      "replies": {}
    },
    "fgnox45": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnox45/",
      "text": "You did the right thing talking to the dean and your advisor about it. No matter the consequences, remember that it could be way worse if you hadn't. This could come back and ruin your career at any point in the future if you hadn't done anything about it. There are very famous cases of prominent researchers committing data manipulation to publish in high impact journals and when it got out, the repercussions went even further than the individuals and their institutions. So, you definitely feel terrible now, and the paper should be drawn, but in my opinion, in the long run, this was the only way to handle things properly.",
      "author": "footyshooty",
      "created": 1580949671,
      "upvotes": 2,
      "replies": {}
    },
    "fgog38v": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgog38v/",
      "text": "To be blatantly honest. You did it knowing what you are doing, and now that you have a chance of getting caught you are trying to somehow cover it up, come out as innocent?\n\nI am pretty sure if there wasn't a chance of you getting caught you would never have even been slightly bothered about it. \n\nHave some decency and tell your advisor what you did and then let them tell you what to do next.\n\nEdit: I am really sorry for being too harsh in my comment. I wrote it at the moment without thinking how am I coming out. You did the right thing OP. Hope everything goes well with you.",
      "author": "kosmikroid",
      "created": 1580968741,
      "upvotes": 2,
      "replies": {}
    },
    "fgngn7d": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgngn7d/",
      "text": "I am just an undergraduate and don't have as much as experience as most of the people in the comments here, yet even I can tell that this is an inexcusable offense, whereby you destroyed any potential career in the scientific community. \n\nBut it's not a life-ending event as you make it out to be. Apply your skills and work ethic (the good parts that got you this far in the first place) to a different career path, and you'll most likely still have a good life that is worth living for. Don't throw everything away for one stupid mistake.  Please don't. Wishing you all the best for the future my dude!",
      "author": "ThreeFingersHobb",
      "created": 1580944467,
      "upvotes": 5,
      "replies": {}
    },
    "fgnmh4i": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnmh4i/",
      "text": "OP, you did the right thing. You came clean, took responsibility. You have a strong moral compass, which is what it takes to be a good researcher. There are so many who manipulate data to publish and never look back! Don’t worry even if you’re expelled. It is not the end of the road.  Don’t take a permanent step (killing self) for something transient. You will find a way. Remain patient. All will be good.",
      "author": null,
      "created": 1580948058,
      "upvotes": 4,
      "replies": {}
    },
    "fgm2p03": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm2p03/",
      "text": "Most people here are jumping the gun without knowing what 0P means by “manipulation.”",
      "author": "nc_bound",
      "created": 1580916792,
      "upvotes": 4,
      "replies": {}
    },
    "fglz6vw": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglz6vw/",
      "text": "Honestly, make up a different excuse for a reason you don’t want to publish the paper. Everyone makes mistakes, sometimes bad ones, you shouldn’t have your career ruined for it. If you think you can avoid persecution coming clean to an advisor, do so but if it is too risky it is your work and you can basically make sure it never sees the light of day if you don’t want it too.",
      "author": "NorthGrapefruit",
      "created": 1580914505,
      "upvotes": 4,
      "replies": {}
    },
    "fgo3onh": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgo3onh/",
      "text": "I'm sorry but do you have any proof? You said it was manipulation but  now you're saying it was a mistake? (a very confusing one, it seems)\n\nHow can a 3.92 GPA masters candidate of a \"reputed college\" not explain something so simple?\n\nYour advisor didn't notice the \"mistake\"? Why are you even posting this here?",
      "author": "limjeck",
      "created": 1580959041,
      "upvotes": 2,
      "replies": {}
    },
    "fh6prv0": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fh6prv0/",
      "text": "PLEASE STOP!!!! I JUST JOINED BECAUSE OF YOUR POST! I promise you, promise you that your life is and will be amazing.  You are in a bit of shit.  So what?!  You can still change your future.  You have admitted your mistakes.  You will pay the consequences.  And you will move on and live an amazing life.  Please do not take your own life and let your family feel unbearable pain for the rest of their lives.  Sometimes in academia, life seems like it has to be a straight path.  You write papers, you complete degrees, you move up.  You feel that you can't live your life because that path is being cut short.  It's not.  Even if they take your undergraduate degree...that's fine.  You know how many hustlers out there making more money than I will in a life time, that don't have a degree?  You will provide for your family because you have wit and you're ambitious.  You made a mistake.  We all have at one point or another in our lives.  Please please please see past this one event in your life.  My friend almost killed himself.  His mom intervened and now he is married with two lovely daughters.  He would have left a hole in our hearts if he cut his life short.  Your advisor and the dean will be upset....and that's fine.  They have a right to be.  But I promise you that they don't want you to end your life and neither does your family.  I don't know you, but I wouldn't want you to end your life.  You are so valuable.  They will be angry but that doesn't mean you are a bad person.  It just means you made a mistake and you have the ability to change.  Live life to the fullest.  Look for anything beautiful during this time.....sunshine, rose, children, etc.  Relax and destress...get a massage, talk to a counselor.  Call the suicide hotline 1-800-273-8255.",
      "author": "You_R_Important",
      "created": 1581303108,
      "upvotes": 1,
      "replies": {}
    },
    "fh9tru7": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fh9tru7/",
      "text": "Please don't hurt yourself. It will be hard to rebuild from this, but you can do it.",
      "author": "shhhhhhhhhhhhhs",
      "created": 1581389424,
      "upvotes": 1,
      "replies": {}
    },
    "fgoplct": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgoplct/",
      "text": "Please know, the humiliation will go away. Learn from the feeling and keep going. You made the right decision to stop the process before publication causing serious harm to your credibility outside of your institution. \nYou can move on from this. Your advisor was a jerk for saying what they said. \nYou’re the kind of person who does the right thing in the face of great fear.  F them and what they were going to get out of it.\nSee a mental health counselor at school immediately to help you move on. The world needs ethical scientists! I’m proud of you too.",
      "author": "cerisebettie",
      "created": 1580980288,
      "upvotes": 1,
      "replies": {}
    },
    "fgmoo36": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmoo36/",
      "text": "People make mistakes and you will learn from it. This process won't be easy but you are doing the right thing and everything will ultimately be OK. You are an undergrad and young and there will be time to get a second chance. The paranoia of submitting the paper and waiting to be discovered would be much worse I think.",
      "author": "jett11",
      "created": 1580928901,
      "upvotes": 1,
      "replies": {}
    },
    "fgn301a": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgn301a/",
      "text": ">It was unfortunately selected for publication in a reputed journal and we have recently received a notification.   \n\n\nWhy would you submit it to a journal knowing you did this.  \n\n\nI have very little sympathy for you. Making stuff up in your undergrad thesis is fine (well not really, but it's done and most universities would be oblivious). But why would you then pursue research and bring that data-manipulation back up.",
      "author": "ExoticExchange",
      "created": 1580936717,
      "upvotes": -1,
      "replies": {
        "fgo2oec": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgo2oec/",
          "text": "Sometimes others will submit a paper on your behalf. I wouldn't assume the OP submitted it.",
          "author": "shan22044",
          "created": 1580958365,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fgmwvu0": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgmwvu0/",
      "text": "[deleted]",
      "author": null,
      "created": 1580933572,
      "upvotes": -3,
      "replies": {
        "fgo2s55": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgo2s55/",
          "text": "GPA to 0. Seriously? You do realize that GPA are an average, right?",
          "author": "shan22044",
          "created": 1580958437,
          "upvotes": 6,
          "replies": {}
        },
        "fh9genz": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fh9genz/",
          "text": "Actually, shame on YOU. Careful not to fall from your ivory tower of hyperbole and assumption there. You don’t know much about the what or the why, which seem to me like things a PhD student would make sure to possess before making some kind of bold claim. We all fuck up good in life at times, in various ways, for various reasons. Perhaps mental illness played a significant role. Would they still not deserve some assistance and possibly a second chance?",
          "author": "69420800851337",
          "created": 1581380713,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fgo33ny": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgo33ny/",
      "text": "You should not do anything rash right now.\n\nGet some fresh air and consult a trusted friend. You did your due diligence, and it's no longer in your hands.",
      "author": "falling_maple",
      "created": 1580958650,
      "upvotes": 1,
      "replies": {}
    },
    "fglx9ql": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglx9ql/",
      "text": "I understand the situation, I believe. You manipulated the data knowingly, and the consequences of admitting this will be severe. I won't suggest what you should do, but just ask you to get priorities right. Do not sacrifice yourself for the field or \"science\". You don't owe anything to the field. Altruism gets you nowhere in today's academia.\nThe only person other than you that you should care about is your advisor, not because of concerns about their reputation but because he/she is going to write recommendation letters for you. \nThey are responsible for overseeing you, but no PI has time to do that. Consequently  I believe that there's a LOT of undetected data manipulation in scientific journals by undergrads, grads etc.",
      "author": "pravaasi2019",
      "created": 1580913177,
      "upvotes": -16,
      "replies": {
        "fgma5ap": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgma5ap/",
          "text": ">You don't owe anything to the field.\n\nOP absolutely has a responsibility to NOT allow data that they blatantly falsified to be published. Academia is bad enough without even more false data.\n\nDon't even pretend that a \"take no prisoners\" attitude toward career advancement makes this morally or ethically acceptable in the slightest.",
          "author": "Decisionsota",
          "created": 1580920760,
          "upvotes": 26,
          "replies": {}
        }
      }
    },
    "fgm4yxf": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm4yxf/",
      "text": "You wrote a paper based on your bachelor's thesis. This is likely to be mediocre work at best. There are millions of papers published each year. You do nothing and hope for the best. You tell yourself that it's not important in the grand scheme of things. The fact that there exists a bad paper with some questionable result doesn't matter since bad papers are invisible anyhow. No-one is going to waste time reading a bad paper carefully. After a couple of months your guilt will dissipate and you forget about this",
      "author": "perhapsaturningpoint",
      "created": 1580918083,
      "upvotes": -16,
      "replies": {}
    },
    "fglw1e7": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglw1e7/",
      "text": "Just to provide a contrasting point of view: nobody reads papers anymore, peer review is trash, and journals are full of falsehoods.",
      "author": "iyzie",
      "created": 1580912303,
      "upvotes": -44,
      "replies": {
        "fglwrfk": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fglwrfk/",
          "text": "That may depend on your field; I do read papers.  \n\nAs to the other points: they're not contrasting, they're to at least some extent true. The question is if you should then become part of the problem, violate professional ethics, and damn the consequences, or be better than the system and come clear. I think that's not such a difficult choice to make. OP needs to fix this.",
          "author": "axialintellectual",
          "created": 1580912818,
          "upvotes": 17,
          "replies": {}
        },
        "fgm124j": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm124j/",
          "text": "[removed]",
          "author": null,
          "created": 1580915748,
          "upvotes": 6,
          "replies": {
            "fgm2qvl": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgm2qvl/",
              "text": "[removed]",
              "author": null,
              "created": 1580916825,
              "upvotes": -7,
              "replies": {}
            }
          }
        },
        "fgnj8fg": {
          "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgnj8fg/",
          "text": "There is truth in your words. I do read the papers, though. That's exactly how I know that they are trash and that peer review is broken. ;)",
          "author": "radionul",
          "created": 1580946008,
          "upvotes": 1,
          "replies": {
            "fgo5qm0": {
              "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgo5qm0/",
              "text": "\"nobody\" is an exaggeration, but it's close enough.",
              "author": "iyzie",
              "created": 1580960434,
              "upvotes": 0,
              "replies": {
                "fgoxi58": {
                  "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgoxi58/",
                  "text": "In many cases it appears the reviewers may not have even read it.",
                  "author": "radionul",
                  "created": 1580990844,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fgoerka": {
      "link": "/r/AskAcademia/comments/ez95ak/i_have_manipulated_data_in_my_research_paper_and/fgoerka/",
      "text": "Please don't do anything to yourself, you are an exceptionally honest human for having gone to the dean with this and confessed to the data manipulation. Even of they revoke your degree (which I sincerely hope they don't do) you have shown that you are an honest and trustworthy human being and that should account for something!",
      "author": "idash",
      "created": 1580967527,
      "upvotes": -1,
      "replies": {}
    }
  }
}