{
  "sid": "nr7t5y",
  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/",
  "title:": "Positives and benefits of a life in academia?",
  "text": "TLDR: Please tell a young aspiring academic about the positives of academia \n\nBeing a young researcher, about to do a PhD in biology, I thought I’d join this subreddit to get tips about and how to navigate a life in academia. Not going through the posts might have been a mistake however, because most of the content that reaches my feed from here is about how awful academia can be/ when to quit/ how to quit. \nI’m a bit jarred by all this and was wondering if the people on this subreddit who love and enjoy their lives in academia could write a few words.\nTo those who are struggling, I hope you find a career of your choice very soon ❤️",
  "author": "Binturong98",
  "created": 1622706305,
  "updated": 1634080788,
  "over_18": false,
  "upvotes": 172,
  "upvote_ratio": 0.96,
  "comments": {
    "h0fbnrn": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fbnrn/",
      "text": "I’d say this sub is heavily R1 biased, so I’ll comment about SLAC/PUI.\n\nI don’t have the stress of applying for huge grants. I have a small start up (tiny to most) that lets me spend money ensuring my undergrads do their projects for me. If I want grants? Sure, I can apply. But my success is not directly tied to others’ successes - the one fear I had throughout my grad career - not being able to support other PhDs.\n\nTeaching is a blast. Kids are dumb as rocks, and they’ll complain about a lot, but they’re also adults and for the most part are reasonable. Plus, I’ve found that the ones who are good are the ones who approach you, leading to quick self selection, where I have five brilliant students working with me on stuff. Are they slower than I’d be on my own? Fuck yes. I can run a study in a week, takes them all semester. But, my job isn’t dependent on me publishing - it will be determined how well these five motivated students do.\n\nThis summer, I’m writing a (wide range given) 24,000-52,000 word (about 100 pages) brief book. To just sit and write all day - the scary part is thinking of the profs who push out 300 page books a year (my advisor). I don’t have that big of an ego. But still, to write all day has been immensely pleasurable. My research continues slowly, and I keep so many different projects in the air at one time that I can task switch out if I’m bored.\n\nI answer to mostly me. I did a non ac post doc, and having a true boss was unideal. My work was great; but I didn’t like having someone checking on me on how it was going, or getting approval.\n\nI have an amazing and supportive spouse who is changing her career based on our move. The pandemic changed the change plans, but also bought her a year of work-from-home life that made her realize she wanted a career change. She also has equal power to pull the plug at any moment, which helps keep me motivated in my own research, since I’m not focused on my tenure packet (They’ve told us if we want it we’ll get it and research doesn’t matter) but for the job market, which is both insane but gives me something to fight for.\n\nBasically, I pursue projects I like, with smart students and students who want a chance, with no true worries on grants, and have a spouse who is my rock.",
      "author": "MrLegilimens",
      "created": 1622718345,
      "upvotes": 92,
      "replies": {
        "h0g5c7l": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0g5c7l/",
          "text": "I just want to say thank you for this reply. Right now I'm just PhD student at an R1, but it has been my dream to be TT at a small liberal arts college. Recently i have been feeling burnt out and wanting to leave academia when I'm done but this just re-affirmed for me why I wanted to pursue this in the first place.",
          "author": "Comfortable_Ad9816",
          "created": 1622733189,
          "upvotes": 20,
          "replies": {
            "h0gaqpq": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gaqpq/",
              "text": "Of course! Keep pushing that dream. I had a lot of negative feedback from my advisor when I wanted this kind of position - he felt me seeking additional teaching opportunities (teaching over the summer -- money wasn't an issue, I was funded over the summer anyway) was delaying my research and not contributing to my job chances. But on the market, they spoke about the importance of having that additional teaching opportunity was critical.\n\nI will also say my post-doc definitely secured me my job - the difference between year 1 market and year 2 market were night and day, and the only difference was being in a competitive postdoc.",
              "author": "MrLegilimens",
              "created": 1622735407,
              "upvotes": 9,
              "replies": {
                "h0h38d5": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0h38d5/",
                  "text": "Thanks for this (and for the OG comment); I really hate how teaching is discouraged in so many PhD programs, especially at R1s. I did undergrad at a small Lib arts university and desperately want to return to one to teach (if I remain in academia). I love watching the critical thinking process evolve in my students and teaching them to put complex science into human words, which I think is a strength of a lib arts education.",
                  "author": "tsp_of_dopamine",
                  "created": 1622747206,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "h0hrhet": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hrhet/",
              "text": "I'm at a small faith based liberal arts university.  4k students.  reach out if you want to hear more about this life.  i love it.",
              "author": "printandpolish",
              "created": 1622757520,
              "upvotes": 3,
              "replies": {}
            },
            "h0if1u6": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0if1u6/",
              "text": "> it has been my dream to be TT at a small liberal arts college.\n\nIt's a good gig. I went to an SLAC in the 80s and decided that was what I wanted to do for a career by age 20. Through grad school in the 90s (three degrees) I never once had an advisor or committee member with any experience in SLACs or who cared about anything other than research/publishing. They weren't opposed to the idea, but following the model of all R1s they just expected all their grad students to also aspire to the R1 market. So I was pretty much on my own in navigating career prep and the job market.\n\nI've been an SLAC faculty member for 20+ years now. It's not exactly like I'd imagined when I was a student-- the reality of academic labor has changed a lot since the 1980s --but it's still a great gig on the whole. I can't imagine myself doing anything else, and now that I'm on the down slope toward retirement (10 more years perhaps) I have no regrets about having chosen this path, save at times the relatively low pay compared to other professionals with similar levels of education. \n\nAs a department chair with a lot of hiring experience, I'll offer a bit of unsolicited advice: if you want to work at an SLAC get as much real teaching experience as you can before you go on the market (TAing doesn't count) and study pedagogy relevant to your field. Take teaching classes if they are offered in your department, if not go to workshops on campus and ideally at your professional meetings. We don't hire people without serious teaching experience and the best candidates will not only have that but will be fairly sophisticated in talking about pedagogy as well. In fact, we often look to new hires to be innovators in teaching-- we learn from them as they are encountering new ideas in graduate school and through their professional associations.",
              "author": "SnowblindAlbino",
              "created": 1622768833,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h0g8ych": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0g8ych/",
          "text": "Maybe it's because I'm not from the US, but what is/are R1/SLAC/PUI?",
          "author": "NoOne-AtAll",
          "created": 1622734668,
          "upvotes": 9,
          "replies": {
            "h0g9v8i": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0g9v8i/",
              "text": "R1 - Research 1 Universities. https://en.wikipedia.org/wiki/Research_I_university\n\nTypically means that every* lab, or a majority of professors at the school, are receiving large NIH/NSF/Templeton/etc grants in the millions of dollars range. It houses a lot of soft money labs (labs that only exist based on grant funding) while also including hard money labs (labs whose salaries are still paid by the university). They're your research institutions. This steps down from R2 to R3, with each step down having less intense focus on getting those million dollar grants. R1s, 2s, and 3s have PhD programs since they're research focused.\n\nSLAC - Small liberal arts college; PUI - Primarily Undergraduate Institution. Generally interchangable, but SLACs will argue they're different because you have that liberal arts focus. Primarily teaching based colleges and universities, focus much less on grants - here, winning a $50,000 grant would be considered large. There is generally very little graduate level programs at SLACs and PUIs, and if there is, it's typically Masters level for professional certifications.",
              "author": "MrLegilimens",
              "created": 1622735045,
              "upvotes": 17,
              "replies": {
                "h0gt6t9": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gt6t9/",
                  "text": "Thank you! I knew different institutes and universities had different objectives, but I didn't think there was actually a common way to classify them. Will keep this in mind when looking where to apply for my PhD.",
                  "author": "NoOne-AtAll",
                  "created": 1622743017,
                  "upvotes": 3,
                  "replies": {
                    "h0gtgwj": {
                      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gtgwj/",
                      "text": "No problem! Typically you want to land at an R1 or an R2 for your PhD, just due to resources being more available (since, as stated, it probably is funded by large R01 NIH/NSF grants).",
                      "author": "MrLegilimens",
                      "created": 1622743131,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "h0ifzad": {
                      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0ifzad/",
                      "text": ">I didn't think there was actually a common way to classify them.\n\nMost of what people throw around here-- including R1/R2 --is actually now long outdated terminology. In the US the categories were defined long ago by the Carnegie Institution and the \"Research 1\" tag and similar are from a version of that system that was replaced 20 years ago. Note also that \"SLAC\" has never been part of that official taxonomy; in the current nomenclature they would usually be identified as \"Baccalaureate Colleges—Arts & Sciences.\"\n\nThe [current Carnegie classifications](https://en.wikipedia.org/wiki/Carnegie_Classification_of_Institutions_of_Higher_Education) are significantly different and more complex, so lots of people just ignore them and use the old familiar ones instead. This gets picked up by grad students and carried over into junior faculty on many campuses.",
                      "author": "SnowblindAlbino",
                      "created": 1622769294,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "h0hikut": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hikut/",
          "text": "It's currently my goal to end up at such an institution. As someone with a PhD in the sciences is it hard to get such a job?",
          "author": "SlothRogen",
          "created": 1622753763,
          "upvotes": 2,
          "replies": {
            "h0hjnwl": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hjnwl/",
              "text": "Well, as you can see from my flair, I'm in Psych, so I probably don't speak directly to your field (though, strangely enough, our department is housed in the Sciences...).  But I would say that treating it as a back-up or safety job is exactly how you don't get the job. Every job is competitive right now, and SLACs are on high alert because of the competitiveness.\n\nThink about it this way - in a non-competitive market, the R1-goal individuals apply to R1s, and generally get their goal. The people into teaching apply to teaching focused schools, they get their goal. While of course the job market is always terrible and this is definitely in a perfect situation, we can agree that this is how in a perfect world things would work.\n\nBut  in a competitive market, those R1 people are looking for ANY job. Maybe their post-doc ran out. They're clearly the best of the best- winning NSF GRFPs, maybe a T32 or something. But they don't get it. And they say, it's okay, I'll go this SLAC for a bit, buy a year, and then scoot on over to my dream job. Or, oh, I think I'll like this... and then realize, no, you won't, because teaching a 3/3 or a 4/4 is soul crushing and your research productivity tanks and you're miserable. Miserable - but still the best application in the pile.\n\nAnd so SLACs look at that great application and go, \"Hm. Do they actually want to have a 3/3 load, or are they so into research they're going to hate it here and leave, and we're going to have to do this whole thing over again in a few years from now?\" And, they might turn your application away in favor of someone else with a slightly worse CV but looks like they'd be more able to survive at a SLAC (and would not make an R1 short list).\n\nHow do you prove that yes, I was trained at an R1, but I'm not sold on researchz life? You teach. And not just the stupid TA stuff they make you do - yes, everyone has run a discussion section of Methods. But really be the instructor of record. Design syllabi. Get a teaching cert if your college has a teaching and learning center. Teach ethics at a business school for that sweet sweet summer cash ($8k/course for me). Teach over the summer to the five med-school track undergrads who need to prep for their MCATs. Teach.",
              "author": "MrLegilimens",
              "created": 1622754244,
              "upvotes": 9,
              "replies": {
                "h0igftd": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0igftd/",
                  "text": "> I'll go this SLAC for a bit, buy a year, and then scoot on over to my dream job.\n\nGood take here. As a department chair at an SLAC with a lot of hiring experience, I can affirm this. Especially the part about the R1 uber-researcher not being attractive to search committees. We hire to tenure and expect/hope people will spend their careers with us; the last thing we want is to bring on someone who won't be focused on the job and may leave in a few years. Ultimately *all* of the qualified applicants in an SLAC hiring pool are almost certainly capable of producing the level of research/publication required to earn tenure, but only a fraction are actually qualified/suited to handle the teaching/mentoring load that makes up 2/3 of the job.",
                  "author": "SnowblindAlbino",
                  "created": 1622769524,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "h0halax": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0halax/",
          "text": "I have a similar work life in a regional state university.",
          "author": "ThatProfessor3301",
          "created": 1622750339,
          "upvotes": 1,
          "replies": {
            "h0hem0s": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hem0s/",
              "text": "That's great to hear!",
              "author": "MrLegilimens",
              "created": 1622752048,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h0f0ddb": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0f0ddb/",
      "text": "There are tons of positives. I have loads of flexibility in terms of my schedule and what I work on, I can change projects by writing new grants. I'm not limited by directing my work towards a commercial product. \n\nI love my work, my research and my colleagues. The challenges are always the leadership (inept at best, corrupt at worst PIs with zero project management experience) and the politics that inevitably come from overworked managers with no training on how to be one.",
      "author": "the_mullet_fondler",
      "created": 1622708671,
      "upvotes": 130,
      "replies": {
        "h0f5eef": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0f5eef/",
          "text": "Is work flexibility common in academia? And to what extent is that the case?",
          "author": "Huskyy23",
          "created": 1622713262,
          "upvotes": 23,
          "replies": {
            "h0fay25": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fay25/",
              "text": "20 years ago I saw a sign on an academic’s door saying: “Academia is so flexible: work whatever 50 hours of the week you want!” Thanks to technology, it’s probably more now.\n\nBut yes, I can go to school assemblies or doctors appointments, and as long as I’m not teaching at the time, it’s fine.",
              "author": "ginisninja",
              "created": 1622717817,
              "upvotes": 89,
              "replies": {
                "h0fnbs5": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fnbs5/",
                  "text": "The curse of the freedom!",
                  "author": "unintegrity",
                  "created": 1622725292,
                  "upvotes": 5,
                  "replies": {}
                },
                "h0idlcb": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0idlcb/",
                  "text": ">I can go to school assemblies or doctors appointments, and as long as I’m not teaching at the time, it’s fine.\n\nIt's hard to overstate the value of this-- as a father I've almost never missed anything either of my kids did for school. They are 16/20 now and I was able to chaperone grade school field trips, go to lunch on parent's day, take their friends to the amusement park on school holidays, go to all their concerts/plays/games/etc. pretty much throughout. Now that my oldest is in college 1,500 miles away I've made the drive with her three times, which has been a delight.\n\nMost other fathers I know miss a *lot* of that stuff due to work. I just planned my teaching schedule so I never taught after 2:30pm when they were in school. My partner is professional staff at the same university and it's been much easier for me to do the doctor/dentist stuff too, sick days, etc.",
                  "author": "SnowblindAlbino",
                  "created": 1622768159,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "h0f9opv": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0f9opv/",
              "text": "You can work whichever 16 hours a day you want. Aside from classes and meetings which are at fixed times.",
              "author": "lolmasher",
              "created": 1622716863,
              "upvotes": 100,
              "replies": {}
            },
            "h0fhbsz": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fhbsz/",
              "text": "I teach a pretty heavy load (2-2.5 lectures, 2-3 labs, and most often supervising senior theses every semester), have pretty heavy committee work being at a small school, and have a bit more expectation of \"being available to students\" (i.e. in my office/workspace when students are around the halls in the workweek). But that said, I've never had to worry about scheduling a doctor's appointment, or even a haircut, during the workweek and don't have to tell anyone that I will be in late or leaving early to do so. I'm now in control of schedules for my department and have overloaded my Tuesdays/Thursdays to be able to often take off on Fridays for a long weekend during the school year (that said, I don't say that I'm not available for meetings on Fridays as that would be a bit unfair to other heavy-scheduled colleagues, but if I've got the day free of classes or meetings, I'll most likely not be on campus).",
              "author": "BangarangRufio",
              "created": 1622722000,
              "upvotes": 19,
              "replies": {}
            },
            "h0g7qwd": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0g7qwd/",
              "text": "I have a massive amount of flexibility. I can work whenever I want - I have no one overseeing me at all except for annual grant reporting and annual reporting to my chair. I am in a medical school so I barely teach, and the teaching that I do I wanted to do. My lab is established so I can leave for a week or more without any real issues as long as I plan ahead for meetings. I can also just disappear for a day without any real planning. I've set up my schedule to have no work on Fridays so that I can relax before the weekend... I completely disagree with the other replies here about the insane work hours. I think that a lot of people in academia love working so much and that is why they work crazy hours.\n\nAnd to /u/PersephoneIsNotHome asking about this in response to OP, I make more than enough money doing this, grant success averages to about 1/year (or a big grant every 2 years or so), and I moved for PhD, Postdoc, and to my faculty position.",
              "author": "dunnp",
              "created": 1622734173,
              "upvotes": 10,
              "replies": {
                "h0gonek": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gonek/",
                  "text": "I am happy for you but you should consider that if a lot of people are complaining about teaching load and service and grant funding it is likely to be a thing that people think it s a problem .  If you are at a Med school and on the more clinical side of things rather than the basic side, then I can absolutely understand why you think it is a great gig, because it is.  And then OP should keep track of what the funding lines are in certain areas and how much there is to go around and  what the expected load is for that track and how much your school supports that advancement track and dept because this makes a huge difference.\n\nBeing a law professor (n of 1 person whom I am jealous of) also seems like an excellent gig and does not require either the teaching , service or research load in my field.",
                  "author": "PersephoneIsNotHome",
                  "created": 1622741172,
                  "upvotes": 3,
                  "replies": {
                    "h0gssqj": {
                      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gssqj/",
                      "text": "All basic science. Yes, I can also complain about service and grant funding levels, but this is the positive side as OP asked.",
                      "author": "dunnp",
                      "created": 1622742860,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "h0geo2z": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0geo2z/",
                  "text": "I also think a lot of people in academia (especially in the US) greatly exaggerate the amount of time per week they are actually working. If people are actually putting in 80-hour weeks, as they claim, then they won’t be able to sustain that for long without consequences for their health.",
                  "author": "tlamaze",
                  "created": 1622737011,
                  "upvotes": 6,
                  "replies": {
                    "h0hau7q": {
                      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hau7q/",
                      "text": "Agree. I work less than 30 hours per week but I may be an outlier.",
                      "author": "ThatProfessor3301",
                      "created": 1622750444,
                      "upvotes": 3,
                      "replies": {
                        "h0hcac1": {
                          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hcac1/",
                          "text": "I suspect that you're not an outlier at all, at least not in hours worked. But then again, I also suspect that you might be far more honest and self-aware than most people!",
                          "author": "tlamaze",
                          "created": 1622751057,
                          "upvotes": 3,
                          "replies": {
                            "h0hyfk0": {
                              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hyfk0/",
                              "text": "I've recently started 1. working 6 good, focused hours a day and then cutting it off, and 2. actually tracking my time. I'm quite positive my productivity hasn't taken a hit at all from what I was doing before, when I was \"working\" 10 hours a day.",
                              "author": "FunnyMarzipan",
                              "created": 1622760725,
                              "upvotes": 2,
                              "replies": {
                                "h0oo49t": {
                                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0oo49t/",
                                  "text": "Way to go! I’ve read several articles online that suggest 25-30 hours per week is an upper limit for “knowledge workers” of various kinds - and it’s a better estimate of how much work people are actually doing.",
                                  "author": "tlamaze",
                                  "created": 1622900376,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "h0fatnw": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fatnw/",
          "text": "How often do you get those grants.  How much do you make and how often do you have to move?",
          "author": "PersephoneIsNotHome",
          "created": 1622717729,
          "upvotes": 6,
          "replies": {}
        },
        "h0id8pv": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0id8pv/",
          "text": ">There are tons of positives.\n\nWithout question. We complain about work like anyone does, but I'd bet nearly 100% of my professional colleagues in other fields would swap places with me given the chance. At least, most of them express envy frequently over all the positives we enjoy: freedom to set schedules and work objectives, not having a \"boss\" in a practical sense (other than the dean, whom I rarely see), lots of vacations, unstructured summers, being able to research/write frequently and on topics I care about, working with interesting young people who never age (i.e. they are always 18-22 in my world, no grad students), being surrounded by hyper-educated, interesting people (including most staff and admins, not just faculty), travel, a nice private office, etc. etc.\n\nI've worked for city/county governments and have many friends who work for state/federal government as well. While those jobs aren't bad, being faculty at a private university is almost unmeasureably better. Ditto people in law, medicine, industry, etc.-- the only real gripe I have is the pay and I feel foolish complaining about that often since I make 2x the median *household* income for my area as a full professor, albeit less than what other professional in the area make.",
          "author": "SnowblindAlbino",
          "created": 1622767994,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "h0f0375": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0f0375/",
      "text": "I wouldn't say love but I'm definitely happy with my life in academia at the moment.\n\nThere are plenty of fun challenges like coming up with creative ways to explore your data.\n\nThere's literally always more to learn that applies to your work in interesting ways.\n\nIt is a very conducive environment for personal growth, you'll probably at least have to come to terms with feeling stupid and ignorant in academia and channeling that into learning rather than shame and resentment. You can't know everything and that will keep being true for you forever.\n\nSometimes you're literally one of the first few people to know something new. And you probably won't notice it for days or weeks after the initial \"that's weird, what does that mean?\"",
      "author": "MarijnBerg",
      "created": 1622708416,
      "upvotes": 110,
      "replies": {
        "h0finb8": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0finb8/",
          "text": "Amen. Question from a PhD student: how do you ever come to terms with feeling stupid/not knowledgeable enough about basic things, when you already work or read papers every single day of the week? Volume of work is not my problem, desperate crisis where I stare at the screen wishing I was never born is.\n\nEDIT: THANK YOU for your answers. I'll keep them in mind and I'm already feeling better. Have a good day!",
          "author": "Ironrunner16",
          "created": 1622722770,
          "upvotes": 42,
          "replies": {
            "h0gdkxp": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gdkxp/",
              "text": ">\thow do you ever come to terms with feeling stupid/not knowledgeable enough about basic things, when you already work or read papers every single day of the week?\n\nMy job is to occasionally toss a pebble onto the mountain of accumulated human knowledge. I know everything there is to know about that pebble. I am the world’s expert on that pebble. Ask me anything about it, and you’ll die of old age before I shut up about it. \n\nBut no one can know everything about *all* the pebbles of the mountain. Hell, just the other day, I heard that on the other side of the mountain, there are pebbles that are a totally different color and composition than the ones I know about! Even near my pebble, there are other pebbles sorta like mine, but just different enough that I don’t know them so well. \n\nThere are two keys to not letting this crush your spirit. First, of course, is to always remember that everyone else is in the same boat as you: we all know a lot about a very little pebble. \n\nEvery now and again, someone tosses a slightly larger stone on that mountain and everyone looking at that face of the mountain notices — but even that person may have only a passing familiarity with the other faces of the mountain they contributed to, and they don’t even know that other mountains exist, that their mountain is just one in an entire range and there are mountains they’ve never seen of out there!\n\nThe second key to not always feeling like a dunce is to always be curious, whether it’s about nearby pebbles or that other face of your mountain, or hell, even that peak way off into the distance. It’s miraculous that there is so much to know, and we have the ability to try to know it. \n\ntl;dr: How do I cope? By knowing that everyone is ignorant of more things than they’re experts about, and by saying “oh that’s neat!” instead of “why didn’t I already know that?”",
              "author": "dr_police",
              "created": 1622736559,
              "upvotes": 36,
              "replies": {
                "h0gg9va": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gg9va/",
                  "text": "Love the pebble metaphor!\n\nI’ll add that early in my ph.d. I had a lot of stress about not knowing enough or not knowing the authors or terms my advisors were using all the time. But overtime you do learn more and you do become more familiar with things and that stress goes away. And you become more comfortable saying you don’t know something and asking your colleagues to fill in their pebble of expertise.",
                  "author": "salondijon8",
                  "created": 1622737681,
                  "upvotes": 9,
                  "replies": {}
                },
                "h0hrbu0": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hrbu0/",
                  "text": "Is one of those pebbles, “making amazing comments on Reddit?” \n\nBecause this was a perfect analogy (or whatever it’s called).",
                  "author": "northamrec",
                  "created": 1622757448,
                  "upvotes": 8,
                  "replies": {
                    "h0ipf2v": {
                      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0ipf2v/",
                      "text": "My dissertation advisor — and now, dear friend — shared this analogy with me during a rough patch during my training. \n\nI have found it useful throughout my career, especially when I do science that feels meaningless. Maybe it *is* meaningless by itself. But with all the other pebbles, it’s not meaningless! \n\nBut wait! It gets even better! \n\nI’ve already had one undergrad go on to grad school, get a PhD, and lemme tell ya, he’s a *f’ing rock star*. He’s going to toss way more pebbles on the pile than I ever will — but he never would have considered research without a little encouragement from me and including him on one of my little projects is probably the most impact I’ll ever have had on my field. \n\nWe all contribute. It’s not always direct or obvious.",
                      "author": "dr_police",
                      "created": 1622773916,
                      "upvotes": 5,
                      "replies": {
                        "h0krsuj": {
                          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0krsuj/",
                          "text": "This is one of my favorite things to dream about. That even one of my students will be inspired by something I do and will do something good thanks to my help.",
                          "author": "Ironrunner16",
                          "created": 1622820119,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "h0j5p8s": {
                          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0j5p8s/",
                          "text": "You sound like a great advisor.  Thank you for sharing this with us internet strangers.",
                          "author": "MabelUniverse",
                          "created": 1622782721,
                          "upvotes": 1,
                          "replies": {
                            "h0javd8": {
                              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0javd8/",
                              "text": "I don’t know about great. But I like my job. Sometimes that’s contagious.",
                              "author": "dr_police",
                              "created": 1622785952,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "h0gicf0": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gicf0/",
                  "text": "This is beautiful, thank you. I needed it.",
                  "author": "Ironrunner16",
                  "created": 1622738554,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "h0fkj3o": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fkj3o/",
              "text": "Ideally you're in an environment where people are pretty honest about not knowing things.\n\nTry noticing that many of the professors and PIs ask some pretty basic questions sometimes or ask for clarification.",
              "author": "MarijnBerg",
              "created": 1622723824,
              "upvotes": 30,
              "replies": {}
            },
            "h0gc3op": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gc3op/",
              "text": "Does your school offer therapy? Weekly sessions with a therapist in my school's Counseling and Psychological Services office were the only way I was able to finish my doctoral dissertation.",
              "author": "weareedible",
              "created": 1622735950,
              "upvotes": 4,
              "replies": {
                "h0gi37x": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gi37x/",
                  "text": "Yes, I am going to therapy and nope, my institution does not offer it. So I'm paying for it but I swear it might be one of two reasons I'm here writing this. Therapy and some important people in my life.",
                  "author": "Ironrunner16",
                  "created": 1622738448,
                  "upvotes": 3,
                  "replies": {
                    "h0h0clc": {
                      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0h0clc/",
                      "text": "Sucks you have to pay, but glad you're getting the services you need anyway!",
                      "author": "weareedible",
                      "created": 1622745989,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "h0hwtgw": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hwtgw/",
              "text": "How great so now all the smart people are going to kill themselves?! There should be a law against that :-)",
              "author": "SvenAERTS",
              "created": 1622759982,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h0ezh9c": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0ezh9c/",
      "text": "I would also love to hear some insights. I am starting my PhD in two weeks and it seems like a lot of the content here and in r/PhD are about why people want to quit.",
      "author": "Fyneman_",
      "created": 1622707853,
      "upvotes": 37,
      "replies": {
        "h0f5lp6": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0f5lp6/",
          "text": "That is human nature.  People are much more likely to post about unhappy experiences than they are about good ones.  It would be highly unusual for someone to start a thread along the lines of \"I am very happy in my fulfilling academic career\".\n\nBut, simply put, it is a good career - if you can hack it.  The main benefit, as noted is freedom.  No clock in/clock out, ability to set your own schedule (teaching duties allowing), freedom to do the research you are interested in (if you can sell it).  Lots of supported travel (conferences etc), which quite often are co-joined with a holiday - saving on airfares etc.\n\nThe downside is that that freedom to set your own schedule normally means you end up working more hours, rather than less.  Grants are great-  but you need to make the output.  You need to meet certain performance indicators (which can vary hugely).\n\nIt is hard work - but I would not swap it for any other career I can think of.\n\noh - and the money is generally crap.",
          "author": "Life_time_learner",
          "created": 1622713449,
          "upvotes": 60,
          "replies": {
            "h0faer7": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0faer7/",
              "text": ">It is a good career - if you can hack it.\n\nOr, if you can get a position. Your point regarding why subs like this are bombarded with negative posts is valid, but it's arguably very important for PhD students and aspiring academics to have a realistic impression of the chances that they will actually land a permanent position in academia should they want one. It's a numbers game, and generally the odds are not in your favor. It is a good career, but it's also a very niche career and it's better viewed in that sense.\n\nEDIT: I spent a while trying to think of an appropriate analogy. The best might be acting and actors. There are tons of aspiring actors out there and very few who \"make it big\". There are also a lot of very talented aspiring or under-employed actors who are quite good at what they do and just didn't get lucky in terms of getting a shot. The same can very easily be said of PhDs (lots of them, many of them talented / creative / etc enough that they would be successful academics, but still won't end up there for a variety of reasons out of their control) and tenure track professors (very few of them compared to the total number of PhDs graduating). Pursuing acting or getting degrees in drama / theater / etc can still be a very fulfilling and worthwhile pursuit and maybe even a useful major for a non-acting career, but in the same way that most acting students and actors will not be the next successful movie star, most PhDs will not get a TT job. The analogy of course breaks down when you consider that professors make a ridiculously tiny percentage of a what a movie star makes.",
              "author": "CrustalTrudger",
              "created": 1622717420,
              "upvotes": 42,
              "replies": {
                "h0ff4ac": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0ff4ac/",
                  "text": ">The analogy of course breaks down when you consider that professors make a ridiculously tiny percentage of a what a movie star makes.\n\nAnd also that there's been a concerted effort to casualize labour in higher education for the last 40 years.",
                  "author": "TheJadedEmperor",
                  "created": 1622720655,
                  "upvotes": 8,
                  "replies": {}
                },
                "h0fk2rb": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fk2rb/",
                  "text": "Interesting and thought-provoking analogy! I’m a professor who worked for a short time as a professional actor before pursuing a PhD in an unrelated field. One big difference between the two professions, in my experience, is that part of being an actor (at least for the vast majority) is that you are constantly hustling for your next job. That instability is one of the main factors that drove me out of acting, and I freely admit that I’ve valued the stability of tenure. I know that for scientists there is a similar constant hustle for grants, but it’s not quite the same as the grind of auditioning (and the experience of losing a grant because a lazy or hostile peer reviewer didn’t read your proposal carefully isn’t quite the same as the experience of losing a role because of your physical appearance - and nothing in academia compares to the degrading experience of auditioning for commercials).\n\nAnother difference is the sense of autonomy you have as a professor. When I began acting professionally, one of the biggest surprises I encountered was how little control I had over the creative process. I had a tiny window of freedom to create my character during the early rehearsals, but once the show opened, I was expected to do exactly the same thing in every performance. I never acted in film or TV, but it’s my understanding that the film actor has even less control. As an actor, you may be the most visible part of the business, but you’re just the “talent” at the bottom of the hierarchy. It’s different for superstars, of course, but consider how few actors can both achieve and maintain that status. Even though being a professor has many downsides (and yes, these jobs are extremely hard to get), it still offers considerable autonomy and the opportunity to be in the driver’s seat as a researcher, teacher, and administrator.",
                  "author": "tlamaze",
                  "created": 1622723578,
                  "upvotes": 3,
                  "replies": {
                    "h0fsqq1": {
                      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fsqq1/",
                      "text": "Arguably, postdocs have to constantly hustle for their next \"gig\", either a tenure track position (best case) or the next postdoc position if their current one is done with funding. Probably not as often as actors but often enough at that stage in life to be disruptive. Not sure what field you're a professor in, I'm talking more about STEM.",
                      "author": "dovaahkiin_snowwhite",
                      "created": 1622727887,
                      "upvotes": 11,
                      "replies": {}
                    },
                    "h0fpu6v": {
                      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fpu6v/",
                      "text": "If you are teaching or doing research then you have many other “directors” and standards and marks to hit , at least in many or most fields that dont allow a hell of a lot of creativity for the good majority of the time.  ONce I say these are my 3 aims, them is the aims I gots to do.  Unless I have a 2 credit upper level elective, then I cant wander off the beaten path very far either, and I do the same thing over and over again.\n\nActually I could write a script, and it would start by saying it is in the syllabus, but I digress.",
                      "author": "PersephoneIsNotHome",
                      "created": 1622726542,
                      "upvotes": 2,
                      "replies": {
                        "h0fsabn": {
                          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fsabn/",
                          "text": "Fair enough, but the OP is asking for positive perspectives on academia. I was using the acting analogy as an opportunity to reflect on things that I like more about my current job than my old one.",
                          "author": "tlamaze",
                          "created": 1622727686,
                          "upvotes": 1,
                          "replies": {
                            "h0ftnki": {
                              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0ftnki/",
                              "text": "I know what OP wants.  But if an aspiring 18-20 yr old starry eyed actor came up to yo and said, tell me only good things about being an actor, then there is a a fairly good chance that if you said, well, I don’t work 9-5,that someone standing next to you would point out that it was 5 am and you were on set to be able to get the right light.\n\nIf Op is a bit “jarred” by the reality that it is not real to say only positive things, this may be not a bad thing",
                              "author": "PersephoneIsNotHome",
                              "created": 1622728271,
                              "upvotes": 7,
                              "replies": {}
                            }
                          }
                        },
                        "h0fw7v6": {
                          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fw7v6/",
                          "text": "I completely agree that aspiring academics need to be confronted with the harsh realities of academic life. I’ve used many other threads to complain about academia or to encourage people to pursue alt-ac careers.\n\nBut not this one. This was an invitation to reflect on the pros for once, instead of the cons. It would be just as unrealistic for me to claim that there’s absolutely nothing good about my job.",
                          "author": "tlamaze",
                          "created": 1622729341,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "h0iht6f": {
                          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0iht6f/",
                          "text": ">I do the same thing over and over again.\n\nThis varies radically by field and type of institution. I've taught over 25 different courses at my current institution, many of them radically different from one another. Offhand I'd say 80% of those were entirely my design, with nothing other than broad learning goals (\"intensive writing\" or \"historical reasoning\") imposed externally. Even my bread-and-butter course which I've taught ever year since 1998 is different every single time I teach it-- new readings, different assignments, experiments with pedagogy --because I don't like repetition. I have never once taught the same set of courses two years in a row and have only one course that I've taught consistently throughout my career...I probably develop a new course every two years on average.\n\nBy contrast, I have colleagues in chemistry who teach the same three courses/labs year after year, with the same books and same lab manuals imposed by the department. That's the complete opposite of my experience and that of most of our faculty.",
                          "author": "SnowblindAlbino",
                          "created": 1622770223,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    },
                    "h0frbwx": {
                      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0frbwx/",
                      "text": "George Clooney said he liked auditions because he got to choose how to do the scene. And I think it was Phil Lamar who said that his day job was scheduling and going to auditions, and he didn’t consider the acting itself to be work.",
                      "author": "lifeofideas",
                      "created": 1622727250,
                      "upvotes": 2,
                      "replies": {
                        "h0ihx60": {
                          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0ihx60/",
                          "text": ">I think it was Phil Lamar who said that his day job was scheduling and going to auditions, and he didn’t consider the acting itself to be work.\n\nOne of my teaching mentors always said \"I teach for free, they pay me to grade.\"",
                          "author": "SnowblindAlbino",
                          "created": 1622770280,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "h0fwxnk": {
                          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fwxnk/",
                          "text": "That’s an interesting perspective. It certainly wasn’t my experience of auditions, though - especially commercial auditions. The movie LaLa Land has some great audition scenes that capture the feelings I remember. The life of most actors is nothing like the lives of the rich and famous few.",
                          "author": "tlamaze",
                          "created": 1622729645,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "h0fpcdk": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fpcdk/",
                  "text": "This is also a good analogy, because when and if you should get to that status of steadily employed actor or musician, there are a lot of things you have to do to be able to to the part of the job you like that you didn’t think of.  Starting at 4 am to spend long boring hours in make up.  Being cold or wet for long periods of time for that edgy film noir train station scene. You have the freedom to take roles you are offered, but if you did an ace job at being a cop and that is what you resume is,  it s going to be tough to go against that track record to get a lead in a Rom Com.  Etc.  Long periods of time of intense long hours followed by long periods of time of funding and job insecurity .  Certainly if you are at an R1 and research is a part of your life.  If not that, than your popularity with students, much like an actors popularity with a fan base can be a very fickle and certainly frustrating thing.\n\n\nAnd one bad movie or a couple unfunded grants and your place in your world can plummet pretty fast.",
                  "author": "PersephoneIsNotHome",
                  "created": 1622726305,
                  "upvotes": 1,
                  "replies": {}
                },
                "h0ih8qc": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0ih8qc/",
                  "text": ">The analogy of course breaks down when you consider that professors make a ridiculously tiny percentage of a what a movie star makes.\n\nI think it actually holds pretty well: the percentage of actors who pull down multi-million-dollar paychecks is tiny. We just know them because they are celebrities and get lots of attention-- but what about the tens of thousands of professional actors who do *not* make a bunch of money? I know working actors in their 40s/50s (peers of mine) who still hold second/third jobs, or who might do really well for a few years with a part on a TV show but then be totally unemployed for two years or just shooting pilots or commercials. Stage actors struggle even more.\n\nWhat percentage of American academics make $250K or more? It's a tiny fraction of the whole, but they are also mostly the celebrities that we see on TV or in politics or whose books become bestsellers. Faculty life in the US is not akin to being a movie star, but rather to being perhaps a character actor or someone with recurrent bit parts on a TV show.",
                  "author": "SnowblindAlbino",
                  "created": 1622769931,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            },
            "h0fectz": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fectz/",
              "text": ">The main benefit, as noted is freedom.\n\nAlthough you rarely get freedom to choose *where* you work! There are so few jobs that whatever offer you get is likely to be the only offer you'll get, and if it's in the middle of nowhere, bad luck. Anyone who wants real choice in where they live or who has serious limitations in where they can move to (e.g. for family reasons) is going to have a rough time.",
              "author": "officially_anxious",
              "created": 1622720177,
              "upvotes": 14,
              "replies": {
                "h0fx7ha": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fx7ha/",
                  "text": "This was the final straw for me to make an academia escape plan. Not only will I have a low chance of profhood, but you're telling me that even if I get that chance, I have to likely move to the middle of nowhere, possibly in a town full racists who will hate me for my race alone, AND I'll have shit pay for how much workload is involved and how much time I spent in my education? Not worth the opportunity cost. Still finishing my PhD, but I had to make a very clear plan for myself for how to prepare for getting into industry.",
                  "author": "valryuu",
                  "created": 1622729764,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "h0f8jjy": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0f8jjy/",
              "text": "Thanks. That was so well put. Needed to read this.",
              "author": "eshe2019",
              "created": 1622715970,
              "upvotes": 2,
              "replies": {}
            },
            "h0f98oi": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0f98oi/",
              "text": "Thank you so much for the information. This confirms some of the hopes I had going into this.",
              "author": "Fyneman_",
              "created": 1622716519,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h0g3jr7": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0g3jr7/",
          "text": "As a physics prof, I can give you some advice: have fun in your PhD, find an advisor with whom you can work with well and whose work engages you, and you'll have a positive experience. It will be extremely challenging (because understanding the universe is hard) but the people who excel are those who recognize that and enjoy the aspect of figuring things out. \n\nIt's pretty likely you can get a postdoc (probably 50-60% chance). However, going from postdoc to faculty is a pretty low chance (probably 1-2% chance). The good news is, PhDs in physics are extremely valuable in the workforce overall. There are usually some good industry spinoffs that hire our postdocs with open arms. In the 80's and 90's it was computer chip companies and manufacturers. At the moment it's data science, so if you have a chance to take some kind of coursework related to that, or using it with research analysis methods, it will be a good launch point.",
          "author": "rappoccio",
          "created": 1622732438,
          "upvotes": 10,
          "replies": {}
        },
        "h0fb558": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fb558/",
          "text": "redacted",
          "author": "zen_arcade",
          "created": 1622717966,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h0fn9no": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fn9no/",
      "text": "Positives\n- Lots of very smart people around you\n- Work can be very interesting and feel less like a job\n- A lot of freedom and independence \n- Colleges are good employers with good benefits good hr usually\n- Often very international, conferences and collaborations, can be a good opportunity to travel\n- Grants you easy visas for most countries if you wish to see the world\n\nNegatives\n- Publish or perish, low job security\n- Lack of structure, deadlines etc can often make projects feel tedious and never ending\n- A lot of responsibility on you, you need to want it to make it\n- Structural issues with publishing system, lots of nepotism and favours going on\n- Salaries are abysmal for what’s asked of you\n- You will encounter a fair few people who “cruise” through the system and aren’t very engaging\n- Proliferation of phds and professorships means the top rank jobs are very competitive but much less meaningful and rewarding than they once were (lol tenure)\n- Because of the freedom and independence it can also be quite a lonely career path",
      "author": "HailMary74",
      "created": 1622725262,
      "upvotes": 28,
      "replies": {
        "h0fqpw7": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fqpw7/",
          "text": "Just to add to my comment: if science is what you want to do a huge bonus of academia is it can be an AWESOME stepping stone into science industry. Getting on a good PhD program, getting some nice publications out, finding your expert niche and travelling to conferences, collaborators etc. I visited about 10 different countries with my PhD (although Covid might have spoiled this perk a bit). Then at the end of it all your primed to jump into a well paid industry job e.g. biotech in the Bay Area with salaries post-PhD that can be over 100k+.",
          "author": "HailMary74",
          "created": 1622726958,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "h0ffpib": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0ffpib/",
      "text": "Remember people tend to come online to either brag about the best parts of their life or vent about the worst! I think a lot of the issues raised on the reddit are valid (and I'm 'mastersing out' so really not one to offer a 100% positive picture of academia). But, I think you can log onto any subreddit about essentially any profession and find answers about how it's *the worst thing ever and anyone would be mad to do it.* People come on here in part to vent, not describe their generally fine week they're having. Doesn't mean you won't feel some of those things on certain days, but also probably discounts the number of days you'll come home happy and satisfied with how things are going.",
      "author": "Amazing-Ad-4364",
      "created": 1622721021,
      "upvotes": 15,
      "replies": {}
    },
    "h0f5s35": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0f5s35/",
      "text": "This is also a bit of an amplification bias. You don't vent when your work has you completely absorbed, you do that when things aren't working fine. \n\nAcademia is a cutthroat environment in many cases. Insecure funding, long hours, stress (a very high amount of academics have experienced depression at least once in their career)...\n\nBUT!!! These are things we complain about. I can go on rants for days, as everyone else around here. Administrative staff take the biggest chunk of complaints usually, you'll sure find that out.\n\nThe other side of the coin is ABSOLUTE FREEDOM. There are some obligations and stressful periods, but you can steer your research wherever you want. I am a data nerd (originally a plant ecologist), and I get to play with things I find interesting. It still requires getting money from grants and other sources, but if I have a good hypothesis, I will probably find money to go for it.\n\nAlso, I can decide to skip work one day because weather is good (or my dog is sick, which has happened often) and just make it up any other moment. Not worrying about a fixed schedule is a blessing in itself. Also, if you have an engaged group, all the interesting discussions you can have about everything and anything!",
      "author": "unintegrity",
      "created": 1622713605,
      "upvotes": 37,
      "replies": {
        "h0fnp5a": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fnp5a/",
          "text": "Yup, there's some amplification bias but also the fact that academia overproduces highly qualified PhD students who are passionate about being professors by at least a factor of 2 --- so there is bound to be disappointment for at least half the people\n\nAcademia is fantastic! The freedom to develop your own research program, the freedom with your schedule, the conference travel all over the world (and so excellent locations .. safari, galapagos, .. rather than just large convention centers). You choose to do academia because you love doing what you do (otherwise, if you don't love it, the pay is better in so many other jobs). Academia becomes a big part of your identity too, which is also why it's painful to leave\n\nReally the thing to be aware about is there are too few permanent jobs, so these days you need to go in with the mindset that you should also look into non-academic career tracks you can do with your degree.",
          "author": "cybersatellite",
          "created": 1622725486,
          "upvotes": 10,
          "replies": {
            "h0ftg5c": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0ftg5c/",
              "text": "I completely agree. It's not for everyone, and liking research is not the same as doing research. I have thought of leaving for more stable positions more than once, but in my book the advantages are more than the disadvantages. \n\nTenure track jobs and such are very hard to get, and that has to be made clearer in advance for people when they start the PhD",
              "author": "unintegrity",
              "created": 1622728189,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h0fb2xj": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fb2xj/",
          "text": "What are you doing that you can skip a week of work?",
          "author": "PersephoneIsNotHome",
          "created": 1622717919,
          "upvotes": -9,
          "replies": {
            "h0fn8ut": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fn8ut/",
              "text": "I said a day of work. And just to clarify, the freedom is not to just disappear into the mist. It is that I can organize my day more or less as I want to accommodate for whatever I want to do, as long as I do my tasks.\n\nIf I don't have any planned meeting, then I can decide to have a longer walk with my dog in the morning, or have that long phone call with my father to check on him. In science, a big chunk of our work is not time dependent (unless you are doing lab stuff). \n\nAnd this is a double-edged sword: you have the freedom to take one day \"off\", but then you need to put it back into the system. In general, plenty of academic jobs don't really follow a schedule: if your writing mood comes on a saturday evening, I bet my arse I will be writing until my fingers bleed. \n\nThe freedom to goof off comes with the responsibility to work hard. As long as I do what I have to do, I can organize as I want. \n\nIf you are in administration, or technician positions, this may be a different story. Other people depend on you on a daily basis and you will probably have  a more strict schedule to follow. But since OP wrote about PhD and the posterior academic life, I focused on these aspects (and still I wrote a long post...)",
              "author": "unintegrity",
              "created": 1622725251,
              "upvotes": 8,
              "replies": {
                "h0fqut8": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fqut8/",
                  "text": "Everything I do is time dependent.  In teaching, I have to have classes ready, grade stuff, make book orders and in my research I have grant deadlines etc.  I have a 5 year tenure/promotion clock that keeps running if I decide to take a longer walk with my dog.\n\nI can pick which 10 hours a day I want to work.  Unless of course I want to get any meetings or anything before I get the lab or class in which case it is email at 8 not longer walk with dog most days.",
                  "author": "PersephoneIsNotHome",
                  "created": 1622727022,
                  "upvotes": -4,
                  "replies": {
                    "h0fvu1g": {
                      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fvu1g/",
                      "text": "u/PersephoneIsNotHome, I am uncertain on what is your point. \n\nYou have a 5 year clock, if you have no classes nor meetings today, you could skip a few hours and just put them in later. Or depending on how you are evaluated, you may not needed. \n\nIf your evaluation is based on amount of published papers, then you work on getting those papers out. I work way more than a standard 9 to 5 workload, and \"no work\" in holidays means that my computer is turned off less than 5 minutes away from me, in case I need to do something (even if it is vacation time, or I'm sick). And I have obligations, meetings, lectures... the whole thing. Still I have enough flexibility as to decide to skip a day if there is nothing planned. \n\nI have deadlines too, but usually I manage to get everywhere with good time. \n\nI am happy to discuss details, but I don't get your point...",
                      "author": "unintegrity",
                      "created": 1622729176,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h0fjabe": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fjabe/",
      "text": "I love so many things about working in academia! I love that in my area there is no such thing as competition but rather a collective effort towards closing research gaps. I love the flexibility and being able to be creative and coming up with new ideas. Also, I love how academia has such high ethical and moral standards and that we as researchers can trust each other to act according to good scientific practice. And finally, I love the hands-on stuff like scientific writing and statistical analyses. Sure, I do agree that there are several awful parts of academia, but none of it can take away the fact that working in academia is my happy place :)",
      "author": "teeahraw",
      "created": 1622723133,
      "upvotes": 8,
      "replies": {}
    },
    "h0fje2r": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fje2r/",
      "text": "I am just a research specialist (who is leaving research for medicine soon) but one cool benefit that I haven't seen posted yet is the ability to travel for conferences. I was lucky to have the chance to go to Italy for a week a couple years ago to present my research, and had a great time exploring the city, meeting other people in my field and socializing with them over Prosecco and beers late into the night. \n\nMy boss and senior people in my lab have traveled to England, Australia, Spain, Canada, and I am sure many other places for conferences. Obviously some conference locations will be cooler than others, but traveling all over the world for free is a pretty big positive. Hopefully academia returns to traveling for in-person conferences after COVID, I think largely it will (though perhaps with more virtual options). \n\nAlso, just generally academia is more international that many other fields. I will be going to a US medical school, so I will likely only ever be able to practice in the US. With a PhD, there is no reason you couldn't meet a professor doing awesome work in, say, Norway or France or Argentina and end up doing your postdoc with them in a new country. I know several people who have done this, and I think that flexibility is pretty cool too.",
      "author": "LongjumpingBadger",
      "created": 1622723193,
      "upvotes": 7,
      "replies": {}
    },
    "h0g0y4f": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0g0y4f/",
      "text": "Growing up with academic parents, I had the opportunity to live abroad for several summers (while they taught in study abroad programs) and twice for sabbatical years. We always came back to our same house, so it was a nice balance of being well-traveled but also grounded (compared to, say, military families). Because of that, I'm bilingual, and it's probably those early experiences trying to figure things out that drew me to the social sciences. I've had grants to travel abroad, with funding, at least 5 times just during my PhD research, including a yearlong stretch of fieldwork. Hopefully, when my kids get a little older, I'll be able to give them the same kind of experiences I had.",
      "author": "le_doulos",
      "created": 1622731354,
      "upvotes": 7,
      "replies": {}
    },
    "h0f8sth": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0f8sth/",
      "text": "As a professor, you'll have the most flexible 80 hour work week out of any career I know.",
      "author": "SoupaSoka",
      "created": 1622716175,
      "upvotes": 33,
      "replies": {
        "h0fby8i": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fby8i/",
          "text": "redacted",
          "author": "zen_arcade",
          "created": 1622718552,
          "upvotes": 17,
          "replies": {
            "h0fl4yz": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fl4yz/",
              "text": "I’m a professor, and I’ve been tracking my work time carefully for over a decade. I don’t work anywhere close to 80 hours a week, or even 60 hours a week, and I’ve been pretty successful. I also have a pretty good work-life balance. I think people routinely exaggerate how much time they actually put in. If people are really working that many hours (as opposed to sitting in their offices procrastinating), I honestly don’t know how they do it.",
              "author": "tlamaze",
              "created": 1622724152,
              "upvotes": 18,
              "replies": {
                "h0frzm4": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0frzm4/",
                  "text": "I’ve thought about this discrepancy in my own life. Often it feels like I’m working constantly but when I actually log my hours I come in somewhere between 38 and 48 depending on the week. It’s a lot of work but less than some people in private sector jobs. I think the sense of overwhelm comes from constantly thinking about work. Between trying to develop new grant ideas and decompressing after pointless work drama and replying to students at all hours over email, those extra not quite fully working hours have a way of seeming like work spreads over the whole day.",
                  "author": "QueenAsphyxiaXIX",
                  "created": 1622727549,
                  "upvotes": 14,
                  "replies": {
                    "h0fz0xw": {
                      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fz0xw/",
                      "text": "This is exactly it for me. Sure there is flexibility, but even (or because of) that flexibility I never really feel like I'm not working. Seen plenty of colleagues going to kids soccer games, plays etc., but they will freely admit to multitasking out of necessity while there. For my own mental health, it's better for me to be able to compartmentalize versus have pseudo-flexibility.",
                      "author": "SpearandMagicHelmet",
                      "created": 1622730543,
                      "upvotes": 7,
                      "replies": {
                        "h0g38yl": {
                          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0g38yl/",
                          "text": "It really isn’t healthy. I would prefer it over being stuck in an office for 50 hours a week, but the lack of boundaries is really hard. Now that I have tenure I’m trying to learn to accept that it’s OK that maybe I don’t squeeze out one extra paper or that students may not always love me quite as much. Being your own boss when you have the kind of personality that is accomplishment driven is brutal sometimes. I’m a fucking task master with myself in a way that I know I could never be with my RAs or co-workers. God knows, it seems like they all regularly slack on things and I resent them for it. But maybe it turns out that they were the ones who had it right this whole time.",
                          "author": "QueenAsphyxiaXIX",
                          "created": 1622732313,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "h0fthjo": {
                  "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fthjo/",
                  "text": "It is extremely field dependent. Some fields require more work simply because of the demands of the field (if you're tracking elephants in the wild, you'll have to be out and about for longer periods of time), some not.",
                  "author": "dovaahkiin_snowwhite",
                  "created": 1622728204,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h0gdmws": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gdmws/",
              "text": "Agreed. Honestly I feel like a lot of fellow faculty that work crazy hours must be spinning their wheels an awful lot. There may be the occasional grant deadline work session, but those are few and far between.",
              "author": "dunnp",
              "created": 1622736582,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "h0fjxof": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fjxof/",
      "text": "I’m on my way out but I feel deeply appreciative that I had the opportunity to learn about so many things, whatever I wanted. I learned new techniques, sometimes on my own and sometimes with leading experts. Now that I’m heading into industry, I appreciate even more how unique those experiences are. At the time, I was focused on getting the data, rather than the skill itself but it’s payed off. Best of luck! Hold academia loosely, there are so many things you can do if you learn how to market yourself. Have fun with it too!",
      "author": "pajamasinbananas",
      "created": 1622723500,
      "upvotes": 5,
      "replies": {}
    },
    "h0fjbih": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fjbih/",
      "text": "I'm doing a PhD, with a plan to split my career between academia and practice. I've done something similar in the past and it worked well for me!\n\nResearch wise, I get way more flexibility and autonomy than I have in any other 'world'. I don't really have set hours, just have to get the work done. People want to hear me bang on about my topic ad nauseam. In my personal life, not so much lol. I get to read and have discussions and debate, I'm armed with new types of knowledge, contacts, connections, training opportunities etc. \n\nI've not tutored/lectured for a while but I personally enjoy it, and don't mind not doing it full-time as it gives me time to work on practice, my main subject (arts/humanities) is something that needs to be practiced I think to stay relevant, and so far any interactions with academics in this area they've appreciated that. \n\nI've stayed fairly positive as even though it's hard, there are good examples in my field and at my institute of what I want to be doing/where I want to be when I finish so it doesn't seem unachievable. I try to be realistic as I do have some fear just based on other's experiences but generally so far my PI is great, it's tough but I'm doing okay. Much much better than when I was just doing corporate work.",
      "author": "_Shug",
      "created": 1622723152,
      "upvotes": 3,
      "replies": {}
    },
    "h0fu0ii": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fu0ii/",
      "text": "I love my job. I finished my PhD last year and am starting my third year as a full time professor. \n\nWhen I’m not in class, no one cares where I am or what I’m doing. As long as I get the job done. \nThis means I’ve hardly missed a milestone in my toddler’s life this far because I can work at home a lot.\n\nI actually just thought about this yesterday as between my classes I got in my car, drove around to get lunch and whatnot. It crossed my mind that in my previous jobs I would not have been able to leave work at my leisure to get lunch out and if I did it would have required getting coverage and notifying people.\n\nI also get a lot of creative expression through my work, whether it’s how I present material in lecture or writing papers and designing research.\n\nYes, there are downsides but that’s any job. Stay encouraged!",
      "author": "UniversityUnlikely22",
      "created": 1622728417,
      "upvotes": 3,
      "replies": {}
    },
    "h0g241g": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0g241g/",
      "text": "There are things to love. At the end of the day, we're paid to do what we love. The work itself can be breathtakingly exciting. Many people have a lot of autonomy and a very flexible schedule. There are also a ton of wonderful interactions we can have with students and can drastically affect people's lives in a positive way. It's not all misery. This is why there are a huge number of people fighting for academic positions every single year (way more than the industry could possibly sustain).",
      "author": "rappoccio",
      "created": 1622731842,
      "upvotes": 3,
      "replies": {}
    },
    "h0g384x": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0g384x/",
      "text": "I hate set schedules. I thrive on go-go-go for a stretch, then a lull where I can have more me time. The whole 9 to 5 thing becomes doldrums, and makes doing thing I love (camping, snowboarding, etc.) difficult. \n\nI hate being a weekend warrior with the rest of the hoards. I can work night and weekends to play during the weekdays.",
      "author": "EccentricName",
      "created": 1622732304,
      "upvotes": 3,
      "replies": {}
    },
    "h0fhp09": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fhp09/",
      "text": "meh, it's a job. sometimes it's fun, and i like that i don't have to report to many people. it pays like shit though. i'm 35 and make the same i did when i was 26. i could have a 6 figure salary because I'm in comp sci, but chose to become poor :)",
      "author": "atypic",
      "created": 1622722218,
      "upvotes": 6,
      "replies": {
        "h0fj6yc": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fj6yc/",
          "text": "I think your number is off — you definitely have a five figure salary.",
          "author": "MrLegilimens",
          "created": 1622723078,
          "upvotes": 3,
          "replies": {
            "h0fma9l": {
              "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fma9l/",
              "text": "Ah yeah",
              "author": "atypic",
              "created": 1622724753,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h0g2to4": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0g2to4/",
      "text": "I worked for a small internet startup (which is now not small and public) and a Fortune 500 company before I transitioned into education and now professorship. When people say academia is flexible, it's not just flexible in 'when you spend your time' or 'how you spend your time'. It is also flexible in 'where you spend your time' and 'why you spend your time'. More than any other job I've had, it is almost completely self-driven in the projects you choose and how you manage your program. I prefer it immensely to the corporate world, if only for the freedom to do as I choose.",
      "author": "Teacher_",
      "created": 1622732135,
      "upvotes": 2,
      "replies": {}
    },
    "h0gazrm": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gazrm/",
      "text": "Thank you for this post! Undergrad here, always wanted to work in academia but the negativity online can be a little scary. Saving this post for when I need a reminder of what I'm working towards :)",
      "author": "InterestingArtist179",
      "created": 1622735510,
      "upvotes": 2,
      "replies": {}
    },
    "h0gmlkj": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gmlkj/",
      "text": "As a TT teaching professor, the summers off after nice I guess... If you don't count the summer classes you need to take on because the salary is so poor",
      "author": "GriIIedCheesus",
      "created": 1622740322,
      "upvotes": 2,
      "replies": {}
    },
    "h0hdz4v": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hdz4v/",
      "text": "I'm a post doc that's had my desire to be in academia shaken during covid. During grad school, try and understand the business side of academia. Not just the publish or perish bit but really understand how money and reputation can protect your career or end it overnight. Of all the stories, I'll use a hopeful one. A young prof had her mentor die but she had an early career grant. She emailed a collaborator and they were able to hire her at another uni. That wouldn't have happened without money and connections.",
      "author": "hlynn117",
      "created": 1622751776,
      "upvotes": 2,
      "replies": {}
    },
    "h0hh86g": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hh86g/",
      "text": "The problem is that the good aspects of academia are overly romanticized, and it’s important that young people are not fooled. So although I don’t regret my choices I think we cannot stop stressing how bad some things are.",
      "author": "Anteros94500",
      "created": 1622753178,
      "upvotes": 2,
      "replies": {}
    },
    "h0hk0f1": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hk0f1/",
      "text": "I'm a microbiologist and so I always say it's my job to be curious. I get to ask and answer my own questions. I make my own schedule. I can spend three days thinking and that's ok. Also, I love teaching. I love sharing knowledge. Don't get me wrong, I'm completely underpaid for someone with a PhD (my friends with BAs in other fields make far, far more than I do) and my work/life balance is not exactly balanced, but at the end of the day, I do love it. There is a lot of frustration but that's true of every field/area!   \n\n\nTwo things get me out of bed each day (besides my fear of disappointing my advisor...just kidding, he's wonderful)- the idea that I could discover something new that day and that I will be the only person in the world to know that that specific niche thing, and that today could be the day I do the experiment that wins a Nobel prize. Will I probably win the Nobel prize in my lifetime? No, of course not, but the day I stop believing my research is cool and impactful and important enough for a Nobel is the day I quit science.",
      "author": "RoyalEagle0408",
      "created": 1622754392,
      "upvotes": 2,
      "replies": {}
    },
    "h0fstzu": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fstzu/",
      "text": "I should point out the the conference destinations for the most part are not cruises or safaris - I have gotten to go to Grand Forks ND and St Louis.  The Cincinnati zoo was cool.   So that 2 hours I skived out of a boring session was not a total loss but I wouldnt’ go there on purpose.  But I really rarely get to exploit any of the travel becasue I am already off site for days, and I have a thesis committee meeting or a senate thing or grad students that need training or a class - so I often come from the airport right back to campus before even going home first.\n\nA real reason that this sub and other academic subs have a lot of negative things that people are missing is that people who are more experienced and know what it is like to make the sausages are trying to tell people , hey , eat what you want, but you know what it is IN. A sausage , right?\n\nAnd for every person who winds up loving their life and having the job of their dreams (and great for all 3 of you), they are seriously whitewashing the many quite serious decisions and Hobson’s choices you may have to make. Inducing Dr Happy, who’s spouse is changing their carried for their fantastic job.\n\nLike, Ok, if you can find the perfect fit, there is a job open, your chair is an angel and your admins supportive, you can afford to live in that city, your spouse is willing and happy to change jobs / careers  and can also find a job that makes them happy - but it is still worth noting that \n\nYou probably had to move far away from your family and friends.  You probably had to chose between a city or town you like and the better job.  You have many years of long hours at low income and also many moves in order to get another job with comparatively low income. That there is indeed much job insecurity and neither tenure nor promotion are a given.  \n\nNeither clock stops when you have kids or when your mom has a stroke.  \n\nYou should also compare apples to apples.  Any jobs I did before I was fully credentialed were either entry level or mostly unskilled or low seniority.  Where you alway have less autonomy more accountability and less freedom.\n\nYou have to compare your academic to the equivalent level at a non academic position.  I don’t know many project managers of a drug discovery team who punch a time clock either",
      "author": "PersephoneIsNotHome",
      "created": 1622727926,
      "upvotes": 4,
      "replies": {}
    },
    "h0gkdei": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0gkdei/",
      "text": "IVY PhD grad here : RUN AS FAR AS YOU CAN \n\n1) academia is crumbling \n\n2) it becomes very boring when people start to manage institutional limitation \n\n3) Academia has an innovation ceiling (shaped by grant structure, institutional arrangements, power dynamics, inflated egos, etc.): industry provides open skies (well if your ideas make sense ) \n\n4) teaching at R1s and elite SLACs (done both) is BORING (you work with very smart kids who are scared of failing, so they will tell you the \"right answer\" to get As). teaching at community colleges (also done that) is FASCINATING (but you will be paid the min wage)",
      "author": "bagelification",
      "created": 1622739405,
      "upvotes": 2,
      "replies": {}
    },
    "h0hpiah": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hpiah/",
      "text": "Mine is a unique skillset so I have been flown all over the world on other people's dime. If you can find a niche with international implications I strongly recommend going for it. \n\nThat said, the relationships I have formed is the biggest positive. I have a whole host of incredibly intelligent friends that I can grab a beer or go to dinner with. Just being able to talk about smart shit with and learn from very cool people is awesome. I also have numerous past students that went on to grad school that look me up whenever they are in town. Constantly being around deep thinkers makes my job ideal.",
      "author": "csudebate",
      "created": 1622756617,
      "upvotes": 1,
      "replies": {}
    },
    "h0hrafq": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hrafq/",
      "text": "collaboration.  are you kidding me.  to get to play with other faculty on new projects is the most fun thing ever.  get to know your arts faculty for sure.",
      "author": "printandpolish",
      "created": 1622757431,
      "upvotes": 1,
      "replies": {}
    },
    "h0hwk6d": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0hwk6d/",
      "text": "A life? A whole life? How long are you going to live ? At the eu-27 We can foresight 18 years in the future with an 85% probability. Do you see how many turning points there will be in your life? We go for lifelong learning and active and lonely living with many entry and exit points all along your life, so do what you can be passionate about for the next let’s say eight years?",
      "author": "SvenAERTS",
      "created": 1622759858,
      "upvotes": 1,
      "replies": {}
    },
    "h0fqdmr": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0fqdmr/",
      "text": "Remember to look at the base rates for getting an academic position. \n\nThese days getting one takes talent and a whole lot of luck.",
      "author": "fishlampy",
      "created": 1622726797,
      "upvotes": 0,
      "replies": {}
    },
    "h0lapu5": {
      "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0lapu5/",
      "text": "[deleted]",
      "author": null,
      "created": 1622828233,
      "upvotes": 0,
      "replies": {
        "h0lbbcs": {
          "link": "/r/AskAcademia/comments/nr7t5y/positives_and_benefits_of_a_life_in_academia/h0lbbcs/",
          "text": "Uh that’s not really what the thread is about? Also it’s a bit unrealistic to ask someone to just set up their own company. I work in visual ecology and will be specialising in insects. Sure there are biomememtic applications for it but to start from scratch with something that’s most likely low initial return and huge investment? Yea I don’t see how that’s happening",
          "author": "Binturong98",
          "created": 1622828495,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}