{
  "sid": "p7jcpa",
  "link": "/r/AskAcademia/comments/p7jcpa/best_way_to_approach_academic_advisor/",
  "title:": "Best way to approach academic advisor?",
  "text": "I have a bachelor’s degree in physics and want to get a master’s degree in math. I would like to approach an academic advisor (in the math department) in order to understand the ideal path to accomplish this. \nHow should I approach them and what should I ask? I failed several courses during my physics degree, have only a bit of research experience and don’t think I can obtain amazing LORs from previous professors. \nI don’t want to inadvertently harm my future acceptance chances by not having good answers to questions I might be asked. I would also like to know from them how feasible this transition is considering my situation.",
  "author": "YaWellaZiftatin",
  "created": 1629393817,
  "updated": 1634079558,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.66,
  "comments": {
    "h9n0tzh": {
      "link": "/r/AskAcademia/comments/p7jcpa/best_way_to_approach_academic_advisor/h9n0tzh/",
      "text": "Do you have a university in mind? Google “graduate program math advisor + that university” or see if they have a graduate college with dedicated advisors and just email them or call if they have regular hours. Just tell them that you’re interested in applying to their program and would like an appointment to get more information. You needn’t worry about what to say to an advisor, though. They’re not admissions, and I guarantee you you’re not the first one to set up a meeting just to feel things out. \n\nI can’t speak for all fields, and it certainly depends on the university you apply to, but it’s not at all unheard of to get into a master’s program with a lackluster undergrad record. Mine was nothing to boast about. A good question for your advisor is their admissions criteria and what they recommend prioritizing.",
      "author": "Blackbird6",
      "created": 1629448291,
      "upvotes": 1,
      "replies": {}
    }
  }
}