{
  "sid": "qa4tlw",
  "link": "/r/AskAcademia/comments/qa4tlw/how_detailed_should_my_dissertation_proposal_be/",
  "title:": "How detailed should my dissertation proposal be in my statement of purpose? (Humanities PhD app)",
  "text": "There doesn't seem to be an awful lot of information about this online, unfortunately. Programmes say that they want a sense of your research interests, directions for research and skills in the statement - as well as the obvious e.g. why this college - but there is little guidance about how much detail is required, whether you should be engaging critically with theories or being more superficial (because space requirements). I'd appreciate it if someone could give me some advice.",
  "author": "FlexMissile99",
  "created": 1634496124,
  "updated": 1634654292,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 0.96,
  "comments": {
    "hh0ztsq": {
      "link": "/r/AskAcademia/comments/qa4tlw/how_detailed_should_my_dissertation_proposal_be/hh0ztsq/",
      "text": "I submitted my history PhD last month and my proposal started with my central question and outline why there is a pressing need to address the question. From there I explained my proposed framework and highlighted the existing historiography. I finished by acknowledging the methodological challenges I expected to face and the possible outcomes of my research. I hope that is helpful!",
      "author": "farts-and-crafts",
      "created": 1634502660,
      "upvotes": 12,
      "replies": {
        "hh1atea": {
          "link": "/r/AskAcademia/comments/qa4tlw/how_detailed_should_my_dissertation_proposal_be/hh1atea/",
          "text": "Thanks, mate, this is indeed very useful. Congrats on submitting your PhD and good luck in your next steps!",
          "author": "FlexMissile99",
          "created": 1634507362,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hh16bia": {
      "link": "/r/AskAcademia/comments/qa4tlw/how_detailed_should_my_dissertation_proposal_be/hh16bia/",
      "text": "I think some level of detail is good, so that whosoever reads your application feels that you have a sense of what you would do should you be admitted into the program. I'm I'm English, so my application had what was the key concept that motivated me to apply for a PhD, what angle I was going to approach the said concept from and potential primary texts. I don't think you need to say my dissertation will have X chapters, but an outline of how you see the project and how it plays into the school's strengths should be good. Hope this helps!",
      "author": "pin_yue",
      "created": 1634505388,
      "upvotes": 4,
      "replies": {
        "hh1aq7w": {
          "link": "/r/AskAcademia/comments/qa4tlw/how_detailed_should_my_dissertation_proposal_be/hh1aq7w/",
          "text": "Nice. I'm hoping to apply for English, too. Congrats on getting accepted! If you don't mind my asking - when you say 'key concept', are you referring to theory? That's probably the one area where my application isn't quite as strong as it could be, if 'strong's really the word... Essentially, I'm not really that theoretically minded (other than New Historicism) and am worried that the fact that my application is thin on it is going to be a problem.",
          "author": "FlexMissile99",
          "created": 1634507325,
          "upvotes": 1,
          "replies": {
            "hh3kv3e": {
              "link": "/r/AskAcademia/comments/qa4tlw/how_detailed_should_my_dissertation_proposal_be/hh3kv3e/",
              "text": "In my case it wasn't even a theoretical concept, it was a pretty ordinary word. But I did manage to situate how I'd thought about it with respect to my own literary history. A part of my statement was about how I'd engaged with this concept through different texts and how I planned to do it later. I didn't do a lot of theoretical heavy lifting; I feel you on not being theory minded. As I said earlier, I think as long as the reader feels that you know what you will do, then it's probably fine. At least that was my take away from the whole thing.",
              "author": "pin_yue",
              "created": 1634558740,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh0l96o": {
      "link": "/r/AskAcademia/comments/qa4tlw/how_detailed_should_my_dissertation_proposal_be/hh0l96o/",
      "text": "Impossible to say without knowing more, but in general I would say more info is better than less info.",
      "author": "molobodd",
      "created": 1634496585,
      "upvotes": 2,
      "replies": {}
    },
    "hh3xjhs": {
      "link": "/r/AskAcademia/comments/qa4tlw/how_detailed_should_my_dissertation_proposal_be/hh3xjhs/",
      "text": "You will not propose a dissertation in your SOP.\n\nYou propose a dissertation year 2 lol.\n\nTalking about your research interests and directions for research is more of a broad discussion rather than \"this is what I want my project to be.\"\n\nTalk about the work you did, the skills you obtained, and what gaps in literature you've noticed and would be interested in solving/filling.",
      "author": "CptSmarty",
      "created": 1634565566,
      "upvotes": 2,
      "replies": {
        "hh3zahj": {
          "link": "/r/AskAcademia/comments/qa4tlw/how_detailed_should_my_dissertation_proposal_be/hh3zahj/",
          "text": "Haha okay. I think it's a little different to the application in the UK, then. Over here, many schools like you to apply with a clearly delineated proposal, often with chapter outlines and everything. I'm relieved it doesn't need to be as detailed in the US!",
          "author": "FlexMissile99",
          "created": 1634566389,
          "upvotes": 2,
          "replies": {}
        },
        "hh504qd": {
          "link": "/r/AskAcademia/comments/qa4tlw/how_detailed_should_my_dissertation_proposal_be/hh504qd/",
          "text": "This is very country-dependent.",
          "author": "lespectador",
          "created": 1634581864,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}