{
  "sid": "irnn6q",
  "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/",
  "title:": "I want to pursue higher education and possibly a career in academia but there is a single course I am taking that is making me think I'm not smart enough.",
  "text": "I am a third-year undergraduate student studying math. Prior to this year I had planned to go into higher education, and possibly work in academia, but a single course I am taking (differential topology) is making me question whether or not I'm actually smart enough to do it. No matter what I do, the material just feels way over my head and I can't seem to solve any problems on my own.\n\nIs this a common experience? For those of you already in academia or pursuing graduate level degrees, was there a class/event that caused you to reassess your aptitude for your field? Of course, this question is not exclusive to those in math-related disciplines.",
  "author": "adfgvx44",
  "created": 1599954913,
  "updated": 1634081338,
  "over_18": false,
  "upvotes": 133,
  "upvote_ratio": 0.97,
  "comments": {
    "g50a70t": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g50a70t/",
      "text": "You don't need to be an expert in every area of your discipline. You just need to find one that you like.",
      "author": "olixius",
      "created": 1599956955,
      "upvotes": 174,
      "replies": {
        "g50zm5m": {
          "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g50zm5m/",
          "text": "This, +particular values for like. Helps if \"like\" means \"can do well\" and \"enjoy doing for hours and hours.\"",
          "author": "yeomanscholar",
          "created": 1599964552,
          "upvotes": 47,
          "replies": {
            "g51dur4": {
              "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g51dur4/",
              "text": "If you enjoy it, why does it matter if you are able to do it better than others?",
              "author": "olixius",
              "created": 1599969944,
              "upvotes": 6,
              "replies": {
                "g521jhh": {
                  "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g521jhh/",
                  "text": "Two reasons - the first is that, presumably, you want to be paid to do it. Given the lack of jobs in academia, don't pick something you'll easily be outcompeted in.\n\nThe second is, simply, that doing it well will also allow you to discover new things, publish, and ideally teach others to do it well. Which I'd think is kind of the idea? If you can't do it well, I suspect you'll have a hard time publishing...",
                  "author": "yeomanscholar",
                  "created": 1599978059,
                  "upvotes": 30,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g51yj96": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g51yj96/",
      "text": "https://www.nctm.org/Publications/Mathematics-Teacher/Blog/Everyone-Has-a-Personal-Green_s-Theorem/\n\nEveryone Has a Personal Green’s Theorem\nBy Dan Teague, posted November 9, 2015 —\n\nIt was early September 1963. At John Hanson Junior High, I was part of a new program in which a small group of eighth graders were taking Algebra 1. Mr. Green was my teacher, explaining the difference between a number and the numeral representing the number and why x = 3 wasn’t the solution to the equation 2x = 6; rather, it should be {x ∈ ℜ | x = 3}. (New Math—those were the days). As far as we knew, we were the first kids in the history of the world allowed to take Algebra 1 in eighth grade. We thought we were hot stuff.\n\nThen Mr. Green, in an effort to contain our youthful arrogance, said something equivalent to, “You guys are good, and math is easy for you. But always remember this: Everyone has their Green’s theorem.” Probably this stuck with me because of Mr. Green talking about Green’s theorem (no relation), but I’d like to think I would have remembered it anyway. He went on to explain what he meant. When he was a student, mathematics was easy. Algebra, Geometry, Trigonometry, and Calculus—all were all very easy for him. But then he got to Green’s theorem in Multivariable Calculus. From then on, in every mathematics course, although he was just as good as he had always been, he had to work really hard to master the content. His meaning for us was that, at some point, mathematics becomes difficult—for everyone. And when we hit our personal Green’s theorem, as we all eventually will, we need to learn to work at it like everyone else.\n\nFast forward fifty-two years, and I’m talking with a student about courses she wants to take next term. She tells me, “I really like mathematics, but I’m not very good at it.” Her proof? “I have to work really hard to be successful.” In the world of students, if you can do something easily, you are good at it, and if something is not easy for you (no matter how successful you are and no matter how much you enjoy it), you are not very good at it. Moreover (and this is the dangerous part of this thought), if a subject isn’t easy for you, then you just aren’t cut out for it. My student could not imagine mathematics as a major and certainly not as a career option.\n\nBut Mr. Green would tell her that she is using the wrong metric. For everyone, mathematics becomes challenging. Mathematics is one of the greatest intellectual achievements of humankind. Of course, it will be challenging. Everyone has to work at it—some earlier than others and some later than others. But everyone has a personal Green’s theorem.\n\nIt is important for students to understand that, whatever their area of interest, the subject will eventually become challenging. So what? Hard isn’t bad. The real question isn’t whether a student finds a subject easy or hard; all subjects will all be hard eventually. The real question is, Do you enjoy that challenge? That’s how to decide what career path to pursue. You actually don’t want an “easy” job. You want to be challenged by your work and to draw joy and contentment from accepting the challenges it offers and working hard to meet them.\n\nMathematics is the hardest thing I know, with the possible exception of teaching mathematics. I do them both not because they are easy. Like you, I do them both because I love the challenges they offer and because each day I have to work really hard to be successful. Thank you, Mr. Green.",
      "author": "IHTFPhD",
      "created": 1599976948,
      "upvotes": 39,
      "replies": {}
    },
    "g50lc1u": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g50lc1u/",
      "text": "academics don't know everything about everything.\n\nconceding that there's one thing you will probably never understand, isn't a disqualifier.",
      "author": "RollWave_",
      "created": 1599960233,
      "upvotes": 25,
      "replies": {
        "g516u6u": {
          "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g516u6u/",
          "text": "Honestly it's actually a great qualifier. I'm a postdoc in science, and if there's one thing I've learned, it's that good scientists know they don't know everything and the bad ones think they do.",
          "author": null,
          "created": 1599967165,
          "upvotes": 27,
          "replies": {
            "g51b9m7": {
              "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g51b9m7/",
              "text": "Not sure why you got downvoted for that. I think a really obvious example are the few physicists who decided to join in on COVID epidemiological models and were, in a way, slapped by epidemiologists.\n\nMight be a bit of a dumb thing for me to say, but science has always seemed like a \"Stay in your lane unless an expert is your passenger\" type of endeavor.",
              "author": "IAmTrident",
              "created": 1599969092,
              "upvotes": 10,
              "replies": {
                "g51maw2": {
                  "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g51maw2/",
                  "text": ">\"Stay in your lane unless an expert is your passenger\"\n\nThis is a damn fine quote that I haven't heard before, and a good response to the whole \"math --> physics --> chemistry --> biology --> psychology\" thing.",
                  "author": "A_Rude_Canadian_",
                  "created": 1599972483,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g50h6a6": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g50h6a6/",
      "text": "I’m currently pursuing a PhD in a hard science. There were things I struggled with a ton in undergrad, but my focus as a grad student is in a different area so it doesn’t matter. Grad school / academia is usually a narrow field of study. You can pick a field that avoids the topics you struggle in and emphasizes what you’re good at! Most of the students in my program have areas they really struggle with, but chose a path that avoids those topics. It’s very typical to feel like this and to have this problem. You’re not alone.\n\nStruggling is a part of academia. Don’t let it discourage you. No one is meant to be good at everything. Find what you like and what suits your strengths.",
      "author": "caffeinatedkady",
      "created": 1599959035,
      "upvotes": 42,
      "replies": {}
    },
    "g50rxv6": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g50rxv6/",
      "text": "I had at least four of these courses during my PhD. Don't. Give.Up.",
      "author": "Damertz",
      "created": 1599962226,
      "upvotes": 11,
      "replies": {}
    },
    "g511m27": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g511m27/",
      "text": "One aspect of cultivating a working relationship with science is putting yourself in situations where you are struggling to keep up. We are literally talking about the sum of human knowledge here, and you are not ever going to be as talented as every (current and past) scientist combined. For me, grad school was a giant exercise in being surrounded by people much more capable than me. I am a better person for that experience.\n\nDifferential topology might be hard, and maybe it's not your cup of tea. It could be a good chance to learn about yourself — what makes you tick, and why are certain things hard and others not? This kind of self-knowledge will set you up for success in science, because you will know how to pick your battles.\n\nNot having had experiences like you describe is a sign that you haven't been challenging yourself enough and are either a total genius or (much more likely) in for a nasty surprise.",
      "author": "Stishovite",
      "created": 1599965235,
      "upvotes": 11,
      "replies": {}
    },
    "g51lhzm": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g51lhzm/",
      "text": "I have a PhD in mathematics, work in academia, and took a graduate course in differential topology and I have never had any meaningful intuition about differential topology.",
      "author": "DrTaargus",
      "created": 1599972201,
      "upvotes": 9,
      "replies": {
        "g55tp8u": {
          "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g55tp8u/",
          "text": "I'd like to second this, but add that I love topology and it's the umbrella area of my research.",
          "author": "SarahEllieTigger",
          "created": 1600030532,
          "upvotes": 2,
          "replies": {
            "g562z59": {
              "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g562z59/",
              "text": "I love topology too! I must say that I don't engage with it much anymore, but still.",
              "author": "DrTaargus",
              "created": 1600034623,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g51iewo": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g51iewo/",
      "text": "If I had a dime for every course that made me feel inferior....\n\nI have my PhD in biomedical science, and my first biology class in undergrad, I failed my first exam. I was devastated and figured I wasn't cut out for the field. But that is absolutely not the case. We all have our kryptonite classes. Don't let one deter you! \n\nAnd in my experience, grad school is a constant battle of learning how to not feel inferior. You're good enough. Own it. Best of luck!",
      "author": "Team_Cap",
      "created": 1599971335,
      "upvotes": 8,
      "replies": {}
    },
    "g53lkxx": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g53lkxx/",
      "text": "I think I am going to say something quite different from other people.\n\n&#x200B;\n\nI remember really struggling with Quantum Field theory at the start.  It took months to understand the first lecture (granted I could kind of ignore it, move on and do other bits while ignoring that).  However, it finally clicked one night when I was drunk in the pub and I realised the reason that I was struggling is that the way the books teach it is slight oversimplified and I was trying to put it into my undergrad picture of quantum mechanics.\n\n&#x200B;\n\nIn the end I finally got it and in doing so completely changed my understanding of quantum mechanics, group representations and so on.  I am now doing a PhD in QFT.  \n\n\nI guess the moral is, sometime struggling is because actually you are thinking about it in a different but slightly deeper way than the introductory books.  So it might mean you end up loving and excelling in that topic",
      "author": "yup790",
      "created": 1600000482,
      "upvotes": 4,
      "replies": {}
    },
    "g53b27j": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g53b27j/",
      "text": "Yes this is completely normal. I'm a math phd student right now but I've had a few courses in undergrad that really made me feel like I was too dumb. Looking back now  I can tell that it wasn't even that the material was too hard but more like I didn't have the best resources (i.e. notes or textbooks) and I didn't know how to find good notes or textbooks on my own yet, or the lecturer's style didn't work well for me, or I took the course too early and didn't have the mathematical maturity to get the most out of it. If you just keep working at things you will almost certainly be fine. Maybe you will never be particularly strong in differential topology, which is fine, or maybe eventually it will make sense to you. I was terrible at algebraic topology until my 3rd-4th courses in it, then it finally started making sense, and now I feel completely neutral about it.",
      "author": "mrross00",
      "created": 1599996786,
      "upvotes": 3,
      "replies": {}
    },
    "g50i4xa": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g50i4xa/",
      "text": "What makes a person succeed in academia (putting aside for a moment the many, many privileges required to entry that serve as barriers to so many folks) is passion and grit. If you really give a shit about the topic, are willing to persist in the face of failure, and want to do science right (not in it for prestige or an ego boost), you'll be fantastic. I'm in clinical psychology, and I struggle with many stats courses, neuroscience courses, etc. But I know enough to do what I do. (Somewhat unfortunately), research is about expertise in an absolutely microscopic topic. So you just find your microchasm and thrive. (And you're allowed to change your interests throughout graduate school, too).",
      "author": "slicingthelemon",
      "created": 1599959364,
      "upvotes": 8,
      "replies": {
        "g53csr4": {
          "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g53csr4/",
          "text": "Intelligence matters too",
          "author": "my_stupidquestions",
          "created": 1599997406,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g52lxty": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g52lxty/",
      "text": "I think the weaknesses of great researchers drive their success as much as their strengths. Your weaknesses will force you to approach problems from angles that use your strengths. Being successful as a researcher is not about being conventionally smart. It's about thinking laterally. Weak points force you to think laterally. Weaknesses form a researcher's character.",
      "author": "herbertwillyworth",
      "created": 1599986346,
      "upvotes": 2,
      "replies": {}
    },
    "g52u6yp": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g52u6yp/",
      "text": "The intelligence threshold for academia is way lower than you think. Also in mathematics there is such a thing as mathematical maturity, some things just take more time (and differential topology is a tricky subject). \n\nBut anyway, mathematics is a huge subject and maybe topology just isn't for you. I found pretty quickly that I prefer discrete objects: integers, finite groups, graphs, permutations, automata etc. I did not get stellar marks in topology or analysis courses to be honest.",
      "author": "l_lecrup",
      "created": 1599989518,
      "upvotes": 2,
      "replies": {}
    },
    "g51xpoa": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g51xpoa/",
      "text": "Hey! Im currently in my first semester for my masters in applied math. I’m currently taking three classes and one of them is in real analysis and its kicking my ass. I have not done any proofs or higher math stuff in 3 years. I constantly feel like I’m not good enough, but I got in for a reason and I’m enjoying my other classes. Analysis may just not be for me. Keep pushing my man!",
      "author": "Phrasee",
      "created": 1599976587,
      "upvotes": 1,
      "replies": {}
    },
    "g53fpg2": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g53fpg2/",
      "text": "lol don't worry, this happened to all of us.",
      "author": "thegreenaquarium",
      "created": 1599998496,
      "upvotes": 1,
      "replies": {}
    },
    "g53fsjt": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g53fsjt/",
      "text": "Maybe ask if your school offers some sort of aptitude test? Maybe ask a counselor for something like that? I have similar issues - I know what I _don’t_ want to do, and while I’d like to pursue a higher education and love history, I’m worried that going through schooling and trying to make a career out of it will actually destroy my love for it. An aptitude test will be a good way for me to figure out what other things I may have an aptitude for and may not mind studying and making a career out of it.",
      "author": "Slight-Pound",
      "created": 1599998561,
      "upvotes": 1,
      "replies": {}
    },
    "g53litl": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g53litl/",
      "text": "When I was doing a master in math, all the graduate level math courses makes me question whether I’m smart enough to do a PhD. \n\nWell I eventually switched to doing a PhD in Finance instead of math.",
      "author": "overlapping_gen",
      "created": 1600000460,
      "upvotes": 1,
      "replies": {}
    },
    "g544trm": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g544trm/",
      "text": "Physical chemistry, and 3D vector calculus can fuck right off.",
      "author": "airwalker12",
      "created": 1600007117,
      "upvotes": 1,
      "replies": {}
    },
    "g54b2ur": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g54b2ur/",
      "text": "As a second-year Math PhD student, I’d probably be struggling with undergrad-level Differential Topology too. Not because it’s too hard but I’ve no interest in the subject. Hell, I’m taking my future research area’s main course and I’m struggling with it. It’s completely normal. Math is hard.",
      "author": "demir50",
      "created": 1600009431,
      "upvotes": 1,
      "replies": {}
    },
    "g54cq4p": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g54cq4p/",
      "text": "To add to the many perspectives here (by all means, I agree that struggling one course does not mean you cannot succeed in academia), I encourage you to use your experience as a point of empathy in the future. Let's say that it's 10+ years later and you are teaching classes, working with students on research, etc. Know that, for some of your students, your class is going to be the hard one that they struggle with. I hope that you'll use your experience of struggling in a class to meet students where they are at, provide encouragement for their efforts and persistence in the face of difficulty, and ultimately support your students both in terms of academic support (e.g., patiently explaining a concept to a student after class or during office hours) and in terms of emotional warmth (i.e., being kind and affirming, even as they struggle).",
      "author": "jogam",
      "created": 1600010178,
      "upvotes": 1,
      "replies": {}
    },
    "g518q1e": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g518q1e/",
      "text": "All professors are smart. A good teacher can get the information out of their head, through their mouth, and into the students head, in a way that the student can not only understand the information but apply it.\n\nSure you might suck at the subject. But also there might be something lacking on the other side of the equation. (Ha unintended math pun 🏆) \n\nI once had a visiting math professor from Israel who loved to use “m” and “n” as his variables and his m’s had 3-5 humps and his n’s had 1-4 humps and with his accent you could never tell which he was saying. I did horrible in that class.\n\nGet a tutor. Or try a couple tutors but if they all try explaining it the same way they aren’t very good.\n\nEdit: example; oh you don’t speak English let me say it louder and slower... still don’t understand what I’m saying? Let me repeat the exact same thing again... still don’t understand? Well let me say it again! Oh wait maybe I’m not smart enough to realize I’m not an effective communicator and need to alter my approach. Too many teachers feel like “well 15 of my students are doing well I must be explaining it well, so let me keep explaining it the exact same way when one of the students that isn’t doing well comes to me seeking help” \n\n“A good explanation doesn’t describe what you see, it elicits the proper visualization”",
      "author": "Zhao5280",
      "created": 1599968032,
      "upvotes": 1,
      "replies": {}
    },
    "g50n8oo": {
      "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g50n8oo/",
      "text": "[deleted]",
      "author": null,
      "created": 1599960791,
      "upvotes": -16,
      "replies": {
        "g5166hk": {
          "link": "/r/AskAcademia/comments/irnn6q/i_want_to_pursue_higher_education_and_possibly_a/g5166hk/",
          "text": "r/inappropriatewillhunting",
          "author": "RadDadJr",
          "created": 1599966824,
          "upvotes": 4,
          "replies": {}
        }
      }
    }
  }
}