{
  "sid": "nwkj1b",
  "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/",
  "title:": "Does online teaching make you tired?",
  "text": "I am a first time professor and while I taught a couple of classes in person before the pandemic, this is my first time teaching this many hours. I found that attending conferences online is much more energy draining if compared to attending them in person. I started teaching after earning my PhD in 2020, so you can imagine that I've only experienced online professoring for the time being. What I realized is that teaching for hours online is incredibly exhausting. Given what I experienced with conferences, I can imagine that if the similarity holds, teaching in person should be somewhat less exhausting. Is this true? Do you think that online teaching is more exhausting than in person teaching?",
  "author": "Normal_Kaleidoscope",
  "created": 1623321980,
  "updated": 1634080743,
  "over_18": false,
  "upvotes": 188,
  "upvote_ratio": 0.99,
  "comments": {
    "h19lb76": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19lb76/",
      "text": "I teach online, primarily asynchronous. In an average year, I don’t find it more tiring. However, the pandemic has made everything tiring.\n\nIf you are teaching live on Zoom, I can imagine it’s exhausting. After a day on Zoom, I am physically and mentally drained. I’m tired of looking at myself, I’m tired of not being able to read cues. It’s tiring.\n\nI do find in person teaching to be both exhilarating (while it’s happening) and exhausting (after), but I am an introvert.",
      "author": "profpetitfours",
      "created": 1623323234,
      "upvotes": 92,
      "replies": {
        "h19napv": {
          "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19napv/",
          "text": "For example after I finish teaching I sit on the sofa staring at the wall for some 20 minutes, and honestly I just don't have any more energy left in me. Perhaps it's also that there's way less interaction. Most of my students (freshmen) are probably too shy to turn on the mic and ask a question (when they do they prefer the chat) so it's basically me talking for prolonged periods of time.",
          "author": "Normal_Kaleidoscope",
          "created": 1623324645,
          "upvotes": 33,
          "replies": {
            "h19oej9": {
              "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19oej9/",
              "text": "Oh, I'm positive the lack of interaction matters. I've had to run a lot of Zoom meetings in the past year and speaking to a sea of black boxes is exhausting.\n\nBut, I also do the 20 minutes of quiet staring after I teach in person. One thing that I've worked to do is plan my teaching days a lot better knowing that I need some downtime/recuperation time. I generally don't schedule meetings or anything important right after class and don't feel bad if I don't accomplish a whole lot on teaching days. It's easier for me to do because I'm generally only teaching two days a week, rather than every day, so YMMV. \n\nI should just say that your first few years teaching a full-time schedule is also a lot. I also taught in grad school, but the transition to a 3-3 was so much more than just a tripling of work. You get better at knowing how to manage your energy swings and class schedule in ways that are good for you and good for the student.\n\nIn other words, it does get better, I promise!",
              "author": "profpetitfours",
              "created": 1623325386,
              "upvotes": 13,
              "replies": {
                "h19pgth": {
                  "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19pgth/",
                  "text": "Oh yeah I also learned that I don't have time to write if I teach, so I'm glad I didn't teach during the first semester so I could do some writing",
                  "author": "Normal_Kaleidoscope",
                  "created": 1623326063,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "h1b6ueu": {
              "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1b6ueu/",
              "text": "No, that's zoom/meet for you. There's some data and studies starting to emerge in socio and psych regarding attention maintenance and dealing with social cues in video mediums. Turns out, by and large, we aren't wired for flat boxes.",
              "author": "cjrecordvt",
              "created": 1623349723,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "h1a30qs": {
          "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1a30qs/",
          "text": "I have found this to be true as well. In person is invigorating if you have taught it before, invigorating plus exhausting if its only the first or second time. Online asynchronous is a full time job but not overly exhausting but synchronous online is exhausting and lacks the in-person invigoration.",
          "author": "adequateScienceDoer",
          "created": 1623333169,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "h19l04v": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19l04v/",
      "text": "Yes, the same concept takes double the time to teach !!!",
      "author": "Technical_Luck_4286",
      "created": 1623323004,
      "upvotes": 19,
      "replies": {
        "h19nosp": {
          "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19nosp/",
          "text": "Oh yes. This is 100% true. When I realized this I started repeating important concepts over and over, sometimes paraphrasing them. I also don't see their reactions when I am writing on the blackboard, if in person I guess I'd just turn my head and look at them to understand if I am being clear",
          "author": "Normal_Kaleidoscope",
          "created": 1623324908,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "h19ovhj": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19ovhj/",
      "text": "I taught on Zoom for the past two semesters, it was a whole different level of exhaustion from teaching in person. My brain was literally mush after a full day teaching classes and having meetings on Zoom. For me, teaching in person isn’t as exhausting because you aren’t constantly trying to manage a million different things on Zoom, your PowerPoint, connectivity issues, teach, and try to engage with students who don’t even have their cameras on. I also found that my social anxiety was worse on zoom. Since I couldn’t see the vast majority of my students, I didn’t know if they were there, who else was there, if they understood the concepts, etc. I understand the reasons for students not turning their cameras on…but it makes one hell of an experience for the instructor.",
      "author": "Lore_of_Folk",
      "created": 1623325691,
      "upvotes": 17,
      "replies": {
        "h19rs5j": {
          "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19rs5j/",
          "text": "Well yes sometimes I feel like I'm talking to myself for hours... Assigning homework was the only way to understand whether they were really  engaging in the class.",
          "author": "Normal_Kaleidoscope",
          "created": 1623327493,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h19xun3": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19xun3/",
      "text": "**Me in late 2019**: \"I think I will switch to online distance teaching only. That way I can get a huge number of international students and get more bang for the bucks, i.e. teach fewer courses and cash in on the volume. 200 international students per course is the way to go!\"\n\n***2020 and Covid happens and everything becomes Zoom-teaching.***\n\n**Me in 2021**: \"I'm done with anonymous, and physically and socially distant teaching. 2022 will be IRL teaching only.\"",
      "author": "molobodd",
      "created": 1623330748,
      "upvotes": 15,
      "replies": {
        "h19yu0g": {
          "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19yu0g/",
          "text": "Expectations vs reality 😆",
          "author": "Normal_Kaleidoscope",
          "created": 1623331187,
          "upvotes": 5,
          "replies": {
            "h19zxku": {
              "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19zxku/",
              "text": "This x 1000. The upside of this whole teaching mess was that I had to learn Zoom and how it could be integrated with our LMS several months before Covid hit, and everyone else had to scramble to survive. I came off as the cool guy who knew what he was doing in comparison. :)",
              "author": "molobodd",
              "created": 1623331715,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h1ad3ex": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1ad3ex/",
      "text": "https://www.nationalgeographic.com/science/article/coronavirus-zoom-fatigue-is-taxing-the-brain-here-is-why-that-happens Zoom fatigue is real!! You’re not alone",
      "author": "tsp_of_dopamine",
      "created": 1623337546,
      "upvotes": 9,
      "replies": {}
    },
    "h19qvbe": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19qvbe/",
      "text": "It really depend on the nature of what you teach.  \nIf you try to replace lectures, then indeed I can imagine it is draining. But you also would benefit from re-thinking the material and the presentation techniques.  \n\n\nOne of the biggest mistakes is trying to offer courses that were previously given in real life as online courses. They simply do not translate.\n\nMy teaching is on workshops, so limited attendance of 24 people, and everyone has actually found the online versions are better than the live ones (with minor exceptions of course). In my case of course there is plenty of interaction, and the way the interaction works has been much better than a live course. e.g. for any questions on exercises or the material, the second teacher can constantly monitor the Teams chat and answer questions without interrupting the flow.  \n\n\nHaving said that, I still find myself tired after a full day of teaching. Do not underestimate the physical aspect of it. I find when I break up my day between sitting and standing, I keep much more energized. And make good use of coffee and lunch breaks (if you have them where you teach) to be physical. Go for a walk, a short run, or even do some push ups, seriously, it will make a world of difference.\n\n&#x200B;\n\nGood luck :)",
      "author": "Computer_says_nooo",
      "created": 1623326940,
      "upvotes": 9,
      "replies": {}
    },
    "h1a0pg5": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1a0pg5/",
      "text": "I teach a hybrid class. Around 10 students in the classroom and 30 out of the classroom. I simply cannot do anything else after class is over. I sit down and feel exhausted.\n\nTwo hours every day. In addition, I have four research projects. One due next week and another in a month. I feel like I can’t make it.",
      "author": "xtregdude",
      "created": 1623332092,
      "upvotes": 7,
      "replies": {}
    },
    "h1a0mnf": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1a0mnf/",
      "text": "Yes it’s more tiring. In traditional classes, I’ll read the material, prep a lesson, and then go to the 50 min class. In online, I’ll read the material, prep a lesson, record the video, edit and upload the video, type the discussion, set the due dates, grade the discussion (check for completion), and answer emails about the discussion. Sometimes, I’ll give students a virtual live class option in lieu of completing the discussion but then I still have to grade the discussion for anyone who couldn’t attend.",
      "author": "mylifeisprettyplain",
      "created": 1623332056,
      "upvotes": 6,
      "replies": {}
    },
    "h1aeald": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1aeald/",
      "text": "Teaching in person is also tiring but you also get more energy back from interacting more than you can online. I get more tired from online teaching because of that.",
      "author": "n23_",
      "created": 1623338049,
      "upvotes": 6,
      "replies": {}
    },
    "h19oazu": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19oazu/",
      "text": "It does. When you teach online, you also move less since you subconsciously try to keep yourself centered on your camera, so you get stiff and thus more tired. Moving yourself around (during breaks or while in sessions even) with shoulder shrugs, head rolls, head tilts, etc. will help.",
      "author": "LittleWhileAgo",
      "created": 1623325322,
      "upvotes": 5,
      "replies": {}
    },
    "h19txh7": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19txh7/",
      "text": "I hate teaching online.\n\nPre-recorded lectures mean you get no interface with the audience - no visual cues to comprehension, no questions, not interaction. Online classroom sessions often result in really low engagement by many students, and it's impossible to walk around and see how people are getting on, challenge errors that you spot, etc. You can only see what they share, which often is very little. You can design around this somewhat, but if your university was anything like ours we were not given any resource to actually spend time re-writing our material for online format, so the opportunities to reformulate things were limited, and the module specifications/accreditations/assessment formats often have fixed requirements on what the skills and content to be covered are. \n\nIf you can't write the module from scratch for an online format, the whole thing is harder work, less effective, and frankly soul crushing.",
      "author": "OrbitalPete",
      "created": 1623328704,
      "upvotes": 6,
      "replies": {
        "h19xc0z": {
          "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19xc0z/",
          "text": "I was just thrown in - go and teach online! I'm thankful that I am familiar with technology. Had it been otherwise I think I would have been lost.",
          "author": "Normal_Kaleidoscope",
          "created": 1623330487,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h1a3g4f": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1a3g4f/",
      "text": "I had a professor ask the students to incorporate emojis more in chat just so they could get some feedback. She had a lot of little jokes she peppered into her lectures and it really threw her off not hearing people’s chuckle or see a smile. It might help make your lectures more interactive if you ask your students to use 👎🏻👍🏻😆\n\nShe had to ask us a couple of times to really get the ball rolling but the class became accustomed to it within the week.",
      "author": "EnchantedNeuro",
      "created": 1623333364,
      "upvotes": 5,
      "replies": {}
    },
    "h1amgk5": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1amgk5/",
      "text": "I read a study (I can probably find it if anyone wants) that argued the principal reason why Zoom is so much more exhausting is that your brain has to go into overdrive trying to read social cues on Zoom. The same article also argued that having to look at yourself plays a part in the psychological toll of Zoom.",
      "author": "thebeatsandreptaur",
      "created": 1623341374,
      "upvotes": 4,
      "replies": {
        "h1curh7": {
          "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1curh7/",
          "text": "I saw this one on the comments https://www.nationalgeographic.com/science/article/coronavirus-zoom-fatigue-is-taxing-the-brain-here-is-why-that-happens. Is this the one?",
          "author": "NinaBoneInna",
          "created": 1623378154,
          "upvotes": 2,
          "replies": {
            "h1fllum": {
              "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1fllum/",
              "text": "Seems like it!",
              "author": "Normal_Kaleidoscope",
              "created": 1623436757,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h1cu5if": {
          "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1cu5if/",
          "text": "Sounds like an interesting study. Please share if it’s within reach.",
          "author": "NinaBoneInna",
          "created": 1623377831,
          "upvotes": 1,
          "replies": {
            "h1cujok": {
              "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1cujok/",
              "text": "https://www.psychiatrictimes.com/view/psychological-exploration-zoom-fatigue",
              "author": "thebeatsandreptaur",
              "created": 1623378036,
              "upvotes": 3,
              "replies": {
                "h1cw3wh": {
                  "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1cw3wh/",
                  "text": "Thank you",
                  "author": "NinaBoneInna",
                  "created": 1623378866,
                  "upvotes": 1,
                  "replies": {}
                },
                "h1dkpzn": {
                  "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1dkpzn/",
                  "text": "Thanks!",
                  "author": "Normal_Kaleidoscope",
                  "created": 1623394751,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h1asfft": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1asfft/",
      "text": "I started teaching online too and it is exhausting in the beginning but I have found that teaching online is flexible on my schedule. I also taught in person for a bit and honestly with this whole thing going on, there was a lot of constraints teaching in person. I've learnt a lot to protect my space during my teaching days. I lock the door and tell my roommates to keep it down for a few hours. After teaching, I go out my house, stretch and drink tea. I decompress almost immediately after class. Also, I don't schedule big things during my teaching days. Any tasks I'm doing I make sure it is not so important.",
      "author": "givemeyourdonut",
      "created": 1623343794,
      "upvotes": 3,
      "replies": {}
    },
    "h1b2w9z": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1b2w9z/",
      "text": "I was working as a lecturer last year and I despised online classes and they were far more draining and stressful than on campus. I ended up quitting and have changed to private tuition and I LOVE doing that online.",
      "author": "tacful_cactus",
      "created": 1623348081,
      "upvotes": 3,
      "replies": {}
    },
    "h1c48bi": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1c48bi/",
      "text": "If you are using Zoom, take advantage of breakout room activities to give yourself short breaks.",
      "author": "DrLyndonWalker",
      "created": 1623364384,
      "upvotes": 3,
      "replies": {}
    },
    "h19zwis": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h19zwis/",
      "text": "Yeah, so sick of Zoom.",
      "author": "odjobz",
      "created": 1623331700,
      "upvotes": 2,
      "replies": {}
    },
    "h1a2v8l": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1a2v8l/",
      "text": "Yes and no. Synchronous teaching online IS exhausting because of sitting down, people turn their cameras off,  and I feel exhausted just from feeling like I'm talking to myself. So, I went async and made videos, and that helped a lot. \n\nTeaching in person has its own challenges, mainly classroom management, which is also tiring. But when things go well, it's pretty energizing.",
      "author": "yourmomdotbiz",
      "created": 1623333098,
      "upvotes": 2,
      "replies": {}
    },
    "h1bj6cw": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1bj6cw/",
      "text": "I taught relatively small (24 students max) and interactive classes and I found teaching online less exhausting than in person. Besides the benefits of not having to ~~put on pants~~ leave the house, I also enjoyed the actual teaching more when I taught online. I required students to turn on their cameras during the Zoom sessions, and they actually participated more actively on average than in person. It seemed easier for them to ask questions, with the chat and raise hand funtion. Also, I loved the fact that since they couldn't tell who I was looking at, they just all acted like I was looking deep into their eyes the whole time ;)\n\nHowever, I imagine it would be way more energy-draining to teach a large lecture class online. The idea of talking to empty black boxes over an extended amount of time seems extremely depressing to me.",
      "author": "poor_phd_student",
      "created": 1623354915,
      "upvotes": 2,
      "replies": {
        "h1bjo2c": {
          "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1bjo2c/",
          "text": "Oh yeah I have 80 students and while teaching online has its perks (like yes, teaching in pjs pants 😆), I didn't feel like forcing them into turning their cameras on, so I'm talking to mute black boxes",
          "author": "Normal_Kaleidoscope",
          "created": 1623355125,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h1brxu0": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1brxu0/",
      "text": "Online teaching is a whole different animal. The only way to avoid complete burnout for yourself and your students is to break things up *often*. Don't go on talking for more than 10-15 minutes – show a video, give the students group tasks in breakout rooms, or whatever. Change it around. That's the only way to make it liveable for you and your students.",
      "author": "rauhaal",
      "created": 1623358742,
      "upvotes": 2,
      "replies": {}
    },
    "h1c6lhr": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1c6lhr/",
      "text": "I have been considering online teaching but I am not completely sure how to get into it.",
      "author": "pbutler6163",
      "created": 1623365559,
      "upvotes": 2,
      "replies": {}
    },
    "h1c6toz": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1c6toz/",
      "text": "It’s exhausting. I do both asynchronous lecture and synchronous workshop. For prerecorded lectures we need to edit the captions as well ( for accessibility reasons) which is extremely tiring.",
      "author": "Ok_Estimate3443",
      "created": 1623365674,
      "upvotes": 2,
      "replies": {}
    },
    "h1csoik": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1csoik/",
      "text": "Oh absolutely!!!! I am burnt out - but I blame the pandemic. It was much more fulfilling before.",
      "author": "subanic",
      "created": 1623377092,
      "upvotes": 2,
      "replies": {}
    },
    "h1cydqg": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1cydqg/",
      "text": "Reading all of these comments made me realize I'm not thaaat crazy, then. I teach 4 classes per day on average, 1.5 hours each. I'm drained and exhausted afterwards. Online teaching requires your absolute, undivided attention, rendering it veeeery energy demanding. After that, I have to summon all the demons to give me at least a sliver of energy to work on my PhD duties. Yes, I want to quit every single day.",
      "author": "Ferdii963",
      "created": 1623380087,
      "upvotes": 2,
      "replies": {
        "h1dxyzn": {
          "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1dxyzn/",
          "text": "I teach two classes 2 hours each everyday. Honestly I must be writing but after teaching I don't have the energy. I am so glad that my PhD is done and that I don't have a dissertation to write",
          "author": "Normal_Kaleidoscope",
          "created": 1623406789,
          "upvotes": 2,
          "replies": {
            "h1e7nds": {
              "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1e7nds/",
              "text": "Yeah, this post is making me reconsider my current and future situation.....",
              "author": "Ferdii963",
              "created": 1623413716,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h1d7h4m": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1d7h4m/",
      "text": "Make your lectures more interactive. Have a conversation. Look at flipping your online classroom. That will help.",
      "author": "no_ur_cool",
      "created": 1623385273,
      "upvotes": 2,
      "replies": {}
    },
    "h1di8te": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1di8te/",
      "text": "All lecturing makes me tired, in person or on line.  If it does not, I assume I have dialed it in.",
      "author": "Life_time_learner",
      "created": 1623392734,
      "upvotes": 2,
      "replies": {}
    },
    "h1dk4ig": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1dk4ig/",
      "text": "No one has recommended blue light blocking glasses, but these absolutely make a difference for me. You can get a cheap pair on Amazon and they are worth every penny! They keep you from getting as tired because they prevent eye strain.",
      "author": "simplythebess",
      "created": 1623394249,
      "upvotes": 2,
      "replies": {}
    },
    "h1f8286": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1f8286/",
      "text": "It comes with the nature of the class and the teacher as well. I don't want to blame teachers and tag it is as a \"teacher-factor\" but some students are still looking for \"fun\" that is in physical schools.",
      "author": "Long_Ad_4799",
      "created": 1623430800,
      "upvotes": 1,
      "replies": {}
    },
    "h7dbizi": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h7dbizi/",
      "text": "Online teaching can be extremely difficult!  I'd be interested to know, what makes online teaching easier for you guys? Are there any tips and tricks that make it more exciting for the students?",
      "author": "Kamiapp",
      "created": 1627861129,
      "upvotes": 1,
      "replies": {}
    },
    "h1b1nb4": {
      "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1b1nb4/",
      "text": "What about using Google Meet??",
      "author": "MinhThao151",
      "created": 1623347563,
      "upvotes": 0,
      "replies": {
        "h1bd7vr": {
          "link": "/r/AskAcademia/comments/nwkj1b/does_online_teaching_make_you_tired/h1bd7vr/",
          "text": "Meet is what we use",
          "author": "Normal_Kaleidoscope",
          "created": 1623352347,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}