{
  "sid": "r05eu4",
  "link": "/r/AskAcademia/comments/r05eu4/startups_and_moral_responsibility_to_your_students/",
  "title:": "Startups and moral responsibility to your students",
  "text": "I’d like to get some input on this. Maybe I’ve just never paid attention to this, or maybe it’s because I went to a small state school so it never really was on my radar, but I really feel strange about what I’ve been observing lately. It seems like in academia, grad students are just toiling to generate data for PIs to start their own little fancy companies, and aren’t really there to nurture their growth as researchers. I’m slowly getting disillusioned by academia as a whole",
  "author": "Whatsmyusernamelolol",
  "created": 1637643629,
  "updated": 1637688571,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hlqw7lf": {
      "link": "/r/AskAcademia/comments/r05eu4/startups_and_moral_responsibility_to_your_students/hlqw7lf/",
      "text": "I have very rarely seen a PI who manages students and runs a company. It's usually the PI who gets offered an attractive position and then leave his old group to pursue that, acting as a temporary supervisor to his students, who are typically managed by someone who is there full time.",
      "author": "_Microbe_",
      "created": 1637655930,
      "upvotes": 3,
      "replies": {}
    },
    "hlql4b6": {
      "link": "/r/AskAcademia/comments/r05eu4/startups_and_moral_responsibility_to_your_students/hlql4b6/",
      "text": "Grad students are definitely doing the bulk of the actual research in many research groups, most of which tends to be 'harvested' by the PIs. I dont see a lot of businesses being started by PIs, but that is probably discipline related, I'm in paleoclimatology",
      "author": "DeepSeaDarkness",
      "created": 1637647499,
      "upvotes": 3,
      "replies": {
        "hlqna7t": {
          "link": "/r/AskAcademia/comments/r05eu4/startups_and_moral_responsibility_to_your_students/hlqna7t/",
          "text": ">  most of which tends to be 'harvested' by the PIs\n\nWhat's the overall take on this where you're at?",
          "author": "wetcogbag",
          "created": 1637648985,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlr4qvc": {
      "link": "/r/AskAcademia/comments/r05eu4/startups_and_moral_responsibility_to_your_students/hlr4qvc/",
      "text": "You're conflating two issues. One is the increasing trend in some fields of PIs undertaking translation activities to commercialise their research. \n\nThe second is PIs neglecting their responsibilities as mentors. \n\nThe latter is and always has been a problem. Ten years ago when social media was starting there was a significant backlash in academia against academics who spent their time using social media and doing public engagement. I think the same is now true of commercialisation. It comes from this attitude that academia is too pure for the real world, and engaging outside the ivory tower contaminates it. \n\nCommercialisation doesn't have to be bad for people working in labs that spin out ideas. It can be a fantastic experience for individuals and in some instances they'll get the financial rewards. \n\nAcademic findings don't magically improve the world. Just putting something in a paper doesn't change anything. While I think a lot of universities have terrible commercialisation strategies which are based on short term profit and are very weak in terms of creating sustainable impact, commercialisation in and of itself isn't a bad thing. It can be very difficult for large institutions like government, NIH or the NHS to adopt new technologies and companies who spin out to provide these as outsourced services can be hugely impactful and for the smarter universities can return the investment into the university which is closer to a public good than shareholders are (not ideal, could be much better but still better than just VCs getting rich).",
      "author": "ACatGod",
      "created": 1637663503,
      "upvotes": 3,
      "replies": {
        "hlrypns": {
          "link": "/r/AskAcademia/comments/r05eu4/startups_and_moral_responsibility_to_your_students/hlrypns/",
          "text": "This is an interesting perspective. I think my gripe is with individuals who only push their students to churn out ideas that can be commercialized. The students do so much work and contribute so much intellectually, but aren’t even fairly compensated. Like why take pennies for doing the same thing you could be doing in industry and making more money? Aside from obviously being conferred a title. I don’t know. At some point we have to ask ourselves how much of this is worth it. And academia just isn’t sustainable the way it’s being run now but that’s just a whole different topic",
          "author": "Whatsmyusernamelolol",
          "created": 1637681054,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}