{
  "sid": "r7pz7w",
  "link": "/r/AskAcademia/comments/r7pz7w/accidental_plagiarism/",
  "title:": "Accidental plagiarism",
  "text": "Hi everyone \nI run a side business writing business plans. I gave an unpaid illustrative example of what a business plan would look like to my potential client to decide if she wanted to go with me or not\nHer business dealt with selling accessories and the plan I made was a copy and pasted food company plan as an example. We had a similar assignment in school about creating a plan and I made an accidental submission of the illustrative plan I sent to my client instead of the original work I created. I got flagged for plagiarism and I’m facing the committee on the 7th. I’ve tried sending them proof of the conversation I had with my client and the documentation I have of my side business. And I do have time stamps showing my original essay was created before the due date \nI’m still scared of the outcome tbh \nWhat do you guys think my fate would likely be",
  "author": "Lere0898",
  "created": 1638504343,
  "updated": 1639515805,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.82,
  "comments": {
    "hn147tb": {
      "link": "/r/AskAcademia/comments/r7pz7w/accidental_plagiarism/hn147tb/",
      "text": "As long as you have concrete proofs that this is not a deliberate act, they should be lenient about it. \n\nThey will be even more lenient if this your first case.\n\nIt will be good if your client can also give a statement to support your case.",
      "author": "MarkZelVitch",
      "created": 1638506958,
      "upvotes": 13,
      "replies": {
        "hn14jnc": {
          "link": "/r/AskAcademia/comments/r7pz7w/accidental_plagiarism/hn14jnc/",
          "text": "It is my first case, so you think I should ask my client if she can be present on my hearing day or have her write a written statement?",
          "author": "Lere0898",
          "created": 1638507130,
          "upvotes": 7,
          "replies": {
            "hn14sy9": {
              "link": "/r/AskAcademia/comments/r7pz7w/accidental_plagiarism/hn14sy9/",
              "text": "Writing a statement should be enough. However, if your client does not mind coming to the hearing, that would be great.",
              "author": "MarkZelVitch",
              "created": 1638507270,
              "upvotes": 7,
              "replies": {}
            },
            "hn3aufx": {
              "link": "/r/AskAcademia/comments/r7pz7w/accidental_plagiarism/hn3aufx/",
              "text": "I dont think tjat would be helpful for your business",
              "author": "DeepSeaDarkness",
              "created": 1638552924,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}