{
  "sid": "gh5mes",
  "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/",
  "title:": "Is it possible to be published even as a non-profesional?",
  "text": "Hello,\nsome time ago I had met a guy working in university administration, he is without any diploma, without any title, M.A. nor bachelor... but since he is often mistaken for profesor since he is visitting conferences and helping students with everything....\nIt let me think: is it possible to publish in academic magazines or taking part in conferences if you lack titles or background in some university?\nWill you paper fail in review if you lack PhD?\nAnd did you met some \"laic\" researchers to be recognized by academia?",
  "author": "JacobWeisenberger",
  "created": 1589131790,
  "updated": 1634081393,
  "over_18": false,
  "upvotes": 129,
  "upvote_ratio": 0.96,
  "comments": {
    "fq6xl43": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq6xl43/",
      "text": "It's quite possible, it just doesn't tend to happen because the skillset you need to publish you only tend to learn...in academia.",
      "author": "r3dl3g",
      "created": 1589139140,
      "upvotes": 159,
      "replies": {
        "fq8jwa6": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8jwa6/",
          "text": "What a lot of people outside of academia don't realize is that while we all know getta a PhD doesn't make you smart (of course there are people who don't have PhDs who are very smart and insightful), it makes you knowledgeable. As a result, you have a much deeper understanding of what has been done before and how it meshes with what we know now. Lacking this base of knowledge would be one of the biggest obstacles to publishing. It's very hard, maybe impossible, to do meaningful original research without such a background.",
          "author": "survivalothefittest",
          "created": 1589167914,
          "upvotes": 27,
          "replies": {}
        },
        "fq7hfxa": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7hfxa/",
          "text": "This. It takes at least 10 years of post secondary education to get a PhD but somehow this guy is going to skip that and be able to make a contribution to a given field? Could it happen? Sure. But it is highly unlikely.",
          "author": "ThatProfessor3301",
          "created": 1589146436,
          "upvotes": 67,
          "replies": {
            "fq7zeir": {
              "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7zeir/",
              "text": "I mean, if you’re well read in the field, and you carry out a good quality study with some interesting results, sure!\n\nI think it’s just that most people that are interested enough in fields like this have taken the step to formally study it at some point in their lives.",
              "author": null,
              "created": 1589155350,
              "upvotes": 38,
              "replies": {
                "fq87c0j": {
                  "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq87c0j/",
                  "text": "It does depend on the field and the particulars of the person, so in principle it's certainly more rare but at the end of the day publishable material is publishable material.\n\nSource: once published in anthropology, 5+ publications in evidence based medicine as a post-bacc (BA) only.",
                  "author": "fedawi",
                  "created": 1589159973,
                  "upvotes": 13,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fq7n1aw": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7n1aw/",
      "text": "You don't have to be a PhD or academic affiliated to publish an academic paper.  I've seen some papers published where they added themselves as \"Independent Researcher.\"  I think, being in an academic setting, there are more advantages, such that writing an academic paper or getting subject expertise from others, which strengthen's your findings. But, it is possible, I've seen it happen on pubmed.  There are people who publish as an \"Independent Researcher.\" In addition to that, most journals don't look at your credits (as reviews are suppose to be anonymous), so their focus is mostly on content.  If you can follow the academic format of writing and are of expertise of the subject.  Surely, you can publish papers to an academic journal.",
      "author": "dir0417",
      "created": 1589148584,
      "upvotes": 49,
      "replies": {
        "fq7yp5d": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7yp5d/",
          "text": "**The vast majority of people who publish as independent researchers have PhDs.** They are just no longer affiliated with a university. Once you have graduated, you are not able to use your university as your affiliation (although you can note you earned your degree there). \n\nIndependent researchers earned their doctorate, but either have chosen to not pursue an academic career **or** pursued an academic career but were unable to secure a tenure-track position and are no longer affiliated with an institution where they may have held a fellowship or visiting/adjunct position.",
          "author": "synthesis-synthesis",
          "created": 1589154932,
          "upvotes": 56,
          "replies": {
            "fq87k7r": {
              "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq87k7r/",
              "text": "It's also pretty common in some fields for someone without a PhD (undergrad, research assistant/tech, grad student, etc) to publish in collaboration with someone with a PhD.",
              "author": "mediocre-spice",
              "created": 1589160105,
              "upvotes": 14,
              "replies": {}
            },
            "fq8vpa3": {
              "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8vpa3/",
              "text": "Its true that a vast majority are people who publish as an independent researcher have PhD's.  There are very few exceptions who don't have PhD's.  This guy is a good example of someone without a PhD (he has a Masters) and published as an independent researcher (this guy is looking to get a PhD currently). The point is \"it is possible,\" very rare and it will be difficult as well without resources, but \"it is possible.\" [https://andreasmadsen.github.io/](https://andreasmadsen.github.io/)\n\nHe explains it here  [https://medium.com/@andreas\\_madsen/becoming-an-independent-researcher-and-getting-published-in-iclr-with-spotlight-c93ef0b39b8b](https://medium.com/@andreas_madsen/becoming-an-independent-researcher-and-getting-published-in-iclr-with-spotlight-c93ef0b39b8b)",
              "author": "dir0417",
              "created": 1589176895,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fq80um5": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq80um5/",
      "text": "I'm thinking of Wolfram who recently 'published' (i.e. not peer reviewed) giant dissertation 'discovering all of physics'.\n\n\nWolfram *has* a PhD in theoretical physics fro Caltech but by skipping the peer review process (because what he has 'published' would not make it through) his work is mocked (because it is bad).\n\n\nI think the opposite could be true---it would just be really hard. If you have a good idea, you do the research, you go through the peer review process you could get a published work...it would just be hard to know you have a good idea from outside academia. But i think it could happen.",
      "author": "harper_kentucky",
      "created": 1589156212,
      "upvotes": 9,
      "replies": {}
    },
    "fq6i9r7": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq6i9r7/",
      "text": "It is possible, papers are accepted on the merit of the paper not the author. However professional academics have advantages, for example I have an entire day a week booked out for this sort of work, whereas an administror cant have similar accommodations",
      "author": null,
      "created": 1589132048,
      "upvotes": 17,
      "replies": {
        "fq9cdgp": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq9cdgp/",
          "text": "I think having a good title and affiliation does help bias the referee in your favor and having nothing will bias them against you. However, in many cases when I have refereed papers, I have not even bothered to look at the affiliations of the authors, or even their names. Most referees do not want to spend more time than necessary reviewing papers and I won't bother looking into the author's details.",
          "author": null,
          "created": 1589193468,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fq6la8j": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq6la8j/",
      "text": "It's possible but rare, especially in STEM. A more common way to get published if you are not a professional researcher or academic is to volunteer in an existing professor's lab and publish under their auspices.",
      "author": "shardsofcrystal",
      "created": 1589133703,
      "upvotes": 24,
      "replies": {}
    },
    "fq7qbuj": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7qbuj/",
      "text": "It is possible though I would say it's better to have a researcher in the area who takes a look or coauthors the paper. The most important thing is to make sure that it is a worthy contribution and not reinventing the wheel.\n\nFrankly speaking, a lot of junk papers are being submitted by so-called cranked researchers even though their intentions are good.",
      "author": "winner_in_life",
      "created": 1589150055,
      "upvotes": 12,
      "replies": {
        "fq7qcag": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7qcag/",
          "text": "I agree, this does seem possible.",
          "author": "agree-with-you",
          "created": 1589150062,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fq8bwge": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8bwge/",
      "text": "Definitely. You don't require a PhD to publish. I have published 3 and on my way to a 4th paper, all with a title \"Independent Researcher\". Some journals do have requirements for the author to be affiliated to some University, but only a few.",
      "author": null,
      "created": 1589162711,
      "upvotes": 5,
      "replies": {}
    },
    "fq7yfjn": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7yfjn/",
      "text": ">Is it possible to be published even as a non-profesional?\n\nYes\n\n>is it possible to publish in academic magazines or taking part in conferences if you lack titles or background in some university?\n\nYes\n\n>Will you paper fail in review if you lack PhD?\n\nPublishing policies depend on the journal.\n\n>And did you met some \"laic\" researchers to be recognized by academia?\n\nNo. But frankly in my circles I don't know anyone without at least a college credential.",
      "author": "bennyandthef16s",
      "created": 1589154773,
      "upvotes": 5,
      "replies": {}
    },
    "fq8cbfp": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8cbfp/",
      "text": "It is indeed, i got my MSc thesis published",
      "author": "khordi1",
      "created": 1589162978,
      "upvotes": 3,
      "replies": {}
    },
    "fq6t1bv": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq6t1bv/",
      "text": "From my reading, yes, absolutely. Journals for the humanities and arts tend to be more flexible in their admissions policy than those for STEM subjects, I’ve found; some of the former even actively encourage independent scholars to submit their research to them. \n\nOn the other hand, there are those which can be quite exclusive, and won’t be so inclined to consider work that’s not from a professional or tenured scholar (their loss).\n\nIn any case, I’d advise contacting the board or editor of the journal(s) your friend has in mind, and directly ask what their admissions policy is.",
      "author": "NoGames94",
      "created": 1589137482,
      "upvotes": 9,
      "replies": {
        "fq8emrr": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8emrr/",
          "text": "An independent scholar is usually someone who has a PhD but no current institutional affiliation, not someone without a PhD.",
          "author": "pipkin42",
          "created": 1589164472,
          "upvotes": 10,
          "replies": {}
        },
        "fq9fglc": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq9fglc/",
          "text": "I don't think its as much policy as its just easier to do humanites research without university support. Sure having full access to the university library and things like JSTOR as well as the 'privileged' access many archives afford academics is an invaluable help, but you could conceivably work in my area without those things (it'd just be harder and more expensive .) However, a microbiologist who needs access to a lab to do even basic original research is probably going to find it impossible to be an independent researcher (its telling that the independents in STEM tend to cluster in the theoretical side of the discipline or things like CS where, again, the barrier to entry is accessible to non-academics.)",
          "author": null,
          "created": 1589196555,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fq7z6zj": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7z6zj/",
      "text": "Certainly, anyone who has gained expertise on a subject can submit and potentially be published. It is very difficult to gain expertise without:\n\n**1)** access to past and present research (due to paywalls, which I think are problematic)\n\n**2)** in STEM, access to advanced equipment and fieldwork sites; in humanities and social sciences, access to funds for ethnographic fieldwork and archival research\n\n**3)** ongoing discussions and debates with recognized experts in the field (in other words, the people who would be your professors and advisors)\n\n**4)** ongoing discussions and debates with peers who are also pursuing the doctorate\n\n**5)** many, many opportunities to try and fail and try again to construct an actual argument in your given field\n\n**6)** ample time to immerse yourself in others' research and your own; people are generally required to pursue PhDs full-time, without other work commitments, and it still takes between 6-7 years to complete on average (in the U.S.)\n\n**7)** time to write an article--a full-time professor, like myself, could take up to a year to write an article, depending on the scope and resources required; it could take someone with a full-time job twice as long, which is completely fine, but not an easy issue to navigate\n\nThe discussions and debates I mention above are not just \"for fun.\" We require interlocutors who can intelligently challenge our ideas and claims. **No matter how smart or hard-working you are, no one can actual decipher or create significant work in a vacuum.**\n\nI'm ***not*** saying you must be trained within a university's infrastructure, but I ***am*** saying **you need peers**\\--some who know *less* than you, some who know *as much* as you, and some who know *more* than you.\n\nThis may help give you perspective: *consider that it is very difficult for even those of us with PhDs to publish.*",
      "author": "synthesis-synthesis",
      "created": 1589155226,
      "upvotes": 10,
      "replies": {}
    },
    "fq8f1jg": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8f1jg/",
      "text": "I feel it depends on where and what you are publishing. I currently only have a masters, but have published several articles relating to the application of my professional field, best practices for certain tasks in the field, and similar things. Not really adding any theoretical advancement to the field only application of established theories.  During my masters I worked under a medical researcher and published a meta analysis with them, but, honestly, that was on a whole other level than what I have done recently. The level of statistics, thought, and general work put in was exponentially more than anything I have done recently. I would not have been able to help without guidance from them. \n\nSo, I would say it is possible, but if it is for a high impact scientific journal it may be tough. But if it is a journal that focuses more on a professional field and not the theory of the field it probably would be easier. Like I mentioned earlier I required guidance from the other researcher when working on the meta-analysis, so I will say that the skills needed to do the necessary rigor of work for a high impact journal are learned through a PhD. Not skills any lay person, or even some college graduates for that matter, would have.",
      "author": null,
      "created": 1589164734,
      "upvotes": 3,
      "replies": {}
    },
    "fq8p6nr": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8p6nr/",
      "text": "In  my field there are prestigious journals that make you pay per page to  get your work refereed if you  have no university affiliation or are an unknown. Although papers submitted by these  sorts are  overwhelmingly \"proof of Riemann hypothesis!\"  or stuff like that so even when  they  pay, the papers  aren't looked  at seriously - just pawned off onto students to find obvious  mistakes.   \n\n\nI think, at least in my field, one would  probably need connections to a  journal  for them to take a paper  from  someone without  an academic degree (or at least  some professional vouching for  you)  of some sort  seriously",
      "author": "mrross00",
      "created": 1589171716,
      "upvotes": 3,
      "replies": {}
    },
    "fq6rwup": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq6rwup/",
      "text": "Absolutely they can publish. Scholarly work should not be judged based on a person's background. \n \nOur current systems are heavily set to favor those involved in academia. From networking opps to resource support, including available time, the system excludes good researchers and good work that could come from the outside. And I don't see entrenched academics rushing to upset the cart. This is a disservice to people and disservice to science and societies.",
      "author": "Kingarvan",
      "created": 1589137051,
      "upvotes": 23,
      "replies": {
        "fq7tozo": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7tozo/",
          "text": "Is it...? You can't do surgery from your living room. You need to go to med school and be affiliated with a practice or hospital that has the appropriate equipment. It seems pretty reasonable most of the literature is written by scientists doing science in science labs with scientific equipment, not Joe Schmo messing around in his garage.",
          "author": "mediocre-spice",
          "created": 1589151994,
          "upvotes": 20,
          "replies": {
            "fq7wy33": {
              "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7wy33/",
              "text": "What about people who work on cutting edge tech? Imagine saying this to the openai team who are all professionals publishing every 3 months",
              "author": null,
              "created": 1589153902,
              "upvotes": -6,
              "replies": {
                "fq86kwo": {
                  "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq86kwo/",
                  "text": "I wouldn't consider tech science and it seems to have more leeway (building something and showing it works is different than creating experiments to answer questions about the world). It also looks like they hire a ton of PhDs, I know google deepmind does.",
                  "author": "mediocre-spice",
                  "created": 1589159535,
                  "upvotes": 2,
                  "replies": {
                    "fq8kg2c": {
                      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8kg2c/",
                      "text": "So no tech at all? Thats pretty funny.\n\nI know this is an academia sub, but you have to be realistic.\n\nWhat about humanities fellowship scholars who dont have a phd? I know plenty of fellow scholars who got hired from their private work instead of their degrees.",
                      "author": null,
                      "created": 1589168285,
                      "upvotes": -4,
                      "replies": {
                        "fq8moim": {
                          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8moim/",
                          "text": "The comment I'm responded to explicitly said it was detrimental to society that *science* is largely published by people with PhDs. Tech and humanities have quite different goals and expectations that make training/experience outside academia more transferable.",
                          "author": "mediocre-spice",
                          "created": 1589169850,
                          "upvotes": 6,
                          "replies": {
                            "fq8ncpk": {
                              "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8ncpk/",
                              "text": "I would argue that they really don't. What's the end goal of studying and publishing a material based on hypotheticals? To apply them to non-hypotheticals. You have to ask why there's even funding for projects and research in the first place if you think they don't have the same goals.",
                              "author": null,
                              "created": 1589170337,
                              "upvotes": -5,
                              "replies": {
                                "fq8osds": {
                                  "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8osds/",
                                  "text": "There's a shared goal in an abstract way in improving society and that's what it's funded on, but the questions they ask are different. Tech/engineering asks \"can we build this? can we make a computer do this?\" while science asks \"how does this natural phenomena work?\"",
                                  "author": "mediocre-spice",
                                  "created": 1589171413,
                                  "upvotes": 0,
                                  "replies": {
                                    "fq8q5g4": {
                                      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8q5g4/",
                                      "text": "It may because youre paint with a broad brush but I just dont see it like that especially after talking to some tech research funders. It really isnt just about making x do y but also gaining the known possibilities for implementation into the consumer market. Even in something like quantum computing just proving the build as a success means a lot for consumer electronics.",
                                      "author": null,
                                      "created": 1589172446,
                                      "upvotes": 1,
                                      "replies": {
                                        "fq8tp3y": {
                                          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8tp3y/",
                                          "text": "Implementation is still about building things. I'm also not saying it means less or more. These are all important questions, just different ones. Showing that a build is successful is a fundamentally different type of claim than saying you've found out how something works.",
                                          "author": "mediocre-spice",
                                          "created": 1589175237,
                                          "upvotes": 3,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "fq7y77x": {
              "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7y77x/",
              "text": "Pretty good arguments that would make the status quo cheerleaders happy. Irrelevant what medical doctors would do. \"Surgery from living room\". \"Joe Schmo messing around in his garage\". What?? Those statements might please your friends, but it is laughable you bring such imagery.\n\nYou missed the points or rather, preferred to miss them because they made you unconfortable. Endorsing a system that favors only certain groups and excluding others who are resource- and opportunity-poor in no way advances science as much as it should. It advances the status quo. \n\nAllow everyone equal playing fields, train them and then let them do science.",
              "author": "Kingarvan",
              "created": 1589154636,
              "upvotes": -9,
              "replies": {
                "fq84knc": {
                  "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq84knc/",
                  "text": "Who is missing out and not getting published here?\n\nI also don't understand how you can complain about most published scientists having PhDs and then say \"train them and let them do science\"...? We have a system intended to do that already. It's called a PhD.",
                  "author": "mediocre-spice",
                  "created": 1589158376,
                  "upvotes": 12,
                  "replies": {}
                }
              }
            }
          }
        },
        "fq7tw65": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7tw65/",
          "text": "A PhD is a research degree and essentially an apprenticeship in doing and communicating research in a given field. We put people who practice medicine without appropriate credentials in jail and you probably wouldn’t let an unlicensed plumber or electrician work on your house. Yet research journals do not check if someone had a PhD before sending a paper out for review.\n\nNow, I’m not actually advocating that they should, but it’s not true that the system excludes researchers from the outside. In my field it is common for people who work for the government or industry to publish, but they usually have PhDs (sometimes masters).",
          "author": "PM_me_your_squids001",
          "created": 1589152112,
          "upvotes": 11,
          "replies": {
            "fq7yfg5": {
              "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7yfg5/",
              "text": "You don't need a PhD to publish.",
              "author": "Kingarvan",
              "created": 1589154772,
              "upvotes": 7,
              "replies": {
                "fq7z1uq": {
                  "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7z1uq/",
                  "text": "Well no, but the skill set needed to carry out publishable research is specifically taught during a PhD, so it is not surprising that a vast majority of publications are authored by people with a PhD or in the process of getting one.",
                  "author": "PM_me_your_squids001",
                  "created": 1589155139,
                  "upvotes": 5,
                  "replies": {
                    "fq7zzj1": {
                      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7zzj1/",
                      "text": "That's understood. The point made here was about something else. If others who can acquire the skills, but are hampered due to resource, institutional reasons and societal reasons, then those otherwise gifted people would never get to publish. Publishing these days needs access to networks, monies, etc. These are not available to large majority. You can be qualified to do good science without a PhD.",
                      "author": "Kingarvan",
                      "created": 1589155697,
                      "upvotes": 1,
                      "replies": {
                        "fq81zpq": {
                          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq81zpq/",
                          "text": "I agree that there are systemic inequities that prevent talented people from obtaining PhDs. It is a loss to science and we should absolutely be working to broaden that access.\n\n> These are not available to large majority. You can be qualified to do good science without a PhD.\n\nHere is where I disagree. This is no longer really possible in modern science. Any experimental research requires access to specialized instruments and/or a wet lab and most computational research requires supercomputer access. Any low-hanging fruit that does not is no longer publishable. Also, science as practice is nowadays so “granular” and field-specific that it cannot really be self-taught and requires an apprenticeship.",
                          "author": "PM_me_your_squids001",
                          "created": 1589156868,
                          "upvotes": 4,
                          "replies": {
                            "fq84frb": {
                              "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq84frb/",
                              "text": "Glad we are in sync about inequities in publishing. These are very serious but often dismissed. Our scientific literatures and societies are much poorer for these endemic shortcomings.\n \nYes many scientific fields today are knowledge-heavy about micro specialities and many still require the use of large resources that you mention. But these are also precisely the reasons modern publishing practices have disenfranchised significant numbers of peoples. We have a self-fulfilling cycle here. Gain entry to the hallowed halls and obtain the micro skills or else you cannot publish. And you cannot publish if you couldn't gain entry. \n\nOur scientific disciplines now reward people with such specific skills. In effect, they are rewarding privilege and those that have been fortunate in these aspects.  \n \nSTEM fields now largely discourage those without the ability to obtain these skills. In the social sciences, apart from gaining specialized research skills, it is still possible to do independent work, but that is becoming harder with the lack of resources to those unaffiliated with institutions. Those affiliated with small places or no places at all are at significant peril.",
                              "author": "Kingarvan",
                              "created": 1589158297,
                              "upvotes": 3,
                              "replies": {}
                            },
                            "fq8yiav": {
                              "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8yiav/",
                              "text": "I think You can absolutely do good science without fancy tools. \n\nBut maybe it’s because I’m in ecology which is about observing natural systems, and a lot of the software we use has free open source options.\n\nAlthough I agree that self teaching it would be pretty hard.",
                              "author": null,
                              "created": 1589179404,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fq7oelt": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7oelt/",
      "text": "It is very possible.  However, it takes work and talent.  Respect.",
      "author": "DamCraftyBeaver",
      "created": 1589149119,
      "upvotes": 5,
      "replies": {}
    },
    "fq857yw": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq857yw/",
      "text": "I've published peer-reviewed papers while working in industry and having only a BS. There's always \"reviewer 2\" to worry about, but if you've done a solid literature search, rigorous work in your research, etc., you can definitely be published without being \"part of the club.\"",
      "author": "iugameprof",
      "created": 1589158745,
      "upvotes": 2,
      "replies": {
        "fq8f221": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8f221/",
          "text": "[deleted]",
          "author": null,
          "created": 1589164744,
          "upvotes": 2,
          "replies": {
            "fq9cvq3": {
              "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq9cvq3/",
              "text": "It helps to be working in an area that's really on the frontier so there's not a lot of established dogma (mine was social AI and theories of emotion).",
              "author": "iugameprof",
              "created": 1589193987,
              "upvotes": 1,
              "replies": {
                "fqash80": {
                  "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fqash80/",
                  "text": "Yeah, this is what I did. Published as first author in a decent journal before getting a bachelor's in a relatively new field (quantum information).",
                  "author": "tunaMaestro97",
                  "created": 1589224504,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fq890a3": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq890a3/",
      "text": "We sometimes have administrators on our research papers because they help set up and perform the studies.  But they're not the lead authors.",
      "author": "dampew",
      "created": 1589160941,
      "upvotes": 2,
      "replies": {}
    },
    "fq8wkha": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8wkha/",
      "text": "I'm also similarly wondering if it's possible for a PhD to publish in journals that are outside their field.",
      "author": "Hardcore90skid",
      "created": 1589177648,
      "upvotes": 2,
      "replies": {}
    },
    "fq9140z": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq9140z/",
      "text": "> is it possible to publish in academic magazines or taking part in conferences if you lack titles or background in some university?\n\nDefinitely. You can apply for UK Biobank data if you can demonstrate at least some veracity as a researcher, or even some degree of research plan. From there you can publish and to some extent the sky's the limit.\n\nBut as others have said, the likelihood seems low (not impossible of course) that someone could approach the cutting edge without formal education.",
      "author": "dl064",
      "created": 1589181866,
      "upvotes": 2,
      "replies": {}
    },
    "fq94yj3": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq94yj3/",
      "text": "I think rather than non-professional you mean non-academic - the person you've described is a professional, they just working in the administration side of the university (what we'd commonly describe as 'professional services' in the UK.)\n\nPeople who are not in academic positions and/or do not have a PhD can absolutely be published in academic journals. How common this is is probably quite field-dependent and likely related to how valued 'practitioner research' is within that field. In my experience, this tends to be fairly common in fields like education, nursing and social work.",
      "author": "Jess_Skates",
      "created": 1589185714,
      "upvotes": 2,
      "replies": {}
    },
    "fq9aggf": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq9aggf/",
      "text": "[deleted]",
      "author": null,
      "created": 1589191470,
      "upvotes": 2,
      "replies": {
        "fqaskiu": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fqaskiu/",
          "text": "Holy shit, haha.",
          "author": "tunaMaestro97",
          "created": 1589224549,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fq9dvy3": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq9dvy3/",
      "text": "The only similar example I can think of is Dr. Jane Goodall who obtained a PhD directly w.o. having obtained even a BA. I have no doubt the level of her intelligent and field work research is very high however as in order to do this is beyond what an average person can do.",
      "author": "madison010101",
      "created": 1589195023,
      "upvotes": 2,
      "replies": {}
    },
    "fq9e2xy": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq9e2xy/",
      "text": "Others have addressed the chances of publishing in journals (the most detailed, accurate answer I have seen is from /u/synthesis-synthesis).\n\nRegarding the part about taking part in conferences: Conferences usually don't have any formal requirements for participation, except that you need to pay a certain registration fee (often quite substantial, think $500-$2000). \n\nAdministrative staff are a special case, since they may play a role in the organization of local conferences -- in this role, they also may \"participate\" in conferences.",
      "author": "ColourlessGreenIdeas",
      "created": 1589195217,
      "upvotes": 2,
      "replies": {}
    },
    "fq9eiad": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq9eiad/",
      "text": "I think it is possible, but depends heavily on several factors. It depends on the field for one thing, and on the claims you make for yourself in your research. If you have no qualification or institution and you claim to answer some long standing questions in your field, probably no one will bother to read your paper. But amateurs do sometimes make progress, even in mathematics which has become very specialised. There was a case of a 4chan user proving something about superpermutations - that proof could probably have found its way into some peer reviewed publication. Even that though is not a strong enough result on its own for a full paper, in my estimation. It's quite difficult to generate sufficiently strong results unless you are working on it full time really, and ideally with access to other researchers to collaborate with or at least bounce ideas off.",
      "author": "l_lecrup",
      "created": 1589195633,
      "upvotes": 2,
      "replies": {
        "fq9eih4": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq9eih4/",
          "text": "I agree, this does seem possible.",
          "author": "agree-with-you",
          "created": 1589195639,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fq9on43": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq9on43/",
      "text": "This question comes up here a lot...\n\n> is it possible to publish in academic magazines or taking part in conferences if you lack titles or background in some university?\n\nConferences are incredibly expensive.  I work in a field that's well acquainted with industry but in general employers don't pay for their employees to attend and present at conferences, except in academia, let alone random admin people.  When I do meet industry folks at conferences it's almost always high level execs or government employees.\n\n> Will you paper fail in review if you lack PhD?\n\nNot necessarily, but the academic article is an art unlike any other.  It's kind of like asking \"hey I like to run, if I showed up at the NYC marathon would I make it?\"  The short answer is there's a chance, but you really need the proper training to even have a tiny shot at it.\n\n> And did you met some \"laic\" researchers to be recognized by academia?\n\nNo one who doesn't do research as their full time job, just like I haven't met any doctors or lawyers or nurses or garbage collectors or sysadmins who do it on the side in addition to a different full time job.  I've met plenty of non-academics who publish, but they do research as their full time job in some form or another.  There's really not much room to break into any profession as a hobbyist.\n\nTL;DR- Yes there's a slight chance but the person you know is likely an exception rather than a rule.  If you want to publish academic work, go for your PhD.",
      "author": null,
      "created": 1589203722,
      "upvotes": 2,
      "replies": {}
    },
    "fqapsdt": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fqapsdt/",
      "text": "Yes it's possible. I was published as a first author before getting my bachelor's (still haven't). However I was supervised by a professor. Publishing as a sole author with no background is incredibly difficult, but not because of your lack of a title. Papers are judged based on their merit, not their authors. But lacking the background, it will be nearly impossible to produce a paper which is novel and of high enough quality to be published.",
      "author": "tunaMaestro97",
      "created": 1589223181,
      "upvotes": 2,
      "replies": {}
    },
    "fqg0qpr": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fqg0qpr/",
      "text": "Take part in conferences? Easy. There are many conferences that anyone can participate in (any conferences except \"invite only\" ones).\n\nPublish? Hard. Possible, but hard, and most likely these will be in worse journals.",
      "author": "FriendlyFlugelHorn",
      "created": 1589335537,
      "upvotes": 2,
      "replies": {}
    },
    "fqqgnbk": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fqqgnbk/",
      "text": "My husband was published in peer reviewed journals in a variety of specialties (law enforcement, archaeology, intellectual property law, and others) as a non-specialist, then got his PhD a few months ago in creative writing, based on those publications. I searched for it online, not available.",
      "author": "chlorinesmellsgood",
      "created": 1589565188,
      "upvotes": 2,
      "replies": {}
    },
    "fq7ahge": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7ahge/",
      "text": "I was actually thinking about this because I am from a STEM background but wants to publish in music and philosophy. I don't know how would that be possible.",
      "author": "swiftrobber",
      "created": 1589143874,
      "upvotes": 3,
      "replies": {}
    },
    "fq7sv1l": {
      "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq7sv1l/",
      "text": "Yep! It is rare, a little more common in Humanities perhaps. Generally these people are referred to as \"Alt Academics\". Often an Alt Academic - in my experience - is someone who makes their living as, say, an author, and in addition to getting book deals, grants etc for fiction, they also do so for academic texts. Often they are not tethered to a University, but may form partnerships with them here and there.",
      "author": "EatingBeansAgain",
      "created": 1589151514,
      "upvotes": -4,
      "replies": {
        "fq8iwxj": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8iwxj/",
          "text": "Most alt-academics have PhDs.",
          "author": "restricteddata",
          "created": 1589167249,
          "upvotes": 5,
          "replies": {}
        },
        "fq8bplh": {
          "link": "/r/AskAcademia/comments/gh5mes/is_it_possible_to_be_published_even_as_a/fq8bplh/",
          "text": "Who are you thinking of?",
          "author": "HomunculusParty",
          "created": 1589162591,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}