{
  "sid": "qvvk4z",
  "link": "/r/AskAcademia/comments/qvvk4z/working_in_higher_education_in_the_east/",
  "title:": "Working in Higher Education in the East (Japan/Korea/China...) - Looking for Perspectives",
  "text": "Many moons ago, right after finishing my undergrad, I made a move to South Korea, where I taught English for a few years. Those were awesome years, for many reasons (food, friends, adventures).  \n\n\nCut back to present day, now with a PhD under my belt, and looking at how many countries in the East have grown and matured, I've begun to consider the option of going back there, this time to work in the higher education system. Based on a few conversations I have had with visiting professors over the years, there seems to be demand for English speaking lecturers, particularly in the commercial / business faculties.   \n\n\nSome additional info: I am in the process of building my own business, which will be a fully online enterprise, but I still want to maintain my employment income for a few years while I get my business to the point where it can sustain me full-time. My current thinking is that, if I can move abroad and live in a new and exciting place whilst I do this, then why not. I'm not tied down.  \n\n\nI am obviously doing additional non-reddit research on this, but am looking for perspective from people who have done this before. If anyone here has some thoughts or personal experiences they could share on this matter, I would be very happy to hear what you have to say. Pros and cons of course, spare no opinion.  \n\n\nAnd so, denizens of Reddit, do you have any advice to share with me?",
  "author": "scromboidfish",
  "created": 1637141350,
  "updated": 1637180859,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.78,
  "comments": {
    "hkzies9": {
      "link": "/r/AskAcademia/comments/qvvk4z/working_in_higher_education_in_the_east/hkzies9/",
      "text": "A lot depends on the exact job and your supervisors at whatever position you choose (whether academic or industry) so research the individual job as best you can. Some positions might be proper teaching positions, some might just be glorified English teachers.\n\nAs for places, Japan, South Korea, and Singapore are all good options and will be fairly similar to each other in terms of work environment and salaries. Learning the basics of the language will be very helpful if not necessary, so Japan might be a bit harder (assuming you remember some Korean; in Singapore the de facto language is English anyway). Avoid China though, too unpredictable not a great place to live, and virtually no legal protections if things go bad.\n\nIn the end, it will be just like any other job if you are going to have your own business afterwards and don't need to worry about how it affects your career and future academic work.",
      "author": "JHT230",
      "created": 1637156508,
      "upvotes": 3,
      "replies": {
        "hkzlyoq": {
          "link": "/r/AskAcademia/comments/qvvk4z/working_in_higher_education_in_the_east/hkzlyoq/",
          "text": "Thank you /u/JHT230  \\- the online testimonials I've encountered also highlight the glorified english teaching posts - which i'm not entirely against I suppose - it would seem some of those posts have minimal teaching hours - with no research responsivities, but as you say, gotta do the research for whatever position I'm looking at. I keep hearing about the Chinese horror stories - so I've more or less scratched that off my list.  Seems the downsides outweigh the upside more and more each year over there. The business is the longer term plan - but I want to keep one foot in publishing research - to keep up my relevance in industry- Singapore seems like it would be a good place to base myself, once I move into business full time. However, I've been there half a dozen times, its a relatively expensive place to live in my opinion - though perhaps not quite as expensive as a major US city. Much appreciated for your thoughts! ;)",
          "author": "scromboidfish",
          "created": 1637158232,
          "upvotes": 2,
          "replies": {
            "hkzny0x": {
              "link": "/r/AskAcademia/comments/qvvk4z/working_in_higher_education_in_the_east/hkzny0x/",
              "text": "Glad to help!\n\nIf you know or think you might want to be based in Singapore long-term, I'd focus on just looking there. It will be much easier to transition into working on your own business full time if you don't have to physically move again, plus you probably can get permanent residence sooner (depending on Singapore's immigration rules, and if that is what you want anyway).",
              "author": "JHT230",
              "created": 1637159164,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hkz5ewc": {
      "link": "/r/AskAcademia/comments/qvvk4z/working_in_higher_education_in_the_east/hkz5ewc/",
      "text": "I assume you don't mean working in English education? You didn't state your field. I have experience in STEM in Asia.\n\nThe demand for English-speaking lecturers, especially in Korea, is mostly limited to disposable non-TT hires that they can keep replacing every couple of years to maintain a semblance of internationality. I am not sure if there is any special terminology for these types of jobs in Korea, but e.g. in Japan you will often see them under names such as \"project assistant professor\", \"specially appointed assistant professor\" or similar. Such positions are glorified postdoc jobs, in the sense that you don't get much responsibility and work as part of another professor's research group.\n\nOf course, most people would consider the above as negatives, but for you it sounds pretty much perfect. You can easily work for a few years in such positions and then move on to working on your business full-time.\n\nDo note, however, that in East Asia these jobs will not allow you to earn as much as you would in the west. If you want to live in Asia and have a good salary as an academic, choose Singapore or mayyyybe Hong Kong if you manage to get a good offer there.\n\nThere are exceptions to these conditions: sometimes they do genuinely want to attract good international faculty, especially in trendy research fields or ones that receive a lot of investment. China has been investing a lot into their higher education in general and you can find some well-paying positions there (just be careful about dodgy contracts, you can find plenty of horror stories online). But these type of positions are usually intended for academics who genuinely want to settle down and establish a group there, and will likely require more effort than you'd want to spare.",
      "author": "sure_complement",
      "created": 1637148651,
      "upvotes": 7,
      "replies": {
        "hkzha7m": {
          "link": "/r/AskAcademia/comments/qvvk4z/working_in_higher_education_in_the_east/hkzha7m/",
          "text": "Much appreciated /u/sure_complement, your suggestion is right up my alley, as you say, pretty much perfect for me. I am in fact not interested in the TT route, the prospects in an industry focused route are far broader for someone in my field - which is management science and operations management (which is not reallllly STEM, but some debate this). But I won't count the TT possibility out - Singapore is a promising longer term option - and I am thinking of settling there once my business is up and running.  \n\n\nThanks again for your thoughts.",
          "author": "scromboidfish",
          "created": 1637155932,
          "upvotes": 3,
          "replies": {}
        },
        "hkzh5jj": {
          "link": "/r/AskAcademia/comments/qvvk4z/working_in_higher_education_in_the_east/hkzh5jj/",
          "text": "Postdoc and lecturer salaries in Japan, Korea and Singapore are comparable to those at universities in the US. (And cost of living in those places is not as high as you might think, definitely less than most large American cities).\n\nFor longer-term and permanent positions salaries are quite a bit lower though.",
          "author": "JHT230",
          "created": 1637155864,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkzl8y9": {
      "link": "/r/AskAcademia/comments/qvvk4z/working_in_higher_education_in_the_east/hkzl8y9/",
      "text": "I have worked at both Korean/US institutions, so I'll only speak for Korean situations. Demand is there, for sure, and provided that you have some reasonable credentials, like some decent papers and PhD from a reputable institution, it is very possible to land a job. There was a Taiwanese colleague in my school who cannot speak Korean (but her husband is Korean so she may have gotten some help). You may be able to find those positions that are exclusive for foreign nationals, that are created mostly to boost their \"diversity score\" in their college evaluations. Yet they're looking for those who are ethnically/culturally Korean with foreign nationality. If you go to Seoul National University faculty listings, there are some very Korean looking yet with western names -- they're those people. \n\nHaving own business can be a bit tricky, there are lots of regulations on that. College professors are one of those jobs that are very highly regulated because college education is regarded as a social status. I have seen some engineering faculties who ran their own business, so I assume it is possible, yet previously many of them got in trouble as they mixed up their academic and personal business roles.",
      "author": "log-normally",
      "created": 1637157892,
      "upvotes": 2,
      "replies": {}
    },
    "hkz79dz": {
      "link": "/r/AskAcademia/comments/qvvk4z/working_in_higher_education_in_the_east/hkz79dz/",
      "text": "It's not ideal. Two stories: One friend works in South Korea and is relegated to teaching   minor subjects at a regional campus. So he is very unhappy as there is no career progression. You will always be looked upon as less than a native professor so be prepared for that. Second story: China is best avoided, it's quite difficult to get in there nowadays (you need lots of teaching experience to be even considered). But you have to deal with rich kids who you cannot fail. So you have to be lenient in that perspective unless you want to lose your job.  \nIf you can live off your business, do that, rather than putting yourself in a job that has more downsides than upsides.",
      "author": "frugalacademic",
      "created": 1637149958,
      "upvotes": 2,
      "replies": {
        "hkzj6uq": {
          "link": "/r/AskAcademia/comments/qvvk4z/working_in_higher_education_in_the_east/hkzj6uq/",
          "text": "Thanks for the comment /u/frugalacademic, the idea of teaching in a small regional campus sounds ok for my needs. The Chinese situation on the other hand, does not sound like it is going to be a good avenue for what I want to do - I recently had a chat with a Chinese colleague, and she mentioned a number of drawbacks, including the rich kids you cannot fail, as you say.",
          "author": "scromboidfish",
          "created": 1637156897,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}