{
  "sid": "de5xj6",
  "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/",
  "title:": "Do you REALLY want to hear from former students? Especially an emotional letter?",
  "text": "Last semester, I had a professor who helped me a lot, both academically and with tough situations in my personal life. (I never told him specifically about anything going on in my life, but he provided general encouragement and support during tough times.) I also learned a LOT in his class and really developed a good work ethic and interest in the subject, thanks to him. \n\nI wanted to write him a letter this semester and let him know how much his support meant to me. I've written a draft of the letter, but it's an emotional one. I was in some dark times last semester and he had said some things that really helped me get out, and I wanted to include that in the letter. But would you cringe if a former student wrote you a heartfelt letter? \n\nShould I just make it a more general \"Thanks for helping me and encouraging me during the semester; it helped me a lot\" type of letter, or is it okay to provide more background info and explain just how bad my situation was and how much he truly helped me? \n\nA little more context: we've also talked over the summer when we've seen each other in public (we live in the same city) and talk this semester too if we pass each other at school. I know this doesn't automatically make me a better student or anything like that, but I feel like we know each other more than the average student and professor. (BUT I don't mean that in a gross creepy way whatsoever! We just talk about college, family, etc.)\n\nWhat are your thoughts? When you say \"keep in touch,\" do you actually mean it and would you want to hear from a student? Would you want to hear specifically how much they benefited from you and your class, or is that too cringy?",
  "author": null,
  "created": 1570381200,
  "updated": 1634081271,
  "over_18": false,
  "upvotes": 143,
  "upvote_ratio": 0.99,
  "comments": {
    "f2se898": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2se898/",
      "text": "I would be touched. It would be something to treasure. If you feel comfortable, by all means send it.",
      "author": "grayhairedqueenbitch",
      "created": 1570381894,
      "upvotes": 175,
      "replies": {
        "f2tyjya": {
          "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2tyjya/",
          "text": "This. :)",
          "author": "Tall_Fox",
          "created": 1570402861,
          "upvotes": 6,
          "replies": {
            "f2vlko1": {
              "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2vlko1/",
              "text": "Agreed!",
              "author": "tsutomu88",
              "created": 1570454276,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f2vyo7h": {
          "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2vyo7h/",
          "text": "Thank you so much for your input!! I truly appreciate everyone's comments. I would hate to potentially make him feel awkward by sharing too much, so I shortened the letter and made the dark parts more vague, while still showing my appreciation toward him and his class.",
          "author": null,
          "created": 1570459094,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f2skklq": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2skklq/",
      "text": "I think you should write it so you feel comfortable. If you think it’s cringey, it could be because it is too personal to you. I find that when I’ve sent things off like this, I sometimes regret it (even if the reception was good) because I feel like I’ve shared too much. (We may not react the same though.)\n\nYou can still be personal and heartfelt without being cringey. I think it’s best to try and draft it in your speaking voice and to not rewrite it many times. A message of thanks to show that someone made an impact to you is always worth it. Often they appreciate it more than you know. However if you have to dial it back a bit and do a more general thanks, that is already a lot and works just as well.\n\nI’m sure it’ll be fine though :-)",
      "author": "dcombobulated",
      "created": 1570384113,
      "upvotes": 64,
      "replies": {
        "f2tdltf": {
          "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2tdltf/",
          "text": " I second this! Plus: OP should consider what kind of person the  professor is. Does he seem like someone who can handle very personal  stuff well? But even then: being included in private circumstances can make the other one feel some kind of responsible or worried or it can feel as too intimate, so I, too, would keep it in a more general way.",
          "author": "fogellegof",
          "created": 1570393607,
          "upvotes": 6,
          "replies": {
            "f2vzinu": {
              "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2vzinu/",
              "text": ">being included in private circumstances can make the other one feel some kind of responsible or worried or it can feel as too intimate, so I, too, would keep it in a more general way.\n\nThank you, this is a really good point! I don't want him to feel responsible or have to worry about me in any way. I've shortened the letter and made it more general while still expressing my thanks and appreciation.",
              "author": null,
              "created": 1570459393,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f2soeao": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2soeao/",
      "text": "A few of my professors had stuff like that framed around in their offices.",
      "author": "engelthefallen",
      "created": 1570385473,
      "upvotes": 28,
      "replies": {}
    },
    "f2sm6ic": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2sm6ic/",
      "text": "I’d be pretty ecstatic if I knew I influenced someone’s life for the better. I don’t say keep in touch to all of my students, and to see a glimpse of the impact of my life that’s positive can really outweigh the crappy parts of teaching. I don’t know if it’s different because I teach high music and I’m more emotional lol.",
      "author": "jape2116",
      "created": 1570384761,
      "upvotes": 20,
      "replies": {}
    },
    "f2sq8wn": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2sq8wn/",
      "text": "As a grad instructor I am more likely to hear negative feedback from students like complaints and now it can start to get me down. Hearing a student say nice things would brighten my day.",
      "author": "NTGuardian",
      "created": 1570385940,
      "upvotes": 15,
      "replies": {}
    },
    "f2sshpi": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2sshpi/",
      "text": "Absolutely.  I wouldn't say \"keep in touch\" if I didn't mean it. I love hearing from former students, if it's one semester later or 20 years later.  When they are writing to say something I taught or did was beneficial to them, all the better.\n\nStudents with whom I developed personal or mentoring relationships are particularly wonderful to hear from.",
      "author": "SnowblindAlbino",
      "created": 1570386635,
      "upvotes": 14,
      "replies": {
        "f2uupt6": {
          "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2uupt6/",
          "text": "\\>I wouldn't say \"keep in touch\" if I didn't mean it. I love hearing from former students\n\n100% this",
          "author": "Solivaga",
          "created": 1570430044,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f2sekm7": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2sekm7/",
      "text": "I would always be happy to hear from a former student in this kind of situation. An especially personal or emotional message would be too much for me, but some professors are more emotionally available and might be fine with it. However, specific ways that the class or the professor’s mentoring helped you are definitely valuable and even better than a general thanks.",
      "author": "SnittingNexttoBorpo",
      "created": 1570382019,
      "upvotes": 15,
      "replies": {}
    },
    "f2sv5fs": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2sv5fs/",
      "text": "> Should I just make it a more general \"Thanks for helping me and encouraging me during the semester; it helped me a lot\" type of letter, or is it okay to provide more background info and explain just how bad my situation was and how much he truly helped me? \n\nI would focus more on explaining what they did to help you than to focus on how bad your situation once was. Unless it's something you feel like you need to air out or get off your chest, your professor would likely benefit more so knowing what they did right with you so they can better attend to other students' needs in the future. I would often end semesters feeling like I built a good rapport with certain students, but I wasn't always able to figure out why or how to replicate that.\n\nI'd also recommend keeping it short and sweet. Make it something small enough that they can pin on a fridge or a corkboard. That's what I do with all of my thank you notes.\n\nHonestly, the best note I ever received didn't have any words on it. It was a hand-drawn illustration the size of a business card. I keep it at my desk at work to remind myself of why all of this matters.",
      "author": "Im_A_Quiet_Kid_AMA",
      "created": 1570387340,
      "upvotes": 15,
      "replies": {}
    },
    "f2t34gt": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2t34gt/",
      "text": "Go for it. You'll make their day. Possibly their year.",
      "author": "oustane",
      "created": 1570390327,
      "upvotes": 7,
      "replies": {}
    },
    "f2sep8q": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2sep8q/",
      "text": "I would say that a paragraph or two is fine. Saying \"your encouragement to ____ helped me ____ during a difficult semester\" is fine. \n\nNo need for extremely personal detail.",
      "author": "45eurytot7",
      "created": 1570382077,
      "upvotes": 22,
      "replies": {}
    },
    "f2smlcm": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2smlcm/",
      "text": "Write it in a way that keeps your personal details and dark struggles vague but the gratitude and value of his help very specific. \n\nGlad to hear you're doing better!",
      "author": "railroadpants",
      "created": 1570384923,
      "upvotes": 15,
      "replies": {}
    },
    "f2st6a5": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2st6a5/",
      "text": "I would personally say that sort of thing in person",
      "author": "sdbabygirl97",
      "created": 1570386788,
      "upvotes": 5,
      "replies": {}
    },
    "f2t2wgz": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2t2wgz/",
      "text": "I agree with everyone else, professors love hearing that their work is actually helping other people. They're also, like, humans though---some people love talking to others about the details of their depression and life struggles, whereas others get uncomfortable. I think that writing something like \"I was going through a really tough time but when you said \\_\\_\\_\\_ it really helped me out\" is always a safe bet.",
      "author": "MrHilbertsPlayhouse",
      "created": 1570390250,
      "upvotes": 6,
      "replies": {}
    },
    "f2tp2ga": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2tp2ga/",
      "text": "You have no idea how many days professors think, \"why am I even doing this? Is this really helping anyone?\" \n\nI love hearing from former students, especially those with whom I have some sort of connection.",
      "author": "iugameprof",
      "created": 1570398398,
      "upvotes": 6,
      "replies": {}
    },
    "f2tp9n6": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2tp9n6/",
      "text": "**YES. Not even a question.** \n\nYou will never reach out to a professor with kind words about their impact on you and they be anything other than touched or moved (I guess unless they are just the curmudgeoniest assholes out there). Even if you thought a professor may not even remember you, but they had a massive impact on you, they will still enjoy it.",
      "author": "fidler",
      "created": 1570398467,
      "upvotes": 5,
      "replies": {}
    },
    "f2tr6al": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2tr6al/",
      "text": "I save these cards/letters in an envelope in my office. I save the emails in a specific folder. I look at them when I'm feeling really jaded and crappy about academia to remind myself why I do this. \n\nSend it.",
      "author": "whyisthatyourhair",
      "created": 1570399196,
      "upvotes": 4,
      "replies": {}
    },
    "f2sg15o": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2sg15o/",
      "text": "Hello there, sorry you've had such a bad experience this last semester, I hope things is/will be getting better.\n\nIt is really considerate of you to want to reach out to your professor with a letter, I think they will really appreciate hearing from you, not to hear you say thanks but more just to know how you're getting on.\n\nI personally would not give too much background details, there is no need to explain yourself, one adult to another. However, perhaps you might want to look into getting some support from the college/university, eg talking therapy, and go from there. You deserve to be heard.",
      "author": "Yessbutno",
      "created": 1570382593,
      "upvotes": 9,
      "replies": {}
    },
    "f2tbu6b": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2tbu6b/",
      "text": "I certainly think your professor would like to receive a letter thanking him for his effort to teach and support you.  Everyone likes to receive acknowledgement that their efforts are having the intended effect.  Speaking only for myself, though, I would say that a letter in which you relate your personal affairs and challenges in substantial detail would be awkward for me to receive.  If you want to mention that his support and encouragement helped you make it through some challenging personal times, that would certainly be fine, but I personally don't think you should go into anything more than superficial detail as to what the issues actually were.\n\nIn the end, though, nobody can make this decision except for you.  You know the professor and you know the type of relationship you have with him.  If you want to relate a large degree of personal information to him and think he would be ok with it because of the type of relationship you have, then by all means do so.\n\nGood luck.",
      "author": "ChemMJW",
      "created": 1570393013,
      "upvotes": 3,
      "replies": {}
    },
    "f2so483": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2so483/",
      "text": "Short and professional, yes\n\nLong and cringy and personal, no no no no",
      "author": "gafada",
      "created": 1570385379,
      "upvotes": 6,
      "replies": {
        "f2w0af3": {
          "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2w0af3/",
          "text": "Thank you so much for giving your thoughts! I've shortened the letter, left the dark parts much more vague and less personal, but still expressed my appreciation and gratitude for his help and his class.",
          "author": null,
          "created": 1570459657,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f2sqp1r": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2sqp1r/",
      "text": "Depends on the student to be honest.",
      "author": "baummer",
      "created": 1570386083,
      "upvotes": 2,
      "replies": {}
    },
    "f2tdnxp": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2tdnxp/",
      "text": "Yes, it is always welcome and touching and also the kind of thing professors can put in their tenure review case as arguments for their being deserving of tenure.",
      "author": "kinderdemon",
      "created": 1570393636,
      "upvotes": 2,
      "replies": {}
    },
    "f2v4rrs": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2v4rrs/",
      "text": "It will be very nice. Just do it :-)",
      "author": "flelli",
      "created": 1570445770,
      "upvotes": 2,
      "replies": {}
    },
    "f2tio20": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2tio20/",
      "text": "\"Thanks, you helped me\" is great.\n\nGoing into great detail does seem self indulgent.  If you still need help perhaps see a therapist or see if there are school counselors to talk to.",
      "author": "NiceSasquatch",
      "created": 1570395879,
      "upvotes": 1,
      "replies": {
        "f2w13of": {
          "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2w13of/",
          "text": ">Going into great detail does seem self indulgent\n\nThis. That is something I didn't think of and I completely agree. I've changed up the letter and left out the details. Thank you so much!!\n\nI spent the whole summer in therapy when I was at home, but unfortunately the therapists at my university aren't that great (not to mention the weeks of waiting just to even get an appointment). But I'm seeing my therapist on an as-needed basis on some weekends when I'm home. Things are going much better now. Thanks again!",
          "author": null,
          "created": 1570459956,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f2u41sa": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2u41sa/",
      "text": "I wholeheartedly encourage you to do this! Towards the end of my time as a student in undergrad I started telling me current and past professors when I thought their class was good. I did it partly because I felt that professors receive predominantly negative feedback and thought they would appreciate positive feedback, and partly to thank the teachers who helped me emotionally in ways similar to how it sounds like this professor helped you. I received universally positive feedback and even saved some of the replies to my emails as they were so kind. Whatever you include in your message, I’m sure your professor will end up treasuring it for years to come.",
      "author": "ocean_ginger",
      "created": 1570406771,
      "upvotes": 1,
      "replies": {}
    },
    "f2u4sjj": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2u4sjj/",
      "text": "I agree with other comments: write the letter in a way you feel comfortable sharing what he and his class meant to you. It's nice to hear that you had and impact on former students' lives; it keeps you going through the uncertainty of academic life.",
      "author": "Kissyfurs",
      "created": 1570407340,
      "upvotes": 1,
      "replies": {}
    },
    "f2u5xbk": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2u5xbk/",
      "text": "For any decent teachers, this is exactly the motivation for being a teacher.",
      "author": "Lintheru",
      "created": 1570408187,
      "upvotes": 1,
      "replies": {}
    },
    "f2umh24": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2umh24/",
      "text": "Sometimes these kinds of things can make an entire week for an academic.",
      "author": "Wolfgang713",
      "created": 1570420710,
      "upvotes": 1,
      "replies": {}
    },
    "f2uuks5": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2uuks5/",
      "text": "This would mean so much to me. I occasionally get an email requesting a letter, or run into one downtown and we strike up a short conversation. The other day a former student told me that the students I have this semester are lucky to have me and it made my weekend. A letter like this is something I would keep and cherish forever.",
      "author": "SaintRidley",
      "created": 1570429856,
      "upvotes": 1,
      "replies": {}
    },
    "f2u3rs0": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2u3rs0/",
      "text": "I enjoy hearing from a couple of students I've made an impact.  Of course, I sometimes get that email and think-- who are you exactly?\n\nSend the email only if you've made an actual connection with the person.\n\nA bunch of these type of emails?  Irritating.  Just one more email to respond to.",
      "author": "trevor4551",
      "created": 1570406567,
      "upvotes": 0,
      "replies": {}
    },
    "f2togxi": {
      "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2togxi/",
      "text": "[deleted]",
      "author": null,
      "created": 1570398116,
      "upvotes": -4,
      "replies": {
        "f2uus40": {
          "link": "/r/AskAcademia/comments/de5xj6/do_you_really_want_to_hear_from_former_students/f2uus40/",
          "text": "Speaking from a professor's perspective, I love hearing from former students.  And not just the prodigies - all of the students who I actually engaged with and knew.",
          "author": "Solivaga",
          "created": 1570430130,
          "upvotes": 10,
          "replies": {}
        }
      }
    }
  }
}