{
  "sid": "prws06",
  "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/",
  "title:": "Study abroad after 30!",
  "text": "I want to study psychology in a UK/USA University. I'm 29 years old, approaching 30 in months. Is it too late? I want to pursue this course because it has been my dream for long. I've a bachelor degree in Computer Science (don't ask why I chose that subject!)",
  "author": "Ok_Grapefruit9401",
  "created": 1632150453,
  "updated": 1634078904,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.88,
  "comments": {
    "hdlnqz2": {
      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlnqz2/",
      "text": "FYI, \"studying abroad\" is a very specific term in the US that means a student who is going to university in their home country does a short (typically 1 semester) stint at a university in another country to increase their exposure to another culture, language, school of thought, etc.\n\nWhat you are asking about is being an \"international student\" at a US/UK university. Most US universities that offer graduate programs accept international students, but is frighteningly expensive ($50-90k/yr after living expenses) unless you have research experience in your field of study already and can secure a research assistantship position where your tuition, health insurance, and a stipend are paid for in exchange for working 20-40 hrs/week for a research group. Age is largely irrelevant and loads of graduate students in the US are in their 30s.",
      "author": "MidnightSlinks",
      "created": 1632151933,
      "upvotes": 15,
      "replies": {
        "hdlo9uy": {
          "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlo9uy/",
          "text": "Won't I be able for those foundation programs? I want to start from scratch since I've no prior knowledge in this subject. If I get a chance in any online program for now that would be great even.",
          "author": "Ok_Grapefruit9401",
          "created": 1632152152,
          "upvotes": 2,
          "replies": {
            "hdlp7yz": {
              "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlp7yz/",
              "text": ">Won't I be able for those foundation programs?\n\nI think you're missing some words in this sentence so I'm not entirely sure what you're asking, but I think the answer is no. International students are typically not eligible for financial aid in the US, whether it's federally-backed loans, loans from a US bank, university-based scholarships, or private foundation scholarships.\n\nUS institutions are only incentivized to go through all the paperwork required to bring in an international student in order to 1) get rich internationals who pay full price to subsidize costs for domestic students or 2) get highly accomplished internationals to pursue scholarship/employment in the US to bolster our intellectual capital.",
              "author": "MidnightSlinks",
              "created": 1632152547,
              "upvotes": 6,
              "replies": {
                "hdlsf55": {
                  "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlsf55/",
                  "text": "This response isn't fully correct.\n\n> International students are typically not eligible for financial aid in the US, whether it's federally-backed loans, loans from a US bank, university-based scholarships, or private foundation scholarships.\n\nInternational students are not eligible for Federal financial aid (public money). So, no Pell Grants, Grad PLUS loans, much of the aid and scholarships at land grant universities and the like. There are some Federal funds for international scholars (e.g. the Fulbright program), but they are rare. When it comes to scholarships from private universities, foundations or other institutions - legally, these organizations can use their money on whatever they like, and many do support international students, or don't gate money based on citizenship status.\n\n> loans from a US bank\n\nInternational students are eligible for student loans as long as they have a US citizen or resident cosigner.\n\n> rich internationals who pay full price to subsidize costs for domestic students\n\nYes but no. The budget economics of US institutions is actually more complex than that. Of course rich international students are ideal, but most institutions admit students based on some formula of ability to pay and merit. Just as it's possible for a domestic student to be admitted to University X with an x% reduction in tuition (which can be billed as merit or financial aid, but from a budgetary perspective, is largely the same thing) in order to \"salt the mine\", it is possible to do so as an international student. You just have to be, say, a standard deviation better applicant than the equivalent domestic one.\n\nFinally, just as an addendum, it's really damaging when people post incorrect information about this online, because everything to do with international student-ing in the US is super murky and there's already a shit ton of bad info out there. So like, if you don't know, don't say anything.",
                  "author": "thegreenaquarium",
                  "created": 1632153860,
                  "upvotes": 10,
                  "replies": {}
                },
                "hdlq173": {
                  "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlq173/",
                  "text": "You mean there's no hope for International students unless they're rich or highly meritorious? What about UK schools?",
                  "author": "Ok_Grapefruit9401",
                  "created": 1632152881,
                  "upvotes": 1,
                  "replies": {
                    "hdlqu7d": {
                      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlqu7d/",
                      "text": ">You mean there's no hope for International students unless they're rich or highly meritorious?\n\nEvery international student I have ever encountered during my \\~10 years as a student at US universities has been one or both of these things OR they have been from a country that will pay for their students to attend US universities, but that is likely limited to meritorious students as well or at least those from fantastically wealthy countries (e.g., Saudi students).\n\n>What about UK schools?\n\nI know close to nothing about UK schools, so I can't help you there.",
                      "author": "MidnightSlinks",
                      "created": 1632153209,
                      "upvotes": 1,
                      "replies": {
                        "hdmn8k7": {
                          "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdmn8k7/",
                          "text": "I don't think this holds for grad school on computer science. In physics, math, cs and the like grad students very commonly hold teaching assistantships from day 1. That means no tuition fees and a modest salary.",
                          "author": "fuckwatergivemewine",
                          "created": 1632166437,
                          "upvotes": 1,
                          "replies": {
                            "hdmslwl": {
                              "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdmslwl/",
                              "text": "OP is not looking to study in any of those fields and OP has since clarified that they are looking at doing a bachelor's degree, not grad school.",
                              "author": "MidnightSlinks",
                              "created": 1632168639,
                              "upvotes": 6,
                              "replies": {
                                "hdmss97": {
                                  "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdmss97/",
                                  "text": "Ah sorry, I missed that! Yeah then I agree that quitting a job and paying US-levels of tuition fees is the worst idea ever.",
                                  "author": "fuckwatergivemewine",
                                  "created": 1632168711,
                                  "upvotes": 5,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hdp2lwo": {
                      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdp2lwo/",
                      "text": "UK schools charge higher rates for international students. For some Oxbridge degrees it can be upwards of $30,000 /yr if you're not ordinarily resident in the UK resident prior to applying. That's cheaper than America, but not cheap. Unlike in America, where merit aid is occasionally available and there's some flexibility on tuition prices, for international students in the UK the price you see is the price you pay for a Master's degree or second BA. There is very little funding support that isn't restricted to residents.",
                      "author": "Radiant-Tax",
                      "created": 1632213094,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hdlo6sm": {
      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlo6sm/",
      "text": "Cost and visas will be a far bigger barrier than your age, which will probably be no issue at all by itself",
      "author": "IntLawprof",
      "created": 1632152115,
      "upvotes": 8,
      "replies": {
        "hdlojyg": {
          "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlojyg/",
          "text": "I know that. It's a big risk as I'll have to let go my current job. But still if there's any way or positive solution...",
          "author": "Ok_Grapefruit9401",
          "created": 1632152267,
          "upvotes": 1,
          "replies": {}
        },
        "hdmm0iq": {
          "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdmm0iq/",
          "text": "Second this. your age does not matter at all. .. and in that subject, there are some not-that-super-young students. it's actually good .. honestly i cannot imagine a psychologist in his/her twenties .. or thirties .. or even forties. besides doing street work, maybe. - that said, costs might be rather high (probably mostly for accommodation and transportation). - as for prep course, the fact that you had studied should suffice; given that the EN level sufficed to write an academic homework (probably not an entire article, rather for the final). Actually, that's a big plus, that someone had worked academically, already.\n\n.. well age is not an issue, probably to be taken in also not, and probably the costs you are able to get in .. say: if it's mentally ok for someone to have rather little to live on (whatever that defined! .. personally i am glad eating say cereal and maybe cooked potatoes every day ..) .. that's the thing that people sometimes stop to do a \"beginner\" studies.",
          "author": "sunnyseasun",
          "created": 1632165939,
          "upvotes": -2,
          "replies": {}
        }
      }
    },
    "hdlshkc": {
      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlshkc/",
      "text": "In the UK foundation programmes are sometimes called access courses - they are for mature students who don’t have traditional a levels but who have life/work experience. As you already have a degree you don’t need to waste a year doing that. An undergrad degree in psychology is where you should start. You should be aware that in itself is not enough to become a clinical psychologist - you need a PHD and clinical practice experience too and it is a very competitive area.",
      "author": "GalwayGirlOnTheRun23",
      "created": 1632153889,
      "upvotes": 5,
      "replies": {}
    },
    "hdlt20w": {
      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlt20w/",
      "text": "Depending on what country you are coming from you will probably need to pay full fees as an international student. Example international fees for [Manchester UK](https://www.manchester.ac.uk/study/undergraduate/courses/2021/00653/bsc-psychology/) are 23,000 pounds Sterling per year.",
      "author": "GalwayGirlOnTheRun23",
      "created": 1632154126,
      "upvotes": 4,
      "replies": {
        "hdltz2j": {
          "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdltz2j/",
          "text": "I see. That's a lot to pay if one needs to pay in full. Thanks for all these information though",
          "author": "Ok_Grapefruit9401",
          "created": 1632154495,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdmfwhv": {
      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdmfwhv/",
      "text": "Your age doesn't matter.\n\nIn the US you can study a lot of subjects even if you don't have an undergrad degree in them. idk if psychology is one of them. That said, education in the US is pretty expensive, not only tuition-wise but because as an international student you have to buy a lot of extras like expensive health insurance, probably overpay for housing if you have no credit history or cosigner, international flights, visa fees etc., and you can't work for more than 20 hours or off-campus without special permissions. It's definitely possible to get a scholarship to cover some or all of that (and you don't need to be a genius!), but if you're transitioning into a completely new field, it's harder. Also, if you want to be a practicing psychologist, keep in mind that you would need licensure in most jurisdictions, and in that case you should check whether a US psychology degree/the specific degree you'd be pursuing would be accepted by your country's licensing body. Otherwise, verifying that degree will cost you lots of money and likely lots of time.\n\nI don't know much about psychology so I can't help with more than the general stuff, but I see you're getting some questionable info here so.",
      "author": "thegreenaquarium",
      "created": 1632163436,
      "upvotes": 4,
      "replies": {}
    },
    "hdloysx": {
      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdloysx/",
      "text": "Of course it is not too late! I went back for a graduate degree in a different field in my mid-30s. What area of psychology are you looking to study? Are you going to apply to graduate programs?",
      "author": "baileybird",
      "created": 1632152440,
      "upvotes": 2,
      "replies": {
        "hdlpg7i": {
          "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlpg7i/",
          "text": "Hey, finally some positive response. I want to apply for foundation program first since I've no prior knowledge/degree in psychology.",
          "author": "Ok_Grapefruit9401",
          "created": 1632152641,
          "upvotes": 0,
          "replies": {
            "hdlr3oo": {
              "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlr3oo/",
              "text": ">I want to apply for foundation program\n\nCan you describe what you're taking about? The only definition of \"Foundation program\" I know (a program run by a charitable foundation) makes no sense in the context of your sentence.",
              "author": "MidnightSlinks",
              "created": 1632153318,
              "upvotes": 3,
              "replies": {
                "hdlrt1q": {
                  "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlrt1q/",
                  "text": "I mean foundation courses that are designed to prepare students for an undergrad degree in university. Those are meant for international students.",
                  "author": "Ok_Grapefruit9401",
                  "created": 1632153607,
                  "upvotes": 1,
                  "replies": {
                    "hdlsq7a": {
                      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdlsq7a/",
                      "text": "This is not something that exists in the US. International students are expected to have the language proficiency and foundational knowledge before applying to US programs.",
                      "author": "MidnightSlinks",
                      "created": 1632153989,
                      "upvotes": 10,
                      "replies": {}
                    },
                    "hdm6jvn": {
                      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdm6jvn/",
                      "text": "I'm not familiar with these types of courses. We have an intensive English language/cultural course for international students, but that is it.   For an undergrad in psychology, you would just need general acceptance to the university.",
                      "author": "baileybird",
                      "created": 1632159590,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "hdmidlo": {
                      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdmidlo/",
                      "text": "I really don't think you need to do a foundation course as you already have a degree. You should be good to apply straight to a bachelor's.",
                      "author": "ACatGod",
                      "created": 1632164444,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "hdn9j7r": {
                      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdn9j7r/",
                      "text": "Since you already have an undergraduate degree, a psychology conversion course may also be appropriate. Several UK universities do them - they’re postgrad degrees for people with no psychology experience.",
                      "author": "mainemoosemanda",
                      "created": 1632175863,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hdmvi5l": {
      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdmvi5l/",
      "text": "Do it! It's not too late...BUT you should be ready to interact with a lot of people that are probably way younger than you (e.g. 18 yo) and have a different mindset (more enthusiastic,less experienced etc.)\nEdit:If it's an online course you don't even have to worry about what I mentioned...so just do it",
      "author": "L1nL1ng",
      "created": 1632169828,
      "upvotes": 1,
      "replies": {}
    },
    "hdn9zox": {
      "link": "/r/AskAcademia/comments/prws06/study_abroad_after_30/hdn9zox/",
      "text": "How about some psychology courses where you are right now to get familiar with the concepts. Also, remember to take an oat of poverty if you pursue a degree in psychology.",
      "author": "magic8ball24",
      "created": 1632176071,
      "upvotes": 1,
      "replies": {}
    }
  }
}