{
  "sid": "hdnbiv",
  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/",
  "title:": "Why is academia such a hated field?",
  "text": "I've never seen another field (except law, perhaps) where the people involved despise their own field of work so much. This sub is itself filled with tons of discouraging posts. \"It pays peanuts\", \"work hours are inhuman\", etc. Even profs themselves are like \"Yeah, I'm really lucky to have this job, but...\"\n\nGenuinely sorry if I sound rude. Didn't mean to though. It's just that for a student of science who dreams of becoming a prof someday, the negativity gets tiring sometimes. I understand no job is all rosy, but if academia is really as bad as people make it out to be, why is it so saturated? \n\nI have doctors and vets in my family. They seem really, really proud of their professions despite all the hardships that come with them. Why don't people in academia feel the same way? Even the general public don't seem to look up to us the way they do to a doctor or a lawyer. They think we are just wasting taxpayers' money. It isn't that we work any less hard or are less \"intelligent\" than those in medicine or the military.\nThen why isn't our work appreciated? Aren't we the people who are supposed to be charting the course of humanity's future and making this world a better place?",
  "author": "alChemist_07",
  "created": 1592809390,
  "updated": 1634080379,
  "over_18": false,
  "upvotes": 277,
  "upvote_ratio": 0.92,
  "comments": {
    "fvmddt5": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmddt5/",
      "text": "> I've never seen another field (except law, perhaps) where the people involved despise their own field of work so much.\n\nLet me introduce you to r/accounting",
      "author": "Samthemani",
      "created": 1592816962,
      "upvotes": 291,
      "replies": {
        "fvmhut7": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmhut7/",
          "text": "As an accountant currently in industry, hoping to eventually return to academia, I was about to say the same thing",
          "author": "maryplethora",
          "created": 1592821597,
          "upvotes": 69,
          "replies": {
            "fvmzfdx": {
              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmzfdx/",
              "text": "What does accounting academia even look like?",
              "author": "import_FixEverything",
              "created": 1592834854,
              "upvotes": 31,
              "replies": {
                "fvn0fiz": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn0fiz/",
                  "text": "Much like other academia? You teach accounting classes and do research on accounting or accounting education. I'm not sure how or why it would be any different.",
                  "author": "maryplethora",
                  "created": 1592835439,
                  "upvotes": 44,
                  "replies": {
                    "fvn2xb0": {
                      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn2xb0/",
                      "text": ">  I'm not sure how or why it would be any different.\n\nI guess they just asked because accounting (the industry profession) itself is already seen as one of the more boring / tedious 'higher up' jobs. Therefore, the field of it and research into it must be equally - if not more - boring. But I'm just guessing here.",
                      "author": "CompletelyClassless",
                      "created": 1592836841,
                      "upvotes": 44,
                      "replies": {
                        "fvn676p": {
                          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn676p/",
                          "text": "I can confirm that to the vast majority of people, even accountants, accounting research is probably up there with the most boring this you can imagine. It's one of the many reasons why I don't understand why so many people do accounting degrees here (UK), when you can quite easily become an accountant without ever having to interact with the academic side of it.",
                          "author": "maryplethora",
                          "created": 1592838588,
                          "upvotes": 22,
                          "replies": {}
                        }
                      }
                    },
                    "fvn46on": {
                      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn46on/",
                      "text": "As an also non-accountant, what kind of accounting research is being done? I don't mean to offend, but from the outside I really just thought that field was sort of solved.",
                      "author": "trevorefg",
                      "created": 1592837516,
                      "upvotes": 27,
                      "replies": {
                        "fvn542a": {
                          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn542a/",
                          "text": "No worries about offense at all! There is actually a lot of different research being done, especially in the sort of grey area between internal / cost accounting and more business management areas. However, for financial accounting (i.e. what most people think of when they think of accounting), a lot of research is concerned with the ever updating accounting standards. So IFRS is pretty world wide at this point, but you've also got UK GAAP, US GAAP, Australian GAAP etc. Quite a bit of research is done each time a new standard is published (usually along the lines of \"how does this affect companies in this industry - a case study\"), and harmonisation between IFRS and local GAAP is also a popular research area. Then if you go more conceptual (hello, this is my home), you've also got research being done into the conceptual framework and underlying philosophies of various accounting standard systems and what objectives they are actually working towards Vs what they are achieving. \n\nA lot of non-accountants (very understandably) assume that accounting is pretty black and white and (as you said) 'already solved', but accountants are slimier than so and know that unless they made the occupation significantly judgement based they would very quickly be replaced by software.",
                          "author": "maryplethora",
                          "created": 1592838008,
                          "upvotes": 30,
                          "replies": {
                            "fyigs6t": {
                              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fyigs6t/",
                              "text": ">Australian GAAP\n\nDon't want to nitpick, but Australia uses AASB which aligns with IFRS.",
                              "author": "PKMN_CatchEmAll",
                              "created": 1595117799,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "fvn6kfo": {
                          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn6kfo/",
                          "text": "It's not about how to follow accounting rules (which as you say is fairly straightforward) but more about how to design them and what effects these rule changes have on firm behavior",
                          "author": "s1ant",
                          "created": 1592838784,
                          "upvotes": 11,
                          "replies": {}
                        }
                      }
                    },
                    "fvo3ab7": {
                      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvo3ab7/",
                      "text": "It pays a lot better than most academic fields from what I've always heard.",
                      "author": "deong",
                      "created": 1592855088,
                      "upvotes": 6,
                      "replies": {
                        "fvoe3hh": {
                          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvoe3hh/",
                          "text": "Median salary for an assistant professor of accounting is $143,000. For a full-time instructor of accounting, it's $80,700.\n\n[AACSB Report (page 12)](https://www.google.com/url?sa=t&source=web&rct=j&url=https://www.aacsb.edu/-/media/aacsb/publications/data-reports/global-salary-survey/201819%2520staff%2520compensation%2520%2520demographics%2520survey%2520executive%2520summary.ashx%3Fla%3Den%26hash%3DA7B4598C50D58AFE0D96873396A93E14AE06BEE3&ved=2ahUKEwi-7djyqZbqAhUNLK0KHZHjCLs4ChAWMAJ6BAgIEAE&usg=AOvVaw2yGf0YW7c6hk5iyXI3skpP)",
                          "author": "the_banished",
                          "created": 1592860504,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    },
                    "fvn9j6b": {
                      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn9j6b/",
                      "text": "Tbh I’ve never been sure what accountants actually do, so I have zero idea what you’d be researching. I just imagine you guys adding things up on hand crank calculators. I’m sure that’s totally accurate, right?",
                      "author": "sexy_bellsprout",
                      "created": 1592840330,
                      "upvotes": 4,
                      "replies": {
                        "fvnaghx": {
                          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnaghx/",
                          "text": "Tbf I do actually do a lot more adding up on calculators than you would expect anyone to do in 2020. After we produce the accounts for our clients, we add them up manually on the calculator to make sure there are no excel problems...",
                          "author": "maryplethora",
                          "created": 1592840804,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fvnvh2a": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnvh2a/",
          "text": "And r/journalism perhaps?",
          "author": "expectopatronums",
          "created": 1592851252,
          "upvotes": 3,
          "replies": {}
        },
        "fvouc5j": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvouc5j/",
          "text": "🙂",
          "author": "Hot-Pretzel",
          "created": 1592869196,
          "upvotes": 1,
          "replies": {}
        },
        "fvtq1v3": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvtq1v3/",
          "text": "Or /r/consulting.",
          "author": "doornroosje",
          "created": 1592978001,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fvm6hgv": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvm6hgv/",
      "text": "First you have to specify what country and culture you are in.\n\nNot all cultures regard academics as tax waste. In my culture (South Korea) professors are well respected and regarded as prestigious jobs. And many in fact like and feel proud of their job.\n\nOf course many complain about how hard it is to actually get that job, and rightfully so because it is extremely difficult. So the main difference between an academic job and industry job is that the supply far outweighs demand in academia, hence more complaints about the difficulties caused by that gap.",
      "author": "bahasasastra",
      "created": 1592810088,
      "upvotes": 230,
      "replies": {
        "fvm798z": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvm798z/",
          "text": "The waste argument is pretty common here in the US. Politicians (and this many citizens) like to foist social issues on universities whenever they need a scapegoat. \n\nAnti-intellectualism is extremely strong here (and sucks), one of the side effects of an aggressively individualistic society.",
          "author": "the_Q_spice",
          "created": 1592810813,
          "upvotes": 216,
          "replies": {
            "fvn7b64": {
              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn7b64/",
              "text": "I remember a few years ago some politician in Texas was complaining about the salaries of biology professors being over 100k at some schools, but didn't account for most of the excess over ~70k coming out of grants that brought money into the school. When accounted for properly they were net profitable for the school.",
              "author": "fleemfleemfleemfleem",
              "created": 1592839179,
              "upvotes": 39,
              "replies": {
                "fvnmeqz": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnmeqz/",
                  "text": "I bet you don’t hear him complaining about how much the HBC at UT-Austin makes, though. HBC= head football coach.",
                  "author": "dewitt72",
                  "created": 1592846801,
                  "upvotes": 23,
                  "replies": {
                    "fvnnjh8": {
                      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnnjh8/",
                      "text": "Where I am now the football coach makes something like 2 million. They've done shady stuff hiding money in the sports boosters account, and hiring people off the books, but I'm pretty sure the football team is a huge money drain at taxpayers expense.",
                      "author": "fleemfleemfleemfleem",
                      "created": 1592847357,
                      "upvotes": 17,
                      "replies": {
                        "fvobs31": {
                          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvobs31/",
                          "text": "I hate school coaches. Sorry, maybe I just had some bad experience. My first quarter in a big state U had touring athlete students who didn't come to class and didn't turn in any work backed by coaches with letters sent to the program director and then the dean. They wanted me to pass the students. Coaches should coach, not be bullies in school.",
                          "author": "grubslut",
                          "created": 1592859321,
                          "upvotes": 9,
                          "replies": {
                            "fvom7eb": {
                              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvom7eb/",
                              "text": "University sports programs are one of the best microcosms of everything that's wrong with the US. You've got anti-intellectualism, labor exploitation, income inequality, racism, misogyny, the list goes on. It's an abomination.",
                              "author": "superexpress_local",
                              "created": 1592864713,
                              "upvotes": 20,
                              "replies": {
                                "fvrwi25": {
                                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvrwi25/",
                                  "text": "Not being a sports fan myself, this question may be well studied, but I'll ask it anyway: How does the typical NCAA Division 1 basketball or football player fare in terms of career path, income, health, further education, etc.? Do student athletes get any benefit from the \"student\" part of their experience?",
                                  "author": "the_banished",
                                  "created": 1592940642,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "fvq3nns": {
                              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvq3nns/",
                              "text": "There’s one that I absolutely love. I grew up in Stoops country (Oklahoma) and his student athletes were always horrible. I liked Spurrier because he’s a funny guy. \n\nI ended up falling in love with PJ Fleck in Minnesota. He’s a disney character in a coach’s role. He had a Christmas tree up year round and pushes culture over football. He knows that most of his players will not go to the NFL, so he pushes education. Doesn’t hurt that he was a 6th grade social studies teacher before becoming an HBC.",
                              "author": "dewitt72",
                              "created": 1592900635,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        },
                        "fvnznsg": {
                          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnznsg/",
                          "text": "They almost only ever are. I think it's something like only the five most historically successful programs with rabid can bases (Notre Dame, Penn State, etc.) actually make money from their football programs and everyone else is just throwing money down the toilet for the prestige of having one. Maybe someone who knows better could throw in the actual stats, but I remember in my angrier, socialist, youth days doing personal research on the matter.",
                          "author": "DonHedger",
                          "created": 1592853312,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fvmunke": {
              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmunke/",
              "text": "Aggressively individualistic and plutocratic. And one that seeks to monetize and capitalize everything. And one that more and more frames higher education as job training.",
              "author": "Prof_Acorn",
              "created": 1592831926,
              "upvotes": 46,
              "replies": {
                "fvo60we": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvo60we/",
                  "text": "deleted",
                  "author": null,
                  "created": 1592856437,
                  "upvotes": -13,
                  "replies": {}
                }
              }
            },
            "fvmrk00": {
              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmrk00/",
              "text": "I’m from NJ, studied in Boston, and I’ve never heard of professors as a tax burden. I was honestly confused when OP mentioned that and now read your comment saying the same thing. Where in the US are you from? I’ve seriously never heard of professors or universities described as waste, certainly not by regular folks.\n\nI concede that academia exists in the theoretical world, and I can understand if someone tried to argue that there’s a disconnect between academia and the real world, but I’ve never heard that it’s a tax burden. If anything, I’ve always heard people say that school teachers (not necessarily professors) should be paid more for what they do, but of course education is always cut first when governments have to balance budgets.",
              "author": "photo-smart",
              "created": 1592829832,
              "upvotes": 34,
              "replies": {
                "fvmu1m2": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmu1m2/",
                  "text": "I hear it frequently in Indiana (where I'm from) and PA, where I currently live. Lots of anti-intellectualism, accusations of academia corrupting the youth, wasting money, living a privileged out of touch existence that makes their findings irrelevant to \"regular\" people, scapegoating academics for a great many social and economic problems, etc. All. the. time.\n\nI'm also in the humanities, which I think gets even more wrath (especially historians, since we're presenting information/narratives that don't conform to the rosy picture of America that many learned in grade school).",
                  "author": "Quincy1785",
                  "created": 1592831530,
                  "upvotes": 79,
                  "replies": {
                    "fvnzsw8": {
                      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnzsw8/",
                      "text": "Also in PA, born and raised, and I heard it a lot growing up in NEPA. I'm in Philly now, and obviously not so much here as was there. My psych program changed its title to better distance itself from the humanities, I think at least partially, for that reason.",
                      "author": "DonHedger",
                      "created": 1592853382,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                },
                "fvmsocm": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmsocm/",
                  "text": "We hear stuff like that all the time here in Wisconsin.",
                  "author": "dberg",
                  "created": 1592830616,
                  "upvotes": 31,
                  "replies": {}
                },
                "fvmupkh": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmupkh/",
                  "text": "Heard it plenty from more conservative members of my family in Virginia and Tennessee.",
                  "author": "ReSpekt5eva",
                  "created": 1592831962,
                  "upvotes": 23,
                  "replies": {}
                },
                "fvn46su": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn46su/",
                  "text": "Strong negative view here in Florida... but Florida, so I suppose that isn’t surprising.",
                  "author": "Jimlish",
                  "created": 1592837518,
                  "upvotes": 14,
                  "replies": {}
                },
                "fvncu7j": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvncu7j/",
                  "text": "To give you two specific instances, here are [Sarah Palin](https://www.youtube.com/watch?v=Eg1vIeuQT1s) and [Rand Paul](https://www.washingtonpost.com/news/post-politics/wp/2014/10/15/rand-paul-hits-nih-funding-claims-at-virginia-rally-have-you-seen-what-the-nih-spends-money-on/?arc404=true) both complaining about fruit fly research spending. Drosophila (fruit fly) is one of the fundamental animal models used in genetics research. I had a friend in grad school working in this area when Sarah Palin made her remarks - I remember how pissed said friend was about it, especially considering Palin has a child with Down syndrome herself.",
                  "author": "Mikey77777",
                  "created": 1592842010,
                  "upvotes": 26,
                  "replies": {
                    "fvo321i": {
                      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvo321i/",
                      "text": "Well they are right! We should use the much more costly and risky method of human experimentation first! I have a [modest proposal](https://en.wikipedia.org/wiki/A_Modest_Proposal), we just use the blacks, drug addicts, and socialists! Everyone wins!\n\n(For those who didn't click the link and/or aren't aware of A Modest Proposal and the deep history of its satirical nature by bringing to light how ridiculous it would be to solve the \"Irish problem\" by eating their babies and making clothing out of their skin: 1) read it and learn some important satire, this is a common trope 2) THIS IS SATIRE!)",
                      "author": "godelski",
                      "created": 1592854977,
                      "upvotes": 12,
                      "replies": {
                        "fvp3dzz": {
                          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvp3dzz/",
                          "text": "My favorite modern interpretation of A Modest Proposal was the adult swim flash game \"orphan feast.\" You're in London, and you collect children for rich people to eat.",
                          "author": "cancion_luna",
                          "created": 1592874410,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fvmy940": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmy940/",
                  "text": "I’m also from NJ, though I studied in Philly. Honestly, I’d argue that you’ll see in countrywide, but NJ is sorta weird cuz we really value education in general, but going to Philly you can really see when others don’t. Budgets are changed to either give universities very little, or other agencies *cough* *cough* the police *cough* may siphon money from them (they did it for a tax that was meant to be for Public schools).\n\n\nYou regularly hear state representatives talk about the pointlessness of university. How it serves as a tool to make liberals and people who obey the government. How academia should only be for STEM and how that should be the only thing funded. \n\n\nIt happens everywhere in the country, for NJ, Christie was pretty bad, and regularly picked on teachers. Though I am not sure about higher ed. He definitely went after schoolteachers.",
                  "author": "Munnodol",
                  "created": 1592834160,
                  "upvotes": 17,
                  "replies": {}
                },
                "fvn4bft": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn4bft/",
                  "text": "> We hear stuff like that all the time here in Wisconsin. u/dberg\n\nThat is where I am. Also, it differs from field to field. I am in Geography which historically has been one of the first departments to get defunded at universities. We are very much scientists, but politicians and universities like roping us into liberal arts. \n\nNatural Science is overall one of the most universally hated/loved fields in the US, though the love is only superficial from most folks who want to have an easy fix to x, y, or z problem and be done. \n\nFor example the EPAs guidelines for studies to be considered in policy cuts out a massive proportion of independent studies and favors industry contracts (typically the low bidder) rather than fund universities.",
                  "author": "the_Q_spice",
                  "created": 1592837587,
                  "upvotes": 5,
                  "replies": {}
                },
                "fvodujj": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvodujj/",
                  "text": "I’m from Boston and hear this all the time.",
                  "author": null,
                  "created": 1592860377,
                  "upvotes": 1,
                  "replies": {}
                },
                "fvp36cl": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvp36cl/",
                  "text": "I hear it in Louisiana. Mostly, it's about how people graduating from college can't find jobs to pay down their college loans, but they do complain about the tax burden as well",
                  "author": "cancion_luna",
                  "created": 1592874285,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "fvnqkkk": {
              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnqkkk/",
              "text": "I don’t see the connection between individualism and anti-intellectualism in America. I suspect it’s origins have more to do with class and practicality. This country has always been a draw for the poor in other countries, just trying to survive and prosper, that poor culture has survived in many ways. From their POV, fancy book-learnin’ didn’t help our ancestors survive dysentery on the boat ride over here, or get a cabin up before Winter killed their kids.",
              "author": "TakeOffYourMask",
              "created": 1592848829,
              "upvotes": 2,
              "replies": {
                "fvnular": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnular/",
                  "text": "The individualism thing actually makes total sense to me. The highly individualistic taxpayer only wants to invest in things that directly benefit themselves. This is most obvious in things like healthcare (why should I pay taxes towards everybody's healthcare when I could pay for insurance just for myself/my family?) and education (if I want to invest in my child's education, why would I pour more money into the  city's public school system when I could just pay for them attend a private school?)\\*, but I think the logic absolutely extends to academia as well. The average taxpayer doesn't see any way in which they directly benefit from research in, say, most humanistic fields; so why should they fund it with \"their\" taxpayer dollars?\n\nIt doesn't matter if that research is benefitting another population, or working towards some greater good of generating more knowledge, or anything like that; the individualistic taxpayer isn't particularly interested in investing in the general betterment of society if they don't see how it will help themselves directly. (This is opposed to, say, using taxpayer dollars to pave the roads, which generally benefits everyone but which also has a visible and immediate impact on each taxpayer's daily life.) From that perspective, it makes total sense that a population with a very individualistic mindset wouldn't want their tax dollars going towards research that likely as not won't ever benefit them directly.\n\n\\*obviously these are both *vastly* over-simplified examples for the sake of the argument I'm making here, but I think the general idea holds water",
                  "author": "onsereverra",
                  "created": 1592850809,
                  "upvotes": 25,
                  "replies": {
                    "fvpvbr7": {
                      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvpvbr7/",
                      "text": "You’re talking about funding research, not anti-intellectualism. One can be highly intellectual and disagree on using tax-payer money to fund (some) research.\n\nI still see no connection between individualism and anti-intellectualism.",
                      "author": "TakeOffYourMask",
                      "created": 1592892873,
                      "upvotes": 0,
                      "replies": {
                        "fvsszew": {
                          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvsszew/",
                          "text": "The comment you initially responded to specifically used the term anti-intellectualism to refer to people thinking that funding academia is a waste of tax dollars. Of course there are other facets to it, but that is definitely what the topic of this thread was about.",
                          "author": "onsereverra",
                          "created": 1592957279,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fvmz3pi": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmz3pi/",
          "text": "Agreed! In my country (Kuwait), professors and academics are highly respected. I also want to be one so i may be biased.",
          "author": "brknhrtz",
          "created": 1592834665,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "fvmkmji": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmkmji/",
      "text": "The issue is actually pretty straightforward.\n\nWe - on the whole - love our research, and love our teaching. However, we work in a system which is administered by people who don't actually value those two things particularly. The metrics we are gauged against are not good metrics of performance or achievement. The people who manage us are not trying to help us improve in those two things, but to manoeuvre us to increase our ratings on these crappy metrics in more cost efficient and profit-making ways (profit for the organisation, not the people doing the work).\n\nThe pay structure in academia has stagnated on the academic scales, while senior management pay rises have been ludicrous. There has been a drive toward the casualisation of staff, whereby trying to get contracts to employ colleagues on permanent (US TT) style contracts is ever harder, and instead we expect junior staff to exist on a sequence of fixed-term contracts with limited opportunities to climb the - already deflated - pay spines, and, as a result of their temporary contract status, hinder their ability to even apply for grants which might help them find better positions.\n\nIn terms of research funding, the amount of funding becoming available has been cut and cut. The methods of allocating funding have become comical. For example, int the UK, the Natural Environment Research Council, who award all government funding for geology, earth sciences, environmental sciences, etc had so many people applying for funding, and so little money to give out that they started requiring universities to filter who was applying., So now to apply to NERC you have to first of all go through an internal review process. And many universities are limited in the number of grants they can submit each round (perhaps as few as 1 or 2). So you can be in a situation where you ahve a department of 10 or 15 people, but only one of you can submit a proposal to NERC each round. Once you get through that filter your success rate at the NERC panel is currently about 7 or 8%. Proposals are graded from 1-10. In the past if you scored a 7 or 8 you had a fighting chance of getting funded. These days if you don't have a 9 you have no chance, and even a 9 just becomes a roll of the dice as to whether you get fuinded. \n\nOur work - when we do publish it - gets used by publishers to sustain a toxic model of publishing houses; our grants get squeezed for publication fees, while our university libraries get charged to access the publications that we end up having to pay to publish.\n\nThe HE sector got co-opted by suits in the 90s and they are milking it to death. That said, there are few other opportunities for me to work in my field, and no other opportunities for me to teach at this level.",
      "author": "OrbitalPete",
      "created": 1592824233,
      "upvotes": 70,
      "replies": {
        "fvmwij4": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmwij4/",
          "text": "Yeah, I was going to write something similar. The key distinction missed by OP is between hating academia as a system vs hating academia as a profession. While there are likely exceptions, most academics likely really enjoy their profession, i.e. they like conducting research, they like mentoring students, they may even like teaching, etc. What they mostly despise is the other things that are required to do that profession, e.g. dealing with ridiculous administration and bureaucracy, begging for funding, being exploited by massive publishing corporations to be able to share their research etc.",
          "author": "CrustalTrudger",
          "created": 1592833109,
          "upvotes": 32,
          "replies": {}
        },
        "fvnrm37": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnrm37/",
          "text": "This was a great response. I'll note for the OP, who may be writing from a U.S. context, that what this response calls \"casualisation of staff\" is more commonly referred to in the U.S. as **adjunctification**. \n\nYou must do research on the rapidly increasing exploitation of contingent faculty if you want to pursue academia, especially since there's a strong possibility you'll find yourself in that position. \n\nAs /u/CrustalTrudger notes, it's possible to love one's research/teaching/intellectual network but to have contempt for a system which, at times, actively prevents faculty from doing either of those things well--especially teaching. \n\nI would argue that a critical perspective is **necessary** if we ever hope to change academia, which is not some romantic, idealized bastion of equality and freedom, but is, in fact, increasingly sustained by an underpaid and uninsured underclass. While this may be particular to the U.S., the fact that so many adjuncts don't receive health insurance or benefits is criminal.",
          "author": "synthesis-synthesis",
          "created": 1592849342,
          "upvotes": 18,
          "replies": {}
        },
        "fvp2cfl": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvp2cfl/",
          "text": "I was going to reply to OP but you said everything so well. \n\n&#x200B;\n\n\"We - on the whole - love our research, and love our teaching. However, we work in a system which is administered by people who don't actually value those two things particularly\"",
          "author": "16bittiger",
          "created": 1592873802,
          "upvotes": 2,
          "replies": {}
        },
        "fvp1ybp": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvp1ybp/",
          "text": "This and the replies to this (at the time of my reply here) are so clear and awesome. Thank you guys!\n\nTo ask a daring question, what would it take to fix this issue? Or what possible avenues are there for working against the money-hungry institutions that universities/colleges are?",
          "author": "applekaw19",
          "created": 1592873573,
          "upvotes": 1,
          "replies": {
            "fvp4636": {
              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvp4636/",
              "text": "Oof. A ton of reform. It would take a highly functioning governing body to step in for auditing (neither exist at the academic and government levels). \n\nIf a private industry entity were to be seen as highly valued governing group (like if we saw Pearson, Princeton Review, or any of those others as noble groups that oversee academic populations/production, and not bloodthirsty for your money) and a reform were to be passed at the Congressional level, it could impart very much-needed change. At the institutional level, it may require auditing boards to come in for each program, report, and have an outside force lay out strengths, weaknesses, and imperative action to improve system and compensation. Much of the decisions being made are the people highly paid. Check out public institution paychecks and match them to the job descriptions-- you'll see the personality that justifies the outrageous pay gap.\n\nSadly, the way the U.S. is broken at all levels of education, this type of overall change won't happen very soon. Long way to go.",
              "author": "ladypimo",
              "created": 1592874872,
              "upvotes": 3,
              "replies": {
                "fvp9hvx": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvp9hvx/",
                  "text": ">Sadly, the way the U.S. is broken at all levels of education, this type of overall change won't happen very soon. Long way to go.\n\nI almost wonder what will happen with the coming 'trough' of budget shortfalls. So many of the suit's calculations were based on BAU indefinitely. With so many undergrads now suddenly reevaluating whether college is really worth it, especially with courses being online, a lot of schools are going to fail over the next 2-3 years (my undergrad put out an email to alumni that played down the risk, but reading between the lines revealed that they are seriously concerned about the long term prospects of the school - and they were up until this point pretty solid financially) \n\nYour Harvards, Oxfords, MITs, they'll all be fine. State schools might see some campuses close, maybe temporarily, probably permanently. But your 'regionally ranked' private schools are at serious risk of facing an academic mass extinction. Who knows what kind of knock-on effect this will have on the rest of the industry.\n\nThe obvious first result is a depression of academic wages even further than they are already. But if the loss of enthusiasm for HE becomes a trend that outlives covid, then I can see this spilling over to rest of the academic sector a well. Fewer universities and students means fewer studies (bad) which could mean more grant money available for each study (good). It could also mean that the parasitic industries that built themselves around academia - SAT/ACT, digital libraries/\"publishing\" houses that charge for both access and submission, textbooks - may no longer be viable without the volume of students they've come to expect.\n\nNow, I'm just spit balling here. There is a serious financial crisis facing schools worldwide over the next 1-2 years at least. While it will be painful regardless, there is an opportunity to potentially create some real systematic change. Off the top of my head, a 'crowd sourced' platform to submit and peer-review papers and studies may just be enough to break the back of companies like Elsevier. Especially if you could decentralize the hosting and make it entirely open source so that there is almost no legal surface to target.",
                  "author": "McFlyParadox",
                  "created": 1592877944,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fvmeye5": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmeye5/",
      "text": "Also, this is reddit. People come here to complain. People who are happy with their jobs are, well, happy practicing their jobs. Don’t think reddit provides a full picture.",
      "author": "Thepandaback",
      "created": 1592818632,
      "upvotes": 206,
      "replies": {
        "fvn1gxt": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn1gxt/",
          "text": "Exactly. And more specific to this particular sub, this is an \"Ask\" sub, so people coming here usually have something they need help with.\n\nOdds are we aren't going to get lot of \"What should I do? My wallet's too small for my fifties, and my diamond shoes are too tight!\"",
          "author": "foibleShmoible",
          "created": 1592836032,
          "upvotes": 30,
          "replies": {}
        },
        "fvn9ora": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn9ora/",
          "text": "I understand this but I have to agree with the OP. I've seen this on other social media and even from people in labs I've worked in as an undergrad. While many people enjoy their jobs in academia (if not why would they be doing it) it seems to be one of the most negatively talk about fields that I've come across.",
          "author": "ScottishSTEMinist",
          "created": 1592840410,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fvm7s2x": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvm7s2x/",
      "text": "The analogy I can make is politics; just because a country is politically divided and you see protests doesn’t mean people “hate” their country; in fact most of those people wouldn’t even imagine living anywhere else. We often time vent about many shortcomings in our fields and how to improve processes, but many of us wouldn’t trade a second of our job, whether it’s conducting research in our private time or helping our students, with any other job. Witnesses how this pandemic has made many of us immensely miss our office and conversations with our students.",
      "author": "Mathlete1235",
      "created": 1592811304,
      "upvotes": 43,
      "replies": {}
    },
    "fvmkx0f": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmkx0f/",
      "text": "[deleted]",
      "author": null,
      "created": 1592824503,
      "upvotes": 112,
      "replies": {
        "fvn9tp0": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn9tp0/",
          "text": "Academics being critical by nature is a good point. You’re not going to get any good research done if you aren’t critical of your own work. Not sure if this then spills over into the rest of their lives or if academia just attracts self-critical people",
          "author": "sexy_bellsprout",
          "created": 1592840481,
          "upvotes": 21,
          "replies": {}
        },
        "fvnnv46": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnnv46/",
          "text": ">they are not gods.\n\nSpeak for yourself",
          "author": "fleemfleemfleemfleem",
          "created": 1592847516,
          "upvotes": 16,
          "replies": {}
        },
        "fvnoksz": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnoksz/",
          "text": "Beautifully said.",
          "author": "odradeandthesea",
          "created": 1592847863,
          "upvotes": 3,
          "replies": {}
        },
        "fvnpt85": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnpt85/",
          "text": "I like this response.",
          "author": "synthesis-synthesis",
          "created": 1592848458,
          "upvotes": 3,
          "replies": {}
        },
        "fvsnxl0": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvsnxl0/",
          "text": "Very well thought out response, especially the last two paragraphs.\n\nI think people would be a loss less disenchanted about not \"making it in academia\" if they understood that it is not the only place where they can make a substantial scientific contribution to humanity.",
          "author": "Minny7",
          "created": 1592954467,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fvmjxfe": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmjxfe/",
      "text": "I wouldn't say hated, but it gives you very little in return. Like any intense job, academia has irregular hours, crazy supervisors and toxic competitive colleagues. Like any service job, you deal with customers (students) who can easily leave a bad review for subjective reasons.\n\nIt does not give you a high salary or job security, at least not for a while. So all you're left with is the expectation of prestige. But to faculty, unless you're very established, you're easily replaceable. To entitled students, they will always want more. Not all students are that way, but there are some that will complain if you take longer than a few hours to respond, or don't give them the highest mark, or have a lecture at 8am.",
      "author": "sollinatri",
      "created": 1592823590,
      "upvotes": 28,
      "replies": {}
    },
    "fvmaajs": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmaajs/",
      "text": "I work at a vet school, and the vets complain just as much about hours and pay and the way clients treat them... like academics, just because you complain doesn’t mean you don’t love your job and believe your work makes a difference.",
      "author": "ayeayefitlike",
      "created": 1592813781,
      "upvotes": 17,
      "replies": {}
    },
    "fvmc4to": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmc4to/",
      "text": "Well, I complain because our administration constantly pays lip service to student success and demands faculty do more and more to prevent any student losses, meanwhile systematically slashing any resources that would help this cause by removing teaching assistant funding, increasing class sizes, lowering standards, tightening department budgets, bloating administration salaries and positions, reducing full time faculty, eliminating or \"streamlining\" technical supports (to the point now where you have to log in each time you would like to access the unreliable internet that times out within an hour), funneling money into sports and another new \"virtual reality\" lab that no one will use while the advising office has caseloads of 500+ students for each position, etc. etc.  I'm sorry to say that I believe the president of our university almost identically mirrors the president of our country, but in a 5 foot tall woman's body.  Higher education is run like the rest of the failing, greedy, capitalist corporations in our country, and it is not a model that is sustainable longterm for the mental health of those involved.",
      "author": "texcc",
      "created": 1592815660,
      "upvotes": 23,
      "replies": {
        "fvqaxp8": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvqaxp8/",
          "text": "Are you talking about the USA?",
          "author": "GuitHarper",
          "created": 1592908130,
          "upvotes": 1,
          "replies": {
            "fvr67x8": {
              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvr67x8/",
              "text": "Yes",
              "author": "texcc",
              "created": 1592927934,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fvmxlh6": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmxlh6/",
      "text": "I think there's few reasons. One is the discrepancy between what you thought you were going to do, and the reality of academia. As you say, when you're early in training you think you're going to be \"charting the course of humanity's future and making this world a better place\". People who value that goal can put up with the low pay relative to training because the goal seems so exciting and worthwhile. After being involved in the way research actually works and seeing the ability and behaviour of people who you once believed were the leaders in your field, it can be pretty disillusioning. Personally, I've ended up feeling that while I would love to be \" charting the course of humanity's future and making this world a better place\", I'm actually just throwing together research that fits within the purview of the current grant but contributes very little to the future of humanity.\n\nAnother big difference between academia and lawyers/medical doctors is the stability. While in your early 20's the idea of having to work overseas and moving around doesn't seem like an issue and actually sounds exciting. By the time you're doing it, it gets a lot more difficult to put up with. There are parts of your life that really suffer, or just get a lot more difficult relative to the stable career of a lawyer/medical doctor. In those professions you can probably get a job in whatever city you want, and you get a long term salaried position rather than 2/3 year contracts.\n\nWith respect to how it's perceived by the general public I think there's actually a lot of variability in the response. Plenty of people think being a researcher/professor is very impressive, but there are definitely people who think the way you mentioned. Maybe I'm cynical but I think a large part of that is to do with salary. To a large degree, people venerate professions that earn lots of money, and that's not really the situation for most academics. Also, people interact with lawyers and medical doctors in their daily lives so they personally benefit from that expertise directly, that's not the case for researchers.",
      "author": "dhen061",
      "created": 1592833762,
      "upvotes": 10,
      "replies": {}
    },
    "fvn597j": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn597j/",
      "text": "The \"why can't you just be happy like other professions\" sentiment expressed in this post is Academic Administration propaganda.The sentiment of this post is basically how could academia be that bad that people complain all the time and have a bad attidude - people are unhappy for a reason! I just don't understand this sentiment - If doctor don't complain you think it's because they feel similar issues but just don't complain about it? No. Academics are unhappy/complaining for real reasons. If another profession had real reasons to complain they would too. \n\nAcademia is structured with an intense hierarchy, where the salary range for the first ~15 years is between $35,000-50,000 (lab tech to postdoc) which covers zero years of experience to having a freaking PhD lol - very little material reward for increased education/experience. This breeds contempt in any profession! Since you're comparing other professions, imagine a lawyer needing a BA, then law school is 6 years (PhD timeline) and then you're still in a training position making 50 grand while other lawyers tell you that you should just be happy you're carrying out your amazing country's constitution yet with only a chance to make the big lawyer bucks and the goal job later. It's a gamble that doesn't pay off for a lot of people in academia so there is of course complaints. \"Just be happy you do what you love\" \"your still in a training position\" \"your degree is basically free so you don't have loans to pay off (read: so you don't deserve more money)etc are just excuses to not fix a broken system and frankly I find oppressive illogical and demeaning. I said what I said.\n\nThen 1 in 20 postdocs or whatever pops out to be a professor somewhere, so there is a lot of \"failure\" and/or struggling to succeed so of course there is widespread bitterness. Then those new professors instantly justify all of their hardships because they made it(!) making it difficult to share empathy with their lab members because they toughed it out why can't you.  I had a postdoc friend who complained constantly about how little money they made and that the \"training position\" excuse was hogwash. Then he became a professor and bemoaned how expensive postdocs were and how little they accomplish and how he has 10x responsibilities now as professor but only makes 2x as much as he did as a postdoc. Like dude how did you completely forget what it was like to be a postdoc less than a year ago?? Yes you're on the other side but this should show you how broken the system is not that you should resent your lab members. The cycle continues.\n\nI completely agree that having a more positive attitude about your workplace and profession is helpful all around(!) but I strongly disagree that it also means you should be content with your system - we need change and people are unhappy for real reasons, not because we don't have mental fortitude to be happy like medical doctors do.",
      "author": "pastaandpizza",
      "created": 1592838081,
      "upvotes": 9,
      "replies": {
        "fvzsite": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvzsite/",
          "text": "> Then he became a professor and bemoaned how expensive postdocs were and how little they accomplish and how he has 10x responsibilities now as professor but only makes 2x as much as he did as a postdoc. Like dude how did you completely forget what it was like to be a postdoc less than a year ago?\n\nIn all fairness, getting a promotion to management (effectively what a professor with a lab is) in industry isn't so dissimilar and having a 2x bump in pay would actually be really impressive in a lot of fields. Usually the pay bump going from mid-level experiences (roughly a postdoc) to manager (TT assistant professor) runs between 0.3  to 0.5x. Whereas in academia it isn't uncommon to get an actual 2x bump going from postdoc to TT.",
          "author": "ManInBlackHat",
          "created": 1593118540,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fvms098": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvms098/",
      "text": "I can’t say much about academics themselves but in regard to public perception, I think that the growing price of (American) colleges cause professors to get some of the residual resentment. It also leads to a huge misunderstanding of what an academic does and how much they get paid?\n\nThe general public knows very little about the research aspect of academia and judge academics mostly on pedagogy. And when college is seen as hundreds of thousands of dollars worth of “investment,” classes and teachers seem more like a product. There is this idea that academics are supposed to serve “students” rather than the actual material and pedagogy but surprise! That’s not what actually happens and lots of times students fail. And instead of blaming failiure on the lack of prep in primary and secondary education, academics themeselvs get the blame. Then general public gets this idea that academics are just “pompus people” who are out of touch and who makes SO much money only to “fail” students.\n\nDoctors may be pompus but at least they save lives.\n\nAnd lawyers? If I’m being honest, they aren’t that publically esteemed either because of the terror that they are all liars that will do any means necessary.\n\nThe last thing I want to add is propoganda...how many tv shows, commercials, and public dispalys feature doctors, lawyers, and detectives? The answer is a lot. I can name 5 doctor shows without thinking too hard. But academia? There is little to no mainstream propoganda for academics. The closest thing is big bang theory and....yea",
      "author": "MinervaMinkMink",
      "created": 1592830153,
      "upvotes": 9,
      "replies": {
        "fvnbkx3": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnbkx3/",
          "text": "We all know that the Indiana Jones movies showed everyone exactly what life is like as a professor!",
          "author": "a_large_plant",
          "created": 1592841374,
          "upvotes": 8,
          "replies": {}
        },
        "fvztca6": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvztca6/",
          "text": "> The closest thing is big bang theory and....yea\n\nTed Mosby in How I Met Your Mother  was either an adjunct or professor of practice in architecture in later seasons. Most likely a professor of practice given that he could afford to live in NYC and then buy and repair a house.",
          "author": "ManInBlackHat",
          "created": 1593118931,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fvmq6ih": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmq6ih/",
      "text": "I think you might be dealing with a biased sample by associating with the academic community. If you head over to r/law or r/medicine, you get the same series of complaints (overworked, underpaid, hard to get in/not enough jobs, etc.).\n\nBasically people just complain no matter what they do, and Reddit amplifies the complainers.",
      "author": "UnrequitedReason",
      "created": 1592828838,
      "upvotes": 8,
      "replies": {}
    },
    "fvm6w2g": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvm6w2g/",
      "text": "Interesting, because all the doctors and soliders (I'm a assuming that's what you mean by vet - i dont know any veterinarians) I know also complain about their jobs about as much as academics.\n\nPeople complain about their jobs that's the way it is, also many answers here are directed at students and there an attempt possibly even a responsibility to provide a reality check to them.",
      "author": "tc1991",
      "created": 1592810470,
      "upvotes": 46,
      "replies": {
        "fvmabxo": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmabxo/",
          "text": "I assumed they meant veterinarian",
          "author": "Serket84",
          "created": 1592813820,
          "upvotes": 58,
          "replies": {
            "fvmbd3i": {
              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmbd3i/",
              "text": "yeah but Americans mean former solider when they say vet and OP mentions the military later in the post",
              "author": "tc1991",
              "created": 1592814864,
              "upvotes": 9,
              "replies": {
                "fvmg1mj": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmg1mj/",
                  "text": "Americans typically mean veterinarian when saying vets... OP's usage is incredibly strange. Veterans is not typically shorthanded specifically because when we say the vet. We mean the veterinarian.\n\nLike \"taking the dog to the vet\"\n\n\"The cat needs to see the vet\"\n\n\"My family member the vet\" would be misunderstood a majority of the time as them being a veterinarian.",
                  "author": "Snowpossum",
                  "created": 1592819774,
                  "upvotes": 37,
                  "replies": {
                    "fvmgip1": {
                      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmgip1/",
                      "text": "> Veterans is not typically shorthanded specifically because when we say the vet.\n\nYou can use both.  I don't know anyone who wouldn't think that vet means veteran, especially if used in context.\n\nWhen there are campus Vets orgs, people aren't looking at that and going \"there's a campus org for veterinarians?\"",
                      "author": "WillitsThrockmorton",
                      "created": 1592820259,
                      "upvotes": 21,
                      "replies": {}
                    },
                    "fvmm4h4": {
                      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmm4h4/",
                      "text": "Maybe it's a regional thing then, Pennsylvanians mean veteran when they say vet, generally",
                      "author": "tc1991",
                      "created": 1592825574,
                      "upvotes": 0,
                      "replies": {
                        "fvmr1x4": {
                          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmr1x4/",
                          "text": "Not really, but also really context dependent.",
                          "author": "AnonBizPhD",
                          "created": 1592829475,
                          "upvotes": 8,
                          "replies": {}
                        },
                        "fvmorpq": {
                          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmorpq/",
                          "text": "I think everyone here is right, vet can equally mean veterinarian or veteran. But in the context of OP I'd think they meant the former rather than the latter because they were talking about people who currently have that job, and in my mind a 'veteran' is someone who was previously a soldier, survived some form of deployment, and has returned and is no longer a soldier.",
                          "author": "magpie2295",
                          "created": 1592827760,
                          "upvotes": 6,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fvn42pa": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn42pa/",
                  "text": "The only time 'veteran' is shortened to 'vet' in common usage is when it's following the conflict of which the person is a veteran.\n\n'I'm a Vietnam vet.'   'Oh?  did you enlist, or were you drafted?'\n\n'I'm a vet.'  'Oh?  Household pets or argicultural?'",
                  "author": "lucianbelew",
                  "created": 1592837458,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "fvmb493": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmb493/",
          "text": "I can promise you, most veterinarians complain bitterly. It's like becoming a doctor, with all the expenses, except your patients cant tell you what is wrong, the clients wont let you help, and the pay is poor.",
          "author": "InfuriatingComma",
          "created": 1592814617,
          "upvotes": 24,
          "replies": {
            "fvmifjh": {
              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmifjh/",
              "text": "And the chances of a patient biting are you are a bit higher.",
              "author": "nerdhappyjq",
              "created": 1592822157,
              "upvotes": 21,
              "replies": {}
            }
          }
        },
        "fvn3eqy": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn3eqy/",
          "text": "> People complain about their jobs that's the way it is\n\nI don't think that's fundamentally true, I think what /u/OrbitalPete said is closer to the truth: Professions in which the values of the people actually performing said profession and in which the system does not reflect these values, are bound to complain about them. \n\nIt seems to me like a simple problem of the people that perform a job have no or little say in how this job should be organised. This could be addressed by giving more power to academics and making academia more democratic as a whole, don't you think?",
          "author": "CompletelyClassless",
          "created": 1592837102,
          "upvotes": 5,
          "replies": {}
        },
        "fvn4p8d": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn4p8d/",
          "text": "Veterinarians also complain about their jobs like crazy.",
          "author": "mediocre-spice",
          "created": 1592837792,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fvn22ne": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn22ne/",
      "text": "Being a doctor/vet is very different from being a scientist or grad student. Unless you have an industry job, it's pretty miserable compared to other \"normal\" jobs. Doctors do complain about their work hours and low wage (in the beginning) a lot. But later on they gain experience and often open their own private practice or work in a clinic, where they can choose the conditions.  \n\nUnless you're a senior scientist, you can't really do that. Working as a proffessor can grant you a decent life, but how many are there compared to all scientists? Teaching is overall incredibly time consuming, so can be experiments. People in academia usually do both. Many institutions don't pay overtime. On top of that, you're expected to move around the world to share knowledge with other scientists and leave all your loved ones behind. It also requires you to have no commitments. This is very hard, as you give a lot and gain not that much for your personal growth. That's the easiest way to burn out. Especially if you're a woman and want family one day.  \n\nI can't imagine finishing a PhD at 32, having family and then going back to the lab 3 or 5 years later. One of our proffessors actually tried to talk us out of applying for PhD for this reason. I, for example, love science and very seriously considered a PhD.... but I can't do mobility because I have commitments where I live. I don't want to work up to 10 hours a day because of experiments. I don't want to work weekends and give up my personal life completely. And right now I need a surgery, which will get me out of work for at least 2 months and there's no compensation from my employer. Guess I'll end up on street or something, Idk. It's frustrating but at the end of the day, every job in academia is different. If you're lucky, you'll be offered good conditions and you'll happily accept.",
      "author": "Lady_of_Ironrath",
      "created": 1592836372,
      "upvotes": 7,
      "replies": {}
    },
    "fvn43z4": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn43z4/",
      "text": "The pay is low, the hours are long, the jobs are unstable, you often have to move away from support systems every few years. It's really hard to spend time sitting back happy with and proud of your job if you're struggling with basic living expenses. The pace of change is very slow -- yes, something we discover might change the world, but it's not going to save a life today. You also see friends who are brilliant pushed out of the field all the time. It's really easy to become jaded. \n\nI also think you're using a bit of selection bias. Both [vets](https://time.com/5670965/veterinarian-suicide-help/) and [doctors](https://www.webmd.com/mental-health/news/20180508/doctors-suicide-rate-highest-of-any-profession) are among the professions with the highest suicide rates. A lot of my friends went into those fields and they're frustrated and miserable.",
      "author": "mediocre-spice",
      "created": 1592837477,
      "upvotes": 5,
      "replies": {}
    },
    "fvmnyev": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmnyev/",
      "text": ">I've never seen another field (except law, perhaps)\n\nBig pharma anyone?\n\n*cries in pharmacology research*",
      "author": "FrenchLlamas",
      "created": 1592827109,
      "upvotes": 4,
      "replies": {}
    },
    "fvmrh0s": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmrh0s/",
      "text": "couple things to think about. but before you ever consider the others, you need to think about:\n\nsampling. you have no reason to think that people who post online about their job are statistically representative of the profession as a whole. (and there may be for any of a million reasons a reason why differnet professions do this differently - e.g. academics are systematically more likely to express their annoyances through writing about their thoughts to others, compared to police officers or accountants, who are more comfortable expressing their complaints in another way). \n\nand, more generally, my hunch - though not at all scientific - says that:\n\n\\- academics often work as hard (in terms of hours and mental effort and pressure) as those other professions but make about 1/3 as much. and after spending 2 or 3 times as long getting training. \n\nwe could go on forever but my point would be that if you really want an answer to your question, im sure there's some academic literature on it!",
      "author": "BlancheDevereux",
      "created": 1592829774,
      "upvotes": 6,
      "replies": {}
    },
    "fvmro93": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmro93/",
      "text": "Jeez dude! There is a real world out there and it may not agree with you and it may not be \"right\" but it is what it is. Academics do whinge a lot but their complaints are generally true\n\nIn my area doctors are paid about 4 times the salary of an academic. Lucky I didn't stick with academia",
      "author": "Not_for_consumption",
      "created": 1592829916,
      "upvotes": 4,
      "replies": {}
    },
    "fvo9x1d": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvo9x1d/",
      "text": "I don’t think it’s just people in academic STEM who feel this way. It’s industry and government too. I was one of those people who saw science research as this great, rewarding pursuit that would contribute to society. And it can be those things. Sometimes. But a lot of things have changed in the last 15-20 years that have taken away from it. Funding has tanked, you’re constantly fighting against the system that is supposed to support you, the publish or perish metric for success contributes to infighting and backstabbing, peer review in practice is flawed, you spend years and years working your fingers to the bone to get a PhD, only to have to do it all over again as a post doc while all of your peers are buying houses and going on nice vacations, grad students often suffer with mental illness in silence because they’re afraid to seem like they can’t cut it, science deniers in the general public are on the rise, and there’s a lot of discrimination to battle if you’re not white and male. It’s a lot to deal with.",
      "author": null,
      "created": 1592858383,
      "upvotes": 5,
      "replies": {}
    },
    "fvpcs4s": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvpcs4s/",
      "text": "For one take (specifically in theoretical high energy physics), see the discussion of a Facebook post on this blog:\nhttps://www.math.columbia.edu/~woit/wordpress/?p=11785\n\nThe main points are contained in this quote:\n> We are put in competition with each other from day one, and only very few of us will be given prestigious positions in the end. Most of us never see a permanent contract, keep jumping from place to place and eventually need to find a second career after having sacrificed our entire 20s and 30s to academia. After having made it through the worst part of this and more or less securing my career, it still made me sick to see young physicists entering this spiral. I felt terrible about encouraging them to continue on this path because it is impossible to tell who will make it in the end and who will end up miserable with regrets…\n> \n> Science itself is severely suffering from the poor working conditions and lack of genuine career prospects. I personally found it extremely hard to focus on the science while constantly being worried about the duration and location of my next contract. #PublishOrPerish. Interactions with and among colleagues are often dominated by the drive to “show off”. Very few people focus on removing misunderstandings or ask honest questions in order to fill their knowledge gaps. The general atmosphere is dominated by doubt instead of trust. We constantly need to outshine our peers. Better to demonstrate superficial knowledge of broad subjects than to focus on the details of a deep problem. Your next result needs to be “groundbreaking”, otherwise you’re out of a job. But produce it and have it published at least one year before your contract ends because that’s when you need to apply for a new one. Science has become a show…\n> \n> I see absolutely no chance that any of the above will change any time soon.\n\nThis isn't just bitter complaining from someone who \"didn't make it\". These are the thoughts of someone who has obtained a professorship at a prestigious institute working on quantum gravity, an extremely difficult subfield in terms of both its technical complexity and its extremely high rate of professional attrition due to its extremely small amount of funding and positions available. So this is someone who made it through the gauntlet to get the dream academic job, and is now leaving academia due to what they consider to be a toxic work environment.\n\nGranted not all academic fields are this bad, but it does offer some insight into the problems which arise in academia.",
      "author": "Minovskyy",
      "created": 1592879902,
      "upvotes": 4,
      "replies": {
        "g0dbrb9": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/g0dbrb9/",
          "text": "Thank you so much for linking that Facebook post. That professor had exactly the kind of job I wanted all my life and she has the exact same problems I have with academia. I really appreciated it when she mentioned that she can no longer be a role model for this kind of environment, because I was even thinking about continuing with Physics but maybe focusing on education, but I just didn't want to inspire people to follow academic path like I did, only to end up disappointed and full of regrets.\n\nThis is probably the last nail in the coffin for me. I am second doubting myself a lot about leaving Physics to pursue other dreams in Aerospace Engineering, but I guess this is it. Physics is beautiful but academia is not.",
          "author": "askingquestionst",
          "created": 1596572002,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fvmh333": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmh333/",
      "text": "Reddit gives you a very skewed perspective on the matter.  Many people use reddit to vent about the negative aspects of academia.  In reality, many people are happy - with their PIs, with their labmates, their projects, their fellow faculty members, etc.  Those people aren't posting here.\n\nThat's not to say negative environments don't exist.  Just remember that a lot of people use reddit to vent, and while they deserve a place to vent, they are not representative in general.",
      "author": "robomace",
      "created": 1592820836,
      "upvotes": 16,
      "replies": {
        "fvmqpp5": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmqpp5/",
          "text": "This exactly",
          "author": "AnonBizPhD",
          "created": 1592829229,
          "upvotes": 2,
          "replies": {}
        },
        "fvo5npr": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvo5npr/",
          "text": "Thank you, I needed to hear that.",
          "author": "Kitchen_Drop_3280",
          "created": 1592856257,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fvmv4rl": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmv4rl/",
      "text": "I don’t hear that in the US for CS field — sure, there are people anti science but other than that, I think people in academia like it a lot.. and sure there are exceptions like any other job.",
      "author": "FoCoCS",
      "created": 1592832233,
      "upvotes": 4,
      "replies": {}
    },
    "fvmro2r": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmro2r/",
      "text": "As someone in Legal Academia....FML ;)\n\nFor my specific niche though, academia isn't respected as much as the private sector pays you way more, against usually better secondary labour conditions. The work hours in academia here are murder, there is a high reliance on grants, job contracts are uncertain, legal scholars fall into roughly two categories 'scholars' and 'lawyers' and the two cannot stand each other. All in all it is a pretty toxic mix. However, my generation onward has a more relaxed attitude and I get the feeling that the \"lawyers who want a prof. title\" are slowly out of fashion, leaving just the scholars. The freedom is amazing and even though my work feels ever-ongoing, I wouldn't really go into the private sector.\n\nI am always brutally honest to the prospective PhD's though. You need to love teaching, learning and writing, because you won't get your kicks from any of the other things offered.",
      "author": "MrPanofsky",
      "created": 1592829913,
      "upvotes": 3,
      "replies": {}
    },
    "fvn6mbr": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn6mbr/",
      "text": "Imo the lack of rights you have as a PhD student contributes a lot. As a result there is a lot of abuse that probably wouldn't be tolerated to such a large extent in the industry. I've met professors who couldn't make it in a practical job and went into academia.\n\nFor example, in my country you have a minimum of vacation days. It's a legal right... Unless you're a PhD student. PhD students (in my country) have a vague statute between employee and student. Vacations should be agreed upon with your supervisor. If your supervisor doesn't want to grant you your vacation, HR does nothing if your a PhD student. If you work in another position at our university, HR does intervene if you don't get your legal vacation days. It lays the ground work for a very abusive situation. Similarly, depending on whether the research grant belongs to your supervisor or to you, your supervisor has final say on all decisions, while your PhD depends on it. In my case, this has led to my supervisor putting a lot of pressure on me to do unethical practices and him making such grave errors with my data that I didn't finish in time. The dean, the ombudsperson and every possible organ knows and my professor has admitted to being in the wrong. Yet there are no consequences for him while I'm the one who hasn't got my PhD yet and I'm the one working on it voluntarily on top of two other jobs. The moment I decide to stop and not get my PhD, I know my supervisor will publish with my data and will take all the credit for my hard work.\n\nI absolutely love doing research, but for me that lack of rights as a PhD student is what makes academia horrible.",
      "author": "Oedipurrr",
      "created": 1592838813,
      "upvotes": 3,
      "replies": {}
    },
    "fvnap2e": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnap2e/",
      "text": "Because of a few reasons stated. . the work is very long and difficult and the pay does not match that. It makes people feel undervalued. A medical doctor will make two or three times as much working similar or less hours. Also it requires a post doc, sometimes a long one hardly making any money at all. While your friends with a BS degree make double your income lol. \n\nSecond, the funding system is crazy. Apply for NIH funds or else you can't be a prof. Not only that but those grants RO1 are incredibly difficult to obtain. You maybe get one or two shots at it. If you don't get it then you can't be tenured. If you can't be tenured you have to quit and search for a position at a different University. But they see that you didn't get tenure at the last place and probably won't hire you. I've seen this where people end up in lifelong lecture positions which pay even less and are yearly contracts because they couldn't get that grant. And the reason the market is over saturated is because universities have paired down how many tenure tracks they offer now. So now they only offer a few. It's cheaper for them to hire lecturers. \n\nThis leaves with a scenario where to be successful you have to work like mad to get tenured. Like 10-12 hour days for years including weekends to insure you get that grant and get published. Otherwise the cards are stacked against you. It's a long difficult path that is not really rewarded at the end. You essentially need 10-15 papers with a home run paper in there like nature science or cell plus finding to really guarantee you land a tenured spot. \n\nEven the major contributions to science these days is all by private companies not really by academic scientists now. The main goal of academic scientists is to train the next gen of scientists not really make ground breaking discoveries. That's pretty rare. Even Nobel prize winners is mostly just people working in the right field at the right time finding something important essentially by stumbling into it. \n\nSo combine that situation of extremely competitive, burn out, low pay, low public recognition, and minimal contribution to the field leads to a bunch of people who are miserable. Science is a great field and it's good to get people excited about it. Every job has the daily grind but in this field some people have a hard time finding the positives. Just depends what you want in a career and what's important to you. The best thing about the job is if you manage to get tenured you have life long job security.",
      "author": "BarbedPenguin",
      "created": 1592840923,
      "upvotes": 3,
      "replies": {}
    },
    "fvnffnn": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnffnn/",
      "text": "I think it partially depends on the type of scientist. What field are you looking to enter?",
      "author": "-DonQuixote-",
      "created": 1592843313,
      "upvotes": 3,
      "replies": {
        "fvnn8ww": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnn8ww/",
          "text": "Chemistry (materials/inorganic chem to be precise)",
          "author": "alChemist_07",
          "created": 1592847213,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fvo8clm": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvo8clm/",
      "text": "It's a good question, I (as a prof) think there are several reasons.\n\n1. a lot of academics got there because they \"didn't know what else to do\" so they went back to school. That's not really the way to end up super satisfied with the path you took in life, even if you would have liked it a lot if you'd arrived at the same destination differently. I myself went to grad school because the local economy crashed and I suddenly couldn't find anything but service jobs and I needed something to do while I waited for things to get better--and then I was successful enough in grad school that I stated. I didn't really know what I was getting into, because....\n2. the mental image and the lived realities of the job are just SO different. (Grad school itself is close enough to college that there's less of a shock there.) I wouldn't be surprised if an office job were often boring, or frustrating, because... duh, office jobs. I wouldn't be surprised if being a lawyer was incredibly taxing and required working almost every weekend. I wouldn't be surprised if working on a political campaign involved, yes, a lot of political maneuvering. But it turns out that as an academic I am ALSO often bored, frustrated, and trying to maneuver impossible political situations, and I work almost all the time. It's just not what I (and I think many people) pictured. And yet it's hard to leave because....\n3. People are constantly telling you how lucky you are. Best job security in the world, no? Get to \"spend your life thinking about interesting things, talking to interesting people,\" right? And \"Do you know how many people try and can't make it? How many would kill to be where you are?\" This might make a small percentage of us feel better but not most of us. Try it, next time a friend is complaining about his/her insensitive/selfish/domineering/whatever male partner. \"He doesn't have a lot of credit card debt. He doesn't live at home. Do you know how many guys do? How many women would kill for what you have?\" Now imagine that not just you but almost everyone she tried to talk to responded the same way. How do you think she feels about her relationship now, better or worse? And yet, at the same time--people are vulnerable to other people's (perceived) judgments and expectations! Chances are she won't feel happier with him--but she'll be worried about breaking up with him, too. Everyone else thinks she should be happy--maybe the problem is her. Maybe he really is the best she can do. Etc.",
      "author": "anonybss",
      "created": 1592857591,
      "upvotes": 3,
      "replies": {}
    },
    "fvmfdo9": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmfdo9/",
      "text": "With the exception of some large scale physics experiments, most of stem is actually quite cheap to run in the grand scheme of national budgets. Most researchers want nothing more than a salary that is enough to live on and time to think about research. It would be easy to implement, and pretty cost effective (think how productive we could be under those circumstances).  But we are living under an occupation, to put it slightly hyperbolically, by the business world. I think this goes a long way to explaining both the general unhappiness of academics and the perception of academia in the general population. Anyone who reflects on the state of academia is aware of the situation and of how it \"should\" be. This comparison causes ennui. Meanwhile, the constant representation of academia as the R&D/training arm of the business world makes the general population feel like our contribution to society should be described in dollar amounts. It doesn't help that the prevailing political position of our age is that everything can be described in dollar amounts.",
      "author": "l_lecrup",
      "created": 1592819078,
      "upvotes": 6,
      "replies": {
        "fvmghfh": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmghfh/",
          "text": "> With the exception of some large scale physics experiments, most of stem is actually quite cheap to run in the grand scheme of national budgets\n\nThere are a lot more exceptions than this!",
          "author": "Chlorophilia",
          "created": 1592820223,
          "upvotes": 11,
          "replies": {
            "fvns98n": {
              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvns98n/",
              "text": "You're certainly right that there are more and less expensive areas of \\*academic\\* stem, but what are some that are of the same order of magnitude of eg cern? I don't think things like space exploration can really be counted as academia, or rather they shouldn't be included in this discussion because a) the public has a generally good attitude towards space, and the perception that they understand what is involved; b) the people I've met who are involved tend to have nothing but praise for their industry and have very different motivations to academics.",
              "author": "l_lecrup",
              "created": 1592849661,
              "upvotes": 1,
              "replies": {
                "fvnu8hn": {
                  "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnu8hn/",
                  "text": "The costs of CERN are spread across 23 countries and the data is used by thousands, if not tens of thousands of scientists though. You can't directly compare a huge single project like CERN to a random university lab, that's not comparing like-for-like and doesn't mean that particle physics is more expensive, it just means that it's more consolidated. For example, the UK spent approximately [£150m on CERN in 2020](https://fap-dep.web.cern.ch/rpc/2020-annual-contributions-cern-budget), which is [less than 1%](https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/505308/bis-16-160-allocation-science-research-funding-2016-17-2019-20.pdf) of the total annual investment in science and research, which sounds like a fairly reasonable proportion given the proportion of scientists you'd expect to be working on CERN-related projects.",
                  "author": "Chlorophilia",
                  "created": 1592850634,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fvmhpe4": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmhpe4/",
      "text": "Am in academia, feel pretty good about it. Love my job. Also, not american or based in the US.",
      "author": "atypic",
      "created": 1592821449,
      "upvotes": 4,
      "replies": {}
    },
    "fvn459p": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn459p/",
      "text": "I think people are proud to be in academia. I also think there is a common thread of martyrdom among a lot of academics. It's tough to get here and a lot of people take pride in having \"survived\" to this point. But I agree that some of posts make me feel like \"shit what did I get myself into?\" But at the end of the day I love my job and just have to remind myself that not every department or college or university is the same.",
      "author": "bugnerd87",
      "created": 1592837495,
      "upvotes": 2,
      "replies": {}
    },
    "fvn6yah": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn6yah/",
      "text": "Because most people here are talking about \"professions\" in the traditional sense, I'll also add that in my experience, this is true of *all* jobs. You ever worked in retail or hospitality? I've never complained as much about work, or heard my colleagues complain as much about work; nor have I endured such blatant disrespect and lack of public appreciation for my job, as when I work in hospitality. The reasons for the devaluing and job (dis)satisfaction are different, but it's certainly not unique to academia.",
      "author": "echidnoodle",
      "created": 1592838991,
      "upvotes": 2,
      "replies": {}
    },
    "fvnb2aq": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnb2aq/",
      "text": "One thing that hastened my eventual exit from UK academia as a postdoc was that, so many times I would talk to a tenured professor (people I respected within the department, or at conferences) and the conversation would go:\n\nMe: *I'm actually thinking of staying in academia*\n\nProf: *Take my word for it, get out - it's all downhill from here*\n\nApart from my supervisor/boss, it was just a sea of negativity and it definitely fed into my skepticism towards continuing on.",
      "author": "DhatKidM",
      "created": 1592841110,
      "upvotes": 2,
      "replies": {}
    },
    "fvnm8p6": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnm8p6/",
      "text": "The market is saturated because academia is set up to easily produce new PhDs at a steady clip, who are guided at every step by professors who won the job lottery (often years before things got as bad as they are now, some of them never even had to do a postdoc) and have overly rosy views of their students’ chances.\n\nAnd this is just IME, but in grad schools and the academic job market I regularly meet upper class people who have no problem doing the postdoc treadmill or working for peanuts because they have zero anxiety about retirement or getting a house one day or whatever. And alongside that you have immigrants from poor countries who are also happy to work like dogs for low pay for years until TT because that’s better than back home. An ordinary lower- or middle-class American just doesn’t have those incentives.",
      "author": "TakeOffYourMask",
      "created": 1592846718,
      "upvotes": 2,
      "replies": {}
    },
    "fvnwhb3": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnwhb3/",
      "text": "As a TT professor, I'm underpaid and overworked. I would have more dignity and pride in my job if I were getting paid substantially more than I am. I was struggling to keep my roof afloat - with a baby on the way - with a full-time working wife -- before COVID. Some adjunct professors live out of their cars and take showers at their local gyms. Where's all the money going, that could be going to the people who make college campuses function? Its mostly going to the increasing salaries of university presidents and provosts while the wages of everyone else stagnates. \n\nI also loathe academia because it was all I had lined up for me coming out of grad school and I made the stupid decision to follow the money. Now I'm on the east coast - away from all of my family, in an environment I absolutely hate. Post-covid I will be working diligently to get the fuck out of academia and move back to the west coast. If I have to start over so be it but academia is mentally taxing, and far too demanding to be paid what I am. Fuck this shit, I'm out.",
      "author": "honestblackman",
      "created": 1592851751,
      "upvotes": 2,
      "replies": {}
    },
    "fvoli7z": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvoli7z/",
      "text": "I don’t know if it’s because I’m related to so many medical docs/surgeons, but they tend to hate their field too with time if not right away straight out of med school. Many of them end up burning out or resorting to research and private practice.",
      "author": "stclaudia",
      "created": 1592864342,
      "upvotes": 2,
      "replies": {}
    },
    "fvpdcru": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvpdcru/",
      "text": "Hey historian (phd candidate) here. \n\nGood question and a lot of moving parts. Not being stem, I can't speak to the specifics of why it isn't appreciated broadly. Many of my undergrads I teach are quite excited by and proud to study stem. A lot of the reason the gen public maligns stem (don't even get me started about social science or humanities) is because they don't realize how much research that goes into consumer goods they use every day comes out of universities and tax payer/government money. Hell where I work companies like Cargill, Dow, etc off loaded quite a bit of their R&D to our graduate programs. \n\nBut the reason for over saturation in social science and humanities is that budgets, state funding, etc have been slashed in the last 35 years. But a big part of getting tenure for those in academia is training new students and universities have become utterly reliant on grad student labor so not attain and accrediting new students will collapse their ability to provide research and education to undergrads.\n\nWe (in history) count ourselves incredibly lucky to get to write and research. But often when our work is public facing its maligned. In the US especially people don't value expertise, and immediately interpret it as political.",
      "author": "Chiquye",
      "created": 1592880248,
      "upvotes": 2,
      "replies": {}
    },
    "fvpixr8": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvpixr8/",
      "text": "I’ve heard different things when it comes to specific complaints and I chalk that up to depending on what field you’re in. But there’s a couple of common arguments that I’ve seen across the board: \n\n1) Politics. Now I’d consider myself extremely left leaning, even left of liberal. But I absolutely agree that the “ivory tower” metaphor plays in to a lot of academic jobs. Academia is absolutely a bubble, and like any other select community the competition can become ruthless. Especially considering that each university has specific tenure requirements that rely on student evals, faculty evals, etc, word can spread fast if the up and coming tenure track faculty member is not up to par. Hell, word can spread fast period. You piss someone off, someone pisses you off, egos start competing, and people will be able to tell/will probably find out eventually. Even between full time professors, things can get ugly when it comes to vying for certain students, maintaining a certain level of prestige which often means churning out accomplishment after accomplishment, or publication after publication, etc. But really, and especially at bigger institutions where it’s all kind of nebulous and you have bigger departments, the political power plays and ego trips can get the best of disillusioned professors. Even issues and run ins with the deans and administrative staff and get a lot of professors down. \n\n2) Funding. Sometimes the salary for certain professorships don’t last a full year, and especially if you’re a researching professor, this basically spells constant grant applications and renewals which add a whole new time commitment and stressor to the ins and outs of things. Securing grant money is a big task, especially if you’re trying to buy new equipment, go on a specific trip, or students are relying on you for funding. Also, most professors don’t even make *that great* of a salary to begin with, so the constant need for extra money can take a lot out of people. \n\n3) Admin can be bitches to work with. Sometimes you get stuck doing a lot more administrative work if you happen to land a title of department head or dean. Again, you’re met with bureaucratic work like handling student complaints, dealing with scheduling issues and staffing issues, allocating funds for the department, etc. All that on top of being a major primary contact for people who have questions, such as grad students, incoming faculty, etc. \n\n\nGranted, I don’t know much. My parents were professors for about 15 years and I happen to be pretty close with my research advisor. Going to a small liberal arts school where everyone is close, you hear a lot sometimes about academic politics. I def know that I started out college thinking a professorial post was my final destination, and am about to graduate next year totally disillusioned with the entire system. So my bias is definitely wrapped up in this post, feel free to take it with a grain of salt. \n\nI totally understand being over the negativity, and the thing is that until I experienced a lot of the power tripping bullshit that professors pulled, I felt very similar. It seems like a decent plushy job, why tf is everyone complaining? \n\nA better question might be to ask why the hell does academic burnout happen as quick as it does, and what factors of the system could we change as future professors to ensure that people in this career field actually enjoy their line of work? That’s something that I heard once that kind of resonated with me amidst all the negative energy. Knowing that there’s an opportunity to make some changes and be a positive influence if I get to that place. \n\nTLDR, it’s a dog eat dog world and not everyone in academia is super supportive of  or excited by your work as you are.",
      "author": "mouatj",
      "created": 1592883765,
      "upvotes": 2,
      "replies": {}
    },
    "fvmqm1o": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmqm1o/",
      "text": "In addition to some real problems, there is quite a bit of selection bias. Many of us love academia, wouldn’t trade it for anything, and are happy as hell.",
      "author": "AnonBizPhD",
      "created": 1592829155,
      "upvotes": 2,
      "replies": {}
    },
    "fvn4rcx": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn4rcx/",
      "text": "1.\tUniversities have lost a great deal of prestige \n2.\tUniversities are incredibly politicized \n3.\tBeing an academic is high risk/relatively low reward (when one considers years of schooling/training)\n4.\tAcademia has a culture of complaint",
      "author": null,
      "created": 1592837822,
      "upvotes": 1,
      "replies": {}
    },
    "fvn79f1": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn79f1/",
      "text": "You've never met someone in EMS haha",
      "author": null,
      "created": 1592839154,
      "upvotes": 1,
      "replies": {
        "fvn7bi6": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn7bi6/",
          "text": "In that they're all pretty jaded",
          "author": null,
          "created": 1592839184,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fvnbqu1": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvnbqu1/",
      "text": "I don't think it's hated, it's just important to know what you're getting into (because we live in a capitalist society and you are sacrificing some earning potential...).  It's just more honest than other fields.",
      "author": "dampew",
      "created": 1592841456,
      "upvotes": 1,
      "replies": {}
    },
    "fvndqth": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvndqth/",
      "text": "have you met the museum world?",
      "author": "plantkill3r",
      "created": 1592842467,
      "upvotes": 1,
      "replies": {}
    },
    "fvne9xf": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvne9xf/",
      "text": "You’ve never seen r/physicaltherapy before or r/PTschool where they tell hopefuls to not get into the field",
      "author": "012596",
      "created": 1592842731,
      "upvotes": 1,
      "replies": {}
    },
    "fvngrnc": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvngrnc/",
      "text": "I can maybe speak to exactly what you’re observing as someone who left their intentions of academic physics to pursue a clinical job in a field known as medical physics.\n\n1. It is a thankless profession with essentially no societal recognition or pay commensurate to your ability and effort. Seems like you’re aware of this, a lot of the recognition part boils down to the pay. Can’t begin to tell you how often blind dates and the like in graduate school would just assume I was childish or something when they realized what I was mentally capable of and that I wasn’t aiming to be some sort of prop trader or something. I’m only really speaking for people in physics but the fact of the matter is if you get a tenured professorship you’ve passed some of the most insane talent/work ethic/luck filters any person could ever go through. The end goal is a job no one really cares that you have outside of your academic circles and a paycheck that’s less than half of what you could probably be earning. These issues are orders of magnitude worse for the overwhelming majority of PhDs who will not *ever* be tenured faculty, this relates to...\n\n2. The career has literally no big picture certainty to it unless you’re tenure track and even then it’s really not matched by what you could pull down through your talents in industry. Just how long can you be strung out on postdoc contracts. How many times are you willing to hop around making near poverty wages, watching your childhood friends be successful and buy homes and have children. Will you ever even be able to start a family in this lifestyle? Do you dare buy a house you can hardly afford when you have no actual reason to believe you’ll be at this institution for more than two years? Things like multiple divorces are sadly really common in academia.\n\n3. There’s no career certainty. Publish or perish. Oh you had an awesome idea and did entirely valid and brilliant work but it turns out the answer wasn’t the sexy choice? Turns out our understanding of the universe is pretty solid and you spend more time finding out that stuff isn’t interesting as opposed to stuff is interesting. So you just spent a year investigating something and got a perfectly scientifically valid result that no one will publish. It means nothing to your career now. By definition you’re looking into things people don’t know, can’t even tell you how many times in grad school weeks or months of serious and dedicated effort were put into just finding out something couldn’t be done. Bonus points if you find out it has been done but no one publishes negative results!\n\n4. You have very, very little assurance that what you’re doing will ever make any impact. Even loads of brilliant physicists who did extremely impactful stuff in retrospect spent most of their life with the community thinking they’d gone after pointless theoretical masturbation. Maxwell is an example, his equations set the stage for decades of inquiry after him. This is even more true now with the publish or perish model where you are encouraged to just pump out as many low quality publications as possible at many institutions. People like doctors and stuff see that their equally taxing efforts are making a day to day difference. Odds are that new algorithm you’re writing or solar panel you’re designing will get you a conference poster and that’s about all. The majority of academic research is frankly not impactful.\n\n5. Politics at the institutional level, field-wide level, and national level. At the institutional level you have to remember most academics were nerds. Being smart was their thing, they now have an outlet to amaze themselves with how smart they are and trivial stuff like coauthorship orderings on low tier conference blurbs can become multi year dramas you’d think Shakespeare concocted. At the field level it’s more of the same but now throw in the ability for personal grievances to impact things like grant funding or paper reviews. At the national level you have the ability for a congressional budget cut amounting to a rounding error to decimate your entire career. National politics also affects the societal lack of appreciation in the US at least.",
      "author": "photon_blaster",
      "created": 1592843983,
      "upvotes": 1,
      "replies": {}
    },
    "fvo1ewk": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvo1ewk/",
      "text": "I can only speak for myself, but this is certainly not true for me. I love this job, it compensates me well, and I feel generally well-respected by the community (in my red state). That said, I know I am lucky to have been in the right place and time to land my job. The job market is really tough, so I don’t like to point out how fabulous the job is when so many people struggle unsuccessfully for years to find a position. Of course, it’s not perfect (what job is?), and some universities are more flawed than others. Those places make for more interesting stories, I suspect. But for many of us, the job of professor is a dream come true. If I were a student now, I would still work hard to try to become a professor, but I would also have a back-up plan for other careers that I know I would also enjoy.",
      "author": "down_home_girl",
      "created": 1592854165,
      "upvotes": 1,
      "replies": {}
    },
    "fvohkfk": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvohkfk/",
      "text": "Google “adjunct crisis”. If you’re not at least a little familiar with hiring, promotion, and job security patterns in higher ed, stop all dreams of an academic career and educate yourself before you take another step down that path. Perhaps you’ve heard (tongue in cheek); professors stay in academia for the same reason people stay in abusive marriages...for the kids. I tell aspiring profs the same thing I do about getting a tattoo...don’t do it. Its highly personal and should never be done because of someone else’s opinion or influence. That being said, I have 16 tattoos and have been a University prof (ft & ad) for 22 yrs. I love my job.",
      "author": "rboller",
      "created": 1592862282,
      "upvotes": 1,
      "replies": {}
    },
    "fvmkdxq": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmkdxq/",
      "text": "Academics are infamous for being pessimistic and (yes) annoying about their jobs. Everything is doom and gloom and frankly it drives me nuts and comes across as incredibly privileged and out of touch when professors (not talking about adjuncts or grad students here) constantly complain about their jobs.",
      "author": "zoozoozaz",
      "created": 1592824012,
      "upvotes": 0,
      "replies": {}
    },
    "fvn54ij": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn54ij/",
      "text": "I think academia is one the best and noble profession.  \nIt is hard  and it takes years, to get a job as Professor. \nYou need to be competent and have a maturity to handle and shape the young minds of your nation.\nEvery job has it’s pro and cons, so does academia.\n\n\nBut, I certainly feel sad for the people who can not realise the POWER a teacher and researcher have!",
      "author": "explorar_libro",
      "created": 1592838015,
      "upvotes": -2,
      "replies": {}
    },
    "fvmfzm6": {
      "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmfzm6/",
      "text": "[deleted]",
      "author": null,
      "created": 1592819717,
      "upvotes": -46,
      "replies": {
        "fvmprx1": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvmprx1/",
          "text": "Couldn't get in, eh?",
          "author": null,
          "created": 1592828534,
          "upvotes": 12,
          "replies": {
            "fvn31yf": {
              "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvn31yf/",
              "text": "25 years in the field.  I retire in 4.",
              "author": "tonymaric",
              "created": 1592836912,
              "upvotes": -1,
              "replies": {}
            }
          }
        },
        "fvqb22x": {
          "link": "/r/AskAcademia/comments/hdnbiv/why_is_academia_such_a_hated_field/fvqb22x/",
          "text": "You clearly have no idea how working in the academia field is.",
          "author": "GuitHarper",
          "created": 1592908244,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}