{
  "sid": "rabbgv",
  "link": "/r/AskAcademia/comments/rabbgv/figures_at_the_end/",
  "title:": "Figures at the end?",
  "text": "Hi! I recently submitted my thesis for examination and the department I am at requested I place all my figures at the end of the chapter they belong in, even after all references. I am in STEM and find this very strange. It also seems incredibly tedious for the examiners to page though 20+pages to see a figure then scroll back to the text. I did it of course but I was wondering if this is normal for other universities or departments and if there is any benefit in doing so.",
  "author": "Cold_Succulent",
  "created": 1638808380,
  "updated": 1639515580,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hnh83bs": {
      "link": "/r/AskAcademia/comments/rabbgv/figures_at_the_end/hnh83bs/",
      "text": "I've seen this for manuscript submissions, too. I believe it stems from a time when colour printing was expensive so they wanted to use as few colour pages as possible when printing to review.\n\n\nIt makes no sense whatsoever these days",
      "author": "DeepSeaDarkness",
      "created": 1638809865,
      "upvotes": 12,
      "replies": {}
    },
    "hnhbtgd": {
      "link": "/r/AskAcademia/comments/rabbgv/figures_at_the_end/hnhbtgd/",
      "text": "Yeah that’s common. Your committee will likely just open two documents on their computer and view the tables while reading the MS, so it’s not really that difficult either way. \n\nHonestly most of the formatting requirements are just formalities. Mine required chapter titles to be all caps, and there had to be a certain number of spaces before the text. That’s super specific stuff that no one cares about, but it’s also easy enough to do so there’s no incentive to change it. I just shrugged and did it too.",
      "author": "WitnessNo8046",
      "created": 1638811318,
      "upvotes": 5,
      "replies": {}
    },
    "hnheqj3": {
      "link": "/r/AskAcademia/comments/rabbgv/figures_at_the_end/hnheqj3/",
      "text": "Formatting around pictures is a huge pain. I have also encountered this for journal submissions. They will make it work.",
      "author": "BronzeSpoon89",
      "created": 1638812456,
      "upvotes": 3,
      "replies": {}
    },
    "hnhh0vn": {
      "link": "/r/AskAcademia/comments/rabbgv/figures_at_the_end/hnhh0vn/",
      "text": "There are multiple conventions and preferences around this for reasons varying from obsolete (color printing on panels) to sensible ( opening the plots doc next to the text). I suggest you just comply with whatever policy is in place and thoughtfully review the policy once you're in a position to do so.",
      "author": "pyrola_asarifolia",
      "created": 1638813345,
      "upvotes": 3,
      "replies": {}
    },
    "hni71zy": {
      "link": "/r/AskAcademia/comments/rabbgv/figures_at_the_end/hni71zy/",
      "text": "It's pretty typical for manuscript drafts in my area of STEM.",
      "author": "Eigengrad",
      "created": 1638823512,
      "upvotes": 2,
      "replies": {}
    },
    "hnhb6gv": {
      "link": "/r/AskAcademia/comments/rabbgv/figures_at_the_end/hnhb6gv/",
      "text": "Like the man said about marriage \"You can be right, or you can be happy, but not both.\"  Someone, somewhere needs it in that format for a reason we cannot know without more effort than it is worth.",
      "author": "AliasNefertiti",
      "created": 1638811071,
      "upvotes": 3,
      "replies": {}
    },
    "hni9nqj": {
      "link": "/r/AskAcademia/comments/rabbgv/figures_at_the_end/hni9nqj/",
      "text": "Everybody has good points here. I've also seen it done so that the figures don't count against the page limit for a submission.",
      "author": "AgentFuzzButt",
      "created": 1638824505,
      "upvotes": 1,
      "replies": {}
    }
  }
}