{
  "sid": "qzyhdl",
  "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/",
  "title:": "Is Academia really as bad as it can be made out to be?",
  "text": " \n\nIs there any benefit to going into academia? I stumbled across this sub a few weeks ago and had been browsing popular posts and comments that all appear to highlight the negative aspects and stresses associated with an academic career.\n\nFor context, I’m an Australian that completed my undergraduate at the end of last year and have been working clinically in my sport and exercise role for almost 12 months but have been very keen on getting into academia via masters by research or mPhil with either a subsequent or upgrading masters to PhD (either in public health, cancer research in relation to exercise or more specific. (Honours is not a financially viable route fo me). \n\nI have tried to start transitioning into the space with some other projects and research assistant work on the side but reading through some of these experiences have really given me some cause for concern about my desired career choice.",
  "author": "My-Dad-Left",
  "created": 1637622134,
  "updated": 1639841841,
  "over_18": false,
  "upvotes": 119,
  "upvote_ratio": 0.96,
  "comments": {
    "hlpeumo": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlpeumo/",
      "text": "We mostly come here to whine and seek advice when in trouble, like others have said, don't take what you see here as our daily life.\n\nIf you are interested, I'd say pursue a master's, its 1 or 2 years (depending on where you do it), you'll get to do research, the skills can be easily transferable to regular jobs, and you'll be able to decide if you want more or not.\n\nI decided to pursue my PhD with the certainty that I want to do science until I grow old and retire. I really like what I do. However, as years passed, and this is my 6th year in academia (2y masters, 4y phd), I now that I want stability and comfort more than I love science. My area, unfortunately, does not have as many options as in the past, plus there is zero possibility of me finding a research-only position, everything is mostly focused on teaching, which I really dislike. This made me \"broaden my view\", and I started to look \"the other world\", of regular jobs, industry and whatever.\n\nBasically, this rambling is more to say that No, life isn't as bad as it seems, and Yes, you might enter a MSc. or a PhD and you might change your mind due to whatever reason, and that's okay too, won't mean that your MSc. or PhD was a complete waste of time/money, really.",
      "author": "math_chem",
      "created": 1637625983,
      "upvotes": 94,
      "replies": {
        "hlporkw": {
          "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlporkw/",
          "text": "> or PhD was a complete waste of time/money, really.\n\nThis really depends on your field, though.",
          "author": "valryuu",
          "created": 1637630698,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "hlp7fiu": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlp7fiu/",
      "text": "At its best, academia can be a wonderful career, tenured professors at research universities have an enviable level of autonomy in deciding the kind of research they wish to pursue. However, such jobs are increasingly rare, and unless you happen to be in a field with a rich source of non-academic alternatives, there is often a very high risk to pinning all your hopes on securing one of these increasingly rare positions.",
      "author": "mleok",
      "created": 1637622600,
      "upvotes": 122,
      "replies": {
        "hlrvek1": {
          "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlrvek1/",
          "text": "Is it hard to work in academia, as in professorship? I heard from others that the first 10 years of academia as professorship will be the hardest part of academic life and am wondering about this as I always thought it will be easier after doing my PhD",
          "author": "SpaceAuk",
          "created": 1637679618,
          "upvotes": 3,
          "replies": {
            "hls9kfj": {
              "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hls9kfj/",
              "text": "Yes and no.  It's really hard to compare as the stressors differ a lot.  On one hand you have a lot more financial stability as a prof (although if you live in a high cost of living area you likely will not be able to buy and you often have family to pay for). On the other the work stress is in an entirely different plane of hell: being responsible for a whole lab is incredibly stressful.  Teaching workload is miles beyond anything you've experienced as a student, purchasing equipment and finances, dealing with HR, and departmental BS. It's honestly overwhelming and what breaks you is realizing there is no reasonable way for a single human to do it without having to half ass something.\n\nThe question I ask myself daily is: \"what thing can I put off today that will not result in hurting someone?\". Being a PhD student often means worrying about yourself a lot,  being a faculty member means you're responsible for hundreds.",
              "author": "ke_marshall",
              "created": 1637685482,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hlpqr1m": {
          "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlpqr1m/",
          "text": "My father quit pursuing his masters in US History in the early 80s. He was sickeningly close to completing that degree, but he says he was actively discouraged by members of the department because job competition was so fierce. \n\nStill, while not an immediate pay off, that degree could have changed mine and my family's life. My family could have moved out of our dilapidated house and this ultra racist neighborhood. I could have gone to a better school, been established in a career by now. Instead he was unemployable essentially his entire adult life.",
          "author": "cherryscar",
          "created": 1637631623,
          "upvotes": -47,
          "replies": {
            "hlpxflx": {
              "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlpxflx/",
              "text": "I don't want to minimize the weight of your and your family's experience, but this isn't really relevant to the topic at hand. An MA in US history won't get you an interview at most community colleges these days. High school, with extra course work for teaching credentials? Sure. But OP was asking about academia, which requires a PhD. An MA is less than a quarter of the work to get a PhD, and even when you're done with that you'll probably be looking at a couple years of postdoc or VAP before landing that TT job, if you do.",
              "author": "pipkin42",
              "created": 1637634724,
              "upvotes": 63,
              "replies": {
                "hlq30xe": {
                  "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlq30xe/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1637637375,
                  "upvotes": -17,
                  "replies": {
                    "hlq3nw4": {
                      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlq3nw4/",
                      "text": "If you get this angry over a reply from someone on the internet, I think maybe you should get off and take a breather.",
                      "author": "NotJustAPebble",
                      "created": 1637637684,
                      "upvotes": 26,
                      "replies": {
                        "hlq46rb": {
                          "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlq46rb/",
                          "text": "Not angry, wrong again, gg feeding a troll",
                          "author": "cherryscar",
                          "created": 1637637936,
                          "upvotes": -52,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlpeti0": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlpeti0/",
      "text": "Of course. If you can get an academic career and you enjoy research and teaching, then it can be very fulfilling. There are also definite perks to the job, such as having more control over your schedule than most others.\n\nThe problem though is that there just aren't very many jobs and most people who go to graduate school and dedicate 5-7 years of their life to it will never find stable, longterm employment as academics. For context, from what I've heard my field has something in the realm of 500 applicants per job, and there are about 100 or so jobs posted each year worldwide. Some fields fare better than others, but regardless your odds aren't great. These jobs are also disappearing as tenure gets eroded and universities rely more and more on poorly compensated adjuncts and lecturers that lack stable and reliable employment.\n\nIt is also a job that requires pretty major sacrifices that many other careers don't. You more or less have to give up control over where you live. With so few jobs, you go wherever you can find employment, and it's not uncommon for people to end up in tiny college towns with little to recommend them. There's also the years of graduate school and then usually several more years (sometimes upwards of a decade) of bouncing between short-term adjunct and visiting professor gigs. So there's a real possibility you won't really settle down until your late 30s or early 40s, which for many is a dealbreaker, especially if they have partners or an interest in starting a family. Lastly, the pay just isn't comparable to industry.\n\nSo there is good and bad about academia. But the criticisms and complaints about academia are all, I think, valid ones. It isn't a good time to be an early career or aspiring academic, to say the least.",
      "author": "BandiriaTraveler",
      "created": 1637625969,
      "upvotes": 37,
      "replies": {
        "hlrmjqn": {
          "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlrmjqn/",
          "text": ">It is also a job that requires pretty major sacrifices that many other careers don't. You more or less have to give up control over where you live. With so few jobs, you go wherever you can find employment, and it's not uncommon for people to end up in tiny college towns with little to recommend them. There's also the years of graduate school and then usually several more years (sometimes upwards of a decade) of bouncing between short-term adjunct and visiting professor gigs. So there's a real possibility you won't really settle down until your late 30s or early 40s, which for many is a dealbreaker, especially if they have partners or an interest in starting a family. Lastly, the pay just isn't comparable to industry.\n\nThese are all the reasons I've decided I will aim for industry after graduating. I don't mind throwing my name into the ring for competitive applications. The academic route is just so impractical if you can find fulfillment elsewhere or have an incompatible vision of what you want your life to look like.",
          "author": "jabroniiiii",
          "created": 1637675464,
          "upvotes": 6,
          "replies": {
            "hlrwjfg": {
              "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlrwjfg/",
              "text": "In the same position. Sending some applications out next cycle to places I’d actually want to live (though I prefer teaching to research, so I’m sending them to uncompetitive places as well). The prospect of living my entire life in a small college town as a single gay person was too much.",
              "author": "BandiriaTraveler",
              "created": 1637680117,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hlpxcgs": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlpxcgs/",
      "text": "If you really love your field and cannot imagine doing anything else but contribute to the scholarly understanding of it for the rest of your life, then it's a good fit. If things like a good work-life balance and fair compensation are important to you, it's not the best. It's also not the only career to suffer from this, but the expectations can get demotivating when you see that the rewards are mostly from self-fulfillment.",
      "author": "gratefuluwu",
      "created": 1637634683,
      "upvotes": 15,
      "replies": {}
    },
    "hlq9gec": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlq9gec/",
      "text": "So Academia seems very momentum based - so if uou have momentum it's probably really good. If you don't have momentum, things seem to go to shit.",
      "author": "Playful-Deal9249",
      "created": 1637640578,
      "upvotes": 10,
      "replies": {
        "hlsojl7": {
          "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlsojl7/",
          "text": "And it's hard to get that momentum back, too.",
          "author": "valryuu",
          "created": 1637691254,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlpbvdb": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlpbvdb/",
      "text": "We come to Reddit to whine. Don't worry about it.",
      "author": "molobodd",
      "created": 1637624607,
      "upvotes": 34,
      "replies": {}
    },
    "hlprfwr": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlprfwr/",
      "text": "Keep in mind that most people in here are in the US and Canada, and it sounds like there's a lot of differences to academia in Australia. It's highly paid in Aus, I don't think we have \"tenures\" and it's more contract based, some fields probably have great career opportunities (like what you're looking at in health). I've heard Australia is one of the best countries for academia.\n\nI started a research masters (social sciences) in Sydney, then decided it wasn't for me, but mostly because of burnout and mental health and attempting it directly after a very long stressful undergrad experience. I liked the environment in the master's, the people I met, plenty of scholarships available, and it would've greatly increased my job opportunities if I continued with it. Are there specific jobs you want that require post-grad/research qualifications? Or for moving up in your current work?\n\nAlso keep in mind that anywhere on the internet, for any topic, people are more likely to post when they need support or they're having a bad time. People who are loving academia aren't necessarily on here asking questions about what a good time they're having. So the perspective is a bit biased.",
      "author": "wildclouds",
      "created": 1637631943,
      "upvotes": 12,
      "replies": {
        "hlrfj7j": {
          "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlrfj7j/",
          "text": "> I've heard Australia is one of the best countries for academia.\n\nAussie here who left academia post-PhD for industry - I would be wary of this statement. Yes, getting a fulltime academic position in Aus (either in research, teaching or hybrid) is probably more secure than in the US, but these jobs are still few and far between and notoriously hard to get still. \n\nPay is certainly good (factoring in cost of living which has only increased due to the housing and rental markets) but for many academics in Aus unis, the reality is most will be adjuncts on short-term contracts or casual researchers chasing the elusive lecturer positions to get a foot in. And most will not succeed.\n\nFor some stats about the higher education crisis in Aus right now:\n\n- [40,000 university jobs have been cut in 2021](https://www.abc.net.au/news/2021-09-13/covid-job-cuts-at-universities-prompting-fears-for-future/100447960), driven by Covid-19 and the fact that Australian universities rely on international students. Many of the cuts were full-time and permanent positions as well as casual/fixed contract.\n\n- Restructures have been occurring in most of the R1 and R2 universities pretty consistently in the past 5 years.\n\n- [Approximately 10,000 PhDs graduate in Australia every year, with as many at 65K PhD students enrolled in Australian Universities at any one time.](https://theconversation.com/its-time-to-reduce-the-number-of-phd-students-or-rethink-how-doctoral-programs-work-68972) And there about 50K staff employed in full-time or fixed-term positions for the entirety of the Australian academic workforce. \n\n- [In Australia, around 51% of PhDs go into industry and the numbers leaving academia are increasing](https://algorithm.data61.csiro.au/where-are-australias-phd-students/). \n\n- In 2013, [less than 5% of Australian casual academics were paid to do research](https://melbourne-cshe.unimelb.edu.au/__data/assets/pdf_file/0009/2564262/2016-contingent-academic-employment-in-australian-universities-updatedapr16.pdf) (not teaching roles), despite the fact that casual academics make up most of the academic workforce in Australia. \n\n- The current Federal Government isn't exactly known for being supportive of R&D or the educated. [Australian Universities were exempt from jobkeeper in 2020 and 2021](https://theconversation.com/should-i-stay-or-should-i-go-academics-facing-this-dilemma-should-ask-themselves-3-questions-166750), adding enormous pressure to said casual staff and those on short-term contracts.\n\nI always advise that if you aim to get into academia long-term, Australia or not, you will need back up plans. Because unfortunately, you will probably have to use them.",
          "author": "Neyface",
          "created": 1637671570,
          "upvotes": 5,
          "replies": {}
        },
        "hlqlmfj": {
          "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlqlmfj/",
          "text": "We have tenure in Australia, though it’s getting harder to obtain. I’m tenured at a G8 University.",
          "author": "ELI-PGY5",
          "created": 1637647835,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hlr067o": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlr067o/",
      "text": "Selection bias. If a venue is largely used for venting those who don't want to vent won't be as active.\n\nSure, academia as a sector has problems across the western world. And probably elsewhere. Other sectors do, too, of course. There's a specific set of problems around the unresolved and quite uncomfortable question of valuing higher education as a public good. Etc. \n\nOn the other hand, a lot of people care enormously about scholarship, knowledge production & transmission and the whole stuff that goes with it. \n\nYou seem to be in a highly practical field, with workplace experience and goals that are also pragmatically oriented - that's a good approach as it is lower risk. Whenever something doesn't work out (and that will happen to you, as it does to most people) you'll have alternatives. The problems tend to become more acute for people who put everything into a purely academic career in a discipline that is either highly competitive, or that is so undervalued that a lot of people end up in terribly paid contingent roles. \n\nOf course, even those who fully succeed may end up unhappy in their role because of the aforementioned inner contradictions, or particularly toxic institutions, or other afflictions that relate to academia more than to other fields.",
      "author": "pyrola_asarifolia",
      "created": 1637659397,
      "upvotes": 4,
      "replies": {}
    },
    "hlps5th": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlps5th/",
      "text": "Mid-career humanities academic here. I hear lots of horror stories, and I know a few really good people who've had terrible luck in the job market, but of the people I was at grad school with more than half ended up with decent jobs eventually. Some of them got bounced around for a couple of years between fellowships or visiting position, or had to move to really out of the way places, but they seem pretty happy. For tenured academics in my field, salaries are reasonably comfortable, you have lots of free time, and the work is generally pretty interesting.\n\nOne big caveat to all the above is that I went to a top 10 program in the US with a decent placement record, and made a point of working with an advisor who had a good reputation for getting his students jobs. Another caveat is that I think I'm temperamentally suited to the academia insofar as I'm pretty gregarious, I've got a fast mouth, and I'm flexible about what I work on, all of which helped a lot. A huge amount of humanities academia comes down to networking and positioning of your research, and that's something a lot of people don't realise until it's too late.",
      "author": "Doglatine",
      "created": 1637632276,
      "upvotes": 10,
      "replies": {
        "hlqbew3": {
          "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlqbew3/",
          "text": "As an academic advisor in a criminology and sociology department (along with humanities), this is spot on.",
          "author": "MotherHolle",
          "created": 1637641633,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlqhsud": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlqhsud/",
      "text": "The money sucks, the workload sucks, the admin sucks, the struggle for support sucks. The Darwinian struggle to get to the top sucks.\n\nBut man, when it pays off, its worth it.",
      "author": "Life_time_learner",
      "created": 1637645378,
      "upvotes": 3,
      "replies": {}
    },
    "hlqju5j": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlqju5j/",
      "text": "When you make it through all the hoops, then it's probably the best job in the world. I couldn't think of anything I'd rather do.\n\nSome benefits:\n\nPursue a topic to your heart's content\r  \nCuriosity and discovery\r  \nPerpetual challenge\r  \nTest your limits\r  \nFreedom: what, how and when\r  \nLearning all the time\r  \nTeaching and mentoring\r  \nSeeing interesting places/ nature & traveling\r  \nMeeting cool people\n\nAll summarized here in a video: [https://youtu.be/JN6ybXFIxSo](https://youtu.be/JN6ybXFIxSo)",
      "author": "Matthias_Rillig",
      "created": 1637646665,
      "upvotes": 3,
      "replies": {}
    },
    "hlqwnnr": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlqwnnr/",
      "text": "There's a lot of angles to this, so here goes.\n\nAcademia has a huge number of deep and entrenched issues, some of which are getting substantially worse with time. THe commoditisation of education goes strongly against the ethics of many of us, which puts us in direct conflict with the senior management (and direction of travel) of our organisations.\n\nThe casualisation of staff has become a growing issue; universities have realised they can basically offer terrible working conditions and short contracts because there are so many people willing to work in them they will take crap pay and conditions.\n\nThe vast changes in working conditions and organisational structure have led to a lot of very bad advice being given out over the last 15 years or so, by senior colleagues who have no appreciable grasp of what the current environment looks like.\n\nGetting into academia has huge opportunity cost associated with it. You are outside the main workforce for a long time, and you are often expected to move geographically. THat can separate you from your support networks, and make the entire thing hard work. You might ahve to do that multiple times.\n\nAnd being an academic expects you to be great at a huge variety of things. Not quite astronaut level, but getting there. YOu have to be able to come up with novel research ideas, build them in to projects, write fundable grant documents, and then either carry out the research or build a manage a team that can. You often have to be able to work collaboratively, as well as on your own. You need outstanding time management. You have to be able to teach, and mentor. You need a solid grasp of your area of specialism such that you can justifiably call yourself a world expert on it. You need to be able to engage with committee work running your department, faculty, university, academic societies, journals and so on. You need to be able to write academic papers to a publishable quality. Understandably, no-one (or at least very few people) can excel at all of these things. That leads to conflict, disappointment, and frustration.\n\nAcademic jobs can be wonderful. You can get a level of autonomy unheard of almost anywhere else. You get to work on exciting problems, and solve real issues for the world. \n\nBut academia is not a monolith. Different institutions, and even different schools and departments within the same institutions can have vastly different cultures. Some can be supportive and open and wonderful. Others can be closed, back-stabbing and toxic. MAny are just ineffectual and insular. This depends strongly on who the staff int eh department are, and how they engage with one another. Culture can be changed with relatively small changes in staff. Academia *can* select for people who like working on their own, don't enjoy social interaction, or people who feel they are better than those around them. Those are unpleasant traits to put in high concentrations. I've been fortunate to never work in departments led by these kinds of individuals, but I've certainly come across them. Interestingly, they overwhelmingly populate the old white man chaired professor tier (and are not even a majority there). So I have hope for the future.\n\nOn the other end of the scale we sometimes find ourselves dealing with a variety of student issues. Whether it's undergrads with an absurd sense of entitlement, postgrads who have not grasped what a research degree is supposed to be about, or ourselves or colleagues who are shit or struggling at one or multiple parts of the job (see earlier paragraph).\n\nThe most important thing going forward is that people go into this route with their eyes wide open. A career in academia is - these days - as much down to luck as it is perseverence. Did your project happen to hit on a timely and important finding? Was your paper published before the competing group? Did your grant go into a sympathetic panel, or get a reviewer who liked your work? Did the job opening come up when you were about to hit the market? Was the job opening in your particular niche? Was it in a geographical area you were able to move to? \n\nIt is not all sunshine and rainbows. Similarly, it's also not all the colossal honking pile of dogshit that it can be made out to be. But it also varies by place, by time, by field, and by how you approach it.",
      "author": "OrbitalPete",
      "created": 1637656316,
      "upvotes": 5,
      "replies": {}
    },
    "hlq651b": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlq651b/",
      "text": "I literally love my job. Are there shitty parts? Yes.",
      "author": "TourmalineTart",
      "created": 1637638897,
      "upvotes": 4,
      "replies": {}
    },
    "hlpsx95": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlpsx95/",
      "text": "People like whining.",
      "author": "yeetinghumanslmao",
      "created": 1637632628,
      "upvotes": 3,
      "replies": {
        "hlq9bnu": {
          "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlq9bnu/",
          "text": "Absolutely. See: 90% of content on the internet.",
          "author": "Stupid_Mathematician",
          "created": 1637640509,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlpouoz": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlpouoz/",
      "text": "Yes, it's that bad.",
      "author": "valryuu",
      "created": 1637630738,
      "upvotes": 3,
      "replies": {}
    },
    "hlppn7e": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlppn7e/",
      "text": "I can be. But it can also be the opposite.",
      "author": "Beakersoverflowing",
      "created": 1637631112,
      "upvotes": 3,
      "replies": {}
    },
    "hlqe5z1": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlqe5z1/",
      "text": "It’s terrible. I wish I had done literally anything else.",
      "author": "mglalala8",
      "created": 1637643188,
      "upvotes": 2,
      "replies": {}
    },
    "hlpv1vo": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlpv1vo/",
      "text": "Depends. If you are in STEM, get your PhD and postdoc from Ivy League and are in very good personal terms with both your advisors…..you will find tenure prof jobs easily. The further you are from this optimal condition, academic career will be more difficult.",
      "author": "ehossain",
      "created": 1637633603,
      "upvotes": 1,
      "replies": {}
    },
    "hlpn4xw": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlpn4xw/",
      "text": "I think you won't know until you give it a try. I am enjoying doing my PhD at the moment, but have been discouraged by how my university treats sessional academics. You could continue your work clinically and then transition more if you like it.",
      "author": "goonbag29",
      "created": 1637629921,
      "upvotes": 1,
      "replies": {}
    },
    "hlq4vxe": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlq4vxe/",
      "text": "If you get into a top program and have an excellent network you can land a job doing research that you love and have a lot of autonomy during your day. There is also an opportunity to change a lot of student's lives for the better and to make a difference in the world.\n\nGetting a Ph.D. is not fun. You'll be working around 60 hours a week but only getting paid for 20 hours a week. You'll likely be doing a lot of your advisor's research but getting less credit than you deserve. Again, taking recourse in academia against a TT advisor is basically impossible.\n\nGetting a Ph.D. is not fun. You'll be working around 60 hours a week but only getting paid for 20 hours a week. You'll likely be doing a lot of your advisors research but getting less credit than you deserve. Again, taking recourse in academia against a TT advisor is basically impossible.\n\nMost Ph. D.s either don't get tenure track offers and have to work as adjuncts for far less than a living wage or get TT jobs with a very heavy teaching load on top of a very demanding research schedule. Academia is also notoriously toxic. Retaliation is common and there is basically no recourse for a toxic coworker with tenure like there is in the normal job market.",
      "author": "opened_padlock",
      "created": 1637638278,
      "upvotes": 1,
      "replies": {}
    },
    "hlqv0ce": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlqv0ce/",
      "text": "There is not a day goes by that I don’t regret my decision to study for a PhD in Politics, which I feel has greatly impaired my overall career potential, earnings potential and continues to drag me down like a giant millstone around my neck.\n\nI applied for 130 lectureship over a three year period without so much as an interview (despite having won RCUk funding for a PhD and postdoc, and published in leading journals). Eventually I had to write the entire period off, with no benefit for my subsequent life whatsoever. It closed down opportunities I may once have had in the general graduate job market and has permanently set my life back IMO.\n\nMy advice is simply not to do a PhD under any circumstances.",
      "author": "wj_gibson",
      "created": 1637654921,
      "upvotes": 1,
      "replies": {
        "hlr9s6e": {
          "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlr9s6e/",
          "text": "Sorry to hear this. Solidarity. I'm a tenured UK lecturer and I feel the same. All my former work colleagues are now running the world earning lots of money and I'm stuck teaching ungrads who hate me!",
          "author": "schumpter81",
          "created": 1637667651,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlqb933": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlqb933/",
      "text": "I work as an academic advisor at a university where I was also an undergraduate and graduate student and love it. Yes, there can be drama, and yes, upper admin can be annoying, but a lot of that can be ignored in the end. The students are what matter most.\n\nAlso, contrary to what people say, there are actually plenty of jobs if you network and are willing to look around, and depending on your field. My university has multiple openings for faculty lines. I wouldn't trade my job for many others.",
      "author": "MotherHolle",
      "created": 1637641543,
      "upvotes": 1,
      "replies": {}
    },
    "hlqrnwt": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlqrnwt/",
      "text": "I'd really emphasize keeping in mind: there's possibly no point asking about the \"average\" quality of an academic career. The distribution is more bimodal with spread - either a really shit cog-in-the-wheel job with idealistic aspirations / delusions of grandeur, or King of My Castle with personal minions or ridiculous privilege. It seems (at least in some places) like the middle ground of just a basically interesting, fulfilling academic job, where you're not being jackbooted-in-the-face by workload and moral injury, is thinning out.\n\nSo for any particular individual: you need to determine whether you're a rising star with all the needed support, or not, and make the smart decision accordingly.\n\nEdit: And if you don't know how or when to determine that: be aware you're starting with a handicap. But I think the natural point to jump away from academia is like one or two years max after getting the PhD, if at that point you're not on a clear trajectory to the \"haves\" side of the distribution. That used to be the pretty explicit rule when I was doing my PhD - you get the first big grant or you get out. It was harsh but actually more merciful than breadcrumbing a bunch of doomed post-docs/precarious-contract lecturers.",
      "author": "waterless2",
      "created": 1637652216,
      "upvotes": 1,
      "replies": {}
    },
    "hlqtomk": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlqtomk/",
      "text": "Nahh it’s a great job. You work to your own timetable, there is often minimal time spent at a desk, you get to be creative and explore things that interest you, you’re constantly learning. When all is going well It’s like being paid for a hobby. \n\nI’d recommend a masters by research if you want to test it. You’ll do an intense 6-12 month project in a real lab giving time to get immersed in academic culture.",
      "author": "L-selley",
      "created": 1637653819,
      "upvotes": 1,
      "replies": {}
    },
    "hlr28wy": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlr28wy/",
      "text": "Yes.",
      "author": "angtsssv",
      "created": 1637661244,
      "upvotes": 1,
      "replies": {}
    },
    "hlr2p4h": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlr2p4h/",
      "text": "Yes",
      "author": "GabhaNua",
      "created": 1637661655,
      "upvotes": 1,
      "replies": {}
    },
    "hlr8ejj": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlr8ejj/",
      "text": "I left an academic research job (in the UK) this year for a public sector job and I have no regrets, but I wouldn't say academia doesn't have its benefits. I found the work environment very free in terms of being able to set my own hours with very little oversight, and being able to have good conversations (both intellectual and frivolous) with anyone in my department, regardless of seniority. There was a genuine sense that *people* valued the quality of each other's ideas and work over their qualifications of job title. I stress *people*, because the organisational structures really didn't reward good ideas and good work. But I felt valued by the people around me, and that counts for a lot.\n\nIt's also good for the ego. I enjoyed telling people I worked for a good university. I enjoyed publishing journal papers. The organisation I work for now is very well-liked, but working there isn't seen as a marker of intellectual achievement in the same way that working for a good university is.\n\nI loved travelling internationally and speaking at conferences. I think things might be changing now with a justifiable move towards limiting environmental impact, but I got to experience the ridiculous excess of travelling across the world to basically do 20 minutes' work, and I loved every moment. That's very unlikely to happen in my new job.",
      "author": "EmileDorkheim",
      "created": 1637666579,
      "upvotes": 1,
      "replies": {}
    },
    "hlr8o6t": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlr8o6t/",
      "text": "I’ve worked in academia, then industry (law firm) then back in academia. \n\nThe pay was better in industry. HR was much better in industry.\n\nThe flexibility/time off, freedom to pursue your own interests is much better in academia.\n\nAll academics have is their prestige and they often take it to heart, so any imposition on their “intellectual freedom,” whether it’s following labor laws for students, having to fight for scarce funding, or being asked to do anything that might be slightly an inconvenience (mentor training, diversity training, accessibility training), is seen as the worst thing in the world, ever.\n\nHuge group of demanding people with vocational awe. And I worked with tax attorneys and litigators for 15 years who were never that bad.\n\nDon’t listen to the whiners. Go for it!",
      "author": "CardboardChewingGum",
      "created": 1637666794,
      "upvotes": 1,
      "replies": {}
    },
    "hlra44r": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlra44r/",
      "text": "If you make it, it can be absolutley incredible, giving you a sense of leading a meaningfull and deeply rewarding life by doing and sharing what you are passionate about. I mean perhaps 80% of the people absolutley hate or can barely tolerate what they have to do to make a living, always longing for the next day off, only really living for the next holidays or retirement and thats the first world. \n\nYou are heard, appreciated and respected by your peers (except of course if you are an asshole and/or incompetent, but nobody respects those people regardless of the job) instead of screaming on social media into a void of idiocy and indifferance just hoping that your voice gets heard by people you don't know. You can travel the world and meet fascinating people all the time. You are expected to be very self-sufficient, nobody really tells you what to do and the list goes on.\n\nIt is only natural that these kinds of rewards are not easy to attain. It is like becoming a musician or artist, the risk/reward-ratio is quite comparable nowadays as ridiculous as it may sound. \n\nOf course if you are out of luck the job can be extremely miserable but don't make the mistake of thinking that reddit is representative of life in academia. Frankly, those who made it are busy publishing, researching and teaching, not posting on social media.",
      "author": "ordash",
      "created": 1637667903,
      "upvotes": 1,
      "replies": {}
    },
    "hlrdvd8": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlrdvd8/",
      "text": "Let's just say, after finishing my PhD last year, I'm not really looking for jobs in academia, and am glad that I already have an enjoyable and well-paid job (which I kept doing while finishing my PhD). For me, moving into an academic career would very likely mean taking a pay cut.\n\nBut, as others have said here, and as my own story suggests, there's nothing wrong with pursuing advanced degrees, and then deciding whether or not to try to build a new career on them.",
      "author": "jamey1138",
      "created": 1637670529,
      "upvotes": 1,
      "replies": {}
    },
    "hlrl5r4": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlrl5r4/",
      "text": "Most of the comments here are from US academics. Australia has a different approach, albeit many of the overall complaints would be similar. \n\nIf the field of medical science, whether you are interested in Academia or not, postgrad degrees and a research background is beneficial. So don't decide just yet; study your area of interest and then seek opportunities with academia being one of them.",
      "author": "ourldyofnoassumption",
      "created": 1637674746,
      "upvotes": 1,
      "replies": {}
    },
    "hlry9jy": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlry9jy/",
      "text": "Get into the academia without leting the academia get into you. See it as a job - you'll do your best but shouldn't be forced to deal with harassment and your results don't reflect your worth as a human being. Then you'll be okay.",
      "author": "L1undrei",
      "created": 1637680864,
      "upvotes": 1,
      "replies": {}
    },
    "hls2w47": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hls2w47/",
      "text": "I came to academia after a full career in industry. Personally I love it and wouldn't have done it any other way. But others jump into academia right from the get-go and love that too. They're definitely different (industry  and academia) with different goals and pressures, but personally I haven't found either one to be as bad as people on the \"other side\" fear they might be.",
      "author": "iugameprof",
      "created": 1637682769,
      "upvotes": 1,
      "replies": {}
    },
    "hlstxc8": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlstxc8/",
      "text": "My PhD program experience: I was harassed, assaulted and stalked by a member of the lab. When I finally got up the nerve to tell PI (I knew she would react poorly) she told me I was the problem and kicked me out. \n\nThis PI as also the faculty sponsor of our women in science group. \n\nOthers reached out to me afterward to share similar experiences. And some others reached out to say they had experienced similar, but would not report it after seeing how I was treated. \n\nPI was also our Graduate Studies head for the department. \n\nTh dean also had nothing to say when I went to see her about it. This was AFTER being recruited (hard) to sit on a special committee of hers for retention of women in science, which I did. \n\nI left with an MS. \n\nI still think about going back to get my PhD, how f’d is that?",
      "author": "2k21Aug",
      "created": 1637693338,
      "upvotes": 1,
      "replies": {}
    },
    "hlxazzk": {
      "link": "/r/AskAcademia/comments/qzyhdl/is_academia_really_as_bad_as_it_can_be_made_out/hlxazzk/",
      "text": "Don’t do it",
      "author": "meanmissusmustard86",
      "created": 1637775342,
      "upvotes": 1,
      "replies": {}
    }
  }
}