{
  "sid": "ra796o",
  "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/",
  "title:": "Has anyone tried taking a non-thesis masters track and was gunning for a proper MS degree/pursue PhD? How was the experience?",
  "text": "So my plan was to apply to MS programs abroad and if I am rejected, I will probably just apply to a non-thesis track to a local university just to get some units and get a master degree. However after that, I also plan on taking a proper thesis MS track or I will probably apply to a PhD program. What do you think? \n\nThe degree I am talking about is biology. I just want to take the non-thesis track so I can be eligible to teach tertiary education.",
  "author": "Deus_Sema",
  "created": 1638797208,
  "updated": 1639515585,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hngwv9o": {
      "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hngwv9o/",
      "text": "I did a PSM in Biotechnology, though my alma mater still calls it a nonthesis MS in Biochemistry & Molecular Biology.\n\nIt was 20 hours of science (almost all cross-listed BIOC/BIOL), 12 hours of professional development, and a 4 hour research internship at a university lab. I could've done an industry internship as well, and probably should've in hindsight. I intentionally chose professional development that overlapped with an MBA, so all I had to do was get \\~21 more credits to earn an MBA in Business Studies since I could sub in one of my existing 3 hour science credits. Took me 3 years, left with 2 masters.\n\nI'm currently a biology adjunct. One thing to watch out for is SACS accreditation. It will only let you teach if you have 18 hours in that subject. I'm currently getting more A&P credits to do just that.  \n\n\nYou might check with your Department, see if there's any disclaimers about hour transfer limits to PhDs from nonthesis. I know I was able to apply for PhD (and was asked to by the internship PI), but there would've been some sort of limitation on what carried over.",
      "author": "Pox_Americana",
      "created": 1638805374,
      "upvotes": 2,
      "replies": {}
    },
    "hniotc1": {
      "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hniotc1/",
      "text": "I would not do this. Most PhD programs and many thesis MS programs want to see research experience. A non-thesis degree will not give you more of this. We have a non-thesis in my department, and these students don't qualify for TAs and would pay tuition. This is fairly typical of non-thesis programs. You get more debt. If you're looking to boost your GPA for med school or something, perhaps this is worth it. Otherwise, it is likely not.\n\nThe other thing I would check on is if a non-thesis degree will qualify you to teach at a college. We sometimes hire on our former Master's students to teach lab sections over the summer when the grad students are off doing their fieldwork. But we cannot hire a person with a non-thesis Master's, per the university. They technically meet the number of hours for an instructor per our accrediting board, but universities can put additional restrictions on who can teach, and many do.\n\nIf you think you're going to apply for grad school, you'd be better off looking for post-bac research, getting an internship, or working.",
      "author": "StorageRecess",
      "created": 1638830493,
      "upvotes": 2,
      "replies": {
        "hnj2r5y": {
          "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hnj2r5y/",
          "text": "What if I apply to a second MS with thesis?",
          "author": "Deus_Sema",
          "created": 1638836553,
          "upvotes": 1,
          "replies": {
            "hnj5oiu": {
              "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hnj5oiu/",
              "text": "I understood that context from your post. I think you need to examine what you want out of these degrees. Many universities will not admit a student who has a Master’s degree in the same field, even if it is non-thesis because of credit hour overlap. \n\nBeyond that, it would look really, really weird. If someone wanted to do a research Master’s but first absorbed a ton of debt for a non-thesis Master’s, I would question their judgement. In my field (biology), unless you’re jumping between sub fields radically, this would probably sink your application for the thesis Master’s or PhD.",
              "author": "StorageRecess",
              "created": 1638837879,
              "upvotes": 1,
              "replies": {
                "hnjg6z2": {
                  "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hnjg6z2/",
                  "text": "I plan on taking Master in Biology or Biology Education(not decided yet) since both are non thesis. Then I plan on taking MS in Biotech or Mol Bio/Biochem (this was the goal in the first place). I was only considering the non thesis since I need to take some credits while I am stuck in my work. If I gotta do what I want (the MS Biotech) then I need to resign. I won't have funds for it.",
                  "author": "Deus_Sema",
                  "created": 1638842491,
                  "upvotes": 1,
                  "replies": {
                    "hnlz1sq": {
                      "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hnlz1sq/",
                      "text": "Apply for the program that is genuinely best for your life goals. False expedience will cost you more in the end.",
                      "author": "IkeRoberts",
                      "created": 1638895169,
                      "upvotes": 2,
                      "replies": {
                        "hnm62fj": {
                          "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hnm62fj/",
                          "text": "If I take the research one, I'd have to quit the job. I still need my high school teaching job to feed family and I have enough money to do a non thesis masters alongside. Besides I am kinda pressured to do masters since I work in a prestigious school and they gotta maintain standards. I wanna do my masters, then save up enough to jump into other jobs where I can do my preferred degree, or find scholarship once my family can sustain themselves without me(or at least when one family member heals). It is hard having this thought and I know this isn't my top choice assuming im in the perfect condition but yet here I am. :(",
                          "author": "Deus_Sema",
                          "created": 1638898291,
                          "upvotes": 1,
                          "replies": {
                            "hnn27e5": {
                              "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hnn27e5/",
                              "text": "It is a difficult situation. Feeding the family is an important life goal as well.\n\nThe non-thesis masters will likely be most valuable for advancement in the school district where you teach.",
                              "author": "IkeRoberts",
                              "created": 1638912032,
                              "upvotes": 1,
                              "replies": {
                                "hnnxy7o": {
                                  "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hnnxy7o/",
                                  "text": "I just wanna know if my chances for PhD and a proper thesis masters will be tarnished once I go down this part. Would people and scholarship committees think \" oh you have masters already why bother\"?",
                                  "author": "Deus_Sema",
                                  "created": 1638926572,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hnlyqev": {
      "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hnlyqev/",
      "text": "I run a grad program that offers both a professional masters and a research masters. The latter can lead to a PhD program, either here or (usually) elsewhere. The former is not designed for that purpose.\n\nWe sometimes get people who try to weasel their way into the PhD program by getting into the professional masters. They are not easily discouraged despite lots of warnings that that is not how it works. But we say no nevertheless.",
      "author": "IkeRoberts",
      "created": 1638895028,
      "upvotes": 2,
      "replies": {
        "hnm658e": {
          "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hnm658e/",
          "text": "So you flat out reject people with mere professional masters?",
          "author": "Deus_Sema",
          "created": 1638898326,
          "upvotes": 1,
          "replies": {
            "hnn1nfn": {
              "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hnn1nfn/",
              "text": "Professional masters are not research degrees and not intended to be preparation for doctoral study in my program.\n\nI would not call them \"mere\" though, because they are excellent for professional advancement are have great success for that purpose.",
              "author": "IkeRoberts",
              "created": 1638911800,
              "upvotes": 2,
              "replies": {
                "hnny393": {
                  "link": "/r/AskAcademia/comments/ra796o/has_anyone_tried_taking_a_nonthesis_masters_track/hnny393/",
                  "text": "So would it be better if people take thesis oriented masters degrees? Whats the difference between a bachelors taking phd straight and this non thesis master case?",
                  "author": "Deus_Sema",
                  "created": 1638926643,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}