{
  "sid": "r9tomw",
  "link": "/r/AskAcademia/comments/r9tomw/who_decides_paper_hypotheses_direction/",
  "title:": "Who decides paper hypotheses direction?",
  "text": "So this problem has come up several times now with my current postdoc mentor. I will write a paper,  the coauthors will make their suggestions, and I address the suggestions . Then,  my PI says there's no hypothesis here or too many hypotheses are tested or has some other non-quantifiable or non-specific, but fatal flaw he says he has identified,  but can't suggest any solution. Is there anything I can do? Does he have ultimate authority even if he is demonstrably incorrect? \n\nThe only specific and egregious example I have of the is a couple of years ago when he stated that the bonferroni correction depends on the sample size and not the number of statistical hypotheses tested. And after individually asking each other person in the lab meeting if he was correct or I was correct (by correcting him that bonferroni correction is determined by the number of statistical tests or hypotheses). Then end result after 4 phds said I was correct was that he stormed out of the meeting and was inpatient for the next 2 weeks getting his lithium levels adjusted. \n\nIs there any reasonable way to deal with someone who refuses expert opinion when it doesn't fit their (sometimes delusional) opinion when they are the PI on the grant? Even when ALL other coauthors disagree with them?",
  "author": "neurotim",
  "created": 1638750180,
  "updated": 1639515594,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hneysxi": {
      "link": "/r/AskAcademia/comments/r9tomw/who_decides_paper_hypotheses_direction/hneysxi/",
      "text": "I understand your frustration, but it might be more beneficial for both you and your PI if you were more tactful with how you deal with him - i.e. don't embarrass him in lab meeting.\n\nIn general, if I don't agree with my PI, I just wait for my PI to forget it and move on.",
      "author": "NorthAd7013",
      "created": 1638761473,
      "upvotes": 4,
      "replies": {
        "hnf0v4t": {
          "link": "/r/AskAcademia/comments/r9tomw/who_decides_paper_hypotheses_direction/hnf0v4t/",
          "text": "I didn't force the issue, he did. He embarassed himself. I was trying to move on. I also followed while he was leaving encouraging him it wasn't a big deal. Honestly, it won't matter longterm. While he is not quite retirement age, most journals and agencies actively do not seek his advice or review and 70% of people he has worked with won't work with him again. The department head has informed me if I need a letter of recommendation from him for my next position the department head and vice chairman of research will mediate a positive recommendation. I doubt I will be able to work on the data I collected in his lab without a departmental agreement, but I have enough data from my dissertation to move on without that data.",
          "author": "neurotim",
          "created": 1638762415,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hnebl3t": {
      "link": "/r/AskAcademia/comments/r9tomw/who_decides_paper_hypotheses_direction/hnebl3t/",
      "text": "If you have a draft ready to submit at the click of a button then it's going to be a lot harder for your advisor to say no. If the reviewers agree with your advisor then so be it, but often times reviewers can see the value in what you're doing and help you communicate it better. \n\nSometimes professors get so used to providing \"constructive\" criticism that they can miss the bigger picture that sometimes you just have to get a manuscript out and move on. And your advisor seems like an, uh, *extreme* example of that.",
      "author": "Forward-Philosophy46",
      "created": 1638751110,
      "upvotes": 1,
      "replies": {
        "hnee2iw": {
          "link": "/r/AskAcademia/comments/r9tomw/who_decides_paper_hypotheses_direction/hnee2iw/",
          "text": "I did with the other faculty member decide having the reviewers do the controversial work would be best.",
          "author": "neurotim",
          "created": 1638752185,
          "upvotes": 2,
          "replies": {}
        },
        "hnedw2c": {
          "link": "/r/AskAcademia/comments/r9tomw/who_decides_paper_hypotheses_direction/hnedw2c/",
          "text": "The draft is ready. He wants me to rewrite the whole thing. I literally delayed it by a month to get feedback from someone I suspected he might respect. It didn't work. For a little more context he was in trouble with the department for unprofessional conduct about a year ago for a semi-public review of a grant written by a junior faculty member. But he brings in 2 R01 grants right now. I honestly don't need the paper as my publications are 2:1 in both frequency and impact factor compared to his.",
          "author": "neurotim",
          "created": 1638752103,
          "upvotes": 1,
          "replies": {
            "hneeswo": {
              "link": "/r/AskAcademia/comments/r9tomw/who_decides_paper_hypotheses_direction/hneeswo/",
              "text": "Sounds like this is so not worth the headache... I don't know your relationship with your advisor but it doesn't sound like there's any need for this to go on longer. Any idea what he would do if you just submitted it? Or if he just took his name off it if he wasn't comfortable with it?",
              "author": "Forward-Philosophy46",
              "created": 1638752516,
              "upvotes": 1,
              "replies": {
                "hnefcpz": {
                  "link": "/r/AskAcademia/comments/r9tomw/who_decides_paper_hypotheses_direction/hnefcpz/",
                  "text": "In the past, he's just been happy with good reviews.  I'm going to go over it again once more and submit it as corresponding author (done this several times with no complaints).",
                  "author": "neurotim",
                  "created": 1638752765,
                  "upvotes": 1,
                  "replies": {
                    "hneght6": {
                      "link": "/r/AskAcademia/comments/r9tomw/who_decides_paper_hypotheses_direction/hneght6/",
                      "text": "Nice yeah that sounds like the move. Good luck!",
                      "author": "Forward-Philosophy46",
                      "created": 1638753271,
                      "upvotes": 1,
                      "replies": {
                        "hnehcd7": {
                          "link": "/r/AskAcademia/comments/r9tomw/who_decides_paper_hypotheses_direction/hnehcd7/",
                          "text": "Thanks! My old voice of reason (PhD mentor) died earlier this year.",
                          "author": "neurotim",
                          "created": 1638753641,
                          "upvotes": 1,
                          "replies": {
                            "hnehgfn": {
                              "link": "/r/AskAcademia/comments/r9tomw/who_decides_paper_hypotheses_direction/hnehgfn/",
                              "text": "RIP :( 🙏",
                              "author": "Forward-Philosophy46",
                              "created": 1638753689,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hnfuhiv": {
              "link": "/r/AskAcademia/comments/r9tomw/who_decides_paper_hypotheses_direction/hnfuhiv/",
              "text": "Try this:\n\n\"While I appreciate your feedback, I and the other co-authors are happy with the current paper, and the revision process it has already gone through. I will be submitting this tomorrow at X time. Given your reservations, please let me know if you want to remain on as an author or not.\"",
              "author": "OrbitalPete",
              "created": 1638781731,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}