{
  "sid": "ikhk2i",
  "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/",
  "title:": "Middle-aged, burnout, hoping to leave academia",
  "text": "Hello. I'm a researcher in a STEM field, formerly rather successful in terms of published papers, etc. Around three years ago I had a revelation that my research is nonsense: I'm publishing stuff that's peer reviewed by a clique, and read and applied by no one else.  I will be looking to move out of academia, but: (1) firstly I need to work my technical skills to be up-to-date with what industry wants; (2) I need to shed all the negative energy and bitterness that I amassed throughout these years. \n\nSo far (2) has been a real problem for me, partly due to being in my forties and never have worked outside of academia. I would really appreciate sharing positive stories and resources.",
  "author": "thw78",
  "created": 1598954682,
  "updated": 1634080705,
  "over_18": false,
  "upvotes": 197,
  "upvote_ratio": 1.0,
  "comments": {
    "g3kmaov": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3kmaov/",
      "text": "I would be interested to know a little more about 2. Why do you have so much negative energy and bitterness? I also have quite a bit of bitterness.",
      "author": null,
      "created": 1598956887,
      "upvotes": 75,
      "replies": {
        "g3kmrzj": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3kmrzj/",
          "text": "I'm sorry to hear that you're dealing with something similar. I keep hoping to move to industry, learn some really applied stuff, and come back to research - but perhaps in a different field. I found out that emperor has no clothes and I'm bitter that I've spent so much time doing nonsense. There are many more reasons.",
          "author": "thw78",
          "created": 1598957369,
          "upvotes": 55,
          "replies": {
            "g3l8roo": {
              "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l8roo/",
              "text": "Do you have tenure? If so, then you literally can research whatever you want. Drop your old subfield and start learning about another one.\n\nYou could also just teach your courses and then go home and do whatever you want. I've felt a bit of burnout lately after grinding for many years, and have spent more time pursuing hobbies and with family.\n\nI'm a lifelong academic but have also spent some time consulting in the public sector, pursuing contracts with industry, etc. There is just as much, sometimes even more, BS there as in academia. The money may or may not be better depending on what you are doing and your position in academia. The flexibility is definitely much lower.",
              "author": "urbanevol",
              "created": 1598969426,
              "upvotes": 41,
              "replies": {
                "g3lei0e": {
                  "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3lei0e/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1598971606,
                  "upvotes": 37,
                  "replies": {
                    "g3lhggo": {
                      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3lhggo/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1598972697,
                      "upvotes": 21,
                      "replies": {
                        "g3lidhb": {
                          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3lidhb/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1598973028,
                          "upvotes": 16,
                          "replies": {
                            "g3nicox": {
                              "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3nicox/",
                              "text": "What drove me nuts were the buyouts. You finally find a good company, and then some evil company comes along, buys them out, and fires half the people, then grinds everyone else into the dirt to the point where you hate your life.",
                              "author": "dali-llama",
                              "created": 1599000752,
                              "upvotes": 5,
                              "replies": {}
                            },
                            "g3lirw7": {
                              "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3lirw7/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1598973162,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "g3rc5hw": {
                      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3rc5hw/",
                      "text": "I would be fine with rude awakening and being at mercy of corporations, for a while. I'm a computer scientist, so I'd like to try to deal with some real-life problems. I'm at the adjunct stage of your story!",
                      "author": "thw78",
                      "created": 1599075592,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "g3mmqn0": {
                  "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3mmqn0/",
                  "text": "> Do you have tenure?\n\nTo piggyback on this: indeed, if I had tenure, I'd probably tried to take a sabbatical in the industry for a year (first half a year paid by the uni, second half - by the internship). Then started researching a new area altogether. I've heard some really good stories about sabbaticals in the industry! Helps to get up to speed; resets all sorts of expectations; great for networking, etc.",
                  "author": "ampanmdagaba",
                  "created": 1598987657,
                  "upvotes": 9,
                  "replies": {}
                },
                "g3mns2m": {
                  "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3mns2m/",
                  "text": "The experiences of some of my colleagues backs up your points. If you are tenured do not leave academia. You will likely lose some freedoms and will likely also receive lower pay. If you are an adjunct or temporary faculty in the US, you may receive a bump in salary and depending on your academic institution you may also finally gain health insurance and retirement benefits. Both fields have their difficulties and what I like to call extra grace required issues that need to\nbe endured. The real question is which set of extra grace required issues do you feel better equipped to patiently handle? This feels like a pessimistic take on the topic but the reality of the situation is every vocation will have some facet you will not enjoy.",
                  "author": "Hazlik",
                  "created": 1598988062,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "g3m758d": {
              "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3m758d/",
              "text": "Industry is 1000% worse. It is centered around collecting rent/profit maximizing off of discoveries that were made in academia. There is no meaning anywhere. That’s just the society we live in. Make your own meaning!",
              "author": "nevernotdating",
              "created": 1598982009,
              "upvotes": 13,
              "replies": {
                "g3ma18x": {
                  "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3ma18x/",
                  "text": "I agree that many companies are soulless and squeeze every penny out of their employees. However, I disagree there is no meaning anywhere in industry. I worked for a decent sized tech company whose products I didn’t care about, but the company actually cared about the employees. It was filled with good people. I also know of quite a few others who work for great companies that are also doing amazing work. It’s not the norm (ie you wont find it in the big 4 tech), but it is more prevalent than you would think.",
                  "author": "banamana27",
                  "created": 1598983087,
                  "upvotes": 9,
                  "replies": {}
                },
                "g3rcuxx": {
                  "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3rcuxx/",
                  "text": "My 'science' is both hard, time-consuming, and meaningless. I can make my own meaning and start/join projects I believe in if I have some spare time.",
                  "author": "thw78",
                  "created": 1599075847,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "g3l965e": {
              "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l965e/",
              "text": "You could look into a consultant job. That would allow you to take a tour and familiarize yourself with common practices in the field",
              "author": "ncgunny",
              "created": 1598969585,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "g3ljoo7": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3ljoo7/",
      "text": "> my research is nonsense\n\n> never have worked outside of academia\n\nI'm not in STEM and I'm not middle-aged, but I have worked outside of academia and, based on that, I want to encourage you to temper your expectations of what life outside of academia is like. If you're burned out on your job, changing your job is definitely an avenue you should consider, but it's not your only avenue and I don't think that automatically privileging it is a good idea if it turns out that you're doing so out of overly rosy expectations.\n\nThere's a lot of bullshit in industry too. Working in the private sector (or public sector), being \"demand-driven\", being paid to provide a service to someone else doesn't necessarily mean that your work will be meaningful in some existential sense, nor that you will feel like it's meaningful. When I was in industry, a lot of my senior middle-aged colleagues said the same thing as you: I feel like a paper-pusher, nobody cares about what I do, I wish I were researching *the really important things* in academia/molding young minds. A lot of people were bitter, felt expoloited, felt like they were squandering their working years, and felt like the stuff they were producing (at an internationally renowned organization known to everyone in my field) work that has no impact on people's daily lives or which is a very expensive spinning-of-wheels. Everyone wasted 3 out of 5 days on emails and bullshit administrative tasks, everyone had shitty coworkers and unsupportive bosses, a lot of people were frustrated every day and hated their lives. This is not to discourage you from moving to industry. This is to encourage you to remember that the grass is greener where you water it.\n\nAnyway, to get a little more woo-woo, I've been at institutions that everyone wants to be at starting in my mid-teens, and I am continually surprised by the one thing that unites my experience at all of these institutions: everyone around me bitched constantly. Brilliant people, living geniuses, people with an incredible work ethic and achievements to match, people with a level of privilege that I didn't know existed - they had something to complain about (like, a list as long as my arm of somethings) every single day. Some of these people have left industry for academia, or academia for industry, maybe even several times, and they are still constantly unhappy. I don't think they will ever be happy, because they've gotten everything they wanted several times in life and it's still not enough. Maybe I'm projecting too much of my experience on you, but burnt out + no experience of the outside world is a combination that I've seen way too many times to not notice the pattern. In my experience, a lot of the people who are very successful in academia have had such a rarefied life experience that they quite naturally find themselves above such mortal things as daily frustrations and a sense of worthlessness. But in the end, we are all lesser beings and finding solace in the fact that we must all eat, shit, sleep and respond to emails is a big part of any zen you want to achieve.\n\nThanks for coming to my commencement speech.",
      "author": "thegreenaquarium",
      "created": 1598973491,
      "upvotes": 39,
      "replies": {
        "g3nmzdq": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3nmzdq/",
          "text": "I...I actually disagree. I’m in STEM and am 39. I worked in academia for a decade before coming over to pharma (STEM PhD). I NEVER looked back. Even on my worst days here in pharma, I am 1,000,000 times happier than my best days in academia. My work is so meaningful here!! The work I do actually makes an enormous difference in people’s lives. And if I publish here - I GET PAID for it! I don’t have to pay someone for it. The difference is astounding.\n\nAlso please excuse the post history this is my TV gossip account. Too lazy to switch over to my science post history account.",
          "author": null,
          "created": 1599002867,
          "upvotes": 6,
          "replies": {
            "g3oviay": {
              "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3oviay/",
              "text": "I guess it depends on your field. AFAIK pharma is very industry-driven and customer-focused. Therefore, it's not surprising that you feel more meaningful in the industry compared to in the academia. What about other industries?",
              "author": "academic_and_job",
              "created": 1599029136,
              "upvotes": 1,
              "replies": {}
            },
            "g3qolgk": {
              "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3qolgk/",
              "text": "That's okay, your username says you're a doctor so you must be telling the truth.\n\nI don't think we disagree. My thesis is that being happy at work is more about your attitude and your specific personal preferences being matched than it is about the nature of the work or where you do it. I am, on sum, happier in industry - I don't like undergrads, I don't want to live in Bumfuck, AK, and I've learned that I prefer a job that has substantive responsibilities other than research. Frankly, given the intense publishing pressures in academia and the undergrads (seriously... they are everywhere...) I don't know why anyone wants to do it. But some people love it! Some people love it so much they will work for poverty wages to stay! But my point is that the fact that OP is unhappy at his job doesn't mean that he'll be happy if he switches it, and ultimately doesn't even mean that it's the job that's causing the unhappiness. Industry is not a utopia made of grant money and rainbow farts, so it's best not to build one's life on that assumption.",
              "author": "thegreenaquarium",
              "created": 1599066612,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g3nrmmf": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3nrmmf/",
          "text": "> the grass is greener where you water it.\n\nI read your whole post, but this part really stuck with me. There's a lot of wisdom in the way you phrased that.",
          "author": "monkestful",
          "created": 1599004892,
          "upvotes": 2,
          "replies": {
            "g3qp4sm": {
              "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3qp4sm/",
              "text": "lol it's a common phrase on the internet",
              "author": "thegreenaquarium",
              "created": 1599066792,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g3o9xow": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3o9xow/",
          "text": "Where can I subscribe to this podcast?",
          "author": "the_mullet_fondler",
          "created": 1599013841,
          "upvotes": 2,
          "replies": {}
        },
        "g3rek2a": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3rek2a/",
          "text": "Thank you for this speech. I might not fit the pattern though, I hope. I'm tired with nonsense, my work ethic is shit nowadays, and I'd like to see someone happy because I've built something that makes his/her life better. I'm probably not able to become a medical scientist/biologist/theoretical physicist and research origins of life/universe. This is fine with me - someone makes comfy bicycle seats and automatic syringes and I would like to join this crowd.",
          "author": "thw78",
          "created": 1599076445,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g3kp7g7": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3kp7g7/",
      "text": "I'm verry sorry, but I don't have any specific advice for you. Especially because they're field dependent.\n\nA very generic one, as you're in STEM, would be to recycle yourself as data analyst for the sub-field you've been working in, I've seen this to be quite popular for many.\n\nAnyway, I'm wondering... Can you tell us more about this:\n\n>I'm publishing stuff that's peer reviewed by a clique, and read and applied by no one else.\n\nIs this an issue specific of your own niche? O something more to the whole field? I ask because I've collaborated in the past with a people in a niche that was total BS (and it was known) but this niche kept going on, with all the people involved self-approving each other",
      "author": "lucaxx85",
      "created": 1598959663,
      "upvotes": 34,
      "replies": {
        "g3mbxxv": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3mbxxv/",
          "text": "This is soooo much how academia works these days. If you have a specific subject and peers in your field publish in the same journals on the same topics, you are likely to be reviewed by the same dozen people you cite.",
          "author": "tacobellisadrugfront",
          "created": 1598983775,
          "upvotes": 13,
          "replies": {}
        },
        "g3rfmbd": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3rfmbd/",
          "text": "I'm in theoretical computer science. I suspect that most fields with 'theoretical' in name have such niches. In mine they repeat the mantra: 'This is basic research. You never know when it becomes relevant in distant future.'",
          "author": "thw78",
          "created": 1599076829,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g3krirc": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3krirc/",
      "text": "Can’t you just transfer to a more teaching-focused position? There are lots of ways to make a contribution in academia.",
      "author": "Bob_the_blacksmith",
      "created": 1598961321,
      "upvotes": 21,
      "replies": {
        "g3l09zk": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l09zk/",
          "text": "Do you have any concrete ideas outside of K-12 certification?  I welcome any suggestions.  I’m feeling the same as OP, but I’d like to take a break from teaching as I’m burnt out on dealing with students who want to pay-for-play rather than put in the effort.  Sigh.",
          "author": "rubberbatz",
          "created": 1598966007,
          "upvotes": 8,
          "replies": {
            "g3l1kui": {
              "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l1kui/",
              "text": "assuming OP wants to stay in higher education the main options are finding a more teaching-focused position at e.g. a liberal arts college or even community college, or else trying to go more into administration (head of department, dean, etc.) which is often possible without changing institutions. Or roll the dice and do something like an MBA to try to set youself up for college senior management positions. \n\nBy the time you get to your 40s though any career moves need to be a process of building on what you’ve already achieved: trying to throw it all away and start afresh rarely ends well.",
              "author": "Bob_the_blacksmith",
              "created": 1598966585,
              "upvotes": 12,
              "replies": {
                "g3l32lq": {
                  "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l32lq/",
                  "text": "You make a good point about tossing out previous experience and starting fresh as I’m in the same age range as OP.  I’ve thought about administration, but at our institution those positions are much more time intensive than the current professor gig.  I’m currently in the sandwich stage of life with children and elderly parents to care for.  I’ve long ago forgotten what a full night’s sleep looks like and pursuing administration does feels undoable at this point anyway.  I appreciate your suggestions though.",
                  "author": "rubberbatz",
                  "created": 1598967208,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "g3l1peh": {
              "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l1peh/",
              "text": "Masters with 18 hours in a discipline makes you eligible for a gig at a CC. Different student set for sure (\"what do I need to pass?\" vs. \"what do I need to get an A?\"), but teaching and teaching well is the imperative.",
              "author": "moemoe111",
              "created": 1598966636,
              "upvotes": 9,
              "replies": {
                "g3l3gqp": {
                  "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l3gqp/",
                  "text": "I’ve been thinking more along the CC path recently as they tend to be more teaching focused rather than research.  I taught at one many years ago and sometimes regret the decision of leaving since those students had more of a desire to be there, not to mention the diverse population I was able to work with.",
                  "author": "rubberbatz",
                  "created": 1598967358,
                  "upvotes": 6,
                  "replies": {
                    "g3l5d7p": {
                      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l5d7p/",
                      "text": ">they ~~tend to be more~~ are 100% teaching focused rather than research\n\nTeaching a 5/5 doesn't leave you much time for research at all, though some do try to keep up an agenda on the side. I left the research and tenure battle years ago and have not looked back. It is a very different type of work, but very rewarding, both personally and financially.\n\nLast year of my Ph.D. my chair told me, flippantly, that \"anyone can teach but few can do [the research I was doing].\" Turns out he was an idiot and wrong to boot. Everything I learned about teaching I did on the job at my CC. I had one silly class on teaching strategies in grad school. Much of it was wrong/impractical. I learned more from one (of the by now many) prof. dev. workshop in my first year working at a CC then I did that entire course.",
                      "author": "moemoe111",
                      "created": 1598968099,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g3lk994": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3lk994/",
      "text": "[deleted]",
      "author": null,
      "created": 1598973702,
      "upvotes": 12,
      "replies": {
        "g3rg72v": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3rg72v/",
          "text": "Before I move to industry I might try the same. It can end with me leaving my unit, but it's worth trying. Thanks.",
          "author": "thw78",
          "created": 1599077025,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g3l9vd5": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l9vd5/",
      "text": "I feel you. Also in my 40s and have dedicated my life to academia. Sometimes I worry that no one reads what I write or that it doesn’t mean anything. However, it fades, and now I recognize it as a form of low grade depression. It’s not real, just a feeling. I’m sure industry might pay more but I wouldn’t look for meaning there. Your current research program is likely to be something you could improve or make more meaningful. I’m personally making sure my current project really represents what I find important. Hard to have control outside of academia.",
      "author": "raspberry-squirrel",
      "created": 1598969849,
      "upvotes": 12,
      "replies": {
        "g3rfy36": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3rfy36/",
          "text": "I'm happy that you found the right path for you!",
          "author": "thw78",
          "created": 1599076939,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3l6tw9": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l6tw9/",
      "text": "Therapy might help. I don't think (1) is a big problem for you. If you managed to be successful in academia then you can figure out what is needed in industry. I'm thinking some type of consulting or venture capital endeavor might be up your alley with some business know-how. (2) depends on who and what you are bitter about. IMO, all research is niche and it's very easy to feel that it's not important. If you genuinely feel that, then move out or branch out in your research. If your gripe is people or culture related then figure out what it is you want and move towards it. If it's directed at yourself, then cut yourself some slack. You did it because at some point you liked it and thought it was important. If we're taking a very high level perspective, very little work is truly important and you never know if it was important until many years have passed.",
      "author": "riricide",
      "created": 1598968663,
      "upvotes": 10,
      "replies": {
        "g3rhyca": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3rhyca/",
          "text": "Therapy is a great idea, but the therapist I visited said 'well, why don't you change jobs and try something else?' While I agree with your last sentence, I can assure you that sometimes you can have good indications that your work will be completely irrelevant and useless forever.",
          "author": "thw78",
          "created": 1599077650,
          "upvotes": 2,
          "replies": {
            "g3s081u": {
              "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3s081u/",
              "text": "Most therapists are bad. In my experience, it takes work to find someone who can really see your point of view and help you with your problems without over-simplifying your life.",
              "author": "-unhrdof-",
              "created": 1599085302,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g3kyph6": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3kyph6/",
      "text": "Academia generally teaches really good skills regarding asking questions and analyzing problems.  These skills can lend themselves to lots of consulting or business analysis roles.  That many fields also require you to be half-decent at data analysis is a bonus.\n\nAny chance you have the time/interest to take some data science classes?",
      "author": "Decisionsota",
      "created": 1598965217,
      "upvotes": 17,
      "replies": {
        "g3rib3c": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3rib3c/",
          "text": "I hope that you're right! Or at least that this is how non-academics perceive PhDs. I might take some data science moocs. I don't like it that much, but I have background in computer science and mathematics, so I will probably not find it extremely difficult.",
          "author": "thw78",
          "created": 1599077777,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3kzt8v": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3kzt8v/",
      "text": "What field is it?",
      "author": "Jimmeh_Jazz",
      "created": 1598965771,
      "upvotes": 8,
      "replies": {}
    },
    "g3l9oyd": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l9oyd/",
      "text": "\"I'm publishing stuff that's peer reviewed by a clique, and read and applied by no one else.\" this really hit home, I'm a soon-to-graduate phd that's considering doing a post-doc on an area that's a bit different from my own and very exciting for me. I think that it's important to find the right publishing venues for you, there's a lot of variability among STEM sub-fields. There's nothing cool in publishing for a community that you do not appreciate. Going to the industry is of course an option, perhaps it makes more sense if you've tried academia for a long time. But even there, finding the right culture for you is what I believe matters",
      "author": "dr_cosmicomical",
      "created": 1598969781,
      "upvotes": 7,
      "replies": {}
    },
    "g3l1ph9": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l1ph9/",
      "text": "There are “consulting engineers” companies who use a lot of people educated in various STEM fields. Advanced degrees can get you hired at a pretty decent rate. \nThe downside is you have to be ready for conversations about your bill-ability and charge-ability rates, productivity, and a bunch of business pressure jargon.",
      "author": "montane1",
      "created": 1598966637,
      "upvotes": 14,
      "replies": {}
    },
    "g3lgfdk": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3lgfdk/",
      "text": "You may also want to consider a professional scientist role in a larger lab. In my field, at least, “scientific advisors” are becoming more common - senior people who bring depth of technique, experience and intuition to problems, act as institutional memory, provide a sounding board and/or take on significant roles in strategy and program planning, and act as lab co-parents. Not necessarily all these roles, depending on wants and needs. \n\nThe pressure is off to fund the enterprise and to be (uniquely) responsible for research direction and ideas, which I think appeals to many people. I’ve seen senior post-docs, faculty, industry group leaders and journal editors transition to these strategic roles in academia.\n\nEdit: spelling",
      "author": "ccots",
      "created": 1598972331,
      "upvotes": 6,
      "replies": {}
    },
    "g3lu90p": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3lu90p/",
      "text": "I taught in higher ed for 3 years (tenure track) and 2 years of adjunct at 3 colleges before that, but found that the tenure mechanism made my colleagues complacent and defensive, from which was raised a kind of slow-burning ambivalence towards each other. This was at all 4 schools, and to my surprise was a largely shared experience by a few buddies I went through grad school with who also stuck with academia. Worn out and weary of the environment, I left my TT position behind (controversial, as you know) to industry and immediately made almost twice my salary while working in clinical trials, much further downstream from the bench work that hallmarks most basic research.\n\nThis may be an unusual experience (though I’ve found a sizeable cohort of “recovering academics” at this company alone, so it’s not that rare). I miss the students and teaching the most, as well as the easier schedule and intellectual freedom (greener grass for these for sure), but I’m happier and more fulfilled, and surrounded by, with exceptions, more people who feel the same - something I experienced a fraction as often in the Tower.\n\nEveryone cautioning romanticizing industry as the antidote to academia’s well documented problems are completely correct; it has its issues. But at the same time, moving to industry has done wonders for people like me and you- it’s given me responsibility to directly impact patient/subject lives, for example - and I wish you the best of luck!",
      "author": "the_decka",
      "created": 1598977506,
      "upvotes": 6,
      "replies": {
        "g3riim3": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3riim3/",
          "text": "Thank you!",
          "author": "thw78",
          "created": 1599077854,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3m9e4k": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3m9e4k/",
      "text": "Something I’m not hearing in your post is what you’re looking for in a new role and what you’re passionate about. Your post only focuses on what you’re trying to escape. Every job has miserable aspects; if you don’t look for something that is worth it in other ways, you will never be able to look past the parts that suck and will still be unhappy. I would encourage you to start by writing a list of the things you’re excited for in finding a new job. If you can’t think of anything, then you might be burnt out and need some time off. It also may be worth seeing a therapist to work through the negativity and bitterness.",
      "author": "banamana27",
      "created": 1598982848,
      "upvotes": 4,
      "replies": {
        "g3riz0w": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3riz0w/",
          "text": "I've been passionate about several things, but putting up with the nonsense made me bitter. I guess that I developed a low-grade depression and need to recover. Thank you.",
          "author": "thw78",
          "created": 1599078016,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g3l8b5o": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3l8b5o/",
      "text": "In academia, you have quite a bit of autonomy. I wouldn't give it up for anything.\n\nConsider that you may be working for someone else who gets to decide on your behalf. Projects may still be meaningless although more applied. But they'll be done on someone else's terms.",
      "author": "ThatProfessor3301",
      "created": 1598969254,
      "upvotes": 4,
      "replies": {}
    },
    "g3mae56": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3mae56/",
      "text": "The problem is you’re middle aged. Everyone is pissed off and miserable in middle age. It’s the age of disillusionment.",
      "author": null,
      "created": 1598983217,
      "upvotes": 5,
      "replies": {}
    },
    "g3lr8tp": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3lr8tp/",
      "text": "[deleted]",
      "author": null,
      "created": 1598976398,
      "upvotes": 3,
      "replies": {
        "g3rjnl1": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3rjnl1/",
          "text": "I agree. I'll try to do that, armed with my new skepticism :-) I'm not writing off the whole of academia.",
          "author": "thw78",
          "created": 1599078256,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3ml6ku": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3ml6ku/",
      "text": "What field are you in specifically? You sound like an ideal candidate for a research division in a well-developed tech company or a mature startup. The world desperately needs inventors and researchers. \n\nMaybe you don't need to work on your technical skills to be up-to-date with what industry wants, maybe you just need to look in the correct place. If you want you can message me your skills / CV and I can help you find companies to apply to.",
      "author": "chiesazord",
      "created": 1598987067,
      "upvotes": 3,
      "replies": {
        "g3rju25": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3rju25/",
          "text": "Thank you. Once I recover a bit, I might pm you. I appreciate your offer.",
          "author": "thw78",
          "created": 1599078323,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g3ndmyt": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3ndmyt/",
      "text": "I would tread carefully outside of academia if you want to get back in. You probably have much better track record than me but it was hard to even get interviews to come back. I left to teach K-12 for a couple years and you see some differences you make to the kids but the bullshit was not worth it. I don’t know about industry. Originally my plan was to work in industry and then get my PhD and teach others because that’s how I believed it should be so I can see your point. \n\n\nMight I suggest just transitioning or just moving to another more applied topic of research? I had the same issues which is why I left. I felt like such a worthless person because my research was so useless. Now I’m trying to work on projects that have more meaning even if I don’t get a publication out of it. It makes me feel so much better. Try doing outreach too.",
      "author": "IRLStevenUniverse",
      "created": 1598998354,
      "upvotes": 3,
      "replies": {}
    },
    "g3ld6gz": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3ld6gz/",
      "text": "I honestly thought all academia was like this now. I am bitter too. I think leaving is the rational decision.",
      "author": "hbhawkmoth",
      "created": 1598971106,
      "upvotes": 4,
      "replies": {}
    },
    "g3mpmav": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3mpmav/",
      "text": "MAKE YOUR OWN MEANING DAMMIT\n\nhttps://en.wikipedia.org/wiki/Logotherapy",
      "author": "lalochezia1",
      "created": 1598988808,
      "upvotes": 2,
      "replies": {
        "g3rk9dy": {
          "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3rk9dy/",
          "text": "Thanks, looks interesting. It will take me ages to get this though.",
          "author": "thw78",
          "created": 1599078483,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3offhv": {
      "link": "/r/AskAcademia/comments/ikhk2i/middleaged_burnout_hoping_to_leave_academia/g3offhv/",
      "text": "Same here. Exactly. My pubs are meaningless and know who's manuscripts I'm reviewing since we all graduated from the same University and have similar research lines. The more I learn about the scientific and publishing process the less confident I am. \n\nBut... I have no skills in the team world",
      "author": "C-Kasparov",
      "created": 1599016995,
      "upvotes": 1,
      "replies": {}
    }
  }
}