{
  "sid": "f9a58a",
  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/",
  "title:": "I flunked someone for plagiarism. I just discovered they hired a PI to investigate me.",
  "text": "Does anyone have experience with this? I’m in a tenure track position in the social sciences at a school in the Midwest. Last semester, I flunked a student for plagiarizing part of a paper (it was a clear case of copy and paste from an obscure source). The student did not take it well. Things are winding their way through the administrative process. \n\n\nIt has come to my attention that this disgruntled student has apparently hired a private investigator to follow me and look into my life. I feel extremely violated. However, it has unfortunately also come to my attention that this PI has learned that I am in an open relationship. I suspect this would not be well received by my department and would likely jeopardize my ability to get tenure. \n\n\nIt has been strongly implied that details of my personal relationship will be leaked to the department unless I stop pursuing internal discipline against the student. However, it’s not clear to me that I could stop the proceedings even if I wanted to. What exactly am I supposed to do in this situation?",
  "author": "Tenurethrowaway1",
  "created": 1582636760,
  "updated": 1634080055,
  "over_18": false,
  "upvotes": 665,
  "upvote_ratio": 0.98,
  "comments": {
    "fiq6y63": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq6y63/",
      "text": "Immediately get a lawyer. Not a lawyer from your university legal department, but a personal lawyer. Contact your state bar for a referral, they can help you figure out what sort of lawyer you need.\n\nYou can also cross-post this to /r/legaladvice. It's not the best place for serious advice, but sometimes people can point you to resources that you might not know exist, or let you know what type of lawyer to look out for.",
      "author": "notadoctor123",
      "created": 1582636926,
      "upvotes": 735,
      "replies": {
        "fiq7atv": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq7atv/",
          "text": "I would go with the first option presented here and use the other sub as a backup. Sorry this is happening to you, OP.",
          "author": "greensleeves97",
          "created": 1582637209,
          "upvotes": 146,
          "replies": {
            "fiq7jbv": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq7jbv/",
              "text": "Collecting the evidence and going to the police ASAP is definitely something OP should do, but a lawyer will be able to help OP present that evidence to the police in the best possible light.\n\nEdit: I misunderstood your comment. My bad!",
              "author": "notadoctor123",
              "created": 1582637397,
              "upvotes": 71,
              "replies": {
                "fiq7yha": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq7yha/",
                  "text": "I realize now how my first reply was confusing--I agree with the advice you posted. I also agree that r/legaladvice can be very iffy in the quality and accuracy of the advice posted there.",
                  "author": "greensleeves97",
                  "created": 1582637744,
                  "upvotes": 20,
                  "replies": {}
                }
              }
            }
          }
        },
        "fis8zmx": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fis8zmx/",
          "text": "I'd expect there is some union at your university that covers you. Definately worth talking to them as well. They may be able to reccomend someone.  \n\n\nidk your local areas ethics, but I'm pretty sure most people would be sympathetic to an academic subject to extortion for upholding academic standards.  \n\n\n\" It has been strongly implied that details of my personal relationship will be leaked to the department \"  \n\n\nif you are not tracking, recording and backing up all communications already. do this now.",
          "author": "AspiringGuru",
          "created": 1582680316,
          "upvotes": 18,
          "replies": {
            "fj20t71": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fj20t71/",
              "text": "Do you have a campus ombuds, OP?",
              "author": "Edu_cats",
              "created": 1582932010,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fis1emv": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fis1emv/",
          "text": "\n>You can also cross-post this to /r/legaladvice. It's not the best place for serious advice, but sometimes people can point you to resources that you might not know exist, or let you know what type of lawyer to look out for.\n\nYeah. LA is really only useful for 'meta-advise'; who to call and sometimes what language to use to describe your problem to the person on the other end of the line to get them to do something (cops, AG, etc), but that's it.",
          "author": "McFlyParadox",
          "created": 1582675600,
          "upvotes": 13,
          "replies": {}
        },
        "firfqwp": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firfqwp/",
          "text": "r/AskLawyers is probably better for figuring out what type of lawyer to contact.   \n\n\nThey don't give legal advice but they can point you in the right direction.",
          "author": "KimLizLaw",
          "created": 1582663540,
          "upvotes": 25,
          "replies": {}
        },
        "fiqmr5k": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqmr5k/",
          "text": "Don’t go to r/legaladvice. They give horrible advice.",
          "author": "StellaAthena",
          "created": 1582647621,
          "upvotes": 41,
          "replies": {
            "fiqni83": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqni83/",
              "text": "Unless your neighbor cuts down your tree.",
              "author": "manova",
              "created": 1582648064,
              "upvotes": 58,
              "replies": {
                "fir3res": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fir3res/",
                  "text": " But definitely not if the local forest ranger is looking into the fact that you and your spouse like to chop down other people's trees.",
                  "author": "renieri",
                  "created": 1582656780,
                  "upvotes": 20,
                  "replies": {}
                },
                "fit48ta": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fit48ta/",
                  "text": "r/treelaw is the superior sub for that ;)",
                  "author": "MelpomeneAndCalliope",
                  "created": 1582703778,
                  "upvotes": 3,
                  "replies": {
                    "fit494l": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fit494l/",
                      "text": "Here's a sneak peek of /r/treelaw using the [top posts](https://np.reddit.com/r/treelaw/top/?sort=top&t=all) of all time!\n\n\\#1: [Alright, which one of you is this?](https://i.redd.it/edpp7p0awgz21.jpg) | [25 comments](https://np.reddit.com/r/treelaw/comments/br4874/alright_which_one_of_you_is_this/)  \n\\#2: [I went against my own client because I cared more about the tree](https://np.reddit.com/r/treelaw/comments/bsxg25/i_went_against_my_own_client_because_i_cared_more/)  \n\\#3: [Tree Law](https://i.redd.it/867nd72cy2d31.jpg) | [9 comments](https://np.reddit.com/r/treelaw/comments/ciypo8/tree_law/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/ciakte/blacklist_vi/)",
                      "author": "sneakpeekbot",
                      "created": 1582703789,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fiq6xww": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq6xww/",
      "text": "[deleted]",
      "author": null,
      "created": 1582636920,
      "upvotes": 461,
      "replies": {
        "fiq7l2c": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq7l2c/",
          "text": "Yes, obviously I am aware blackmail is illegal. My issue is that if I report this to the police, the chances that my department will find out rise exponentially. I’m looking for advice on how to handle my department. My career is my first and foremost concern. If that means falling on my sword and capitulating to this student, I will do that. But I’m trying to get a sense of how this situation would be received by a university and what the implications would be for tenure.",
          "author": "Tenurethrowaway1",
          "created": 1582637436,
          "upvotes": 101,
          "replies": {
            "fiqftm3": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqftm3/",
              "text": "> If that means falling on my sword and capitulating to this student, I will do that.\n\nDo not do this. If you capitulate, then the student will stay enrolled. Do you think this will be over then? No, next they'll demand a slightly better grade, more time on an assignment, preferential treatments everywhere. And if you get found out at that point, you can be damn sure that you won't get tenure anywhere. That's the kind of shit over which you could lose tenure and you don't want that on your mind for the rest of your career. \n\nFace it now - chances are that an open relationship does not matter at all. Even at a catholic university.",
              "author": "Timguin",
              "created": 1582643366,
              "upvotes": 232,
              "replies": {
                "fiu6c2i": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiu6c2i/",
                  "text": "Agreed.....I’m super conservative myself, but this knowledge would have absolutely zero impact on how I voted for your tenure if I were on the committee. In fact, just the opposite....I’d be scared that a negative vote would be grounds for accusations of discrimination. I honestly don’t think anyone really cares.",
                  "author": "TheHoosierHammer",
                  "created": 1582735896,
                  "upvotes": 8,
                  "replies": {}
                },
                "fixdvz9": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fixdvz9/",
                  "text": "This person is right. Also, if this student is that malicious, once you drop the proceedings they may leak the information anyway. They have no incentive not to if you can’t re-raise the issue. If anything, then this person has two pieces of information against you: that you allowed plagiarism for personal reasons and your personal relationship details.",
                  "author": "SoTaxMuchCPA",
                  "created": 1582818452,
                  "upvotes": 5,
                  "replies": {}
                },
                "fiqrap5": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqrap5/",
                  "text": "> Do not do this. If you capitulate, then the student will stay enrolled.\n\nLol.  Are you fucking kidding me?  This kid is absolutely not worth ending or stagnating their career over.  People are shitty and academia is absolutely not isolated from this.  Some places can and will end your career simply because you have different values from them.\n\n> Face it now - chances are that an open relationship does not matter at all. Even at a catholic university.\n\nIn the midwest?  Are you familiar with OP's department, faculty, or administration?  This is not a chance someone should have to take.",
                  "author": null,
                  "created": 1582650297,
                  "upvotes": -38,
                  "replies": {
                    "fiqur3e": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqur3e/",
                      "text": ">  This kid is absolutely not worth ending or stagnating their career over. \n\nWhen did I say they should do it because of the student or because of some moral obligation? I've explained why I think it would be bad for OP and his career.\n\n>  This is not a chance someone should have to take.\n\nThe whole point is that it will be even worse if they get found out after giving in to the demands. It's taking a chance either way. And yes, I know a few religious institutions and in my experience the only ones that are strict about a very religious code of conduct are those that make you sign heaps of paperwork to that end. OP would know if that was the case.",
                      "author": "Timguin",
                      "created": 1582652050,
                      "upvotes": 40,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fiq9wui": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq9wui/",
              "text": "Why would being in an open relationship reflect negatively on you for tenure?  It would not matter in my decision one bit. If this is a lifestyle that you enjoy, it makes no matter to me what you do as it makes no difference on your effectiveness as a colleague.  Out the extortion and be proud of who you are.",
              "author": "Der_Kommissar73",
              "created": 1582639248,
              "upvotes": 130,
              "replies": {
                "fiqmjyl": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqmjyl/",
                  "text": "I imagine OP is from some religious conservative school. I’ve been at a number of universities and small colleges and none would bat an eye. Even the more “conservative” one had trans faculty. Of course, none were religious.",
                  "author": "urnbabyurn",
                  "created": 1582647502,
                  "upvotes": 40,
                  "replies": {}
                },
                "fiqae5m": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqae5m/",
                  "text": "It was implied that this information would also make its way to students, generating controversy around me that the university would have to deal with.",
                  "author": "Tenurethrowaway1",
                  "created": 1582639608,
                  "upvotes": 43,
                  "replies": {
                    "fiqalan": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqalan/",
                      "text": "In my experience, major catholic universities are usually good about supporting the independence of their faculty and do not require adherence to Catholicism. They know no one would work there if they were not. There may be exceptions, but I would expect them to be supportive.",
                      "author": "Der_Kommissar73",
                      "created": 1582639755,
                      "upvotes": 76,
                      "replies": {
                        "fiqctdh": {
                          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqctdh/",
                          "text": "Unfortunately, it really depends on the school.  I taught at a Catholic university, and I honestly think they would have laughed if someone tried to use this type of information against me.  They were very relaxed and supportive.  \n\nOn the other hand, there is a Catholic university in my current town that would absolutely take this seriously and probably dismiss the professor, or at least make it very hard to get tenure.  They seem to do their best to out baptist the local baptist university.",
                          "author": "manova",
                          "created": 1582641345,
                          "upvotes": 67,
                          "replies": {
                            "fiqmu22": {
                              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqmu22/",
                              "text": "When I interviewed at a major catholic university, the department chair was openly gay and half the faculty was Jewish. Not that being Jewish is “controversial” but there is a huge gap between the religious affiliation of catholic universities and how the departments are run. There is also a difference between Jesuit and diocese. \n\nThe conservative southern baptist and non mainLine Protestant schools are a different bag. BYU for example has virtually no women in my field.",
                              "author": "Donald_J_Putin",
                              "created": 1582647668,
                              "upvotes": 45,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "firnb71": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firnb71/",
                      "text": "Highly unlikely. Every school has student rumours about faculty. Look on any university subreddit.",
                      "author": "Unicormfarts",
                      "created": 1582667639,
                      "upvotes": 16,
                      "replies": {}
                    },
                    "fir1pr8": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fir1pr8/",
                      "text": "I'm pretty sure most college students would cheer you on. Some might have questions, but few or none would have the chutzpah to ask you anything. And even if they do, say sternly that it's okay that they know about some aspects of your private life, but that you're not interested in sharing any additional information about it with your students.\n\nDon't worry about controversy from your students. Your colleagues are the only ones who will think they're in a position to judge you.\n\nEdit: Even then, remember that you control the narrative if you reveal this information yourself. I urge that you bring this situation to your superior and treat your relationship status as if it isn't a secret. Get out ahead of it. You'll seem like you're handling it responsibly and courageously.",
                      "author": "Kiss_My_Wookiee",
                      "created": 1582655619,
                      "upvotes": 23,
                      "replies": {}
                    },
                    "fiqrrtb": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqrrtb/",
                      "text": "What on earth is controversial about consenting adults in an open relationship? Cheating, sexual assault and harassment rarely seem to impact a person's ability to get tenure. Why should this?",
                      "author": "riotous_jocundity",
                      "created": 1582650577,
                      "upvotes": 40,
                      "replies": {}
                    },
                    "firuppj": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firuppj/",
                      "text": "Mate who cares. Don’t live your life in fear of who you are. Let them know and look to you as an example of an alternative way to happiness",
                      "author": "mpbarry46",
                      "created": 1582671564,
                      "upvotes": 7,
                      "replies": {
                        "fis5edj": {
                          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fis5edj/",
                          "text": "Then go get that strange",
                          "author": "Keylessgamer",
                          "created": 1582678158,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    },
                    "fixeaph": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fixeaph/",
                      "text": "I would be interested to know what sort of information they could possibly have to prove that you have this relationship. Do they have used condoms with DNA? Do they have photos of you actively having sex? Anything else can be explained away, or doesn’t even need to be. “She’s an ex who I’m still very friendly with. She’s always been super affectionate, hence the kissing you saw.” There are a million explanations.\n\nIt isn’t perfect, but consider that, until you tell someone, your department only knows what this student can prove. And you can imply that most things have been doctored or edited because of these plagiarism charges you brought against the student.",
                      "author": "SoTaxMuchCPA",
                      "created": 1582818697,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "firh8gd": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firh8gd/",
              "text": "I'm sorry to put it this way but damned if you do and damned if you don't.   \n\n\nIf I was over your department and I knew you did *anything* to pull back from academic dishonesty I would strongly question your role. \n\nYou are putting your career in an obviously unethical and potentially unstable person's hands.   \nWhat assurance do you have that this person wouldn't divulge that information either way?   \n\n\nWhat happens if you try to walk it back and they get reprimanded anyway?   \nWhat is to stop this student from telling everyone your information and *also* telling them that you tried to help them cheat their punishment?  \n\n\nFrom my perspective, not reporting the person's unethical behavior seems like a sure way to get immediately fired versus potentially having to deal with some uncomfortable rumors that may or may not impact your position.   \n\n\nIf you give in then your job is more at risk than if you don't. There's also the moral and ethical implications of allowing this person to continue on with this behavior, but that's for a different time.\n\nEdit: forgot a word",
              "author": "KimLizLaw",
              "created": 1582664349,
              "upvotes": 30,
              "replies": {}
            },
            "fiq9tbv": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq9tbv/",
              "text": "Capitulating to your student would be a worse option, because they can either share this blackmail with other students or use to it get more things from you.",
              "author": "heliumagency",
              "created": 1582639173,
              "upvotes": 86,
              "replies": {}
            },
            "fisbmns": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fisbmns/",
              "text": "If you try to put the brakes on their disciplinary case now, you will look as dishonest as they are. As you said, the case is open and shut.\n\nYou have no protection against the whims of this overgrown child, whether you capitulate to them or not. Do the right thing and stay the course.\n\nThey have blackmailed you. If they release their blackmail, causing you financial damages, because you upheld your academic integrity, you have a pretty winnable lawsuit on your hands.",
              "author": "Popeychops",
              "created": 1582681728,
              "upvotes": 17,
              "replies": {}
            },
            "fiq8idi": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq8idi/",
              "text": "Being willing to do anything/bowing to whatever powers that may be for the sake of your career doesn’t exactly sound like the most healthy of approaches to your life. Would you consider seeking a position at a different university, especially since your a professor at a Catholic university when you yourself are not catholic? (Did you have to sign a religious faith statement? Most institutions affiliated with a religious institute require some sort of signature wherein their employees agree to uphold and/or believe in said religious institute.)",
              "author": "amrungwaew",
              "created": 1582638182,
              "upvotes": 44,
              "replies": {
                "fiq950w": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq950w/",
                  "text": "I appreciate the concern, however finding another tenure track position in my field will be close to impossible. I basically won the lottery with this job and I want to do everything I can to protect this position. I do not want to go back to adjuncting over this.",
                  "author": "Tenurethrowaway1",
                  "created": 1582638663,
                  "upvotes": 48,
                  "replies": {
                    "fiqkleu": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqkleu/",
                      "text": "This sucks and I really feel for you. The problem is that silence isn’t bought, it’s only rented. Maybe because it’s over a grade and not a request for money, this student would disappear if you gave in, but what they’re doing is so insane that I wouldn’t assume that’s the case.\n\nConsults with a lawyer are typically free or low cost. You can call your local bar association and ask for a referral. Depending on where you are, it could be at the state or county level. In my experience, the referral service is very helpful. It’s worth doing no matter what you ultimately decide to do. \n\nI’m really sorry this happened, it’s absolutely off the wall bonkers. It’s such a huge violation. I hope everything works out for you.",
                      "author": "StringOfLights",
                      "created": 1582646304,
                      "upvotes": 43,
                      "replies": {}
                    },
                    "fiqnp1c": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqnp1c/",
                      "text": "The fact that a student would do this to a faculty member would far overshadow whatever hearsay is released to students ( I also wonder about how this would happen...). Your colleagues would definitely rally around you about the invasion of your privacy and the blackmail, and an open relationship is not a fireable offense. You have a right to privacy, which is being violated. Contact the AAUP who will have a list of lawyers in your state that specialize in academic issues. They'll advise you how to protect yourself in an academic setting.",
                      "author": "shivahive",
                      "created": 1582648176,
                      "upvotes": 39,
                      "replies": {
                        "firg79j": {
                          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firg79j/",
                          "text": "Unless it's an 'open relationship' with another member of staff that his wife doesn't know about.  \n\nNot judging OP at all in any case but just to highlight that in my experience there is a degree to which colleagues will rally around.  Sometimes a person becomes gossip fodder, rightly or wrongly if that even matters. And some of the fallout from that can be that those professional relationships start to dry up.  \n\nI wish that weren't the case but I've seen it happen, especially in the social sciences where sometimes any hint of controversy that doesn't sell books can fuck you pretty harshly.",
                          "author": "Times_New_Viking",
                          "created": 1582663787,
                          "upvotes": 6,
                          "replies": {}
                        }
                      }
                    },
                    "fis3beo": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fis3beo/",
                      "text": "I don't think that you are thinking more than one step ahead here. Suppose you agree to drop this case in exchange for their silence --  how's that going to look, should they then decide to pass that info along?\n\nWhat's worse for your tenure case, ambiguous evidence that you may have pursued an open relationship off-campus, or fairly definitive evidence that you dropped an academic misconduct case and compromised the institution's integrity for personal career motives? \n\nI'm not at a faith-based institution (although arguably most institutions have 'good fit' guidelines, whether written or unwritten), but I would seriously question the professional integrity of a faculty member who dropped a plagiarism case for this reason. Admittedly, you're between a real rock and a real hard place, but it seems like you should a) contact a lawyer and b) test the waters with some tenured faculty that you trust about how much a revelation like this would actually impact your tenure case. If they say little to none, I think your best bet is to tell your dept that you are being blackmailed.",
                      "author": "Lonelobo",
                      "created": 1582676831,
                      "upvotes": 13,
                      "replies": {}
                    }
                  }
                },
                "fiqb75w": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqb75w/",
                  "text": "I understand the principle, but there are always particulars of ones personal life that may take priority over some things,and there's surely a balance to strike. No judgements.",
                  "author": "_whatevs_",
                  "created": 1582640200,
                  "upvotes": 9,
                  "replies": {}
                },
                "fiqg877": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqg877/",
                  "text": "> Being willing to do anything/bowing to whatever powers that may be for the sake of your career doesn’t exactly sound like the most healthy of approaches to your life.\n\nAnd yet that is the position in which many junior faculty find themselves, because they have dedicated their prime working years to a field where almost nobody makes it. Having to live like this is not a problem with any junior faculty member's intelligence, virtue or self-respect; it's a reality of existing in this system. And it is incumbent on those in power to change that system, not to give obviously impractical suggestions in holier-than-thou reddit posts.",
                  "author": "thegreenaquarium",
                  "created": 1582643623,
                  "upvotes": 28,
                  "replies": {
                    "fiqnifb": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqnifb/",
                      "text": "Thank you.",
                      "author": "Tenurethrowaway1",
                      "created": 1582648067,
                      "upvotes": 7,
                      "replies": {
                        "fiqoaqe": {
                          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqoaqe/",
                          "text": "the horses that some of these people are riding are so high they must be reverse giraffes",
                          "author": "thegreenaquarium",
                          "created": 1582648537,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    },
                    "fisukk5": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fisukk5/",
                      "text": "This isn't dealing with awful schedules or salaries or annoying coworkers.  This would be facilitating psychopathy.\n\nBowing to the whims of a predator and emboldening them for future exploits, in exchange for the extremely slim chance that it might make OP's career easier, seems like a bad deal for society.\n\nNot to mention that capitulating would actually only make OP's own situation worse too: it goes from possibly getting fired from one place over something that the majority of schools have zero problem with, to probably losing licenses and reputation in the entire field for ethical violations.  Or even worse, not getting fired and getting stuck with the psychopath after teaching them OP will do whatever they want.  They would still have the leverage, and zero incentive to stop using it.\n\nIntegrity and ethics are the #1 most important part of education.  Students learn more than just the curriculum from their teachers.",
                      "author": "brusque_n_veracious",
                      "created": 1582693793,
                      "upvotes": 2,
                      "replies": {
                        "fitc7p7": {
                          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fitc7p7/",
                          "text": "😂🤣 alright Mr. Three Kids In A Trench Coat",
                          "author": "thegreenaquarium",
                          "created": 1582714387,
                          "upvotes": -1,
                          "replies": {
                            "fitpcxv": {
                              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fitpcxv/",
                              "text": "Gaslighting and ad hominem without any attempt at an actual point, classy.",
                              "author": "brusque_n_veracious",
                              "created": 1582726297,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "firn1yh": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firn1yh/",
              "text": "I guess this depends on what country you are in, but in many places denying you tenure because they don't like your marriage choices is illegal. \n\nIf you are worried about retaliation, then document and get a lawyer. As far as blowing the whistle on the student is concerned, you have to do that. There's no guarantee that complying with their demands will mean they keep quiet, and if it comes out you knuckled under, that's WAY worse than any weird stuff about your private life.\n\nAre you in one of those departments where all the faculty marry each other? Did they have a spouse lined up for you? (Not joking, there's a particular department at my uni with 30 TT faculty, and 12 of those people are in couples with other TT faculty, and some of them are maybe married to NTT people for all I know. I just know about the ones where it's COI.)",
              "author": "Unicormfarts",
              "created": 1582667496,
              "upvotes": 3,
              "replies": {}
            },
            "fiqbz5k": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqbz5k/",
              "text": "[removed]",
              "author": null,
              "created": 1582640754,
              "upvotes": 4,
              "replies": {
                "fiqe7b1": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqe7b1/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1582642302,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "fk2aj91": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fk2aj91/",
              "text": "I think it’s worth considering that capitulating to the student’s attempts at blackmail may be viewed equally poorly. If you have reason to believe that you didn’t get tenure or are terminated early because of your relationship status, I have to think you have legal recourse. Sorry this is happening to you!",
              "author": "darth_alfredo",
              "created": 1583796699,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fir14yf": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fir14yf/",
          "text": "Just because it's illegal doesn't mean that:\n\n1. The student won't follow through \n\n2. That this person's life won't be ruined\n\nWith that said, hopefully a lawyer and good people at the school can help.",
          "author": "AMaterialGuy",
          "created": 1582655287,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fiq7pjg": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq7pjg/",
      "text": "Agree with the other posters. It sounds like you are being blackmailed, so you need legal advice.   \nWas the student stupid enough to blackmail you in written form?   \n\n\nIn principle, your sexual relationships are your personal business. However, if you work in a more religious university, you may have to go the misstep-apologize-finding God way, get tenure, and get out of there. Your choice though. But at least know that there are options.",
      "author": "TheFloorIsMine",
      "created": 1582637539,
      "upvotes": 108,
      "replies": {
        "fiq8yeg": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq8yeg/",
          "text": "It was a phone call from someone other than the student, so i don’t have any kind of written proof.",
          "author": "Tenurethrowaway1",
          "created": 1582638522,
          "upvotes": 39,
          "replies": {
            "fiqa4ds": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqa4ds/",
              "text": "Oof, combined with the Catholic university, I understand your concern. Are you in a 1- or a 2 party consent state when it comes to recording phone calls? You should start doing that with unknown numbers (if legal).  \n\n\nLike I said earlier, even if your wife is completely fine with you dating around, you might have to take the option where you say that you cheated, and are seeking forgiveness, which only God can grant (blabla). This also depends on how extreme your university is.   \nIs there something in your contract about living your life according to religious rules or according to the 10 commandments or something like that?",
              "author": "TheFloorIsMine",
              "created": 1582639405,
              "upvotes": 50,
              "replies": {}
            },
            "fiqcbbq": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqcbbq/",
              "text": "Your testimony, strictly speaking, *is* evidence. I'd also get the official phone records from your phone provider.",
              "author": "notadoctor123",
              "created": 1582640991,
              "upvotes": 32,
              "replies": {}
            },
            "fir629o": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fir629o/",
              "text": "What kind of Catholic university is it? Is it like Georgetown, where it's Catholic-funded but the faculty are diverse? Or is it like Our Lady Seat of Wisdom, where faculty sign an oath about following all the official doctrine? Because that changes a lot about the situation - if it's the first, you did nothing wrong and might be able to tell whoever is in charge of dealing with the plagiarist that she's been blackmailing you.",
              "author": null,
              "created": 1582658090,
              "upvotes": 11,
              "replies": {}
            },
            "fit4jnd": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fit4jnd/",
              "text": "If your state allows it, get an app that records all your phonecalls for you.",
              "author": "link0007",
              "created": 1582704143,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fiqaznv": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqaznv/",
      "text": "I would go to a lawyer first.  I'd ask the lawyer if I could file both criminal and civil charges and sue the student into next week.  They'll probably say no which is disappointing because I'd want to nail that little shit to the wall.  One thing you may find the lawyer actually doing for you is filing a restraining order against the student.\n\nI'd also be sure to ask the lawyer when to include the dean and the senior leadership at the school.  Adding a threat and attempted blackmail to the disciplinary process might just get the kid expelled.\n\nNow I know there are some states where the LGBT status is a non-protected status which is what I'm assuming you're talking about, my brother's boyfriend was fired for being Gay at a school in New Hampshire.  So yes there is a risk.\n\nIf the student is willing to go to all of this trouble there is a real risk of violence, either by them or by someone they paid when things don't go their way.  \n\nThis is not something to take lightly.  You need help.",
      "author": "eLearningChris",
      "created": 1582640049,
      "upvotes": 47,
      "replies": {}
    },
    "fiqbfvu": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqbfvu/",
      "text": "This is horrible, I  feel for you. One thing you need to consider is that you have no proof the student would stop blackmailing you if you stopped the proceedings.  Actually they have proven that they're very vengeful and they're ready to cheat and break the law, so it's quite possible they would tell the department about your relationship even if you decided to bow to their demands. Anyway it would probably look suspicious to your department if you suddenly decided to change your mind about the student after you provided evidence of their plagiarism.\n\nNow what can the student do? If the student goes to the department with the evidence they got from the PI, they'll look exactly like what they are, a cheater who tried to blackmail a professor for doing something that's not against the law. If I were in your department, I'd be pretty disgusted at someone who would invade a professor's privacy like that.  Defending the student would mean admitting that blackmailing staff is ok. This is not the image the University wants to have. You, on the other hand, did your job like you were supposed to.\n\nNow, one way or another, you're in an unfortunate situation where it's likely that your department will learn about your relationship. You need to mitigate damage. I don't know your department, and it's easy for me to talk as I'm not the one to suffer the consequences, but it seems that the best way to do this would not be to fall to blackmail. If you trust your colleagues to have a bit of decency, you'll have a better outcome telling the student to f... off and coming clear if you need to.",
      "author": "Ofbearsandmen",
      "created": 1582640372,
      "upvotes": 22,
      "replies": {}
    },
    "fiqe7jp": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqe7jp/",
      "text": "This looks like several separate but related issues to me. I'll assume that you have NOT dated any students or other university employees, and thus your private life is separate from your work life.\n\n1) The plagiarism disciplinary case. Assuming you've already submitted the evidence, this must continue. To withdraw it now would raise the biggest red flags of all for your department. Talk to a trusted senior mentor about whether to let the academic conduct board know about the blackmail attempt.\n\n2) Legal action. Definitely consult an attorney to see if QUIET legal action can be taken, like a cease and desist. But bringing charges will only attract unwanted attention, like press attention, that will force your department to confront the issue, even if they don't want to.\n\n3) Whether your personal life becomes an item of interest to your colleagues or the administration. The best way to keep it under the radar is to treat this like a minor thing - a \"can you believe this student?\" tidbit at best. Voluntary disclosure should only happen if the story is about to come out in a public way anyways, like a press story - otherwise it's best to treat it as not part of your professional life and this not relevant to your work colleagues.\n\nBut DO check with a trusted colleague about how the school may have handled professors with unusual personal lives in the past. Do not go into detail about your own situation. That should give you some guidance on how to talk about this, if at all.",
      "author": "Readerokie",
      "created": 1582642306,
      "upvotes": 21,
      "replies": {}
    },
    "fiqp355": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqp355/",
      "text": "This is a real dilemma. I have colleagues who were subjected to this kind of abusive behavior from “powerful” students. Even with the plagiarism case being open and shut, you may end up with a ruined career and a student getting off free and clear because the parents throw some money at the problem. As I see it, you are already screwed because this student and their family have you in their crosshairs. I hope I’m wrong and that your university really stands up for professors when it comes to Academic integrity, but I somehow doubt it. \n\nAs far as the open relationship goes, I would lean toward hiring a lawyer and involving the police immediately. I would then simply deny any accusation as sour grapes on the part of the student. One would hope that the School wouldn’t want to be featured in a New York Times article about the pressures professors face from aggressive attempts to get away with cheating by hiring PIs...and the schools that let them get away with such behavior by not punishing the student for extortion (which is what this is). \n\nI get that this is a difficult call, however, and if I saw any way to get out from under this, I’d probably take it. But the wheels are already in motion...if there are career consequences, they are coming regardless of what you do now with the integrity complaint. Take this kid down with you!",
      "author": "BlargAttack",
      "created": 1582649003,
      "upvotes": 15,
      "replies": {
        "fiqpyx9": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqpyx9/",
          "text": "I’m reasonably confident that my university would be bothered with what this student has done. But my concern is that when I’m finally up for tenure, I will he damaged goods.",
          "author": "Tenurethrowaway1",
          "created": 1582649517,
          "upvotes": 15,
          "replies": {
            "fiqy0n8": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqy0n8/",
              "text": "It could also work in your favor.  Some universities are still invested in their reputations and don't let the financial office make these decisions.  It may be that your university will see a prof willing to stand up to this type of bullying as someone they want on their faculty.\n\nIn any event, report the stalking and harassment to the police.  You might also report it to your department chair and university legal department.  Retain a lawyer to protect your interests if it comes to it.",
              "author": "RiverThatBends",
              "created": 1582653649,
              "upvotes": 10,
              "replies": {}
            },
            "fisr9ni": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fisr9ni/",
              "text": "I might be a little doubtful that your university would be bothered with what the student has done. Money speaks loudly in some cases but I can only speak from my own experiences and not with any authority. \n\nI feel like you are doubting the integrity of your colleagues and maybe that is just a gut reaction rather than a well-thought our reaction. If your work is solid and your peers respectable, would it matter? If your work isn't up to par, it wouldn't matter. If your peers are respectable, what are you really working towards?\n\nI suspect you are already damaged goods. You might second guess reporting academic dishonesty in the future. My impression is that this job is important enough to question your integrity, which is fine, I've seen enough academics without integrity and they are doing just fine. You don't need it for your future but if you give in, you may have to deal with this student and their peers/relations for some time and you'll have a legitimate reason to be denied tenure. \n\nIf you do the right thing, you might lose your job. I suspect you are not completely aware of the climate but it isn't unreasonable for your assertion to be correct. If your life choices are so dangerous (they shouldn't be but you seem to think they are) to your ambitions, why do you do it? Did you just think that it would never come up? \n\nYou have one option that you think puts your career at risk and another that definitely, and legitimately, puts it at risk. I would tell you to take the high road, but if your career means that much well... my single data point of anecdotal experience is that taking the high road is why I'm no longer in academia. \n\nI sincerely hope that PI doesn't know what Reddit is.",
              "author": "thatprofessoryouhate",
              "created": 1582691184,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "fiqhk3y": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqhk3y/",
      "text": "No advice beyond that given, but just want to express solidarity. Who are these supposed academics who don't understand that your university doesn't need to fire you - they just need to quietly deny you tenure for a plausible reason, which at your university may be the code of conduct. I don't think there's anything wrong with you for wanting to keep your job, even at the (incredible personal) cost of placating one shithead student who would probably have been acquitted by the system anyway even if he raped or killed someone. I hope you figure this out.",
      "author": "thegreenaquarium",
      "created": 1582644461,
      "upvotes": 39,
      "replies": {
        "fiqjkhy": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqjkhy/",
          "text": "Exactly. This is what people don’t seem to understand. I doubt the department would say I’m not getting tenure because of my relationship choices. I’m sure they’d come up with some other reason. But my personal life would be the motivating factor.",
          "author": "Tenurethrowaway1",
          "created": 1582645686,
          "upvotes": 35,
          "replies": {
            "fir66pl": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fir66pl/",
              "text": "Maybe an aggressive lawyer would make them reluctant to deny you tenure. Good luck, hope the kid doesn’t win.",
              "author": "samscarrot",
              "created": 1582658160,
              "upvotes": 11,
              "replies": {}
            },
            "fiqkul3": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqkul3/",
              "text": "At least 50% of the people giving advice on this sub are undergrads. That's the only explanation that makes sense to me.",
              "author": "thegreenaquarium",
              "created": 1582646459,
              "upvotes": 33,
              "replies": {}
            },
            "fitnxah": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fitnxah/",
              "text": "Do you know what processes your university has in place for filing grievances or a rebuttal for the tenure process? If the faculty are unionized at your university I would seek out advice from your union about what to do if tenure is denied for baseless reasons. If you aren’t unionized, I would hire a lawyer to look through the policies, maybe there is legal action to take at that point.\n\nAlso, as others recommend: hire a lawyer now because you are being blackmailed.",
              "author": "FliesFlyButAFlyFlies",
              "created": 1582725299,
              "upvotes": 2,
              "replies": {}
            },
            "firvlcy": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firvlcy/",
              "text": "Question - would they release it if you just stop with your own actions against the student?  Can you reach a compromise directly with the student?\n\nOther options - \nSoothing the student's hurt ego via apology, encouraging them not to engage in this kind of behaviour in the future as it can seriously be destructive to them in the long-term (continuing to teach), explaining you've stopped pressing this issue yourself but it may be out of your hands and will be what it will be, but if they continue making threats to you then it could seriously escalate and likely won't have a good outcome for the student. Explain taking the nuclear option every time over small things in the relative long-term will generate a negative reputation for the student and may land them in legal trouble",
              "author": "mpbarry46",
              "created": 1582672029,
              "upvotes": -3,
              "replies": {}
            }
          }
        },
        "fiqqo20": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqqo20/",
          "text": "100% agree. The school could publicly say they side with OP and not the student, but when tenure decisions or contract re-negotiations come around, they school can quietly not extend your contract. It happens with adjuncts all the time. This is an all-around shitty situation and I feel so bad for OP. It sucks that this student will not take responsibility for their bad behavior and instead try to tank OP's career in revenge.",
          "author": "homsar06",
          "created": 1582649924,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "fiq8c31": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq8c31/",
      "text": "Go to the police. Jesus.",
      "author": "debacchatio",
      "created": 1582638046,
      "upvotes": 27,
      "replies": {
        "fiqsns4": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqsns4/",
          "text": "Police Jesus Sundays on Fox!!",
          "author": "Violent_content",
          "created": 1582651026,
          "upvotes": 9,
          "replies": {}
        },
        "fiqrkwn": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqrkwn/",
          "text": "Mmmmm I think Jesus might be a big part of the problem.  \n\n\nWouldn't go to him without a lawyer on this one.",
          "author": "CreLoxSwag",
          "created": 1582650463,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fiqbe7z": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqbe7z/",
      "text": "Stop posting here and take your contract to an employment attorney.",
      "author": "lStannisl",
      "created": 1582640338,
      "upvotes": 18,
      "replies": {}
    },
    "fiqaavx": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqaavx/",
      "text": "This will sound harsh and unpopular, but grow some backbone and stand for your way of life. If this is frowned upon by a place you spend over 8 hours each weekday, you're in the wrong spot and you're supporting a system that undermines something you value a lot. It's difficult to do this, given you might have to provide for a family and run the risk of losing job security, but if the alternative is to live a lie for a third of your life, the choice seems easy to me.",
      "author": "GalacticCreature",
      "created": 1582639541,
      "upvotes": 69,
      "replies": {
        "fmaoqid": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fmaoqid/",
          "text": "While I think your point is reasonable in that you shouldn’t support and institution that doesn’t value your beliefs, I also want to add that this part of OP’s life should be none of their business. What people do in their private life should stay private. There should be no worry of penalization to begin with because OP was keeping their private matters to themself. OP should seek legal advice because what is happening is essentially blackmail.",
          "author": "Cardigan_B",
          "created": 1585901822,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fiq83zz": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq83zz/",
      "text": "Is being in an open relationship against the terms of your contract? Regardless of whether it's right or wrong...if it's in your contract, it's in your contract.  \n\n\nAll-else considered, the school should protect you from this. You were literally doing your job. However, it sounds like this student comes from a fairly wealthy family...and money talks to universities as we've seen in the media recently.\n\nJust in case the school does not take your side...I'd lawyer-up immediately.  \n\n\nAlso might be time to throw your resume around to some colleagues at other institutions.",
      "author": "CreLoxSwag",
      "created": 1582637866,
      "upvotes": 22,
      "replies": {
        "fiqcnb4": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqcnb4/",
          "text": "The student’s family is wealthy from what I’ve been able to gather. They have brought considerable resources to bear on the plagiarism matter. The problem with finding another job is that it is extremely unlikely in my field. I was incredibly lucky to get this position and I desperately want to keep it.",
          "author": "Tenurethrowaway1",
          "created": 1582641226,
          "upvotes": 15,
          "replies": {
            "fiqfpwv": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqfpwv/",
              "text": "I'm no lawyer...but I feel like you'd have a considerable case against the family were you to lose your position as a result of this.  \n\n\nKEEP EVERYTHING. DOCUMENT EVERYTHING.",
              "author": "CreLoxSwag",
              "created": 1582643300,
              "upvotes": 37,
              "replies": {
                "fir7ltu": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fir7ltu/",
                  "text": ">case against the family were you to lose your position\n\nYeah, if played *very* carefully this could turn into a windfall.",
                  "author": "rlrl",
                  "created": 1582658965,
                  "upvotes": 11,
                  "replies": {
                    "fixegiu": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fixegiu/",
                      "text": "I’d seek legal counsel on THAT aspect now. Depending on where you live, there may be a civil suit to file here. That sort of disincentive could stop the family from pursuing the blackmail angle.",
                      "author": "SoTaxMuchCPA",
                      "created": 1582818792,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "firy59m": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firy59m/",
                  "text": "Yes, but if they just didn't get tenure, it could be a lot harder to prove anything, unless someone specifically mentions this somewhere.",
                  "author": "Average650",
                  "created": 1582673491,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fiq7jcg": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq7jcg/",
      "text": "This is nuts\n\n>I am in an open relationship. I suspect this would not be well received by my department and would likely jeopardize my ability to get tenure.\n\nThis is nuts-er. Why would \"being in an open relationship\" sabotage your tenure bid? Is your spouse on the committee/the dean and they just don't know your relationship is \"open\" yet? Is it an ultrareligious school?  Because those are the only 2 reasons I can think of?\n\n---\n\nAlso, the way to get out in front of blackmail - if you can - is to not be blackmailable. Which is tell the department in an open meeting that \"someone is trying to harm me by threatening to reveal tis fact which I have absolutely no problems with\".",
      "author": "lalochezia1",
      "created": 1582637398,
      "upvotes": 52,
      "replies": {
        "fiq85xf": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq85xf/",
          "text": "The issue is I am at a catholic university (though I am not catholic myself).",
          "author": "Tenurethrowaway1",
          "created": 1582637911,
          "upvotes": 47,
          "replies": {
            "fiq9dpt": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq9dpt/",
              "text": "What kind of evidence do they have that you're in an open relationship?",
              "author": "gunch",
              "created": 1582638848,
              "upvotes": 6,
              "replies": {
                "fiqbb2f": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqbb2f/",
                  "text": "Supposedly pictures of me on a date and pictures of my online dating profile (which I thought was set to private)",
                  "author": "Tenurethrowaway1",
                  "created": 1582640277,
                  "upvotes": 12,
                  "replies": {
                    "fiqbvz0": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqbvz0/",
                      "text": "Verify your profile settings. If they're really private one of two things is happening. Someone with whom you've shared your profile (a date) has screwed you over (super unlikely). Or they're flat out lying about what they have on you.\n\nPictures of a date are meaningless unless they're extremely intimate. Do you make a habit of making out at the table when you're on a date, sorry, business meeting?\n\nThe PR guy in me says: You could try to get out ahead of this. Tell your boss that the student obtained an old dating profile of yours and is trying to blackmail you with it.",
                      "author": "gunch",
                      "created": 1582640692,
                      "upvotes": 59,
                      "replies": {
                        "fiqcjkq": {
                          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqcjkq/",
                          "text": "> The PR guy in me says: You could try to get out ahead of this. Tell your boss that the student obtained an old dating profile of yours and is trying to blackmail you with it.\n\nI agree with getting out ahead of it, but if there is recent activity on the profile that will be an obvious lie. If it is necessary to lie, you gotta save the lies for a time that they can't be disproven.",
                          "author": "makemeking706",
                          "created": 1582641153,
                          "upvotes": 25,
                          "replies": {
                            "fiqh4vm": {
                              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqh4vm/",
                              "text": "> but if there is recent activity on the profile that will be an obvious lie\n\nActually, one of the well-known bad practices of most dating sites is that they will simulate activity on dead profiles (mostly to create the impression that the site is more popular than it is). Profiles that haven't been logged into in years and even profiles that have been disabled by the user (looking at you, match.com) show up as active, some apps with access to your GPS location will automatically update your location in the app even if you don't log in, etc. Distressed SOs showing up worried that their SO is cheating on dating apps only to find out that it's the apps pulling shenanigans is a meme on dating reddits.",
                              "author": "thegreenaquarium",
                              "created": 1582644199,
                              "upvotes": 30,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "fitr6j6": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fitr6j6/",
                      "text": "This is tough, because the whole point of online dating is to help you meet strangers. Privacy settings will help you filter out, e.g., friends and coworkers who you recognize. But all a PI would need to do is set up a semi-convincing fake profile for you to swipe right on.\n\nI'm not saying this is your fault. Just saying it's basically impossible to protect yourself if someone's going to stoop to scummy levels like this.",
                      "author": "xozorada92",
                      "created": 1582727533,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "firnuea": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firnuea/",
              "text": "A lot of Catholic universities have student codes of conduct that would include \"don't blackmail your professor\". You need to report this as part of the plagiarism investigation. Lawyer up and document if you are concerned, but helping the student get away with cheating will be worse than having your department find out about your marriage.",
              "author": "Unicormfarts",
              "created": 1582667934,
              "upvotes": 8,
              "replies": {}
            },
            "fiqhh3e": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqhh3e/",
              "text": "Does the school fire its professors or deny them tenure for infidelity? If not, you have nothing to worry about. Get a lawyer, and start building a case. If the student has the means to hire a PI, they have means and assets, and were probably coached - meaning you could probably go after the parents too. There are lots of damages here, and a significant amount of illegality.\n\nFurther, I can guarantee \"not hiring a PI to investigate a prof\" is somewhere in the student code of conduct in some form. This is clearly both a type of harassment combined with another type of academic dishonesty (blackmail), so the student will probably be expelled. \n\nLastly, you have credibility, they and their PI do not. You know much more than they do, and they are incentivized to lie. Who is the university going to believe? The student with a track record of dishonesty and their skeezy investigator or a professor? Dating profiles can be old and stale, photos can be doctored or taken of innocent conversations. Moreover, these are classic pressure tactics, \"you'd better do what we want or it's all going to shit\" is a common and effective argument. It can also crumbles quickly. Get a personal lawyer. A good one.",
              "author": "Dr_Marxist",
              "created": 1582644408,
              "upvotes": 13,
              "replies": {}
            },
            "fiqsh5h": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqsh5h/",
              "text": "[removed]",
              "author": null,
              "created": 1582650935,
              "upvotes": -13,
              "replies": {
                "fiqyvh8": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqyvh8/",
                  "text": "Professors should be able to do whatever the fuck they want in their personal lives. It's not OPs \"fault\", because they didn't do anything wrong.",
                  "author": "notadoctor123",
                  "created": 1582654086,
                  "upvotes": 6,
                  "replies": {
                    "fiqz98e": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqz98e/",
                      "text": "Work for a catholic school be subject to their stupid rules.",
                      "author": "Violent_content",
                      "created": 1582654280,
                      "upvotes": -6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "firtpdo": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firtpdo/",
      "text": "Delete this post, hire a personal attorney",
      "author": "khag",
      "created": 1582671050,
      "upvotes": 6,
      "replies": {}
    },
    "fis7vqg": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fis7vqg/",
      "text": "Your student can pay for a PI, but not for someone to proofread and edit their paper to make sure there's no plagiarism? Ok, dumb kid. Work. 🤦‍♀️",
      "author": "ContentBabyContent",
      "created": 1582679690,
      "upvotes": 6,
      "replies": {}
    },
    "fiu7imk": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiu7imk/",
      "text": "I had a student pull some shady crap like this on me. Take two pieces of advice from someone who has dealt with this:\n\n1) get your own lawyer ASAP\n2) get out in front of this with your department chair/head ASAP. If you don’t, makes you look like you have something to hide. Your relationship doesn’t need to come up initially if ever. Just the fact that you’re being investigated for possible blackmail leverage will get them on your side, and if or doesn’t you’ve established grounds for a grievance if you don’t get tenure",
      "author": "TheHoosierHammer",
      "created": 1582736467,
      "upvotes": 7,
      "replies": {
        "fyqv38z": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fyqv38z/",
          "text": "And whatever you do, don’t say one more word to the student unless an attorney advises you to do so, in person or via email. \n\nAnd I suspect the parents hired the PI to protect their precious baby from the mean professor.",
          "author": "OnMyThirdLife",
          "created": 1595317949,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fiq8q60": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq8q60/",
      "text": "(this is not scrupulous), but exactly what information does the PI have? This could easily be spun as a vengeful student coming after you fabricating information.",
      "author": "heliumagency",
      "created": 1582638348,
      "upvotes": 12,
      "replies": {
        "fiq904e": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq904e/",
          "text": "They supposedly have pictures of me out on dates with someone other than my wife.",
          "author": "Tenurethrowaway1",
          "created": 1582638558,
          "upvotes": 16,
          "replies": {
            "fiq9bmf": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq9bmf/",
              "text": "Short of more intimate pictures, I could see that this could be spun in a different way.",
              "author": "heliumagency",
              "created": 1582638804,
              "upvotes": 25,
              "replies": {
                "fiqaqlj": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqaqlj/",
                  "text": "\"That's just my personal penis inspector, nothing to see here.\"",
                  "author": "Sickened_but_curious",
                  "created": 1582639863,
                  "upvotes": 14,
                  "replies": {
                    "fiqay2e": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqay2e/",
                      "text": "LOL",
                      "author": "heliumagency",
                      "created": 1582640015,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fiqllhu": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqllhu/",
              "text": "It's an old school friend.\n\nIt's your second cousin.\n\nIt's your rheumatologist.\n\nI'm sure you can come up with an excuse that could appease your university. You are being blackmailed",
              "author": null,
              "created": 1582646920,
              "upvotes": 23,
              "replies": {}
            },
            "fiq9lwl": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq9lwl/",
              "text": "I don't know if this helps, but Depaul, a catholic university, doesn't seem to be too picky about it (see comments) \n\nhttps://insightscoop.typepad.com/2004/2011/04/depaul-a-catholic-school-sort-of-kinda-not-that-it-matters-or-something.html",
              "author": "heliumagency",
              "created": 1582639021,
              "upvotes": 9,
              "replies": {
                "fiqnhwt": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqnhwt/",
                  "text": "It varies a lot between sects. I don’t know much about Vincentians, but there is a lot of difference in campus rules like this between a Jesuit which are pretty loosely affiliated with the church itself and Diocese ones which are directly tied to the church. \n\nI still think OP is (perhaps rightfully) leaving out relevant information beyond just being in an “open relationship”. I’m not sure how that would be distinguished from dating to an outsider. When I was interviewing at catholic universities, there were out faculty, so I don’t think it’s simply an issue of that. \n\nI understand why OP isn’t giving details on reddit, and s/he is entitled not to. But the story isn’t complete from what I can tell.",
                  "author": "urnbabyurn",
                  "created": 1582648059,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "fiqp571": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqp571/",
              "text": "I agree with others, short of intimate pictures, you should be able to give enough plausible deniability for even a very conservative school.  Dating profiles can be faked and going out to dinner with your cousin or old friend could appear like a date. \n\nBut ultimately, you don't want to go at this alone.  Get a lawyer.",
              "author": "manova",
              "created": 1582649036,
              "upvotes": 7,
              "replies": {}
            },
            "firgxtf": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firgxtf/",
              "text": "Unfortunately, these days a guy who is documented to be on dates with people other than his wife has the best shot at promotion. Or...or...even the presidency!\n\nI’m sorry this is causing you so much stress. You and the people you care about in your life do not deserve this.",
              "author": "KnightLifer",
              "created": 1582664189,
              "upvotes": 4,
              "replies": {}
            },
            "fiscfir": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiscfir/",
              "text": "Who says it's a date?\n\nUnless you were tonguing someones tonsils in public, they have nothing to threaten you with.",
              "author": "Popeychops",
              "created": 1582682167,
              "upvotes": 1,
              "replies": {}
            },
            "fixekhz": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fixekhz/",
              "text": "“Oh, her? She’s a friend of mine. We’ve always been affectionate and we are both foodies so we love going fancy places.” There are a million ways to spin this.",
              "author": "SoTaxMuchCPA",
              "created": 1582818857,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fiqkref": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqkref/",
      "text": "I’m not a lawyer but it sounds like this might even rise above the point of blackmail to extortion, which is a federal crime with a mandatory minimum.\n\nAlso, just think of this from the perspective of your university.  If they deny you tenure over this after a student’s extortion of you, and you went to the press, your university would be completely disgraced.  They will not fire you over this.  Listen to everyone and get a lawyer.  Your student is extorting you and extortion does not stop when you capitulate.\n\nAlso, feel free to call the cops on a PI.  Stalking is also a crime and PIs are not protected from prosecution for it.",
      "author": null,
      "created": 1582646406,
      "upvotes": 18,
      "replies": {}
    },
    "fiqi3iy": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqi3iy/",
      "text": "> It has been strongly implied that details of my personal relationship will be leaked to the department unless I stop pursuing internal discipline against the student.\n\nIn the US that's blackmail, isn't it?",
      "author": "KajikiaAudax",
      "created": 1582644793,
      "upvotes": 6,
      "replies": {}
    },
    "fiqbc3y": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqbc3y/",
      "text": "1) Get a personal lawyer.\n\n2) Talk to the ombuds.",
      "author": "r3dl3g",
      "created": 1582640297,
      "upvotes": 5,
      "replies": {}
    },
    "fiqnfnk": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqnfnk/",
      "text": "Are you sure that being in an open relationship would cost you tenure? That would strike me as odd. Especially since academics tilt more open minded than average.",
      "author": "camilo16",
      "created": 1582648022,
      "upvotes": 3,
      "replies": {}
    },
    "fisbd0v": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fisbd0v/",
      "text": "Well that is blackmail, a crime and fairly sure another academic honesty violation,  Add in that reprisals are forbidden and you have a trifecta.\n\nSorry to be glib, and I really feel for you, but  if you think it is a secret, it probably is not.  If it is a secret for now, it won't be for long.  They power of the secret is gone from them if you tell the secret, and back on the offender with now criminal level offenses.  So this you should report to the police in addition to the integrity committee.\n\nAbsolutely get a consult with a lawyer.  Your local bar association should be able to recommend someone - in my experience the first consult is free anyway.\n\nKeep in mind that the school lawyers protect the school, and only you as far as those interests coincide.\n\nIf what you are doing is not illegal in the midwest, how can you be denied tenure (sorry to be naive).  Any decent lawyer would make it sound like that backed up the vengeance seeker rather than the integrity seeker.  That is a bad look.\n\nSorry this is all happening.",
      "author": "PersephoneIsNotHome",
      "created": 1582681587,
      "upvotes": 4,
      "replies": {}
    },
    "fisk4sn": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fisk4sn/",
      "text": "Are you part of a US NEA union and can you get legal representation that way? I would get legal rep from the state NEA and if you don't have one I would seek legal advice from the college. I'm sorry you are going through this! Surely your college honor and integrity system or Dean of Students (whomever oversees the student code of conduct and manages conduct violations) would see this as clear harassment from a student, toward a faculty member.",
      "author": "shealeigh",
      "created": 1582686374,
      "upvotes": 4,
      "replies": {}
    },
    "fj3kar3": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fj3kar3/",
      "text": "The problem is not the student hiring the PI, it is the fear the poster has about a tenure decision that would be shaped by his personal life. Unless, he is at a religious institution where he has signed a faith statement, then the fight is with the department. A lawyer can definitely help with that, and now he knows he has to document and do everything he can to clearly meet the tenure requirements. Whether it is publications, service or exceptional teaching, now he has to clearly exceed expectations. Make sure your attorney deals with academics and academia as part of his practice. I hope he has a union to defer some of the cost. Welcome to the world of the marginalized, I don’t know if you have earned a place at the table, but you are definitely in the room.",
      "author": "DSwivler",
      "created": 1582986166,
      "upvotes": 4,
      "replies": {}
    },
    "fiq9cru": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq9cru/",
      "text": "I don't see how your personal life is any concern of the university, and if they fire you for that in the UK you can sue them for unfair dismissal and get a HUGE payout. I'm not sure on American law. I guess that is something you need to find out.",
      "author": "LiftingHistorian",
      "created": 1582638829,
      "upvotes": 11,
      "replies": {
        "fiqbguj": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqbguj/",
          "text": "There are many states in the US where LGBT is not a protected status so you can be fired for being gay in those states.  Religious institutions or those run by religious institutions such as a Catholic University or a Catholic Hospital are exempt from the LGBT protected status even in states where it is a protected status because they can claim that it goes against their faith to have LGBT employees.  It's even legal for them to NOT cover birth control in their employer-paid health insurance plans.  It's pretty messed up.",
          "author": "eLearningChris",
          "created": 1582640391,
          "upvotes": 9,
          "replies": {
            "fiqbt85": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqbt85/",
              "text": "OP said niothing about being LGBT, but that could be relevant.\n\nAll I know is that America be messed up...",
              "author": "LiftingHistorian",
              "created": 1582640637,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "fiqv0yx": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqv0yx/",
      "text": "Why would your university be interested that you are in an open relationship?",
      "author": "jschundpeter",
      "created": 1582652184,
      "upvotes": 3,
      "replies": {
        "fir1nsb": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fir1nsb/",
          "text": "Organizational politics. Academia is cut throat and extremely petty things can derail you from obtaining tenure.",
          "author": "_HEDONISM_BOT",
          "created": 1582655587,
          "upvotes": 7,
          "replies": {
            "firecqt": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firecqt/",
              "text": "That’s why you want to befriend every pre-law student during your undergraduate career then you become good friends with a ton of lawyers later on.",
              "author": "apl2291",
              "created": 1582662778,
              "upvotes": 2,
              "replies": {
                "firh1tg": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firh1tg/",
                  "text": "Brilliant!",
                  "author": "KnightLifer",
                  "created": 1582664248,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fir153h": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fir153h/",
      "text": "I mean isn't this essentially black mail? Police report & lawyer up.",
      "author": "ylang_ylang",
      "created": 1582655289,
      "upvotes": 3,
      "replies": {}
    },
    "firelua": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firelua/",
      "text": "Reading this sub. makes me think how monotone my life in the academia.",
      "author": "Existenceisfutile1",
      "created": 1582662915,
      "upvotes": 3,
      "replies": {
        "firhc4m": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firhc4m/",
          "text": "Be thankful.",
          "author": "KnightLifer",
          "created": 1582664404,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fit5vrl": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fit5vrl/",
      "text": "OP, this student had a PI follow you, they ARE going to release this information on you as the icing on the cake for them. Please don’t ruin your life for the completely 0% chance that this kid will stay quiet. Next they will be asking you for money and for their friends to get to cheat.",
      "author": "majoses77",
      "created": 1582705853,
      "upvotes": 3,
      "replies": {}
    },
    "fium33n": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fium33n/",
      "text": "F that prick student, sounds like hes got too much money anyways.",
      "author": "SaltZombE",
      "created": 1582743996,
      "upvotes": 3,
      "replies": {}
    },
    "fiqbv96": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqbv96/",
      "text": "Find yourself an outside attorney, now. By telling you to drop the process or else they will take your information is possibly a crime (I can't think of the word at this moment).\n\nEdit: I've just read many of the comments, and have a better grasp of your situation. Have you told your wife of the blackmail situation? Both if you should stop the \"open relation ship\" for now, and allow this kid to play his games (be sure to check with that lawyer). Deny everything he says. Get him kicked out. Continue having fun. If anything happens to you, you maybe able to go after him for the damage.",
      "author": null,
      "created": 1582640677,
      "upvotes": 4,
      "replies": {}
    },
    "fiqctc1": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqctc1/",
      "text": "It sounds to me like you are trying to hush it up and allow yourself to blackmailed. I understand that you believe you won't find another job if you don't get tenure, but think about it this way. If this student is successful in getting what they want from you by blackmailing you, other students may realize that you can be blackmailed just by telling you they will snitch to your dean that you are in an open relationship. And frankly, there's no way to stop this particular student from telling your dean regardless of your actions. They may still decide to retaliate against you. You're giving all the power to this kid.\n\nYou keep saying that you're at a catholic school, but from what I understand, some schools are more liberal than others. If it was ultraconservative, I'd guess that you being in a (nonmarital) relationship alone would be an issue. Which it is apparently not, which makes me think that maybe it's not such a big deal. Are you 100 % certain that your school forbids open relationships? If the school does explicitly forbid it, pretend that it was never a secret and go public with everything. You report that student to the police for blackmailing, send an open email to the whole school, post about it on twitter (@academicchatter and maybe other channels relevant to social sciences and PM me on reddit, I'm willing to retweet). Start an effing twitter storm if you have to.\n\nSo let me rephrase this: It is absolutely unacceptable that a school would accept their professors to be abused in this way! This student should be expelled immediately. You did nothing be ashamed of!",
      "author": "rpfflgt",
      "created": 1582641344,
      "upvotes": 6,
      "replies": {
        "fiqnxi8": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqnxi8/",
          "text": "I’m sure the university would take action against the student. I’m just also fairly sure when I’m up for tenure, they will decide for vague reasons that I haven’t proven myself.",
          "author": "Tenurethrowaway1",
          "created": 1582648317,
          "upvotes": 9,
          "replies": {
            "fiqyg31": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqyg31/",
              "text": "Failure to secure tenure doesn't mean the end of your career.  It doesn't even mean the end of your employment at your institution, judging from a prof who retired a few years ago from mine.  He taught here for 30 years after failing to win tenure.  He was one of our best.",
              "author": "RiverThatBends",
              "created": 1582653866,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fiqhb6b": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqhb6b/",
      "text": "Do *NOT* give in.  Maybe the idea of a controversy about your open relationship is scary, but would a controversy about letting a plaigiarizing student off easy be any better?  At least with the open relationship you can make the argument that it’s none of the school’s business and isn’t hurting anyone.",
      "author": "Autismetal",
      "created": 1582644307,
      "upvotes": 4,
      "replies": {}
    },
    "fiq84uv": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiq84uv/",
      "text": "Get a lawyer and seek some advice on /r/legaladvice as well.",
      "author": "Powerful_Material",
      "created": 1582637886,
      "upvotes": 2,
      "replies": {}
    },
    "fiqnna6": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqnna6/",
      "text": "Fuck that student (not literally) and hope for the best.",
      "author": "m_czar",
      "created": 1582648147,
      "upvotes": 2,
      "replies": {}
    },
    "fir3pkj": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fir3pkj/",
      "text": "I want to join the chorus of others saying that you should speak with an attorney as soon as possible. None of us are lawyers, and you need the expertise of someone who knows the law, how to navigate a situation like this one, and the pros and cons of such actions as going to the police. A lawyer can also help you to determine what, if anything, to share with your department about the PI and their threats.\n\nI'm so sorry that you're experiencing this. You clearly did the right thing, and this student's actions are entitled and seek to get out of the consequence they deserve for their action. As difficult as this is, it also goes without saying that you should stand firm to the principles of academic integrity and not give into this student's extortion attempt to get out of punishment for plagiarism.",
      "author": "jogam",
      "created": 1582656750,
      "upvotes": 2,
      "replies": {}
    },
    "firou9a": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firou9a/",
      "text": "So sorry to hear this OP.\n\nAre you certain your department would actually take action against you for your personal relationship choices?  I can’t imagine that to be the case, unless you teach at a religious university.",
      "author": null,
      "created": 1582668500,
      "upvotes": 2,
      "replies": {}
    },
    "firs03s": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firs03s/",
      "text": "> I suspect this would not be well received by my department and would likely jeopardize my ability to get tenure. \n\nWhat!? That's unbelievably shocking to me if true. Surely the department should be supporting you through an egregious breach of your privacy.",
      "author": "EmeraldIbis",
      "created": 1582670189,
      "upvotes": 2,
      "replies": {}
    },
    "fis3b7e": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fis3b7e/",
      "text": "I would contact a lawyer right away. And then probably you will need to get your union involved. The university can't turn a blind eye to retaliation like this or it brings the entire system into disrepute. What a terrible situation.",
      "author": "ramblin11",
      "created": 1582676827,
      "upvotes": 2,
      "replies": {}
    },
    "fis3f0k": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fis3f0k/",
      "text": "It’s not possible to flunk a student for academic misconduct unless you have filed an academic misconduct report and the student is entitled to a hearing, and so forth. Presuming that you’ve gone through the appropriate channels for the misconduct charge and assigning the grade of F for academic misconduct as appropriate, the student is harassing you. This is something absolutely must make known to the college or university, so that they can bring further sanctions against the student for personal misconduct, if necessary. That’s the School part to which you need to attend. The other part is indeed about your personal life and that you bring to the attention of the police.\nAnd none of this should  have any bearing on tenure and promotion.",
      "author": "mmilthomasn",
      "created": 1582676896,
      "upvotes": 2,
      "replies": {}
    },
    "fis4lk6": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fis4lk6/",
      "text": "One thing I don’t understand about this - why do you expect your open relationship to be a concern for the department? I mean, perhaps on a discriminatory level like LGBT people face, but I can’t imagine that they would be allowed to consciously/formally consider this as a liability in approving tenure.",
      "author": "echoGroot",
      "created": 1582677657,
      "upvotes": 2,
      "replies": {}
    },
    "fiseyml": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiseyml/",
      "text": "Sorry to have read this.  My only single point, for what it is worth is that I am not sure that you should be looking at it as a single student issue.  People talk, students talk.  Quash this one student, and nothing is to say that it will not be raised next year with another student - or in 5 years, or ten years.  And honestly, even if you caved completely you are just giving more ammunition that can be used against you.  \n\nFor what It is worth, I really am sorry that doing the right thing originally got you in such a difficult situation.",
      "author": "Life_time_learner",
      "created": 1582683560,
      "upvotes": 2,
      "replies": {}
    },
    "fitg48h": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fitg48h/",
      "text": "If there's blackmailing involved then right now you're a victim. If you remain silent and do nothing you'd become complicit.",
      "author": "Notrlymybusinessbut",
      "created": 1582718878,
      "upvotes": 2,
      "replies": {}
    },
    "fiybr7t": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiybr7t/",
      "text": "Why would an open relationship hurt you? It isn’t illegal and completely personal...",
      "author": "AcademicDifficulty",
      "created": 1582836371,
      "upvotes": 2,
      "replies": {}
    },
    "fj8pzyf": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fj8pzyf/",
      "text": "Wow that’s fucked",
      "author": "schweppes-ginger-ale",
      "created": 1583119289,
      "upvotes": 2,
      "replies": {}
    },
    "fiqcc0b": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqcc0b/",
      "text": "I guess the student has some money in order to hire a PI and a bit of a disorder that they would do something like that. What's really terrible about this is, you did your job and now it's going to cost you monetarily and potentially career-wise.   \n\n\nWith that said, I can't imagine people will hold your lifestyle against you. If you are not hurting anyone and it's a consenting situation then sit the f@#k down prudes.",
      "author": "DrippyCheeseDog",
      "created": 1582641004,
      "upvotes": 1,
      "replies": {}
    },
    "fit6wra": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fit6wra/",
      "text": "I thought open relationships are pretty common and normal. Maybe even moreso in academics. If anyone denies you career opportunities based on that, I'm guessing they are inviting trouble.",
      "author": "baenpb",
      "created": 1582707245,
      "upvotes": 2,
      "replies": {}
    },
    "fiqatsf": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqatsf/",
      "text": "I feel there is more to this than just an open relationship. Are you cheating with your wife, is the person you're seeing a sugar baby or sex worker? I feel there is an aspect of immorality potentially other than just an open relationship, because I don't see how this is such a big deal.",
      "author": "chemgirlie",
      "created": 1582639929,
      "upvotes": 6,
      "replies": {
        "fiqbsi8": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqbsi8/",
          "text": "Yeah. Only way I see this is a big deal is if op is in a relationship with a student.",
          "author": null,
          "created": 1582640622,
          "upvotes": 8,
          "replies": {
            "fiqcpae": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqcpae/",
              "text": "She’s not a current student and she was not in my department.",
              "author": "Tenurethrowaway1",
              "created": 1582641265,
              "upvotes": 8,
              "replies": {
                "fiqczar": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqczar/",
                  "text": "So the affair started when she was a student?",
                  "author": "chemgirlie",
                  "created": 1582641462,
                  "upvotes": 0,
                  "replies": {
                    "fiqdf17": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqdf17/",
                      "text": "No",
                      "author": "Tenurethrowaway1",
                      "created": 1582641764,
                      "upvotes": 8,
                      "replies": {
                        "fiqdnea": {
                          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqdnea/",
                          "text": "Well I am sorry about this either way. I wish you the best of luck. Please get a lawyer and cease all communications with the party trying to exploit you.",
                          "author": "chemgirlie",
                          "created": 1582641925,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fiqc5js": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqc5js/",
              "text": "That's a very good question. They said the revelation would generate controversy among students.",
              "author": "chemgirlie",
              "created": 1582640879,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fiqcb0b": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqcb0b/",
          "text": "I get the feeling that it may be a same-sex extramarital date that the PI discovered. OP uses the term “person” rather than woman. Could be an issue of same-sex preferences of the OP at a Catholic university.\n\nPlease note - I do not care at all who OP is involved with - I attended a conservative southern university for undergrad where this would be 100% the death of any professor. Even if they didn’t come out and say why they canned the prof, they’d claim some other reason and definitely do away with them. They would stop tenure or fire any professor who they considered outside of their religious views. \n\nIt was awful and I didn’t fully understand the oppression of the profs at our school until after I graduated. If that’s the case for OP, I hope he sticks up for himself and, if it backfires, I hope he documents everything and sues them to the moon and back while finding a place he’s accepted.",
          "author": "JPReinhold",
          "created": 1582640985,
          "upvotes": 5,
          "replies": {
            "fiqcj6z": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqcj6z/",
              "text": "Yeah I am not trying to speculate, but there is definitely something else going on. \n\nFor instance, if it was just an open relationship, the OP could claim he and the wife are estranged or separated (but still living together) or just in an open relationship. Definitely not super orthodox but whatever, so to me there seems to be something more complicated going on.",
              "author": "chemgirlie",
              "created": 1582641146,
              "upvotes": 5,
              "replies": {
                "fiqcp3s": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqcp3s/",
                  "text": "Either way, it’s blackmail and it’s totally FUBAR.",
                  "author": "JPReinhold",
                  "created": 1582641262,
                  "upvotes": 7,
                  "replies": {
                    "fiqcy9j": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqcy9j/",
                      "text": "OP said it's a student",
                      "author": "chemgirlie",
                      "created": 1582641441,
                      "upvotes": -6,
                      "replies": {
                        "fiqgike": {
                          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqgike/",
                          "text": "They didn't. How about you stop slandering people.",
                          "author": "simoncolumbus",
                          "created": 1582643807,
                          "upvotes": 10,
                          "replies": {
                            "fiqjnd5": {
                              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqjnd5/",
                              "text": "They said they are in a relationship with a former student not in their department.",
                              "author": "chemgirlie",
                              "created": 1582645734,
                              "upvotes": -3,
                              "replies": {
                                "fiqrcbu": {
                                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqrcbu/",
                                  "text": "So, not a student, yes? An alumnus. I think that's pretty far from the \"something else going on\" that you're angling for.",
                                  "author": "Waytfm",
                                  "created": 1582650324,
                                  "upvotes": 4,
                                  "replies": {}
                                },
                                "fiqt0x9": {
                                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqt0x9/",
                                  "text": "over 30% of the US population are former university students. I even suspect many of us are dating one (or many) such student right now. Escandalo!",
                                  "author": "thegreenaquarium",
                                  "created": 1582651204,
                                  "upvotes": 4,
                                  "replies": {
                                    "fiqwvet": {
                                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqwvet/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1582653081,
                                      "upvotes": 3,
                                      "replies": {
                                        "fiqygdk": {
                                          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqygdk/",
                                          "text": "I got one on you - I've pretty much only dated former students ever since I graduated from college. I've met them at bars, parties and on dating sites, I've gone out with hundreds of them and even hoodwinked some into serious relationships with me, and I even fucked one on a dock in Finland. I am clearly a grade A predator and deserve to loose (sic) my job.",
                                          "author": "thegreenaquarium",
                                          "created": 1582653870,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fiqi26f": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqi26f/",
                  "text": "I don’t see why it’s unrealistic for the OP to just have an open relationship with his wife.  It’s not like it’s unrealistic for people to get prejudiced over that.",
                  "author": "Autismetal",
                  "created": 1582644771,
                  "upvotes": 5,
                  "replies": {
                    "fiqjp7o": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqjp7o/",
                      "text": "It's with a former student (not of OP) which is also an issue.",
                      "author": "chemgirlie",
                      "created": 1582645763,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                },
                "fiqdh2r": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqdh2r/",
                  "text": "> I am not trying to speculate\n\nReally? I definitely seems like you are",
                  "author": "ProbabilisticWorld",
                  "created": 1582641803,
                  "upvotes": 8,
                  "replies": {
                    "fiqdlr8": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqdlr8/",
                      "text": "I was correct in that there is something else going on.",
                      "author": "chemgirlie",
                      "created": 1582641893,
                      "upvotes": -2,
                      "replies": {}
                    }
                  }
                },
                "fiqls4j": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqls4j/",
                  "text": "are you familiar with the ten biblical commandments? are you aware that one of them states, thou shalt not commit adultery? given these priors, can you figure out why violating a fundamental tenet of the Christian faith, even with a straight woman who is nobody's student, may be a problem for OP's employment at a Christian university?",
                  "author": "thegreenaquarium",
                  "created": 1582647033,
                  "upvotes": 5,
                  "replies": {
                    "fiqqat8": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqqat8/",
                      "text": "If you're in an open relationship it's not adultery as they're not cheating on each other. OP should just delete this post and seek legal advice.",
                      "author": "chemgirlie",
                      "created": 1582649709,
                      "upvotes": -6,
                      "replies": {
                        "fiqrw46": {
                          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqrw46/",
                          "text": "OK\n\nFirst. Per the Catechism, if you are having sexual relations with anyone who is not your wedded spouse, you are committing adultery. It doesn't matter if it's consensual, you're poly, you both have a cuckolding fetish, or anything else. Here, [I googled it for you](https://en.wikipedia.org/wiki/Thou_shalt_not_commit_adultery#Catholic_Church).\n\nSecondly, it's nice that you're so #woke, but most of the world isn't. People who belong to the religious establishment of a church that is so behind the times that they prohibit birth control in particular are unlikely to be woke. I'm glad you are privileged enough to not live a life where you are confronted with this reality every day but - please, for the sake of everyone who isn't clueless, educate yourself.",
                          "author": "thegreenaquarium",
                          "created": 1582650647,
                          "upvotes": 6,
                          "replies": {}
                        },
                        "fiqx1dv": {
                          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqx1dv/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1582653159,
                          "upvotes": 1,
                          "replies": {
                            "firb8ve": {
                              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firb8ve/",
                              "text": "[shes an undergrad](https://www.reddit.com/r/entp/comments/cr0e07/i_am_hating_being_a_high_achieving_entp/)",
                              "author": "thegreenaquarium",
                              "created": 1582661037,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "firz2b8": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firz2b8/",
          "text": "If it's a catholic university,l it's understandable that some might have issue with an open relationship. And, all it takes it one person. I understand their trepidation, though I think trying to hide it won't help them.",
          "author": "Average650",
          "created": 1582674072,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fiswjyv": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiswjyv/",
      "text": "Yeah i gotta guess that its not an open relationship he found out about. Even a religious school in the Midwest would take his side and crack down on that kid extremely hard.",
      "author": "goatyard",
      "created": 1582695491,
      "upvotes": 2,
      "replies": {}
    },
    "fis1j7k": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fis1j7k/",
      "text": "Jesus this is unbelievable. I don't have any advice better than what others have already said. Just wanted to say I'm sorry you are going through this.",
      "author": "mathisfakenews",
      "created": 1582675684,
      "upvotes": 1,
      "replies": {}
    },
    "fj6v9bt": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fj6v9bt/",
      "text": "Wait. What’s wrong with being in an open relationship?  Carry on and tell the shit to fu$% off.  I hope they get expelled for plagiarism, blackmail, etc.",
      "author": "fifidom",
      "created": 1583080915,
      "upvotes": 1,
      "replies": {}
    },
    "fl5ilw6": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fl5ilw6/",
      "text": "As the price of college gets steeper,  kids and their families are more demanding and feel entitled to a degree. \n\nLots of families are paying $75,000 a year now and a sharp teacher catching their sloppy, lazy work is going to feel the heat of anger — international students do this all the time and a large percentage are expelled every year( sorry just sharing facts ) I have learned that some of this behavior is cultural and with so much at stake they cAnnot cope with the shame so they attack back HARD.\n\nSo sorry to hear this - something everyone needs to think about these days.",
      "author": "SunnyDay27",
      "created": 1584837598,
      "upvotes": 1,
      "replies": {}
    },
    "fliu4lu": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fliu4lu/",
      "text": "I believe this is extortion",
      "author": "ELITEMGMIAMI",
      "created": 1585190770,
      "upvotes": 1,
      "replies": {}
    },
    "fmzp55q": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fmzp55q/",
      "text": "Any updates?",
      "author": "KnightLifer",
      "created": 1586526482,
      "upvotes": 1,
      "replies": {}
    },
    "fqqnf6i": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fqqnf6i/",
      "text": "I am so sorry this has happened to you. It also makes me appreciate being in a country where the concept of tenure for academics do not exist: you are either employed or not. That you feel your tenure is threatened is terrible and I really hope this works out for you.\n\nIt sounds like the student is out to get you. In my opinion, your uni should take stand against blackmail and protect their staff. If the student cheated via plagiarism then thats that and all subsequent actions are not relevant to the staff anymore - doesn't matter what the PI found. If I was HoD and someone sent me a PI file on one of my staff, I would chuck it in the bin. If it isnt academically or criminally related, its not my business to begin with.\n\nI realize this post is a bit old now. I hope this worked out for you. Like others have said, document everything!",
      "author": "Zaknafein2003",
      "created": 1589568583,
      "upvotes": 1,
      "replies": {}
    },
    "fiqd3xm": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqd3xm/",
      "text": "I'd take this to HR right now, and get legal involved.",
      "author": "ph0rk",
      "created": 1582641552,
      "upvotes": 1,
      "replies": {}
    },
    "fit89f1": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fit89f1/",
      "text": "You done fucked with the wrong kid. Good luck.",
      "author": null,
      "created": 1582709094,
      "upvotes": 1,
      "replies": {}
    },
    "fiqo9bt": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqo9bt/",
      "text": "I don't know how shady PIs in the US are. Is there a chance they tap into your WiFi or other aspects of your online activities? If so, you might want to talk to a trusted IT nerd to get your router reset and change some online behaviors to be save. Just because they \"found\" something the old fashioned way doesn't necessarily mean they do not have some access to your internet stuff. I am very sorry for your situation.",
      "author": "bhp91",
      "created": 1582648514,
      "upvotes": 1,
      "replies": {}
    },
    "fiqdg5t": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqdg5t/",
      "text": "How can this jeopardize your tenure for having an open relationship? Isnt that illegal?",
      "author": "Jzero1337",
      "created": 1582641786,
      "upvotes": 0,
      "replies": {
        "fiqsgay": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fiqsgay/",
          "text": "[deleted]",
          "author": null,
          "created": 1582650923,
          "upvotes": 6,
          "replies": {
            "firiu2w": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firiu2w/",
              "text": "But isnt that illegal?",
              "author": "Jzero1337",
              "created": 1582665213,
              "upvotes": 1,
              "replies": {
                "fit39qs": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fit39qs/",
                  "text": "Workers rights? What are you? Some sort of communist!?!?!",
                  "author": "BlokeyBlokeBloke",
                  "created": 1582702614,
                  "upvotes": 3,
                  "replies": {}
                },
                "fissazf": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fissazf/",
                  "text": "There are only a limited amount of reasons that you can't fire someone in some places. Your boss could make a rule that you can't wear a certain color of socks and fire you over it in some venues.",
                  "author": "thatprofessoryouhate",
                  "created": 1582691972,
                  "upvotes": 2,
                  "replies": {
                    "fitze27": {
                      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fitze27/",
                      "text": "Oh...",
                      "author": "Jzero1337",
                      "created": 1582732496,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fire244": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fire244/",
      "text": "That is defamation.  Hire an attorney or consult your university’s legal counsel.  This student should be expelled.",
      "author": "apl2291",
      "created": 1582662619,
      "upvotes": -1,
      "replies": {
        "firjydh": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firjydh/",
          "text": "> defamation\n\nNo. Defamation is the communication of a *false* statement about someone to hurt their reputation.",
          "author": "NosemaCeranae",
          "created": 1582665812,
          "upvotes": 5,
          "replies": {
            "firz6q9": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firz6q9/",
              "text": "Don’t you have some benzoate degraders to attend for or other things to take care of in lab?",
              "author": "apl2291",
              "created": 1582674149,
              "upvotes": -7,
              "replies": {}
            }
          }
        }
      }
    },
    "firqvq1": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/firqvq1/",
      "text": "[removed]",
      "author": null,
      "created": 1582669635,
      "upvotes": -1,
      "replies": {
        "fisgh7x": {
          "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fisgh7x/",
          "text": "> If you are entertaining the notion of backing down due to personal cost of holding fast to this ideal, you are not worthy of your current position\n\nThis is probably the least true and most unhelpful statement here. OF COURSE OP is worthy of their current position. They’re concerned about what this bully may be able to do to them — and they should be. It’s a valid concern, and saying otherwise is possibly the most arrogant thing I’ve read here. \n\nAs for the rest of your statement suggesting that if this is really a deal-breaker for the tenure committee, it’s time to move on, I couldn’t agree more. OP doesn’t need the hassle of trying to keep such people happy for an entire career.",
          "author": "RiverThatBends",
          "created": 1582684391,
          "upvotes": 4,
          "replies": {
            "fj6wwmu": {
              "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fj6wwmu/",
              "text": "Really, it boils down to this.  Without honesty an academic has nothing.  We serve two primary functions: reporting findings and teaching students.\n\nIn both cases, if we are shown to be dishonest, none of our work holds any value any longer.  Every result becomes unreliable and every student we certify and graduate would have to be regarded with suspicion.  Did they learn, or did they succeed at blackmail?\n\nSo no, a compromised academic must be an academic no longer.",
              "author": "pngwen",
              "created": 1583081891,
              "upvotes": 0,
              "replies": {
                "fj83lcb": {
                  "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fj83lcb/",
                  "text": "Arrogance and more arrogance. Spoken like a true tenured professor who is either ignorant or callously uncaring of the adjunctification of their younger colleagues. You make me sad. \n\nOP, u/Tenurethrowaway1, do what you must to protect yourself without compromising your personal or professional principals. Fortunately, u/pngwen doesn’t likely sit on your tenure committee. You can safely disregard their opinion and slander of your worthiness to teach.",
                  "author": "RiverThatBends",
                  "created": 1583104387,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fistzd6": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fistzd6/",
      "text": "Is that allowed? He is harassing you, talk to your union and see if they can get you a lawyer for harassment, invasion of privacy, I mean this is wrong on so many levels. Even if they found out you’re in an open relationship who cares!!! It’s none of their business and I would file a grievance report if they did even showed the slightest amount of fucks given. \n\nIt is your job to educate and protect the reputation of the school, this is what you are doing, it’s what you have done, it’s what you did, case closed. \n\nMan I should’ve been a lawyer!",
      "author": null,
      "created": 1582693295,
      "upvotes": -1,
      "replies": {}
    },
    "fitaltg": {
      "link": "/r/AskAcademia/comments/f9a58a/i_flunked_someone_for_plagiarism_i_just/fitaltg/",
      "text": "You shouldn’t have flunked him for plagiarism but also report him",
      "author": "emeraldcyan",
      "created": 1582712255,
      "upvotes": -5,
      "replies": {}
    }
  }
}