{
  "sid": "c6f6eg",
  "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/",
  "title:": "How can we make academic conferences affordable and inclusive?",
  "text": "Edited: There are projects out there, which aim to help students and early-career scholars travel to conferences by staying with other academics rather than paying for hotels. What other suggestions do people have?",
  "author": "sugibi",
  "created": 1561692925,
  "updated": 1634081328,
  "over_18": false,
  "upvotes": 140,
  "upvote_ratio": 0.94,
  "comments": {
    "es8fk7p": {
      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es8fk7p/",
      "text": "Man...this is great! I had to go across the country to present research and my school didn’t even fund me enough for my plane ticket :/",
      "author": "juicykeyboard",
      "created": 1561696201,
      "upvotes": 20,
      "replies": {}
    },
    "es9a80d": {
      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9a80d/",
      "text": "[deleted]",
      "author": null,
      "created": 1561731409,
      "upvotes": 18,
      "replies": {
        "es9cdzu": {
          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9cdzu/",
          "text": ">I like some of the ideas proposed in these comments, particularly those involving hosting them on campus.\n\nGood luck hosting one of the major conferences with 6000+ attendees and 17 concurrent sessions \"on campus\"",
          "author": "tchomptchomp",
          "created": 1561732929,
          "upvotes": 5,
          "replies": {
            "es9zbi8": {
              "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9zbi8/",
              "text": "[deleted]",
              "author": null,
              "created": 1561747938,
              "upvotes": 3,
              "replies": {
                "esan498": {
                  "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esan498/",
                  "text": "Most conferences are not in remote places. Typically they are hosted by large institutions or groups of institutions which form a center of research capacity in a major urban area capable of hosting said conference. I'm not talking about small 100-200 person conferences that are hosted by small regional societies or that represent an occasional focal meeting on a subject of niche interest. I'm talking about the bigger academic societies. These are typically held in or around major urban centers with international airports. Why? Because you need a big meeting center and associated hotel space to host all the attendees.\n\n&#x200B;\n\nI will also note that many/most of these meetings are held in the US, which further reduces the cost of travel for many/most attendees from North American institutions (although it places a high burden on international attendees, particularly attendees from East Asia, Africa, and Latin America). Imagine the travel costs associated with intercontinental travel for your colleagues from, say, Johannesburg or Buenos Aires.\n\n&#x200B;\n\nIn terms of disparity of travel allocation, the real issue is the size of the pot rather than the way it's being allocated. The pot is small and students are expected to make due with essentially no money. Why? Largely because of a few things. First and foremost, there have been massive funding cuts to education from many/most governments (state, federal, etc), which means that there are fewer discretionary funds from which to draw money for travel grants. Second, funding agencies are pushing for more and more trainees on a given project or operating grant and are awarding fewer grants in general, meaning that fewer student travel grant costs can be paid out of grant money while there are more students, leading to many more people relying on travel grants. Finally, as these meetings get bigger, it becomes harder and harder to get a truly competitive bid from hosting venues. A multi-thousand-person meeting is restricted to a relatively small number of convention centres with essentially noncompetitive hosting prices, which means the base cost of hosting these meetings is much higher as well.\n\n&#x200B;\n\nPoint here is that this is a really complicated issue without a clear obvious solution.",
                  "author": "tchomptchomp",
                  "created": 1561763547,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "es9dxl8": {
              "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9dxl8/",
              "text": "Some sessions can be divided up to different days and different locations. Also there are so many state universities with multiple locations and huge venues that can easily host that many sessions/attendees.",
              "author": "sugibi",
              "created": 1561733969,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "es9akji": {
          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9akji/",
          "text": "Definitely. The same goes for part-time faculty and adjuncts.",
          "author": "sugibi",
          "created": 1561731660,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "es928cx": {
      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es928cx/",
      "text": "Travel less, and where travel is essential, be mindful. Take London, for example. Reading is potentially less than half an hour away on the train, and prices are a fraction there of what they are in London.\n\n&#x200B;\n\nInclusivity-wise, sign language interpreters should be standard, there should be plain-text descriptions of photos where possible, quiet zones, prayer rooms, amongst other things.",
      "author": "SallyShitstain",
      "created": 1561724977,
      "upvotes": 10,
      "replies": {
        "es94qce": {
          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es94qce/",
          "text": "I like all of these. Accessibility is definitely an issue that is never really addressed. There should be at least a reserved row at the front, like in buses. If you are slow to get to a session, you might end up in the back. And when you are even slightly visually or hearing impaired, you really can't see or hear what is going on. I also wish these conferences had an orientation package (what to do, what to wear, how to navigate) for first time attendees. Especially for those huge annual conferences. It is a very un-welcoming (and scary) experience to go to those conferences as a student for the first time.",
          "author": "sugibi",
          "created": 1561727198,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "es93hlw": {
      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es93hlw/",
      "text": "I'm not exactly sure why everyone is focusing on travel so far. Conferences are expensive because of the professional for profit companies that are the ones organizing them 99% of the time. If you want to make them cheaper, convince schools to let academics organize them there during the summer and use the currently empty dorms for lodging/classrooms for talks.  You still have the issue of getting there, but that cuts lodging and registration costs by ~80%",
      "author": "Mezmorizor",
      "created": 1561726130,
      "upvotes": 17,
      "replies": {
        "es94elg": {
          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es94elg/",
          "text": "In my discipline the big conferences are organized by non-profit organizations. They are not making money off of the conference, it is in fact a huge burden to them to organize it. The money goes mostly to the hotel fees: Conference hotels require certain staff (like IT) to be in the rooms, they charge fees for using this and that. Even though these hotels offer conference rates, you are still staying at a hotel you wouldn't otherwise stay (and paying for their $10 bottled water because your conference picked a golf resort in the middle of nowhere). That's why your solution (have the conferences on university campuses, stay at their dorms) would actually reduce cost. Then travel grants/funds would actually be sufficient because you would using it mostly for travel and not lodging. I don't know why the organizers of these conferences can't see this.",
          "author": "sugibi",
          "created": 1561726920,
          "upvotes": 13,
          "replies": {}
        },
        "es9j66d": {
          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9j66d/",
          "text": "As someone who works in university housing, I’d say that most universities’ dorms are not empty during the summer. At my institution they are used for summer camps and conferences, and they definitely charge for housing. Even university-affiliated groups. That’s how many schools make extra money to facilitate the upkeep, remodeling, and construction of new buildings combined with other funds and grants. \n\nIt would still be a much more affordable option than hotels though and bring down the costs some, but free is likely impossible. Someone still needs to be paid for cleaning the spaces, other building employees like directors and RAs need to be paid, utilities, etc.",
          "author": "greensleeves97",
          "created": 1561737418,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "es9cbin": {
      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9cbin/",
      "text": "The way to make academic conferences more affordable and inclusive to to do more small regional conferences and more topic-oriented conferences, and move away from the megaconference model that requires extensive financial investment by the organization.",
      "author": "tchomptchomp",
      "created": 1561732883,
      "upvotes": 4,
      "replies": {
        "es9f95b": {
          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9f95b/",
          "text": "The aerospace field used to do this. They had dozens of small conferences throughout the year. But it became financially unsustainable because there's a baseline cost to put each one on. So the more you do, the more it costs. It also meant people had to travel to multiple conferences a year. Now they've combined them all into a handful of larger conferences and it's sustainable. The registration cost per conference went up, but less than the registration cost of two of the smaller ones previously.",
          "author": "Plasma4life",
          "created": 1561734854,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "es8r4wz": {
      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es8r4wz/",
      "text": "I think academia overall should travel less. We should encourage more exploration of digital communication/conferences and local interaction.",
      "author": "tfburns",
      "created": 1561710209,
      "upvotes": 33,
      "replies": {
        "es8ujj4": {
          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es8ujj4/",
          "text": "I could not agree more, but traveling to conferences is unfortunately essential for early career researchers to build a network. But more senior people should probably ask themselves before each trip whether it's really useful or necessary.",
          "author": "scannerJoe",
          "created": 1561715552,
          "upvotes": 29,
          "replies": {
            "es90h5l": {
              "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es90h5l/",
              "text": "I don’t know if I agree with the last part. Having more senior people at conferences is helpful. I don’t think in-person interactions can really be replaced in academia. It’s one of the biggest strengths of communicating research.",
              "author": "Melkovar",
              "created": 1561723230,
              "upvotes": 19,
              "replies": {
                "es92jjx": {
                  "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es92jjx/",
                  "text": "I did not say that senior academics should not travel, but that they should seriously ask themselves whether some part of it could maybe be avoided.",
                  "author": "scannerJoe",
                  "created": 1561725269,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "es94sx9": {
          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es94sx9/",
          "text": "I agree, but I also think conferences are important for human to human interaction, establishing connections/networks with other scholars, which you can't really do over a screen.",
          "author": "sugibi",
          "created": 1561727257,
          "upvotes": 11,
          "replies": {
            "es9gral": {
              "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9gral/",
              "text": "That's true, and of course we do need some in-person international conferences. I just think most academics travel more than necessary and should put in more effort to connect more with their local research community.",
              "author": "tfburns",
              "created": 1561735854,
              "upvotes": 2,
              "replies": {
                "esa4c96": {
                  "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esa4c96/",
                  "text": ">and should put in more effort to connect more with their local research community.\n\nResearch is often highly-specialized. How many people are there in your city that works in your extremely specific research area - chances are you can count them with two hands and already know them somewhat.",
                  "author": "antimornings",
                  "created": 1561751211,
                  "upvotes": 2,
                  "replies": {
                    "escq8dt": {
                      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/escq8dt/",
                      "text": "Research can be highly-specialised. Increasingly, though, I think truly excellent research in interdisciplinary, which increases the list of potential local collaborators a few times over, I think. Nevertheless, you are right that there would still be very few who work in specific research area (narrowly defined) - though, if we wanted to, we could argue say that each of us are in separate areas unless we are direct collaborators. Still, in those cases there is a need to travel. I just think on average academics travel more than necessary or sometimes than is even good for their own research.",
                      "author": "tfburns",
                      "created": 1561836027,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "esenkne": {
                      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esenkne/",
                      "text": "This. I was unable to find four professors with matching research interests for my thesis committee in my country, and had to invite one from abroad.",
                      "author": null,
                      "created": 1561904587,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "es9cm4n": {
          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9cm4n/",
          "text": ">I think academia overall should travel less. We should encourage more exploration of digital communication/conferences and local interaction.\n\nHard disagree. Travel should be supported, both to support research collaborations and for dissemination events like conferences when possible. Universities need to make funding academic travel a priority for research groups without major external funding and for PhD students.",
          "author": "tchomptchomp",
          "created": 1561733081,
          "upvotes": 18,
          "replies": {
            "es9dqeo": {
              "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9dqeo/",
              "text": "I think another solution is to just budget in travel support when you are organizing a conference. We have no trouble budgeting in senior scholars as the keynote and pay for their hotel+travel. Why can't we do that for students and low income scholars?",
              "author": "sugibi",
              "created": 1561733836,
              "upvotes": 3,
              "replies": {
                "es9ix30": {
                  "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9ix30/",
                  "text": "Except what happens is that travel support ends up being turned into a competition which ends up benefiting a small number of students from elitelabs who already have elite CVs, instead of providing wholesale travel support for trainees.",
                  "author": "tchomptchomp",
                  "created": 1561737253,
                  "upvotes": 5,
                  "replies": {
                    "esatouj": {
                      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esatouj/",
                      "text": "My field makes it so that only one person per advisor gets travel funding every year, with repeat students given lower priority.",
                      "author": "notadoctor123",
                      "created": 1561768528,
                      "upvotes": 2,
                      "replies": {
                        "esb0elg": {
                          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esb0elg/",
                          "text": "That would not be your field that is making this decision, but rather your department. Why does your department make that decision? Probably because they don't have a lot of money.\n\n&#x200B;\n\nI was talking specifically about society travel grants, not department travel grants.",
                          "author": "tchomptchomp",
                          "created": 1561774274,
                          "upvotes": 2,
                          "replies": {
                            "esb198j": {
                              "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esb198j/",
                              "text": "No, I'm referring to the IEEE Control Systems Society student travel grants.\n\nMy department has nothing to do with it. This is an international organization that does all of it. They keep track of which student is advised by which professor by requiring a sign-off by the advisor.",
                              "author": "notadoctor123",
                              "created": 1561775015,
                              "upvotes": 1,
                              "replies": {
                                "esb8yxm": {
                                  "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esb8yxm/",
                                  "text": "Oh wow, really? That's actually awesome.",
                                  "author": "tchomptchomp",
                                  "created": 1561782135,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "es9g5lo": {
                  "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9g5lo/",
                  "text": "The last conference I went to offered 8 $500 travel awards for PhD students to attend. It made it possible for me attend the conference. Not a single person came up to my poster though.",
                  "author": "WhoRipped",
                  "created": 1561735456,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "esbzlll": {
              "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esbzlll/",
              "text": "Most conferences involve air travel, and this absolutely murders the environment.",
              "author": "doornroosje",
              "created": 1561816794,
              "upvotes": 3,
              "replies": {
                "esc2jdo": {
                  "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esc2jdo/",
                  "text": "Quite a lot of life involves air travel. But again, the sheer volume of air travel annually is NOT academic conferences. I appreciate the \"we must all do our part\" mindset but when a single middle manager at a medium-sized company might be flying 50 times a year or more, saying that we should eliminate one of the few things that allows us to have face-to-face conversations with our peers and which is one of the few effective tools to help students get out of the prestige tracks afforded them by their college entrance scores.",
                  "author": "tchomptchomp",
                  "created": 1561819294,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "es9h1m1": {
              "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9h1m1/",
              "text": "Did I say travel shouldn't be supported? Or that universities shouldn't  make funding academic travel a priority for research groups without major external funding and for PhD students?\n\nI just said I think we overall should travel less. It's bad for our planet and it's not always very productive. One or two a year is enough in my field, for example, I think.",
              "author": "tfburns",
              "created": 1561736041,
              "upvotes": 4,
              "replies": {
                "es9kz3f": {
                  "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9kz3f/",
                  "text": "Compared to the sort of travel that big business engages in, academics do very little travel. Conferences are one of the few opportunities that trainees and ERCs have to represent their work in front of their colleagues, to network, and to build lasting collaborations outside the walls of their own institute. There are substantial benefits to this, and it is a really important tool for reducing the effect of academic pedigree and other similar bullshit. It also aids international exchange of ideas and helps integrate research programs across borders, which is also a generally positive thing.\n\n&#x200B;\n\nSaying \"attending one conference a year is too much, do less\" is ridiculous. Get on any airplane on a weekday and it's 90% business middle management or marketing workers traveling for one 60 minute meeting and flying home that evening, and they're going to do that dozens of times per year.",
                  "author": "tchomptchomp",
                  "created": 1561738592,
                  "upvotes": 8,
                  "replies": {
                    "es9qn3s": {
                      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9qn3s/",
                      "text": "Again, you're arguing a strawman. I've never said travel isn't necessary or important.\n\nNor have I said  \"attending one conference a year is too much, do less\". Be critical and disagree. But don't be dishonest and angry.",
                      "author": "tfburns",
                      "created": 1561742296,
                      "upvotes": 2,
                      "replies": {
                        "es9ujvn": {
                          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9ujvn/",
                          "text": "I'm arguing explicitly against what you've said. If you meant to say something else then you need to ask yourself why you said what you did.\n\n&#x200B;\n\nThe whole idea that we can fix these sorts of things by using digital online conferences is ridiculous. Digital conferences largely do not work for establishing serious long-term collaborations, they do not work for meeting the sorts of prospective department members, employers, or trainees and assessing whether they are good personality fits or, on the other hand, whether they send up major red flags. They do not work well for getting people outside of the small network of elite universities and forcing them to interact with the rest of the field. They are not good at providing society members access to society leadership. These are all absolutely critical things.\n\n&#x200B;\n\nDigital conferences may be good for broader outreach but they are not good for a range of basic functions necessary for academic work.",
                          "author": "tchomptchomp",
                          "created": 1561744843,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    },
                    "es9kzfm": {
                      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9kzfm/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1561738598,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "es981md": {
          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es981md/",
          "text": "[removed]",
          "author": null,
          "created": 1561729823,
          "upvotes": 5,
          "replies": {
            "es9giby": {
              "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9giby/",
              "text": "Depends how often and for what purpose. As it stands, I do think academics travel more than necessary. It's bad for our planet and it's not necessarily always good for productivity.",
              "author": "tfburns",
              "created": 1561735691,
              "upvotes": 4,
              "replies": {
                "es9i3mz": {
                  "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9i3mz/",
                  "text": "Every academic could halt their flights and it would have a negligible impact on virtually every metric of climate change.",
                  "author": null,
                  "created": 1561736720,
                  "upvotes": 3,
                  "replies": {
                    "es9s2jg": {
                      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9s2jg/",
                      "text": "The average trans-Atlantic flight generates on the order of a few tonnes of CO2 emissions per passenger. The average Westerner generates on the order of 10-20 tonnes of CO2 emissions per year. All told, air travel is one of the largest personal sources of emissions. If there are one the order of 10-20 of million academics throughout the world ([https://www.richardprice.io/post/12855561694/the-number-of-academics-and-graduate-students-in](https://www.richardprice.io/post/12855561694/the-number-of-academics-and-graduate-students-in)) and that, say, at least half of those took one flight they didn't need to. That's millions of tonnes of CO2.\n\nBut assume it was less. Even so, shouldn't we of all people be concerned about climate action and be leading by example?",
                      "author": "tfburns",
                      "created": 1561743227,
                      "upvotes": 0,
                      "replies": {
                        "esbpcmc": {
                          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esbpcmc/",
                          "text": "Consider that planes transport 4 billions passangers per year. Compared to this number, 20 million academics, even if some travel more than once a year, are a drop in the sea.\n\nEven if all academics stopped flying, there would barely be a noticable difference in the volume of flight travel. On the other hand, the loss of networking and learning opportunities would be a great hit for the entire academia.",
                          "author": "Croc600",
                          "created": 1561804995,
                          "upvotes": 1,
                          "replies": {
                            "escpw17": {
                              "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/escpw17/",
                              "text": "Good point. I still think - on principle, and also to set a good example as leaders in science, humanities, etc. - we should make efforts to reduce our carbon emissions to something more sustainable.",
                              "author": "tfburns",
                              "created": 1561835757,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "esbznbe": {
              "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esbznbe/",
              "text": "You might be relatively poor compared to your countrymen, but your CO2 footprint is gigantic on a global scale. This is really injust.",
              "author": "doornroosje",
              "created": 1561816837,
              "upvotes": 2,
              "replies": {
                "esc0a8o": {
                  "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esc0a8o/",
                  "text": "Every academic in the world could stop taking flights and the impact would be negligible compared to global air travel. Prove me wrong.",
                  "author": null,
                  "created": 1561817390,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "es9fs1v": {
      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9fs1v/",
      "text": "I think we need to broadly re-consider the entire idea of a conference. Presenting ongoing research or traditional presentations are more suited to digital means, and we obviously have the technology to support such things. I think it's also an issue that first-gen and low-income students are often in PhD programs or jobs with less access to research funding and support, meaning a traditional \"present a paper\" style session isn't applicable or helpful. \n\nI'd like to see national organizations host a kind of digital conference for presenting ongoing research, something that could be organized into a virtual proceedings that would allow all academics to browse through short descriptions of emerging research (increasingly necessary with the amount of research coming out). \n\nThe conference could then feature a large number of regional meetings that focus less on presenting original research and more on connecting academics across a variety of axes. I'm envisioning round tables focused on issues in graduate school, early career, mid career, etc with opportunities for all these groups to interact. Workshops would also be great. \n\nI think these regional events should be low/no charge with opportunities for couch surfing/ staying in dorms on a campus. No more 500 dollar a night hotels!",
      "author": "cdb3492",
      "created": 1561735202,
      "upvotes": 3,
      "replies": {}
    },
    "esb2mau": {
      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esb2mau/",
      "text": "Pay for students travel expenses upfront, instead of reimbursements\n\nGrants for students to attend conferences their labmates or advisor is presenting at\n\nOffer childcare on site\n\nSmaller regional/subfield specific conferences",
      "author": "blackandwhite1987",
      "created": 1561776215,
      "upvotes": 2,
      "replies": {
        "esenspo": {
          "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/esenspo/",
          "text": "Upfront payment for flight/train tickets would be nice. Paying a month's wages for tickets and having to wait several months for reimbursement was hard.",
          "author": null,
          "created": 1561904770,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eseo05n": {
      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/eseo05n/",
      "text": "The Maize Genetics Conference in the US had a helpful approach when I attended. They had sponsor companies who paid for the conference fee and the hotel room for undergraduate and PhD students. To my knowledge, the companies do this to get to know potential future employees.",
      "author": null,
      "created": 1561904936,
      "upvotes": 2,
      "replies": {}
    },
    "eserw86": {
      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/eserw86/",
      "text": "I feel like we have very few issues with this in my field, at least across core research schools. There are decent research budgets even for students, and departments sponsor conferences for students that get into conferences. There are tons of conference-based programs that sponsor/support students. I went to 3-6 conferences a year as a PhD student, and never had to overthink staying at a good hotel. Only had to share a room with another student once, and only because that was a part of the fully-paid conference experience.",
      "author": "AnonBizPhD",
      "created": 1561907908,
      "upvotes": 1,
      "replies": {}
    },
    "es9pctk": {
      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es9pctk/",
      "text": "[deleted]",
      "author": null,
      "created": 1561741459,
      "upvotes": 1,
      "replies": {}
    },
    "es8q9xl": {
      "link": "/r/AskAcademia/comments/c6f6eg/how_can_we_make_academic_conferences_affordable/es8q9xl/",
      "text": "The last question is weirdly oddly.",
      "author": "iammaffyou",
      "created": 1561708925,
      "upvotes": -6,
      "replies": {}
    }
  }
}