{
  "sid": "d0noq8",
  "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/",
  "title:": "How did people do literature reviews prior to the internet?",
  "text": "Can any 40+ yr old academics share their experiences with the literature review process prior to the internet? I can't even imagine what a cumbersome process that would be.",
  "author": "labbypatty",
  "created": 1567808978,
  "updated": 1634081745,
  "over_18": false,
  "upvotes": 122,
  "upvote_ratio": 0.98,
  "comments": {
    "ezb1vyw": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezb1vyw/",
      "text": "Physically tracking down every reference from every paper you could find. (This was laborious but at least possible; what was essentially impossible was seeing who cited a certain paper. That's why that Google Scholar feature is a godsend.) Tons of photocopying. Help from librarians. Relying on the savvy of older colleagues in the field to suggest seminal work. Making friends with obsessive coworkers with huge filing cabinets who would save every paper they read.\n\nYou were furious if you tracked down a paper with a grandiose title and/or abstract that actually covered only a nuance of a subset of what it claimed to cover.",
      "author": "Chemomechanics",
      "created": 1567811588,
      "upvotes": 152,
      "replies": {
        "ezbd6ir": {
          "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezbd6ir/",
          "text": "So much photocopying. And the microfiche.",
          "author": "gettingtowork",
          "created": 1567818639,
          "upvotes": 45,
          "replies": {}
        },
        "ezbrwjr": {
          "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezbrwjr/",
          "text": "Did this result in \"better\" research, or simply more busywork to get to it?",
          "author": null,
          "created": 1567824564,
          "upvotes": 16,
          "replies": {
            "ezc0hva": {
              "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezc0hva/",
              "text": "100% only more busy work and more difficulty following research outside your field",
              "author": "NeuroCartographer",
              "created": 1567828026,
              "upvotes": 45,
              "replies": {}
            }
          }
        },
        "ezby6hk": {
          "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezby6hk/",
          "text": "Wait, so how would you track journals that were not available at your library? Would you have to look into some sort of catalogue from that library, then request the journal, etc.? Would you be able to do this with journals from a different continent?",
          "author": "PM_MOI_TA_PHILO",
          "created": 1567827067,
          "upvotes": 7,
          "replies": {
            "ezcqbl9": {
              "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezcqbl9/",
              "text": "I'm at an institution with a smaller library and in a field where basically nothing has been made digital. I still have to track down journals that aren't in our library. \n\nMy library card gives me access to any (local) academic library. I can check them for any journals we don't have. There's also always the option of interlibrary loans. My library will get material from another continent but it takes *ages*, you're nearly better off having to buy the thing - which i have done. I have bought back issues, or flat out subscribed to the journal so they'll just be mailed to me.\n\nOr, though a more modern solution than you're imagining, I whine to friends at other institutions who will then scan the articles I need and send them to me.",
              "author": "PurrPrinThom",
              "created": 1567838926,
              "upvotes": 17,
              "replies": {
                "ezh20aq": {
                  "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezh20aq/",
                  "text": ">Or, though a more modern solution than you're imagining, I whine to friends at other institutions who will then scan the articles I need and send them to me.\n\nCan confirm.",
                  "author": "truagh_mo_thuras",
                  "created": 1567904495,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "ezen35p": {
              "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezen35p/",
              "text": "Just about all of the databases your library subscribes to started off as a printed serial.  Subject headings would be assigned to newly published articles in a field, then all of the headings arranged alphabetically.  Every now and then, they'd combine them into a cumulative index.  Research was done by looking up terms in the cumulative index, supplemented by the annual updates.  \n\n\nInterlibrary loan would get you copies of whatever your library didn't have.  That work was assisted greatly by the National Union Catalog, which was/is a giant printed catalog that compiled the local catalogs of a bunch of libraries.  Some academic libraries still have their NUC set, taking up space and looking impressive. Their nice green covers make them popular for stacking in smaller and smaller circles to make a NUC Christmas tree.",
              "author": "libgeek",
              "created": 1567866137,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ezersgz": {
          "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezersgz/",
          "text": "Definitely the filing cabinets, stuffed with tabbed green hanging folders. You'd print every paper you read, annotate the hell out of it and try to classify them. I'd filled two shelves of a fairly large filing cabinet by the time I graduated",
          "author": "hyperblaster",
          "created": 1567867941,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ezaxfza": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezaxfza/",
      "text": "Driving to multiple libraries.",
      "author": "BeesOnBlow",
      "created": 1567809183,
      "upvotes": 39,
      "replies": {}
    },
    "ezbtlmb": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezbtlmb/",
      "text": "We went to the library. We consulted physical reference works, like printed bibliographies. To find those, we consulted (literally!) \"bibliographies of bibliographies\" that were, as you'd imagine, annotated, topical listings of other published bibliographies.  We read summaries of book reviews in Book Review Digest. We looked up authors in a reference work called American Authors. We used gazeteers to find place names. We used the card catalog and browsed the shelves. Once we found cites for articles we had to get them by finding the actual journal on the shelves, or the microfiche, or more often simply had to fill out an interlibrary loan request (on paper) and then way 2-3 weeks for a photocopy to come in the US mail. Or-- if you weren't at a major research library --you would *drive* to a major research library and do it all over again.\n\nHonestly, I really do miss the reference section and all the specialized resources that used to live there. It wasn't much over 20 years ago that this stuff still mattered, and I taught students how to find and use all those physical resources in the actual library.\n\nBut it also wasn't that much *longer* ago (late 80s?) that I could get a reference librarian to fire up the ol' teleprinter and query Lexis to look up legal info for me-- it cost something like $5 a search and we had to submit them (on paper) a day in advance. Around the same time a friend was house sitting for a guy who was writing a reference book, some sort of historical dictionary IIRC, and his home office was almost entirely taken over by many thousands of 4x6\" note cards in meticulous stacks...when visiting we were allowed only to gaze into the room from the doorway.",
      "author": "SnowblindAlbino",
      "created": 1567825227,
      "upvotes": 30,
      "replies": {}
    },
    "ezbc9hl": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezbc9hl/",
      "text": "So, I did this the old fashioned way not even 20 years ago, when Web of Science was just starting to mature. There are printed indexes to show what papers cite what papers. So you pick a high impact favorite and work your way up/down through its family tree. The ones that look promising, you photocopy. I averaged 4 hours a day in the library for weeks when starting any new project. Still have two or three file drawers from my MS and PhD, but a big BibTeX file and archive of PDFs for the most recent dozen years or so.",
      "author": "Jon3141592653589",
      "created": 1567818011,
      "upvotes": 27,
      "replies": {}
    },
    "ezbwru8": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezbwru8/",
      "text": "I'm in the U.S., and had to request a paper that was only available from a library in Europe. It took 2 months to get to us, and I don't actually think it was relevant once I read it.\n\nWas it the dark ages? No, it was 2003.",
      "author": "bobzor",
      "created": 1567826496,
      "upvotes": 14,
      "replies": {}
    },
    "ezcxh5g": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezcxh5g/",
      "text": "Umberto Eco's academic writing book (I think the English name is How to write a thesis) has a great guidance for this. He describes how you navigate the index card cabinets, and I think it even discusses how you get funding to travel to the library that has the books.\n\nEverything else in the book is still applicable, so I recommend it to all students.",
      "author": "sharkinwolvesclothin",
      "created": 1567841948,
      "upvotes": 10,
      "replies": {}
    },
    "ezblhl7": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezblhl7/",
      "text": "I started grad school in 1993. My advisor got me started with a big reading list. From there it was checking the refs of those articles. Also he subscribed to a few key journals in the field so that just involved scanning the new issue as it arrived. He also told me to regularly visit the library and check new issues of other journals. We had a huge university library, so that was indispensable. Lots of photocopying. PsycINFO and similar databases existed back then and were more useful than they are now. Also regularly attending conferences and talking to people was pretty crucial (still is but for slightly different reasons).",
      "author": "perceptionactionprof",
      "created": 1567822075,
      "upvotes": 17,
      "replies": {
        "ezbr7sn": {
          "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezbr7sn/",
          "text": "Although the advancements in science are exponential compared to pre-internet boom, I think the quality went down hill. Thoughts?",
          "author": "JackKellyAnderson",
          "created": 1567824299,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "ezc4h6e": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezc4h6e/",
      "text": "Index cards. Lots and lots of index card. And a paid typist.",
      "author": "Arhgef",
      "created": 1567829746,
      "upvotes": 6,
      "replies": {}
    },
    "ezbvows": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezbvows/",
      "text": "At my uni it was called the stacks, a deep part of the library that had so much shit in it they put the shelves on electric rollers so it would fit. Only 3 or 4 aisles could be open at once so you had to sit and frown at some grad student while debating if their field was even worth researching.  Good times.",
      "author": "fizzixs",
      "created": 1567826059,
      "upvotes": 4,
      "replies": {}
    },
    "ezdj1et": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezdj1et/",
      "text": "You went to the library and used a card catalogue. It wasn't actually that long ago!",
      "author": "whats_it_to_you77",
      "created": 1567850693,
      "upvotes": 3,
      "replies": {}
    },
    "ezkbbof": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezkbbof/",
      "text": "I went to one of the schools with the best libraries ever - had almost every cited journal in my field located somewhere in the stacks - I loved wandering around and discovering new things by happenstance! ❤️",
      "author": "Melancholia8",
      "created": 1567957838,
      "upvotes": 1,
      "replies": {}
    },
    "ezdpd3u": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezdpd3u/",
      "text": "It was the book next to the book I was looking for on the shelf.",
      "author": "ADBuck",
      "created": 1567853274,
      "upvotes": 1,
      "replies": {}
    },
    "ezezyrb": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezezyrb/",
      "text": "Best thread ever!!!!",
      "author": "debacchatio",
      "created": 1567871056,
      "upvotes": 0,
      "replies": {}
    },
    "ezeiwsy": {
      "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezeiwsy/",
      "text": "Okay, downvote away, but this question seems a bit...odd.  Depending on your location, status, and discipline the internet still may not be the savior the op has positioned it to be.  40+ year old?  Come on.",
      "author": "ambassadorix",
      "created": 1567864532,
      "upvotes": -1,
      "replies": {
        "ezfil6r": {
          "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezfil6r/",
          "text": "Would love to hear the experiences you're alluding to! I had thought internet was the primary means of reviewing literature in today's day and age, but maybe I was mistaken",
          "author": "labbypatty",
          "created": 1567878137,
          "upvotes": 3,
          "replies": {}
        },
        "ezez4xj": {
          "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezez4xj/",
          "text": "Yeah, for my discipline (and a lot of other smaller humanities disciplines that I'm aware of), not all of the major journals are digitized and available online, the major journals aren't all digitized and available online, there are a lot of important books and chapters in edited collections that usually aren't digitized, and it's pretty common that you'll need to at least look at significantly older scholarship. Google Scholar isn't particularly helpful in this sort of environment, and that's not even factoring in whether you're looking at scholarship in lesser-known languages that larger indices tend to ignore.",
          "author": "truagh_mo_thuras",
          "created": 1567870727,
          "upvotes": 1,
          "replies": {
            "ezfiq8g": {
              "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezfiq8g/",
              "text": "Wow that's really surprising and interesting that they don't digitize the journals! What field are you in?",
              "author": "labbypatty",
              "created": 1567878191,
              "upvotes": 2,
              "replies": {
                "ezh1uei": {
                  "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezh1uei/",
                  "text": "Celtic Languages and Literatures.\n\nA few of the major journals, that are from bigger publishers, are properly indexed, but often our library catalog won't even tell us what's in the journals or edited volumes.",
                  "author": "truagh_mo_thuras",
                  "created": 1567904431,
                  "upvotes": 1,
                  "replies": {}
                },
                "ezhfsds": {
                  "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezhfsds/",
                  "text": "My dissertation was in renaissance music history.  A lot of secondary literature was not digitized when I finished in 2011.  I moved on from the subject, but when I went to revisit it this year not much had changed.",
                  "author": "ambassadorix",
                  "created": 1567909797,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "ezhfvmc": {
              "link": "/r/AskAcademia/comments/d0noq8/how_did_people_do_literature_reviews_prior_to_the/ezhfvmc/",
              "text": "Humanities high five.",
              "author": "ambassadorix",
              "created": 1567909829,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}