{
  "sid": "rcg2ar",
  "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/",
  "title:": "Got offered a post-doc in another university. First words from my prof were to stay out of his way..",
  "text": "Anyone else have this happen? When I started, my lab was literally just starting - equipment arrived a few months after I started. Over the last 5 years, I set up the lab, brought in research, I expanded our departments network to such a huge level that there are now post docs in other departments which came from me. The contacts I've brought in resulted in 2 research projects, one scholarship for a new PhD (joint industrial research through industrial partners my prof didn't even know existed ). My research also ended up in two new grants. Suffice to say, I've done my part.\n\nWe got a new PI last year, so there are no open positions for me there. I got offered a post doc position in a competing university. When I told my prof the first words were, \" well, I advise you to stay out of my way '. I found that to be really hurtful, especially after I've help build his department up so much. A week later we spoke about it again and he said , well it actually makes sense that you go - because then I know who is doing what in the other university.\n\nI found it to be extremely toxic - I thought that your prof should be happy that you're advancing your career. Instead, it just made me hate my place of work so much.",
  "author": "paemesaememaebe",
  "created": 1639050582,
  "updated": 1639515524,
  "over_18": false,
  "upvotes": 414,
  "upvote_ratio": 0.98,
  "comments": {
    "hnuc65o": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnuc65o/",
      "text": "As a former academic about to reenter academia...that was hurtful, and small-minded. Go in peace, and know your trade, don't give him any more information - as that is what he wants. And go and make that place amazingly welcoming of new post-docs.",
      "author": "KnitForTherapy",
      "created": 1639051216,
      "upvotes": 367,
      "replies": {
        "hnucaos": {
          "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnucaos/",
          "text": "Ps, don't antagonise him by deliberately researching what he is, but certainly don't avoid the topic because he 'warned you'. it's likely partly to do with access of research dollars and wanting to remain *the* expert on his topic.",
          "author": "KnitForTherapy",
          "created": 1639051304,
          "upvotes": 133,
          "replies": {
            "hnvnqlt": {
              "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnvnqlt/",
              "text": "As someone who is in industry, screw this professor. He could be polite and supportive of the job change. But he decided to make OP feel like crap even when OP has no choice but to find a different job. OP now owes their professor nothing except polite greetings at conferences in the future. OP is fully within their rights to pursue the same research dollars as this professor and has no obligation anymore to them because they're being an ass.",
              "author": "hardolaf",
              "created": 1639072806,
              "upvotes": 54,
              "replies": {}
            }
          }
        },
        "hnv1zhb": {
          "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnv1zhb/",
          "text": "[deleted]",
          "author": null,
          "created": 1639064377,
          "upvotes": 30,
          "replies": {
            "hnv2fov": {
              "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnv2fov/",
              "text": "Sadly that's often the case. So be the exception and be exceptional-while having boundaries enough to have a personal life",
              "author": "KnitForTherapy",
              "created": 1639064559,
              "upvotes": 17,
              "replies": {
                "hnv2zbe": {
                  "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnv2zbe/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1639064776,
                  "upvotes": 8,
                  "replies": {
                    "hnv3k6j": {
                      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnv3k6j/",
                      "text": "Not all of us. As to possible Al's my condolences that is a nasty one. My research currently is more into depression.",
                      "author": "KnitForTherapy",
                      "created": 1639065010,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hnuiwxl": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnuiwxl/",
      "text": "Feel confident in the fact that that is the response of someone who is insecure about their own achievements and intimidated by yours. Good luck on your new adventure, and do both of you a favor and do as he says: don't even give him the time of the day before you move on.",
      "author": "phonograhy",
      "created": 1639055393,
      "upvotes": 157,
      "replies": {
        "hnve7fe": {
          "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnve7fe/",
          "text": "This. Your professor is way out of line. I don't know anything about your potential new group, but with any luck you'll be enjoying a more supportive boss and a friendlier working environment, which makes a huge difference. The old professor can suck it. Postdoc life is way better, too, imho.",
          "author": "DrSpacecasePhD",
          "created": 1639069142,
          "upvotes": 29,
          "replies": {}
        }
      }
    },
    "hnup400": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnup400/",
      "text": "An absurd knee-jerk reaction. Just handle it politically. Leave, thank everyone, lots of smiles and handshakes (or elbow bumps I guess) and go have a bright career. Don't count on this person much going forward, as they seem to be unreliable and driven by emotion rather than logic.\n\nI'm a PI on a decent lab and I would actively send some of my students to go to competing labs. It gives them a wider view of the research area. That is how it should be: Your formation should be as wide and deep as possible so you can do research at the highest possible level.\n\nCongrats on the postdoc and good luck!",
      "author": "SMFet",
      "created": 1639058637,
      "upvotes": 80,
      "replies": {
        "hnupwwx": {
          "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnupwwx/",
          "text": ">I'm a PI on a decent lab and I would actively send some of my students to go to competing labs. It gives them a wider view of the research area. That is how it should be: Your formation should be as wide and deep as possible so you can do research at the highest possible level.\n\nThis is the way!\n\nGo forth and kick ass postdoc OP. Just know that you won't be doing much collaborative work with your former jerk PI haha.",
          "author": "__x0x__",
          "created": 1639059032,
          "upvotes": 26,
          "replies": {}
        },
        "hnx3el0": {
          "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnx3el0/",
          "text": "A lot of professors should encourage going to competing schools. Too many academics stay within their circle and do not get challenged enough by external academics. If there is one good thing about the adjunctization of academia, it's that academics get in touch with many more academics than in the past. Of course adjunctization sucks, academics deserve decent longterm contracts,",
          "author": "frugalacademic",
          "created": 1639093881,
          "upvotes": 3,
          "replies": {
            "hnzkiqz": {
              "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnzkiqz/",
              "text": "Oh, I agree! It does require that these competing groups see each other as competitors and not enemies. In our case, there are around 10 or so groups worldwide working in my specific areas. We all know each other and even every now and then organize dinners at our conferences to chat and benchmark each others. It is competitive, but friendly.\n\nThe consequence is that there is lot of mobility between our groups. My MSc students go take PhDs with them and vice versa, PhD graduates come to work as postdocts with me and so on. It allows us to have this dynamism and friendly competition.",
              "author": "SMFet",
              "created": 1639145152,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hnvp8we": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnvp8we/",
      "text": "I left academia for good mid way through PhD when I realised how toxic, dog eat dog and downright immoral leading scientific research is, to excel and keep on top.\n\nBusiness isn't much better, but it sure burst my ignorant bubble about trying to progress humanity or thinking about the bigger picture.\n\nPlease don't mistake colleagues for friends. That makes you very easy for them to undercut and climb on top of when they need to make that next step up.",
      "author": "AnonymousFairy",
      "created": 1639073405,
      "upvotes": 11,
      "replies": {}
    },
    "hnuqkn8": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnuqkn8/",
      "text": "It is toxic for sure, but at the same time he is probably worried about having to compete in his direct research direction. Academia is unfortunate in that if you worked on the same thing as him because that's what you know from his lab, you could end up scooping him and that could be the difference of high vs low impact papers and therefore career advancement (like getting tenured for example). Just let him know that you don't intend on competing in research direction and I'm sure he will feel better.",
      "author": "ActionXPotential",
      "created": 1639059347,
      "upvotes": 12,
      "replies": {}
    },
    "hnv53wq": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnv53wq/",
      "text": "Yeah, your PI is being an ass. PIs know that the very nature of a phd student is to send them away at the end to do their own work. Seems like he forgot that.",
      "author": "TourmalineTart",
      "created": 1639065630,
      "upvotes": 7,
      "replies": {}
    },
    "hnv73a6": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnv73a6/",
      "text": "I think you did too great by setting up their lab, research. They don’t want to lose you as you are doing so much for them. He shouldn’t fell threatened though as your success should be his success.",
      "author": "optimization_ml",
      "created": 1639066425,
      "upvotes": 3,
      "replies": {}
    },
    "hnurnjc": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnurnjc/",
      "text": "I don't know what you are expected to do in your situation. You did a postdoc with this guy for five years. There is no job offer for you in this place. You cannot keep doing the same postdoc forever. And then you are expected to pick and choose your new job according to the likes and dislikes of your PI when they cannot offer you a job. Isn't this completely absurd rather than toxic?",
      "author": "anurag_iiserk",
      "created": 1639059863,
      "upvotes": 12,
      "replies": {
        "hnuweuf": {
          "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnuweuf/",
          "text": "I'm a PhD student not Post doc, yet .",
          "author": "paemesaememaebe",
          "created": 1639062003,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hnusbpj": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnusbpj/",
      "text": "I'm no longer doing research in that sense but I am senior in an academic organisation and I do have a team. I'm always vague on here about what I do as it's quite specific and I'd be easy to identify but my team although not in academic research are all in a highly competitive career niche. I've always been hugely supportive of my team and have gone out to fight for them on many occasions. Recently, I've reached the point where some of them are now flying the nest and I've been slightly surprised at how much pleasure it's given me to see my team doing brilliantly well and other people seeing what I see in them. I also have to say it seem to be doing my career some good too as it seems I've developed I reputation for bringing on really talented people - I think they did it themselves and I just got out of their way but I'm not going to knock the reflected glory. \n\nFind yourself a mentor/boss who thinks your success is their success.",
      "author": "ACatGod",
      "created": 1639060176,
      "upvotes": 8,
      "replies": {
        "hnx48le": {
          "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnx48le/",
          "text": "As young academic this is my experience so far. Some of my mentors seems more happy than me for my achievements lmao.",
          "author": "quemacuenta",
          "created": 1639094248,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnv6hn2": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnv6hn2/",
      "text": "This is 100% toxic. Don't go out of your way to antagonize this person, but also don't let them stop you from living your best life. As they say, you do you.",
      "author": "Ethan-Wakefield",
      "created": 1639066186,
      "upvotes": 2,
      "replies": {}
    },
    "hnv6i73": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnv6i73/",
      "text": "That exact same thing happened to me, except I got a postdoc at the same university in a different department (the university has a lot of industry links so there are dozens of labs working on that same field). He said I should decline the position because it was a conflict of interest with the industry work I had done in his lab. It wasn't, he was (and is) just a pathetic and jealous man who was mad I didn't need his help to get employment post-PhD.",
      "author": "greenintoothandclaw",
      "created": 1639066192,
      "upvotes": 2,
      "replies": {}
    },
    "hnvh39f": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnvh39f/",
      "text": "Sounds like this guy needs a bitch slap",
      "author": "totalitydude",
      "created": 1639070262,
      "upvotes": 2,
      "replies": {}
    },
    "hnvqitv": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnvqitv/",
      "text": "I think he did you a massive favor. you go out on that note, you'll never have to feel like you owe him anything.",
      "author": "SouthernYankeeWitch",
      "created": 1639073929,
      "upvotes": 2,
      "replies": {}
    },
    "hnwyi3p": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnwyi3p/",
      "text": "Oh look, an overly competitive ass** academic completely without ethics!  Surprise!\n\nOh, do any work you want.  Academics is full of these people.  Face them down by succeeding in your work.\n\nAs a postdoc, you may be pressured into doing work that is not your own.  That's normal, and you have to do some if it.  DO NOT sacrifice your own grant and publication success.   Your successful faculty application will depend on your history of first-author publications and bringing in money, as will your future grant success.",
      "author": "x47126g",
      "created": 1639091745,
      "upvotes": 2,
      "replies": {}
    },
    "hnx79h8": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnx79h8/",
      "text": "This is absurd and says a lot about the prof… I am so damn proud of my students… My biggest hope for them is that they find jobs they love and work in areas that feed their passions. I would be very happy to see my students out succeed me in the future. If you really care about the research you do, you should also be happy that others are willing to dedicate their lives to advancing the field. This sort of competitive bullshit is so tired. I hope you can find some more collegial folks at your new school!",
      "author": "blazersncoffee",
      "created": 1639095598,
      "upvotes": 2,
      "replies": {}
    },
    "hnuf6f3": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnuf6f3/",
      "text": "maybe he was... joking? Like in a \"guess that makes you my competitor haha\" way.",
      "author": "ripmilo",
      "created": 1639053193,
      "upvotes": 9,
      "replies": {
        "hnufzsa": {
          "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnufzsa/",
          "text": "I know him when he's serious and when he's not joking.\nHe wasn't joking",
          "author": "paemesaememaebe",
          "created": 1639053695,
          "upvotes": 33,
          "replies": {
            "hnuhanc": {
              "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnuhanc/",
              "text": "I think you were so successful that it made him feel threatened (which you have no control over). I had a similar experience when I was an undergrad being mentored by a postdoc. It made no sense bc we were on totally different timelines, but they resented that my PI thought I was going to be great.",
              "author": "MercuriousPhantasm",
              "created": 1639054463,
              "upvotes": 23,
              "replies": {}
            }
          }
        },
        "hnuprax": {
          "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnuprax/",
          "text": ">  in a \"guess that makes you my competitor haha\" way.\n\nTwice? I doubt that's a joke.. it's hatred.",
          "author": "advanced-DnD",
          "created": 1639058955,
          "upvotes": 2,
          "replies": {}
        },
        "hnuf792": {
          "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnuf792/",
          "text": "[removed]",
          "author": null,
          "created": 1639053207,
          "upvotes": -7,
          "replies": {
            "hnuf8nv": {
              "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnuf8nv/",
              "text": "Shakespeare-Bot, thou hast been voted most annoying bot on Reddit. I am exhorting all mods to ban thee and thy useless rhetoric so that we shall not be blotted with thy presence any longer.",
              "author": "bot-killer-001",
              "created": 1639053231,
              "upvotes": 20,
              "replies": {
                "hnugksn": {
                  "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnugksn/",
                  "text": "Thy will be done.",
                  "author": "foibleShmoible",
                  "created": 1639054040,
                  "upvotes": 16,
                  "replies": {
                    "hnugly1": {
                      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnugly1/",
                      "text": "AS IT IS IN HEAVEN ON EARTH",
                      "author": "WaitingToBeTriggered",
                      "created": 1639054060,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "hnufiph": {
                  "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnufiph/",
                  "text": "lol",
                  "author": "ripmilo",
                  "created": 1639053402,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hnuljtf": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnuljtf/",
      "text": "wow academia really is pathetic",
      "author": "sevits",
      "created": 1639056836,
      "upvotes": 1,
      "replies": {}
    },
    "hnvhzts": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnvhzts/",
      "text": "\"I expanded our departments network to such a huge level that there are now post docs in other departments which came from me\"..........are you sure that you have achieved all the things that you think you have by yourself? Maybe you have a serious case of inflated ego.",
      "author": "ehossain",
      "created": 1639070609,
      "upvotes": -6,
      "replies": {
        "hnw0390": {
          "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnw0390/",
          "text": "Never meant it came directly from me. But I introduced industrial partners to our department, which my PI didn't even know existed, and from that, they hired post docs .",
          "author": "paemesaememaebe",
          "created": 1639077741,
          "upvotes": 4,
          "replies": {
            "hnz00na": {
              "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnz00na/",
              "text": "That's how it comes across though.",
              "author": "JanusCrow",
              "created": 1639132067,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hnvhub8": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnvhub8/",
      "text": "Now you have an extra reason to accept the offer!",
      "author": "eunaoqueriacadastrar",
      "created": 1639070551,
      "upvotes": 1,
      "replies": {}
    },
    "hnw1ka4": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnw1ka4/",
      "text": "get his ass dude, leave that fucking lab and succeed",
      "author": "HLA-AIRE-VIT1",
      "created": 1639078334,
      "upvotes": 1,
      "replies": {}
    },
    "hnwbka6": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnwbka6/",
      "text": "At least you can be sure you're making the right decision to move to the other position, this kind of toxicity is common in academia and there's almost no monitoring or accountability for it. In the worst labs, students commit suicide and the university looks the other way.",
      "author": "brett_hoover_wx",
      "created": 1639082312,
      "upvotes": 1,
      "replies": {}
    },
    "hnx1wnl": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnx1wnl/",
      "text": "He sounds like a mob or drug lord from Breaking Bad, he’s basically saying stay out of his territory or some shit",
      "author": "locusp",
      "created": 1639093223,
      "upvotes": 1,
      "replies": {}
    },
    "hnxaiit": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnxaiit/",
      "text": "It’s fear.",
      "author": "carlsonhfj",
      "created": 1639097064,
      "upvotes": 1,
      "replies": {}
    },
    "hnxtaxy": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnxtaxy/",
      "text": "OUT HIM. Academia will be a better place only if these assholes are put in place",
      "author": "pkollias",
      "created": 1639105419,
      "upvotes": 1,
      "replies": {}
    },
    "hnyu384": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnyu384/",
      "text": "Fuck him, you busted your ass, and for what? Him? Tell him to go fuck his hat",
      "author": "maurice8564732",
      "created": 1639127054,
      "upvotes": 1,
      "replies": {}
    },
    "hnyvbni": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnyvbni/",
      "text": "I can't believe that anyone can be so naive. You are a threat to his position, simple as that. Unfortunately it is a true sign of mediocrity when someone openly hates people who are more successful than him or have the potential to be. So yeah, it is not surprising, that he wants you out of his way, but it's not really his choice, is it? Get over it, this kind of behaviour becomes more common the more successful you get. This is not \"toxic\", it's just weak.",
      "author": "ordash",
      "created": 1639128095,
      "upvotes": 1,
      "replies": {}
    },
    "hogt489": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hogt489/",
      "text": "These are some of the things that make people leave the field . Pathetic from him",
      "author": "Hungry-Yak3373",
      "created": 1639452545,
      "upvotes": 1,
      "replies": {}
    },
    "hoh2lyh": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hoh2lyh/",
      "text": "It's a sad and unfortunate situation. Obviously, your professor is a spiteful person who does not value or respect you. Best you can do is leave on a good note with everyone. Hopefully, you'll not be needing a reference from him for your future job.",
      "author": "National_Impression6",
      "created": 1639457170,
      "upvotes": 1,
      "replies": {}
    },
    "hnv68ml": {
      "link": "/r/AskAcademia/comments/rcg2ar/got_offered_a_postdoc_in_another_university_first/hnv68ml/",
      "text": "The new PI is a jerk. Get out and don't look back.",
      "author": "sporkwantsfoon",
      "created": 1639066084,
      "upvotes": 0,
      "replies": {}
    }
  }
}