{
  "sid": "pqzq8o",
  "link": "/r/AskAcademia/comments/pqzq8o/advice_on_how_to_approach_and_start_a/",
  "title:": "Advice on how to approach and start a conversation with professors for Phd advice/letters when no longer a student",
  "text": "I got my bachelors in business 2019 and have been working in industry for 2-3yrs now. I have recently decided I am interested in pursuing a Phd in business (specifically finance/accounting) 1 or 2 year down the road and I want to take the time to start a conversation with professors to seek their advice, build rapport and eventually ask them for recommendation letters. Considering that the professors I am reaching out to probably don't remember me, how do I approach them cold as a former student? Will they be willing to help me out?",
  "author": "chucknowdis",
  "created": 1632019091,
  "updated": 1634078936,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hdg4wsp": {
      "link": "/r/AskAcademia/comments/pqzq8o/advice_on_how_to_approach_and_start_a/hdg4wsp/",
      "text": "If I don’t remember someone I’m not going to be able to write much in letter beyond saying that you were in X class with me and earned whatever grade. Best to go with people who know something about you and what you are like to work with.",
      "author": "GrandmaMabelGrey",
      "created": 1632047716,
      "upvotes": 2,
      "replies": {}
    },
    "hdfls3m": {
      "link": "/r/AskAcademia/comments/pqzq8o/advice_on_how_to_approach_and_start_a/hdfls3m/",
      "text": "They will probably be willing to help even if they don’t remember. I would suggest attaching your best work from their class to an email and reference what you learned in their class. This will help them remember your work. Also link the program you’re applying to and ask if they can write you a letter. Be very clear about what you need and when you need it by. It may also help to include a resume of any other relevant examples of your work.",
      "author": "Scholarscollective",
      "created": 1632032600,
      "upvotes": 1,
      "replies": {}
    }
  }
}