{
  "sid": "rit98y",
  "link": "/r/AskAcademia/comments/rit98y/how_to_condense_long_cv_to_2page_cv/",
  "title:": "How to condense long CV to 2-page CV?",
  "text": "I'm in the humanities (history) applying for doctoral programs and one of the grad schools I'm applying to wants me to submit a 2 page CV. My long CV isn't super long (it's 4 pages). And yes I know the difference between CVs and resumes. What should I cut in my long/regular CV? My layout is basically: education (including my MA thesis), research interests, undergrad publications (not peer reviewed), list of teaching assistant (TA) experience, fellowship and awards, conference participation, invited talks and lectures, digital projects, research experience (tangentially related to my MA thesis), academic and department service, volunteer positions, and languages. tl;dr: What should I cut in my long/regular CV?",
  "author": "ketuateksi",
  "created": 1639782241,
  "updated": 1639841152,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hozd6ve": {
      "link": "/r/AskAcademia/comments/rit98y/how_to_condense_long_cv_to_2page_cv/hozd6ve/",
      "text": "Cut volunteer positions, and maybe undergraduate research, depending on what it is.",
      "author": "naocalemala",
      "created": 1639782703,
      "upvotes": 1,
      "replies": {}
    },
    "hozdopv": {
      "link": "/r/AskAcademia/comments/rit98y/how_to_condense_long_cv_to_2page_cv/hozdopv/",
      "text": "NIH (not in humanities) but anything that isn’t directly relevant to the application requirements. Probably details like conference participation, digital projects (link to online portfolio), volunteering, languages, service.",
      "author": "Gremdelion",
      "created": 1639782917,
      "upvotes": 1,
      "replies": {}
    },
    "hozfnd1": {
      "link": "/r/AskAcademia/comments/rit98y/how_to_condense_long_cv_to_2page_cv/hozfnd1/",
      "text": "A lot can be done with creative formatting. Slightly smaller margins, right tabs to put dates on the same line as titles, making subordinate information 1 or 2 pt smaller, etc. I’ve done this a bunch. Want some help?",
      "author": "Coffee4MySoul",
      "created": 1639783776,
      "upvotes": 1,
      "replies": {}
    },
    "hp1rzhv": {
      "link": "/r/AskAcademia/comments/rit98y/how_to_condense_long_cv_to_2page_cv/hp1rzhv/",
      "text": "Think about what might be replicated elsewhere in the application. Presumably you don’t need research interests - this will be clear from any proposal included?\n\nDoes conference participation mean giving papers or attendance? If the latter - cut. If the former integrate into talks and lectures. \n\nHow much info are you giving about your MA thesis? Surely you don’t need more than thesis title and maybe advisor (but only if this is someone well known, otherwise you could cut). \n\nHow is your TA experience formatted? Often teaching sections can be cut down without really losing info with some selective deleting and reformatting. \n\nUnless volunteer positions and department service is relevant to the programme cut both these. \n\nIf your languages are ‘standard’ for your discipline cut this too. \n\nResearch experience - what is included here - tangentially related to MA but relevant to the proposed PhD? Then keep, otherwise streamline down.  Ditto digital projects (though I’d personally be less inclined to cut these as digital humanities become increasingly important it’s nice to show you have experience).\n\nETA: also agree with creative formatting - pull your margins out.",
      "author": "Neon-Anonymous",
      "created": 1639836700,
      "upvotes": 1,
      "replies": {}
    }
  }
}