{
  "sid": "c33rqk",
  "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/",
  "title:": "Who left Facebook entirely?",
  "text": "I feel that Facebook is a drag on my morale these days and am more and more considering flushing it. At the same time, many of my academic groups are on it and I use messenger to communicate with my peers. \nWho here flushed it altogether ? Thanks !",
  "author": "jtmooon",
  "created": 1561077525,
  "updated": 1634081938,
  "over_18": false,
  "upvotes": 102,
  "upvote_ratio": 0.97,
  "comments": {
    "erow8of": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erow8of/",
      "text": "As a tech ethicist I have been highly critical of FB since their emotional manipulation study (and wrote a fairly well cited paper about it!). I left it then as well, as I believe in practicing what I preach. It was hard at first but I didn’t have much use of it for academia, mostly personal (I’m abroad from family/friends so it was still very hard). Academic Twitter has been a lot better for me anyway.",
      "author": "liedra",
      "created": 1561090578,
      "upvotes": 23,
      "replies": {
        "erqpl21": {
          "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erqpl21/",
          "text": "Quit cold turkey in the penultimate year of my PhD. It was hard for a month, but then never missed it. I felt like suddenly I had so much extra time to do stuff.",
          "author": "damnrite",
          "created": 1561148951,
          "upvotes": 4,
          "replies": {}
        },
        "erp0tg5": {
          "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp0tg5/",
          "text": "Can you dm your paper? I’m intrigued",
          "author": "imabadbetch",
          "created": 1561095063,
          "upvotes": 4,
          "replies": {
            "erpa39m": {
              "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpa39m/",
              "text": "https://journals.sagepub.com/doi/full/10.1177/1747016115599568",
              "author": "liedra",
              "created": 1561107400,
              "upvotes": 8,
              "replies": {}
            },
            "erp1kup": {
              "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp1kup/",
              "text": "Can the link to the paper be sent here, please. Even I want to know more about it",
              "author": "Buggi_San",
              "created": 1561095881,
              "upvotes": 1,
              "replies": {
                "erpa3fi": {
                  "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpa3fi/",
                  "text": "https://journals.sagepub.com/doi/full/10.1177/1747016115599568",
                  "author": "liedra",
                  "created": 1561107407,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "erofpa2": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erofpa2/",
      "text": "Not exactly a complete flush of it, but I finally took both messenger and the regular facebook app off my phone recently. I keep it because it's the only way I can video chat with my family that my parents can figure out, but I only sign in on my desktop now. I've gone from it being my go-to app to scroll through, randomly text message with to maybe checking every few days? I just don't think about checking it when I'm on my computer.",
      "author": "IguanaTapThatAxolotl",
      "created": 1561077759,
      "upvotes": 40,
      "replies": {
        "erou43w": {
          "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erou43w/",
          "text": "> the regular facebook app off my phone recently.\n\nThe mobile website is good on its own and the app takes more battery percentage anyway.",
          "author": "PM_MOI_TA_PHILO",
          "created": 1561088784,
          "upvotes": 11,
          "replies": {
            "erowelh": {
              "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erowelh/",
              "text": "Yep, I haven’t had the Facebook or Twitter apps on my phone for years, but I still spend just as much time on the mobile sites.",
              "author": "Melkovar",
              "created": 1561090722,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "erpdouk": {
          "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpdouk/",
          "text": "I have the same problem - I live abroad and my parents don't know how to use any other video chat platform. I do use the news feed eradicator on my main browser though, so I have to go through some extra trouble if I want to see what everyone is posting.",
          "author": "ActualReference",
          "created": 1561112872,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eronkwt": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/eronkwt/",
      "text": "My account exists to browse memes. I’m going to delete it soon. The question to ask is: if you didn’t already have one, would you make one?",
      "author": null,
      "created": 1561083714,
      "upvotes": 16,
      "replies": {}
    },
    "erofhef": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erofhef/",
      "text": "I never had one. But I only check twitter like 3x a week instead of 4x a day now...",
      "author": "iammaxhailme",
      "created": 1561077594,
      "upvotes": 15,
      "replies": {
        "erplzjh": {
          "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erplzjh/",
          "text": "That's the thing, not having a Facebook account doesn't mean you can't have a Twitter/Reddit/MySpace/whatever addiction...",
          "author": "RRautamaa",
          "created": 1561121938,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "erolp5l": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erolp5l/",
      "text": "I've been off of it completely for a couple of years. Very happy with the decision, even though I can point to specific social events that I've missed out on because my friends and colleagues use it to coordinate. Also, I maintain the website for a research community that still uses a Facebook group regularly. It bothers me, esp. because it's a community with many critical scholars of social media platforms and the like. It seems hypocritical to continue to use Facebook as a community. ¯\\\\\\_(ツ)_/¯",
      "author": "cosmospring",
      "created": 1561082298,
      "upvotes": 19,
      "replies": {}
    },
    "erolpsg": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erolpsg/",
      "text": "I left in 2004 when I realized that comparing my reality to everyone else’s highlight reel made me anxious.",
      "author": "Aubenabee",
      "created": 1561082311,
      "upvotes": 34,
      "replies": {}
    },
    "eronx9k": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/eronx9k/",
      "text": "I closed my account last year, and it's been great. Anything that I would have access to through Facebook is easily accessible elsewhere. And without the constant crazy posts from odd uncles and aunts.",
      "author": "fanbritlit",
      "created": 1561083970,
      "upvotes": 5,
      "replies": {}
    },
    "erowdop": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erowdop/",
      "text": "You are likely addicted to it the same way people are addicted to gambling. It's a huge life improvement to get rid of it. Really, you and your friends need to make these weird, semi-public, fake shrines to yourselves? Put yourself in a weird little virtual box dictated by the Zuck king? Take a step back and realize how weird and pointless it all is. Keep in mind you are not Facebook's customer, the people using your data to sell you things are. Your photos and friends are just an accessory to that.\n\nRead Zadie Smith's \"Generation Why:\"  [https://sites.tufts.edu/alquestaeng1fall2017/files/2017/08/Generation-Why-by-Zadie-Smith.pdf](https://sites.tufts.edu/alquestaeng1fall2017/files/2017/08/Generation-Why-by-Zadie-Smith.pdf)",
      "author": "lepriccon22",
      "created": 1561090699,
      "upvotes": 14,
      "replies": {
        "erp4wrj": {
          "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp4wrj/",
          "text": "For me it's more like all the times we visited my grandparents and went through each other's picture albums from the last vacation or event, because we genuinely enjoyed sharing where we were and what we saw and did there.  \nBut I also unsubscribe from all those \"funny\" picture pages if someone shares something from there, so I mostly get personal updates that are alike to those albums or maybe even getting a postcard from there. I think calling it a \"shrine to oneself\" is a bit too hard in many cases, since people always enjoyed sharing their experiences, even before Facebook.",
          "author": "LittlePrimate",
          "created": 1561099861,
          "upvotes": 5,
          "replies": {
            "errm3ar": {
              "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/errm3ar/",
              "text": "I sort of thought this for a while and then I realized I was kidding myself.\n\nMaybe you are, maybe you aren't, but I think if you take a few months break to get rid of the addiction, you can properly assess it. Maybe read some Zadie Smith and Jaron Lanier, too.\n\nMaybe your generation or group uses it differently, but most social media is without a doubt a bunch of shrines to oneself IMO.",
              "author": "lepriccon22",
              "created": 1561174861,
              "upvotes": 1,
              "replies": {
                "errzedl": {
                  "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/errzedl/",
                  "text": "Why do you jump to the \"addiction\" conclusion so quickly? That's actually harmful as it undermines real addiction issues and makes them look a lot more harmless than they are.  \nYou know literally zero about my Facebook habits and still talk about addiction.\n\nFor the most time this year I barely used it at all. I made like 5 posts myself and for some months did not even log in once. Quite sure there is zero Facebook addiction I need to get rid of.  \nWe need to take addictions to social media seriously, not dump that term on anyone who has an account and therefore overlook those who actually would need help.",
                  "author": "LittlePrimate",
                  "created": 1561191077,
                  "upvotes": 2,
                  "replies": {
                    "ert75qd": {
                      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/ert75qd/",
                      "text": "> Why do you jump to the \"addiction\" conclusion so quickly? That's actually harmful as it undermines real addiction issues and makes them look a lot more harmless than they are.\n\nVirtually everyone I know on Facebook is addicted to it. Period. And most are kidding themselves about it. They employ psychological tricks to keep you addicted, seeking notifications, little tiny chances of victory. The same way a slot machine works. Maybe you are the rare exception, good if you are, but many people are truly addicted to Facebook and social media and it doesn't at all undermine other addictions to call Facebook addiction what it is.",
                      "author": "lepriccon22",
                      "created": 1561234321,
                      "upvotes": 0,
                      "replies": {
                        "eruox21": {
                          "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/eruox21/",
                          "text": "Saying everyone is addicted will create dialogues like this:  \n\"I'm addicted to Facebook.\"  \n- \" Lol, I know, right? Who isn't, hahaha.\"  \nCompletely disregarding that some people just \"use it a bit too much\" while others suffer from a serious medical condition and will require more help than reading some articles.\n\nIt's creating a mindset where those who urgently need help are mixed up with those who would probably benefit a bit from using it less but are not suffering from a fullgrown addiction.",
                          "author": "LittlePrimate",
                          "created": 1561291635,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "eroldge": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/eroldge/",
      "text": "I decided to leave Facebook and Instagram temporarily (I was feeling a bit pressured to look happy and to post things regularly), but more and more I feel like I don’t need them.\nMaybe you can do the same thing, deactivate your account and leave open the possibility to come back if you want to.\nFacebook messenger still works, though, so you wouldn’t have problems with communicating with your family and friends.",
      "author": "pepuhoru",
      "created": 1561082052,
      "upvotes": 8,
      "replies": {}
    },
    "erouf7h": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erouf7h/",
      "text": "I never signed up for it in the first place. I use a absolutely fake name for an account that I never post anything to, for those very rare times it seems I need one to log into something else.  After all the recent censorship I can't imagine who would want to be a part of fb. \n\nI never missed anything on it, never felt I needed it. I was always happy students couldn't creep me there.",
      "author": "gutfounderedgal",
      "created": 1561089030,
      "upvotes": 5,
      "replies": {}
    },
    "erow2hy": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erow2hy/",
      "text": "I thought about it, but now part of my assistantship is helping with my department's FB page, so now I'm stuck with it for another year.",
      "author": "drpalmerphd",
      "created": 1561090425,
      "upvotes": 5,
      "replies": {}
    },
    "erow6ks": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erow6ks/",
      "text": "Me! I deactivated it just before New Year's so I've been off for almost 6 months. You can keep Messenger on your phone and use it as a separate app even if you deactivate your FB account. You just can't add any new friends, but you can always message new people that didn't friend before you deactivated (it will just get sent to their \"other\" inbox and they'll have to accept the message). \n\nMy mental health has gotten much better by not getting into long political arguments with strangers and not comparing myself against other people through their posts. I kept Instagram which has my close friends, and people generally reach out to keep me in the loop about both social and professional opportunities through email or text.",
      "author": "ohsideSHOWbob",
      "created": 1561090526,
      "upvotes": 4,
      "replies": {}
    },
    "eroxb8i": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/eroxb8i/",
      "text": "I still have Facebook but rarely check it, maybe a few minutes once a day. I still have enough family and friends on it that it's worth keeping, especially since they're mostly people I don't get to see much in person since we live in different cities. I use Messenger somewhat regularly though.\n\nBtw if you want to keep an account because you need it to get notifications about events or whatever, but don't want to have to actually use Facebook regularly, you can set up email notifications in your Facebook account settings. Then you never have to check Facebook unless you get an email about something. There are individual email settings for pretty much every kind of Facebook notification so you can get only the ones you want. You can do something similar with notification settings in the app.",
      "author": "biznatch11",
      "created": 1561091566,
      "upvotes": 4,
      "replies": {}
    },
    "erp3yg2": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp3yg2/",
      "text": "IMHO, people talking about Facebook reminds me of alcohol or tobacco.\n\nThere were connected families, close friends and social life before Facebook existed, it just provides an easier (and more addictive) way to virtually reach them.\n\nI deleted my account a few months ago and it's true that you have to do an effort (if you want to) to keep update with certain people, but I think it's worth it. Now I find myself going into reading, playing music, going outside, much often.\n\nI don't think Facebook is good or bad for anyone/everyone. I just think that, like drugs, it may induce an addictive behavior.",
      "author": "amonymousML",
      "created": 1561098648,
      "upvotes": 3,
      "replies": {}
    },
    "erp0i7n": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp0i7n/",
      "text": "Left it two years into my PhD. Best decision ever. I don’t miss it one bit. Its a shit website through. I stayed on Instagram though. I still enjoy that.",
      "author": "Kureeru",
      "created": 1561094725,
      "upvotes": 3,
      "replies": {}
    },
    "erp9l3e": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp9l3e/",
      "text": "What particularly is it about Facebook that saps your morale? If it’s the superficial hyper-commercialism of folks posting their new car, new shoes, travel pics from the Amalfi Coast, etc then I get that. A lot of what people show lacks verisimilitude and is instead a shiny veneer. But if it’s more than that, like people are at places in their lives you’d thought you’d be by now, specifically in terms of spouses and children, then I think perhaps that’s telling you something about a possible need to reprioritize.",
      "author": null,
      "created": 1561106607,
      "upvotes": 3,
      "replies": {}
    },
    "erovt62": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erovt62/",
      "text": "Your social media is made up of the people or things you choose to follow. While you cannot control what people post, you can control the content you follow in many ways. Unfollow what doesn't help you grow or make you happy. That's my motto and how I try to operate my social media accounts. Life is too short.",
      "author": "Goldie816",
      "created": 1561090201,
      "upvotes": 7,
      "replies": {}
    },
    "eroyn0u": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/eroyn0u/",
      "text": "Reposted this to my FB account. So far no responses.",
      "author": "GravelyDan",
      "created": 1561092816,
      "upvotes": 6,
      "replies": {}
    },
    "eroq3gl": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/eroq3gl/",
      "text": "Yes, and Instagram too. Don’t miss it at all.",
      "author": "goodgreatgrandwndrfl",
      "created": 1561085630,
      "upvotes": 2,
      "replies": {}
    },
    "erov9zn": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erov9zn/",
      "text": "Me in 2016, a year after starting my PhD.    \nIt took a toll on a lot of friendships. However, over time I have managed to call my friends and text them on whatsapp. I do use twitter but my friends don't use it much.    \nIt does make certain things very difficult but I am happy to have got rid of it.    \n\nI am happy I am not spending time arguing with right wing trolls or apologizing for speaking my mind. Between right wingers and certain groups of left wing, facebook became a horrible experience.",
      "author": "kewra_bangali",
      "created": 1561089739,
      "upvotes": 2,
      "replies": {}
    },
    "erp07ea": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp07ea/",
      "text": "I left it over five years ago!",
      "author": null,
      "created": 1561094407,
      "upvotes": 2,
      "replies": {}
    },
    "erp76jb": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp76jb/",
      "text": "Deleted it a couple of weeks ago. Feels good.",
      "author": "luv2belis",
      "created": 1561102960,
      "upvotes": 2,
      "replies": {}
    },
    "erpd4jf": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpd4jf/",
      "text": "I haven't used Facebook (and had my account 'deleted', although it seems it is never truly gone and can be reactivated) since around 2012 or so. It has not negatively affected my academic life in the least.",
      "author": "DevFRus",
      "created": 1561112070,
      "upvotes": 2,
      "replies": {}
    },
    "erpfkha": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpfkha/",
      "text": "Me. Plus no instagram, snap chat, etc. But I have Twitter. I use it to follow academics.",
      "author": null,
      "created": 1561115353,
      "upvotes": 2,
      "replies": {}
    },
    "erphfod": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erphfod/",
      "text": "I do not use it at all. IME it is unnecessary in academia, and is something of a liability. For me it is like Reddit: it seems indispensable, but is really just something to check compulsively, and is a mental health hazard.",
      "author": "WaylonWillie",
      "created": 1561117533,
      "upvotes": 2,
      "replies": {}
    },
    "erp7elh": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp7elh/",
      "text": "I use Facebook less than I used to, but I still have it. It’s too handy to get rid of entirely. It’s the easiest way for me to keep in touch with old friends. I only use it for messenger and for sharing/seeing photos after an event. But facebook was never a problem for me anyway, it was something I used to just occasionally check.",
      "author": "RainbowsOnMyMind",
      "created": 1561103289,
      "upvotes": 1,
      "replies": {}
    },
    "erp7tmq": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp7tmq/",
      "text": "My account is still there, but I don't check or update nor have the urge to. A win :)",
      "author": null,
      "created": 1561103914,
      "upvotes": 1,
      "replies": {}
    },
    "erp85n7": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp85n7/",
      "text": "I permanently deleted it during my first year as a phd student, two years ago. I used to be a heavy user with a lot of 'social capital' tied to my profile but I stopped enjoying fb alltogether. I don't miss it at all and people going on about missed networking and it being necessary for keeping up relationships grind my gears a lot. It's so lazy and complacent. Everything about this site is crap and it's despicably unethical. If you want to keep in touch with ppl, use email/threema or whatever, or call them, or go to conferences/their talks. Relationships that cannot be kept without fb weren't meant to be anyway, imo.",
      "author": "McStampf",
      "created": 1561104415,
      "upvotes": 1,
      "replies": {}
    },
    "erp8m9b": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp8m9b/",
      "text": "I pretty much dumped all the political stuff/people.  Now all I see are things about people I know with kids, family, triathletes, and old Army friends.",
      "author": "grandzooby",
      "created": 1561105106,
      "upvotes": 1,
      "replies": {}
    },
    "erpe9ko": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpe9ko/",
      "text": "Me.  Got rid of it almost a year ago and I have no regrets.",
      "author": "shy_calico",
      "created": 1561113663,
      "upvotes": 1,
      "replies": {}
    },
    "erpgxbx": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpgxbx/",
      "text": "I totally ditched it a year ago. Initially I felt going back because of all those groups and resources. At the end, I realized it is doing more harm than good. I asked anyone who wants to stay in touch with me to use an alternative messaging application. My company moved all of its important groups to another teams software made by one of the big 4 company.",
      "author": "FederalAssociate",
      "created": 1561116971,
      "upvotes": 1,
      "replies": {}
    },
    "erphygy": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erphygy/",
      "text": "Left fb 4 or 5 years ago and never went back. I'm happily oblivious to whatever is happening there. I use twitter and Instagram. Twitter is limited to professional stuff and my ig account is private.",
      "author": "GrandmaMabelGrey",
      "created": 1561118104,
      "upvotes": 1,
      "replies": {}
    },
    "erpi03u": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpi03u/",
      "text": "I did. I was already annoyed at it after the 2016 USA presidential campaign; and I wasn't checking it daily because it really felt irritating sometimes. However, people within my institution wanted to use it to contact me for professional reasons (as in, tagging me in a post = informing me of a meeting), and I didn't want to \"have to\" open stupid FB because of work. So now I don't have FB and they send me e-mails instead. I'm a happy man.",
      "author": "bioruffo",
      "created": 1561118152,
      "upvotes": 1,
      "replies": {}
    },
    "erplu5o": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erplu5o/",
      "text": "I left after Cambridge Analytica. Nothing of value was lost from facebook, though it admittedly made it slightly more difficult to communicate with some friends who use fb messenger as a primary communication.  \n  \nSocial media is poisonous, reddit probably is too if you're not careful.",
      "author": null,
      "created": 1561121810,
      "upvotes": 1,
      "replies": {}
    },
    "erpmhrl": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpmhrl/",
      "text": "I stopped using Instagram and Facebook a bit over a month and a half ago, and I feel so much better. My mental health was being dragged through the mud as I saw everyone else being happy, and I was pressured to be happy too. My friends really miss me on social media though, I used to be a writer and photographer and I'd post a lot of really classy and fancy things and nice photographs I took and they all started wondering \"hey where did nietzschesoptimism go?\" but they appreciated that I now can live without social media.",
      "author": "nietzschesoptimism",
      "created": 1561122368,
      "upvotes": 1,
      "replies": {}
    },
    "erpncvi": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpncvi/",
      "text": "I have one and use it often (maybe check it 1-3x a day, post on it 1-3x a week). It’s the best way I’ve found to keep in touch with and snoop on old friends, coordinate get-together with new ones, broadly and genetically share news / photos, and participate in several communities that are far less active elsewhere. I guess I also use it for professional networking, similar to how people use Twitter (which I’ve tried and hated) — whenever I make new friends at a workshop or conference or w/e I’ll add them on FB to keep in touch.\n\nDespite heavy culling, though, I’ve found that e.g. scrolling through my news feed is tremendously boring, which is where most people seem to get caught. Don’t do more than a quick skim for a couple minutes each day.",
      "author": "phylogenik",
      "created": 1561123084,
      "upvotes": 1,
      "replies": {}
    },
    "erpr7e5": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpr7e5/",
      "text": "If you need it for Messenger, it's possible to deactivate only your social media side of the account and keep the Messenger active.",
      "author": "valryuu",
      "created": 1561126012,
      "upvotes": 1,
      "replies": {}
    },
    "erprznl": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erprznl/",
      "text": "I deleted my account a couple months ago mainly because I think Facebook is an unethical company (I still use WhatsApp and Instagram though -- those will be more difficult to kick). I mainly use Twitter to keep in contact with academia, and it works really well. I don't think my social media consumption has decreased though -- it's just split among Twitter, Instagram and Reddit now.",
      "author": "flululululux",
      "created": 1561126572,
      "upvotes": 1,
      "replies": {}
    },
    "erpt0us": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpt0us/",
      "text": "I was an early adopter (my university was added in an early expansion) but I got rid of it during the 2012 elections. It was making me dislike everyone, even people I agreed with. I was surprised how little I missed it. Since then it’s been kind of sad to see how few friends I really have without that social prosthesis but oh well...\n\nI still use Instagram and was disappointed when FB acquired it. Not many RL connections there or Twitter but both are enjoyable enough to scroll just for design, animals, and maybe general news. \n\nFor me, if a particular social network is “necessary” to keep up in academia, especially the most invasive and insipid one, then academia is not what I thought it was.",
      "author": "SnittingNexttoBorpo",
      "created": 1561127294,
      "upvotes": 1,
      "replies": {}
    },
    "erpt92t": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpt92t/",
      "text": "After the election, I couldn’t stand the constant demoralizing din of ‘the end is nigh’. I also didn’t like how frivolously Facebook was treating my identity. I don’t miss it one iota. I would like to be able to easily extract my photos, but my guess is they make it purposefully difficult to do so. I use twitter for my collegial engagement and it works as well as I require.",
      "author": "Frogmarsh",
      "created": 1561127452,
      "upvotes": 1,
      "replies": {}
    },
    "erpv4j4": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpv4j4/",
      "text": "No one in my FB friends really posts \"highlight reels\" and such - in fact, aside from a couple people who regularly post memes or political commentary (and whom I've muted because it's annoying), everyone else posts maybe a few times a year. We use it to organize events and chat on messenger. I'll probably keep it until the website dies because I find it's an easy way to keep in touch with people you meet briefly without giving them your number.",
      "author": "thegreenaquarium",
      "created": 1561128736,
      "upvotes": 1,
      "replies": {}
    },
    "erpwdax": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpwdax/",
      "text": "I flushed it completely over four years ago. I was constantly comparing my own trajectory to those of others and it made me incredibly anxious and depressed. I was lucky enough to find an email list in my field that has great discourse without being a social bragging network. Twitter is even worse.",
      "author": "medievalista",
      "created": 1561129576,
      "upvotes": 1,
      "replies": {}
    },
    "erpwh7v": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpwh7v/",
      "text": "I did in a college setting environment with 20s something years old attached. I am proud of it.",
      "author": "musicallymaria24",
      "created": 1561129650,
      "upvotes": 1,
      "replies": {}
    },
    "erpzu4i": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpzu4i/",
      "text": "I never got a Facebook account and the attitude I get when telling people has really changed from \"you are an idiot and missing out on the good things in life\" to  \"yeah, that is probably for the best\". No regrets.",
      "author": "zorglubb",
      "created": 1561131903,
      "upvotes": 1,
      "replies": {}
    },
    "erq479o": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erq479o/",
      "text": "I stopped using fb in 2013. - I occasionally get pangs of regret when I hear about organized events after the fact. Would never put up with the site in exchange for that though.",
      "author": "abstitial",
      "created": 1561134815,
      "upvotes": 1,
      "replies": {}
    },
    "erq8sz5": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erq8sz5/",
      "text": "I've been off it since the election. I was spending too much time and emotional energy arguing with people who weren't going to change their minds anyway.",
      "author": "peregrin5",
      "created": 1561137780,
      "upvotes": 1,
      "replies": {}
    },
    "erq8ufz": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erq8ufz/",
      "text": "Didn't delete my account because it's my only way to communicate with my Dad and a few other members of my family. I just don't browse it. I unfollowed everything so my feed is empty, and I mainly use Messenger Lite on my phone to make video calls.",
      "author": "needlzor",
      "created": 1561137807,
      "upvotes": 1,
      "replies": {}
    },
    "erqeq21": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erqeq21/",
      "text": "I haven't left it so I have access to Messenger, but I cut my friend list to 25. Literally no one complained, and now my feed is about 2-3 posts long, and there's very little bullshit. Those 25 friends include the people I regularly talk to, so it works perfectly. I wonder how useful my data is to them now.\n\nIt's all pros: I don't waste time on Facebook because it's impossible, and it doesn't bring my mood down because those posts are always just regular status updates like people going to different places or such.",
      "author": "FlyingQuokka",
      "created": 1561141633,
      "upvotes": 1,
      "replies": {}
    },
    "erqkbof": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erqkbof/",
      "text": "Three months ago I changed my Facebook password to a random string of letters and numbers. I wrote down the password on a piece of paper, and I put the paper on a high shelf out of reach. I check Facebook every 2 weeks or so and after I log out and put my password back in its hiding spot. I deleted all social media and dating apps from my phone. So much more productive now!",
      "author": "gigiheheblop",
      "created": 1561145394,
      "upvotes": 1,
      "replies": {}
    },
    "erqrb2h": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erqrb2h/",
      "text": "Lots of academics work at Facebook",
      "author": "soulslicer0",
      "created": 1561150135,
      "upvotes": 1,
      "replies": {}
    },
    "err9bbx": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/err9bbx/",
      "text": "I deleted my account about 3 years ago. No regrets. I don't think it has had any bearing on my social life, really. I started grad school 2 years ago and simply told the few people who brought it up, 'I'm not on Facebook. Here's my email address.\"\n\nTell the people you communicate with regularly that you're making some changes, give them your email address or phone number. Alternatively, you can deactivate your account but continue to use Messenger as a stand alone service.\n\nEdit: I should mention that I have also since deleted all my social media accounts except for Reddit. It has really reduced my anxiety and proved my ability to focus on my work.",
      "author": "dendrocitta",
      "created": 1561163897,
      "upvotes": 1,
      "replies": {}
    },
    "erp0xby": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erp0xby/",
      "text": "Wait, how can you be an academic and have Facebook? How do you find the time?!",
      "author": "Kopuk_Ucurtma",
      "created": 1561095176,
      "upvotes": -2,
      "replies": {
        "erpa5bw": {
          "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpa5bw/",
          "text": "You say, posting on Reddit 🤣",
          "author": "liedra",
          "created": 1561107493,
          "upvotes": 11,
          "replies": {
            "erx091x": {
              "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erx091x/",
              "text": "Did... did you... just equate FaceBook to Reddit? This must be a grandpa joke.",
              "author": "Kopuk_Ucurtma",
              "created": 1561364951,
              "upvotes": 1,
              "replies": {
                "erx17pr": {
                  "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erx17pr/",
                  "text": "No, the question was how someone had the time, and I suggested that time is required to post on reddit too. :)",
                  "author": "liedra",
                  "created": 1561366475,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "erpaqvz": {
      "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpaqvz/",
      "text": "Not me. I use it all the time. Love it. Some people don't, and delete it. No need to be preachy.",
      "author": "tfburns",
      "created": 1561108454,
      "upvotes": -1,
      "replies": {
        "erpm9dh": {
          "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erpm9dh/",
          "text": "> No need to be preachy.\n\nYou don't get it. People can be very preachy about Facebook - that you should have it, everyone has it, etc.",
          "author": "RRautamaa",
          "created": 1561122172,
          "upvotes": 0,
          "replies": {
            "erqu5v5": {
              "link": "/r/AskAcademia/comments/c33rqk/who_left_facebook_entirely/erqu5v5/",
              "text": "I've never met anyone who's preachy in the positive about having Facebook. What is their reasoning? For sure I have met/heard of people like OP who are preachy in the negative.\n\nPerhaps the only social media evangelism I've witnessed has been for Twitter, Reddit, LinkedIn, or some professionally-orientated social media (or space thereof, e.g. r/AskAcademia). Most of the time their reasoning is career-related, e.g. helps you connect with future employers.",
              "author": "tfburns",
              "created": 1561152140,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}