{
  "sid": "d2hkeo",
  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/",
  "title:": "What is your most petty academia moment?",
  "text": "Unleash all the juicy details.",
  "author": "todeedee",
  "created": 1568162093,
  "updated": 1634081906,
  "over_18": false,
  "upvotes": 106,
  "upvote_ratio": 0.97,
  "comments": {
    "ezv1zey": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezv1zey/",
      "text": "\"per my last email...\"",
      "author": "historysoup_",
      "created": 1568165170,
      "upvotes": 249,
      "replies": {
        "ezv3rf5": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezv3rf5/",
          "text": "I feel so seen",
          "author": "Solivaga",
          "created": 1568166431,
          "upvotes": 65,
          "replies": {}
        },
        "ezv6l0n": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezv6l0n/",
          "text": "Well if you’d do shit the first time I wouldn’t have to send that one!",
          "author": "guttata",
          "created": 1568168522,
          "upvotes": 31,
          "replies": {}
        },
        "ezvd3fi": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvd3fi/",
          "text": "Hah I used this way more in consulting with difficult clients than I ever have in academia",
          "author": "bandinterwebs",
          "created": 1568173928,
          "upvotes": 9,
          "replies": {}
        },
        "ezwxoks": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwxoks/",
          "text": "Oh god. The dark flip side of that is when you have already sent something to your department secretary THREE TIMES and she keeps asking for it again. And you don't want to be petty, but you do want to point out that obviously she has a gap in her system. How do you point that out without looking like a jerk?",
          "author": "trailmix_pprof",
          "created": 1568227442,
          "upvotes": 2,
          "replies": {
            "ezxoez2": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezxoez2/",
              "text": "Just forward the last email to him/her again. Say you didn't have the original on hand, but luckily were able to find it in your archived email.",
              "author": "starship-unicorn",
              "created": 1568245531,
              "upvotes": 2,
              "replies": {
                "ezxtci8": {
                  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezxtci8/",
                  "text": "I tried that on one of those attempts. It whooooshed right by the recipient.",
                  "author": "trailmix_pprof",
                  "created": 1568249150,
                  "upvotes": 1,
                  "replies": {
                    "ezxu52y": {
                      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezxu52y/",
                      "text": "Yeah well, if subtlety doesn't work...",
                      "author": "starship-unicorn",
                      "created": 1568249729,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "f0415e4": {
                      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/f0415e4/",
                      "text": "I’ve been there (as the recipient). I think sometimes you’re so overworked that you indeed don’t realise you’ve been asking for the same thing several times (and even then, if you forward your first message, it might not compute). Not making excuses, but it might be the case here (and sometimes, I know I received it, but for the life of me cannot locate it). So, in those cases, I would say so/apologise after asking again, or say sorry forgot yo already sent it, but it’s hard for everyone to admit a mistake, so maybe they’re sheepish with it and know they’ve done it (but should still apologise).",
                      "author": "balletowoman",
                      "created": 1568376903,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ezvgl5n": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvgl5n/",
      "text": "Colleague raised her hand to second approval of the minutes from the last three-hour meeting. An assistant interrupted the second to insist that said colleague would not be eligible to approve the minutes because, four months prior, she left said meeting 10 minutes early.",
      "author": "somecuriousperson",
      "created": 1568177374,
      "upvotes": 95,
      "replies": {
        "ezw3upx": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezw3upx/",
          "text": "This is the petty game the OP requested!!",
          "author": "BananasonThebrain",
          "created": 1568207153,
          "upvotes": 16,
          "replies": {}
        },
        "ezwxrz7": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwxrz7/",
          "text": "And then the committee realizes that without her vote they do not have a quorum and will have to wait until next month's meeting to attempt to approve the minutes.",
          "author": "trailmix_pprof",
          "created": 1568227505,
          "upvotes": 4,
          "replies": {
            "ezxoiwe": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezxoiwe/",
              "text": "Can't have the meeting at all without a quorum present. They'd have to wait to do everything.",
              "author": "starship-unicorn",
              "created": 1568245611,
              "upvotes": 1,
              "replies": {
                "ezxt8mf": {
                  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezxt8mf/",
                  "text": "Sorry, I should have said \"majority\" not \"quorum\". If attendance is low (but still at quorum) then you can an into a situation where if even one person abstains, you don't have a majority even if everyone votes affirmative.\n\nThis occurs when an affirmative majority of the *entire* membership is required to approve something. It can be quite a PITA for approving minutes, because people who were previously absent tend to abstain from voting on those minutes.",
                  "author": "trailmix_pprof",
                  "created": 1568249073,
                  "upvotes": 1,
                  "replies": {
                    "ezxtzmf": {
                      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezxtzmf/",
                      "text": "Majorities are determined based on the number of members *present and voting* for standard main motions. If only one person votes it could still pass. The only questions that require a majority of entire membership are for questions where the default is that notice is provided in advance of the vote. In those cases it is possible to approve without notice, provided you have a majority of the entire membership.\n\nThis of course assumes standard RONR 11th Ed. and that your bylaws don't specify a different procedure. It also does not apply to questions that have higher thresholds, such as bylaws amendments or motions to rescind an action previously taken.\n\nIf your bylaws mandate a majority of entire membership for approving minutes, you should hire a parliamentarian to help you revise them. I can't think of very many situations where such a requirement would make sense.\n\nEdit: sorry, I care way to much about this.",
                      "author": "starship-unicorn",
                      "created": 1568249618,
                      "upvotes": 1,
                      "replies": {
                        "ezxvevi": {
                          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezxvevi/",
                          "text": "> This of course assumes standard RONR 11th Ed. and that your bylaws don't specify a different procedure.  \n\nThe committee does have beyond-RONR procedures for some things. I'll have to look into this, though, as the chair of the committee seems frustrated by it at times and would probably be happy if we had another option.",
                          "author": "trailmix_pprof",
                          "created": 1568250655,
                          "upvotes": 1,
                          "replies": {
                            "ezxvkz0": {
                              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezxvkz0/",
                              "text": "If it's a committee, seconds aren't even required by Robert's Rules. Committees use the informal procedures specified for small boards.\n\nEdit: they also aren't supposed to record minutes under Robert's Rules either. The committee's report to the body is the official record of their actions. Many schools, including my own, require committees to keep minutes in their own ~~Bullard~~ actions because of rules from their accrediting bodies, but Robert's doesn't require them.\n\nEdit 2: autocorrect",
                              "author": "starship-unicorn",
                              "created": 1568250778,
                              "upvotes": 1,
                              "replies": {
                                "ezxxq3e": {
                                  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezxxq3e/",
                                  "text": "It is a committee, but it's under the California Brown Act, so there are extra layers.",
                                  "author": "trailmix_pprof",
                                  "created": 1568252341,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ezwhgi6": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwhgi6/",
          "text": "This happened to me after I had spoken out against someone in defense of my colleague's Title 9 complaint. 🙃",
          "author": null,
          "created": 1568216773,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ezvba4j": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvba4j/",
      "text": "Was told to hear a student conduct case and decide if student should be suspended. I decided no, it was too severe.\n\nGet an email from legal affairs at 9am the next day asking why I didn't suspend the student. I provide my reasoning, go over how our conduct code says to give educational punishments, etc.\n\nChief legal officer (a cabinet position) tells me I need to redo the case and suspend the student. Back and forth for an hour. I finally tell him I will send the student a letter saying \"you're suspended\" in the chief legal officer's name since it is apparent that is his decision and not mine.\n\nHe sends me back saying I'll hear from the Dean of Students and I'm not allowed to sign anything in his name.",
      "author": "simmelianben",
      "created": 1568172326,
      "upvotes": 70,
      "replies": {
        "ezvbuv0": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvbuv0/",
          "text": "That's shady as hell. They clearly wanted you to take the legal (and moral) blame for it. What ended up happening?",
          "author": "respeckKnuckles",
          "created": 1568172826,
          "upvotes": 48,
          "replies": {
            "ezvcra7": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvcra7/",
              "text": "Policy got changed so I camt/don't handle that type of case anymore. Case was \"reheard\" by Dean and student suspended sadly.\n\nThere were plenty of shady things while that lawyer was there. Fortunately, ethics board and a new president led to their leaving, so a new, good lawyer can come in.",
              "author": "simmelianben",
              "created": 1568173622,
              "upvotes": 49,
              "replies": {
                "ezw577h": {
                  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezw577h/",
                  "text": "Important lesson to any new or aspiring faculty members reading this: If administration wants you to say something they can easily say themselves, *treat this as a huge red flag*!",
                  "author": "respeckKnuckles",
                  "created": 1568208217,
                  "upvotes": 30,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ezv5riq": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezv5riq/",
      "text": "A previous supervisor of mine during my undergrad was accused and later found guilty of gross academic dishonesty and had their career come to a screeching halt. They made my life a living hell during the time in their lab and caused me so many issues. I testified against them during the hearing.",
      "author": null,
      "created": 1568167903,
      "upvotes": 130,
      "replies": {
        "ezvdbvj": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvdbvj/",
          "text": "That's more pro than petty to be honest. Being willing to publicly speak out against established academics takes a fair bit of courage, even if its open and shut.",
          "author": "boringhistoryfan",
          "created": 1568174145,
          "upvotes": 63,
          "replies": {
            "ezvskwi": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvskwi/",
              "text": "I will say it was terrifying to be honest. I felt like I was risking my career testifying.",
              "author": null,
              "created": 1568194664,
              "upvotes": 18,
              "replies": {}
            }
          }
        },
        "ezv6k7i": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezv6k7i/",
          "text": "How did they make your life a living hell?",
          "author": "ObiJuanita",
          "created": 1568168504,
          "upvotes": 18,
          "replies": {
            "ezv6pc0": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezv6pc0/",
              "text": "Hoo boy. Public humiliation, relentless pressure, berating you. Emailing you at all ungodly hours of the night and expecting answers immediately. I was just an undergrad and I still pressured and trashed both privately and publicly. Insane workload. It was not fun.",
              "author": null,
              "created": 1568168613,
              "upvotes": 63,
              "replies": {
                "ezv6xtg": {
                  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezv6xtg/",
                  "text": "I am so sorry, that sounds awful. But it must have been satisfying to testify against them years later once you were rid of them.",
                  "author": "ObiJuanita",
                  "created": 1568168801,
                  "upvotes": 22,
                  "replies": {
                    "ezv6zbw": {
                      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezv6zbw/",
                      "text": "Oh man did it feel good.",
                      "author": null,
                      "created": 1568168833,
                      "upvotes": 31,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ezvzho8": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvzho8/",
      "text": "I basically took a year off from doing anything productive for my degree a few years ago to push for a grad employees union. This entailed work I didn’t realize at the outset would be so consuming and stressful. In the week leading up to our vote, the dean went around to each department urging strongly that students come to a meeting where he would tell them the reasons unions are bad for universities. I got myself invited by friends I had made in each department while canvassing and basically debated the dean every day for a week - sometimes twice a day. \n\nHe hated my guts, but the vote ended up passing. \n\nTwo weeks later, I was given an award by our student government for outstanding leadership and presented a plaque on stage by the very same dean",
      "author": "Rizzpooch",
      "created": 1568203360,
      "upvotes": 44,
      "replies": {
        "ezxeamu": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezxeamu/",
          "text": "This is beautiful. Thank you.",
          "author": "echoGroot",
          "created": 1568238348,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ezw4a2t": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezw4a2t/",
      "text": "Had to create a throwaway account for this.  Two of my colleagues (M/F) started seeing each other on the side.  The guy was a more senior member of the department, the woman was more junior than me...oh and was/ is still married. On more than one of their secret rendezvous occasions, I would get drunk texted very inappropriate pictures of the two of them. I kept my mouth shut b/c as a junior person I wasn't risking the backlash of saying anything. I watched the woman (who again, was more junior) get promoted over me, get special priveledges, get a title change so that she could make more money, etc. I very bitterly watched.\n\nFinally, a student of the woman went to her and complained about a test grade.  She said she stood by all her grading decisions and wasn't going to entertain the possibility of a re-grade.  So the student went to the coodinator...the guy.  He said \"I trust her grading decisions and I am not even going to look at your test.\"  So the student filed a complaint with the department saying that they were not getting a fair shot since woman/man were obviously seeing each other, and would back each other up on anything.  In the end, the department asked the two of them to keep it more discrete, but that there was no formal policy against it. However, they did not want anyone in our professional society to know about it b/c the guy was going for a high leadership position in said national organization.\n\nI managed to get a new (still junior) job and got the hell out of there.\n\nSometime later the guy asked me for a favor (to make him an invited speaker in my session) so that he could look better for the leadership position. I said no.  He pushed back and said he could ruin my academic career by badmouthing me and making sure I never found a TT position.  I texted him one of the drunken pictures.  He's never contacted me again.",
      "author": "academic_nightmare",
      "created": 1568207494,
      "upvotes": 32,
      "replies": {
        "ezwlnfx": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwlnfx/",
          "text": "> On more than one of their secret rendezvous occasions, I would get drunk texted very inappropriate pictures of the two of them.\n\nWho sent you these?",
          "author": "rauhaal",
          "created": 1568219528,
          "upvotes": 6,
          "replies": {}
        },
        "ezwnedf": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwnedf/",
          "text": "what a wild ride!! That's CRAZY. You dodged a lot there!",
          "author": "BananasonThebrain",
          "created": 1568220667,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ezv99de": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezv99de/",
      "text": "So, this goes back to my last full semester as a grad student (humanities). I've been adjunct enrolled (aka, a placeholder instead of classes if you only have your thesis left) for about three semesters now because life went to hell. I was president of the graduate council for my major. One of my VPs (I beat her out for president) had never really liked me to begin with, and I had mentioned that I was going to have to push back finishing my thesis for at least an extra semester. She smugly said, \"Oh, you're not finishing on time? I would've thought you would.\"\n\nLittle did she know I was going back and forth to our state's capital for tests all semester because it was a large possibilty that I was gonna need open heart surgery (I did end up my valve repaired the following August). Let me tell you, it was so worth it to say to her \"actually, my health hasn't been the greatest. I might have to have open heart as early as this summer.\" \n\nThe look on her face when I said that? It may be petty, but after dealing with her attitude it was so satisfying to watch her face crumble and for her to frantically back peddle her way out of that mess.",
      "author": "crazifang",
      "created": 1568170635,
      "upvotes": 91,
      "replies": {
        "ezvhy1o": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvhy1o/",
          "text": "I don't think that's petty, it's just telling the truth. But boy did I enjoy to imagine her face all red.",
          "author": "cosmonautsanchez",
          "created": 1568178891,
          "upvotes": 33,
          "replies": {
            "ezvi4vp": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvi4vp/",
              "text": "It felt a little petty since it was in front of her best friend and one of the standout students in our collective cohorts. But it was something that warms my cackles. \n\nI like to joke and say that moment was worth literally almost dying, having my breastbone broken, and going through the intensive recovery process. Like, the fixed heart is great and all but her face when I said that? Definitely the cherry on top.",
              "author": "crazifang",
              "created": 1568179109,
              "upvotes": 21,
              "replies": {
                "ezvie3d": {
                  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvie3d/",
                  "text": "She was belittling you without considering any health issues which everyone might have some time in their lives. It's worth many things since you're not carrying a negative thoughts shaped into a person purse with you anymore. Good job!\n\nBy the way I hope you're healthy now. Take care of yourself, we need more people like you in the academia.",
                  "author": "cosmonautsanchez",
                  "created": 1568179405,
                  "upvotes": 10,
                  "replies": {
                    "ezvikoe": {
                      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvikoe/",
                      "text": "Aw, thank you! I am much healthier now. My year anniversary of my surgery is actually tomorrow. I said August before but that was my exhausted brain playing tricks on me lol (I originally had surgery scheduled for July 2018, but it got rescheduled to August 2018, then September 2018. It also got postponed a week in September because of the aforementioned almost dying). I'm hoping to finish my thesis this semester now that everything has calmed down, so fingers crossed! I just have the intro left.",
                      "author": "crazifang",
                      "created": 1568179621,
                      "upvotes": 7,
                      "replies": {
                        "ezvirxl": {
                          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvirxl/",
                          "text": "I'm so glad! I believe in you, it's almost finished. You have the power to face all these issues, an intro is near to nothing for you. Fingers crossed for you!",
                          "author": "cosmonautsanchez",
                          "created": 1568179860,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ezvdo7s": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvdo7s/",
      "text": "For my undergrad thesis (which for my university was a course with usually about 5-6 other students overseen by a professor), my advising professor insisted that students double space after full stops/semicolons/commas, which is actually a typographical error for polyspace fonts like Times New Roman (But many people learned it as a rule because they learned to type on typewriters, which use a monospace font — and then passed this ‘rule’ down to others). He said he would mark down students who didn’t double space, so I had to go through my 40-page paper and fix all the spacing to suit him. \n\nAfter the end of the semester, once final grades were turned in, I emailed him the Chicago Manual of Style’s website saying not to double space after punctuation, with a note that he ‘might find it interesting.’",
      "author": "Loimographia",
      "created": 1568174456,
      "upvotes": 79,
      "replies": {
        "ezvmgae": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvmgae/",
          "text": ">so I had to go through my 40-page paper and fix all the spacing to suit him. \n\n\nPlease tell me you werr able to use find and replace to do this in 30 seconds and did not do it manually.",
          "author": "n23_",
          "created": 1568184657,
          "upvotes": 25,
          "replies": {
            "ezvn9iw": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvn9iw/",
              "text": "Sadly that doesn’t work when you have footnotes, because it then does (period)(space)(footnotenumber)(space) instead of (period)(footnotenumber)(space)(space).",
              "author": "Loimographia",
              "created": 1568185857,
              "upvotes": 7,
              "replies": {
                "ezvpv90": {
                  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvpv90/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1568190041,
                  "upvotes": 11,
                  "replies": {
                    "ezwfk8a": {
                      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwfk8a/",
                      "text": "Does word have a regex engine for find and replace?",
                      "author": "Dr_Jabroski",
                      "created": 1568215519,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "ezwuxo8": {
                      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwuxo8/",
                      "text": "Do you even need regex for this? It seems like you just need to replace \". \" (one space) with \".  \" (two spaces) to avoid this issue (instead of replacing \".\" (no spaces) with \". \" (one space)). Sure people aren't putting spaces before the footnote number?",
                      "author": "plumpvirgin",
                      "created": 1568225625,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "ezwk27q": {
                  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwk27q/",
                  "text": "Which is why you do a find on (period)(space)(space) instead of just a find on (period). Then you can do separate finds on (period)(1)(space)(space)...(period)(5)(space)(space). I don't imagine you'd have more than 5 footnotes on a page. So the whole process should take no more than 45-60 seconds.",
                  "author": "tinkletwit",
                  "created": 1568218490,
                  "upvotes": 1,
                  "replies": {
                    "ezwl686": {
                      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwl686/",
                      "text": "I think you're misunderstanding -- I only had (period)(space)s that he wanted replaced with (period)(space)(space), not vice versa -- aka adding errors into the text when it was originally typographically correct. The insult was adding errors, not necessarily the time spent on it.",
                      "author": "Loimographia",
                      "created": 1568219219,
                      "upvotes": 1,
                      "replies": {
                        "ezwllcu": {
                          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwllcu/",
                          "text": "Oops. Well, then it's still a trivial find-replace job. But fair point about it being an insult.",
                          "author": "tinkletwit",
                          "created": 1568219489,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ezvkx77": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvkx77/",
          "text": "Stick one of these :) in there because no gods no masters",
          "author": "HungryBanana07",
          "created": 1568182546,
          "upvotes": 18,
          "replies": {}
        },
        "ezvq0ax": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvq0ax/",
          "text": "That's so dumb. Profs who insist on strict rules for bibliographies are just as bad. When you actually publish in academia there's just software that handles all that for you - LaTeX will make the spacing correct *and* format your bibliography for whatever journal you want.",
          "author": "Astrokiwi",
          "created": 1568190280,
          "upvotes": 9,
          "replies": {
            "ezwb2c1": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwb2c1/",
              "text": "This is one thing I love about convincing my advisor to switch to LaTeX - he was the worst about weird indents/formatting/double (or triple!) spacing after punctuation/etc. Of course, he finds other things in the templates to mess with now for some reason, then calls me to \"fix\" it - ie undo his unnecessary changes. *sigh*",
              "author": "thelamepretender",
              "created": 1568212489,
              "upvotes": 3,
              "replies": {}
            },
            "ezwqulp": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwqulp/",
              "text": "This works poorly in certain disciplines, especially those with lots of weird (special) cited sources. It is not one-size-fits-all. That's part of why the Chicago Manual is so massive. I have to warn students every year never to presume the automatic system is correct--always double check.",
              "author": "khosikulu",
              "created": 1568222933,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ezw61y6": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezw61y6/",
          "text": "This warms my icy, frozen, design professor heart.",
          "author": "stoutprof",
          "created": 1568208872,
          "upvotes": 4,
          "replies": {}
        },
        "ezvl9oi": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvl9oi/",
          "text": "Careful, he is a hero",
          "author": "MezzoSole",
          "created": 1568183013,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ezvd7hf": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvd7hf/",
      "text": "\"IT'S IN THE SYLLABUS.\"",
      "author": "bandinterwebs",
      "created": 1568174031,
      "upvotes": 26,
      "replies": {
        "ezvimaj": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvimaj/",
          "text": "“Per the syllabus” #classic",
          "author": "cebeck20",
          "created": 1568179675,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "ezvzamy": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvzamy/",
      "text": "Not me personally, but in my old department I had a colleague who would either have a coffee mug or a little ribbon that said “I survived another meeting that could have been an email”. Every. Single. Meeting.",
      "author": "lickmysackett",
      "created": 1568203169,
      "upvotes": 25,
      "replies": {
        "ezwy5m5": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwy5m5/",
          "text": "The fact that they had both a ribbon *and* a mug. That was serious commitment.",
          "author": "trailmix_pprof",
          "created": 1568227754,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ezvz7ls": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvz7ls/",
      "text": "I had a group project where the other member didn't do anything, so I spelt his name wring in the paper and the presentation.",
      "author": "alr123321",
      "created": 1568203090,
      "upvotes": 22,
      "replies": {
        "ezw41ja": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezw41ja/",
          "text": "I have heard the best way to get collaborators to give you feedback on a draft is to mess up their affiliation or middle initial or email address. I have yet to try it.",
          "author": "BananasonThebrain",
          "created": 1568207307,
          "upvotes": 18,
          "replies": {
            "ezxfawq": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezxfawq/",
              "text": "I do this with my supervisor when I send them things because their ego will not permit their name/details being spelled incorrectly and I get feedback every time... Unfortunately the feedback is often the exact same document I sent them with their name corrected and maybe one or 2 other grammatical corrections. Yay. It still irritates them though, so that pettiness is my sole consolation.",
              "author": "CG_blue",
              "created": 1568239039,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ezvd15o": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvd15o/",
      "text": "I once TAd for a lecturer in our department as a grad student. When I went on the market I asked this person to write a short blurb for my teaching portfolio/evaluations. They refused saying that I \"didn't do enough to deserve it\" (I did). All I wanted was two sentences that said I was an effective grader. I was furious.\n\nI ended up landing a TT job my first time out (yes, mild humble brag but let me enjoy it). I made a point making this known to the lecturer. It was...satisfying. The more they refused to say \"good job\" the better I felt.\n\nI guess this is a story of pettiness for both of us lol.",
      "author": "adamcc2",
      "created": 1568173870,
      "upvotes": 45,
      "replies": {}
    },
    "ezvdejo": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvdejo/",
      "text": "I had someone a couple of years junior to me beg me for notes and tuition. They got nasty when I couldn't oblige. Turned over the correspondence to my supervisor, whose class this was for.",
      "author": "boringhistoryfan",
      "created": 1568174214,
      "upvotes": 15,
      "replies": {
        "ezvw466": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvw466/",
          "text": "They begged you to pay for tuition?",
          "author": "Average650",
          "created": 1568199767,
          "upvotes": 6,
          "replies": {
            "ezw3m8x": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezw3m8x/",
              "text": "Not not to pay. Take some classes for them cause they hadn't been keeping up with the course and were worried about flunking it. Problem was nothing I offered was good enough. Everything needed to be on their terms and to hell with my constraints.",
              "author": "boringhistoryfan",
              "created": 1568206964,
              "upvotes": 5,
              "replies": {
                "ezw49qd": {
                  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezw49qd/",
                  "text": "Like take the classes for them? Get them their grades?",
                  "author": "Average650",
                  "created": 1568207487,
                  "upvotes": 4,
                  "replies": {
                    "ezw4j8h": {
                      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezw4j8h/",
                      "text": "Extra classes over the weekends. She originally wanted my notes from the class. I told her I couldn't do that, and explained why. Offered to help walk her through the course as a whole. Turned out she hadn't read anything and expected me to basically cover the entire course for her since she hadn't been paying attention.\n\nI said I could help a little, but she'd still need to do her homework, read the material, etc and I had time constraints. She flipped out.\n\nI wasn't in a position to actually get her the grade though or anything. That was entirely in the professor's hands. I wasn't a TA or anything.",
                      "author": "boringhistoryfan",
                      "created": 1568207696,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ezw2x75": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezw2x75/",
              "text": "Tuition, not tuition fees.",
              "author": "Glaselar",
              "created": 1568206410,
              "upvotes": 1,
              "replies": {
                "ezw45g2": {
                  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezw45g2/",
                  "text": "Maybe tuition has a subtly different meaning in other countries? Tuition here means the price you pay to enroll.",
                  "author": "Average650",
                  "created": 1568207393,
                  "upvotes": 10,
                  "replies": {
                    "ezwc8ni": {
                      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwc8ni/",
                      "text": "Sure, but that's just a colloquialism from dropping the noun. Tuition is still a word that means the product of teaching, and it's the rational interpretation of the story.",
                      "author": "Glaselar",
                      "created": 1568213281,
                      "upvotes": -1,
                      "replies": {
                        "ezwevtt": {
                          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwevtt/",
                          "text": "I've never heard it used that way and I'm fairly certain that very few faculty or students in American institutions would know it could be used that way (save international students and faculty from other countries). I did not know that, though it makes sense and I don't doubt it.",
                          "author": "Average650",
                          "created": 1568215065,
                          "upvotes": 7,
                          "replies": {
                            "f0425z9": {
                              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/f0425z9/",
                              "text": "I would say tuition is synonymous with teaching or coaching (in the UK).",
                              "author": "balletowoman",
                              "created": 1568377690,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ezv5h2p": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezv5h2p/",
      "text": "I recently asked someone giving a report on a service committee what sort of research they had to support their proposed policies. The topic was appropriate punishment levels to deter academic dishonesty.",
      "author": "BlargAttack",
      "created": 1568167682,
      "upvotes": 34,
      "replies": {
        "ezvcc39": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvcc39/",
          "text": "What is petty about asking people to share research supporting their claims?  \nIsn't that basically saying \"citation needed\"?\n\nHave I been \"petty\" all this time by accident because I ask people to back up their claims? Isn't that what science is about, having evidence, not just asserting something ex nihilo?",
          "author": "andero",
          "created": 1568173246,
          "upvotes": 20,
          "replies": {
            "ezvk4ny": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvk4ny/",
              "text": "Whether a citation is needed for a claim is a sliding scale, ranging from the selfevident to the outlandish. So, yeah, there are clearly contexts where asking for a citation can be a little petty.",
              "author": "100011101011",
              "created": 1568181512,
              "upvotes": 5,
              "replies": {
                "ezvw3kn": {
                  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvw3kn/",
                  "text": "This seems like a perfectly reasonable time to do so though.",
                  "author": "Average650",
                  "created": 1568199745,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ezwlgol": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwlgol/",
      "text": "When I was a PhD student, the PhD students in my department had a tea time every day from 1030-11 in the break room. It was great and really community-building and faculty/staff often came and had tea during it. Apparently a few of the faculty felt uncomfortable making their tea while we were in the same room as them though, and it was decided that the *staff* would hold a tea from 1030-11 every day. They put up a sign that PhD students were no longer allowed in the break room during that time.\n\n&#x200B;\n\nThe staff tea break fizzled out after a few days, but it destroyed the PhD tea time forever. So petty.",
      "author": "zainab1900",
      "created": 1568219404,
      "upvotes": 5,
      "replies": {
        "ezwnzy4": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwnzy4/",
          "text": "Similar thing happened in my grad program. students would hold weekly \"tea\" on Friday evenings (really we just drank beer and shot the shit) and some faculty would come by. The newly elected program chair decided that the weekly \"teas\" should be institutionalized so that everyone can participate (he REALLY wanted ppl to like him). Turns out very few faculty member want to sponsor snacks and drinks for the whole program and the \"tea\" got killed.",
          "author": "rambobilai",
          "created": 1568221058,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ezvyni8": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvyni8/",
      "text": "As dept chair, I was required to sign a printed out copy of our financial accounts and send it to the division chair once a semester. Our finance dept had so fucked up the accounts, including donor accounts, that I sent an unsigned copy to the division chair with a note saying I wasn't comfortable signing my name and implying my agreement with the state of the accounts. I also copied the Provost. No one ever responded. One of many reasons why I quit.",
      "author": "professorplum77",
      "created": 1568202533,
      "upvotes": 5,
      "replies": {}
    },
    "ezwz8qf": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwz8qf/",
      "text": "This goes back to when I was a student, but that's still academic, right?\n\nI was taking a challenging philosophy class. Attending lecture was necessary to get the content but they were grueling to get through. There was another student who missed class one day and asked to borrow my notes. I said fine and he did - took them, made copies, and returned them to me. But then he started missing about half of the classes. At the end of the semester he wanted to borrow ALL of my notes. Although he pressured me, I said no because the exam was a week away and I didn't want to be without my notes during that time. (And I didn't really know or trust this guy to for sure get them back to me.)\n\nThe next day I get a call in my dorm room. It's Notes Guy calling from down in the lobby. He wants me to bring my notes down and he'll photocopy them right there in the lobby and give them right back to me. I don't feel like I can reasonably say \"no\" to him, since he's made it very convenient for me. But I'm pissed that he got to skip half the boring lectures and is now benefiting from my notes and is so insistent on it.\n\nSo petty me kicks in: still alone in my dorm room, I go through my notebook and remove about 2/3 of the pages, especially the important ones. Then I bring it down for Mr. Leech to photocopy. Good luck making sense of that!",
      "author": "trailmix_pprof",
      "created": 1568228469,
      "upvotes": 3,
      "replies": {}
    },
    "ezw8s7c": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezw8s7c/",
      "text": "I helped get a teacher with tenure removed from the school.\n\nI dropped out of college for a year due to the way a professor ran a 100 level 1 credit hour \"Intro to Psychology\" as a major class.  Professor required 8+ pages of perfectly APA formatted research paper each week(mind you for a 1 c.h. class).  Each of the papers were out of 10 points and i got -14 points on one and it was explained to me that every error was -1 point(lost 3 points due to having a space where there shouldn't have been in 3 different in text cations).  The professor had 6-8 T.A.'s for his class of 30 students so he wouldn't have to do any real work.  He sat in front of the class and bragged about how he had tenure and was untouchable unless he sexually assaulted a student or the like.  Also that he had come from a more prestigious university to come teach at ours and we should feel lucky to be his students.  He decided to lecture us on what Italics was for 20 minutes with accompanying power point presentation because \"apparently some of you can't understand this simple concept\", rather than explaining the nuances of when different formatting is needed/required in citations. \n\nThe stress of the class on top of everything else I had going on caused my major depressive disorder to go from managed with medication to being catatonic and couldn't get out of bed in the morning. (Yes it was my responsibility to take care of myself, and I failed to reach out to resources to help myself when this happened etc). \n\nI dropped out and worked in a residential treatment center for dually diagnosed youth for a year.  I had to re-apply for the university and have a meeting with the Dean of the school of science to re-enroll.  When I met with the dean he was super chill and asked me about what I was going to do differently this time and how I was going to avoid the issues that had caused me to drop out.  As I was describing how I was going to avoid the pitfalls that caused me to be unsuccessful he got a concerned look on his face, and asked which professor I was talking about when i was describing the behavior of the professor.  When I told him he said that I was not the only student who have had issues with this professor but if I was willing to give him an on the record written statement of my experiences, and his abuse of department resources (seriously 1 TA per 4-5 students?), he would be \"Very appreciative\".   \n\nI was happy when I noticed that the teacher no longer worked at the university, despite having tenure.",
      "author": "Izork95",
      "created": 1568210885,
      "upvotes": 7,
      "replies": {
        "ezwvscp": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwvscp/",
          "text": "I'm so confused by how that department is run that they \\*can\\* hire 6-8 TAs for 30 students. At my schools, I get a bit of say in which TAs I have, but the \\*number\\* of TAs that I have is most definitely not my decision, and it seems insane to me that someone can just pick whatever number they like, seemingly without the department actually knowing about it.",
          "author": "plumpvirgin",
          "created": 1568226192,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ezvokeb": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvokeb/",
      "text": "Every faculty meeting",
      "author": "faramirskywalker",
      "created": 1568187893,
      "upvotes": 9,
      "replies": {}
    },
    "ezvn42s": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvn42s/",
      "text": "I’m going to submit my thesis next week and I don’t plan of telling my supervisor. He has barley been there for me for the entirety of my masters and if I had my way his name wouldn’t be anywhere near any papers I’m on.",
      "author": null,
      "created": 1568185627,
      "upvotes": 7,
      "replies": {
        "ezvpno5": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvpno5/",
          "text": "Obviously I'm unfamiliar with your situation and your work, but please tell me you've had other people (e.g. secondary supervisor) read through it and give comments?\n\nI'm just concerned because I've seen theses handed in by masters students who didn't show them to their supervisors before submitting, and they were some of the worst documents I've ever seen. Like worse than a first year undergrad's work.",
          "author": "foibleShmoible",
          "created": 1568189688,
          "upvotes": 20,
          "replies": {
            "ezvpqyw": {
              "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvpqyw/",
              "text": "Yeah I’ve done that, albeit not as thoroughly as I want. I’m just so mentally tired and stressed out though and I really just need to move on with my life.",
              "author": null,
              "created": 1568189843,
              "upvotes": 3,
              "replies": {
                "ezwsg8d": {
                  "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwsg8d/",
                  "text": "Fair enough, just wanted to make sure you weren't shooting yourself in the foot. Good luck!",
                  "author": "foibleShmoible",
                  "created": 1568223991,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ezwndu0": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezwndu0/",
      "text": "A few years ago as a grad student. The department held a scholarship banquet every year to give out a couple dozen small scholarships to undergrads and grads. Donors were sometimes in attendance to meet awardees. The event was usually shockingly half-assed (common for academia but embarrassing for a theatre department), but students still came because they might get money and it was fine.\n\nOne year the folks involved decided it was not fancy enough (I agree it needed some polish) and that the way to solve it was by a) establishing a dress code and b) charging an admission fee for the event. Oh, yeah, and also getting grad students to perform without compensation. I was then head of department grad student org, and my colleagues and I carefully gathered feedback and testimony from any department grad students who wished (most con but a few pro) and then respectfully contacted the faculty to express concerns. \n\nFirst of all, undergrads at the end of the school year are simply not going to show up if all you're doing is offering the same old food but now they have to dress up for it. Second of all (and most important), charging an admission fee to be awarded scholarship money raises all sorts of perceived and real ethical concerns. Everything would be fine, I argued, if you just asked people to pay for the banquet but they could come for the award ceremony afterward for free. Simple. At the end of it all, they dropped the idea (though mostly because the faculty/staff who had the idea to begin with weren't very good at actually doing the work to realize their grand dreams.\n\nThree years later the same committee sent out a circa-1997 e-vite (this was well after 1997) to the banquet and ceremony that included the new dress code and ticket prices. No consultation, no consideration, no nothing. \n\nAnd they left the comments on the e-vite page. \n\nI responded in a Dr. Seussian long-form poem. I did it multiple times until my PhD advisor had to personally ask me to stop because they didn't know how to turn the comments off.\n\nAfter I raised a stink they agreed that people could come to the ceremony without going to/paying for the banquet and I sat right in the front row clapping for each and every awardee. \n\nI clapped loudest for all of the undergrads who were being given awards but who didn't show up to an event they had to pay and dress up for.",
      "author": "Harmania",
      "created": 1568220658,
      "upvotes": 2,
      "replies": {}
    },
    "ezvqhzk": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezvqhzk/",
      "text": "I had an oral exam in Physics coming up after this happend btw.\n\nOur professor disliked phones very much. Nothing weird about that.  I have been warned months prior to this by our professor because I was on my phone, no biggie. My mistake. It's impolite to be on your phone during a lesson which I understood. I actually find Physics interesting and I enjoyed most lessons and was eager to learn more. I almost always did my assignments and extra work. I wanted an A.\n\nDuring one of our final classes of the year, the entire class was just talking, the professor wasn't lecturing anything. They were setting dates for tests if anyone wanted to fix their grade. People who had their grade set were on their phone... nothing weird.\n\nExcept I was the only one called out. Out of everyone. To make things worse, the professor called out my style (she specifically mentioned my Dr Martens and Iron Maiden shirt I wore that day) and commented on my dyed ginger hair. She said very \"nicely\" she doesn't have anything against it, why bring it up then? Her comments made me feel awful. She continued to comment my attitude towards work, my personality and how I don't deserve an A. She did this for another 10 mins before finishing. I didn't want to continue it so I just apologised.\n\nShe gave me a B. :)\n\nTLDR : Professor didn't like me or my choice of clothing / style and gave me a lower grade.",
      "author": "hailhel",
      "created": 1568191121,
      "upvotes": 6,
      "replies": {
        "f043zpl": {
          "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/f043zpl/",
          "text": "When someone doesn’t like you, it’s super hard to convince them otherwise. Many years ago, I went on an Erasmus year abroad as part of my 1st year of uni (this was so that I could join the language degree, while having experienced the language abroad). When I returned in year 2, lesson 1 in German was to talk to your neighbour, gather some facts about them, and retell it to the class (in German) to introduce them. While gathering some info on my classmate, I noticed she had a ring and while talking, realised she was married (we were 19, 20, so still v young). So, in introducing her, I said ‘surprisingly, she is married’. The lecturer went off on one, saying how is that surprising, a lot of adults marry. So, I said yes, of course, it was just a bit more uncommon at our age... Found this super weird that she was so angry by me just telling something unremarkable about a classmate (something that was meant as a first day intro btw!!) Anyway, 2nd day, we were meant to summarise a text, and giving out the key points, the arguments for and against, etc... I tried my best when she asked me (me again!) to report to the class. As soon as I started, I knew this wasn’t going well. She wanted me to use a very specific technique she had always used (with bullet points, and other techniques one wouldn’t necessarily know unless you were taught by her specifically). At that point, she said, well, are you able or not to do this work? As she was aggressive, I thought wtf, I need to be assertive here... I said I am able, but not familiar with her specific technique, to which she then replied ‘well, if you had bothered turning up to ANY of my lessons in year 1, you would know!’ Ah, so that was it, she thought I had missed her classes on purpose! I tried to explain I was on an exchange year the year before and could therefore not have attended, and gained the required credits in another institution. She refused to understand and basically made my life hell for the rest if the year (failing me in that class so badly that I had to retake it twice). In the end, I never passed that module but could get my degree thanks to other classes (and even did a masters). She remains one of the most difficult and biased person I have come across and can’t understand to this day what her problem was with the Erasmus scheme. At the time, it was in its infancy, but still!!",
          "author": "balletowoman",
          "created": 1568379058,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ezva6em": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezva6em/",
      "text": "Reading up on the policy of a certain on campus club or two as an officer and using it to my advantage or to convince others to side with what I wanted to do.  Basically kept the person mad that they didn't get the position I had from holding up everything during meetings, and to get said club a small much needed piece of the diminishing funds through my position on the funding board when others where getting nothing or drastic cuts.",
      "author": "team_sita",
      "created": 1568171395,
      "upvotes": 3,
      "replies": {}
    },
    "ezw5943": {
      "link": "/r/AskAcademia/comments/d2hkeo/what_is_your_most_petty_academia_moment/ezw5943/",
      "text": "I was on the receiving end.    \n\n(background, my undergraduate university did numeric grades by tenths to a maximum of 4.0) In 2 years of a 4.0 GPA, I learned my lesson of why backups are important. My final paper (40% of the grade, the other 60% I had full credit in) file was corrupt and I was a couple of hours from the deadline. I sent screenshots to my professor and met with him pleading for a several hour extension for me to sort it out. Eventually, I had to go through notes and rewrite about half of it for submission the same day.     \n\nFor more background, this was a philosophy of neuroscience class, and he only liked teaching one side of the subject matter, unless presenting 1 other prominent paper which he laughed at for the entire class period. I was a challenger to this guy because I knew some of the other side of the literature. His goal in doing philosophy of neuroscience is to prove the existence of god, while mine (currently in grad school) is to know if philosophical conclusions can be drawn from neuroscience, and if philosophy can work towards grounding the subject matter of neuroscience.     \n\nThe professor marked the paper like 95%, but the final grade in the class was 3.4. After meeting with him, it was agreed that the penalty was arbitrary, but because it was a late paper (by about 6 hours), it was his prerogative to give that final grade. Later, I found out some of his minion students (those who were devoted to his teachings and never challenged his odd philosophical conclusions) submitted between 1-3 hours late and had no penalty.    \n\n(later, it became an open secret in the department that one of his minions was able to somehow pull off 4.0 grades in this professor's classes, but fail any other classes in the department).    \n\nAnother professor (never took classes with him, but knew him), in meetings with students would pull up students’ transcripts on his computer and tell them there was no chance for them to ever become doctor/lawyer/academic.",
      "author": "thoughtfulhooligan",
      "created": 1568208258,
      "upvotes": 2,
      "replies": {}
    }
  }
}