{
  "sid": "f4e2p7",
  "link": "/r/AskAcademia/comments/f4e2p7/update_fulbright_suddenly_curtailed_funding_for/",
  "title:": "Update: Fulbright suddenly curtailed funding for China grantees - we got paid!",
  "text": "Original post: [https://www.reddit.com/r/AskAcademia/comments/exqaad/us\\_fulbright\\_program\\_suddenly\\_cancelled\\_grad/](https://www.reddit.com/r/AskAcademia/comments/exqaad/us_fulbright_program_suddenly_cancelled_grad/)\n\nFulbright pulled its program and funding from China a couple of weeks ago, which left a lot of grad students in the lurch for funding. Because of pressure from grantees, our schools, and senators, Fulbright offered to pay us 5 months of stipend (through June) and is paying emergency funding for those of us who had to buy last minute flights out of China or who have incurred international moving expenses etc. This is a big improvement on their initial announcement, in which they told us they'd pay out 3 months of stipend, from which we should fund our own emergency travel costs and moving expenses.\n\nI just want to briefly outline we did so that if someone encounters a situation like this in the future, they can use this as a resource. Here's what worked:\n\n1. Organizing grantees in the same situation. After we found out about the curtailment, we created a number of chat groups to share information and collaborate, which was invaluable, and led to the following strategies...\n2. We put pressure on Fulbright directly. Many of us called and emailed their office after the announcement came out, which gave them a sense of the scope of problems grantees (esp grad students) were dealing with as a result of sudden withdrawal of support. We created a petition to Fulbright, outlining the losses we incurred as a result of the sudden curtailment of the program, and asking for relocation funding and payment of stipends (and the opportunity to relocate, which we didn't get). The funds, after all, were federally appropriated for us.\n3. We wrote to and called our Senators. Several responded and had meetings regarding the handling of this situation with the State Department.\n4. Individual grad students had good success sending information about what happened and losses incurred to their departments and (especially) deans. We were made aware of funds we didn't know existed, and in some lucky cases our schools reimbursed us for the entire amount lost from Fulbright. Some of our schools had representatives who put pressure on IIE/Fulbright on our behalf.\n5. Some of us were also able to negotiate extensions on grant deadlines - as far as I know these were just internal deadlines at our institutions but it was definitely worth asking so we didn't miss on the chance to apply for more funds on short notice.\n\nIn the end, we were able to negotiate for approximately $4k more than originally offered per person as well as additional emergency funds distributed on a case by case basis. We were not successful petitioning for the option to relocate to nearby countries like Taiwan, Japan, etc. Many in the original post told us to go to the media; we did not take that route this time.\n\nHopes this helps someone down the line. If you are a grad student, or advise grad students, please keep these tactics in mind in case something comes up with your colleagues/advisees in the future!",
  "author": "rugoutfromunderme",
  "created": 1581793980,
  "updated": 1634080800,
  "over_18": false,
  "upvotes": 174,
  "upvote_ratio": 0.98,
  "comments": {
    "fhq9ct5": {
      "link": "/r/AskAcademia/comments/f4e2p7/update_fulbright_suddenly_curtailed_funding_for/fhq9ct5/",
      "text": "I'm so glad this worked!! Good job! Helpful outline too!",
      "author": "BananasonThebrain",
      "created": 1581801044,
      "upvotes": 11,
      "replies": {}
    },
    "fhquz1o": {
      "link": "/r/AskAcademia/comments/f4e2p7/update_fulbright_suddenly_curtailed_funding_for/fhquz1o/",
      "text": "This should’ve been covered by news agencies",
      "author": "hyperblaster",
      "created": 1581811961,
      "upvotes": 7,
      "replies": {}
    },
    "fhsr27g": {
      "link": "/r/AskAcademia/comments/f4e2p7/update_fulbright_suddenly_curtailed_funding_for/fhsr27g/",
      "text": "Good luck! I did an IIE in China, so I know having this dream-year fall through is a big disappointment. If you are already in China, are there any special procedures for re-entry to the US?",
      "author": "WaylonWillie",
      "created": 1581864291,
      "upvotes": 2,
      "replies": {}
    },
    "flycdit": {
      "link": "/r/AskAcademia/comments/f4e2p7/update_fulbright_suddenly_curtailed_funding_for/flycdit/",
      "text": "Thank you so much for posting this! It is beyond helpful. I'm part of the Brazil research cohort and we're planning on implementing many if not all of these strategies",
      "author": "rakieee",
      "created": 1585599519,
      "upvotes": 1,
      "replies": {}
    }
  }
}