{
  "sid": "hjydce",
  "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/",
  "title:": "\"Nobody reads dissertations after the defense\" - is this still broadly true?",
  "text": "I remember hearing that dissertations are rarely read after the defense even before going to graduate school and, baring some field specific exceptions (e.g., mathematics), continued to hear the same thing. However, since finishing my dissertation I've noticed that the metrics from the library and sites like Research Gate seem to demonstrate the opposite - people are reading the dissertation as well as others that I know. Hundreds to thousands of views and downloads doesn't seem to be that uncommon.\n\nIs it time to retire the presumption that nobody will read the dissertation after the defense, or is something else going on that's tricking the stats? Off hand I would presume that digital archiving has actually make it easier to retrieve a dissertation  so we might be in an era were people actually read the things.",
  "author": "ManInBlackHat",
  "created": 1593701325,
  "updated": 1634081143,
  "over_18": false,
  "upvotes": 167,
  "upvote_ratio": 0.98,
  "comments": {
    "fwpa9iy": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwpa9iy/",
      "text": "Many times the thesis isn't a public document and the papers that consist of the chapters have already been published and are known to be vetted through peer review. This is why the thesis itself isn't read. If you change these dynamics, like by having your thesis available for download on research gate and you're in a field where the thesis isn't basically a collection of your papers,  then it's more likely to be read\n\nEdit: spelling",
      "author": "purdueGRADlife",
      "created": 1593701521,
      "upvotes": 113,
      "replies": {
        "fwq0u8z": {
          "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwq0u8z/",
          "text": "Often (at least in my field) it's common to publish one's dissertation as a book after completing the PhD. You have a chance to showcase the work with an extra round of edits.",
          "author": "stakekake",
          "created": 1593713662,
          "upvotes": 43,
          "replies": {
            "fwql6v1": {
              "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwql6v1/",
              "text": "Are you in the humanities? I ask because my understanding is this is no longer the case. I have been told by editors that they want a book that is at least 60% new material, especially now that dissertations are published on open-access databases.",
              "author": "hillsonn",
              "created": 1593723410,
              "upvotes": 24,
              "replies": {
                "fwqltfq": {
                  "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqltfq/",
                  "text": "Not the person you were talking to, but in the humanities, I have been told multiple times to just not tell publishers that what you are submitting is a dissertation. I haven't heard anything in terms of percentages, but I would guess the framing of the introduction might shift, content wise.",
                  "author": "Dragon9770",
                  "created": 1593723713,
                  "upvotes": 20,
                  "replies": {
                    "fwqmzt2": {
                      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqmzt2/",
                      "text": "Yea, that was something I heard as well. I was a conference last summer and the submissions editor for a major university press led a workshop on turning your dissertation into a monograph. That is where I got the 60% number. There was a lot of other practical advise, but the other major thing she emphasized repeatedly was to remember that your dissertation was written for 3 people, your monograph needs to widen its audience and you have to sell publishers that you can do that.",
                      "author": "hillsonn",
                      "created": 1593724287,
                      "upvotes": 19,
                      "replies": {}
                    },
                    "fwqvmt8": {
                      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqvmt8/",
                      "text": "My partner is doing exactly this. It's the book that grew out of the dissertation. Roughly double again the work that went into the dissertation in the first place.\n\nIt's more work than she was expecting, but it's looking like it's going to be a pretty bomb book, so we got that goin for us...",
                      "author": "lucianbelew",
                      "created": 1593728661,
                      "upvotes": 11,
                      "replies": {}
                    },
                    "fwr42dz": {
                      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwr42dz/",
                      "text": ">I haven't heard anything in terms of percentages, but I would guess the framing of the introduction might shift, content wise.\n\nOften you have to scrap the intro entirely. I review humanities book proposals for academic publishers sometimes and many of them are obviously dissertations because the intro is a huge lit review/theory piece intended for their committee. Not the sort of thing a general reader ever wants to read. Smart authors will revise/eliminate those before sending in a mss for review. But if you have a good committee that is open to you writing a *book*, rather than a formulaic dissertation, there may be much less revision to do.",
                      "author": "SnowblindAlbino",
                      "created": 1593733315,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                },
                "fwr3udc": {
                  "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwr3udc/",
                  "text": ">Are you in the humanities? I ask because my understanding is this is no longer the case. I have been told by editors that they want a book that is at least 60% new material, especially now that dissertations are published on open-access databases\n\nI'm a humanities scholar and my diss was published as a book. It was attractive enough that I had several editors interested based on conference papers, and had an oral agreement with an acquisitions editor to give her press the first chance to review once it was done. None of those presses-- all university presses in the US --were at all concerned about the origins of the book as a dissertation, in part because it was *conceived* as one from the start. Ultimately I probably retained about 2/3 of the original mss verbatim for the book, and most of what changed were additions written in response to the blind reviews and the additional time I had to access archives once I had a real job.\n\nGenerally speaking what I've often heard from editors is that they really don't want to see more than one chapter in a book published as a stand-alone article these days, so that 60% figure is quite low based on my experience. Over time I've personally just looked at projects as either books or articles; if there's enough for a book then I won't publish *any* of it elsewhere. But I have the luxury of being a tenured full professor so I can work on something for several years without suffering any consequences of not turning out smaller pieces all the time.",
                  "author": "SnowblindAlbino",
                  "created": 1593733185,
                  "upvotes": 5,
                  "replies": {
                    "fwref5i": {
                      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwref5i/",
                      "text": "And how recent was your diss->book publication?",
                      "author": "herennius",
                      "created": 1593739541,
                      "upvotes": 4,
                      "replies": {
                        "fwsb27d": {
                          "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwsb27d/",
                          "text": "This was my question - I got the impression from this editor that things have changed significantly in the past decade or so. One of the biggest issues being that dissertations are now almost immediately put onto university open-access databases, so publishers argue what is the point of putting something out that people can read for free. \n\nAlso, I am curious who writes a dissertation in the humanities without looking at it as eventually being a monograph....",
                          "author": "hillsonn",
                          "created": 1593763419,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fwuec02": {
                  "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwuec02/",
                  "text": "No, I'm in natural science. But I have yet to finish my dissertation, let alone a book, so take what I said with a grain of salt  :) . You may well be right that it's less common now, but it certainly still happens in some cases without much new content. Maybe it depends on the publisher.",
                  "author": "stakekake",
                  "created": 1593811924,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fwpjdqj": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwpjdqj/",
      "text": "Given the state of what I submitted, I sincerely hope so!",
      "author": "Ut_Prosim",
      "created": 1593705463,
      "upvotes": 64,
      "replies": {
        "fwqd10c": {
          "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqd10c/",
          "text": "That just begs the question - what did you submit?",
          "author": "ManInBlackHat",
          "created": 1593719464,
          "upvotes": 8,
          "replies": {
            "fwqdve7": {
              "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqdve7/",
              "text": "Some Star Trek fan fiction, a few screenshots of my snarkiest reddit posts, and a recipe for bean dip. /s\n\nIn truth it was not my best work, and could have been so much better with more time, but I figure that's what almost everyone says.\n\nMy adviser and 36 other faculty (entire institure) left for a different university with a few months notice. I had to finish and graduate by the time they left, or try to find a new adviser, and new funding source, and maybe new project. It is an excellent source of motivation... not fun though.",
              "author": "Ut_Prosim",
              "created": 1593719872,
              "upvotes": 52,
              "replies": {
                "fwsv1ak": {
                  "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwsv1ak/",
                  "text": "> /s\n\nDamn. I was so ready for peer reviewed Star Trek fan fiction :(",
                  "author": "TheVoidSeeker",
                  "created": 1593781495,
                  "upvotes": 3,
                  "replies": {}
                },
                "fwtooqd": {
                  "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwtooqd/",
                  "text": "Hey, a good dissertation is a done dissertation. I don't think too many people are super happy with theirs, but the important thing is that it got finished.",
                  "author": "s0upcan",
                  "created": 1593797990,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "fwqe4vd": {
              "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqe4vd/",
              "text": "[deleted]",
              "author": null,
              "created": 1593719999,
              "upvotes": 32,
              "replies": {
                "fwqemhw": {
                  "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqemhw/",
                  "text": "I mean, most of the ones at my school were fueled by coffee and alcohol.",
                  "author": "ManInBlackHat",
                  "created": 1593720226,
                  "upvotes": 16,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fwpa3iu": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwpa3iu/",
      "text": "In my field (linguistics) dissertations are widely read. They're extremely important and one of the main drivers of new, innovative research. I'm guessing it depends on the field.",
      "author": null,
      "created": 1593701448,
      "upvotes": 41,
      "replies": {
        "fwpoxet": {
          "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwpoxet/",
          "text": "Yup. I'm in Applied Linguistics and I often read dissertations to see what new research people are working on.",
          "author": "Calamint",
          "created": 1593708020,
          "upvotes": 20,
          "replies": {}
        },
        "fwrd28g": {
          "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwrd28g/",
          "text": "I third that",
          "author": "SkepticalCriticsNoun",
          "created": 1593738698,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fwpwath": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwpwath/",
      "text": "It's pretty rare to read them in my field, though I did recently get an alert that someone cited my 8 year old dissertation.",
      "author": "Mizzy3030",
      "created": 1593711515,
      "upvotes": 21,
      "replies": {}
    },
    "fwpjgef": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwpjgef/",
      "text": "It definitely depends on the field, but also what someone does with the thesis afterwards. \n\nIn my field, it's extremely common to workshop the thesis into a monograph or to rework them into different articles. Once they've been republished they're often better quality work, having had some more dedicated time and having undergone peer-review and are often more easily accessible, which leads to them being read more frequently.",
      "author": "PurrPrinThom",
      "created": 1593705495,
      "upvotes": 16,
      "replies": {}
    },
    "fwq2vl9": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwq2vl9/",
      "text": "I use ProQuest all the time to look up dissertations in my field! When I have to write a lit review I start there since I know they’re all going to have ones that I can grow from. There’s also the chance to catch more recent research that hasn’t been published yet",
      "author": "velmaed",
      "created": 1593714624,
      "upvotes": 15,
      "replies": {}
    },
    "fwq3311": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwq3311/",
      "text": "I actually have read quite a few dissertations. My field is theory heavy and when I want to read up on a new concept/theory, i usually find a dissertation using it and read through it. I find it super helpful as they have to explain it, provide an overview of the literature and then see how they interpret results with it.\n\nThe only downside is, since they're not peer-reviewed (which is debatable because what is the point of the PhD committee then?), they're not always seen a s valid reference. But for my own learning, they're super helpful.",
      "author": "frankie_prince164",
      "created": 1593714721,
      "upvotes": 11,
      "replies": {
        "fwqc6xn": {
          "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqc6xn/",
          "text": ">The only downside is, since they're not peer-reviewed (which is debatable because what is the point of the PhD committee then?), they're not always seen a s valid reference. \n\nAgreed. The committee might be biased peer reviewers but they are signing off on peer review when they award the degree. Nobody in my field really seems against citing a dissertation, although usually you check to see if there is a manuscript out first.",
          "author": "ManInBlackHat",
          "created": 1593719065,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fwq5fr0": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwq5fr0/",
      "text": "I graduated in 2013. I have averaged 2 reads a year. I get notified why someone downloads it. I have seen my dissertation be cited 5 times, in 3 dissertations and 2 low level publications. Might as well be no one reading it. Barely a blip on the radar.",
      "author": "tactful-dan",
      "created": 1593715817,
      "upvotes": 9,
      "replies": {
        "fwqcvvj": {
          "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqcvvj/",
          "text": "I don't  have any citations - dissertation by publication and most is published now - but it seems like there are about two hundred downloads in the past year. Knowing how academia works, I hope that means in another year or two the citations wills tart appearing on the manuscripts.",
          "author": "ManInBlackHat",
          "created": 1593719398,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fwpgkd0": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwpgkd0/",
      "text": "My research area is fairly fast-paced and quickly-changing so dissertations tend to be some of the most current research on it. So I do read a lot of dissertations and have cited quite a few in my work but I don't know that that's the norm.",
      "author": "littleirishpixie",
      "created": 1593704260,
      "upvotes": 7,
      "replies": {}
    },
    "fwqxy9c": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqxy9c/",
      "text": "Im an archaeologist and in one independent study course I’ve read a running total of 11 dissertations and currently working through the next. I think it depends on the context and nature of your work.",
      "author": "33183172460",
      "created": 1593729899,
      "upvotes": 7,
      "replies": {}
    },
    "fwpvbra": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwpvbra/",
      "text": "I have only read 70% of 1 dissertation and 50% of another in my time as a phd student.  \n\n&#x200B;\n\nReading sections might not be that uncommon if it's on google scholar.  An entire dissertation I think would be.  Just because people have limited time and lots of papers to read  and it is unlikely an entire dissertation is relevant to their research.",
      "author": "RaddishEater666",
      "created": 1593711066,
      "upvotes": 5,
      "replies": {}
    },
    "fwpjkmp": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwpjkmp/",
      "text": "I have not published my dissertation as a book--my research has moved mostly in different directions since I defended, and while I'm still working on some of the artists who I wrote about in it, my approach has changed. Anyway, I've had 4-5 direct requests for a copy in the four years since I've defended, which isn't a ton but also isn't nothing.\n\nIf a scholar hasn't (yet) published their dissertation as a book but it still makes a useful or interesting contribution to the field I will absolutely cite it in my own work. This is especially prevalent with relatively minor artists, for whom there is not a lot of published material.",
      "author": "pipkin42",
      "created": 1593705545,
      "upvotes": 4,
      "replies": {}
    },
    "fwpr7ag": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwpr7ag/",
      "text": "When I became ABD I skimmed dissertations not so much for the content, but to get an idea of structure and style. My (humanities) program didn't have a proseminar, dissertation workshop, or anything like that. Nobody explained how to write a dissertation, so I searched for models to work off of. I didn't necessarily pick at random, I read the dissertations of recent grads from my program had reputations of being rising stars.",
      "author": null,
      "created": 1593709107,
      "upvotes": 4,
      "replies": {}
    },
    "fwqu9ky": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqu9ky/",
      "text": "I'd much rather cite a peer reviewed paper or published monograph than a dissertation.",
      "author": "ph0rk",
      "created": 1593727943,
      "upvotes": 4,
      "replies": {
        "fwr1n99": {
          "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwr1n99/",
          "text": "That's citation though, which is likely a separate discussion from actually reading something. I had a situation that others have noted where we cited the manuscript, but referred to the dissertation regularly for the methods and source code.",
          "author": "ManInBlackHat",
          "created": 1593731938,
          "upvotes": 0,
          "replies": {
            "fwrjcx3": {
              "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwrjcx3/",
              "text": "I don't read a lot of academic work that isn't citable anymore, though. So, if I'm not likely to cite it, I'm not likely to read it.\n\nIf it isn't likely to be useful, I'd rather read for pleasure (which is either massively outside my field, or fiction).\n\nPeople tend to publish papers before defending their dissertation in my field, though.",
              "author": "ph0rk",
              "created": 1593742616,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fwq18nd": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwq18nd/",
      "text": "In particle physics, if you're working as part of a collaboration, new comers to the collaboration/research area may very well read other people's theses to get a good grounding in the area. Students writing up themselves will likely read your intro/theory sections to get an idea of what they should be including in theirs*. And as research topics often get passed onto new students (to update or improve upon with new data, or adapt to related research questions) researchers will likely read the thesis of the students who worked on it before them.\n\n\n\\* On this note, my thesis got downloaded frequently in three countries/locations in 1-3 month time periods, which I know correlated to three students writing their own theses (one even told me they were following the structure of my introduction for their own.)",
      "author": "foibleShmoible",
      "created": 1593713853,
      "upvotes": 3,
      "replies": {
        "fwqe39r": {
          "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqe39r/",
          "text": "This is what happened with me. Friends who graduated after me downloaded it to use as a template for their own. They said it helped. I certainly used a few like that myself. Other than that, I don’t expect anyone will read it.",
          "author": "hernwoodlake",
          "created": 1593719976,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fwq45b8": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwq45b8/",
      "text": "I'm in archaeology and we read each other's dissertations quite often. Even if individual chapters are published in peer review journals the actual dissertation is usually the only place where *all* the data are included and that's usually what we need for comparative studies (a big part of archaeological analysis and interpretation).",
      "author": "archyslayer",
      "created": 1593715217,
      "upvotes": 3,
      "replies": {}
    },
    "fwqma0j": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqma0j/",
      "text": "One of the fields of study I am in (dendrochronology) one of the most cited works is a dissertation (>2000 citations). [Cook, E. R. (1985)](https://www.st-andrews.ac.uk/~rjsw/PalaeoPDFs/Cook1985-Chapter%202.pdf)",
      "author": "the_Q_spice",
      "created": 1593723938,
      "upvotes": 3,
      "replies": {}
    },
    "fwqs89d": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqs89d/",
      "text": "I read dissertations all the time. I believe they contain much more information compared to published papers. There are many times I would look up a guy's dissertation to find the way he did things because most papers skip the nitty-gritty details.",
      "author": "SymmetricChaos233",
      "created": 1593726892,
      "upvotes": 3,
      "replies": {}
    },
    "fwq7h0v": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwq7h0v/",
      "text": "Some systematic reviews check ProQuest as one of the databases used to source papers on a topic. If your university deposits the dissertation here, it may be picked up by someone later on doing a systematic review that allows grey literature to be used.",
      "author": "4countryguy",
      "created": 1593716784,
      "upvotes": 2,
      "replies": {}
    },
    "fwqauet": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqauet/",
      "text": "I have at least three theses and dissertations I’m drawing from for my own dissertation lit review...",
      "author": "mixedgirlblues",
      "created": 1593718423,
      "upvotes": 2,
      "replies": {}
    },
    "fwqbeq7": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqbeq7/",
      "text": "I’m assuming things are field-dependent, but in bio-optics we read/reference dissertations every week",
      "author": "quohr",
      "created": 1593718698,
      "upvotes": 2,
      "replies": {}
    },
    "fwqcd28": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqcd28/",
      "text": "I would not recommend assuming this will be true. I was told this, and it was really wrong. I think with more and more stuff being online, dissertations have become easier to find and read.",
      "author": "MillennialScientist",
      "created": 1593719148,
      "upvotes": 2,
      "replies": {}
    },
    "fwqf1xs": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqf1xs/",
      "text": "I've worked in 3 fields: Physics (academic), Engineering (industry), and Computer Science (academic and industry). I've definitely read several dissertations in each of those fields. If you made contributions to work that is relevant to others, you bet that others are going to read it. Generally though there's a high bar to read a dissertation. If I find yours I'm usually going to go read other papers by you first. And I'm not going to read the entire thing, only the parts I need (hey, sometimes those background sections are really helpful!).",
      "author": "godelski",
      "created": 1593720427,
      "upvotes": 2,
      "replies": {}
    },
    "fwqfjd5": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqfjd5/",
      "text": "I've cited plenty of dissertations in my schoolwork (humanities - religion). They have solid scholarship, and they're easier to hunt through than a book. I wish more of them were available digitally through the schools they were written for.",
      "author": null,
      "created": 1593720658,
      "upvotes": 2,
      "replies": {}
    },
    "fwqjrs8": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqjrs8/",
      "text": "I don't use them while writing articles, generally, but I do leisurely read them in my off time (hah, wait, what's that?) if I've found something that piques my interest outside my field. I find that it's a good way to introduce myself to something I \\*think\\* I want to delve into more deeply without going the route of my own deep research.",
      "author": "biglybiglytremendous",
      "created": 1593722722,
      "upvotes": 2,
      "replies": {}
    },
    "fwqlb2l": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqlb2l/",
      "text": "I hoped not but alas yes, people did/do read it. If it’s novel enough and time/place makes it relevant, yes they will read it. I say I hoped not because I later found a hilarious typo repeated a few times via auto correct.",
      "author": "justus_trail",
      "created": 1593723467,
      "upvotes": 2,
      "replies": {}
    },
    "fwqmyux": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqmyux/",
      "text": "I actually make it a practise to read the dissertation of an author, who's published PhD work I'm following or base my research upon. Often, there are some additional information and figures that are in the dissertation, that is omitted/simplified to make the peer-reviewed article, as concise as possible. Futhermore, for some who is new to the field, reading the introduction/literature review section of the dissertation could be an amazing opportunity to understand the motivation behind the research and the current state of the art.",
      "author": "dpkprm",
      "created": 1593724274,
      "upvotes": 2,
      "replies": {}
    },
    "fwqonbf": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqonbf/",
      "text": "From what I’ve gathered, a thesis is a vary large piece of work - while much of what is explored, tends to supplement known theories.  However, with many non-stem subjects; which tend to require  a vast literature review. Delving into a thesis with up to date reference, may help one attain summarised information within their required field. Which saves heaps of time, when trying to find those key pieces; plus, due to the rapid nature of academic publishing, books appear to become outdated quickly.",
      "author": "Dudelove994",
      "created": 1593725098,
      "upvotes": 2,
      "replies": {}
    },
    "fwqsekm": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqsekm/",
      "text": "From my own experience in cell biology I’ve sought out theses when I’ve wanted more detail in the methods described in a paper from the same author. Generally look to actual papers for actual results and conclusions though",
      "author": "Pineapleman2",
      "created": 1593726982,
      "upvotes": 2,
      "replies": {}
    },
    "fwqsgrj": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqsgrj/",
      "text": "Design-led Architecture/landscape architecture PhDs are well read, especially by master level students",
      "author": "fatesjester",
      "created": 1593727013,
      "upvotes": 2,
      "replies": {}
    },
    "fwqw583": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqw583/",
      "text": "It depends on the field and circumstances.  I just posted this in another thread -- my thesis has very little information that wasn't contained in a previously published paper, aside from the introduction.  I think it's been viewed thousands of times now, and someone has apparently even cited it; but they could have just as easily (IMO) looked at the individual papers that I wrote.  Maybe it's easier to have all of that information in one place or to have as a reference.  I don't put any great importance on it aside from tradition.",
      "author": "dampew",
      "created": 1593728927,
      "upvotes": 2,
      "replies": {}
    },
    "fwr37p3": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwr37p3/",
      "text": "It depends greatly on the field, topic, and quality. I got annual checks from UMI for copies of mine that sold for some years after it was defended, and then I revised it into a book that still generates some sales. But I'm a historian and I framed my dissertation to be a book from the outset.\n\nI personally still read a lot of dissertations too. Several journals I subscribe to still publish regular lists of new dissertations in my subfields, and I probably order 4-5 of them a year from  ILL so I can read them. It's a good way to keep current with younger scholars and new approaches IMO.",
      "author": "SnowblindAlbino",
      "created": 1593732823,
      "upvotes": 2,
      "replies": {}
    },
    "fwr5avp": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwr5avp/",
      "text": "i have read a few outside of mine and those belonging to my students",
      "author": "FoCoCS",
      "created": 1593734036,
      "upvotes": 2,
      "replies": {}
    },
    "fwr9hgf": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwr9hgf/",
      "text": "I have read someone's thesis, which was recently published, over 10 times now and have shared it with countless people. So people do read thesis.",
      "author": "mlbatman",
      "created": 1593736515,
      "upvotes": 2,
      "replies": {}
    },
    "fwrcxl9": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwrcxl9/",
      "text": "I've read A LOT of dissertations of my field. And when I say a lot it's really A LOT. My field it's Applied Linguistics btw.",
      "author": "SkepticalCriticsNoun",
      "created": 1593738617,
      "upvotes": 2,
      "replies": {}
    },
    "fwrdmma": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwrdmma/",
      "text": "In mathematics dissertations are almost always \"a few papers stapled together\" as my advisor used to call it. That said, I still find myself reading dissertations fairly often.\n\nThis is especially the case if I am interested in something outside my field so the published paper might contain lots of \"trivial\" statements or theorems that I don't understand at all. If I can't penetrate the paper I'll often figure out whose dissertation it was part of and read the dissertation instead which regularly has additional pages of introductory material as well as proofs of \"trivial\" things which are omitted in the manuscripts. Its like the training wheels version of the paper which is very nice when its an area I haven't studied extensively.",
      "author": "mathisfakenews",
      "created": 1593739054,
      "upvotes": 2,
      "replies": {}
    },
    "fwrg0k7": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwrg0k7/",
      "text": "Really depends on the field, university, and department. Our university require all thesis to be published online and searchable. This prompted me to check my thesis status, not bad I have to say.\nThroughout my PhD I have read other people's PhD and Masters thesis as well, and it's mainly for their detail description of methods they used, which can be extremely helpful since journal articles usually simplify a lot of the material and methods, whereas thesis is much more detailed.\n\nhttps://imgur.com/a/tlZfgc4",
      "author": "Neerolyte87",
      "created": 1593740536,
      "upvotes": 2,
      "replies": {}
    },
    "fwro7dq": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwro7dq/",
      "text": "Since I worked in a young PI's lab, I frequently looked through his dissertation because he was applying a lot of the same principles from his PhD research in his own lab (and through extension, my work). I read that book (which was a solid two inches thick) cover to cover.",
      "author": "trashman253",
      "created": 1593745639,
      "upvotes": 2,
      "replies": {}
    },
    "fwrstsy": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwrstsy/",
      "text": "If people are reading dissertations, yes it is time to retire the notion that nobody reads dissertations, ignoring the fact that some of the people posting here do not",
      "author": "mpbarry46",
      "created": 1593748678,
      "upvotes": 2,
      "replies": {}
    },
    "fwsdtzq": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwsdtzq/",
      "text": "\nI will sometimes get someone with a PhD whose work product is not reflective of their degree.\n\nWhen that occurs, I’ll pull their dissertation and review it.  More often than not (in those cases) I find a sixth grade book report or steroids, at which point I make a mental note that this person’s doctorate means nothing.",
      "author": "Deradius",
      "created": 1593766156,
      "upvotes": 2,
      "replies": {}
    },
    "fwptgmo": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwptgmo/",
      "text": "I'm in applied math. It is probably true that nobody reads them. My master's thesis is getting alot of reads on Research Gate, but as far as I can tell it is most likely just some kind of bots. You can't really trust read metrics, you need to look at citations instead.",
      "author": "perhapsaturningpoint",
      "created": 1593710179,
      "upvotes": 3,
      "replies": {}
    },
    "fwpmwcn": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwpmwcn/",
      "text": "Damn, tell me what you did lol",
      "author": null,
      "created": 1593707043,
      "upvotes": 1,
      "replies": {
        "fwpo6ro": {
          "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwpo6ro/",
          "text": "I went to an R2 engineering school which might bias things a bit. Presuming that the metrics are accurate the most read document is an MS thesis on rock core densities. \n\nMy own work was focused on the modeling of complex systems, but most of it has been published as manuscripts at this point.",
          "author": "ManInBlackHat",
          "created": 1593707661,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fwqcero": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqcero/",
      "text": "My advisor was suggested to clip a ten-dollar bill to his dissertation, not as a way to check if someone read it, but rather, he would have money for lunch next time he visits lol.",
      "author": "TheDevilsYouDont",
      "created": 1593719170,
      "upvotes": 1,
      "replies": {}
    },
    "fwqn1wb": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwqn1wb/",
      "text": "I placed a $20 bill in the official version of my dissertation in the school’s library (it was all I could afford when I graduated) and then went back 12 years later and found it still there. \n\nEdit: I left it. Might go back in another 24...",
      "author": "Frogmarsh",
      "created": 1593724315,
      "upvotes": 1,
      "replies": {}
    },
    "fwr6b5r": {
      "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwr6b5r/",
      "text": "How many dissertations have you read?",
      "author": "TheWhenWheres",
      "created": 1593734624,
      "upvotes": 0,
      "replies": {
        "fwrfcf5": {
          "link": "/r/AskAcademia/comments/hjydce/nobody_reads_dissertations_after_the_defense_is/fwrfcf5/",
          "text": "Personally? Somewhere between 10 and 20, cited 1 or 2 when other publications weren't available as well. There's a lot of data that gets shoved in the appendix of a dissertation that never really gets published.",
          "author": "ManInBlackHat",
          "created": 1593740118,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}