{
  "sid": "pxsbow",
  "link": "/r/AskAcademia/comments/pxsbow/people_who_taughtcurrently_teaching_english/",
  "title:": "People who taught/currently teaching English Literature at universities, how has the experience been?",
  "text": "I've been fascinated with the way literature operates but not so sure about the lecturing part, would be great to learn some new perspectives and experiences. Thanks.",
  "author": "learner26_",
  "created": 1632910306,
  "updated": 1634078813,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "heq82gb": {
      "link": "/r/AskAcademia/comments/pxsbow/people_who_taughtcurrently_teaching_english/heq82gb/",
      "text": "It has been great? Could you be more specific about which aspects you're curious about?",
      "author": "profdeadringers",
      "created": 1632926806,
      "upvotes": 3,
      "replies": {
        "heqoq26": {
          "link": "/r/AskAcademia/comments/pxsbow/people_who_taughtcurrently_teaching_english/heqoq26/",
          "text": "How much do you find teaching and interacting with students enjoyable? (If you were to put it in comparison to reading and researching you did as a student)",
          "author": "learner26_",
          "created": 1632933539,
          "upvotes": 1,
          "replies": {
            "herkv7r": {
              "link": "/r/AskAcademia/comments/pxsbow/people_who_taughtcurrently_teaching_english/herkv7r/",
              "text": "I find teaching and interacting with students immensely enjoyable. I will say, however, that the returns on that diminish each year I teach, but that's probably true of a lot of jobs. Regarding comparing the classroom with my own reading and research ... They're inseparable! I love both reading, research, and writing, and I have to do all three in order to teach well. So the reading/research never ends and directly benefits the classroom. I'm teaching a class on Hawthorne and Poe this semester, for example, and have learned more about the two authors reading and researching for the class than I ever would have on my own. Just imagine reading and researching so much that you feel confident enough to put those thoughts into the minds of a couple of dozen suckers ... It's like having a book club that people *have* to attend.",
              "author": "profdeadringers",
              "created": 1632946635,
              "upvotes": 3,
              "replies": {
                "hesubxm": {
                  "link": "/r/AskAcademia/comments/pxsbow/people_who_taughtcurrently_teaching_english/hesubxm/",
                  "text": "Thanks for the thoughtful response!",
                  "author": "learner26_",
                  "created": 1632967257,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "heqycq1": {
      "link": "/r/AskAcademia/comments/pxsbow/people_who_taughtcurrently_teaching_english/heqycq1/",
      "text": "I teach literature, and it’s great. But I love teaching and went for my PhD to become a professor. I’m not sure what you’re asking, but if you’re a grad student, try to get as much teaching experience as you can early. Teaching isn’t for everyone; I’ve known several brilliant scholars who quit their PhDs because they didn’t want to teach. With a PhD in English, there are research focused jobs, but I think the majority work in teaching focused positions.",
      "author": "pugbug2016",
      "created": 1632937413,
      "upvotes": 3,
      "replies": {
        "her3l4d": {
          "link": "/r/AskAcademia/comments/pxsbow/people_who_taughtcurrently_teaching_english/her3l4d/",
          "text": "Thanks for the insight!",
          "author": "learner26_",
          "created": 1632939572,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}