{
  "sid": "p2yx33",
  "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/",
  "title:": "Getting out of a book series",
  "text": "Throwaway for obvious reasons.\n\nI have book contract signed with a big academic publisher as part of a long-running series. Finishing the manuscript, it's becoming clear that the book will appeal to a larger audience than just this field. The series is only tangentially related to the book topic. It would get more readers as a stand-alone.\n\nObviously I should have thought through this before applying to the series or signing the contract. Now that it's all said and done, could I ask (tactfully) about publishing as a stand-alone within the same publishing house but not as part of the series? Or just be grateful I have a good book contract and move on? Not sure how all this works.\n\nThanks.",
  "author": "InevitablePresence54",
  "created": 1628771666,
  "updated": 1634079742,
  "over_18": false,
  "upvotes": 38,
  "upvote_ratio": 0.93,
  "comments": {
    "h8nlb16": {
      "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8nlb16/",
      "text": "You can for sure ask the publisher. Why not? What's the worst they'll do — cancel the contract that it sounds like you're ambivalent about anyway? (Why would they even do that — how would it be in their interest?) This is YOUR book, FEEL FREE to be assertive about it. Especially when it comes to marketing and series and things like that.\n\nLook, if the publisher thinks they're going to make MORE money off of your book by doing it differently, that's a GOOD THING from their perspective. You are HELPING THEM.",
      "author": "restricteddata",
      "created": 1628776591,
      "upvotes": 19,
      "replies": {
        "h8nydp2": {
          "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8nydp2/",
          "text": "Thanks. I've been far too hesitant about this whole thing. I guess I was worried they would be insulted. But you're right, what do I have to lose?",
          "author": "InevitablePresence54",
          "created": 1628782198,
          "upvotes": 10,
          "replies": {
            "h8nz729": {
              "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8nz729/",
              "text": "Well they can try and hold you to the contract and sue you if you don't do it. However, that doesn't mean you shouldn't talk to them, especially if you're in a position to offer them something quite attractive - ie a book with mass appeal. \n\nThey won't be insulted but they are a company - that means they'll be quite level headed about it (hopefully) and you should go in the same. It's a business discussion. They'll listen to you and say yes or no. Ultimately though you signed a contract and you will need to deliver up the goods if they say no.",
              "author": "ACatGod",
              "created": 1628782538,
              "upvotes": 6,
              "replies": {
                "h8o67da": {
                  "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8o67da/",
                  "text": "They're not going to sue you for asking about changing your contract. There's no harm in inquiring. (Contracts are changed all the time, for lots of reasons.)\n\nThe contract itself will describe how to go about breaking it, if it comes to that. Contracts are also broken all the time, in the real world.",
                  "author": "restricteddata",
                  "created": 1628785404,
                  "upvotes": 3,
                  "replies": {
                    "h8o6w53": {
                      "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8o6w53/",
                      "text": "I never said they would. And the rest of my reply was all about encouraging OP to talk to them. But please feel free to continue explaining what I already said to everyone.",
                      "author": "ACatGod",
                      "created": 1628785678,
                      "upvotes": 3,
                      "replies": {
                        "h8p8n9k": {
                          "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8p8n9k/",
                          "text": "You're the one who brought up the threat of lawsuit... that's not what's on the table here. And you also implied that contracts are forever binding, and they are definitely not. So.. yeah. That's why I felt the need to clarify. Nothing personal meant by it. I think you gave OP an overly pessimistic and alarmist view of the possibilities.",
                          "author": "restricteddata",
                          "created": 1628801199,
                          "upvotes": 0,
                          "replies": {
                            "h8r59k6": {
                              "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8r59k6/",
                              "text": "They can sue, if they say no change and OP doesn't produce - this is correct. I did not say they'll sue just because he talks to them.about the contract which is what you said I said. And I didn't imply contracts are forever binding, I quite clearly and explicitly pointed out they may well agree to a change in the contract. I also pointed out that they are entitled to enforce the contract and yes it is binding if they don't agree to changing it. What's the point of a contract if one partner gets to just decide to no longer fulfil their side of it with no consequence?",
                              "author": "ACatGod",
                              "created": 1628835274,
                              "upvotes": 0,
                              "replies": {
                                "h8sme9t": {
                                  "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8sme9t/",
                                  "text": "> They can sue, if they say no change and OP doesn't produce - this is correct.\n\nThis isn't what OP had proposed, at all. Hence \"not what's on the table here.\" You might as well explain their legal options if OP decides to murder them all. \n\n> What's the point of a contract if one partner gets to just decide to no longer fulfil their side of it with no consequence?\n\nAs I said, contracts frequently have explanations in them as to how to break them. If you do not know this, you probably haven't signed that many contracts — or read them carefully. Most contracts are not meant to be binding until death. \n\nAll of this is overly alarmist for what OP is asking about. Hence my attempt to correct it. Nothing personal.",
                                  "author": "restricteddata",
                                  "created": 1628869615,
                                  "upvotes": 0,
                                  "replies": {
                                    "h8u84n7": {
                                      "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8u84n7/",
                                      "text": "You're all over the place and sadly for you I'm one of our institutional signatories and I sign a lot of contracts, mostly for things massively above your associate professor pay grade. But please do keep wilfully misinterpreting what I said, it's almost entertaining.",
                                      "author": "ACatGod",
                                      "created": 1628892645,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h8nepvs": {
      "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8nepvs/",
      "text": "I own many excellent, standout references that were part of series. These texts have endured while the rest of their companion texts are not. I do not think the other texts detracted from their value though. Maybe this is a field, specific thing I'm not appreciating, but what do you lose by having your  text published as a member of a series of texts?",
      "author": "T_0_C",
      "created": 1628773435,
      "upvotes": 42,
      "replies": {
        "h8np87z": {
          "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8np87z/",
          "text": "I'm not at all worried about the prestige of the series - it's an excellent series and it would be an honor to be a part of it.\n\nThe issue is that the series subject is only tangentially related to my book. My topic is quite political. The series subject will make some misunderstand the thrust and thesis of the book, thus losing potential readers. \n\nFinally, the books in the series are priced out of range of lay readers and a lot of the non-UK/US libraries I'd be targeting. If it's successful they will release a cheaper paperback, but even those are quite expensive.",
          "author": "InevitablePresence54",
          "created": 1628778331,
          "upvotes": 5,
          "replies": {
            "h8nymkt": {
              "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8nymkt/",
              "text": "I really don't see how the series matters. The \"lay readers\" you seem to want to target probably won't even care what series it's a part of.\n\nThe reasons you're giving seem to be ideas about how the book can sell better. In that case, why not bring them up with the publisher directly? All book publishers, academic or not, want higher book sales.\n\nI mean, what do you imagine they'll say? \"No, we won't do that, it'll make the book sell too well! We'll make too much money!\"",
              "author": "respeckKnuckles",
              "created": 1628782302,
              "upvotes": 22,
              "replies": {}
            }
          }
        },
        "h8qdxkk": {
          "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8qdxkk/",
          "text": "This happened to me. My book (with a well known coauthor) was published up to the fifth edition. The rest of the books in the series only had one edition. Being part of a series was beneficial from a marketing perspective.\n\nAlso, you may be overestimating the popularity of your book.",
          "author": "ThatProfessor3301",
          "created": 1628819704,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h8o30sw": {
      "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8o30sw/",
      "text": "I wouldn't break your contract. This burns bridges in publishing and most books are only sort of related to their series. Series are just how academic publishing is organized. It sounds like you want to go with a \"trade\" publication--sorry, you've got to decide that from the beginning, and it would take a major rewrite to be less academic. You can still take your research and write a \"popular sociology\" type book from it; there's a different audience and focus anyway.",
      "author": "raspberry-squirrel",
      "created": 1628784105,
      "upvotes": 9,
      "replies": {
        "h8o5zks": {
          "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8o5zks/",
          "text": "No intention of breaking the contract, very happy to be with my publisher. I'm going to follow the other advice here and float the idea of doing the book outside of the series with my editor. Worst that can happen is a no, and either way they and I both end up with a book.",
          "author": "InevitablePresence54",
          "created": 1628785317,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "h8r9pox": {
      "link": "/r/AskAcademia/comments/p2yx33/getting_out_of_a_book_series/h8r9pox/",
      "text": "Is this a series ‘edited’ by some profs or a generic series run by the commissioning editors themselves? If the latter I’d say it doesn’t really matter a whole lot. When I was given my contract the commissioning editor placed my book in a series that wasn’t a perfect fit. I asked whether it could go into another more interdisciplinary series but she explained that one was under the remit of a different department and different set of commissioning editors. No biggie to be honest. The book will still be the same book and the clique it will appeal to will find it either way.",
      "author": "ThePsychoToad1",
      "created": 1628838686,
      "upvotes": 1,
      "replies": {}
    }
  }
}