{
  "sid": "fwpl7t",
  "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/",
  "title:": "COVID-19 Effects on University Budgets/Graduate Student Stipends",
  "text": "I am a graduate student at a US university in the epicenter of the pandemic. This morning, we received word that our program is likely to lose the funds available for graduate student stipends. This is likely the result of the state reallocating funds towards combatting the virus. This includes previously awarded stipends (i.e., your guaranteed 5 years of funding is no longer guaranteed). No official announcement yet, but it seems as though university administrators are giving us a 'heads up' about this. Obviously, this news has been quite difficult for me and other students in my department. \n\nHas this happened to anyone else? Are you anticipating your department/university will do the same?",
  "author": "KatAnteater",
  "created": 1586283527,
  "updated": 1634081240,
  "over_18": false,
  "upvotes": 151,
  "upvote_ratio": 0.98,
  "comments": {
    "fmq0f8g": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmq0f8g/",
      "text": "Make sure to speak with your graduate student union if you have one. They will probably be fighting this.",
      "author": "Shield_Maiden831",
      "created": 1586290618,
      "upvotes": 88,
      "replies": {
        "fmq3184": {
          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmq3184/",
          "text": "Thank you for the suggestion - I will definitely be reaching out once I learn more!",
          "author": "KatAnteater",
          "created": 1586291959,
          "upvotes": 19,
          "replies": {
            "fmqc118": {
              "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqc118/",
              "text": "And now could be a great time to get involved as a leader or organizer. The most important part of a union is talking to your coworkers. See how they feel and if they want to help fight.",
              "author": "SlipperyBiscuitBaby",
              "created": 1586296788,
              "upvotes": 14,
              "replies": {}
            }
          }
        }
      }
    },
    "fmpwm5e": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmpwm5e/",
      "text": "I was told to take a leave of absence and go get a job while I write up whatever I’ve got.",
      "author": "shindleria",
      "created": 1586288672,
      "upvotes": 54,
      "replies": {
        "fmq36qa": {
          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmq36qa/",
          "text": "Ugh, I'm so sorry. Taking a leave of absence might be in the cards for me too. Best of luck to you",
          "author": "KatAnteater",
          "created": 1586292037,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "fmpxsxk": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmpxsxk/",
      "text": "I'm in a mid-sized public university in the midwest and I feel extremely lucky- we got an email last week confirming that our funding won't change for next year.  I'm really sorry to hear what your program is going through, and I hope more support and resources will become available to you.",
      "author": null,
      "created": 1586289278,
      "upvotes": 35,
      "replies": {
        "fmq33q2": {
          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmq33q2/",
          "text": "Thank you so much for the encouragement!",
          "author": "KatAnteater",
          "created": 1586291994,
          "upvotes": 6,
          "replies": {}
        },
        "fmq9ge5": {
          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmq9ge5/",
          "text": "may I know which university this is I'm also in a university in the mid-west and plan to apply to grad school",
          "author": "helpreddit12345",
          "created": 1586295381,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fmq05ej": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmq05ej/",
      "text": "Definitely speak to a lawyer about this. Did you sign a contract? Your department can’t just unilaterally cancel a contract without going through bankruptcy-like proceedings (financial exigency).",
      "author": "nevernotdating",
      "created": 1586290477,
      "upvotes": 100,
      "replies": {
        "fmq2zoi": {
          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmq2zoi/",
          "text": "We were not given contracts to sign that cover a multi-year period. Instead, we submit contracts that detail expected hours of work, title, compensation, etc. each semester as our assigned duties (i.e., which lab/campus we fulfill our hours in) can change. \n\nAll we have are our admission letters that guarantee funding, unfortunately. We have a great union, and nothing is official yet, but this is nerve-racking.",
          "author": "KatAnteater",
          "created": 1586291938,
          "upvotes": 55,
          "replies": {
            "fmq6xnv": {
              "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmq6xnv/",
              "text": "There’s precedent in my state that offer letters are to be considered binding. So if you have offer letters guaranteeing a certain number of years, those may be useful. My union has an arbitration to this effect a few years ago.",
              "author": "loki478",
              "created": 1586294009,
              "upvotes": 54,
              "replies": {}
            }
          }
        },
        "fmqbona": {
          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqbona/",
          "text": "[deleted]",
          "author": null,
          "created": 1586296603,
          "upvotes": 20,
          "replies": {}
        },
        "fmqcd20": {
          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqcd20/",
          "text": "When you get paid an average of $3/hour what graduate student can afford a lawyer?  Students have no rights under workplace legislation and with merely a pseudo union with no power to stand up for you a PI and a university that runs their own kangaroo court system has carte blanche to do whatever the hell they want to you.",
          "author": "shindleria",
          "created": 1586296963,
          "upvotes": 35,
          "replies": {
            "fmx8x7n": {
              "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmx8x7n/",
              "text": "I got this a lot when I was organizing for a union at my school. \"If a student has a problem with admin, why don't they just talk to a lawyer?\" Ah yes, the definitely real option on a $15k/yr budget and 60 hour workweek. Why hadn't I thought of that",
              "author": "superexpress_local",
              "created": 1586460608,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "fmq9wr0": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmq9wr0/",
      "text": "I'm sorry to hear that. I was accepted into a phd program and was supposed to start next fall. I am trying to come to terms with the fact that it may not happen after all. they have yet to say something about it (I'm an international student by the way, and would only be able to attend my program with the full waiver + stipend they have offered with my TA position). \n\nthey've actually issued my I-20 a few days ago, so apparently they are still conducting business as usual (albeit remotely, of course) for now. \n\nit's disheartening though. I mobilized a lot in order to apply, of course, and spent a lot of money on the process, as my country's currency has been horribly devalued (I eventually had to terminate my apartment lease, sell all my stuff and move in temporarily with family in order to keep afloat while I prepare to move to the USA).",
      "author": "WittyGertyStein",
      "created": 1586295632,
      "upvotes": 23,
      "replies": {}
    },
    "fmqdubx": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqdubx/",
      "text": "> This is likely the result of the state reallocating funds towards combatting the virus. \n\nOur university hasn't made any cuts to grad student funding.  However, we're now in a hiring freeze and there's a chance of layoffs and furloughs (apparently even tenured profs can be furloughed at our school).",
      "author": "knockknockbear",
      "created": 1586297744,
      "upvotes": 17,
      "replies": {
        "fmtuv3h": {
          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmtuv3h/",
          "text": "Tenure is a tremendous joke. A full prof (and chair of his department) at a local competitor got “offered” early retirement because the school is going through financial hardship. Life ain’t what it used be in academia.",
          "author": "abydosaurus",
          "created": 1586379411,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmqtjym": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqtjym/",
      "text": "I can't speak to graduate students, but many faculty I know (including myself) are receiving contracts with new force majeure clauses in them that specifically cite pandemics. Totally new language that will all them to cut tenured faculty positions if the virus impacts fall enrollments or causes another shutdown.\n\nMy university is looking at a budget deficit for this semester that runs about 8% of the annual budget...that's huge for many schools. Jobs are being cut all over but the budget will not balance for FY 2020 without tapping reserves. Next fall enrollments are almost certain to decline 5-10% (or more) even if the virus is gone. I expect our faculty will go down by a similar amount. I would not be surprised at all if funding for graduate students was cut in efforts to address similar shortfalls.",
      "author": "SnowblindAlbino",
      "created": 1586306751,
      "upvotes": 15,
      "replies": {
        "fmr8xdo": {
          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmr8xdo/",
          "text": "Yep - similar here in Australia.  University budgets have been devastated by this and there will be job cuts coming.  Current graduate funding hasn't been cut, and current students will definitely be funded to completion, but I'm expecting cuts wherever possible; hiring freezes, cancelling of annual pay-rises, promotion freezes, early retirements, slashing of internal research funding (seed funding, conference support etc).\n\nAnd yet a lot of my colleagues appear oblivious to all this and are instead complaining about potentially losing half of their sabbatical, or how demanding students are being with online classes...",
          "author": "Solivaga",
          "created": 1586316708,
          "upvotes": 8,
          "replies": {
            "fmrph50": {
              "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmrph50/",
              "text": "Budgets were slim this year in Qld before this hit. I had a nightmare last night about watching my colleagues walk out of the office with boxes of their things. The impacts of this will be huge.",
              "author": "Kateskayt",
              "created": 1586330723,
              "upvotes": 2,
              "replies": {
                "fmrq8pq": {
                  "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmrq8pq/",
                  "text": "Exactly - I'm in Vic, and the last few weeks have been surreal.  I'm convinced that we're looking at fairly major restructures across multiple universities, with entire departments likely being axed, and half my colleagues are bitching about a conference they're missing July",
                  "author": "Solivaga",
                  "created": 1586331518,
                  "upvotes": 3,
                  "replies": {
                    "fmrtf3o": {
                      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmrtf3o/",
                      "text": "Are the even missing it? I had a conference presentation in a couple of months but it’s been postponed until next year - it’ll happen eventually.\n\nI’m not so sure every university in Australia will survive this.",
                      "author": "Kateskayt",
                      "created": 1586334807,
                      "upvotes": 2,
                      "replies": {
                        "fmruelb": {
                          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmruelb/",
                          "text": "\\>Are the even missing it? \n\nExactly - all mine have been pushed back to next year. To be fair, I doubt we'll have internal funding for conference attendance next year, but that's another issue\n\n\\>I’m not so sure every university in Australia will survive this.\n\nDitto - I don't know Australia's HE sector as well as I do others, but I'm certain that the UK and US will see universities closing due to this (on top of already strained finances).  I assume Australia will be similar, though I don't know which institutions are most at risk",
                          "author": "Solivaga",
                          "created": 1586335827,
                          "upvotes": 2,
                          "replies": {
                            "fmrx8es": {
                              "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmrx8es/",
                              "text": "Universities Australia has conservative estimate of 21,000 job losses in the sector in the next six months. That’s around 17% of staff. I think a considerable amount of those will be sessional academic staff.",
                              "author": "Kateskayt",
                              "created": 1586338834,
                              "upvotes": 2,
                              "replies": {
                                "fms5tix": {
                                  "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fms5tix/",
                                  "text": "I suspect my institution will restructure and axe some programmes completely - losing academic staff on continuing contracts.  I know of at least one NSW institution that has already announced such a restructure...  It's going to be grim",
                                  "author": "Solivaga",
                                  "created": 1586347476,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fmr0c1f": {
          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmr0c1f/",
          "text": "How can the students be worried about whether they can contibue to attend while the unis are also worried about having enough students?",
          "author": "kissbythebrooke",
          "created": 1586310967,
          "upvotes": 3,
          "replies": {
            "fmraqwp": {
              "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmraqwp/",
              "text": "Because it isn't really up to either party...",
              "author": "aliceoutofwonderland",
              "created": 1586318015,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "fmqfk25": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqfk25/",
      "text": "The opposite happened to me, I was sent a letter from the Graduate School admins assuring me that the offer they made me was binding and they were committed to fulfilling it. I agree with the other posters, this sounds like something the GSU needs to start on immediately.",
      "author": "ellensaurus",
      "created": 1586298650,
      "upvotes": 10,
      "replies": {
        "fmrx95r": {
          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmrx95r/",
          "text": "Hey, I wanted to confirm whether my offer stands as well. I've already accepted it and was supposed to start in Fall 2020. Should I send them an email asking whether any issues might arise from this pandemic?",
          "author": "Necromancer_Jade",
          "created": 1586338857,
          "upvotes": 3,
          "replies": {
            "fms9fwq": {
              "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fms9fwq/",
              "text": "If you need it for peace of mind, sure, there’s no problem in asking and it may set off a chain reaction that results in a letter like mine.",
              "author": "ellensaurus",
              "created": 1586350341,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fmqeidn": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqeidn/",
      "text": "Is this an R1? What field are you in?",
      "author": "coffeebeforebed_",
      "created": 1586298096,
      "upvotes": 9,
      "replies": {}
    },
    "fmqc88u": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqc88u/",
      "text": "I have a fulbright grant just sitting in my university's piggy bank, while I'm sitting here poor as fuck, because I did not get my 'Grant Activation request' approved before this shit show. \n\nSo now they got my money; i can't get it; and they fucking win. and i fucking lose. \n\nGood luck, though. Hope you arent as fucked as it seems.",
      "author": "BlancheDevereux",
      "created": 1586296893,
      "upvotes": 18,
      "replies": {}
    },
    "fmquthz": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmquthz/",
      "text": "There is a lot of good advice here, but I just wanted to say I’m wishing you and anyone else in this scenario the best. I’m at a large public university, the only budget cuts we’ve been informed of is that any university travel funding have been canceled through the end of the year. Other than the current hiring freeze.",
      "author": "Enzohere",
      "created": 1586307530,
      "upvotes": 6,
      "replies": {}
    },
    "fmqbdi2": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqbdi2/",
      "text": "So far not for me. I am at a public US university. I am paid by a grant. I was also concerned about my work performance according to the PI but thank goodness I got my renewal letter for next year last week. I almost cried seeing it.",
      "author": "PenguinFeather4",
      "created": 1586296434,
      "upvotes": 6,
      "replies": {}
    },
    "fmqbxkp": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqbxkp/",
      "text": "Talk to your union rep ASAP! You’re more powerful when you collectively organize!",
      "author": "SlipperyBiscuitBaby",
      "created": 1586296737,
      "upvotes": 10,
      "replies": {
        "fmqn5ap": {
          "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqn5ap/",
          "text": "Union rep --- our university doesn't allow grad students to unionize. And I think that is the case for many.",
          "author": "hillsonn",
          "created": 1586302916,
          "upvotes": 10,
          "replies": {
            "fmqqvyj": {
              "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqqvyj/",
              "text": "All the better time to start organizing your coworkers to form a union :)",
              "author": "SlipperyBiscuitBaby",
              "created": 1586305121,
              "upvotes": 1,
              "replies": {
                "fmqstz6": {
                  "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqstz6/",
                  "text": "Oh we are fighting!\n\nhttps://academiclaborunited.org/",
                  "author": "hillsonn",
                  "created": 1586306302,
                  "upvotes": 3,
                  "replies": {
                    "fmrdki6": {
                      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmrdki6/",
                      "text": "I love it! Solidarity from a comrade!",
                      "author": "SlipperyBiscuitBaby",
                      "created": 1586320158,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fmracpe": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmracpe/",
      "text": "Nothing so far in my program. It's occurred to me that it is possible but so far the administration has not mentioned anything about stipends. An admin e-mail said they couldn't guarantee that staff furloughs and layoffs would be avoided. Which is equivocal.\n\nCan't control any of that at all so I will just plow on ahead until things change.",
      "author": null,
      "created": 1586317725,
      "upvotes": 3,
      "replies": {}
    },
    "fmra1e7": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmra1e7/",
      "text": "Thanks for the post! I've been thinking about this. I hope things work out for you. \n\nI was offered admission to a couple of PhD programs with funding. If this ends up being the case at these schools, do you think they would let me know that funding is cut even though I haven't accepted the offer yet? Or do you think they would hold off on this so that they don't potentially scare any prospective students away?\n\nI might just ask them.",
      "author": "hexylunt7",
      "created": 1586317496,
      "upvotes": 2,
      "replies": {}
    },
    "fmrfkg9": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmrfkg9/",
      "text": "Yup. My “contract will not be renewed after spring.”",
      "author": "ylang_ylang",
      "created": 1586321743,
      "upvotes": 2,
      "replies": {}
    },
    "fmqsb5e": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqsb5e/",
      "text": "PhD from a more prestigious business school in Canada here. They confirmed our funding won’t change and if anything they may increase it to help us out. Feeing Extremely grateful for sure",
      "author": "hrabove180bpm",
      "created": 1586305982,
      "upvotes": 3,
      "replies": {}
    },
    "fmqowmq": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqowmq/",
      "text": "If you have a contract they need to abide by it.",
      "author": "Onion-Fart",
      "created": 1586303944,
      "upvotes": 1,
      "replies": {}
    },
    "fmqr1vv": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmqr1vv/",
      "text": "Sorry to hear OP. My stipends have't been impacted and our chancellor promised that it won't be, but I'm expecting that it's not a definitive thing at this time.",
      "author": "gandalf_sucks",
      "created": 1586305221,
      "upvotes": 1,
      "replies": {}
    },
    "fms3gyc": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fms3gyc/",
      "text": "(In the UK) I've had funding to start a PhD in September 2020 pulled. It was a departmental scholarship but other funding bodies are still funding PhDs. I was also meant to join a trial as an RA in April but that has been delayed with no start date in mind. Really tough and uncertain times. Hope your funding is still secure and that your uni can do its best to support you!",
      "author": "laundryisdrying",
      "created": 1586345335,
      "upvotes": 1,
      "replies": {}
    },
    "fmvxs27": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fmvxs27/",
      "text": "I don't understand this for private universities....\n\nPublic more so because states and governments are going to feel the pinch....\n\nIn the fall classes return to normal... I just don't understand....unlike the 2008 recession this has an end.....not a protracted recovery....to me this largely an excuse by many universities...I don't see 500K a year administrators offering salary decreases.....",
      "author": "bostonmacosx",
      "created": 1586434414,
      "upvotes": 1,
      "replies": {}
    },
    "fporry8": {
      "link": "/r/AskAcademia/comments/fwpl7t/covid19_effects_on_university_budgetsgraduate/fporry8/",
      "text": "I'm sorry to hear this. I am a PhD student at a public university in Missouri and just received news from my PI that they will be cutting our summer funding from .50 (20 hours a week) to .25 (10 hours a week) starting June 1st. However, I signed a similar contract to you, which was supposed to go through July 31st. Being compensated at half the rate for two months will not only prevent me from paying my bills over the summer, but I will also lose half of my health insurance subsidy and be responsible for half of my summer tuition, which was previously covered, as well. I have applied for the CARES Act emergency funding, which awards up to $1000 to students in need [https://www2.ed.gov/about/offices/list/ope/caresact.html](https://www2.ed.gov/about/offices/list/ope/caresact.html) \n\nAnyone know whether we can apply for unemployment? I was funded through a grant and not technically an employee of the university. Thanks!",
      "author": "whatchamccollom",
      "created": 1588789545,
      "upvotes": 1,
      "replies": {}
    }
  }
}