{
  "sid": "kr9zta",
  "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/",
  "title:": "Got invited for a phone interview for TT position! What should I prepare?",
  "text": "I am so excited, I got my first bite from the applications I sent in for TT positions in STEM. I've been shortlisted, and invited to a phone screening on zoom for 20 minutes. The people who invited me are related to my subfield. What should I prepare? Any tips greatly appreciated!!!",
  "author": "aspiring-academic",
  "created": 1609887162,
  "updated": 1634081259,
  "over_18": false,
  "upvotes": 150,
  "upvote_ratio": 0.97,
  "comments": {
    "gi8qcq1": {
      "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi8qcq1/",
      "text": "Woohoo!!!\n\nFrom an R1 / research-intensive institution perspective:\n\nPrep for the main questions:\n1) tell us about yourself\n2) tell us about your research\n3) where do you see your research going in the next 5-10 years\n4) where will your funding come from\n5) what areas/classes can you teach (bonus points if you can name course numbers at their institution); they may also ask a course you could develop to add to their offerings\n6) why this institution/dept?\n\nHave short answers for each that convey you are great and well-prepared for the job (which you likely are). They may ask other questions, but those tend to be the most common. \n\nThen strategically think about questions to ask them that convey you are intentional about launching your research program (and aren’t easily google-able)\n\nEg can you tell me about mentoring for junior faculty? how would you describe the culture in the department? How does the PhD student-advisor match work? What does a successful junior faculty member look like in this dept?\n\nDon’t: negotiate at this stage or be long-winded\n\nBest wishes!!!",
      "author": "clemson_throwaway2",
      "created": 1609890211,
      "upvotes": 103,
      "replies": {
        "gi95n8d": {
          "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi95n8d/",
          "text": "Hmm I wonder what you think about the advice my mentor gave me about mentioning classes to teach. I was warned about being too specific as some professors may be territorial of certain classes and could see you as a \"poacher\" if you come on too strong. For example, I mentioned courses like Abnormal Psychology, Counseling Principles, and Psychology and Law, but made sure to discuss how I could be flexible in filling in department needs for classes within my area General Psychology, Professional Development courses, etc. For me, I think this helped land me my job as there is a very senior professor with whom I had a lot of overlap who can be a little more rigid about the courses he wants to teach. Is this (departmental politics) something that's been overhyped in hiring or something to be consider?\n\nEdit: grammar",
          "author": "holldoll_28",
          "created": 1609897411,
          "upvotes": 27,
          "replies": {
            "gi96bca": {
              "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi96bca/",
              "text": "Yes, this is a great point about folks who are territorial! I haven’t run into this, but I think your approach is great - conveying both competence and flexibility.",
              "author": "clemson_throwaway2",
              "created": 1609897750,
              "upvotes": 17,
              "replies": {}
            },
            "gia2eor": {
              "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gia2eor/",
              "text": "I had a prof tell me to mention that you would love to teach [insert classes mentioned in the job posting] and would be willing to teach [insert other classes here] based on departmental needs. That way, they know you can teach it if they need you to, but you don’t come off too strong.",
              "author": "Licanius",
              "created": 1609915257,
              "upvotes": 6,
              "replies": {}
            },
            "gi9na3m": {
              "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi9na3m/",
              "text": "I served on a committee last year and we had a recent grad interview for a position teaching lower division courses. We thought we had made it pretty clear in the job listing that the courseload would be mostly gen eds, so when we interviewed him and he mentioned excitement about “one day possibly teaching” a lot of upper division courses that our senior faculty already fight to teach...he didn’t get a call back.",
              "author": "drbzy",
              "created": 1609906159,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gi950mv": {
          "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi950mv/",
          "text": "Great insight, thanks!\n\nJust curious though, shouldn't an applicant have already answered these questions in the documents that they have submitted as part of the application, most specifically the cover letter? The research statement would also cover questions 2 and 3, and possibly Q4 as well. \n\nOr do the search committees at your university require more elaboration on points raised in applicants submitted materials?\n\nThanks again for the advice.",
          "author": "drwarrengphd",
          "created": 1609897096,
          "upvotes": 8,
          "replies": {
            "gi97cgw": {
              "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi97cgw/",
              "text": "Agree - they’ve probably already answered some of these in the app. I think in my field folks like to hear candidates articulate them - to gauge whether they sound competent, can well-explain them, and are articulate-ish. It’s more of a synthesis so it’s generally not deeper than the app itself in the initial response, though they may take ask a follow up question to hear more detail.",
              "author": "clemson_throwaway2",
              "created": 1609898259,
              "upvotes": 10,
              "replies": {
                "giau1hd": {
                  "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/giau1hd/",
                  "text": "As a related note: I've witnessed candidates read, word for word, from their application documents in response to one or more of these questions (or an adjacent question that overlaps a bit with them).\n\nDon't do that, OP.",
                  "author": "herennius",
                  "created": 1609939583,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gi9cjic": {
              "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi9cjic/",
              "text": "We start our phone interviews by saying that we will probably duplicate the materials you sent us, but we want to ask everyone the same questions.  Some people have better packets than others and those questions are pretty much the meat of what we want to know from each candidate.\n\nAlso, like the other person said, it is also about hearing your articulate these things to see how you sound when you explain things.  Are you coherent, concise, and articulate when you speak.  After all, your packet may have been endlessly copy edited by others to sound great.",
              "author": "manova",
              "created": 1609900804,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gi8vs1x": {
          "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi8vs1x/",
          "text": "This 100% matches the questions I got in STEM at R1s. The formats can vary- sometimes they will even tell you the questions ahead of time and ask you to give 2 minute answers, and they won't show any emotion, very scripted. Sometimes it'll be more informal with follow-up questions. \n\nWhile we've all gotten comfortable working from home, I'd also say keep the \"professionalism\" in mind. Good lighting, clear workspace in view, preferably decent background, limited background noise, etc.",
          "author": "AwkwardAccountant5",
          "created": 1609892453,
          "upvotes": 13,
          "replies": {}
        },
        "giamwg2": {
          "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/giamwg2/",
          "text": "This is incredible. Thank you so much!!!",
          "author": "aspiring-academic",
          "created": 1609934119,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gi902rq": {
      "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi902rq/",
      "text": "I always prep a word doc that has all the relevant info I need. I have the mission, vision, etc on there. I have the data on the department (number of students, majors, research areas, etc). I especially make a list of every faculty member in the department and their research and I write out how we can collaborate. Any other info I can find on the school I will put down as notes. Then I write out every question I think of so they are there and I don’t forget them. Usually they answer 99% of the questions. \n\nInterviews are every bit as much about you getting to know them as them getting to know you. So don’t stress too much. I have had interviews I felt like I nailed only to be told I wasn’t selected for the next round. I’ve had interviews I thought I fumbled through only to find out I made the top 2. A lot of it comes down to match. I was on 2 searches last year and being on the other side definitely makes me wayyyy less stressed about it. Good luck!\n\n\nEdit: also ask questions!!! Not asking is a red flag.",
      "author": "MothmanEatsGroundPep",
      "created": 1609894615,
      "upvotes": 30,
      "replies": {}
    },
    "gi97ewg": {
      "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi97ewg/",
      "text": "Most of these tips are right. One thing that threw me off a little in one TT interview I had was that the panel had read my research and teaching statements in detail and drilled down into the minutiae of my research. It was no big deal but didn’t expect it because most guides suggest that there would be little time for that. You might expect something like this too especially if the panel is in your sub discipline.",
      "author": "NabilCake44",
      "created": 1609898291,
      "upvotes": 14,
      "replies": {}
    },
    "gi98mj1": {
      "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi98mj1/",
      "text": "Congratulations on the interview! I work at a branch campus of a much larger R1 school. After being on a few search committees, I have a few recommendations:\n\n1. Be prepared to talk about experience in both research and teaching. We as a campus prioritize teaching, however as a university we prioritize research; so when looking, we are looking for strong teachers who are capable of high quality research. Make sure you have a feel for what type of school you are interviewing at, because it could very much be the case that the table is flipped. \n2. Be prepared to give a quick overview of your research to a group of people who may or may not be familiar with your area. Also have a short version of what you've done and what you can see yourself doing with it over the next 5-10 years. Bonus points if you can explain how you can involve students in your research. \n3. Be familiar with the school's mission statement, size, area, etc. We often ask what interests a person about our school/area and it never looks good when someone from southern California has no reason to move into the middle of the snowbelt other than for a job. \n4. Run your teaching philosophy/ideas by a peer/colleague/stranger before presenting it to a search committee. I can't tell you the number of times a highly-qualified candidate went from a yes to a no when asked about their teaching. \n5. Don't give generic answers thinking it makes you a more versatile candidate (I.e. What courses do you look forward to teaching? I look forward to teaching everything from basic 100 level through graduate level courses.) These are answers given by most candidates, if you are looking to stand out, be positive and be specific. \n6. If they are available, look up the faculty in the department you are interviewing at; it is helpful to know who you are speaking with, especially if you have overlapping research. If you are in contact with a secretary at the school, it may also be helpful to know who is on the search committee. \n7. (Optional) It's rare that I've received thank you letters or emails after a phone interview, but a quick email summarizing the discussion, your strengths, and how you feel you would fit into the department at this point in the interview process may be looked upon favorably.",
      "author": "GDKramer21",
      "created": 1609898882,
      "upvotes": 8,
      "replies": {}
    },
    "gi93m1k": {
      "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi93m1k/",
      "text": "In addition to the great advice given by others here, I found it super useful to print out my talking points (in giant text) as a reference during the call. Having my main points that I wanted to drive home staring me in the face made it easy to remember to emphasize them!",
      "author": "spec_of_cp",
      "created": 1609896382,
      "upvotes": 5,
      "replies": {}
    },
    "gi98my1": {
      "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi98my1/",
      "text": "The list of questions is usually pretty standard based on my experience, aside from the ones already listed by others, the common ones include:\n\n1. some form of \"how would your colleagues describe you/what are you like as a colleague?\"\n2. some form of \"biggest challenge in teaching/research/student mentoring,\" once they asked me about what I see the biggest challenge will be in that position.\n3. a question about diversity/inclusion",
      "author": "colalalala",
      "created": 1609898889,
      "upvotes": 6,
      "replies": {}
    },
    "gi954wm": {
      "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi954wm/",
      "text": "I don't have any tips, but I'm just dropping by to congratulate you and wish you good luck!",
      "author": "Lofi_Lufe",
      "created": 1609897155,
      "upvotes": 5,
      "replies": {}
    },
    "gi8qk4w": {
      "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi8qk4w/",
      "text": "Depends on the level of the institution, but if the position is researched-based, obviously be able to talk about your research (and also teaching). If it's teaching-based, be prepared to talk about your teaching style, how you assess and grade students, how you've dealt with problems in class, student evaluations, and so on. When we interviewed people in my discipline (psychology) we always asked about a particular topic that students have difficulty with. It was a core question that was always asked and it went a long way toward our evaluation of a candidate. If there is such an area of difficulty in your field, be prepared to talk about how you've successfully taught it.\n\nAlso gather some information about the institution so you can be knowledgeable about the place and your discipline's place there.",
      "author": "rockyfaceprof",
      "created": 1609890296,
      "upvotes": 4,
      "replies": {
        "gi950ek": {
          "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi950ek/",
          "text": "Out of curiosity, what was the area of difficulty that you asked about? I'm also in psychology.",
          "author": "datafix",
          "created": 1609897093,
          "upvotes": 4,
          "replies": {
            "gi9bjly": {
              "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi9bjly/",
              "text": "Negative reinforcement. Not only have we found students to have difficulty with it, but we have had more than one TT applicants get it wrong over the years.",
              "author": "rockyfaceprof",
              "created": 1609900322,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gi9p756": {
      "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gi9p756/",
      "text": "Be prepared to talk abou diversity and how your teaching research etc facilitates it.\n\nAlso how you will bejng diversity to the department/University.",
      "author": "Kpapangelis",
      "created": 1609907160,
      "upvotes": 2,
      "replies": {}
    },
    "gibhwjk": {
      "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/gibhwjk/",
      "text": "I don’t have a great deal to add to the already excellent advice, but I will say that they are looking for someone to fit their needs and to do a job they need done. This means to teach courses they need taught, to supervise in areas for which there is no expertise. And most departments will want somebody who takes an interest in them and their work. Take time to research the people there and find connections between their work and yours. Look at the classes that are required and see which ones you can teach and then find gaps for ones that are not offered and also align with the job ad. Specialized courses I can teach are X and Y. I can easily take on required courses such as A and B as needed. I think one thing people presume is that the best or most highly qualified candidate gets the job. That is often not true. It is the candidate who can do the job they need done and who they believe will be a good colleague, whatever that means for this department. Figure out the gaps that you can fill and find ways to insert these bits of information in your answers. \n\nOne other thing is to speak confidently. Not I hope to, but I have, I am etc. even if your dissertation is still in progress do not talk about it in the future tense. You are not interviewing to be their student, but their colleague. \n\nBe serious, be friendly.",
      "author": "doodledooboo",
      "created": 1609951857,
      "upvotes": 2,
      "replies": {}
    },
    "giaubr3": {
      "link": "/r/AskAcademia/comments/kr9zta/got_invited_for_a_phone_interview_for_tt_position/giaubr3/",
      "text": "Thanks for posting this! I had a phone interview yesterday too and am comforted that a lot of the advice from folks here aligns with how I prepared.\n\nThe thing I most struggle with are the questions. How do you ask some quick but meaningful questions that sound genuine? Most of the ones people suggest are easily googleable or are not appropriate for a phone interview. \n\nUsually I ask:\nWhat are the expectations for the position in research/teaching etc.,\nWhat is the consistency and opportunities for internal funding for undergrads/grads, \nAre internal dept collaborations common? \nor the super cheesy: what is your favorite thing about your department?\n\nNot sure if any of these are ‘good’ questions but i think they work. \n\nOne question I have is about saying thank you. Is that expected for phone interviews? I’ve never done that before and have gotten in person invites but this is my dream position. I’m thinking of sending an email saying thanks and sending an updated CV.",
      "author": "zabulon_",
      "created": 1609939770,
      "upvotes": 1,
      "replies": {}
    }
  }
}