{
  "sid": "rd07p9",
  "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/",
  "title:": "Anyone actually happy with their PhD experience?",
  "text": "Bonus points if you're in a scientific discipline. I'm obtaining my Masters currently in ecology and have been entertaining the thought of obtaining a PhD. I just look at all of the jobs available in my area for a Masters degree and, while I love field work a lot more than lab work, all of these positions seem like they would lack intellectual stimulation. \n\nI do not directly know what I want to do for a career, though I have been entertaining the thought of becoming a professor or going into some sort of conservation research. I would like to work for (roughly, maybe longer) 2-3 years before pursuing a PhD, if that's what I end up deciding to do. \n\nHowever, I see so many posts on here that are overwhelmingly negative regarding PhD work. These experiences have been very illuminating to me in what to watch out for and what hardships I might experience. But I would love to also weigh what the benefits have been for people who are in the process of achieving their PhD or have already done so.",
  "author": "a-softer-world",
  "created": 1639110578,
  "updated": 1639840174,
  "over_18": false,
  "upvotes": 45,
  "upvote_ratio": 0.96,
  "comments": {
    "hnyhgrj": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnyhgrj/",
      "text": "In talking to other grad students that enjoyability of grad school depends heavily on you PI and department culture. If it's good then it's a great experience. If it's really toxic then it can be a living hell. I am currently really loving my masters work and most of my fellow PhD students are enjoying their degrees.",
      "author": "morePhys",
      "created": 1639117745,
      "upvotes": 40,
      "replies": {
        "hnzax8i": {
          "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzax8i/",
          "text": "This is absolutely true! I loved grad school. I got my PhD in Integrated Biomedical Science in 2019. My PI was great, the work was fascinating, and the department was supportive and highly collaborative. As a postdoc, I am having the exact opposite experience and it is a nightmare.",
          "author": "levanie",
          "created": 1639139994,
          "upvotes": 7,
          "replies": {
            "ho0lz43": {
              "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/ho0lz43/",
              "text": "Well you're not alone there. My PhD was about as ideal of a work environment I could have asked for, and has been much less so during postdoc. Luckily the rest of my lab is supportive and provides a good day to day environment, but my advisor(s) leave much to be desired.",
              "author": "WyoBioCowpoke",
              "created": 1639160633,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hnyjea4": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnyjea4/",
      "text": "I had a positive PhD experience! Not every day, but overall (what job is ever positive every day?). BUT I knew what I wanted to do and knew I needed to have a PhD to do it AND I picked a supportive mentor.\n\nThe mentor matters more than the project. Say this over and over until you believe it.",
      "author": "queue517",
      "created": 1639118983,
      "upvotes": 21,
      "replies": {
        "ho08xqm": {
          "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/ho08xqm/",
          "text": "Same.  So much of the PhD experience comes down to your relationship with your adviser.  My adviser was laid back, energetic, and helpful.  I, in general, had a great time getting my PhD (geology).  On the other hand I watched peers of mine in the same department have a terrible time largely due to disengaged advisers, or poorly formulated amorphous research that seemed to change and grow in scope at the advisers whim.",
          "author": "ilikroxnmfrenslikrox",
          "created": 1639155510,
          "upvotes": 2,
          "replies": {
            "ho12dtf": {
              "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/ho12dtf/",
              "text": "> poorly formulated amorphous research that seemed to change and grow in scope at the advisers whim.\n\nouch, why you gotta attack me like that?",
              "author": "Tofu_tony",
              "created": 1639167189,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hnym8j8": {
          "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnym8j8/",
          "text": "How did you find a good mentor?",
          "author": "a-softer-world",
          "created": 1639120882,
          "upvotes": 1,
          "replies": {
            "hnyngvn": {
              "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnyngvn/",
              "text": "Ask the PI pointed questions about expectations, and then ask the people who work in the lab what it's really like to work for that mentor. Do people work weekends? Is the PI supportive when people leave the lab? What's the PI's worst quality? Ask other grad students in the department what the reputation of the PI/lab is. And when they answer, BELIEVE THEM. I've seen a lot of cocky grad students think that X, Y, Z won't happen to them because they are exceptional or because they think professors can do no wrong and the problem must have been the other grad students. That never ends well.",
              "author": "queue517",
              "created": 1639121768,
              "upvotes": 10,
              "replies": {
                "hnyufq4": {
                  "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnyufq4/",
                  "text": "I'm a chem phd applicant, and I know that while reading horror stories on reddit, I sometimes think, \"well I don't think that'll happen to me.\" Am I too arrogant already?",
                  "author": "Shio-zhi",
                  "created": 1639127350,
                  "upvotes": 2,
                  "replies": {
                    "hnzpdr2": {
                      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzpdr2/",
                      "text": "Absolutely. The PhD is hard. Therefore, it is worth joining a lab that at least is meeting your needs in terms of work expectations, etc. if the general consensus is the lab culture is not great, then that’s probably true and it will in fact be the same for you.",
                      "author": "nikkichew27",
                      "created": 1639147391,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "homzdx1": {
                      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/homzdx1/",
                      "text": "It's never a safe bet to assume you are exceptional.",
                      "author": "queue517",
                      "created": 1639572379,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hny92p2": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hny92p2/",
      "text": "Yeah, grad school was a great time of life for me. That was largely due to my professor understanding work/life balance and being a great all around person. Ph.D. In chemistry btw",
      "author": "Rocket1064",
      "created": 1639112850,
      "upvotes": 22,
      "replies": {
        "hnyubeb": {
          "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnyubeb/",
          "text": "I'm also a chem phd applicant (this year) could you dm me the school name? I'm just really curious!",
          "author": "Shio-zhi",
          "created": 1639127249,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnyfb8t": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnyfb8t/",
      "text": "I’m pretty happy with mine so far! Halfway through my second year in a STEM PhD, direct entry from my BS. I like being in charge of my work, setting my own schedule, and mentoring a lot so I feel like this works really well for me, but I also have an amazing PI who gives me a ton of autonomy and support without having crazy expectations. The pay sucks, and of course academia can be stressful, but those are my only real gripes.",
      "author": "recyclabel",
      "created": 1639116438,
      "upvotes": 5,
      "replies": {
        "hnym6a7": {
          "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnym6a7/",
          "text": "Whoa on directly going from BS to PhD. Good for you!",
          "author": "a-softer-world",
          "created": 1639120838,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hny5cgo": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hny5cgo/",
      "text": "Did a PhD in Physics many years ago (23 to be precise). Loved it. It was the only time in my life I had complete control over my life. It was a challenge for sure but I got through. My post doc was the opposite as the PI was an obsessive control freak and that ended my academic career.",
      "author": "vaskopopa",
      "created": 1639110947,
      "upvotes": 14,
      "replies": {}
    },
    "hnyidwm": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnyidwm/",
      "text": "My PhD is in clinical psychology. Grad school was fine. Not that different from college, honestly. It was work but so are most things worth doing. And now, I adore my job. I’m in clinical research at an academic medical center, although I’ve had a number of job offers from industry. I’m surrounded by amazing, brilliant people and I get to do super cool work. Never once have I questioned the value of finishing my PhD.",
      "author": "YukonDoItToo",
      "created": 1639118333,
      "upvotes": 5,
      "replies": {}
    },
    "hnyqpt3": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnyqpt3/",
      "text": "I had a great time during my PhD (engineering).  I moved abroad for it, so I got to travel around and see a new part of the world, learn a new language, make new friends, etc.  I was in a country that pays PhDs as employees so I earned enough to be comfortable and had some savings at the end.  I enjoyed the work, learned loads, and my supervisor was a good fit for me (quite hands off, but I was pretty independent so that worked well for both of us).  I got expertise in an interesting area, got decent papers out and a little bit of funding in, and that landed me a really cool job I would otherwise not have been able to get.  Of course not everything was perfect but overall, very positive.  \n\nMost peoople who post up here do it because they want to vent.  It totally makes sense, but you do get a very biased perspective.",
      "author": "polyphonal",
      "created": 1639124261,
      "upvotes": 5,
      "replies": {
        "hnzqnde": {
          "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzqnde/",
          "text": "How did you decide to move abroad? Did you see a PhD that was offered in another country and just applied?",
          "author": "NeilLikesNoodles",
          "created": 1639147958,
          "upvotes": 2,
          "replies": {
            "ho0xudt": {
              "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/ho0xudt/",
              "text": "> Did you see a PhD that was offered in another country and just applied?\n\nYes.  Obviously I did my research first to familiarise myself with the PhD system in that country, as well as all the usual stuff about looking up the group & PI.  I didn't know them beforehand or anything, just submitted an application online on the university job portal.  We did a phone interview, they flew me out for a visit / brainstorm / in-person interview, and I moved as soon as I wrapped up my masters thesis.",
              "author": "polyphonal",
              "created": 1639165378,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hnzqm7j": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzqm7j/",
      "text": "So I'm in a STEM field. To be entirely honest, I've loved my PhD, and I'm inches away from finishing. I have made some incredible friends, thoroughly enjoyed my research, and had some amazing opportunities for travel, etc. \n\nThat's not to say that there haven't been some difficult parts, specifically dealing with multiple toxic postdocs and some substantial issues more recently with my advisor (which seem to be fixed now, I'm not going to go into details here, though I'd be happy to talk about it in a PM if you're curious).\n\nI'd agree with others' comments that your PhD experience will depend heavily on your advisor and departmental culture, though you can certainly try to make the best of any situation. To a lesser extent, how much you enjoy your research and the subject of your dissertation will also affect your experience.",
      "author": "ProfessorGoldfella",
      "created": 1639147943,
      "upvotes": 3,
      "replies": {}
    },
    "hny4og0": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hny4og0/",
      "text": "Does social science count? Because those were legitimately some of the best years of my life.",
      "author": "CerebralBypass",
      "created": 1639110629,
      "upvotes": 10,
      "replies": {
        "hny4ye7": {
          "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hny4ye7/",
          "text": "Sure! I'd love to hear about your experiences.",
          "author": "a-softer-world",
          "created": 1639110762,
          "upvotes": 3,
          "replies": {
            "hny566v": {
              "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hny566v/",
              "text": "Great cohort, awesome research groups, and mentors who have become some of my most trusted colleagues (we all know where the skeletons are). Finding the right space for you can be amazingly rewarding.",
              "author": "CerebralBypass",
              "created": 1639110865,
              "upvotes": 8,
              "replies": {
                "hnym1rv": {
                  "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnym1rv/",
                  "text": "Thank you. It really seems that a good cohort and advisors make a world of difference.",
                  "author": "a-softer-world",
                  "created": 1639120752,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hnzgvrc": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzgvrc/",
      "text": "Started my PhD at 32, Nearly finished 3rd year of PhD\n\nI can genuinely say that every other job I've ever had (I worked as a secondary/high-school teacher and also data science consultant) has been more fun than this drudgery",
      "author": "statneutrino",
      "created": 1639143354,
      "upvotes": 3,
      "replies": {}
    },
    "ho1k22g": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/ho1k22g/",
      "text": "Working for a few years before committing to an advanced degree is a good idea.  While earning a living wage, you can figure out if you like the field as much as you expected as well as what degree would help you.\n\nHaving an advanced degree is important to advancement in some fields, and not im others.  At the same time, advancement may mean moving to administration or a branch you don't like as much.\n\nGetting an advanced degree is difficult, and your income is minimal.\n\nI loved my PhD program, but wish I had added a clinical degree.  It would have given me more flexibility, a better and more consistent income, and better access to resources.  Think hard.",
      "author": "x47126g",
      "created": 1639174205,
      "upvotes": 3,
      "replies": {}
    },
    "hny6ocg": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hny6ocg/",
      "text": "Currently doing one biology and am loving it. Of course it a lot of work but it’s a great time my advisor is amazing and my lab mates are all (mostly) great and extremely supportive",
      "author": "Shot-Boysenberry-999",
      "created": 1639111594,
      "upvotes": 6,
      "replies": {}
    },
    "hnzdu4q": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzdu4q/",
      "text": "I got my degree......so i guess?\n\nWork/life was great, but I also didnt get paid shit....so thats net zero. \n\nI had to do 2 different dissertations, but the one that didnt work got me my job....so yay?\n\nGot published a bunch, but my i10 is only 6....eh?\n\nAcademia is a hell-hole, and I dont quite have the qualifications to take an industry job...so its tough.",
      "author": "CptSmarty",
      "created": 1639141711,
      "upvotes": 2,
      "replies": {}
    },
    "hnzfqeg": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzfqeg/",
      "text": "My PhD (mol bio) has been awesome. Obviously the work is hard but my advisor is really passionate, invested in his students but also understands boundaries. If you pick your advisor well and you love your research, grad school can be very positive!",
      "author": "WhoCaresWhyBother",
      "created": 1639142753,
      "upvotes": 2,
      "replies": {}
    },
    "hnzit8l": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzit8l/",
      "text": "I just started my PhD this semester and have been happy with the experience so far. I came from a particularly negative master's experience (e.g., overbearing advisor, harsh advisory committee members, topic I wasn't excited about, etc). I have a lot more freedom now as a PhD student and got to pick a project that I'm actually excited about. We'll see if my opinion changes in a few years when I'm almost done my PhD.",
      "author": "poniesgirl",
      "created": 1639144323,
      "upvotes": 2,
      "replies": {}
    },
    "hnznrb7": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnznrb7/",
      "text": "I’m only a few months into my PhD, but I’ve enjoyed everything it has entailed even though outside of my PhD it’s probably been the worst three months of my entire life. Thank god all three of my supervisors are incredibly understanding and give me any time I need.",
      "author": "Wumbologistt",
      "created": 1639146659,
      "upvotes": 2,
      "replies": {}
    },
    "ho1hde6": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/ho1hde6/",
      "text": "If you look at grad student surveys, typically 85% of students are satisfied or very satisfied with their grad school. About 8% are dissatisfied or very dissatisfied. Percentages are about the same for their PI, w a large majority satisfied. Social media is a place for people to vent, so it is heavily biased to the negative. There are some very bad PIs and some toxic places, but most are good.",
      "author": "Carb-ivore",
      "created": 1639173119,
      "upvotes": 2,
      "replies": {}
    },
    "ho75z1h": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/ho75z1h/",
      "text": "I did my PhD in ecology and was pretty happy with it. The first year was somewhat stressful due to a shitty advisor antaking more courses than I should have, but once my advisor and I split ways during my second year, things went a lot more smoothly. I ended up securing my own grant money for my research and my new advisor was pretty hands-off, so research was stress-free other than delays due to covid. I really liked my teaching assistantships, too. \n\nHowever, there were several people in my program who had a rotten time and a few dropped out. Our program director was more concerned with growing the online masters program than supporting the PhD students and was very bad with ensuring everyone had proper funding. She was also super vindictive when someone pissed her off. But if you just steered clear of her all together, it was fine. \n\nPrelims and my defense were also extremely easy and stress-free. A lot of people describe one or both as being basically hazing, but I didn't have that experience. My research went in spurts of doing a lot of stuff at once and then waiting for a long time, so I also didn't have the issue of slaving away in the lab 12 hours per day. In fact, I had a lot of free time in my last 3 years after my coursework was done. I took up martial arts, did a lot of hiking, and watched a lot of SciFi.\n\nI scored a tenure track job at a SLAC after graduation, but the academic job market is super tough. Ecology positions are few and far between and it basically comes down to if you have the particular research background the school is looking for and decent teaching experience, depending on the position. And there are a lot of folks with postdoctoral experience out there competing for the same jobs.",
      "author": "zucchinidreamer",
      "created": 1639276520,
      "upvotes": 2,
      "replies": {
        "ho7id7b": {
          "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/ho7id7b/",
          "text": "Would you mind if I PMed you in a day or two to ask more about your experiences?",
          "author": "a-softer-world",
          "created": 1639282794,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnzl3x2": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzl3x2/",
      "text": "I absolutely loved my PhD. I produced 9 first authored papers. I went to international conferences. Was recognized with prestigious awards. Published a book chapter and wrote 3 patents two of which were exclusively licensed to the industry who gave very generous funding to the university and myself. Engineering",
      "author": "slowpokesardine",
      "created": 1639145428,
      "upvotes": 2,
      "replies": {}
    },
    "hnz0ux5": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnz0ux5/",
      "text": "I'm a few years into my PhD in neuroscience and love it! I think there are a few factors that contributed to me having a positive experience. Firstly, I am glad that I got some work experience before starting my PhD, both inside and outside of academia, so that I can now appreciate all the freedom that academia has given me (and also that I am a bit older now). Secondly, I think the research group and supervisor you have is much more important for the success/enjoyment of your PhD than the actual field of study. And thirdly, it is worth noting that experiences - and salaries! - differ a lot between countries. I moved abroad to the UK.",
      "author": "hereforthesewing",
      "created": 1639132772,
      "upvotes": 1,
      "replies": {}
    },
    "hnz4i4z": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnz4i4z/",
      "text": "Econ here. The PhD was extremely challenging (especially at the start, when I was very out of my depth), but I was surrounded by a very supportive cohort of grad students, had a fantastic advisor who is still one of my closest mentors, and learned so, so much. I had no intention of going into academia when I started grad school, so I am also thankful for my PhD experience helping me choose a career that, at least to date, has been meaningful to me.",
      "author": "variablyinstrumental",
      "created": 1639135661,
      "upvotes": 1,
      "replies": {}
    },
    "hnz5sgc": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnz5sgc/",
      "text": "It's a while back. I'd say yes and no. It was a huge mental slog and I was at Oxbridge where I didn't really fit with the culture and the University had (and still has) issues with behaviour. That said I made the greatest friends of my life who are still my closest friends many years on, even as we've at various times moved around the world. It exposed me to a whole other world and opportunities I didn't see at UG, it eventually lead to me living overseas for a few years and although not an academic I still work in academia and have a career that's had its difficult moments but that I have to pinch myself sometimes about because I can't believe what I get to do and where I am. I think academia has a huge problem with toxic behaviour and no student should ever have to go through what I experienced (and worse) and I'm proud I'm actively involved in making it better at an organisation that is determined to create a positive culture for everyone. I can't unpick the bad from the good, but while I think it's led somewhere incredibly good for me and shaped me, it was also extremely difficult and did damage my mental health.",
      "author": "ACatGod",
      "created": 1639136596,
      "upvotes": 1,
      "replies": {}
    },
    "hnzdvhz": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzdvhz/",
      "text": "Although some parts were stressful like you would expect from any rigorous program, I really enjoyed my PhD and miss that department. I got to meet a lot of wonderful people, travel a lot for conferences/workshops, and spend my time playing with things that I found interesting. I also became quite close with my officemates.",
      "author": "reyadeyat",
      "created": 1639141733,
      "upvotes": 1,
      "replies": {}
    },
    "hnzp0dl": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzp0dl/",
      "text": "Just started my PhD in chemistry this fall and I love it! I’m the happiest I’ve ever been. I love my classes, my research, and my cohort members. Sure it’s a lot of hard work but I’m having a really amazing time in the process!",
      "author": "nikkichew27",
      "created": 1639147226,
      "upvotes": 1,
      "replies": {}
    },
    "hnzqgxt": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzqgxt/",
      "text": "Had a great experience. Supervisors were present but absent for a good portion of it but that just pushed me to become more independent. There were some dark days when data collection was challenging (human subjects) but you tend to get there in the end with enough persistence.",
      "author": "DrArmitageShanks",
      "created": 1639147878,
      "upvotes": 1,
      "replies": {}
    },
    "hnzsdis": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzsdis/",
      "text": "I did my PhD in law, and I loved it. I had a good supervisor who understood where I was going with my work and was happy to let me get on with it without trying to manage me. I found it intellectually stimulating and enjoyable and not particularly stressful. \n\nI think it helped that I kept an active social life outside of my PhD - I found that when PhD students socialise they tend to talk only about their PhD experiences. If you do that enough, especially if most of your social interaction is with other PhD students, then it begins to feel like this all-encompassing thing that takes over your life. And I found that other people's PhD troubles become your PhD troubles, and begin to affect how you think and feel about your own work. Once I realised this I spent my social time instead with friends who were not doing a PhD, who had no interest in academic work, and who couldn't care less about my PhD beyond wanting to know that I was doing well and enjoying it. I hung out with and shared experiences with and listened sympathetically to other students when I was on campus, of course, but outside of 'working hours' I hung out with non-academic people.\n\nAlso - I did a PhD because I was intellectually interested in the topic, not because I hoped to get any kind of career out of it, so I didn't take it too seriously. I didn't dedicate all my time to it, I didn't get stressed about deadlines, I didn't make myself work unsociable hours at weekends and evenings. I did what I found interesting, read and wrote what I felt like reading and writing, and when I stopped being interested or couldn't be bothered or whatever I went and did other things instead until I was ready to come back to it.\n\nI finished in three years and I'm now a postdoc, but I would happily have done my PhD again. I approach my postdoc in the same way - don't let it become all-encompassing, don't take it too seriously, keep a life outside of academia - and so far so good.",
      "author": "phonicparty",
      "created": 1639148726,
      "upvotes": 1,
      "replies": {}
    },
    "hnztah8": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnztah8/",
      "text": "I am happy with many aspects of it, including the people I get to work alongside every day. I just have unrealistic expectations and doubt that my project is going to work out in the end. XD",
      "author": "GandalfDoesScience",
      "created": 1639149121,
      "upvotes": 1,
      "replies": {}
    },
    "hnzvaa3": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/hnzvaa3/",
      "text": "I was happy with my PhD experience.  Computer Science.  It was a fun 4 years.",
      "author": "TADodger",
      "created": 1639149978,
      "upvotes": 1,
      "replies": {}
    },
    "ho11yoc": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/ho11yoc/",
      "text": "Yes. I actually love my PhD. It certainly has its ups and downs, but your experience can really depend on your PI and lab dynamic.",
      "author": "BiologyPhDHopeful",
      "created": 1639167019,
      "upvotes": 1,
      "replies": {}
    },
    "ho12dnu": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/ho12dnu/",
      "text": "It's altogether not bad.\n\nI started a MS and recently converted to a PhD (STEM). When I started my grad school , I made sure to tell everyone that I'm doing this just to further my job prospects in industry and never going into academia. Period. My prof is pretty cool about it and I only pursued projects that required very technical skillsets (e.g, modeling, coding) to produce results. Even then, I tried hard to implement techniques and skills that I think would be attractive for employers.\n\nAnyway, so far it seems it's working out. I did an internship with a tech company last summer and currently secured an internship with a major company for this summer. Personally I see money as *the* motivator and the opportunity cost of me doing a PhD is very very low. I couldn't have had gotten any high paying jobs without a graduate degree so yeah. At the end of the day, it's really what you want to get from your PhD.",
      "author": "RockyDescent",
      "created": 1639167187,
      "upvotes": 1,
      "replies": {}
    },
    "ho1pny6": {
      "link": "/r/AskAcademia/comments/rd07p9/anyone_actually_happy_with_their_phd_experience/ho1pny6/",
      "text": "Like cycling up the world's steepest hill with people throwing nails and other detritus at you, the volume of which only increases until you get to the top.",
      "author": "LutherChode",
      "created": 1639176549,
      "upvotes": 0,
      "replies": {}
    }
  }
}