{
  "sid": "hec1mr",
  "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/",
  "title:": "Although I passed my Master's Thesis today, it doesn't feel good at all.",
  "text": "I had my Master's Thesis defense today. I should be relieved and happy, but I feel so so sad. I know that I did not do enough research work. Felt like the committee just gave me a freebie. I know my work is insufficient because I have been working remotely with access to a shitty server that was down for almost a month in between. So there are some severe gaps in my work (I work in the field of deep learning so I lost a lot of training time). I really want to do a Ph.D. later but now I feel as if I would turn out to be a piss poor researcher.\n\nYesterday I was worried if I would pass or not. Today I am worried if I would be even a half-decent researcher compared to my peers. I don't even know why I am writing all this here. Maybe just venting it out.\n\nSorry if my English isn't good. I am not a native speaker and just feel too sad to correct anything right now.\n\nMods please delete this post if it violates rules. Thank You\n\n&#x200B;\n\nEDIT - Thank You, everyone, for your kind words. It really helped. I feel loads better. TYSM!",
  "author": "Un_Optimal_Record",
  "created": 1592907585,
  "updated": 1634080274,
  "over_18": false,
  "upvotes": 281,
  "upvote_ratio": 0.97,
  "comments": {
    "fvqbw1n": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvqbw1n/",
      "text": "It‘s fine that you don’t feel relieved. Perhaps you will be later. I think that speaks for your ambitions to do better. Still congrats for passing your master thesis! I’m still on my way.",
      "author": "coolinhi",
      "created": 1592909031,
      "upvotes": 189,
      "replies": {
        "fvqfvv0": {
          "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvqfvv0/",
          "text": "thank you so much for your kind words! Also all the best!",
          "author": "Un_Optimal_Record",
          "created": 1592912525,
          "upvotes": 45,
          "replies": {
            "fvr5455": {
              "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvr5455/",
              "text": "I agree with what others are saying here. The fact that you feel bad about it is a good sign for your future. Some people just want the degree and do the minimum work and are fine with that. You seem to have a much higher standard. \n\nTake this bad feeling and learn from it. Now you know what it feels like and you know how to avoid it in the future. You could always go back and collect more data and turn your masters around into a publishable paper. It looks like you have the groundwork done and just needed more time. This would go a long way into getting into a PhD program.\n\nYou seem to have the right attitude, just turn it into a learning experience and you will do great things.",
              "author": "aspectsofwar82",
              "created": 1592927398,
              "upvotes": 31,
              "replies": {}
            }
          }
        }
      }
    },
    "fvqiirl": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvqiirl/",
      "text": "Your feelings probably have more to do with you than with your thesis. Also, academia is not a meritocracy -- no committee out there is a judge of absolute quality. They are just ticking boxes off a rubric, more or less. Same for grants, same for jobs; also same for every other profession. None of this determines your worth as a human in any way what so ever. You could get to a noble prize like that, and still feel like \"well I am no Einstein\" or \"yeah, but there is this other guy, who's heaps better and I am actually a fraud\".\n\n\nSuppose you Masters is actually poor quality. Can you learn from your mistakes and use that to do a better PhD? Sure you can. And now you have a handy piece of paper that allows you to apply for a PhD too.  Fantastic!",
      "author": "laakmus",
      "created": 1592914581,
      "upvotes": 109,
      "replies": {
        "fvtiez8": {
          "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvtiez8/",
          "text": "Heading into a PhD next year rather unsatisfied with my honours thesis, and I really appreciated this answer. Thank you.",
          "author": "polluticorn6626",
          "created": 1592972383,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fvqn3ho": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvqn3ho/",
      "text": "After my master’s defense I got drunk on champagne and cried like a baby. I felt all the things you’re feeling now.\n\nIf it’s any consolation, finishing my PhD defense felt GREAT. Like the best drug.\n\nMy only advice is to keep chugging along. Everyone feels that way and the only thing that divides the successful people from the ones who give up is the ability to keep chugging along despite all the setbacks. \n\nAnd, congrats Master!",
      "author": "missdopamine",
      "created": 1592917711,
      "upvotes": 43,
      "replies": {
        "fvtemn3": {
          "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvtemn3/",
          "text": "Hahaha, finishing your PhD thesis you are generally very disillusioned and just ready for the damn thing to be over already. After being flogged by your advisor for 4 or 5 years, you are just ready to be done.",
          "author": null,
          "created": 1592969947,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fvqlo8c": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvqlo8c/",
      "text": "To be honest, I felt that way after I defended my master's.  It was especially hard because most of my classmates were already done and none of my friends or family knew enough to understand the toll that an MA can take. \n\nRegarding PhD,  most places won't care what you actually did nor will they check up on it. They just care that you completed your degree so don't worry too much about the quality of your thesis. I would say you should view it as a learning experience and see where you need to improve. But even then, dont be too hard on yourself! There is a global pandemic and you still passed 😀 So impressive",
      "author": "frankie_prince164",
      "created": 1592916789,
      "upvotes": 17,
      "replies": {}
    },
    "fvqh5v2": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvqh5v2/",
      "text": "My thesis is also on deep learning. I had no background in this topic except for calculus and linear algebra. Initially the learning curve was very steep and I felt very satisfied. But finally when I applied it in my thesis, the work seems extremely half-baked and very simple. My defense is also coming up soon, and I won't be surprised if I feel exactly like you, although I hope to pass. So, don't worry, you are not alone! For now, relax!",
      "author": "KaKi0413",
      "created": 1592913536,
      "upvotes": 13,
      "replies": {
        "fvr8wdp": {
          "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvr8wdp/",
          "text": "If you don't mind me asking, what is it on?",
          "author": "Un_Optimal_Record",
          "created": 1592929247,
          "upvotes": 3,
          "replies": {
            "fvrzpdk": {
              "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrzpdk/",
              "text": "I absolutely don't mind. But to preserve anonymity, I can only say that it's related to an application in engineering science.",
              "author": "KaKi0413",
              "created": 1592942207,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fvqeq26": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvqeq26/",
      "text": "It's completely normal to feel like that. Satisfaction does not radicate in obtaining \"the thing\" but in the process itself. Feeling like you haven't done enough and learning to be productive is part of the process, you're still learning. To be honest, academics in high positions feel like this all the time, coping with those feeling of dissatisfaction is an essential part of academia.",
      "author": null,
      "created": 1592911559,
      "upvotes": 24,
      "replies": {
        "fvqg1g7": {
          "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvqg1g7/",
          "text": "Thank you for your kind words! \n\nYeah, I did learn a lot over the last 6 months. It was fun at times and frustrating other times. I just thought that everything would come together for some glorious thesis defense ... but it didn't. I guess it's okay though.",
          "author": "Un_Optimal_Record",
          "created": 1592912652,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fvqrghz": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvqrghz/",
      "text": "I 100% know your feeling, I can be very self-critical too. Try to go easy on yourself. These are not normal times, you finished your master under extraordinary circumstances. I think even a lot of top quality researchers would struggle to present a good piece of work they have done over the last 6 months. \n\nIf you know how you would have wanted to do things better, then that is already a very good quality for becoming a researcher. The same goes for being honest to yourself, saying this wasn't perfect, because you didn't do X, Y and Z.",
      "author": "physi_cyst",
      "created": 1592920307,
      "upvotes": 9,
      "replies": {}
    },
    "fvqu3ss": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvqu3ss/",
      "text": "I can feel the sadness and the hopelessness in your words. Be strong man life has so much to offer right now.Its okay. life does not happens as we want it to happen. More opportunities of proving yourself will come in future.",
      "author": "Nicelad34",
      "created": 1592921766,
      "upvotes": 8,
      "replies": {}
    },
    "fvr301a": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvr301a/",
      "text": "A master's, or even a PhD, is not your life's work, it is a demonstration of training. And knowing that you could've done better (under different circumstances) says A LOT about your great preparation. These are strange times, so cut yourself some slack and move on to the next bigger, better thing. We never stop learning and improving!",
      "author": "AwkwardAccountant5",
      "created": 1592926360,
      "upvotes": 6,
      "replies": {}
    },
    "fvr3ukh": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvr3ukh/",
      "text": "I felt the exact same way after I defended my PhD dissertation. I also felt like I totally screwed up my masters defense. I know on some level that my negative feelings were a manifestation of imposter syndrome, but it still took me about 6 months of feeling like garbage for my feelings to improve. Just wanted to let you know  you're not alone or unusual in having complicated feelings about this. It's wayyyyy more normal than it might seem and does NOT reflect your actual capabilities or performance. Try to be gentle with yourself-- even if it didn't go exactly how you wanted (and if you're a perfectionist like me, it is impossible to live up to  the expectations you might have set), it is an accomplishment and you never have to do it again!",
      "author": "plspls_win_meowx3",
      "created": 1592926782,
      "upvotes": 5,
      "replies": {}
    },
    "fvrfmft": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrfmft/",
      "text": "Another reason why you might be feeling bad is what is sometimes called post-submission blues. You've been working up to this point for several months (years if you want to count anything before the thesis, too) and you've probably been building up a lot of expectation about that moment. What happens instead is that the pressure is gone and your body can finally have a little break.\nWhen I handed in my masters, I was sure I was gonna have a great time after. Instead I found myself crying under my desk, as I was feeling so bad but couldn't even figure out why that was. I'm sure you've done a great job, so try to convince your inner critic!",
      "author": "matutolypea1903",
      "created": 1592932507,
      "upvotes": 4,
      "replies": {}
    },
    "fvr3m5o": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvr3m5o/",
      "text": "I felt the same way after I passed my dissertation defense. It is really rough and I’m sorry for you.",
      "author": "Noumenology",
      "created": 1592926666,
      "upvotes": 3,
      "replies": {}
    },
    "fvr8huo": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvr8huo/",
      "text": "I felt the same way, actually. My master's thesis hardly had any real depth to it, and it didn't turn out how I wanted at all. I guess in science (I'm not sure if it's similar in your area), sometimes experiments and models don't turn out the way you expected. Models don't always match reality, and that's basically what I had to say in my thesis. I'm not that proud of it, sadly.\n\nBut you passed, so it was good enough in your supervising committee's opinion, and that's what matters. If your supervisor is willing to hire you as a PhD student, then that's good news. That means he/she is happy with your work.\n\nA few people, when I've felt discouraged, have told me that it's only a masters thesis, which in the grand scheme of things is very small in the world of research. Very rarely is a master's thesis something that will be published, so if it's not perfect, no sweat.\n\nGood job on passing. Congratulations!\n\nFeel free to message me if you want to talk more.",
      "author": "ThePurpleHyacinth",
      "created": 1592929048,
      "upvotes": 3,
      "replies": {}
    },
    "fvrbzaj": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrbzaj/",
      "text": "Hi, just letting you know that this is how I felt after my thesis defence for my Masters as well. I had to defend in front of people that weren't from my department so it became even more complicated.\n\nI don't know if this applies for your department, but I had 6 weeks after my defence to add, edit, and proof my paper before official submission. Those 6 weeks actually gave me confidence in my work more than the defence did. \n\nAlso, I don't think you should discredit the work you have done. There is no \"perfect\" thesis. There are gaps. You only get to cover so much material. IMHO the fact that you see those gaps shows more promise than if you thought it was 100% perfect. That's what makes you a good researcher. The \\*want\\* to add/perfect ....",
      "author": "Br-eye13",
      "created": 1592930744,
      "upvotes": 3,
      "replies": {}
    },
    "fvrc9x2": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrc9x2/",
      "text": "I also felt dissatisfied with my masters thesis and also felt like my committee gave me a freebie. Now, a year later, I’m looking back over my project/data for a manuscript. With an extra year of experience in this field, I can now see where my logic was slightly flawed, I can see how I should have processed my data a little differently, I see how I can now make stronger conclusions and reference better papers to support my claims. A masters thesis is the result of your first ~two years of experience with research. You will NOT be an incredible researcher after two years; people spend decades improving their research skills! \n\nI agree with the other comments; your dissatisfaction is just an indication that you know your work had holes, but you didn’t know how to fix them. With more experience, you will learn how to fix those holes (or avoid them entirely) and you will hopefully feel much more satisfied with your work. I’m experiencing that just one year into my PhD program, and it’s very gratifying. Also, sounds like you had some unusual circumstances making your work harder. So don’t be too hard on yourself!",
      "author": "story_monger",
      "created": 1592930889,
      "upvotes": 3,
      "replies": {}
    },
    "fvrk2oe": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrk2oe/",
      "text": "I think you're being too hard on yourself. Completing a research thesis isn't about presenting a perfect piece of research, it's about demonstrating that you can conduct an independent research project within a bunch of constraints. It sounds like your constraints were worse than most people's, so if you did a little less work then it was completely justified. If you completed a satisfactory thesis despite those constraints you should be really proud of yourself.\n\nI do empathise though. I recently got my PhD and I should feel ecstatic, but the best I can manage is feeling relieved. It was not a great process, and I feel like after going through the process of addressing the examiners' criticisms I've actually managed to make the final thesis worse. That thesis will now stand forever as a monument to me taking the easy way out and doing what I'm told instead of sticking to my guns. The good news is that nobody wants to read my thesis anyway!",
      "author": "EmileDorkheim",
      "created": 1592934628,
      "upvotes": 3,
      "replies": {}
    },
    "fvrn7bx": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrn7bx/",
      "text": "Sounds like some imposter syndrome to me.",
      "author": "curiously-peculiar",
      "created": 1592936133,
      "upvotes": 3,
      "replies": {}
    },
    "fvrndyr": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrndyr/",
      "text": "I remember the moment I received news that not only did I pass my MA thesis, I also received honors for it. I relate with you OP because I didn’t feel special at all and was surprised I even passed. It took me at least a year afterwards to tell myself that I did a good job and that I deserved it. Don’t let impostor syndrome get the best of you, you deserved this. Congratulations!",
      "author": "GungaDough",
      "created": 1592936221,
      "upvotes": 3,
      "replies": {}
    },
    "fvrpdcl": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrpdcl/",
      "text": "I felt the same way.  I did not get to do the thesis I wanted, and my analysis was not IMO fully complete.  My thesis was also 200 pages and the full analysis I wanted to do would have added about 300 more pages.  The committee called it for it and cut the 2/3rd of scope.\n\nI will say this.  The bad researchers I talked to or worked with almost never see problems with their work.  Good researchers do and work hard to address those gaps or note that they do exist right now and try to estimate the effects they may have on the results.  It is really hard to teach this style of self-awareness as well.  So if you want that PhD I would say go for it.  Seem to have the mindset to do good Honest research.",
      "author": "engelthefallen",
      "created": 1592937176,
      "upvotes": 3,
      "replies": {}
    },
    "fvr9xjd": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvr9xjd/",
      "text": "I never enjoyed these kinds of things.  For me the best thing about research was discovering something new.",
      "author": "dampew",
      "created": 1592929745,
      "upvotes": 2,
      "replies": {}
    },
    "fvrdit9": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrdit9/",
      "text": "(Sometimes) Dissatisfaction can be your friend. It can be the intuition telling you there's more to do, there's more to pursue. Don't let it discourage you -- it's a way of saying -- The future is a blue ocean.",
      "author": "gnramires",
      "created": 1592931491,
      "upvotes": 2,
      "replies": {}
    },
    "fvrefh3": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrefh3/",
      "text": ">I did not do enough research work [...] my work is insufficient\n\nThat's not your decision to make.\n\nI felt the same way when I got my master's, and this was something I had to realize. It's not up to me to say if I \"did enough\" or if the work was \"good enough\" to deserve a master's. It's your committee's decision.",
      "author": "ProbabilisticWorld",
      "created": 1592931932,
      "upvotes": 2,
      "replies": {}
    },
    "fvrlp0h": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrlp0h/",
      "text": "I would be worried if you didn't feel this way. It's unlikely that someone would do truly significant work in their masters and that there aren't others better than you. I think your mindset has more positives than negatives",
      "author": "dtv98",
      "created": 1592935395,
      "upvotes": 2,
      "replies": {}
    },
    "fvrqhfh": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrqhfh/",
      "text": "I think the fact that you pulled something together despite the pandemic and your server problems shows that you are dedicated to your research and able to overcome obstacles. You can always go back to the work you were doing and improve upon in later. Congratulations on passing!",
      "author": "throwaway-soph",
      "created": 1592937716,
      "upvotes": 2,
      "replies": {}
    },
    "fvrrz0r": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvrrz0r/",
      "text": "I felt the similarly after my dissertation defense. Almost 30 years passing helps to put things into perspective. Some feelings, however, never go away and you just end up using them for extra motivation.\n\nCongratulations on your defense. The overwhelming number of people do not even earn a bachelors degree, let alone what you have done. Your committee did not give you a pity pass. You earned it.",
      "author": "sigholmes",
      "created": 1592938447,
      "upvotes": 2,
      "replies": {}
    },
    "fvs87bq": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvs87bq/",
      "text": "[Deleted]",
      "author": null,
      "created": 1592946365,
      "upvotes": 2,
      "replies": {}
    },
    "fvsaaul": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvsaaul/",
      "text": "I think it’s normal to feel insecure about your quality of work on such a challenging task. Take pride in your accomplishment. Not many who begin their program follow fruitfully to the end. We are our own worst critics but remember that nobody truly gets a “free pass.” The evaluators found merit in your work. There’s always the possibility of extending your research for your own personal satisfaction, if you choose to. I believe learning is a lifelong process, so celebrate this milestone and rest assured that you did something that great. Congratulations!",
      "author": "vfussner",
      "created": 1592947401,
      "upvotes": 2,
      "replies": {}
    },
    "fvsj3j5": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvsj3j5/",
      "text": "This sounds like Imposter Syndrome! Your committee would not pass you if you didn't deserve to pass.  Don't let imposter syndrome rob you of your hard earned success.  \n\nCONGRATULATIONS! \n\nDo something nice for yourself to celebrate, you deserve it!",
      "author": "TourmalineTart",
      "created": 1592951875,
      "upvotes": 2,
      "replies": {}
    },
    "fvsk3ku": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvsk3ku/",
      "text": "I'm in exactly the same position as you but a different field. Expect to be jobless for a couple months post corona. Just do your best to not blame yourself for being jobless. These are tough times.\n\nPS: had to wait 7 minutes to be able to reply this, that's how dedicated I am to let you know you have value and aren't responsible if you won't immediately get a job.",
      "author": "Ltrfsn",
      "created": 1592952406,
      "upvotes": 2,
      "replies": {}
    },
    "fvsnar3": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvsnar3/",
      "text": "The imposter syndrome never really goes away does it :( Just know that they wouldn't have passed you if you were really that bad. And if they were giving you a freebie, you would know. Professors are not really silent or subtle if they feel a student is extremely behind. You are good, and you have the degree which is what matters :)",
      "author": "cm0011",
      "created": 1592954123,
      "upvotes": 2,
      "replies": {}
    },
    "fvt7zei": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvt7zei/",
      "text": "Sounds like a burnout. Take some downtime, unwind, recharge, and in the meantime start writing a list of what you have accomplished. Sometimes, we tend to focus on the negative and forget the successes. Think back about things you've learned, questions you've answered, systems you've built or models you have tried, and you can start by: \"completed MS\".",
      "author": "monkeywrenchuser",
      "created": 1592965984,
      "upvotes": 2,
      "replies": {}
    },
    "fvtk61k": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvtk61k/",
      "text": "Congratulations. I felt the same after I finished my PhD, even though I had a job at the time. \n\nFor me, it was the end of a project that I had committed to so totally, and that was it, the end. It felt like a loss of purpose, and a realisation that it wasn’t finished, that there was more I could have done, but I wouldn’t get to do it.\n\nIf you want closure, review your Thesis and make a list of all the things you would have done to make it better if you had the time. If you get asked about your thesis in an interview, or for academia, it will do you well to say what you achieved, what you didn’t managed to do, and what you would do to improve it if you had more time or different circumstances. \n\nThe award is enough, it’s the point, a mark that you had done research. The extra work you did after can bring closure, and show that you are a good researcher as well. The mark of a good researcher is not producing the perfect thesis, but showing you can go above and beyond, and are committed to bettering yourself. This is how you can demonstrate those skills.",
      "author": "tAoMS123",
      "created": 1592973580,
      "upvotes": 2,
      "replies": {}
    },
    "fvqbul8": {
      "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvqbul8/",
      "text": "[removed]",
      "author": null,
      "created": 1592908996,
      "upvotes": -26,
      "replies": {
        "fvr3ir1": {
          "link": "/r/AskAcademia/comments/hec1mr/although_i_passed_my_masters_thesis_today_it/fvr3ir1/",
          "text": "Username checks out",
          "author": "SuperficialGloworm",
          "created": 1592926620,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}