{
  "sid": "gxcxrk",
  "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/",
  "title:": "TIFU. How do I recover?",
  "text": "Long story short and some details intentionally vague:\n\n* PhD student\n* invited to present at prestigious conference\n* conference organizers asked me to pay travel expenses and then submit reimbursement\n* conference cancelled (COVID), said they can no longer reimburse\n* this is where I fucked up: I need the money badly. I got the final \"no\" at an especially bad moment in my life. I sent an email that explained in gory detail that on top of everything else going on, my mom ODed and my younger sister is in foster care, and angrily demanding they reimburse me. I know I am in the right but that it was not the right way to handle it.\n* conference organizers didn't even reply to me, forwarded the email to my PhD supervisor and director of graduate studies and told them to \"address\" my \"misbehavior\"\n* PhD supervisor said he is \"disappointed\" and we need to meet with graduate school to discuss \"corrective action\"\n* I have talked to the ombudsman's office and they are pretty supportive and helpful\n* what I really need help with is: I regret that email so badly. I regret unloading all my pain on people who have nothing to do with it and more than that I regret airing my dirty laundry so that now the whole graduate school knows it. I know my PI is not really a nice guy, and I don't expect any sympathy from him. **How do I look these people in the eye knowing that everyone now thinks of me as a trashy loose cannon instead of the promising young student I was a few weeks ago?**",
  "author": "Spiritual-Web4426",
  "created": 1591390683,
  "updated": 1634080603,
  "over_18": false,
  "upvotes": 239,
  "upvote_ratio": 0.97,
  "comments": {
    "ft0l3hv": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0l3hv/",
      "text": "Wait, so they expected you to just eat it on the expenses you had already paid for to attend the conference?",
      "author": "BabaYagasFamiliar",
      "created": 1591392672,
      "upvotes": 386,
      "replies": {
        "ft0lmiv": {
          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0lmiv/",
          "text": "This, and somehow OP thinks he has effed up?",
          "author": "RegalSniper",
          "created": 1591392944,
          "upvotes": 245,
          "replies": {
            "ft0m0ji": {
              "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0m0ji/",
              "text": "As they say, two wrongs don't make a right. I think they were wrong to refuse the reimbursement, AND wrong to contact my supervisor. But I was wrong to send that email.\n\nAnd the really fucked up thing about the whole situation is, even if I had done literally nothing wrong, I have no power and I still feel humiliated.",
              "author": "Spiritual-Web4426",
              "created": 1591393141,
              "upvotes": 160,
              "replies": {
                "ft18mbp": {
                  "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft18mbp/",
                  "text": "Depending on tone and content, you may have been wrong to send that email - I can't say without seeing the full back-and-forth (which I do not want to do!).\n\n**That said**, the idea of refusing to reimburse *a fucking graduate student* **promised** costs and then reporting them to their supervisor when they complained is, frankly, beyond the pale to me.\n\nFuck those organizers. Know that they don't make up the entirety of the academy and that folks like that should be avoided.\n\nAlso, long term, you'll be fine if you keep your head up and do good work. One time, long ago, I accidentally sent a ***very personal*** email to my entire grad program. It was awful for a couple weeks and then fine.",
                  "author": "WrestlingStuffGuy",
                  "created": 1591403519,
                  "upvotes": 280,
                  "replies": {
                    "fuky6ue": {
                      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/fuky6ue/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1591953902,
                      "upvotes": 3,
                      "replies": {
                        "fumbdie": {
                          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/fumbdie/",
                          "text": "You're talking about a program, not a conference/workshop/event. \n\nI'm not saying whatever happened to you isn't bad, it's just a fundamentally different situation.",
                          "author": "WrestlingStuffGuy",
                          "created": 1591983322,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ft1dom7": {
                  "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1dom7/",
                  "text": "What did you tell the organizers, that you were going to each of their houses in turn and eat their cats?",
                  "author": "aelendel",
                  "created": 1591405720,
                  "upvotes": 57,
                  "replies": {
                    "ft1hkob": {
                      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1hkob/",
                      "text": "No, I didn't threaten them in any way, it was more like, \"how can you do this to me when I'm already suffering so much, here are all the horrible things that are wrong with my life.\"",
                      "author": "Spiritual-Web4426",
                      "created": 1591407432,
                      "upvotes": 86,
                      "replies": {
                        "ft1jtox": {
                          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1jtox/",
                          "text": "Oh, gee. They're just playing power games with you then. You showed weakness and they want to consume you alive. The good news is they'll \"give you another chance\".  The bad news is as long as you know them, they'll use your emotions to control and bully you.",
                          "author": "aelendel",
                          "created": 1591408428,
                          "upvotes": 129,
                          "replies": {
                            "ft2iu1b": {
                              "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft2iu1b/",
                              "text": "Ugh-  I hate that this is true.  I hated graduate school so much because I just felt like I was continually shit on and treated like nothing while I did all of my supervisors' work and could barely afford to feed myself.  I remember driving a two-hour commute on bald tires, hoping my car made it, to work in a county hospital for $10 an hour for my narcissistic antisocial supervisor. \n\n I'm so sorry OP.  You will get out, move on, and hopefully be a better advisor than you got.  In the meantime, it does just really suck, and I hate that this is part of academia's perverse hazing.",
                              "author": "texcc",
                              "created": 1591425384,
                              "upvotes": 27,
                              "replies": {}
                            }
                          }
                        },
                        "ft1j400": {
                          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1j400/",
                          "text": "So can we then consider the cat eating? Or is that off the table?",
                          "author": "hellyabruther",
                          "created": 1591408111,
                          "upvotes": 36,
                          "replies": {
                            "ft4mh8v": {
                              "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft4mh8v/",
                              "text": "With owners like those, surely the cats have suffered enough 😂",
                              "author": "Spiritual-Web4426",
                              "created": 1591454157,
                              "upvotes": 15,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "ft2chop": {
              "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft2chop/",
              "text": "Goes to show how often Post-grads (self included) exhibit symptoms as if they're the victim of abusive relationships",
              "author": "Diddly_eyed_Dipshite",
              "created": 1591422193,
              "upvotes": 21,
              "replies": {}
            }
          }
        },
        "ft0lfqd": {
          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0lfqd/",
          "text": "Yeah, they sent me some legalese showing that it was part of the agreement and they were legally within their rights to do so, I hope you don't mind if I leave it there, I'd rather not start making anything identifiable",
          "author": "Spiritual-Web4426",
          "created": 1591392845,
          "upvotes": 59,
          "replies": {
            "ft0m07j": {
              "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0m07j/",
              "text": "That's fine, I was just wondering because that seems really unprofessional and wrong on their part. I suppose writing an apology and explaining the stress you were under might help. That's probably the most you can do and just move on, let bygones be bygones. If those people are shitty enough to not have any sympathy or understanding, then just try not to worry about it. Can't let the opinions of assholes bring you down. It'll probably blow over eventually regardless.",
              "author": "BabaYagasFamiliar",
              "created": 1591393137,
              "upvotes": 82,
              "replies": {
                "ft0my0t": {
                  "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0my0t/",
                  "text": "Thanks a lot. I sent an apology email as soon as I realized how badly I had fucked up. I half-expected they'd respond with something about how everyone's going through a lot right now, we're all in this together, that sort of thing. Instead, total silence.\n\nIt helps to remember that this is not going to stay this uncomfortable forever. I was hoping to apply for faculty positions at institutions that 2 of the people involved work at (in 2 years or so) and I'll probably never be comfortable showing up at that meeting again....but at least things with my supervisor will probably be okay after we have our meeting with the graduate school next week. The ombudsman basically said (in different words) to expect them to tsk tsk me and have no real consequences.",
                  "author": "Spiritual-Web4426",
                  "created": 1591393624,
                  "upvotes": 49,
                  "replies": {
                    "ft2j90w": {
                      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft2j90w/",
                      "text": "Don't worry too much about the future.  Institutions are going crazy right now- who knows if those people will have jobs in two years.  I highly doubt they'd remember your name in two years- if you don't bring it up, I'd be really surprised if they put two and two together.  And that's IF they're on the search committee or tapped in enough to be paying attention otherwise.  Same thing with the meeting- no one will remember in a matter of a month.  And, as others have said, if they're really so callous to not recognize the extreme mental, financial, and physical stress COVID has had on a great many people, and have compassion for that, who gives a fuck what they think.",
                      "author": "texcc",
                      "created": 1591425558,
                      "upvotes": 24,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ft11whn": {
              "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft11whn/",
              "text": "I don’t know about legally, but morally, they’re absolutely in the wrong. Whatever you paid is surely a pittance to them, and they’re well within their ability to refund you. I think you had every right to be furious.",
              "author": "guildoflilies",
              "created": 1591400566,
              "upvotes": 54,
              "replies": {
                "ft1bht8": {
                  "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1bht8/",
                  "text": ">pittance to them\n\nIt's definitely possible that the conference is insolvent. Many conferences can only afford to pay expenses like travel reimbursements after they've collected fees, which won't happen.",
                  "author": "rlrl",
                  "created": 1591404770,
                  "upvotes": 24,
                  "replies": {
                    "ft3t327": {
                      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft3t327/",
                      "text": "^ can confirm. the conference I'm involved with is insolvent, especially as sponsors are backtracking on their financial commitments left and right.",
                      "author": "bennyandthef16s",
                      "created": 1591442938,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ft0lkvb": {
          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0lkvb/",
          "text": "Many would argue that you can cancel hotels, and get a credit for airfare, ignoring the fact that the credit is of no use if you had no reason to fly that airline but to go to that conference.",
          "author": "ThePhysicistIsIn",
          "created": 1591392920,
          "upvotes": 44,
          "replies": {
            "ft0w8w4": {
              "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0w8w4/",
              "text": "Everyone I know got a refund back to their credit card for all travel expenses. Hotels cancelled, AirBnB refunded, conference fees refunded, and flights were cancelled and refunded (though United initially did evouchers and you had to hassle them to get a cash refund). The credit also turns into a cash refund after a year, though that's obviously less ideal.",
              "author": "ivyprof",
              "created": 1591398034,
              "upvotes": 27,
              "replies": {
                "ft0zefl": {
                  "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0zefl/",
                  "text": "Not me. I got vouchers for everything, and sadly my hotels.com registration was non-refundable.\n\nNow I have a voucher for an airline that doesn't go anywhere I want to that expires in a year.\n\nWoop woop.",
                  "author": "ThePhysicistIsIn",
                  "created": 1591399436,
                  "upvotes": 35,
                  "replies": {
                    "ft20z3w": {
                      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft20z3w/",
                      "text": "I am the same.  Not refundable hotel booking - they extended credit to september but that ain't going to happen so it will be down the drain.  And I have two return sets of flight credit (asia to europe) that are on voucher at the moment.\n\n&#x200B;\n\nHowever, the loss is more annoying than dreadful, but what happend to OP is beyond the pale.",
                      "author": "Life_time_learner",
                      "created": 1591416288,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                },
                "ft0zm18": {
                  "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0zm18/",
                  "text": "You got a cash refund from United?! I tried so hard, and I couldn't get it they just kept being like \"Well now you have two years to use your voucher since we changed the policy\"\n\nIt's okay though because my university put in a new policy that cancelled flights can be reimbursed if the travel certificate info is provided to the university for use",
                  "author": "Littlefingersthroat",
                  "created": 1591399531,
                  "upvotes": 16,
                  "replies": {
                    "ft109c6": {
                      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft109c6/",
                      "text": "Yeah I actually got reimbursed too on my Visa from United. I applied for a refund about a month before my flight, but the system kept saying it had no record for me every time I tried to check on the status. So as a precaution, I cancelled my flight. Then I got the reimbursement about a month later.",
                      "author": "JAKSTAT",
                      "created": 1591399819,
                      "upvotes": 7,
                      "replies": {
                        "ft10unl": {
                          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft10unl/",
                          "text": "Damn, I had to wait 2 months to hear back on my refund request and I cancelled in March because the conference I was going to was cancelled.",
                          "author": "Littlefingersthroat",
                          "created": 1591400090,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ft0kh2o": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0kh2o/",
      "text": "Honestly, it was not appropriate for the conference organizers to adress your PhD supervisor",
      "author": "ThePhysicistIsIn",
      "created": 1591392357,
      "upvotes": 440,
      "replies": {
        "ft0lbdn": {
          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0lbdn/",
          "text": "Thanks, it helps knowing other people think so as well. That said, it seems to me like the main conference organizer who did this is an academic bully, which unfortunately I am acquainted with because my PI is too. There is a lot of blame and nastiness to go around. I just want advice on how to get through this without this horrible pit in my stomach and maybe even recover my reputation.",
          "author": "Spiritual-Web4426",
          "created": 1591392784,
          "upvotes": 94,
          "replies": {
            "ft0r84n": {
              "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0r84n/",
              "text": "Sorry, I don't have much advice for that. I just wanted to let you know that however unprofessional it might have been to spill your heart to the conference administrators, they're not to go behind your back and talk to your supervisor like a teacher calling a parent when their child misbehaves.",
              "author": "ThePhysicistIsIn",
              "created": 1591395646,
              "upvotes": 106,
              "replies": {}
            },
            "ft1dec3": {
              "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1dec3/",
              "text": "Everyone in the entire world with two licks of sense knows you are fine. Don't worry about the people with no sense. You're still a promising young student. I'm going to tell you something, it's okay to say mean things to people.   \n\n\nNot sure where you are at in the process, but some things to consider:  \n\n\n1. go to a different program. period. \n2. demand corrective action against your PI from the department and the ombudsman. It is not acceptable for him to call the department because you said something mean to people who lied to you. Completely insane. \n3. Ask the ombudsman if the university has resources to help you sue the conference organizers who lied to you. A stern letter from a campus lawyer might get action.\n4. The ombudsman will be supportive and helpful but is mostly there to make you feel calm and realize doing anything is a hassle. Go to them with a specific list of actions you want to take. Be very clear. ask how to do them. If they say they'll get back to you, say--this is pretty obvious stuff, so you want a meeting with someone who knows the answers to obvious questions. \n5. and seriously, different program.",
              "author": "aelendel",
              "created": 1591405595,
              "upvotes": 75,
              "replies": {}
            },
            "ft1p062": {
              "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1p062/",
              "text": "You sound like you could use some support, allies, and perspective. Do you have a dissertation committee? Any other faculty you like and trust? I am not saying to go to them to rat-out your advisor for being a bully or unsupportive, but rather just be open about the situation and ask for their outside impressions and advice.\n\nBe completely frank with them about everything, the email itself and your regret, as well as the reactions of the others. Honestly, these are the people you should be going to, not a bunch of yokels on the internet. This sub is one to be particularly wary of in situations like yours. While I think the scenario you layout seems pretty inarguably just you being a bit impulsive and stupid but the organizers and your advisors being petty and bullies. However, we don't know the details of the situation or any of the players. Go to people who do.\n\nYour reputation will surely recover in time, I think it may become a bit of legend in your lab or among your cohort, but if you learn to laugh about it and get ahead of it with your own version of the story even that part won't feel so bad.\n\nPeople do crazy stuff when they are young and stupid. Being a PhD student is the equivalent of being a teenager as a professional and you make all sorts of mistakes. There was a PI at one of my institutions who, as a grad student, cut out pictures of dicks from porn magazines, made and xeroxed a \"connect the picture\" game with photos of all the faculty on one side of the page then put it in the mailboxes of all the faculty. (This story was legend at both the institution he worked at and where he went to grad school, I know this because I was at both and heard the same story both places.) He got a very prestigious position right out of grad school and became - quite literally - rich and famous. If he could get out from under that one, one bitchy email won't sink you either.",
              "author": "survivalothefittest",
              "created": 1591410736,
              "upvotes": 27,
              "replies": {}
            }
          }
        },
        "ft1566o": {
          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1566o/",
          "text": "And the odd thing is that OP's PhD supervisor seemed to take this outside complaint seriously - very seriously, so seriously that there will need to be disciplinary action. This seems highly irregular. I wasn't the favorite in my PhD lab by a long shot, but if someone forwarded a crabby email to my advisor saying he should take care of this problem child, I think he would have basically ignored it. He would have surely pulled me aside to let me know he got the email and maybe have a \"teaching moment\" about professional behavior, but then he'd leave it at that.\n\nI do have a lingering thought as to what exactly did OP write, did they threaten to hurt someone? Otherwise, the conference folks sound like a bunch of tattletale babies. As a conference organizer, I would have probably just sent an email like OP describes to the others and had a good laugh (sorry, OP).\n\nEither what OP said in this email was so way out of line that it far transcended the usual outraged and inappropriate student email (and who among us has not received one of those) or, frankly, all the \"adults\" in the situation are a acting pretty immature.",
          "author": "survivalothefittest",
          "created": 1591402055,
          "upvotes": 66,
          "replies": {}
        }
      }
    },
    "ft0n4nn": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0n4nn/",
      "text": "This is really unprofessional behavior on the part of the conference. Are you 100% positive this wasn't one of those shady conferences that are really just a way to extract money from research grants? \n\nIn any case, you just need to write an email to the organizers explaining that you think your email was not up to your professional standards and apologize for allowing yourself to send an email while you were frustrated. Explain the situation to your advisor professionally and stress that you regret your behavior.",
      "author": "johnnydaggers",
      "created": 1591393719,
      "upvotes": 125,
      "replies": {}
    },
    "ft14t7g": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft14t7g/",
      "text": "Professor here. Unless you called these people inappropriate names, I don't think you were wrong to send that email.\n\nAnd honestly, even if you did, CLEARLY your circumstances are above and beyond exceptional, and their behavior is objectively shit. So, if you were my student, I'd empathize with how embarrassed you felt, but I would actually be reassuring you that people make mistakes; you're under an extraordinary amount of stress; and it will eventually blow over.\n\nPerhaps I'd make noises at the conference organizers about \"disciplining\" you, but that would be more so for your benefit. They'd be a bit less likely to badmouth you or do something else petty if they thought you were getting formally reprimanded in some way.\n\nIn reality, I'd stand beside you and **try to find some funding source to help you recoup those losses.** Has it not occurred to your advisor to do this? You still need the money!\n\nThe only way I could understand your advisor's response is if he **1)** cares a lot about his ego and sees all students as extensions of that ego\\* and **2)** if you threatened to harm those people. The latter would be pretty inexcusable, but *I'm not sure what the hell \"corrective action\" even means for graduate students.*\n\nIf you've already expressed remorse once to the organizers and your advisor, then try to forget about this nightmare.\n\n\\*While students do somewhat reflect on us as researchers, most of us understand that every once in a while you get someone who's a difficult case (**not you**). We don't assume that our colleague encouraged or trained a difficult student to be that way. After all, you're fully formed adults by the time you get to us.\n\nGood luck with everything.",
      "author": "synthesis-synthesis",
      "created": 1591401900,
      "upvotes": 60,
      "replies": {
        "ft397uh": {
          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft397uh/",
          "text": "This is exactly what my current advisor and my undergrad advisor would do. They would have helped me find some funding source and at the same time would have talked to conference organisers about them not honouring their commitments. Who will go to such a conference in future if they act like this. \n\n  While sending an email and unloading on to them was a bit unprofessional, I don't think you are in the wrong. If I was in your place, with how the advisor is acting, I would certainly rethink my advisor choice.",
          "author": "Intrepid_eques",
          "created": 1591435135,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ft0r73z": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0r73z/",
      "text": "I know it's had to imagine this as a PhD student, but those conference organizers need to be told to eat shit - albeit in a slightly more diplomatic way.\n\nUnloading a bunch of personal information in an email was probably not the wisest decision, but it is far outweighed by conference organizers expecting graduate students to just absorb the travel costs of a cancelled conference.\n\nEven worse they ignored you, involved your advisor, and refer to your situation as misbehavior. Is your advisor buddy-buddy with the Society/conference organizers? \n\nThis seems like highly unprofessional behavior.",
      "author": null,
      "created": 1591395633,
      "upvotes": 90,
      "replies": {
        "ft1xi30": {
          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1xi30/",
          "text": "> those conference organizers need to be told to eat shit - albeit in a slightly more diplomatic way.\n\n\"Dear Drs., please eat this Doo Doo.\n\nRespectfully, OP\"",
          "author": "a_large_plant",
          "created": 1591414635,
          "upvotes": 21,
          "replies": {
            "ft24zxb": {
              "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft24zxb/",
              "text": "We're academics here!\n\n\"Dear professors, please consume this excrement,\n\nOP\"",
              "author": "justryingtokeepup",
              "created": 1591418263,
              "upvotes": 29,
              "replies": {}
            }
          }
        }
      }
    },
    "ft0ojxs": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0ojxs/",
      "text": "I understand that you might have kiss some boots to make things right, but honestly don't beat yourself up about this. Was it a bit unprofessional? Sure. But what the conference organizer did, first refusing to reimburse you and then forwarding your email, was far worse in my books. You are a student and it sounds like you are a good person going through a really hard time. What's their excuse for the way they acted? No decent human in your department will think poorly of you for this.",
      "author": "naughty_bunny",
      "created": 1591394395,
      "upvotes": 66,
      "replies": {}
    },
    "ft0qwt0": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0qwt0/",
      "text": "You acted like a hothead, but not without reason.  The conference screwed you.  They can and should reimburse your expenses.  Every conference I have been associated with would have done everything possible to at least make student participants whole in this situation.  None would have have stooped so low as to involve your advisor.  My advice is to just let it go.  You weren't entirely wrong, but it's a battle you can't win.  As long as you don't regularly make a practice of behaving like a hothead or getting worked up when the topic comes up, people will forget about it.  I can't imagine there being any real consequences from this.  I know that our Graduate Dean would laugh if someone brought this to him.",
      "author": "bigrottentuna",
      "created": 1591395503,
      "upvotes": 37,
      "replies": {}
    },
    "ft0t2nk": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0t2nk/",
      "text": "I think the best approach is not to simply adopt this effusively apologetic disposition, which is an overcorrection on your part. Part of becoming a scholar is to stick up for yourself. If I were going to have a meeting with your PI and some director, I would say something to the effect that you regret how you responded inappropriately, but not that you did respond; that the conference organizers left you stranded, and that whatever issue they have is with you and not your PI, and that contacting them was inappropriate on their part. I would conclude by appealing to everyone's common humanity, that in the current reality that is 2020 people will be in difficult situations and need a little extra grace, especially financially vulnerable people like graduate students.",
      "author": "narwhal_",
      "created": 1591396522,
      "upvotes": 37,
      "replies": {
        "ft47p1n": {
          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft47p1n/",
          "text": "THIS is EXACTLY what you should do.",
          "author": "natsteel",
          "created": 1591448705,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ft0v7iv": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0v7iv/",
      "text": "Yo. Fuck those conference organizers. They may legitimately be unable to help you, and you may unfortunately suffer the consequences of the act of god/force majeure/whatever COVID19 counts as, but they as organizers are the ones failing to reimburse you fail travel you would have otherwise taken. Emailing your supervisors was grossly inappropriate.  If airing stupid grievances is fair, you damn sure better publicly post how badly they fucked you over and email every person in their respective departments suggesting corrective action. (to be clear don't do this).\n\nHonestly, the organizers and your PI all sound like shit people, hopefully your DGS or someone else in a position of relative power will call them out.",
      "author": "FarKaleidoscope9",
      "created": 1591397537,
      "upvotes": 29,
      "replies": {}
    },
    "ft1cllc": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1cllc/",
      "text": "Own it with your head held high. Apologize for the tone but don't regret what you said. You aren't at fault and it doesn't make sense they contacted your school and PI. That has nothing to do with them.",
      "author": "supawoman2k2",
      "created": 1591405242,
      "upvotes": 7,
      "replies": {}
    },
    "ft1i00i": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1i00i/",
      "text": "You sent an unprofessional email during a remarkably stressful time. You're a PhD student. You are in many ways a professional peer and held to professional standards. But you're still a student, and honestly, it's your PhD advisor's and grad director's job to still be mentoring you and helping you navigate these kinds of situations. \n\nFor what it's worth, colleagues who were on conference planning committees during covid-cancellation season have lots of stories about stressed-out participants who were demanding reimbursements and more. Most of them weren't grad students.",
      "author": "honeywort",
      "created": 1591407611,
      "upvotes": 6,
      "replies": {}
    },
    "ft1ogqy": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1ogqy/",
      "text": "academia needs more people that will say it like it is.",
      "author": null,
      "created": 1591410496,
      "upvotes": 6,
      "replies": {}
    },
    "ft1stmt": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1stmt/",
      "text": "Be proud. Sucks they forwarded it, but you didn't lie. You didn't cheat. You did something you regret out of desperation. That does not make you a bad person. This will not ruin your life.  \n\n\nYou were frustrated. Tuck your tail, admit fault, and take it from there. Chin up. You've got this.",
      "author": "93PercentSodiumAzide",
      "created": 1591412454,
      "upvotes": 6,
      "replies": {
        "ft42mn3": {
          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft42mn3/",
          "text": "Actually the line ‘regret but did it out of desperation’ is a good one to use in the letter of apology... It is exactly what it is. Don’t sweat it (and for each line of ‘I am truly sorry’, say out loud ‘I’m actually not’. That helps).",
          "author": "balletowoman",
          "created": 1591446966,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ft21tfi": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft21tfi/",
      "text": "You didn’t do anything wrong. Your department should be making sure you are ok, not reprimanding you.\nTake care of yourself. You didn’t do anything wrong.",
      "author": "milatti",
      "created": 1591416693,
      "upvotes": 6,
      "replies": {}
    },
    "ft0n8v4": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0n8v4/",
      "text": "I'm very sorry you are going through this horrible situation. You acknowledge that you made a huge mistake, I think it is right. I don't know what you wrote in that email and if it was bad enough to justify they don't show any sympathy for what you are going through, although I am not that surprised considering most people in academia are from a very privileged background and are not likely to understand at all what you are going through. Anyways, here I what I would do if I were you:\n\nI think you should first write to the airline and hotel to politely ask for reimbursements. You are not the only one cancelling travel right now.\n\nYou should then write to the conference organizers saying that you are very sorry for your email. That you are going through a very rough time right now but it is no excuse for what you said in that message. That you took action to be reimbursed by the airline etc. and shouldn't have burdened them with your personal issues. That you are again very very sorry.\n\nSend a separate message to your advisor to say that you are sorry you got them involved in all of this and that you sent an apology message to the organizers. \n\nYou could ask the ombudsman to review these emails if they seem open to it. \n\nAfter that, keep your head up and power through. Time will pass and they will forget about it. Remember that you're a lot tougher than most of your colleagues and will get over this. Continue doing awesome work, that will be what people will remember in the end.",
      "author": "splashingseal",
      "created": 1591393778,
      "upvotes": 15,
      "replies": {}
    },
    "ft0yfv0": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0yfv0/",
      "text": "Here to add that telling a grad student they couldn’t reimburse expenses was totally, wildly out of line. COVID creates a lot of complications with funding and reimbursements (I’m still sorting out some of the effects on my grant months later), but one of our obligations as faculty is absolutely to protect students from the fallout of that.\n\nThey might have been in a position where doing the right thing was hard, and might have had to send you an email saying they were trying to sort stuff out but asking you to investigate other options. But just telling you no and washing their hands of it was seriously not okay.\n\nIt sounds like you didn’t handle it great, but the underlying offense is theirs, and trying to shift the blame for you for not calling them out as nicely is you could have is bullshit.",
      "author": "elseifian",
      "created": 1591399008,
      "upvotes": 17,
      "replies": {
        "ft1z6vk": {
          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1z6vk/",
          "text": "Right. I had a very expensive flight to Africa booked for mid-March, which I had put on my credit card. Delta's default position at that time was to offer airline credit instead of a cash refund. I did not want or need $2000 Delta bucks, I needed $ in my bank account. My department told me to request a real refund, but if Delta didn't come through, they would reimburse me anyway. My dept also reimbursed my visa fee even though obviously I didn't take the trip.\n\nLuckily Delta gave me the actual refund. But my dept handled it the way this conference should have handled it: politely ask if you can recoup your costs from the vendors and offer to reimburse anything that doesn't get refunded.",
          "author": "woshishei",
          "created": 1591415430,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ft12k1v": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft12k1v/",
      "text": "This is a tactic, conscious or not. When a system is broken and no one is going to devote resources to fixing it, the only alternative is to 'criminalize' those suffering from it and showing the brokenness. How inconsiderate of you to be poor. (Sorry, I'm mad about politics and mad about how you were treated. However you proceed, you are not the person who owes an apology here.)",
      "author": "vortex_time",
      "created": 1591400867,
      "upvotes": 11,
      "replies": {}
    },
    "ft0waf9": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0waf9/",
      "text": "Yes, getting angry was your mistake, but them refusing to reimburse is absolutely unacceptable.\n\nOk first things first, check directly with the hotel and airline, assuming you booked with them directly.  Many airlines are offering refunds and they legally have to if the flight was cancelled or changed by more than an hour, which is very likely given how many flights have been cancelled.  Check first and then call them and tell them you want a refund due to flight [number] changing from [original departure] to [current departure].  Don't give them any backstory- they have to refund you.\n\nNext check with the hotel.  Hotels are being remarkably flexible and should at least give most of your money back.  They're not as bad as airlines for sure.\n\nThe above only applies if you booked directly with the airline and hotel.  If you didn't, contact whatever travel agent you used.  If you gave the organizers money for them to book it...well don't do that again and you are kinda screwed.  The registration?  Surely they should refund that and you're not the only attendee complaining, right?\n\nContinue to work with ombudsman's office, and try to make things right with your supervisor but only following their advice.  Don't now grovel to your advisor.  Also, don't worry what the graduate school thinks.  They deal with hundreds of students and the ones who don't have messed up lives are the exceptions, not the rules.  The biggest thing is to try to get your refund and make the relationship with your supervisor better as much as you can, so that he doesn't screw you over in the future.",
      "author": null,
      "created": 1591398055,
      "upvotes": 14,
      "replies": {}
    },
    "ft1fdgf": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1fdgf/",
      "text": "I'm more concerned that the conference organizer went straight to your supervisor. I've heard academia is petty, but come on.",
      "author": null,
      "created": 1591406458,
      "upvotes": 6,
      "replies": {}
    },
    "ft1r5f3": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1r5f3/",
      "text": "Am I the only one that doesn’t understand why OP sending that email was a ‘bad’ thing? I don’t understand. Did you threaten them or something or what? I don’t see why your PI or anyone with half a brain would not be sympathizing with you in this situation unless there are key things about the contents of the email you are leaving out..",
      "author": "PeptoBisma",
      "created": 1591411700,
      "upvotes": 4,
      "replies": {
        "ft4ak0j": {
          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft4ak0j/",
          "text": "Because in academia we’re supposed to act like we have no private lives (or, at least, like our private lives are either fine or such a small part of our life relative to our work life). First, part of it comes from the historical class dynamic of the profession’s 19th-century Puritanical/Brahmin origins which sees talking about personal matters at all as uncouth. Second, academics are still dedicated to the old fiction that we are supposed to be living the “life of the mind.” If doing it right, as the perception goes, academics should have little to no time for private or personal matters. Taking the two together, if one not only has the time to have any personal life let alone one that is troubled in any way AND also is willing to be so gauche as to talk about it, it reveals a lack of commitment to the academic idyll and must mean their work as a scholar is insufficient and their identity as a scholar is compromised. It is astounding that, in the third decade of the 21st century, there are still people in the profession who cling to these ideas.",
          "author": "natsteel",
          "created": 1591449801,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ft121ds": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft121ds/",
      "text": "Honestly OP all this shows is that you're human. You have emotions that got the better of you, and you unloaded in an e-mail that went to the person that sent the wrong e-mail at the wrong time. As things go, there are more regrettable ways to unload emotions on someone. You apologized in an e-mail as soon as you realized that you messed up, you didn't pretend like it didn't happen. Bring that up in your defense.\n\nI would put everything you've put in this post (granted, reworded/reformatted) out there and own the mistake, etc. But give it context -- the stressors you have. It's possible to own to something but give context that helps people understand. Having emotions doesn't *not* (double negative) make you a promising young student. If anything, it makes you more \"real.\" A \"loose cannon\" reputation is acquired by repeatedly doing the same types of outbursts, over and over and over and over. Having them occasionally in public happens to the best of us, when we're overwhelmed. The loose cannon also doesn't typically make amends or apologize, they just act as if nothing ever happened.\n\nYou really should stop self-flagellating, we're all good at it but don't worry, six months from now this will be behind you and you will be back on track. Why do I know that? Because I've done this a few times myself...and it always blows over, because everybody's done it at one time or another.\n\nEdit: Honestly, they fucked you. That's pretty shitty to begin with anyway. Granted the person who sent you the e-mail is probably not who made that decision, but as an organization, the conference did screw you over. So maybe they kind of deserved it?",
      "author": null,
      "created": 1591400630,
      "upvotes": 6,
      "replies": {}
    },
    "ft1c44f": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1c44f/",
      "text": "I don't have much more to add except to reassure you that things will be okay. In my career I've had several setbacks (fired from a lab, put on academic probation, panic attacks in front of my not-so-sympathetic advisor) that seemed like the end-all at those moments. But nope, I'm still here, I learned from my mistakes, and I'm still on that up and up, and I believe you will be too. The whole reimbursement schema is hugely problematic, but I've seen a lot of talk about reforming it on academic twitter. Your best bet now is to swallow your pride and admit your mistake, and ask the higher ups if there is any mechanism to help you financially.",
      "author": "palepinkpith",
      "created": 1591405042,
      "upvotes": 3,
      "replies": {}
    },
    "ft1ksyn": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1ksyn/",
      "text": "So at worst, you didn't put a polite spin on your email. At my university, people tend to understand that this occurs when someone's in crisis/pain (see: midnight panic attack email the night before lab meeting). It's also completely reasonable for you to ask for refunds-- stipends are not nearly high enough to eat those kinds of costs, and the organizers are kidding themselves if they think otherwise.\n\nThe organizers should have recognized this, and I'm sorry that they didn't. Being in a place of receiving that sucks. As far as their actions go, there's absolutely no reason to have contacted your PI and department about it. You are not a child. If they thought you should have responded differently, they should have responded to you directly. \n\nIf your program director is good, take the time to form a good relationship with them. Having that can help you out in other friction-causing situations. Being able to go to someone with authority and say \"this is how I perceive the situation that's happening\" can help tremendously.",
      "author": "voidofneurons",
      "created": 1591408860,
      "upvotes": 3,
      "replies": {}
    },
    "ft1mt38": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1mt38/",
      "text": "Just wanted to say sorry all this is happening to you, with your personal matters and now the conference funds. That sounds really crappy and hard and I wish you weren’t having to deal with all of that. Thinking of you!",
      "author": "Eliza_Watts_Sells",
      "created": 1591409757,
      "upvotes": 3,
      "replies": {}
    },
    "ft1n4dc": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1n4dc/",
      "text": "Obviously the rational advice people are giving is best (like calling airlines, talking to your University, apologizing a little) but if none of that works maybe consider tweeting about your experiences with the conference not refunding you? This is truly reprehensible and I feel like a lot of people in your field would be interested to know this information. Even though Twitter can be kind of problematic at times, I have seen SO many examples of academics on Twitter pressuring conferences (getting the name of the machine learning conference NeurIPs changed from NIPs as an example)",
      "author": "cmccagg",
      "created": 1591409896,
      "upvotes": 3,
      "replies": {}
    },
    "ft1yecj": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft1yecj/",
      "text": "hope you used a credit card - you can fight it for reimbursement through that way.",
      "author": "isual",
      "created": 1591415059,
      "upvotes": 3,
      "replies": {}
    },
    "ft23bzo": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft23bzo/",
      "text": "Personally, I wouldn't apologise if the email was a reasonable complaint. If you are entitled to reimbursement, then it's not your fault.",
      "author": "someth1ng_au",
      "created": 1591417437,
      "upvotes": 3,
      "replies": {}
    },
    "ft3eu57": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft3eu57/",
      "text": "You're characterising the email as a bad thing to do. It was perhaps a mistake in some purely tactical sense. But you didn't cause anyone harm, you didn't act immorally in any way. Them contacting your supervisor was bad. Your supervisor not supporting you was bad. Your behaviour was just human. \n\nI don't have any advice for going forward. If their opinion of you is permanently lowered there's nothing you can do. The best way to move forward is to do what you would have done anyway. A small piece of advice for the future though, if your pi refuses to change their opinion of you when you succeed, don't waste any more time and tears worrying about their approval",
      "author": "l_lecrup",
      "created": 1591437169,
      "upvotes": 3,
      "replies": {}
    },
    "ft3lvm1": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft3lvm1/",
      "text": "People here have offered great advice and insight. I’ll just address your original question: how do you look these people in the eye? With pride. You’ve been carrying a tremendous load, with grief, stress, and financial uncertainty piled on top of one another. Anyone who would interpret you or your actions as “trashy” is an ass whose opinion isn’t worth a damn. I’m wishing you well going forward. I’m glad to hear your ombudsman has been supportive. I’d also say, if you haven’t already, it could be good to talk to campus mental health services, and if grad students at your university are unionized, a union rep could also help you talk out relationships with members of your department moving forward.",
      "author": "lit_geek",
      "created": 1591440083,
      "upvotes": 3,
      "replies": {}
    },
    "ft3cooy": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft3cooy/",
      "text": "I recently learned the hard way in academia that no matter what happened always stay professional.",
      "author": "Prof_Wolfram",
      "created": 1591436404,
      "upvotes": 2,
      "replies": {}
    },
    "ft3gmv5": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft3gmv5/",
      "text": "Your supervisor needs to help you actually reach your goal, not put you down.\n\nCorrective action should include how to cover for your cancelled travel expenses.\n\nA hungry PhD student makes a worse PhD student than one who doesn't have to worry about about food and shelter. You need to make this point very clear. It's both a loss for you, for your supervisor and for the university.\n\nAgree not to repeat this mistake and to take it with him first next time something like this happens.",
      "author": "Me_ADC_Me_SMASH",
      "created": 1591437819,
      "upvotes": 2,
      "replies": {
        "ft3uuxw": {
          "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft3uuxw/",
          "text": "> Your supervisor needs to help you actually reach your goal, not put you down.\n\nOP said the organizer and his PI are both academic bully.",
          "author": "advanced-DnD",
          "created": 1591443657,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ft46azk": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft46azk/",
      "text": "I commented earlier but was too sleepy to do so properly. \n\nOP, the majority consensus here is right, you should not be getting any harassment for this. \n\nMain point I think, you were grieving first and foremost, you lashed out and later apologised if I read that correctly. Anyone who doesn't forgive someone who is mourning who felt hard done by (because let's be honest you were hard done by, post-grads are notoriously underpaid and we dont have funds to lose or giveaway) is not worth your time. \n\nThe best action would have been for them to reimburse you (I imagine they had insurance?), or perhaps they could offer you a slot at the next conference free of charge but they very least they could do is forgive your minor transgression. \n\nCut yourself some slack. Academia is toxic and being a PG is difficult for many reasons, being bottom of the ladder and pay scale is one of them, dealing with shit like this is another. \n\nTell your supervisor you slipped up and acted brash, you were in a state of grief and given everyone's funding troubles at the moment you were upset as you thought they would uphold their word to reimburse you. If s/he doesn't forgive you immediately then screw em (not really but for your own sake) you can still continue ahead with your phd even if you and your SV have disagreements. You dont have to be friends although that would make it easier, but they cant tell you what to do, they are there to guide your research and offer helpful advice, not to punish. \n\nAlso, I'm sorry for your loss. \n\nHope things get better for you, your supervisor sounds like an ass.",
      "author": "Diddly_eyed_Dipshite",
      "created": 1591448199,
      "upvotes": 2,
      "replies": {}
    },
    "ft4rlbk": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft4rlbk/",
      "text": "The conference organizers are the ones that f'ed up by not immediately offering reimbursements to graduate students. \n\nYou didn't handle this situation as professionally as you would like. That is OK. People make mistakes. You are in school to learn skills, but also how to successfully exist in academics. You learned a lesson the hard way. We have all done this. Once I accidentally erased an entire database that it took 7 higher-up people a full week to repopulate. I was mortified. It was terrible. I thoguht I would never live it down. People promptly forgot about it. Now, I rarely even think about it (except when I am populating databases and only to make sure I am doing things correctly).  If you cannot stop thinking about it, try to meet with a therapist a couple times - they can help you get over things. \n\n**How do I look these people in the eye knowing that everyone now thinks of me as a trashy loose cannon instead of the promising young student I was a few weeks ago?** \n\nIf they thought of you as a promising grad student before this, they still think you you as such. Show up, do your work, and move on. It might be awkward the first few times, but some awkwardness won't kill you. People are usually only thinking about themselves. They do not think about you nearly as much as you think they do. Just keep going. \n\nI would set up a meeting with your advisor. Explain the situation, basically, as you have to us. I can't imagine your PhD advisor being completely unsympathetic to your situation. Sure, he is disappointed, but this often happens when you work with someone. Either way, tell them that you realize your approach was unprofessional and you regret it. Also, explain the circumstances surrounding your response, not as an excuse, but as the circumstances that led you to act less professionally that you would normally. The advisor should understand and move past it.",
      "author": "fuubear",
      "created": 1591456097,
      "upvotes": 2,
      "replies": {}
    },
    "ftanh61": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ftanh61/",
      "text": "If you feel comfortable, DM me the name of the conference. I would be happy to send the organizers an email explaining how pissed off I am to learn how they are treating an invited speaker/presenter (PhD student no less).",
      "author": "tauopathy",
      "created": 1591557912,
      "upvotes": 2,
      "replies": {}
    },
    "ft0wwei": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft0wwei/",
      "text": "As others have said and you know, while you shouldn't have sent it, a lot of other people here (primarily the conference organizers) are in the wrong. You win this by kicking ass at your work. You apologize professionally and don't let yourself get heated again. Unfortunately, these jerks may try to provoke you in the future, but you keep your cool regardless. You be successful. You don't let them keep you from opportunities. We all make mistakes, no one should be judged by how they behave in a low moment!",
      "author": "AwkwardAccountant5",
      "created": 1591398347,
      "upvotes": 5,
      "replies": {}
    },
    "ft2au7b": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft2au7b/",
      "text": "It kind of depends on the wording of your email. Did you insult the organisers personally? If not, this is not a tifu, you just got screwed. In general, never front money if you don't have to, and never front money where there isn't a concrete agreement for the refund. \n\nIf you personally went after the organisers then they are probably justified in their response, although nothing is likely to come of it.\n\nImportantly, you should be aware of the email address you used to send the email. Using the official uni for this is just dumb and hopefully you didn't do this.",
      "author": "dhdhdhdhshsbnsbvvc",
      "created": 1591421305,
      "upvotes": 1,
      "replies": {}
    },
    "ft43lkn": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft43lkn/",
      "text": "What prestigious conference does not reimburse for a cancelled event? I am confused.\nWho is the organizing establishment?",
      "author": "stdoggy",
      "created": 1591447297,
      "upvotes": 1,
      "replies": {}
    },
    "ft4brcu": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft4brcu/",
      "text": "In line with a lot of the other replies here I'd caution you from being too apologetic. You've acknowledged a mistake, leave it at that. I get the sense your PI will throw you under the bus if you don't stand up for yourself.",
      "author": "eta_carinae_311",
      "created": 1591450349,
      "upvotes": 1,
      "replies": {}
    },
    "ft5ggrn": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft5ggrn/",
      "text": "switch advisor and make public that organizer. Even if your email was in a bad tone, you can always apologize and learn —\n\nWe had a conference — it was canceled — we lost the plane tickets because it was before airlines had allowed to get reimbursement. We lost 50% one one airbnb for a pair students. The conference was very nice and refunded the registration for most part and i did get the hotel back. Guess what? I did cover all my students (it was a few of them) \n\nYour advisors needs to support you. If he doesn’t support you, it doesn’t matter that you like his area of research, you need to have someone that has your back. \n\nAlso, seek someone to help you — another faculty etc. Ideally a full professor.",
      "author": "FoCoCS",
      "created": 1591464360,
      "upvotes": 1,
      "replies": {}
    },
    "ft7kja3": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft7kja3/",
      "text": "I hope you're feeling a bit better. Give us an update someday, if you can. Wishing ya all the best, you'll do fine!",
      "author": "survivalothefittest",
      "created": 1591485683,
      "upvotes": 1,
      "replies": {}
    },
    "fti4ogj": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/fti4ogj/",
      "text": "OP, I’m going to guess you’re a woman, based both upon your apologetic tone, and upon how the conference organizers and your advisor treated you. You weren’t “nice” and so you were reprimanded like a little girl who dared to be “difficult.”\n\nI agree with others here that what you did is technically not a big deal and will be forgotten in short order. Take this as a lesson in how you will be perceived and held to different standards of behavior than men, and practice being your authentic, bad (in a good way) self even if you’re not nice all the time. Cultivate mindfulness of shame and fight it every time it surfaces when you speak your truth boldly. It’s exhausting — and unnecessary — to be nice all the time.",
      "author": "boldolive",
      "created": 1591728193,
      "upvotes": 1,
      "replies": {}
    },
    "ft2civ8": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft2civ8/",
      "text": "I’m so sorry you’ve lost your mother. Holding space for you and your sibling in my thoughts.",
      "author": "thechiefmaster",
      "created": 1591422212,
      "upvotes": 1,
      "replies": {}
    },
    "ft3k4ah": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft3k4ah/",
      "text": "YOU DID NOT FUCK UP! They are monsters.\n\nEverybody else has said this, but I was so outraged I felt the need to type it as well.",
      "author": "cjcornthwaite",
      "created": 1591439267,
      "upvotes": 1,
      "replies": {}
    },
    "ft134c1": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft134c1/",
      "text": "You're still a student. Get your disabilities office involved. Clearly you were experience some form of  crisis. Instead of supporting you through a mental health crisis, a third party  forwarded a private message to your school. How does your school know it wasn't forged or done maliciously? \n\nTalk to your title xi officer see what they say.",
      "author": "lnln8",
      "created": 1591401118,
      "upvotes": 1,
      "replies": {}
    },
    "ft15q0t": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft15q0t/",
      "text": "Your advisors email doesn't necessarily imply he agrees with the conference organizer.\n\nHe may have simply felt it wqs easier to apologize then argue or defend you. \n\nYou may find them much more sympathetic in person.",
      "author": "lednakashim",
      "created": 1591402269,
      "upvotes": 0,
      "replies": {}
    },
    "ft2o5yx": {
      "link": "/r/AskAcademia/comments/gxcxrk/tifu_how_do_i_recover/ft2o5yx/",
      "text": "I see I'm in the minority opinion here but I'll state it anyway and try to add my two cents in way of moving forward:\n\nLet me start by saying I'm truly sorry for what you're going through.\n\nYou were wrong. The issue wasn't the wording, but bringing your personal issues, as harsh as they may be, to a professional setting. You can ask politely, you can demand, you can threaten, you can't bring in your personal life. This is paramount to attempting emotional blackmail on the organizer. You mentioned that the organizer was friends with your PI, than them talking should be expected. The organizer does not need to personally pay for everyone's cancelled bookings, that's just not plausible.\n\nBut what's done is done and it's time to move on. The way I see it, you don't need to send an apology email since they didn't have the courtesy to deal with you directly, but it would be the smart thing to do career wise. Short email. 3 lines. I apologise for being unprofessional, I understand you aren't liable. I hope this will not adversely affect your professional opinion of me since I was looking forward to presenting in your conference.\n\nNow moving forward - you can ask your ombudsman or your PI to help with covering costs. You can fight the booking site, the airline. You can see if your PI can help talk to the organizer... But the money isn't why you're asking for advice so let's get to academics.\n\nDouble down. You were unprofessional? From now on you need to not mention it in the lab setting and be twice as confident, twice as cocky, let your work show you are a professional.\n\nWhat's done is done. Look forward and hopefully someday (as often happens in academia) you'll get you vengeance (or at least be his reviewer 2).",
      "author": "justryingtokeepup",
      "created": 1591427455,
      "upvotes": -1,
      "replies": {}
    }
  }
}