{
  "sid": "aotv20",
  "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/",
  "title:": "Do others have a very hard time staying focused during talks/conference lectures?",
  "text": "I almost always lose track of what a speaker is saying at conferences. I'm not talking about the typical moments of spacing out that happen and have happened to all of us during lectures going all the way back to grade school. I'm referring to practically a total inability to keep the ears and brain both directed towards the speaker for any meaningful amount of time.\n\nMy main explanation for this is that conferences and talks are often socializing overload. You're surrounded by colleagues and peers in the same field as you, and it's hard to resist glancing over at them, thinking about your interactions with them, wondering what they're thinking about the lecture, wondering what they're thinking about *you*, trying to compose yourself in a way that looks totally scholarly and serious... Of course, there's also the matter of how engaging the speaker is. Listening to someone read 15 pages of a paper that is written in a style intended to be read and not spoken is already a bit of a challenge, but add that to a senior academic who doesn't look up or change his/her intonation even once...\n\nI'm exaggerating a bit here for effect, but I imagine there must be others who experience what I am describing.\n\nAlso, to all those out there who know the topic at a talk well enough to just ask a random question that has little to do with what the speaker was saying but at least saves everyone from the awkwardness of no one asking anything at all — thanks. To all those who do the same thing when there are many other people with their hands up — ugh.",
  "author": "Durendal_et_Joyeuse",
  "created": 1549730080,
  "updated": 1634081316,
  "over_18": false,
  "upvotes": 141,
  "upvote_ratio": 0.99,
  "comments": {
    "eg3k616": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3k616/",
      "text": "I only pay attention to about 10% of the talks at any given conference.  For the other 90%, I either (1) understand the result as well as care to, (2) maybe have one question about it that will be addressed in the first 5 minutes of the talk, or (3) just don't care.",
      "author": "iyzie",
      "created": 1549732298,
      "upvotes": 68,
      "replies": {
        "eg3km9u": {
          "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3km9u/",
          "text": "This is accurate for me, too. I tend to get a lot of networking, correspondence, and writing done during meetings. But those 10% of talks (the really state of the art stuff) may be pretty worthwhile. ",
          "author": "Jon3141592653589",
          "created": 1549732653,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "eg3lurk": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3lurk/",
      "text": "Everything you've described I have experienced. It's a little disheartening when my coworker excitedly talks about the interesting research that was presented and I have no idea what happened. It makes me feel like I don't care enough, or am not smart enough to be in my field, but it's more just that I have more trouble sitting still and focusing than most people. ",
      "author": "vButts",
      "created": 1549733623,
      "upvotes": 42,
      "replies": {
        "eg55dpp": {
          "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg55dpp/",
          "text": "It’s not your fault. \n\nA good speaker should engage the audience and make complex ideas simple. A good writer should do the same. It’s all just rhetoric, ultimately.\n\nThis is not easy to do—not everyone can be a great speaker—but that’s what differentiates a good academic speaker from a bad one.",
          "author": null,
          "created": 1549781562,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eg3m02n": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3m02n/",
      "text": "In planning my talks and helping other people rehearse theirs, I try to keep in mind that most people will be fading in and out.  I try to design slides where someone could look up in the middle after not paying attention for the last 5 minutes, and have an idea of what I'm showing. EDIT:  As an example, even if I say \"for these next three  experiments, I used neonatal mice\" on a transition slide, I will write out \"allergic response in neonatal mice\" on every single slide showing data from neonatal mice.  I also make sure that any cartoon I draw is somewhat self-explanatory for someone who has been paying absolutely NO attention since the beginning.  \n\n\nA *few* high-end lecturers seem to know that most people do not have a long enough attention span to listen to a solid 50 minutes of data.  The visiting keynote speaker at a departmental retreat I helped organize gave a 45 minute lecture for her hour long spot, and it was much more narrative in format.  Unfortunately, many senior people who give conference lectures do not put the level of care and rehearsal into their talks that more junior people do.  I'm amazed at how many people struggle to stay on time.",
      "author": "jigglywigglywoobly",
      "created": 1549733743,
      "upvotes": 28,
      "replies": {
        "eg3mn2j": {
          "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3mn2j/",
          "text": "I attended a panel a few days ago where one of the speakers was projected on a screen through a terrible Skype connection. She couldn’t see us, she could barely hear us, and the conference organizers didn’t mute her until 30+ minutes of Skype’s reconnecting pings and ambient noise from her end had caused enough disruptions that politely ignoring it no longer sufficed.\n\nThen when she finally started speaking, one of the organizers had to interrupt her to ask if she was using WiFi because her connection was so choppy. Cue a crowd of 100+ people (this was a well-attended public event) shouting out suggestions until finally the organizers gave up and told her to proceed giving her 40-minute talk through incessant freezes and connection drops.\n\nWelcome to academic conference lecture hell.",
          "author": "Durendal_et_Joyeuse",
          "created": 1549734242,
          "upvotes": 18,
          "replies": {
            "eg3ophg": {
              "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3ophg/",
              "text": "omg that's hilarious and painful.",
              "author": "jigglywigglywoobly",
              "created": 1549735857,
              "upvotes": 2,
              "replies": {}
            },
            "eg3yj1v": {
              "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3yj1v/",
              "text": "Pretty sure this is a punishment in some level of hell.",
              "author": "ssbbgo",
              "created": 1549743534,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "eg3q0pb": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3q0pb/",
      "text": "People don't like admitting this, but the majority of conference talks are outright bad. People don't want to admit to themselves that a good talk provides some sort of entertainment value to hold the audience's attention. The result is many very bland talks that could just as easily be given to the audience to read in silence for 15 minutes before they ask questions. \n\nWhen we give talks at conferences, I think we should consider their stand-alone value as an informative lecture, and not just treat them as another CV line and a bland recitation of our research.",
      "author": "80lbsdown",
      "created": 1549736874,
      "upvotes": 26,
      "replies": {}
    },
    "eg3mcgm": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3mcgm/",
      "text": "It might depend on the field, but imo 90% of talks are not actually written to be heard but to be read, and then are just coincidentally read aloud -- which makes them extremely hard to follow because our brains can't process the information fast enough compared to when it's written on a page where we can reread the sentence as many times as necessary to be able to parse it enough to proceed. Maybe the speaker uses a piece of jargon or term you don't recognize and you have to stop and think, wait, what does \"construction of geography-based identity\" even mean? And maybe you spend 5 seconds wrapping your head around the term and thinking \"oh, it means where someone was born or lived shapes their sense of who they are as a person,\" and suddenly the speaker has moved on and you've missed 5 critical seconds and boom, you're completely lost, and have to figure out what they're talking about \\*now\\* -- by which point they've moved on \\*again\\*. In the end your brain just drifts to something easily understandable for a break, like networking or what time it is, or how your shoes don't match your pants.",
      "author": "Loimographia",
      "created": 1549734009,
      "upvotes": 18,
      "replies": {}
    },
    "eg3s2po": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3s2po/",
      "text": "I do the same thing and then if I have a question I’m usually too scared to ask because I worry, “what if this exact question was explained during the presentation and I was just zoning out?” ",
      "author": null,
      "created": 1549738466,
      "upvotes": 18,
      "replies": {
        "eg5auxn": {
          "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg5auxn/",
          "text": "Yes, this! Or what if I was said in an indirect way that was supposed to make sense (and made sense) for everyone and there I am, asking. However, I've listened to a 45min presentation which made entirely sense to me and then listened to the questions. Most of them were of these two types and probably most of them in any talk are but we don't realise so nothing to be scared or ashamed of. The 3rd type that I've noticed are those questions that people ask that have their research incorporated and they sound very deep and hard to answer. Keep in mind that those persons have found a link between the two studies and it's not some connection from thin air so we shouldn't feel intimidated. ",
          "author": "dada903",
          "created": 1549790326,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eg3t8pr": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3t8pr/",
      "text": "Try sitting at the very front one time. I feel like it's a completely different experience. Just the close up of the speaker's face and expressions keeps you a lot more engaged. It's more like a 1-on-1 conversation than a talk.",
      "author": "idleprof",
      "created": 1549739358,
      "upvotes": 3,
      "replies": {
        "eg3u1mb": {
          "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3u1mb/",
          "text": "I always sit up at the very front. Then I start musing over whether I look attentive and interested enough, since I'm right in front of the speaker. Then I start thinking about the fact that I'm thinking about those things, and I tell myself I need to pay attention. Then I start thinking about the fact that I'm thinking about paying attention instead of actually paying attention, and by then I'm also trying to figure out the best way to adjust because I'm cramped in this lecture hall with creaky, wooden stadium seats that squeak and moan like a beast from the depths of Dante's hell. Then I realize I've missed about 4 minutes of the speaker's talk, so I'm totally discouraged from asking any questions because I'm worried I'll ask something that was covered extensively.\n\nAmplify this excessive uneasiness by about 30 when for some reason the organizers of the lunchtime lecture serve delicious kettle chips that register on the Richter scale when you chew them, so instead you spend the whole talk desperately waiting for the lecture to end so you can inhale them.",
          "author": "Durendal_et_Joyeuse",
          "created": 1549739969,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "eg3tpt6": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3tpt6/",
      "text": "I need 2 things to be able to stay focused:\n\n\\-the topic is close to me, even a bit\n\n\\-the presenter is good\n\n&#x200B;\n\nDon't worry about yourself, pretty sure that most of the time it's the presenters fault, their presentation sounds like a torrent of words, completely incoherent. They don't know what to put emphasis on and when to hold pauses, how to lead the thought and how to create good PPTs. \n\n&#x200B;\n\nAt the end of a long conference day it is also hard to give a fuck about what the presenter is saying, no matter how ugly that sounds. ",
      "author": "nightwica",
      "created": 1549739716,
      "upvotes": 4,
      "replies": {}
    },
    "eg3n6lk": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3n6lk/",
      "text": "Happens to the best of us. I find it happens less if its a talk in my exact field, or I really need the information.",
      "author": null,
      "created": 1549734670,
      "upvotes": 3,
      "replies": {}
    },
    "eg59cpp": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg59cpp/",
      "text": "Conferences are a vestigial practice from the 19th century, when scientists and researchers had very few other chances to easily communicate. Nowadays they are mostly a waste of time from the “scientific” point of view. I’ve seen keynote speakers watch cricket or football on streaming on their tablets while “listening” to other talks. Almost nobody gives a shit about the papers, and they’re there for the socialising or the free food & drinks. If you don’t really pay much attention, you’re not alone, trust me.",
      "author": "WilfridSephiroth",
      "created": 1549787737,
      "upvotes": 3,
      "replies": {}
    },
    "eg3tkhs": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3tkhs/",
      "text": "I'm usually terribly sleepy from the travel so I only attend talks that I am SUPER interested in and the keynote. If I try to do other wise it might as well be nap time. If it's nap time I'm better served sitting at the bar catching up on articles or enjoying a hotel bed sans kids!\n\nI've watched my PI fall asleep at a talk. So no, you're not the only one.",
      "author": "Zelamir",
      "created": 1549739605,
      "upvotes": 2,
      "replies": {
        "eg3ucjq": {
          "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3ucjq/",
          "text": "There was an old emeritus who showed up to all the talks back in my MA days, and in addition to the fact that he was a short, pudgy, cute little man who looked like a Dickens character and never remembered my name, he would invariably fall asleep during every single lecture, and *somehow* not only was he always the first person to ask a question, but his questions were *always* perfectly relevant and insightful. ",
          "author": "Durendal_et_Joyeuse",
          "created": 1549740203,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "eg3xc85": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3xc85/",
      "text": "That's why I make a point to get the lectures/speeches recorded, and getting a copy. If nothing else, at least as an audio recording by myself. It is pretty amazing that when I break the time down in chunks and listen to them as topic-wise podcasts eyed-closed, I can retain much more and for long term too. Did this same thing my entire life with lectures, was never disappointed. Hope it helps. Cheers!",
      "author": "traditional_goose",
      "created": 1549742576,
      "upvotes": 2,
      "replies": {}
    },
    "eg43bdw": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg43bdw/",
      "text": "I've learned to mentally check out of talks I know I don't care about and focus on my own internal dialogue instead.  It's too taxing to try and understand something that you ultimately won't be able to get in a short amount of time.",
      "author": "scintor",
      "created": 1549747388,
      "upvotes": 2,
      "replies": {}
    },
    "eg3nac2": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3nac2/",
      "text": "Also, to add onto other points, let's be honest that good researchers don't make good talkers. \n\nVery hard to remain focused when the person talking has about as much intonation as a flatline, no matter how amazing the research itself is.",
      "author": "Murderous_squirrel",
      "created": 1549734751,
      "upvotes": 2,
      "replies": {}
    },
    "eg3m5v6": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3m5v6/",
      "text": "We can only keep attentive to even the most interesting talks for 45mins so don't feel too bad. ",
      "author": null,
      "created": 1549733866,
      "upvotes": 1,
      "replies": {}
    },
    "eg3oydg": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3oydg/",
      "text": "I’ve had the same experience to the T. Thought I was the only one— ha!",
      "author": "lethargicmagician",
      "created": 1549736051,
      "upvotes": 1,
      "replies": {}
    },
    "eg4p141": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg4p141/",
      "text": "This thread makes me feel better about myself. However, in real life, it feels like everyone around me pays very good attention to talks when they have these brilliant, extremely specific questions at the end...",
      "author": "realcoolworld",
      "created": 1549765071,
      "upvotes": 1,
      "replies": {}
    },
    "eg5ptm2": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg5ptm2/",
      "text": "Depends on how much coffee I have. ",
      "author": "desertnursingstudent",
      "created": 1549812216,
      "upvotes": 1,
      "replies": {}
    },
    "eg79rzb": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg79rzb/",
      "text": "Yep yep. Especially hard for me if the speaker isn’t engaging and doesn’t explain the significance well.  Or uses too much jargon. Or the slides are too busy with too many words and going them through too quickly. \n\nScience communication and public speaking are hard skills to master and my impression is that we don’t get enough training in those areas as grad students. ",
      "author": "theyellowparachute",
      "created": 1549857350,
      "upvotes": 1,
      "replies": {}
    },
    "eg79y1j": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg79y1j/",
      "text": "Anyone else jealous of professors who sleep through a talk and then ask the best questions? ",
      "author": "theyellowparachute",
      "created": 1549857492,
      "upvotes": 1,
      "replies": {}
    },
    "eg3lboh": {
      "link": "/r/AskAcademia/comments/aotv20/do_others_have_a_very_hard_time_staying_focused/eg3lboh/",
      "text": "You're probably a high visual learner, as are most people. That would be the cause. ",
      "author": "gutfounderedgal",
      "created": 1549733206,
      "upvotes": -8,
      "replies": {}
    }
  }
}