{
  "sid": "pff3x0",
  "link": "/r/AskAcademia/comments/pff3x0/how_difficult_is_it_to_get_hired/",
  "title:": "How difficult is it to get hired?",
  "text": "I graduated in December of 2020 with a 3.81 GPA in Neurobiology and Psychology from UW-Madison. I started applying for jobs about 2-3 weeks ago, after finally obtaining my work authorization (OPT).\n\nI held several research positions, although I didn't do too much at them. I did somewhat good work at 1-2 or them, but the one I held the longest position for (1 year), I didn't do too much, in part because sometimes my mentor would skip meetings, and in part because I was lazy and couldn't care less. And then COVID hit, so that was the end of that. \n\nI'm kind of lost currently, and I'm just spam applying to research coordinator positions and some research assistant positions.\n\nI'm an international student. I wish I could redo college. I transferred here and spent 2.5 years in America. I've since then ventured into some programming, and for some reason I've some screenings/calls with some finance companies for financial advisor positions I applied to. Yet I've not heard much back from the research positions I applied to, despite applying to so many of them. Granted, I only really started applying to a bunch of them a week ago, and a lot of them were sent to Stanford for research coordinator/(associate) positions\n\nI've learned that the GPA doesn't really get me anywhere. I don't think I've a terrible resume, or at least I hope not. If I could redo it, I'd major in computer science, because under my VISA, I can only work in positions \"directly related to your major.\" And comp sci pays a lot. And I want to be financially stable. \n\nI like research, but it feels difficult to get into. I'm not seeming to find those who want to hire somewhat research naïve graduates. I'm mainly into psychology, I like Jung's ideas, I'm deeply interested in psychedelics and our consciousness, and in the same vein, our neuroscience. I gave a TEDx talk on psychedelics back in my home country a few years ago.\n\nIf I could redo college, I wouldn't focus so much on classes. I would invest much more of my time into labs. Because in the job market, it seems like that's what employers want. I thought a degree, a good GPA would open doors. But I feel rather unemployable, and I can only work here for 1-3 years under my VISA, so I also don't want to get positions like a lab technician, which pays $3 more than working at some random restaurant, and which I feel don't really contribute much to anything meaningful/my future/my goal of perhaps attending graduate school.\n\nI would appreciate any and all advice from those more experienced than I am. If I could redo college and go back in time, I would. I don't want to be in the same situation I am in now, when I am 30, regretting past decisions because I lacked knowledge, or was too lazy.",
  "author": "ZealousidealAd7436",
  "created": 1630444699,
  "updated": 1634079442,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.43,
  "comments": {
    "hb6elko": {
      "link": "/r/AskAcademia/comments/pff3x0/how_difficult_is_it_to_get_hired/hb6elko/",
      "text": "I agree with u/OrbitalPete and would add spamming jobs is an absolute waste of time. As someone who does a fair amount of recruitment, I would say about 70-80% of the applications we receive for jobs at all grades go straight in the bin because the applications are so bad. Generic letters don't tell the recruiter anything about why you want the job, how you fit with the skills required for the role and whether you understand the job. They do tell their recruiter you've made no effort with the application and you're just sending it out to lots of employers and don't really care who responds. \n\nApply for fewer jobs and spend longer crafting each application. Over the last 10 years I've applied for a number of jobs and I've had interviews for every single one, except one and that one I think there was some silliness going on with the recruiting manager. The way I write my cover letter is to use the essentials and desirables in the role profile as paragraph headings, I write a short paragraph for each one, then delete the headings and tidy it all up. I also top and tail with where I heard about the role and why I want the job and what I'll bring to it. \n\nI recommend looking up ask a manager - she doesn't write about academia specifically but what she says is true of any job even when you're applying for TT (there's just more to an application than what she covers).",
      "author": "ACatGod",
      "created": 1630498107,
      "upvotes": 3,
      "replies": {}
    },
    "hb5tfg8": {
      "link": "/r/AskAcademia/comments/pff3x0/how_difficult_is_it_to_get_hired/hb5tfg8/",
      "text": "I'm not in your field, or the US,  but I would say the main issue here is you're applying for things you're not competitive for. \n\nResearch coordinator/(associate) positions are almost certainly getting filled by people with at least Masters and probably PhDs in the field. As an undergrad who has been in a few projects you don't actually ahve any direct research management experience.\n\nSecond, recruitment periods operate on months, not weeks.\n\nThird, until you're at professorial levels, academic pay sucks. As a PhD holding academic with 5 years of postdoctoral experience, and another 5 as faculty, I earn the same as an average office job in the UK, except I had to do all the extra training, went through a bunch less job security, and had to move country to chase the postdocs.  I don't think your financial expectations live up to reality.",
      "author": "OrbitalPete",
      "created": 1630481519,
      "upvotes": 6,
      "replies": {
        "hb7os89": {
          "link": "/r/AskAcademia/comments/pff3x0/how_difficult_is_it_to_get_hired/hb7os89/",
          "text": "I agree with most of your points but one: for psychology, research coordinators, lab managers, and lab techs often just have a bachelors. Masters degrees are not expected for those jobs in the US. I know because it’s the job I do now and all of my colleagues got the job fresh out of undergrad with a year or so of undergrad research experience. These jobs are usually stepping stones to phds, and as such an open position receives up to 200 applications (especially in Covid times) so it’s just incredibly competitive to get. I just want to add this in case someone comes across this thread in the future while looking for similar advice.",
          "author": "Winter_Bake",
          "created": 1630518279,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hb7p94s": {
      "link": "/r/AskAcademia/comments/pff3x0/how_difficult_is_it_to_get_hired/hb7p94s/",
      "text": "If you’re applying to psych lab manager and RA positions, make your research potential very clear and make it look like you understand the work the lab does. They’re basically hiring you by thinking about how good of a potential grad student they think you’ll be.",
      "author": "Winter_Bake",
      "created": 1630518469,
      "upvotes": 2,
      "replies": {}
    }
  }
}