{
  "sid": "pb1nvs",
  "link": "/r/AskAcademia/comments/pb1nvs/publishing_after_getting_a_new_job_teaching/",
  "title:": "Publishing after getting a new job teaching",
  "text": "If you work on research with institution A, then move to institution B, can you still publish under the affiliation of A?\n\nSecondly, if you aren’t getting paid for research at B, can you still publish?",
  "author": "TheBoscoBull",
  "created": 1629857061,
  "updated": 1634079496,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.99,
  "comments": {
    "ha9clc6": {
      "link": "/r/AskAcademia/comments/pb1nvs/publishing_after_getting_a_new_job_teaching/ha9clc6/",
      "text": "If the research (or part of it) was conducted in the institution A, then yes. If you didn't conduct research in institution B, it is still common practice to put the second affiliation using \"Current affiliation\" or \"Present address\" as a note.  The exact notation could change depending on the journal, check through the journal note for authors if this is explicitly written.\n\nSee for example the first author here:\n\n[https://journals.aps.org/pra/abstract/10.1103/PhysRevA.102.052820](https://journals.aps.org/pra/abstract/10.1103/PhysRevA.102.052820)\n\nRegarding the second question, if your institution has nothing against it then sure.",
      "author": "Toby_Dashee",
      "created": 1629869739,
      "upvotes": 4,
      "replies": {}
    },
    "ha9i13w": {
      "link": "/r/AskAcademia/comments/pb1nvs/publishing_after_getting_a_new_job_teaching/ha9i13w/",
      "text": "Your affiliation is whoever paid for the research and \"paid\" covers provided the facilities, supervision, administration etc as well as whether or not you were paid. Where you are now is your current address.",
      "author": "ACatGod",
      "created": 1629873864,
      "upvotes": 3,
      "replies": {}
    },
    "ha97kab": {
      "link": "/r/AskAcademia/comments/pb1nvs/publishing_after_getting_a_new_job_teaching/ha97kab/",
      "text": "Agree, you could use either affiliation. Maybe include both if your appointment overlapped (eg 2 appointments at the same time even if you weren’t getting paid by one). \n\nIn my experience, what matters for promotion/tenure isn’t which affiliation you use but just when it was published and you get credit for all scholarly output.",
      "author": "me_jus_me",
      "created": 1629866420,
      "upvotes": 1,
      "replies": {}
    },
    "ha9pmbg": {
      "link": "/r/AskAcademia/comments/pb1nvs/publishing_after_getting_a_new_job_teaching/ha9pmbg/",
      "text": "Affiliation should reflect where you are or were when the work was performed. So A in this case, or could be joint A and B if you eg wrote and submitted while at B leading to a salary contribution from B (probably at your discretion). If none of the work was done while you were at B, then just put your affiliation as A, and state B as your current address using a footnote. And yes you can still publish without a research position.",
      "author": "The-very-naughtyduck",
      "created": 1629880253,
      "upvotes": 1,
      "replies": {}
    },
    "ha8qvyy": {
      "link": "/r/AskAcademia/comments/pb1nvs/publishing_after_getting_a_new_job_teaching/ha8qvyy/",
      "text": "Your affiliation should reflect either who funded/supported you OR where it will benefit you the most (if you made a switch).\n\nAnd yes. But it may not count for anything towards promotion/tenure/retention.",
      "author": "CerebralBypass",
      "created": 1629857644,
      "upvotes": 0,
      "replies": {
        "haawa6e": {
          "link": "/r/AskAcademia/comments/pb1nvs/publishing_after_getting_a_new_job_teaching/haawa6e/",
          "text": "This. It certainly can't hurt to use your new affiliation and it might well help. I'd use both affiliations, probably.\n\nI went to a CC after grad school and had 4 pubs from grad school when I got there. I continued to publish there despite there not being any sort of expectation of doing research or publishing at the CC. I used my grad school and CC affiliations for research I had finished in grad school and only the CC affiliation for research I finished there. I ended up getting promoted on a faster track than had happened before. The only difference between me and the other faculty was my publications. That was never given as the reason for my early promotions but it's hard to see what else it might have been. The benefit of the promotions, of course, was salary increases that were tied to promotions. At our college there's a permanent salary boost that comes from assistant to associate and again from associate to full. These boosts are in addition to any merit raise for that year. Meanwhile we became a baccalaureate college and over the years have hired quite a few faculty who do research and publish. Again, it's not a requirement, but it's an effective way to meet the, \"Professional Development\" aspect of annual evaluation and those faculty who publish are on a faster track than those who don't.",
          "author": "rockyfaceprof",
          "created": 1629904950,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}