{
  "sid": "p11iew",
  "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/",
  "title:": "Long term - go for the PhD?",
  "text": "Hi guys. Need some “what would you do” advice.\n\n\nBackground info - I’m 31, single parent of a 5 year old. I’ve worked in Early Childhood Education since I was 17. With COVID last year, our school started cutting back hours and I lost my job. In my area, early education teachers make $12/hour if we’re lucky. \n\n\nContinuing my education has ALWAYS been something I’ve wanted to do, but put off for one reason or another. I genuinely love school and learning. So when I couldn’t find another job paying me the money I needed to make, I decided to finish my Bachelors. If everything goes according to plan, I’ll be graduating a semester earlier than I was supposed to, and will finish in December of 2022 with my Bachelors in Integrated Studies with concentrations in Education and English, and a minor in Psychology.\n\n\nMy plan is to get my teaching license (in TN in the US you can have a bachelors in literally anything, take the Praxis test, and get your teaching license), find a job teaching in elementary school, and immediately go for my Master’s in Curriculum and Instruction. I’d like to finish that, and then go for my PhD as well.\n\n\n\nHere’s my question - those of you who have your PhD. Has it been worth it? I don’t just mean financially, but obviously that too. I just want to make sure I’m not getting as high as I can educationally, and then never moving beyond teaching elementary school. What jobs do you have? Do you regret the time, effort, and money you’ve spent?",
  "author": "owleyes20",
  "created": 1628515894,
  "updated": 1634079954,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.73,
  "comments": {
    "h8abyck": {
      "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8abyck/",
      "text": "My supervisor once said to me “a PhD is an apprenticeship in being an academic”. Maybe because he thought that way, it think that way too, but I think it’s a great way to look at the PhD degree. It’s not like other degrees where you do some lectures, pass an exam and walk out with a certificate. It’s about training you in the art of research and equipping you to become an academic.\n\nIf I were you, I would ask yourself, do you see yourself following a pathway to become an academic? If not, then a PhD is probably not the right path. If so, I would suggest looking into exactly what that entails in your field. For what it’s worth, I would be careful when asking academics this question, because they necessarily suffer from a form of survivor bias. \n\nMy partner and I have different experiences. My partner really wanted to an academic and did a PhD with a world renowned professor in the social sciences. Finding jobs (academic or not) afterwards was near impossible and every day s/he regrets doing the PhD: over qualified, under experienced. \n\nI did mine in STEM with a lesser known professor. I enjoyed it and thought it was a great experience, I loved doing research and writing publications. I had a pathway to an academic future if I wanted it, but the experience really put me off academia as an industry: the pay was atrocious and the petty politics of academia irritated me too much.\n\nThe upside is my partner and I met doing our PhDs and we’re really happy together. So it wasn’t all bad! :-)",
      "author": "ischickenafruit",
      "created": 1628517559,
      "upvotes": 9,
      "replies": {
        "h8cpst5": {
          "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8cpst5/",
          "text": "> do you see yourself following a pathway to become an academic? If not, then a PhD is probably not the right path.\n\nThis is becoming less true, but I think it is quite dependent on the discipline. Part of what convinced me to do my PhD was seeing it as preferred or even required on many jobs I was looking at. But I'm in Computer Science so there is a very tight link between academia and industry.",
          "author": "drcopus",
          "created": 1628555459,
          "upvotes": 1,
          "replies": {
            "h8ddzt3": {
              "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8ddzt3/",
              "text": "I'm also in CS. I'm curious what jobs you see that want/prefer a PhD? Any examples?",
              "author": "ischickenafruit",
              "created": 1628567699,
              "upvotes": 1,
              "replies": {
                "h8e8pi4": {
                  "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8e8pi4/",
                  "text": "Mostly jobs in ML/AI, although friends in areas like Quantitative Finance have told me similar things. \n\nSmaller places seemed to want researchers and engineers all tied into one - this was usually where \"PhD preferred\" was listed. Larger places like DeepMind have a clearer division of labour so there the \"requires PhD\" basically means that your job would be very similar to academia (although being an academic in industry is very different to \"real academia\" according to people I've spoken to).",
                  "author": "drcopus",
                  "created": 1628591896,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h8afb2f": {
      "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8afb2f/",
      "text": "If you’re interested in education, an EdD might be more appropriate.",
      "author": "RoyalEagle0408",
      "created": 1628519141,
      "upvotes": 10,
      "replies": {}
    },
    "h8aagvl": {
      "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8aagvl/",
      "text": "Early childhood education might be one of the few areas where getting a doctoral degree might actually pay off.",
      "author": "novht",
      "created": 1628516842,
      "upvotes": 13,
      "replies": {
        "h8abifx": {
          "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8abifx/",
          "text": "This. Also, there are often non-academic positions to consider if the PhD thing doesn't pan out.",
          "author": "molobodd",
          "created": 1628517349,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h8akc7y": {
      "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8akc7y/",
      "text": "I'd definitely start with the master's, try it out for a bit, and then go back if you're finding you haven't found your niche yet.  It really depends on what you want to be able to do.  \n\nIn ECE (if that's where you want to stay) with a master's, there are lots of different opportunities other than teaching and these are likely to explode in the future with coaching and professional development becoming a big part of the push to expand access to high-quality ECE.  You wouldn't be stuck as a classroom teacher forever at all, but there are similar pay challenges in the higher roles, though not as extreme.  \n\nFor context, I'm an ECE researcher.  I got a bachelor's in a related field and worked in human services for a while. I realized I wanted to be able to do more, so I went back for a master's.  I worked for a while, again in a tangentially-related field, and realized I still couldn't quite do what I wanted to do, so I went back for a PhD.  I definitely now have the skills to do what I want, but my work experiences hugely shaped my research interests and questions and led directly to my current work.",
      "author": "ohbonobo",
      "created": 1628521425,
      "upvotes": 5,
      "replies": {
        "h8b40l7": {
          "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8b40l7/",
          "text": "Thanks for the response! \n\nI’ll probably say in ECE. Even with teaching, the highest I would want to go is probably 3rd grade, and since ECE is birth-8 years, that fits. Ideally I’d like to get into more of the coaching and professional development side of things. As you mentioned, there needs to be more access to higher quality ECE. ECE is a field where you truly have to LOVE what you do, because if not it will affect the children you’re educating. With my experience in this field I have sat through MANY coaching and professional development seminars/classes/trainings, and I’ve learned the different between ones that you’re zoning out at and taking just to get the piece of paper at the end, and ones that are actually inspiring you to take it back to the classroom. I’ve also been in a classroom enough to know the difference between a teacher who is engaged with their students and ones who are just there for a paycheck, and seen the difference in how the students learn. \n\n\nBasically I want to be Rita Pierson (RIP) when I grow up.",
          "author": "owleyes20",
          "created": 1628529869,
          "upvotes": 2,
          "replies": {
            "h8bif9t": {
              "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8bif9t/",
              "text": "Feel free to send a PM if you're interested in what academia around ECE can look like or just wanna ask some specific questions.  I'm still figuring out my best path, but I've explored a lot of options along the way...  And I have some fantastic others with whom I've worked and from whom I've learned.",
              "author": "ohbonobo",
              "created": 1628535931,
              "upvotes": 1,
              "replies": {
                "h8bxma2": {
                  "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8bxma2/",
                  "text": "That would be amazing! Thank you so much!",
                  "author": "owleyes20",
                  "created": 1628542378,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h8b2a5c": {
      "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8b2a5c/",
      "text": "what will you use your Ph.D. for?  what is your goal?\n\nI see your path as: Teaching to get experience, and working on your Master's to level up.  Advanced degree and experience gets you the higher levels of pay.....but.....keep in mind that advanced degrees with no or little experience will make you less attractive should you wish to move to a different school district.\n\nI struggled getting my first teaching job with a master's and no experience because the pay schedule demanded I get paid more than a BS level with no experience.\n\nWhat will a Ph.D. provide you in terms of employment?  If you want to go into administration, it will be useful and likely required.  If you want to teach, I don't think it will help that much.\n\nIf you want to get into academia/college/University professorships its a must....but this place is littered with Ph.D.s who can't find work in universities.",
      "author": "04221970",
      "created": 1628529146,
      "upvotes": 3,
      "replies": {
        "h8b49i3": {
          "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8b49i3/",
          "text": "Oh absolutely, I will definitely teach while I get my Master’s in order to get school system classroom experience. \n\nI mentioned this above but I basically want to be Rita Pierson, lol.",
          "author": "owleyes20",
          "created": 1628529974,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h8sp01a": {
      "link": "/r/AskAcademia/comments/p11iew/long_term_go_for_the_phd/h8sp01a/",
      "text": "A PhD is an extremely diverse degree, meaning that a PhD in Molecular Biology is extremely different from a PhD in Early Childhood Education. The goal of a PhD is to give you skills in order to do research. If your goal is to be an educator, and you want to eventually move into the ranks of School Administration, then a different graduate degree maybe in your best interest (e.g. EdD). Regardless, this is something you need to discuss with your teacher colleagues, as the majority of people here are graduate students in traditional PhD programs. \n\nTo answer your question-- a PhD != more money or a better career. It usually isn't a good idea for most people. Don't always equate more education = better.",
      "author": "everyone_gets_zosyn",
      "created": 1628870650,
      "upvotes": 1,
      "replies": {}
    }
  }
}