{
  "sid": "qg0j73",
  "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/",
  "title:": "Recommendations for books featuring the \"behind the scenes\" of academia",
  "text": "There are a lot of books about how to do research, what it takes to be a good scientist, etc. etc. many of which have been discussed in this sub before. Recently, however, I stumbled upon the book *Apprentice to Genius: The Making of a Scientific Dynasty* by R. Kanigel which discusses a \"dynasty\" of Nobel-and-other-prestigious-award-winning researchers through their mentor-mentee relationships. It goes quite deep into the ugly politics of academia, disputes about authorship etc. It's a pretty interesting read, although it deals with biochem/medical fields which are quite different from my area.\n\nI was wondering: are there any other books — biographies, guides, or anything else — that go into the \"behind the scenes\" of academia work and discuss mentorship, running a lab, publishing, and the issues associated with working in academia? I'd be interested in reading more about others' experiences. Something focused on STEM would be perfect but I'll appreciate any suggestions.",
  "author": "Spartan313",
  "created": 1635230649,
  "updated": 1635302297,
  "over_18": false,
  "upvotes": 138,
  "upvote_ratio": 0.97,
  "comments": {
    "hi3m4hv": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi3m4hv/",
      "text": "There is a great satirical novel called *Dear Committee Members* by Julie Schumacher. Told entirely through recommendation letters, it chronicles life at a mediocre university.",
      "author": "pipkin42",
      "created": 1635246268,
      "upvotes": 54,
      "replies": {
        "hi4wrxg": {
          "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi4wrxg/",
          "text": "A more serious but enjoyable novel is \"Intuition\" by Allegra Goodman about an exciting discovery and the fallout in medical lab.",
          "author": "A_Crazy_Canadian",
          "created": 1635267876,
          "upvotes": 5,
          "replies": {}
        },
        "hi5j1gr": {
          "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi5j1gr/",
          "text": "David Lodge's Campus Trilogy is a bit older but also quite nice.",
          "author": "No-Heart-1454",
          "created": 1635276616,
          "upvotes": 3,
          "replies": {
            "hi5qme3": {
              "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi5qme3/",
              "text": "I was also going to suggest Lodge. Definitely not STEM, but still very much spot-on.",
              "author": "Bookfinch",
              "created": 1635279513,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hi392kj": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi392kj/",
      "text": "\\- Bruno Latour, *the pasteurization of france*\n\n\\- Steven Shapin, *Never Pure: Historical Studies of Science as if It Was Produced by People with Bodies, Situated in Time, Space, Culture, and Society, and Struggling for Credibility and Authority*\n\n\\- Soni and Goodman’s biography of Claude Shannon, *A Mind At Play*",
      "author": "Diederik21",
      "created": 1635235594,
      "upvotes": 35,
      "replies": {
        "hi3l82z": {
          "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi3l82z/",
          "text": "The second one is just a fantastic title, I’m gonna have to give it a go!",
          "author": "sexy_bellsprout",
          "created": 1635245615,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "hi39bz9": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi39bz9/",
      "text": "I often recommend “piled higher and deeper” . Though not sure if it is serious enough for you lol",
      "author": "dutchbaroness",
      "created": 1635235833,
      "upvotes": 17,
      "replies": {
        "hi3g6nr": {
          "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi3g6nr/",
          "text": "Similarly, Academia Obscura is a brilliant book about some obscure and absurd stuff which happened in academia. It got me through some tough times in my PhD by helping me not take all of this too seriously, which lowered the pressure a lot.",
          "author": "needlzor",
          "created": 1635241671,
          "upvotes": 10,
          "replies": {}
        },
        "hi65psy": {
          "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi65psy/",
          "text": "If we're drifting into satire, Krippendorf's Tribe (the 1985 novel that inspired the movie) is another classic...",
          "author": "big_promise",
          "created": 1635285546,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi3m9xj": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi3m9xj/",
      "text": "\n“How Professors Think: Inside the Curious World of Academic Judgment” — Michele Lamont",
      "author": "dinopastasauce",
      "created": 1635246372,
      "upvotes": 12,
      "replies": {}
    },
    "hi42hj1": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi42hj1/",
      "text": "Depending on where you are in your academic career, I’ve recently found *A Field Guide to Grad School* by Jessica Calarco to be useful for current or recent graduate students. I think it’s helpful for deconstructing unspoken-but-expected academic norms particularly if, like me, you’re coming from a background where you never had family or friends or role models who went through higher education.",
      "author": "LilSporks",
      "created": 1635255465,
      "upvotes": 8,
      "replies": {
        "hi44q1r": {
          "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi44q1r/",
          "text": "I also came here to recommend A Field Guide to Grad School for learning the hidden \"norms\".",
          "author": "Hot_Spinach7691",
          "created": 1635256461,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hi43p4s": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi43p4s/",
      "text": "Cathedrals of Science: The Personalities and Rivalries That Made Modern Chemistry \n\nis a corker!",
      "author": "lalochezia1",
      "created": 1635256009,
      "upvotes": 5,
      "replies": {}
    },
    "hi3vmsi": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi3vmsi/",
      "text": "Bruno Latour, \"Laboratory Life\"\nMichel Anteby, \"Manufacturing Morals\"",
      "author": "bFSFM",
      "created": 1635252072,
      "upvotes": 5,
      "replies": {}
    },
    "hi53q80": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi53q80/",
      "text": "Lots of stuff by sociologist of science Bruno Latour: _Laboratory Life_, _The Pasteurization of France_, _Science in Action_ are all about asking questions like, \"how do labs actually work?\", \"how do scientists use laboratories to change the world?\", \"how do arguments about truth take place and get resolved in science?\"\n\nIn general the anthropology and sociology of science is filled with this kind of stuff. For physics, for example, definitely look at Sharon Traweek, _Beamtimes and Lifetimes_ — it is an ethnography of high-energy particle physics in the 1990s. \n\nThe history of science also contains lots and lots and lots of careful studies for basically any topic you can imagine. \n\nIn short: there are entire disciplines devoted to this — check them out! Most of their book-length output is totally readable by someone from outside of the discipline.",
      "author": "restricteddata",
      "created": 1635270608,
      "upvotes": 4,
      "replies": {}
    },
    "hi3k7dm": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi3k7dm/",
      "text": "Surviving your stupid, stupid decision to go to grad school is a short, funny book about what grad school is ACTUALLY like. And, importantly, how to be successful even through all the bologna that comes with it. \n\nThe professor is in is a great book on the process of getting a job in academia and what goes on behind the scenes. It's mostly a guide about successfully navigating the application process. But it is very good and provides a good look at a lot of the aspects of academia. It also includes a section on how to leave academia. \n\nOther books I have read sections of that relate include don't be such a scientist, a guide to academia by prosanta chakrabarty, and the Chicago guide to your academic career (a good reference style book, just look up the sections as needed). \n\nHope this helps!",
      "author": "Goronman16",
      "created": 1635244856,
      "upvotes": 11,
      "replies": {}
    },
    "hi3l4p8": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi3l4p8/",
      "text": "Obviously not a serious answer, but this immediately made me think of the wizards in Terry Pratchett ><",
      "author": "sexy_bellsprout",
      "created": 1635245546,
      "upvotes": 4,
      "replies": {}
    },
    "hi4aum2": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi4aum2/",
      "text": "There's an older novel called Stoner by John Williams, from the mid-1960s. Its a \"slice-of-life\" story about a life-long humanities academic. It's clearly dated racially and gender-wise, but still in my opinion a great book about the wonders, and pettiness, of academia.",
      "author": "forever_erratic",
      "created": 1635259101,
      "upvotes": 4,
      "replies": {}
    },
    "hi366dt": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi366dt/",
      "text": "If I remember correctly, The Quantum Ten did this, but for the \"big players\" of quantum mechanics in the 20s. So its specifics might be outdated, but it's still a fun read.",
      "author": "fuckwatergivemewine",
      "created": 1635233044,
      "upvotes": 2,
      "replies": {}
    },
    "hi3pswo": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi3pswo/",
      "text": "Birth of a Theorem by Cédric Villani might be in the ballpark of what you want, it has some mathy bits as well",
      "author": "QPZMqpzmQPZMqpzmQPZM",
      "created": 1635248716,
      "upvotes": 2,
      "replies": {}
    },
    "hi5gy2i": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi5gy2i/",
      "text": "*The Fall of the Faculty* is more about the shifts in university control and labor models over the last century than about hands-on, day-to-day stuff, but it has plenty of juicy bits about internal politics in academia.",
      "author": "xrayhearing",
      "created": 1635275811,
      "upvotes": 2,
      "replies": {}
    },
    "hi6esbo": {
      "link": "/r/AskAcademia/comments/qg0j73/recommendations_for_books_featuring_the_behind/hi6esbo/",
      "text": "Lab Girl by Hope Jahren. It’s the memoir of a botanist and she discusses her struggles in academia and establishing a lab.",
      "author": "ScubaStef",
      "created": 1635289539,
      "upvotes": 2,
      "replies": {}
    }
  }
}