{
  "sid": "p7ieqa",
  "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/",
  "title:": "Why did you choose to work so hard to be a tenure track faculty if industry pays you more, gives you better work life balance (I guess?), and provides you with unlimited opportunities?",
  "text": "I finished my PhD in CS recently (my research is centered on AI). I'm researching about the differences between being a TT faculty member in academia and a researcher in research labs in industry (in computer science and AI). I  like research more than engineering and so I am more inclined toward academia. However, the industry jobs benefits are very tempting. Industry pays you more, gives you better work life balance (?), you can easily move to any part of the country (USA) that you want, you don't need to teach or write grants and worry about funding, and also most of the novel AI algorithms come from industry labs (such as Google Brain). What was the reason you preferred academia over industry?  I'm doubting my decision on staying in academia or maybe I'm just tired of being in academia and think grass is greener on the other side.\n\n&#x200B;\n\nUPDATE: Thank you all very much for your comments. I'm reading and following this. I like these comments way more than the cliche points and comments I could find online about the differences between academia and industry. Very detailed and relatable and eye opening, thanks!",
  "author": "always_developing",
  "created": 1629390981,
  "updated": 1634079546,
  "over_18": false,
  "upvotes": 135,
  "upvote_ratio": 0.9,
  "comments": {
    "h9jz8v4": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9jz8v4/",
      "text": "If your research interests are largely aligned with what the industry is working on, then I agree that there's probably not much sense in staying in academia.  My research is purely theoretical and has only vague connections with any real-world applications, so nobody outside of academia would pay me a cent to work on this crap. I would have to completely change my research if I decide to get an industry job, but I like what I do so for now I decided to stay in academia until either I get a permanent job or they realize that it's a stupid idea to keep paying me.",
      "author": "sure_complement",
      "created": 1629392917,
      "upvotes": 107,
      "replies": {
        "h9nk3gs": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9nk3gs/",
          "text": "Do you think it is within your ability to switch your research area and move to industry, if you wanted to? I have been job searching in applied math and all everything people hire mathematicians for nowadays is dealing with data science or machine learning this and that…it seems very limited.",
          "author": "geometer2015",
          "created": 1629462624,
          "upvotes": 2,
          "replies": {}
        },
        "h9me3qk": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9me3qk/",
          "text": "Username checks out",
          "author": "picardIteration",
          "created": 1629431718,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9k0ton": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9k0ton/",
      "text": "Fundamentally you can't choose what you work on in industry, the company can turn around tomorrow and pull the plug on a project and directly/indirectly you're accountable to the shareholders. It's really whether that bothers you or not.",
      "author": "ACatGod",
      "created": 1629393572,
      "upvotes": 74,
      "replies": {
        "h9ldk2h": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9ldk2h/",
          "text": "It's not like you have infinite choices in academia. Certain topics and methods get funding so you are constrained by the bounds of the field. Hiring committees often look for candidates with particular expertise too.",
          "author": "bigvenusaurguy",
          "created": 1629413916,
          "upvotes": 41,
          "replies": {
            "h9mzlb4": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9mzlb4/",
              "text": "More choice maybe but certainly you are very constrained in academia in what you can work on to realistically have career prospects unless you already have tenure, in which case you might be doing so much admin that you have no time to do what you want. In my field in astrophysics, every single permanent job I saw advertised for several years asked for people doing observational work. People doing theoretical work literally had no options. Also since to become a professor these days you are expected to be some kind of academic entrepreneur (get funding, get prestigious publications, increase your indices, have lower people doing your work for you, advertise at conferences, be active in community engagement, etc.), doing highly technical over a long time period is basically a no-go and young people who do that basically doom their careers.",
              "author": "CaptainCornerCamper",
              "created": 1629447225,
              "upvotes": 8,
              "replies": {}
            },
            "h9qs7cd": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9qs7cd/",
              "text": "That is true and I myself am fond of reminding people of that - but as an industry researcher who loves it, it's undeniable that academic researchers have more freedom. Their freedom is likely more constrained than most PhD students realize, but it's not the same as a business abruptly pulling the plug and causing a researcher to have to drop an interesting line of research for any reason imaginable - or worse, laying off the researcher or the entire team.",
              "author": "roseofjuly",
              "created": 1629513202,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h9kuzkp": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kuzkp/",
          "text": "Yup. I'm in a social science field that has an industry option. I chose academia for just this reason and I've seen friends in industry get reassigned new research topics all the time. I like to choose my own adventure.",
          "author": "parkerMjackson",
          "created": 1629405978,
          "upvotes": 10,
          "replies": {
            "h9kxn0p": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kxn0p/",
              "text": "I think it really depends on what you like. I've been in both and enjoyed both. I like dictating my time and choosing my path but I also like the feeling of doing something with a clear and lasting impact on the organisation and being thanked and paid for doing my job!",
              "author": "ACatGod",
              "created": 1629407047,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "h9kx8gm": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kx8gm/",
          "text": "This is the often cited benefit, but deep down, I don’t know how true it really is. Obviously it’s somewhat field / country dependent, but this is what I’ve seen happen over and over (in Comp Sci in, USA, UK, EU and Australia). \n- governmental policies are set to push certain political agenda for research - eg “boosting agricultural productivity”, “collaboration with industry”\n- research grant agencies put out a call for proposals with fairly specific criteria that match the governmental policy \n- those criteria elicit fairly homogenous proposals \n- now suddenly you’re a systems and networking researcher, working on making combine harvesters (systems and networks) better for/with John Deer. \n\nNot much of a “choice to work on anything you like”.",
          "author": "ischickenafruit",
          "created": 1629406882,
          "upvotes": 19,
          "replies": {
            "h9l2q7p": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9l2q7p/",
              "text": "I think it's nevertheless more true than in industry. Since professors are paid in part for teaching and service, it's possible to work on research that isn't necessarily aligned with existing trends, if one so chooses. If you're in a field that requires more funding in order to maintain a lab and support graduate students and postdocs, then yes, you might have to at least pay lip service to current trends, but even then, it's possible to have an important fraction of your work be more blue skies research. You also have the option of moving into different areas of research, funded by different grant agencies, which is virtually impossible within the confines of an industry position.",
              "author": "mleok",
              "created": 1629409180,
              "upvotes": 6,
              "replies": {}
            },
            "h9kyp5e": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kyp5e/",
              "text": "This is true but it's also not what I meant. As an academic you choose what you want to work on. If you can't get funding or a post doing that then yes you either change direction or you fail out. While governments and funders often have an agenda, no one walks into your office and says \"today you're working on this, and you need to do X, Y, Z\". Even if you do change course to align with a political agenda you're still the one proposing the research and choosing your course. In industry it's \"the company has decided to invest in this area, we want to investigate whatever and you need to do it\". The decision of what a company will work on is generally made by senior leadership not senior scientists.",
              "author": "ACatGod",
              "created": 1629407487,
              "upvotes": 8,
              "replies": {
                "h9l0sev": {
                  "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9l0sev/",
                  "text": "> the decision of what a company will work on … senior leadership \n\nYes, that what academics tell me is the counterpoint. My experience is vastly different. Only at bad or backwards companies is your manager telling you what to do directly. As Steve Jobs put it “I don’t hire smart people so I can tell the what to do”. \n\nAny company that is willing to hire PhDs is smart enough to give them immense freedom on what to work on. There’s an implicit trust that the work will be in the interests of, and for the benefit of, the company. But you wouldn’t be working at Google unless there was something they did that interests you. Often my work is in the form of open ended research questions: “is it possible to do X,YZ” or “we don’t know how to optimise this”. Nobody is giving me a list of jobs to do today and finish by 5pm.",
                  "author": "ischickenafruit",
                  "created": 1629408367,
                  "upvotes": 4,
                  "replies": {
                    "h9l3g5a": {
                      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9l3g5a/",
                      "text": "That has not been the experience of my PhD students who have gone into industry. It's pretty clear in talking to them that their work is very closely aligned with corporate needs. While it's true that nobody is micromanaging them, the large scale goals (the X,Y,Z in your statement above) are still ultimately decided above their pay grade, and if a company decides to exit a particular market, then one might need to change jobs.",
                      "author": "mleok",
                      "created": 1629409481,
                      "upvotes": 7,
                      "replies": {
                        "h9qsqgv": {
                          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9qsqgv/",
                          "text": "Yes, I also work in industry and this is closer to my experience. It's not fundamentally a bad thing - I am very interested and invested in what my company does, and while I do work at a very large tech company I don't work ridiculous hours. So I don't mind it. But it's still true that your projects are dictated by the needs of the company, and if the company decides it's no longer interested in your project it can pull your funding.\n\n(I also disagree that if you weren't interested in what Google was doing you wouldn't work there. Google pays its researchers a *lot* of money, and I bet there are at least of people who are only mildly interested in their research and products that work there.)",
                          "author": "roseofjuly",
                          "created": 1629513466,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "h9l1xfb": {
                      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9l1xfb/",
                      "text": "And yet you have to produce products and stick to deadlines set by the company. I collaborate with someone at Google. He works insanely long hours and while he does have leeway and is able to advise and shape projects he still fundamentally works on what Google tells him they want him to work on. The project has been through the Google review process several times now where our project has to be justified and approved and Google definitely could have decided it was no longer of interest to them and pulled him from the project. He tells them why it's a good project but they decide if he can or can't do it. At the end of the day an academic can leave a job and take the project with them. Someone in industry cannot do that - and that's the essence of the difference.",
                      "author": "ACatGod",
                      "created": 1629408842,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h9khogv": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9khogv/",
      "text": "Well first off I'd disagree that industry always offer a better work life balance. I personally really like my academic lab and I can work whatever hours I want, which is great for my work life balance, and I prefer it to the 9-5 expected by most industry companies in my field.\n\nSecondly, I disagree that industry offers unlimited opportunities. Almost all industry in my field is focussed on applied technologies, products or services that have a very focussed goal in mind and require very strict and regimented standards to get there. This means that there's often not a lot of room to stray and discover novel things, which mostly happens in academia and then is advanced by industry for an applied purpose. In academia I can be led by my own inquisition and research whatever I want within reason, whereas my career in industry allowed no such thing.",
      "author": "FluffyCloud5",
      "created": 1629400612,
      "upvotes": 38,
      "replies": {}
    },
    "h9kfeme": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kfeme/",
      "text": "I was making NIH postdoc salary working 50 hours a week. I virtually doubled my salary and work 35-40 hours a week in industry. My background is microbiology/fermentation science.\n\nI spent almost 10 years with the dream of being a professor, from undergrad through my PhD and postdoc. I gave up that dream within a few months of trying industry and see no reason to ever go back to that hellhole career path. I published 25 peer reviewed papers and was the PI of two grants, and I'll always appreciate those accomplishments, but I'm definitely happier in industry.",
      "author": "SoupaSoka",
      "created": 1629399665,
      "upvotes": 34,
      "replies": {}
    },
    "h9jzd5t": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9jzd5t/",
      "text": "> (in computer science and AI)\n\nThere are a ton of fields with far fewer industrial research opportunities.",
      "author": "CheeseWheels38",
      "created": 1629392966,
      "upvotes": 127,
      "replies": {
        "h9kd62y": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kd62y/",
          "text": "i would add that there are probably no fields with better non-academic career options...",
          "author": "doornroosje",
          "created": 1629398734,
          "upvotes": 59,
          "replies": {
            "h9nawbc": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9nawbc/",
              "text": "[deleted]",
              "author": null,
              "created": 1629456846,
              "upvotes": -5,
              "replies": {
                "h9wfjcd": {
                  "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9wfjcd/",
                  "text": "What are you talking about?",
                  "author": "doornroosje",
                  "created": 1629633809,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h9k22bs": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9k22bs/",
      "text": "There are other perks. I like working on my own schedule. I like being my own boss.  I enjoy teaching and mentoring.  I enjoy discovery and writing.  The pay is frustrating but I have made my peace with it.",
      "author": "PolarCredenza",
      "created": 1629394083,
      "upvotes": 29,
      "replies": {}
    },
    "h9kdikj": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kdikj/",
      "text": "The humanities industry is really not flourishing…",
      "author": "imaginesomethinwitty",
      "created": 1629398878,
      "upvotes": 77,
      "replies": {
        "h9l01hb": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9l01hb/",
          "text": "Even in art history, which does have an \"industry\" of sorts (art museums), the jobs are equally dear and somehow tend to pay even less, with the exception of perhaps a few curatorial jobs at top-tier museums (and often not even then). Curatorial work has its own rewards, and is in some ways preferable to academia even given the lousy pay, but it's hardly thriving.",
          "author": "pipkin42",
          "created": 1629408047,
          "upvotes": 17,
          "replies": {
            "h9o1q18": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9o1q18/",
              "text": "[deleted]",
              "author": null,
              "created": 1629470682,
              "upvotes": 1,
              "replies": {
                "h9oh7iy": {
                  "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9oh7iy/",
                  "text": "Depends on the institution. Most curatorial jobs at nationally prominent museums are actually going the opposite way, to PhDs from elite schools, rather than MAs. Some exceptions for global contemporary stuff, but even that is going more and more towards the PhD. \n\nPeople with PhDs from places like Yale and Harvard--which also feature world-class museums and collections--tend to end up with a lot of curatorial experience, or at least opportunities for it.",
                  "author": "pipkin42",
                  "created": 1629476924,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h9lz4p9": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9lz4p9/",
          "text": "True, although a fair number of people in the humanities could be working in places like media/advertising/PR companies that are always flourishing. Or they could be very successful in client service roles or various management positions.",
          "author": "TheSpanishPrisoner",
          "created": 1629424027,
          "upvotes": 6,
          "replies": {
            "h9mrs81": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9mrs81/",
              "text": "Right, but if you go through the effort of getting your PhD in medieval literature/musicology/art history/cultural studies/(other cool but \"economically useless\" field) it's likely you are A) passionate about it, and B) not really up for working an unrelated job, unless you really have to.   \n*Could* you do it? Yeah, most likely. *Would you want* to? Not necessarily.",
              "author": "jeeveless",
              "created": 1629440774,
              "upvotes": 6,
              "replies": {
                "h9msodh": {
                  "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9msodh/",
                  "text": "Many of these people absolutely, 100%, would not want to do these other jobs. You are absolutely correct.\n\nBut being brutally honest, universities and employed professors are right now committing literal malpractice by continuing this charade of accepting way more students in their program than can get good jobs, and misleading people into believing they'll all get good jobs in academia, and providing zero \"plan B\" training/options/counseling. Why are these universities doing this? Mostly because grad students are pretty good and very cheap teachers.\n\nHuge numbers of these grad students absolutely cannot, mathematically speaking, get jobs in academia. And they have probably built up what I think is irrational belief that their lives will be terrible and they've failed themselves if they decide to go to the private sector. The truth is that there is rewarding work in the private sector, lots of nice people, a chance for higher incomes, and arguably a chance for better work/life balance.\n\nOne thing that I think a lot of people fail to realize is this simple reality: your happiness can come primarily from things outside of your professional life. Your professional life can, in fact, facilitate your happiness outside of your professional life (by giving you money that you can use to have fun and by maybe giving you more time to yourself to have fun). This probably sounds cliche, but I think there's a clear sunk cost fallacy with graduate school where you are prone to feel like a failure if you don't get an academic job, and so people stay in it too long to avoid failure, when they shouldn't avoid industry to such extremes.\n\nHere's a better plan, I think, if they feel like they **must** work in academia: get a job in the private sector for awhile. Maybe a year or two. Build a good reputation. Build job stability. Build expertise in the field. Then find a part time job teaching at a university in your spare time -- like night classes. Or maybe your professional job will let you take one day off per week to teach.",
                  "author": "TheSpanishPrisoner",
                  "created": 1629441473,
                  "upvotes": 7,
                  "replies": {
                    "h9mw7mt": {
                      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9mw7mt/",
                      "text": "As a Master's student in Literary Studies with big dreams of academia, I know I should absolutely follow your advice. No question about it. But, speaking personally it's so hard to accept that there is no reason to believe that I will be one of the few Making It. The backup career feels like something that I will figure out if/when I need it, even though rationally I realize it is absolutely logical to start thinking about it now. Maybe it's that focusing on plan B necessarily takes energy away from plan A? Who knows. In the meantime, I've saved your comment and I will revisit it when the rise-tinted glasses have been sat upon.",
                      "author": "jeeveless",
                      "created": 1629444359,
                      "upvotes": 1,
                      "replies": {
                        "h9mxrok": {
                          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9mxrok/",
                          "text": "Not everyone should abandon academia. That is what makes this so difficult. I'd never tell an individual person they shouldn't follow their dream and I'm sorry if my post gave that impression. I've told lots of people before: when you hear this advice that it's hard to get a job, do not ever let yourself think that it definitely applies to you, that you can't succeed.\n\nFor all of the people who don't get jobs, there are plenty of people who absolutely succeed and get great jobs and so on. I know many people like this. \n\nBut I am afraid that you are more likely to not get one of these jobs. And so my advice is simply, for starters, be aware and realistic that this is a possibility (which you are). Don't lie to yourself that you can't be one of the people who doesn't succeed at finding your ideal academic job. Also, don't tell yourself that you have failed if you don't get a job in academia. Because if necessary, you can thrive outside of academia and be happy -- maybe even happier. \n\nI'm sure you're also aware, by the way, that there are numerous people who **do** succeed in getting a good job in academia and then they are miserable. I know some people like this too. So it's not like life becomes perfect if you just get that job.\n\nYou are also absolutely right that focusing on plan B would take energy from plan A. That's the hard thing. But again, just do not fall into the trap of feeling like your life is over if it doesn't work out. And maybe, if you can, try to find some skill you can learn simultaneously along with your literary studies work that could be useful in industry, maybe something that complements your research if possible. Maybe that's computer coding or statistics or using Excel or whatever. Either way, your writing abilities are a skill that will be valuable in industry in tons of jobs.\n\nEither way though, your degree will be worthwhile even if you don't get a job using it in academia, because it is enriching you as a human. And so regardless of what happens professionally, for the rest of your life you will get to use that deep inquiry of knowledge. You are also skipping out on all of the incredibly vapid and boring academic fields that so many people major in, like accounting or marketing or whatever, all because they think they need those degrees to get a good job. And then as it turns out, the people getting more interesting liberal arts degrees can still get great jobs in industry and -- as it turns out -- it was unnecessary for so many people to go through the dryness of business school.\n\nGood luck!",
                          "author": "TheSpanishPrisoner",
                          "created": 1629445678,
                          "upvotes": 6,
                          "replies": {
                            "h9mzjd8": {
                              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9mzjd8/",
                              "text": "Can you perhaps become very small and live in my pocket for, say, a couple hours each week? :)  \nThank you for going through the effort of typing all of this up, it is really helpful advice.  \nHave a great day!",
                              "author": "jeeveless",
                              "created": 1629447180,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        },
                        "h9qtrwm": {
                          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9qtrwm/",
                          "text": "You're not wrong.\n\nI used to tell people not to get a PhD. But I've recently amended my advice; I tell them not to get a PhD unless they're OK with the idea of spending six to eight years getting the degree only to \"fail\" into something other than academic career, possibly just as interesting as academia.\n\nI changed it because I genuinely enjoyed parts of getting my doctoral degree, I learned a lot that I find useful for both my professional job and my every day life, and I generally value having the PhD. I love that I was able to spend six years getting paid (a little, but still enough to meet my basic needs) to conduct research on something I was passionate about. I think there are a lot of people out there who are similarly passionate about something and don't mind getting paid very little for a few to several years to study it.\n\nThe thing is, I just think most people should think of it as a first career, one that they will very likely leave after six to eight years. It's kind of like management consulting: the vast majority of consultants know they're going to leave after 2-3 years; very few are sticking around to become engagement managers or bigwigs. But the ones that leave usually find something really interesting to do afterwards, and there are many, many jobs that welcome former consultants because of the broad skillset they've acquired.\n\nI think it's pretty similar to the PhD situation, although with less salary and more debt: plan to leave. Expect that you will leave. Are you OK with doing the PhD for the sake of doing, and having, the PhD? Then go forth and academe; worst case scenario, you'll have spent several years doing something you really liked, hopefully somewhere you liked, and then can move into another career that you hopefully also like.\n\nBut I think that also means that I've adjusted my advice for aspiring PhD students, in that I think they should try to do non-academic internships (at least one) and spend meaningful time researching alternative careers while they're getting their PhD. And I also think that they should select PhD programs where they think they can thrive and be happy - no matter what that means to them - in addition to finding academic success.",
                          "author": "roseofjuly",
                          "created": 1629513995,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h9k2yzp": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9k2yzp/",
      "text": "Good question, and for me the needle twitches closer to moving to industry every year. Right now it's on about 51% stay in academia 49% jump ship.\n\nThe industry jobs that pay the big bucks usually have bad work-life balance too.\n\nBut more than that: you know those things they say about working at Google that make it sound too good to be true? I'm thinking in particular of being able to devote 20% of your time to projects of your own choice; but also setting your own hours, working from home whenever you want.\n\nWell, academia has always had that. Except it's 100% of my research time (50% of my working time), not 20%.\n\nI'm a professor in Computer Science, and after I decided I want to get interested in quantum field theory, I could just start publishing papers in it. I didn't need anybody's permission.\n\nThings are not as free as they used to be, as university admins and politicians (left and right) all believe that the way to improve universities is to run them like businesses. They steadilu erode the goodwill on which universities (and in fact businesses) run.\n\nFor example, I'm surprised by the stories from the US of professors who are being forced to teach in person and cannot require students to mask. Wherever I've taught (5 different European countries) it's been unquestioned that I can set the format of my course - so, even before COVID, if I decided I wanted to move the course online I could - and I can set the safety rules for my labs.\n\nBut I think there is still more freedom in academia than industry. As long as that's true, I'll stay.",
      "author": "radams78",
      "created": 1629394461,
      "upvotes": 70,
      "replies": {
        "h9m03l1": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9m03l1/",
          "text": "- Not to mention, isn't it true that at least some faculty manage to still make connections with industry or other organizations, and get secondary sources of funding, and then can become just as wealthy? \n\n- Plus, there is still the high status involved with being faculty at a university. \n\n- And then there's the fact that a lot of people would rather be a leader in an academic department, with tenure and pretty much guaranteed job for life.\n\n- And in a professorship/research position, you'll have significant power to control your research agenda. In industry, you'll do the research that *they* want you to do. Tons of people would take less money to be able to do *exactly* the kind of research they want to do for their whole lives, instead of the research that some big company wants you to do.\n\n- Related to the above, there is a not-naive difference that a lot of people see between research that benefits humanity versus research that benefits massively wealthy people. There's being a leader of some research lab that focuses on your research that primarily tries to help people versus being a researcher at a company where the goal is to use patents and legal mechanisms and a narrow research agenda aimed at maximizing profits.\n\n- Then there's the benefit of working with younger people your whole life -- being an educator -- versus not having that same environment in a professonal work setting.",
          "author": "TheSpanishPrisoner",
          "created": 1629424492,
          "upvotes": 1,
          "replies": {
            "h9qvf0n": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9qvf0n/",
              "text": ">Not to mention, isn't it true that at least some faculty manage to still make connections with industry or other organizations, and get secondary sources of funding, and then can become just as wealthy?\n\nThis would be the exception rather than the rule.\n\n>Plus, there is still the high status involved with being faculty at a university.\n\nThat depends entirely where someone teaches, I would say, and isn't universally higher than the prestige of being a researcher at some of the top companies in the world. It really varies depending on where you teach or where you work.\n\n>And then there's the fact that a lot of people would rather be a leader in an academic department, with tenure and pretty much guaranteed job for life.\n\nThat's true! Although I have found industry to be more stable than previously advertised, there is always the risk that your company lays you off, changes your focus so much that it's unenjoyable to stay there, or replaces your manager with someone horrible. Also, at least within my industry, researchers rarely ascend to high leadership roles within a company - they can become leaders of research divisions, but I rarely see them advance to corporate leadership. (That could be by choice, though.)\n\n>And in a professorship/research position, you'll have significant power to control your research agenda. In industry, you'll do the research that they want you to do. Tons of people would take less money to be able to do exactly the kind of research they want to do for their whole lives, instead of the research that some big company wants you to do.\n\nThis is true, and something I think anyone considering industry research should seriously consider. You don't get the same level of freedom to pick your projects and your area could be changed or defunded by the company at their whim, sometimes relatively suddenly. If it's really important for someone to do research on exactly what they want, they should attempt to stay within academia if they can.\n\n>Related to the above, there is a not-naive difference that a lot of people see between research that benefits humanity versus research that benefits massively wealthy people. There's being a leader of some research lab that focuses on your research that primarily tries to help people versus being a researcher at a company where the goal is to use patents and legal mechanisms and a narrow research agenda aimed at maximizing profits.\n\nWell...this is where things get complex: sometimes those things aren't necessarily orthogonal. My research in the tech industry has health implications for millions of people (I work on assistive technology), and while it will help to enrich our shareholders, it also has the potential to support a huge swath of people in every day life. I've also worked on innovative approaches to educational technology that had me helping teachers and school districts figure out how to deploy lessons across multiple kinds of subjects.\n\nThe other thing is that \"industry\" is often used as a synonym for \"non-academia,\" and there are lots of organizations that are not academia but also not for-profit corporations: non-profits, non-governmental organizations, government agencies at all levels (local/city, state, federal), international aid or quasi-government organizations, etc. I know researchers that help Sesame Street make educational content for preschoolers; that track epidemics like the one we currently find ourselves within; that learn how to better apply curriculum across entire school districts; and do other kinds of research that \"primarily tries to help people.\"\n\nStill, a researcher in industry *does* have to be comfortable with the knowledge that their role is, primarily, to increase value to the company's stakeholders. They also need to carefully consider the company's history and reputation and feel ready to support, or at least live with, that company's mission and values.\n\n>Then there's the benefit of working with younger people your whole life -- being an educator -- versus not having that same environment in a professonal work setting.\n\nWell, that depends entirely on what you do after you leave academia.",
              "author": "roseofjuly",
              "created": 1629514835,
              "upvotes": 1,
              "replies": {
                "h9r6l8q": {
                  "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9r6l8q/",
                  "text": "Great post. Thanks for sharing. I used some oversimplifications in my post, like implying that industry research is inherently not good for humanity, and I shouldn't have done that. And your example makes clear why that distinction isn't really valid. It's only in general where I think it's true that industry research tends to be more profit-driven and not focused on helping humanity compared to university research. But it's true too that profit motive can sometimes coincide with helping people (it's the idea that good, quality, humanitarian work can be good business).\n\nOn the other hand, if you ever watched the move \"Real Genius,\" you'll know that very evil research happens within universities too. Lol :)",
                  "author": "HAL9000000",
                  "created": 1629521229,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h9qu7l4": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9qu7l4/",
          "text": "I work in tech at a place like Google. I believe the 20% thing was eliminated at Google some time ago, or at least I've heard from Google researchers that it's not really a thing (and also, I think that anything you do discover/build/innovate during that time still belongs to Google). I would say that anyone who goes into industry should expect to spend 100% of their time researching something that the company finds useful and beneficial to them - but also that that can be broadly interpreted, and may actually be really interesting to the researcher in question.\n\nBut we really can set our own hours and work from home whenever we want. (Within reason, but that applies to a professor, too: you can't choose to teach classes at 2 am local time.)",
          "author": "roseofjuly",
          "created": 1629514210,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9juuo7": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9juuo7/",
      "text": "I wanted to teach and still do whatever research I want with whoever I want to agree to do it with.",
      "author": "Vievite",
      "created": 1629391112,
      "upvotes": 28,
      "replies": {}
    },
    "h9kh5cn": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kh5cn/",
      "text": "I wanted a TT faculty position because I wanted to teach.  I don't do a lot of research, but what I do for the research that I do is entirely at my discretion -- if I think it's interesting that's enough justification to do it.  Because my position is teaching focused I have no requirement to apply for grants, though I have on a few occasions.  Basically academia allows me to spend my time doing the thing that I want to do and find rewarding, which is teach, without most of the challenges associated with teaching high school.\n\nWith respect to work-life balance: I have a huge amount of flexibility in academia -- as long as I'm not missing classes nobody cares where I am, and as long as I am teaching my classes effectively nobody cares what I am doing.  Yes, many tech companies have lots of flexibility but I'd suggest that they don't have the same level of flexibility as academia.  I'm able to do school drop off and pick up most days for my kids, and pre-COVID I could occasionally volunteer when they needed parents to help with an activity at the school during the day.  Unless I'm travelling I'm home for family dinner every night.  But that also means that I almost always open up my laptop again once the kids are in bed and work.\n\nWith respect to compensation: As a computer scientist I could definitely make more money in industry.  But I'm decently compensated where I am, have a decent pension plan, and the stability of a tenured faculty position is unparalleled in industry (and as somebody that likes stability this is a big factor for me).  The flexibility and freedom to pursue ideas strictly because they are of interest to me also helps make up for the lower pay.",
      "author": "PurpleGeek",
      "created": 1629400391,
      "upvotes": 8,
      "replies": {}
    },
    "h9kuoch": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kuoch/",
      "text": "Honestly academia is the best work life balance I could ever imagine. The pay isn’t great, but when I’m on a break I take an actual break. I rarely work more than 35 hours a week, even during peak semester. No offense to those who fall into this category, but I find that academics who claim they work constantly are just really inefficient at their work. My classes are awesome, my students are fantastic, I’m sometimes annoyed at admin but mostly I have a great job and am in control of my time (most of the time). It’s my dream job and I love it.",
      "author": "gb8er",
      "created": 1629405854,
      "upvotes": 19,
      "replies": {
        "h9m9uzo": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9m9uzo/",
          "text": "Out of curiosity, what kind of institution do you work for?",
          "author": "failuretobloom",
          "created": 1629429385,
          "upvotes": 5,
          "replies": {
            "h9ncvnx": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9ncvnx/",
              "text": "Small liberal arts. I teach a true 4-4 (more often a 5-5 just to fill gaps). But very minimal research expectations. It helps that I’ve been doing this for 10+ years. I definitely worked longer hours at the beginning when I was still developing my courses, but still never experienced the whole “omg I work 100 hours a week” thing. I’ve just noticed, in my experience, that those professors who claim that usually spend at least 50% of their work day complaining to everyone about how many hours they work.\n\nMy favorite thing about academia is you don’t punch a clock. Your work day is done when your work is done. So there’s just a lot of motivation for me to focus and get it done efficiently. Most days I leave by 3 pm.",
              "author": "gb8er",
              "created": 1629458250,
              "upvotes": 2,
              "replies": {
                "h9qvkfj": {
                  "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9qvkfj/",
                  "text": "I don't actually believe that there are people who consistently work a productive 100 hours a week - but I do know that most of the professors who claim to work 60+ hour weeks tend to be at research universities.",
                  "author": "roseofjuly",
                  "created": 1629514913,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h9n83ch": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9n83ch/",
          "text": ">dustry jobs benefits are very tempting. Industry pays you more, gives you better work life balance (?)\n\nWhaaaat, some academics on twitter saying they work 100 hours a week! I think what you have is great but you're probably the exception rather than the rule",
          "author": "belamalta10",
          "created": 1629454684,
          "upvotes": 1,
          "replies": {
            "h9nccqi": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9nccqi/",
              "text": "Ah well there ya go. I’m an academic who’s not on Twitter. That must be where the extra 70 hours per week goes…",
              "author": "gb8er",
              "created": 1629457884,
              "upvotes": 4,
              "replies": {
                "h9nfive": {
                  "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9nfive/",
                  "text": "I agree with you, I rarely work more than 35 hours a week, but that’s because mine is a teaching position and does not expect research. I have a lot of committee work and other obligations to the department, but still don’t see myself spending excess time on it. My husband probably does work 80 hours a week, but he’s a department head and a researcher and overextends himself consistently, cannot seem to say no to anything. There’s a lot of procrastination going on too, so I think a lot of people working these long hours are bringing it on themselves. And I agree with the comment earlier, I see a lot of inefficiency going on.\n\nThat being said, an early career tenure track research faculty has a hell of a lot of work to do to get grants and publish in order to ensure their position, and I don’t envy them all that work.",
                  "author": "katclimber",
                  "created": 1629459966,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "h9s0977": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9s0977/",
          "text": "I agree with the gist of your comment, but...\n\n> I rarely work more than 35 hours a week, even during peak semester. No offense to those who fall into this category, but I find that academics who claim they work constantly are just really inefficient at their work.\n\n\nOffense absolutely taken. It's cool that you work in an institution that respects boundaries and doesn't pile up work on your head whenever they can, but you might want to consider yourself lucky instead of shitting over people who work in institutions who do not respect their time at all.",
          "author": "needlzor",
          "created": 1629545190,
          "upvotes": -1,
          "replies": {
            "h9s1il0": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9s1il0/",
              "text": "Ok. Be offended.",
              "author": "gb8er",
              "created": 1629546141,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h9l2py6": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9l2py6/",
      "text": "Not faculty but staff. Somebody’s getting rich off my hard work. I’d rather my efforts *possibly* trickle down to students as opposed to some fat cat shareholders. \n\nI never regret this decision. But it definitely sucks at times.",
      "author": "wcchandler",
      "created": 1629409177,
      "upvotes": 5,
      "replies": {
        "h9mabjb": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9mabjb/",
          "text": "I love the term fat cat shareholders. No truer words have been spoken.",
          "author": "givemeyourdonut",
          "created": 1629429628,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h9ma5jb": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9ma5jb/",
      "text": "Let's not kid ourselves that everyone who gets a CS PhD can work for Google Brain, DeepMind, or MSR Labs. AI is hot right now and has the ability/$$ to hire researchers like that. Theory positions in industry? Not so much.\n\nI think your view of CS industry is rosy but not entirely off base. Yes, the salaries are higher in industry than TT positions for PhDs. CS profs are some of the better paid 9 month profs at universities to compete with this. I'm \"losing\" money not being in industry but I make enough to be very comfortable. Most industry folks also don't get to pick the work that they do/don't actually have unlimited opportunities - they do applied research for a specific problem area/product at a company that makes money. It is a small group of researchers at FAIR/Brain/etc. that get autonomy - otherwise, you do research on products to help company bottom line. As for work-life balance, this depends on the company but yea, generally, it's probably less stressful than a TT position!\n\nOne downside of industry is that if a company decides to shrink its R&D or restructure, your job is WAY more likely to be cut than in academia.\n\nShort version why I did NOT go to industry - I hate product/applied research; I have real independence on what I work on; I love mentoring students.",
      "author": "tasteofglycerine",
      "created": 1629429539,
      "upvotes": 5,
      "replies": {
        "h9u43u1": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9u43u1/",
          "text": ">I think your view of CS industry is rosy but not entirely off base. Yes, the salaries are higher in industry than TT positions for PhDs. CS profs are some of the better paid 9 month profs at universities to compete with this. \n\nYeah my first reaction was OP might be a bit rosy on industry. Salaries at Google are honestly not that impressive. Fields where industry is an option pay more in academia. CS profs at a research university can make 150k and up. Tech industry jobs that pay *substantially* more than 150k are neither easy to get nor do they have good work life balance. \n\nI am in Business. Finance profs can clear 300k. Could they make more on Wall St? Sure. But those jobs have crazy burn out! How many years can you realistically do that?\n\nI like the fact that I'll be able to keep doing my job for quite a while..I don't have an expiration date and I'm not going to burn out. I get paid to stay current! (Attending conferences, reading papers etc).",
          "author": "DeskAccepted",
          "created": 1629582195,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9kwq1d": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kwq1d/",
      "text": "I've been both in industry and academia.\n\nAcademia is better in spite of what you hear.  However, I will trust the generalized opinion of several people who have been in their specialized industry job AND academia.   People who complain about their academia job without knowing the soul crushing nature of an industry job might be disappointed when they jump ship.\n\nDoes industry pay better????? maybe...it has the potential if you get yourself into upper management.  But thats like saying I play basketball because the pay is great.....only very few get that far for better pay.\n\nMy industry job paid me $25k better.  But I was on the hook for my own retirement to the tune of $25k if I wanted to live nicely when I'm old.  And its intimately tied to the success of the stock market.  Academia gives me a pension with no risk of losing it.\n\nAcademia has resources to treat their employees well and like a human.  Programs like that cost money and cut into the profit margin so are almost non-existent in industry.\n\n\nI won't get fired from academia because the University wants to increase profits by reducing costs.  Academia views you as an asset if you just do your job.  Industry recognizes you as a liability and cost that needs to be managed.\n\nIn industry, I was told what to do regardless of my skill set.  So with a Ph.D in chemistry and 6 years of teaching, I sat in my 10 foot cubicle and did excel spreadsheets to increase company margins.  In my academic role, my other experiences are looked on as an advantage and asset.",
      "author": "04221970",
      "created": 1629406674,
      "upvotes": 16,
      "replies": {}
    },
    "h9jzkoe": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9jzkoe/",
      "text": "Work-life balance is way better than my 80hr/wk consulting gig. Pay and opportunities = definitely a trade off.",
      "author": "Crazy-Analyst",
      "created": 1629393052,
      "upvotes": 8,
      "replies": {}
    },
    "h9kg2qt": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kg2qt/",
      "text": "Humanities. Jobs outside academia largely pay less and require more hours. I don't make the big bucks or teach at a fancy school, but post-tenure I work 40 hours a week, a good bit of it from home. In computer science? No way I'd be in academia.",
      "author": "raspberry-squirrel",
      "created": 1629399944,
      "upvotes": 9,
      "replies": {}
    },
    "h9ky3hj": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9ky3hj/",
      "text": "I’m a faculty in business school so I can’t speak for other disciplines, but there’s no industry I can think of that has the flexibility and work-life-balance that I have right now.",
      "author": "RoseEmpress",
      "created": 1629407234,
      "upvotes": 3,
      "replies": {
        "h9lpean": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9lpean/",
          "text": "Same. And people in business think they would be ceo in industry but they would probably be middle management with lower salaries and benefits.",
          "author": "ThatProfessor3301",
          "created": 1629419452,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h9lbnio": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9lbnio/",
      "text": "Started Phd level in biotech moved to tenured faculty. The biggest difference is the research you do and the (perceived) freedom, as well as teaching availability. In industry, you research what they tell you to - obviously within your area. But the research has to produce tangible, profitable results. Also, 9 to 5 hours are expected for the most part. You can teach if you are near an institution and they offer contracts, but it will be night classes. The academic route is EXTREMELY competitive. This might mean several postdoctoral positions (slave labor) for many years until something is available. Once you do get an academic position, the freedom is wonderful (work hours and research freedom) but the expectations are high, grants are tough to get, and that pesky thing called tenure will loom and wake you up at night more often as it approaches. Post tenure, you can relax. But to make it that far takes about 10 years (postdocs + time being untenured). The academic money is good eventually and so is the job security, but the money was way better in industry. I hope this is helpful.",
      "author": "cameron-muir",
      "created": 1629413052,
      "upvotes": 3,
      "replies": {}
    },
    "h9lzzq9": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9lzzq9/",
      "text": "There is no industry opportunity in the city I want to live, only a university. I put all my eggs in one basket and it worked out.",
      "author": "bunwitch",
      "created": 1629424439,
      "upvotes": 3,
      "replies": {}
    },
    "h9m12r3": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9m12r3/",
      "text": "When I was a post-doc, I was being recruited by a pharma company.  Salary was twice what a starting assistant professor would make (in fact, over 15 years later, I'm only now getting around that salary).  \n\nI talked with a friend that worked for that company and he told me how one day a boss walked into his lab and said we are shutting down the research line on this drug, you are now going to move to a Parkinson's disease lab.  He said he is not a Parkinson's disease researcher, and they said, you are now.  That was a major turn off to me.\n\nIn addition, I really don't like the 9-5 work life.  I may not have much of a work life balance, but I have incredible flexibility in when I work.  That means more to me than almost anything.",
      "author": "manova",
      "created": 1629424961,
      "upvotes": 3,
      "replies": {
        "h9mfdbr": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9mfdbr/",
          "text": "Exactly. I would get pretty depressed if I was forced to stop a line of inquiry, pretty much regardless of the reason.",
          "author": "scintor",
          "created": 1629432439,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9n01nr": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9n01nr/",
      "text": "Every time this topic comes up, I get extremely jealous. So many people mention that one of the biggest perks of academia is that they can make their own hours. In my department, that's not allowed. Everyone has to be in the office at 9 (and you get a talking to if you aren't). One guy's contract didn't get renewed because he left and 4:30 every day despite being extremely productive. These are post-docs and junior lecturers, too. I get interrogated over my sick days. No one that I personally know in industry has ever had to deal with that, so for me it's such an obvious choice even if the salaries were comparable. I can recognize that if you did have more flexibility in academia, it might be a more difficult decision.\n\n\nI can't wait to get out.",
      "author": "goatsnboots",
      "created": 1629447616,
      "upvotes": 3,
      "replies": {}
    },
    "h9kj5zz": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kj5zz/",
      "text": "Research opportunities.",
      "author": "min_mus",
      "created": 1629401219,
      "upvotes": 2,
      "replies": {}
    },
    "h9kv0ny": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kv0ny/",
      "text": ">you don't need to write grants and worry about funding,\n\nThis highly depends on your company and responsibilities within it. I probably spend a quarter of my time chasing funding for myself and those that work with me.",
      "author": "racinreaver",
      "created": 1629405990,
      "upvotes": 2,
      "replies": {}
    },
    "h9l3lh6": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9l3lh6/",
      "text": "It's a combination of things. Part of it is that the work that I want to do may run counter to profit-making industries or at least perceived as such. So while I certainly have skillsets that are employable like coding, statistics, geospatial analysis, etc I am just. Not very interested in most jobs that are very profit extractive. In my field a lot of that is related to climate risk insurance or mapping solutions.\n\nThe second part is because I enjoy the work. I like the research and coming up with projects for grant proposals. I enjoy working with scientists from other disciplines and seeing how our work can combine in new ways to produce new kinds of knowledge. What has been destroying my mental health is the actual job searching. \n\nMy second choice has always been government work, but it is even harder to find well fitting employment for me at most levels. I've turned down city government jobs but have never even been interviewed for a federal or state position. \n\nNevertheless, the realities of the academic job market are forcing me to interview for industry positions because I just can't wait forever for a faculty or permanent research position.",
      "author": "Prukutu",
      "created": 1629409543,
      "upvotes": 2,
      "replies": {}
    },
    "h9lezcv": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9lezcv/",
      "text": "I was 22 and didn't know any better. ;) \\[PhD in English, still in academia after 20 years\\]",
      "author": "mummifiedstalin",
      "created": 1629414573,
      "upvotes": 2,
      "replies": {}
    },
    "h9m9kqz": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9m9kqz/",
      "text": "As it turns out, I don't do well on a regular schedule, hate 9-5, despise offices, and prefer working by myself. The industry jobs that people in my field (not STEM) got pay better and have a better choice of location, but usually involve 9-5 work in office along with meetings and Powerpoint. \n\nAcademia is nice because if I don't like my schedule, I can change it in a few months. A good percentage - half, if not more - of my work can be done on a comfy chair with my feet on the table and in the middle of the night, if that's what I feel like.",
      "author": "wipekitty",
      "created": 1629429233,
      "upvotes": 2,
      "replies": {}
    },
    "h9mf0zx": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9mf0zx/",
      "text": "I wanted complete intellectual freedom to pursue problems that interest me, in ways that are exciting to me.",
      "author": "scintor",
      "created": 1629432242,
      "upvotes": 2,
      "replies": {}
    },
    "h9mmn23": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9mmn23/",
      "text": "The unparalleled freedom to do whatever the heck you want",
      "author": "eggplant_wizard12",
      "created": 1629436999,
      "upvotes": 2,
      "replies": {}
    },
    "h9kskzf": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kskzf/",
      "text": "FWIW, jobs in industry in no way have better work-life balance than in academia. I mean, at least in tech-related fields (tech/software/games/AI)  the career demands are incredibly tough. I came from software, AI, and games, and am now a very happy Professor of Practice (no PhD). I can't even imagine someone saying that jobs in software/CS/AI have better work-life balance than in academia, unless you chose the most mind-numbingly boring no-advacement career job you could find.\n\nSo, I went the other way: spent 20+ years in industry, then came to academia. I'm a professor of practice, so I'm not really \"climbing the ladder\" in academia, and I expect that helps. My work-life balanced is inestimably better in academi than in industrya, even if my pay is quite a bit lower. I have the effective rank of a full professor, having just climbed a different ladder. \n\nFor me anyway, it's worked out incredibly well: I have the effective rank full professor in terms of class loads, committees, etc, and never had to do a tenure case.",
      "author": "iugameprof",
      "created": 1629405018,
      "upvotes": 6,
      "replies": {}
    },
    "h9kqmco": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kqmco/",
      "text": "I wanted to be able to pick what I was working on without being beholden to the almighty dollar... Then during my postdoc I realized professors are slaves to the NIH, so now I work for a device company and love it.",
      "author": "airwalker12",
      "created": 1629404233,
      "upvotes": 2,
      "replies": {}
    },
    "h9ky50r": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9ky50r/",
      "text": "...because I actually love teaching...",
      "author": "printandpolish",
      "created": 1629407252,
      "upvotes": 2,
      "replies": {}
    },
    "h9m1gzm": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9m1gzm/",
      "text": "Why? It’s a dupe. Academia is a cult and you get brainwashed by professors and others who treat everyone who doesn’t land an R1 job like a useless scumbag. I mean after 7 years towards a PhD in that system, what else would you think? People who don’t get academic jobs are quickly branded failures and losers— at least that is how my department operated. It’s been 7 years since I graduated and I honestly feel like that whole mentality — while very much is what makes academia running — is terribly destructive. I’m looking for a way out but it’s not easy when academia is all you’ve experienced for the past 15 years.",
      "author": "Overall_Designer7502",
      "created": 1629425149,
      "upvotes": 1,
      "replies": {}
    },
    "h9n1z9v": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9n1z9v/",
      "text": "Sell out if you want to sure. It’s individual research for research’s sake vs directed research for profit’s sake",
      "author": "djcampers",
      "created": 1629449362,
      "upvotes": 0,
      "replies": {}
    },
    "h9kw8br": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kw8br/",
      "text": "In many ways academia and especially career progression was easier, clearer, and lead to a leadership role.\n\nI liked telling people what to do, and in the software industry you're surrounded by adults who are often better or more senior than you.",
      "author": "lednakashim",
      "created": 1629406478,
      "upvotes": 1,
      "replies": {}
    },
    "h9kyqsk": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kyqsk/",
      "text": "if you only want to do research reality is industry is the best place right now for cs research there are numerous companies that invest large sum of resources in modern cs problems and its not worth it to be in academics for pure research purpose but if you want to teach then you cant do that really outside of academia properly.",
      "author": "PersonalityOk7083",
      "created": 1629407507,
      "upvotes": 1,
      "replies": {}
    },
    "h9lfm5u": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9lfm5u/",
      "text": "I do digital humanities and in every job, I had incredible flexibility. Not being bound by 9-to-5 or coming into the office but rather do WFH a few days a week was really liberating. The pay is better than in alt-ac in my area so that is also an advantage for me. The idea of going on an exploration is what keeps me into academia. I am afraid a regular job would stimy that.",
      "author": "frugalacademic",
      "created": 1629414865,
      "upvotes": 1,
      "replies": {}
    },
    "h9nw2k2": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9nw2k2/",
      "text": "Industry does not give better work life balance, at least not for me.\n\nI worked 48 hour weeks in industry, plus on-call weekends. Post-tenure I work 24-30 hour weeks, and 5 hour weeks over the summer, and I can turn my email off on Friday and not look again until Monday if I wish.",
      "author": "ph0rk",
      "created": 1629468310,
      "upvotes": 1,
      "replies": {}
    },
    "h9un4xs": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9un4xs/",
      "text": "CS, and AI in particular, is an area where industry is ahead of academia. In many other areas, academia is ahead of industry.\n\nThat's a huge part of it. Also, freedom to work on topics of your choosing. Personal autonomy to a degree that is exceptionally rare in industry.",
      "author": "uniadminthrowaway",
      "created": 1629591495,
      "upvotes": 1,
      "replies": {}
    },
    "ha131wr": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/ha131wr/",
      "text": "Couple of reasons.\n\nFirst, I came back into a PhD program from industry, after having spent several years working for a string of crappy companies. Academia seemed like a much better fit, If only because the autonomy and pay relative to my crappy industry jobs were much better.\n\nDuring PhD programs in my field, students are pretty much indoctrinated into the idea that a tenure track position is the brass ring. People who finish a PhD and go on to an industry position are generally regarded as failures.\n\nIt's an antiquated view, especially in view of modern availability, or lack thereof, of tenure track positions. But it persists in my field.\n\nWhat I found didn't quite measure up to what I thought I was going to find, when I finally landed the tenure track position. There was zero work life balance, I was working all the time. And of course, unless you land one of the coveted R1 positions, You're also often stuck trying to burnish your record so that you can trade up. So I was teaching a 4/4 load and trying to research like an R1 or R2 level faculty. Burnout was pretty much inevitable.\n\nI'm much happier in my current position, as a senior level person in industry. I can publish if and when I want to, because I still am involved in research, but my day today is much more mixed and varied. And I don't have to deal with student complaints and emails.\n\nI left only about a year and a half before the pandemic, as well. My decision has been justified almost every day, as I watch former colleagues of mine struggling with teaching in this environment, dealing with students, and seemingly just generally hating life.",
      "author": "waywardacademic",
      "created": 1629725197,
      "upvotes": 1,
      "replies": {}
    },
    "h9k3c7o": {
      "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9k3c7o/",
      "text": "[deleted]",
      "author": null,
      "created": 1629394615,
      "upvotes": -5,
      "replies": {
        "h9kw2uo": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9kw2uo/",
          "text": "I worked with people like your godfather.\n\nThey are awful to work with. Pure tenure abuse.",
          "author": "__x0x__",
          "created": 1629406417,
          "upvotes": 9,
          "replies": {
            "h9mfjvn": {
              "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9mfjvn/",
              "text": "Also an unethical waste of tax dollars. The worst people.",
              "author": "scintor",
              "created": 1629432543,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h9m3572": {
          "link": "/r/AskAcademia/comments/p7ieqa/why_did_you_choose_to_work_so_hard_to_be_a_tenure/h9m3572/",
          "text": "That also sounds like academia of the 70s and 80s that no longer exist. Can't think of many departments that will leave you alone if you decide to go deadwood after tenure.",
          "author": "Overall_Designer7502",
          "created": 1629425959,
          "upvotes": 5,
          "replies": {}
        }
      }
    }
  }
}