{
  "sid": "kmgivw",
  "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/",
  "title:": "Explaining academic accomplishments to competitive parents",
  "text": "Hey everyone,\n\nI am a 26M graduate student who earned my terminal Master's this month with a thesis. Currently, I am enrolled in a PhD institution and will begin my second semester this January. A struggle I am trying to officially reconcile is explaining what I achieved to my parents in a manner that shows them \"why it matters.\" Unfortunately, it is not enough to say to them that I am \"making progress\" despite the nature of graduate school and graduate programs in general being giant time sinks in a lot of ways even if there is no tangible outcome (i.e., something to put on a CV, pay increase, etc.). A lot of it comes from \"why would an employer would care? Who is hiring you?\" etc. Also, my Master's cohort is brought up sometimes as a way to ask, \"Are you doing *better* than them?\" or anything else to allude that I am in a much better position than they are professionally (sometimes personally, like the sorts of partners they have). I should state that my parents have mentioned on multiple occasions they are proud of me. My siblings confirmed my parents are being honest because they state that to others when I am not around. However, it is essentially bragging because they would state I am taking \"the most advanced stats of all time\" or anything of the sort when I took the first level of stats at my current PhD program.\n\nThis gets even worse when my research interests are brought up. Contrary to my username that Reddit made, I am actually in an applied experimental science field. Anytime I bring it up, there is a constant struggle to explain why it matters. Similar to the \"making progress\" problem with my own goals I mentioned in the previous paragraph, they do not see why science as a self-correcting process matters, which parallels why self-correcting myself (by making goal progress) matters. Anytime I bring that up (particularly for theoretical work), its can be things such as \"I don't get it. If it (the theories) were true, just put it down and roll with it. There's no need to update or re-test it.\" Worst case, it's \"I could've told you that.\"\n\nFor some demographic information about my parents: 1.) Neither of them earned a college degree (this makes me a first generation college graduate and the second to earn a graduate degree because my sibling got a non-thesis Master's in one year for accounting). 2.) They are business minded folks and seem to apply that to just about everything, even when it does not translate (assimilation over accommodation). I am VERY worried about this after I am done with my program in four years and what they will think about the job I'll earn (if any). 3.) Growing up, my parents always got excited and would mention my academic and tabletop gaming accomplishments to others (I placed in the top 100 global rankings for a competitive TCG over numerous seasons but I won't mention it by name). The third point in particular was something I needed to \"unlearn\" during my undergraduate days because I realized that I needed to worry about self-improvement and self-progress over getting a leg up on others. I do fall into those old habits sometimes, which unfortunately manifests itself as Imposter's Syndrome and is perhaps the biggest reason why the questions they ask in the first paragraph annoy me (because its almost like they're asking me to create Imposter's Syndrome).\n\nHow do y'all recommend I approach discussion of my academic responsibilities, accomplishments, and prospects in the near future? Thank you.\n\nEdit: I see some folks throwing my age back at me in order to state I should not care about what they think period. I have my boundaries with them regarding what I listen and do not listen to. This situation is certainly the latter. However, I want some sort of rapport with my parents by problem solving this issue as much as I can. So far, it sounds like there is not much I can do and that's fine because I re-work my boundaries with them.\n\nEdit 2: I noticed some folks have the impression I am trying to get approval from my parents or am trying to convince them to value what I've done up to this point. This is not the case but I can see how my post may come across that way. I just wanted to figure out a way to problem solve this that is the most helpful to me. I realize fishing for approval from anyone (parents, peers, etc.) is not the way to resolve these kinds of issues, especially at the graduate level.\n\nFinal Edit: This really blew up! Thank you to the folks that answered my question without making any unnecessary assumptions about my intentions and/or imposing what should be done based on my age. A big thank you also goes to those who shared their stories. I'm glad I'm not alone in with this issue and I also hope that the comments which answered my question can help you all as well. I know I've replied to 2 folks already but I just want to mention that I read every comment as they came in.",
  "author": null,
  "created": 1609255968,
  "updated": 1634081269,
  "over_18": false,
  "upvotes": 147,
  "upvote_ratio": 0.96,
  "comments": {
    "ghetjj8": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghetjj8/",
      "text": "It’s something you have to deal with in this kind of work. \n\nThe other day I told my grandpa I’m going back for yet more schooling, and he said: “more school? Why aren’t you working yet? Getting a little pampered are ya?”\n\nBut my schooling is my work/source of income.... \n\nAnd grandpa... I’m an ecologist, I’d like to take you out on those 9 hour field days lugging equipment up and down the mountain while being swarmed by biting flies and show you how pampered it is! Lol. \n\nYou kinda just gotta accept it and learn to laugh at it.",
      "author": "OrbitRock_",
      "created": 1609264062,
      "upvotes": 54,
      "replies": {}
    },
    "ghewccm": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghewccm/",
      "text": "I always found \"I get paid to go to school\" worked well with people that dont get it.  When asked who would hire you, say \"Intel, Samsung, Apple, Department of Defense, places like that.  They'll either hire people like me, or just give me money to do what I do.\"",
      "author": "bjos144",
      "created": 1609265449,
      "upvotes": 47,
      "replies": {
        "ghewjwq": {
          "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghewjwq/",
          "text": "That could be a good tip in looking up where past graduates went in industry after PhD and just rattling it off.",
          "author": "antisaccade",
          "created": 1609265553,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "ghefqbk": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghefqbk/",
      "text": ">Neither of them earned a college degree \n\nI swear to you I guessed that after reading your 4th of 5th sentence. They literally have no idea what they're talking about, which, I would say, is the gist of the problem; they can't relate to you. My guess is that they were brought up in a period in which high-paying jobs were everywhere and did not require any advanced degree, contrary to today's socio-economic situation, which is a second reason as to why they're not able to relate to you or your achievements.\n\nThe fact that they are bragging about what you are doing whilst constantly talking down your achievements is honestly pathetic, but I think it's somewhat of a trend with parents without college / advanced degrees whose children are enrolled in Ph.Ds.\n\nI don't think you have many options. You either completely cut them for this type of discussion (you're 26, I think you're perfectly allowed to not talk about a topic with them) or try and have a comprehensive discussion with them that'll allow them to understand the difficulty of being a Ph.D candidate.",
      "author": "BelgianWaffle97",
      "created": 1609257053,
      "upvotes": 140,
      "replies": {
        "ghercm4": {
          "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghercm4/",
          "text": "Thank you for the in-depth reply. All I've done this past break is mention what I've been up to recently and I keep that as brief as possible. When I'm back at campus and have those discussions I will keep them as brief as possible and accept they may not completely understand. Fortunately, I have plenty of peers in my previous program and current program who I can discuss these things with so I am not worried about setting up that boundary with my parents.",
          "author": null,
          "created": 1609262980,
          "upvotes": 12,
          "replies": {}
        },
        "ghh632d": {
          "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghh632d/",
          "text": "Yup! Same situation. Parents didnt finish HS and didnt believe Id get into law school, were against me going to law school but now Im a lawyer they brag about it lol",
          "author": "-Just-Keep-Swimming-",
          "created": 1609309767,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ghel98r": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghel98r/",
      "text": "I have this problem with my family and I’ve yet to find a perfect fix.  I did sit my mother and brother down and explained how academia works in my field during my PhD (I.e. expected job progression and timeline, the current job crash and it’s implications on that timeline, the fact that I cannot restrict my job search geographically). It was a difficult conversation as they had engrained ideas about how the job search goes - my dad in particular still believes that my alma mater should want to hire me since they sunk so much time and training into me and refuses to believe me that it is the complete opposite situation.  But it did help them understand what I’m talking about in casual conversation about my work. \n\nHowever, I still have to tell them when my accomplishments are big deals, and that sucks.  They get so excited over my publishing papers, and will post across social media about it, but when I win a prestige grant or land a long-term postdoc position just out of my PhD (both of which happened this year amazingly) they just don’t get that it’s a big accomplishment cuz compared to tenure (which is what they know from TV) it’s small beans.  \n\nI had to describe my defense as equivalent to my brothers wedding to get them to attend.  My therapist and I talk a lot about how disconnected I am from my family because of my career in academia.\n\nEdit: wanted to add that I think switching from calling myself a PhD student/Postdoc to a Scientist helped a lot.  If there’s a more common term for what you study then use it.",
      "author": "MrsAlecHardy",
      "created": 1609259947,
      "upvotes": 43,
      "replies": {
        "ghflv4b": {
          "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghflv4b/",
          "text": "My dad doesn't understand why I didn't search for faculty jobs on by friending people on LinkedIn, why I didn't make extra money during my PhD by selling things on ebay, why I don't pay for conference travel by offering to do travel writing, why I don't get paid to publish journal articles, why I don't write for \"magazines\" people have heard of, etc. \n\nI've just taken to saying \"I'm doing fine my the metrics for my career field,\" and leaving it at that.",
          "author": "fleemfleemfleemfleem",
          "created": 1609278071,
          "upvotes": 16,
          "replies": {
            "ghh8v3k": {
              "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghh8v3k/",
              "text": "Have you seen the PhD Movie(s)? They actually do a really good job relating the graduate school experience, what sorts of things are important, and how it differs from a traditional career. Best part is they're actually funny, and all the actors are real students and professors. It really helped my parents 'get' how my graduate school career was substantially different than my brothers that went to law school or a MBA (and part of why I got paid to do it).",
              "author": "racinreaver",
              "created": 1609312104,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ghf20dk": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghf20dk/",
      "text": "I feel you, my parents like didn't care when I got my first publication. They eventually read it and were like \"I don't understand but good job\" but they didn't understand the importance of a publication. Some random lady that my boyfriend and I met at our celebratory dinner for it gave me more praise than my own damn parents. Lol.\n\nRegarding your edit, there's some topics I just don't discuss with my parents. It sucks, but I do want to have a relationship with them, and a good one if possible, and I've discovered the way to do that is just accept that there's some things they won't understand and that it depressed me to talk about with them. So I don't, and I get praise and validation for those accomplishments from others (and of course myself, which is most important, though easier said than done).",
      "author": "kmalevich",
      "created": 1609268217,
      "upvotes": 15,
      "replies": {}
    },
    "ghepk1u": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghepk1u/",
      "text": "From point #3 I dare say you're talking about MTG, but thats not the point here.\n\nSo, it is difficult to explain \"why\" we, applied scientists (I'm a chemist, former engineer), matter to the general public, outside of academia. I will try to come up with an example.\n\nLet us assume that your parents grew up without internet or computers. Then computers became popular, the internet was removing barriers, knowledge was being shared faster than ever before. This is common knowledge nowadays, as I bet both your parents have smartphones, e-mails and likely a company website. I also doubt all of the money is dealt on paper, calculator and abacus, everything is in digital form. Printers are also going to be common, and they probably have used Fax before.\n\nEverything that I just described came \"out of nowhere\" in the past 50 or 60 years or so. Why? Theory and experiments. Computing was invented, then mechanical computers, then we started to grasp what we could do with it. So, we have some basic knowledge, so let's try doing X and Y in order to see if we can come with up with something new and/or improve an already existing technology - This is applied science, in the broadest of sense. Is there a problem or question unanswered? Let's tackle it and see what comes of it. This is how we get better batteries for laptops and smartphones, new medicine, medical treatments, more safety in transportation, etc. \n\nYour parents are \"practical, hands-on\" people, from your description. Talk in their language - cars, planes, smartphone and laptop batteries, medicine, etc. Those are all common words that everybody is familiar enough to understand. Who wouldn't want a car that is safer, or a laptop with a battery that could last for 12 hours with half the normal weight? You can point to them that, while you are not \" The \" person creating the next generation of \"insert technology X here\", you are giving your contribution to it. A house can be built brick by brick by a single person, but hardly a technology will be completely developed by a single person.\n\nHope I have helped with this wall of text, best wishes.",
      "author": null,
      "created": 1609262091,
      "upvotes": 20,
      "replies": {
        "ghfs5c2": {
          "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghfs5c2/",
          "text": "This is the answer OP needs the most",
          "author": "Oycla",
          "created": 1609281232,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gheus5a": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/gheus5a/",
      "text": "First off, I sympathize with your situation having been there with my parents. I do agree that you should reach a level of acceptance that your parents may never appreciate your work.\n\nHowever, I do think you should work on a compelling \"elevator pitch\" about your research and its practical implications to the world (maybe it's just be but I get a small sense you're resistant or unclear about the need to do this). Even if it's several steps removed. Most of the questions at my defense were about the practical real-world implications of my research when it was really a systematic approach to solve a few particular, focused questions. Having this in your back pocket can help you feel composed when discussing your work when networking at conferences, job interviews, etc.\n\nBreak a leg in your second semester!",
      "author": "antisaccade",
      "created": 1609264673,
      "upvotes": 11,
      "replies": {}
    },
    "ghf2jxy": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghf2jxy/",
      "text": "It sounds to me like your question isn't \"how do I explain these accomplishments to my parents?\" but actually \"how do I get my parents to value my accomplishments?\" Is that accurate?",
      "author": "zinfandelightful",
      "created": 1609268481,
      "upvotes": 5,
      "replies": {}
    },
    "ghfkg8t": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghfkg8t/",
      "text": "long story short: they don't *have* to get it. Them getting it does not have to factor into the quality of your relationship with them. \n\nMutual respect and support (which is important) does not imply 100% approval of all of your accomplishments, decisions, likes, desires and hobbies. Approval is not important. \n\nAt one point, you're going to have to say \"we're not getting much further in these talks. You're just going to have to trust me that my work is fulfilling, important to *some* people, and is putting me on a solid career path.",
      "author": "100011101011",
      "created": 1609277355,
      "upvotes": 7,
      "replies": {}
    },
    "ghehfgn": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghehfgn/",
      "text": "You cold try “I’m adding to the body of knowledge that is science”. \n\nHonestly I think you’re at the point where you’re best served accepting that they don’t get it. \n\nI get you. I run into this constantly when people (especially so my father) asks “when will you xyz”. \n\nBut it’s the same xyz for the last 5 years. Initially the answer was “In x years” but now that’s not even part of my plan. I’ve told him. I’ve explained why it’s not something I want nor something I’ll do. \n\nHe still asks sometimes “so have you xyz” “when will you xyz” from time to time. \n\nIt’s also frustrating that xyz is something I wouldn’t be proud of if I were to do it and I (silently) look down on my peers when they pursue it. \n\n(Don’t bother asking. I’m not going to explain what xyz is. It’s an industry specific, very obvious and easy to point to thing, that I don’t care for. If you want you can imagine it’s “written a textbook” so my day can say “my daughter wrote the book on that”.)",
      "author": "passwordistako",
      "created": 1609257964,
      "upvotes": 18,
      "replies": {}
    },
    "ghex1pz": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghex1pz/",
      "text": "I've been on both sides of your experience (as a son and as a parent), and can relate. My parents rode me until I became tenure track. As a postdoc they referred to me as \"unemployed\". Sometimes I'd bring over an academic friend and when I went off somewhere, my dad would take my friend aside and ask \"Why can't HappyUIUCguy get a job? What's wrong with him?\" \n\nAs a parent, I worry for my kids. Being somewhat competitive myself, I ride them a bit harder than I should, and have learned to back off a bit. \n\ntl;dr -- In my experience, it won't end until you become TT.",
      "author": null,
      "created": 1609265796,
      "upvotes": 6,
      "replies": {}
    },
    "ghf8uy5": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghf8uy5/",
      "text": "I was the first person from my mother's side to go to university, in fact, I was the only one to be in education after the age of 16 (UK, you finish high school at 16 and do \"further education\" until 18 before uni if you want - I think that's changed now but that another story). I went BSc, MSc, PhD, Postdoc, then Research Scientist... There was not much pride until I got my PhD. They understood that Dr was a title, and it was given to highly educated people. Honestly, my family have no idea what I do, I couldn't explain it to them (and my supervisors couldn't explain it to them at my graduation lol), so I gave up. If a professor with 30+ years in my field can't explain it to my mother, then it's impossible.\n\nMy differences I guess is that my family didn't want me to try at the start. They didn't want me to go to university because \"you will just fail, just go work in the new warehouse instead\" and \"minimum wage money now is better than education, you can save money with a real job\". \n\nI can only recommend what I do, so it might not help you. I give them the most dumbed down version of my research that's possible whilst making it sound much more fun and dramatic than it actually is.",
      "author": "PersonalZebra8993",
      "created": 1609271585,
      "upvotes": 6,
      "replies": {}
    },
    "ghf4v23": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghf4v23/",
      "text": "The business world is fast. What can we do today, this week, this month? Academia is slow... what can we do this year? Book projects take years. Big science projects take years. A part of this communication problem is that you don't have tangible accomplishments for today, or this week. Have you tried explaining that your work is a long project?\n\nWe can understand where you parents are coming from, but it seems to me that you also could be better at explaining. \"Making progress\" sounds like weasel words. I would take it as a challenge to practice public science and explain better, in ways that they will understand.\n\nYou are at the top of your game now, and the differences between you and your peers will be smaller and sometimes imperceptible. When I was younger I thought of progress like a pyramid, and the higher you are the more competitive things are, and harder to see differences because everyone there made it to that \"level.\" This is all stuff you can explain to your parents.",
      "author": "IamRick_Deckard",
      "created": 1609269623,
      "upvotes": 4,
      "replies": {}
    },
    "ghehvjz": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghehvjz/",
      "text": "How about just not giving a fuck what their standard for “accomplishments” is and figuring out for yourself whether you are happy with what you are achieving.",
      "author": "omgpop",
      "created": 1609258201,
      "upvotes": 25,
      "replies": {
        "ghfs19t": {
          "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghfs19t/",
          "text": "Some people are worth giving a fuck about. They don’t sound abusive, rather they seem to lack the resources to understand their son’s career. A little empathy and patience would go a long way here.",
          "author": "Oycla",
          "created": 1609281174,
          "upvotes": 6,
          "replies": {
            "ghftoso": {
              "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghftoso/",
              "text": "It’s not about disregarding the parents as a whole, but part of growing up is learning to hold yourself to your own standards and not those of others.",
              "author": "omgpop",
              "created": 1609282021,
              "upvotes": 1,
              "replies": {
                "ghfuala": {
                  "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghfuala/",
                  "text": "Being confident about one’s choices and letting your parents understand them are not mutually exclusive positions. \n\nI agree that it’s important to own one’s thought-out career path regardless of people’s approval, but it seems OP is already past that stage, or they wouldn’t have enrolled on a PhD program in the first place.",
                  "author": "Oycla",
                  "created": 1609282336,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "ghfewrz": {
          "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghfewrz/",
          "text": "for real. not to rag on OP, but hopefully they learn this sooner rather than later",
          "author": "f33dmewifi",
          "created": 1609274582,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gherng8": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/gherng8/",
      "text": "Well done on accomplishing everything you have as a 1st gen student!\n\nThey won't get it, so don't put it out there. Don't give them that much detail. Just say you're still in coursework, learning the math you need, working in a lab, etc.",
      "author": "lucianbelew",
      "created": 1609263128,
      "upvotes": 5,
      "replies": {}
    },
    "ghflzpe": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghflzpe/",
      "text": "They're your parents, and it sounds like you want to have a good relationship with them, and would like them to at least validate your choices -- after all, your choices to go into academia and conduct research are indicative of who you are as a person. I get that, and I think the way you're dealing with it is actually pretty healthy. Kudos. (Also kudos to you for recognizing that we have to unlearn a lot of the \"graduated in the top 10%!\" and other similar ways of measuring academic achievement in order to be healthy. It's hard but it's doable.)\n\nThis whole thing is a great exercise for your future career, inside or outside academia, and working with media. Learn how to promote yourself in a healthy way. Learn how to promote science and why you deserve money. It's not comfortable, but like a well-written lit review, is a necessary skill.\n\nI totally understand how it could be difficult to explain the point you're at in your studies to people who have spent their professional lives looking at things in terms of months or quarters, or a year (maybe YoY) at most. But they probably had to grow and show that they were ready to move on to the next part of their business careers. I don't know their stories, but I can bet they didn't start out by just starting a business with money that appeared out of thin air. They had to prove to people that they could manage a store, or that their business idea was good enough for a loan. Essentially that's what you're doing right now -- proving to people that you can do this work, and learning every day and getting better at it. And you're being paid for it! Just like they got paid for their work, where they were progressing every day, too. Think of it in those terms. They're all steps toward a goal. While the goals don't mirror each other, you can probably find a way to describe it like this. Maybe that could help?\n\nIs there a good example in your field of how science has shown us something we knew instinctively to be true, but that now that we \\*know,\\* it opens up a whole new world of possibilities? Or when by testing a well-worn theory, we actually found out something we didn't know before? I live in the social sciences, so this is always a struggle for me, too -- I hear \"I could have told you that!\" or \"that's too fuzzy for me (subtext: not real science),\" from my own mother, an engineer. Showing them some of the crazy things we found out because we kept poking at an idea, and how we all benefitted, could be a way to win them over to this slow-moving incremental world : )\n\nAnd a thumbs up to the idea from u/bjos144 for assuaging your parents' fears: where do people in your program get placed for postdocs or jobs? A simple \"Don't worry, mom, everyone who graduated last year got a job,\" and \"We have great contacts at (company) and (school) and (organization) and they like hiring our graduates,\" could go a long way. You're not responsible if they want to go and tell their friends you \"Could get hired XXXXX\" because that's in their operating system; they just want to know you're going to have a better life than they did. It's clear that they love you, and they are proud of you -- but they're just worried about you because they don't fully understand what's happening. (Unfortunately, I have no idea how to talk them off the \"are you doing better than everyone else\" ledge, because it's clear they're drawing apples to broccoli conclusions there.)\n\nWishing you the best.",
      "author": "champagnemonsoon",
      "created": 1609278135,
      "upvotes": 2,
      "replies": {}
    },
    "ghg8pw3": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghg8pw3/",
      "text": "On one hand, give up. You're in a world now that is completely alien to them. They will *never* be able to relate to your work or why you think it's important. This is what they don't tell you about being 1st generation: it's terribly lonely. You're forever isolated by the experience from your family. \n\nInstead, build common interests with them that don't focus on work. Learn to bake and share recipes with your Dad (an interest in old family recipes has served me well). Talk to your Mom about relatives, family history, or anything else she might be interested in. But don't expect them to understand even remotely what you're doing-- it took you over five years to understand it, and it was explained to you by professionals with way more experience than you have under your belt. \n\nPart of the problem is one of communication, I think. This process isn't just about doing, it's also about becoming. It's reshaping yourself to interact with the world in a way that is really alien to most people. Some of us reshape a little, some a lot, but no one who hasn't been through the experience can really understand it. And even many of those who have been through it *still* can't relate to others who have, because their experiences/disciplines are so different. \n\nNow, on the other hand, I have found it *incredibly useful* to try to reframe what I'm working on in such a way that a family member (who is usually a tolerant listener, at least for the first five minutes) can follow what I'm doing. Usually it begins with, \"here's why this question is important,\" or \"here's why people think this is an important thing to do.\" Then there's some analogy that provides a point of reference (in my case, usually something about movement and real-world objects) through which I can try to explain how I'm addressing the question. This rarely has a big payoff for me, and I'm not sure that it helps them understand what I'm doing. But they do understand that I'm doing *something*, that I think it's important, and that other people do, too. \n\nFor example, \"why are you running this experiment again?\"\n\n\"Well, because sometimes there are little differences, and those differences can help me and my colleagues understand where our explanation doesn't quite fit right. It's a lot like refining a cake recipe: you can just bake the same thing, over and over. Sure, it works fine; but you know it's just not quite right. Maybe not enough chocolate. Maybe it's the vanilla extract. So you try and try to get it closer to how it should be-- like Gran's cake. You run the experiment again and again. And one day you figure it out: it's coffee. She put coffee in the mix. Then you write it down on Facebook so everyone knows, and you're on to the next thing, because the cake is closer, but it's still not right.\"\n\nIt's a vastly oversimplified example, but I have a lot of conversations like these. Every once in a while it really helps me to clarify a sticking point in my chain of reasoning!",
      "author": "7Sax",
      "created": 1609289972,
      "upvotes": 2,
      "replies": {}
    },
    "ghgd5eo": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghgd5eo/",
      "text": "In my opinion you can’t ‘get rid of’ your family, so try to keep some distance. I know I sound agressive but that’s how I did with my life. I can’t stand living under the same root with them, our mindsets are different and I can’t changing the way they were raised and thought. I came from a small town, then I couldnt have it anymore and I moved to a city when I turned 15. Moved abroad again at 18 and now Im happily pursuing my academic career. My relationship with my parents got much better ever since I stopped talking much to them. Now all we talked about are health, news at home, not a word about study and work. As long as they don’t ask, i will never bringg the topic. And even if they do, ignore it cuz they don’t and won’t understand you so why bother to try.",
      "author": "overwhelming_pumpkin",
      "created": 1609292316,
      "upvotes": 2,
      "replies": {}
    },
    "ghejvw8": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghejvw8/",
      "text": "IMO it’s kind of futile trying to explain academia to someone who’s not in it. In my experience, no matter how much I explain it, the other party just thinks it’s harder undergrad.",
      "author": "ProfZuhayr",
      "created": 1609259251,
      "upvotes": 3,
      "replies": {}
    },
    "ghele3n": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghele3n/",
      "text": "I can see your point but also their point. \n\nDo you have a sense of how employable you will be with a PhD in your field? Talk to them about that and about potential earnings. Let them know it's a long term endeavor and that there are not small wins along the way like there may be in other fields.\n\nHonestly, if you have no idea how employable this makes you then I totally side with them. Nobody (who is not independently wealthy) should stay in school for 10+ years without knowing where they are headed.",
      "author": "ThatProfessor3301",
      "created": 1609260017,
      "upvotes": 4,
      "replies": {}
    },
    "gheianv": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/gheianv/",
      "text": "I would suggest first trying to explain to them how the whole thing works, if they are not familiar with the academic system (this part is probably common in first gen students). \n\nAnd then if the problem persists, maybe the better strategy is to “not play their game”. I know people who have parents that constantly want their children to prove that they are “good kids” or to provide their parents with information that they can brag about among friends. But this leaves the student sometimes consciously or unconsciously ending up living for the approval of others, which is probably not the healthiest way of living.",
      "author": "dasisteinwug",
      "created": 1609258426,
      "upvotes": 2,
      "replies": {}
    },
    "gheqp27": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/gheqp27/",
      "text": "One thing you can try is to have them read about the experiences of someone in grad school.  I like \"The PhD Grind,\" (https://web.archive.org/web/20190930200154/http://pgbovine.net/PhD-memoir/pguo-PhD-grind.pdf).",
      "author": "cwkid",
      "created": 1609262657,
      "upvotes": 2,
      "replies": {
        "ghey5xn": {
          "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghey5xn/",
          "text": "They don't sound like the type of people who would read 107 pages...or at all",
          "author": "mysteriousKM",
          "created": 1609266341,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "ghenq67": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghenq67/",
      "text": "You're 26, does it really matter what mommy and daddy think at this point? Just do your thing.",
      "author": "orangeblackteal",
      "created": 1609261183,
      "upvotes": 1,
      "replies": {}
    },
    "gheyth4": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/gheyth4/",
      "text": "Well honestly its probably a good motivator to finish your PhD on time or sooner!",
      "author": "mysteriousKM",
      "created": 1609266662,
      "upvotes": 1,
      "replies": {}
    },
    "ghf8857": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghf8857/",
      "text": "Lol I love how your parents are saying you're taking the \"most advanced stats ever\". My dad never went to college and has never taken past algebra for math and kept telling me he wanted me to take calculus because it was \"the most advanced math\".",
      "author": "Stereoisomer",
      "created": 1609271272,
      "upvotes": 1,
      "replies": {}
    },
    "ghf89x2": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghf89x2/",
      "text": "I think it's awesome you're working on your relationship with your parents. It'll be one of the most challenging endeavors you embark on, particularly when they are clear about their own values. And more so if they don't see the subjective nature of such things. You can learn a lot of useful things about yourself in the process of reconciling your sets of world views if you are contemplative, reflective and examine the evidence carefully. Keep asking others what they think and keep making your own decisions as you go. \n\nGood luck and kia kaha!",
      "author": "LargePiece",
      "created": 1609271297,
      "upvotes": 1,
      "replies": {}
    },
    "ghfbsy2": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghfbsy2/",
      "text": "I’ve long given up trying to explain these things to my parents. I’m actually jealous: they actually will talk to you about theories? My parents just shrug and go “Well, I can’t make a word out of what you’re saying” even for the simplest of concepts. \n\nMy parents do not need to be that involved in my academic life for me to be happy or for us to have a healthy relationship. I just reassure them that the skills I am gaining are competitive *for people who will be hiring me* and that puts them at rest. That’s all they really care about at the end of the day - I will be self-sufficient.",
      "author": "barkupatree",
      "created": 1609273040,
      "upvotes": 1,
      "replies": {}
    },
    "ghfcql0": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghfcql0/",
      "text": "I wish I had been questioned a bit more about the occupational relevance of my studies.  I think many ph.d students understandably become so immersed in academia that they don't think about alternatives until the harsh reality of the job search.",
      "author": "yankeegentleman",
      "created": 1609273503,
      "upvotes": 1,
      "replies": {}
    },
    "ghfeep4": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghfeep4/",
      "text": "Well I can tell you one thing mate I'm applying for phds that I graduated from an IIT and have masters from top 10 uni and still my dad thinks I shouldn't do a PhD given the \"Package\" after I do a PhD. he's a guy with two masters back in the day. He thinks I should study for IAS and get it in four year if I had the time to do a PhD and it goes on. Anyway, the point is I personally gave up on explaining and I just say this is what makes me happy and I'll earn enough to live in someway or other. Usually, that's enough and ofcourse they're not really happy with the response but can't say much after it too.",
      "author": "Unchained064",
      "created": 1609274333,
      "upvotes": 1,
      "replies": {}
    },
    "ghg2k6o": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghg2k6o/",
      "text": "Well, given that you're in a (hopefully) funded PhD program, one option would be to say that X and Y (the companies/institutions providing the funding) are super interested in research in Z, and that you are paid to research it :-). Supply and demand! Business! They ask, you provide :-).",
      "author": "Galois1355",
      "created": 1609286704,
      "upvotes": 1,
      "replies": {}
    },
    "ghg83v1": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghg83v1/",
      "text": "I would say that you shouldn't feel the need to justify or explain yourself to them. I get it, but at some point you just gotta let go. This isn't about competition. That is a shitty attitude to have towards most things.",
      "author": "RuthlessKittyKat",
      "created": 1609289656,
      "upvotes": 1,
      "replies": {}
    },
    "ghh3eaj": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghh3eaj/",
      "text": "Just a few days ago my dad told me that I should walk up to my PI and demand a pay raise since I have been working for him long enough. \n\nSorry, I don’t have any advice for you, but I know the struggle!",
      "author": "FruityTeam",
      "created": 1609307725,
      "upvotes": 1,
      "replies": {}
    },
    "ghelztl": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghelztl/",
      "text": "One issue you've got is that no matter how you explain it, you aren't going to satisfy them. It's because they are using a different standard of measurement. So, the question is: do you care if they are happy with you? Or do you want them to STFU?\n\nIf you want them to be happy with you then you can tell them that you get a lot of personal and professional satisfaction out of it. That some very, very expensive and time consuming things are innately rewarding and don't have a return. Like having kids. Like being an elite athlete. Like the Peace Corps. Like Church. Sometimes it ends up creating opportunities, sometimes it doesn't. But return on investment isn't why you do it. If you go down this road be prepared to repeat yourself because it isn't going to work the first time.\n\nIf you want them to STFU, then say the very nature of their question indicates they will never understand so you aren't going to bother explaining it to them. It isn't that they are too uneducated - it is that they don't care enough to see things from your point of view. If they did, the answer would be obvious. So you aren't discussing it again.",
      "author": "ourldyofnoassumption",
      "created": 1609260322,
      "upvotes": 1,
      "replies": {}
    },
    "gherhli": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/gherhli/",
      "text": "I went through this book yesterday (found the recommendation on this sub) [https://www.goodreads.com/book/show/46074.Limbo](https://www.goodreads.com/book/show/46074.Limbo)\n\nSome parts are a bit long, but it can me really eye opening. It was for me as a 1st gen university student of parents that didn't complete a high school degree. I totally get you. They will never understand, but hopefully they will be happy that you do what you like and are happy.",
      "author": "jtmooon",
      "created": 1609263048,
      "upvotes": 1,
      "replies": {}
    },
    "ghgbqb7": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghgbqb7/",
      "text": "\\>  I am a 26M graduate student who earned their terminal Master's this month with a thesis. Currently, I am enrolled in a PhD institution and will begin my second semester this January. \n\nIf it's you, why don't you say \"my\" instead of \"their\" about your degree?",
      "author": "shinypretty",
      "created": 1609291555,
      "upvotes": 0,
      "replies": {
        "ghgfcg7": {
          "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghgfcg7/",
          "text": "Mistakes happen. I fixed it for you.",
          "author": null,
          "created": 1609293492,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghek98s": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghek98s/",
      "text": "Are your parents babyboomers? Mine are. I'm in the same boat. Everyone i know that is in the same boat have baby boomer parents. Post-secondary was a privilege back then, not a necessity to survive life like now. They just don't understand what you're doing.",
      "author": "fireguyV2",
      "created": 1609259443,
      "upvotes": -3,
      "replies": {}
    },
    "ghficp8": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghficp8/",
      "text": "My sweet friend, this is a question for your therapist and perhaps some trusted peers. Everyone has been extremely kind. You might be wise to spend more time considering your audience.",
      "author": "SpecialRX",
      "created": 1609276301,
      "upvotes": -1,
      "replies": {}
    },
    "ghejy1q": {
      "link": "/r/AskAcademia/comments/kmgivw/explaining_academic_accomplishments_to/ghejy1q/",
      "text": "You're wasting your life, so I can see why they're trying to salvage something out of it. \n\nI'd just suggest focusing on the practical ramifications of what you're doing and explain you're more of a really underpaid research assistant than a student.",
      "author": "gumpymiddle",
      "created": 1609259281,
      "upvotes": -25,
      "replies": {}
    }
  }
}