{
  "sid": "o1wvcu",
  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/",
  "title:": "Career failure stories",
  "text": "Academia is cut throat and MANY people fail in achieving their goals but don't talk about their failures. \n\nWould anyone here be open and discuss their failures in academia and how they gave up and moved on to other paths?\n\nI think this could be a great learning experience",
  "author": "SoybeanCola1933",
  "created": 1623935405,
  "updated": 1634080546,
  "over_18": false,
  "upvotes": 256,
  "upvote_ratio": 0.97,
  "comments": {
    "h235akf": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h235akf/",
      "text": "Depends on what you consider a failure.\n\nI know of two people who never finished their PhDs and are much happier for it. I also know people who have completed PhDs who are working in fields way outside their research topic. All of them seem pretty happy with their choices, even though both situations could be seen as a failure in a way.",
      "author": "Awkward_Dog",
      "created": 1623936677,
      "upvotes": 136,
      "replies": {
        "h2377hs": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2377hs/",
          "text": "[deleted]",
          "author": null,
          "created": 1623937630,
          "upvotes": 113,
          "replies": {
            "h23g26n": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23g26n/",
              "text": "Salary is a big issue in academics. A lot of people try to sell the prestige of a research professor. When it comes down to it you have to pay the mortgage/rent and put food on the table. Sometimes a better position exists at the Masters level. A degree should enable one to earn a living, not be a trophy to put on a shelf.",
              "author": "hdorsettcase",
              "created": 1623941673,
              "upvotes": 67,
              "replies": {
                "h2c69id": {
                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2c69id/",
                  "text": "I am from India, I am only 20 years old, I believe I will shortly graduate with a Life Sciences BSc, and I had decided months ago I'd try to become a university professor if I cannot join the military/police. My dad is a secondary school teacher. Your post really did help my bias, \"A Degree should enable one to earn a living, not be a trophy to put on a shelf\" I completely agree you with this, but I do feel bad about how painful living life is in general, even today. Thanks.",
                  "author": "GonnabeDetective",
                  "created": 1624120586,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "h246s5d": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h246s5d/",
              "text": "Regarding your return to a PhD, do it for you not for any one else",
              "author": "Jesussbf",
              "created": 1623952818,
              "upvotes": 17,
              "replies": {}
            },
            "h24ut5v": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24ut5v/",
              "text": "I'd just like to note, that for many disciplines there is no such thing as \"industry\", let alone one with available jobs and good salaries.",
              "author": "doornroosje",
              "created": 1623963002,
              "upvotes": 13,
              "replies": {}
            },
            "h23cyv2": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23cyv2/",
              "text": "What's your job, if I may ask?",
              "author": "cowsniffer",
              "created": 1623940293,
              "upvotes": 3,
              "replies": {
                "h23eg5e": {
                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23eg5e/",
                  "text": "Sure, the recent promotion was to director of research of a small research team. Prior to that promotion I was a statistician.",
                  "author": "Weird_Surname",
                  "created": 1623940957,
                  "upvotes": 21,
                  "replies": {
                    "h23fhew": {
                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23fhew/",
                      "text": "Interesting! Director of research for a small research team sounds exactly what I would want. Would you mind elaborating a bit, please?",
                      "author": "isodoria",
                      "created": 1623941416,
                      "upvotes": 12,
                      "replies": {}
                    },
                    "h242yf7": {
                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h242yf7/",
                      "text": "I’m curious if you had faced a rocky road going into industry research after graduating with a Masters. I’d love to be involved with data science and research (more so implementations) but find myself struggling so far with a masters.",
                      "author": "WirrryWoo",
                      "created": 1623951223,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "h23kp20": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23kp20/",
          "text": "This. You can also switch to industry roles if you don't make tenure, and you can see it as growth or change or different  experiences and not necessarily failure.",
          "author": "Careful-Jelly-9857",
          "created": 1623943490,
          "upvotes": 8,
          "replies": {}
        },
        "h2c7cjm": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2c7cjm/",
          "text": "Yep, my Ph.D. cohort was 5 people. One quit after the first year and went into Public Accounting and is doing great. Another was \"invited to leave\" after 4 years (he couldn't get going on his dissertation for 2 years)and is not vice president at a bank. He has 3 kids now and vacations all over the world.\n\n3 of us graduated, I got tenured at a decent mid-range school while the other two floundered and bounced around alot, before settling at the same very low end teaching school. \n\nWhat is failure? I dunno. I guess I know 2 faculty who have taken their own lives. Another got into drugs and stopped teaching, it took like 3 months to fire them but I don't know what happened after that. \n\nI know several people who didn't get tenure. In all but 1 case they just went to another school and got tenure eventually. The one who didn't went into industry (IT security consulting) and is doing quite well.",
          "author": "fsu23phd",
          "created": 1624121125,
          "upvotes": 1,
          "replies": {
            "h2c7dp2": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2c7dp2/",
              "text": "Failure is the state or condition of not meeting a desirable or intended objective, and may be viewed as the opposite of success. The criteria for failure depends on context, and may be relative to a particular observer or belief system.\n\nMore details here: <https://en.wikipedia.org/wiki/Failure> \n\n\n\n*This comment was left automatically (by a bot). If something's wrong, please, report it in [my subreddit](https://www.reddit.com/r/wikipedia_answer_bot).*\n\n*Really hope this was useful and relevant :D*\n\n*If I don't get this right, don't get mad at me, I'm still learning!*",
              "author": "wikipedia_answer_bot",
              "created": 1624121140,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h23avjx": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23avjx/",
      "text": "I am in the process of failing!\n\nI did a great Ph.D. in Applied Mathematics in a top worldwide institution. Had fun, it was amazing, I 100% enjoyed it, did great research, my advisor loved me, I totally would do it again. \n\nUnfortunately, my advisor was in the transition period between two areas, and I was, in a way, the last student in the first area. So towards the end of my Ph.D. research topics, I was kinda left on my own. Not bad, I love to work on my own, but it had consequences that now, after 3 years, I could understand.\n\n After the wonderful period that is a Postdoc hunt, I landed a 6-year term position in an ok-ish university. The trade-off? 4 hours of teaching. \"I can certainly do it, it will be a piece of cake\", I thought. \n\nWell... I did not. In these last 3 years, I have in total published 2 papers, and currently, I have nothing close to finishing. I have worked my ass off in this time, but the teaching load was much more than expected (for many reasons, between learning a new language, and the culture of my host country, it could some weeks take 120% of my work week), also external circumstances changed (During my Ph.D. I was alone and I could work 12 hours non-stop without noticing, now I have someone in my life who gets angry if I work too much, among other things.).\n\nFurther mistakes from my side:\n\n \\- I did not build a collaboration group. Since all my \"Ph.D. siblings\" were from another area, and my advisor too, after my Ph.D. I ended up without any collaboration network. Afterward, I got too focused on working hard and hyper-focused on a single project in my new institution, that I never build such a network.\n\n \\- In my solitary research path, I have started many many many projects which I have later abandoned to be not good enough. In hindsight, I should have tried to make the most of these projects, but I am unsure if I would be happy publishing only mediocre-value incremental research. \n\nOverall, as the saying says. \"Work smarter, not harder\". I think I failed at this fundamental principle.\n\nOn the positive aspect, I was never completely blind to the possibility of moving to industry, and I diverted part of my efforts in these years to master programming (luckily, very useful as an applied mathematician). So currently I am in the job market seeing the options. It does not seem so daunting, at worse, I can take an entry-level programming job. But before surrendering to that fate, I'm hoping to land a data scientist job.\n\n On the sad part, my area (medical imaging), got eaten alive by machine learning, and unfortunately, I have no research in that area. So it is unlikely that I will land a position in this topic (and most of the big companies that develop these things have laboratories in the middle of nowhere. ) So likely most of my true expertise will be lost in this transition. But I gotta say that I am ok with it.\n\nI think the harder step is regarding my own identity. I have been identifying as a researcher, and a mathematician, for years. I have based my life objectives in this direction and suddenly I am starting to wonder what will my future objectives be. I am sure I'll sort it out, but I gotta say that this is what has hit me the hardest.",
      "author": "panchoop",
      "created": 1623939335,
      "upvotes": 103,
      "replies": {
        "h23tycz": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23tycz/",
          "text": "As a person who works in imaging and inverse problems - it should be rather easy for you to transition from classical medical imaging to machine learning.  They are really just two different ways of mapping between two spaces :-)",
          "author": "MarineProf",
          "created": 1623947440,
          "upvotes": 24,
          "replies": {
            "h24nhax": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24nhax/",
              "text": "I know, I am very aware that machine learning, superficially, has not that much difficulty. My issue is that  <now> I need to put these skills in my curriculum, as it is the only thing the industry asks for.\nI am currently working on some toy projects to learn and put these things in my CV, it will just take some time.",
              "author": "panchoop",
              "created": 1623959893,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "h24gtk5": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24gtk5/",
          "text": ">I think the harder step is regarding my own identity. I have been identifying as a researcher, and a mathematician, for years. I have based my life objectives in this direction and suddenly I am starting to wonder what will my future objectives be. I am sure I'll sort it out, but I gotta say that this is what has hit me the hardest.\n\nI feel you. I think a lot of people have this thought.",
          "author": "Hot-Pretzel",
          "created": 1623957065,
          "upvotes": 14,
          "replies": {}
        },
        "h23zpmf": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23zpmf/",
          "text": "I would say not to worry about machine learning coming up as I do not think it will replace *everything* (as the hype would let us believe). As I see it, there are more and more people becoming machine learning engineers nowadays (even fewer understanding the mathematical fundamentals), making your area, in a way, rare and most importantly, highly desirable. Want to become even more desirable? Do both. \n\nPS: Switch to imaging in radio astronomy, the people are really nice ;)",
          "author": "Mathemachicken4",
          "created": 1623949877,
          "upvotes": 9,
          "replies": {}
        },
        "h24v3qv": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24v3qv/",
          "text": "thanks so much, this is really useful. None of my phd colleagues do anything similar than I do, and i do have the tendency to take on too many side things, this is really good advice.",
          "author": "doornroosje",
          "created": 1623963128,
          "upvotes": 3,
          "replies": {}
        },
        "h23va40": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23va40/",
          "text": "4 hours of teaching per day?",
          "author": "ilovemacandcheese",
          "created": 1623948004,
          "upvotes": 2,
          "replies": {
            "h24k9k7": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24k9k7/",
              "text": "No, per week. But it is exercise style and it I coudes preparing exercises for the students every week for them to present.",
              "author": "panchoop",
              "created": 1623958538,
              "upvotes": 3,
              "replies": {
                "h24ldp8": {
                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24ldp8/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1623959006,
                  "upvotes": 3,
                  "replies": {
                    "h24lzla": {
                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24lzla/",
                      "text": "I thought the same.",
                      "author": "panchoop",
                      "created": 1623959264,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "h24v8xn": {
                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24v8xn/",
                      "text": "four hours of teaching means like 2 hours of 2 classes. Creating totally new classes from scratch (which i did this year) takes me like 2 days per class at the bare minimum. and then we haven't mentioned student communications, exams, grading, etc.",
                      "author": "doornroosje",
                      "created": 1623963189,
                      "upvotes": 3,
                      "replies": {
                        "h251ods": {
                          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h251ods/",
                          "text": "Yeah, more or less. In my case, I had to do exercises courses for Master studies, and, for some reason, the professors here do not have a \"battery of exercises\". I managed to get some material but also \"the material should not be the same every semester\"... The worse part is that these master courses barely have 1 reference book, which has no exercises, so searching for adequate problems has been a permanent pain. Furthermore, many of the courses I had to give were ones I did not have in my own universities, so not only I have to prepare material, but I had to learn and study a course before doing so. (and don't get me started with course rotations, getting prized with new courses when I finally managed to hold a conversation in this country's language, coronatimes, etc) \n\nWhat makes things worse is that since these are exercise courses, they do not count as \"true teaching\" for an academic curriculum, so essentially, it is time thrown into the void. Somehow, one has to compete with postdocs with no teaching duties in an extremely competitive environment with much less available time. \n\nI really had a love for teaching, so I would divert more time to prepare good, well rounded exercises. This is something that I completely regret. Once I came to realize that every minute spent teaching is a waste of your research time, I decided to throw my perfectionism out and have a full careless approach of it. Ultimately, this made me hate teaching and currently I despise every minute I waste in it. \n\nOn the good side, I no longer see a future as a professor as a dream job. I'm certain that I won't look back once I'm out.",
                          "author": "panchoop",
                          "created": 1623966076,
                          "upvotes": 6,
                          "replies": {
                            "h25qx5t": {
                              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h25qx5t/",
                              "text": "\"Every minute spent teaching is a waste of your research time\".\n\nThis frustration is pretty audible. I can feel you. In a developing country where I work, I have to teach for 26 hours per week. The times at which I have to attend to the concerns of my students, grade their papers, and prepare for my next day's discussion are not yet included. The only time I could think about the research I want to pursue is during a midyear or Christmas break. I only had 1 publication last year and a paper that was just rejected this year.",
                              "author": "DaphneMores",
                              "created": 1623979067,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        },
                        "h2519h7": {
                          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2519h7/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1623965885,
                          "upvotes": 4,
                          "replies": {
                            "h254b4h": {
                              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h254b4h/",
                              "text": "Depends on how and what are you teaching. If you are teaching the same course you have done in the last year, with a script that barely moves from the previous years. Yeah, easy peasy.\n\nBut the case in which one has to create new material for every week is on another scale of time consumption.",
                              "author": "panchoop",
                              "created": 1623967310,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h240uh9": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h240uh9/",
      "text": "I submitted my PhD the same week covid lockdowns happened and my examiners failed me. My supervisor reviewed my chapters over a week and most comments consisted of “I don’t like this picture.” She resigned a week after I submitted and couldn’t make a case to defend me so it was left in the hands of other academics. We tried to refute the examiner decision but the Dean of Graduate Studies said “Masters or nothing.” The Dean also came from the same faculty and had a notorious hate relationship with my supervisor so I don’t know if it was all politics. The 1 year anniversary of the failure news is coming up, I still haven’t told my grandparents about my big screw up and they’re still telling everyone I have a PhD. \n\nI’m trying to get an industry job with my masters, but I’ve also had a lot of teaching opportunities during my studies and am currently working as a tutor on the side. Aside from that, I really have no idea what I’m doing. \n\nTo repeat what someone previously said, get therapy.",
      "author": "Raelynndra",
      "created": 1623950351,
      "upvotes": 51,
      "replies": {
        "h24vi0b": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24vi0b/",
          "text": "jesus i am so sorry, you have been horrible fucked by your supervisor AND your university. fucking cowards.",
          "author": "doornroosje",
          "created": 1623963297,
          "upvotes": 26,
          "replies": {
            "h26gew2": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h26gew2/",
              "text": "Thanks and yeah, it sucks. I suffer the consequences and everyone else gets away scot free.",
              "author": "Raelynndra",
              "created": 1623994336,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h26h1m1": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h26h1m1/",
          "text": "I feel like I went through similar, except in a different field - my supervisor was difficult.\n\nI don't know if it helps but after I left my program I found something I was interested in and started submitting papers for publication. It's hard work doing it outside of a research environment - especially accessing papers and texts - but it's kept me going. Good luck!",
          "author": "Cocanola",
          "created": 1623994812,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h238mr8": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h238mr8/",
      "text": "I just want to say that I loved reading each and every comment here and found them encouraging. Thank you all for sharing!",
      "author": "PhyzzyKitty",
      "created": 1623938295,
      "upvotes": 44,
      "replies": {}
    },
    "h242yof": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h242yof/",
      "text": "15 years ago, my spouse entered a top 10 PhD program in his field, because he didn't know what else to do, he thought it sounded fun, and he felt honored to be accepted into such a prestigious program. It took him 10 years to get his PhD. His PhD program was super toxic, too, but I won't get into that right now.\n\nIn the five years since, we have moved twice, to a new state each time. He has had some interviews here and there for tenure track positions, including a couple of on-campus interviews, but he has never gotten an actual tenure track offer. He has only held lecturer and VAP positions since finishing his PhD. In fact, he's very lucky to be employed at all right now - a school where he knew people needed a VAP last minute and that's how he got his current position.\n\nMy spouse is currently looking into transitioning from faculty to staff, and has been trying to build his network accordingly. A year ago, he came fairly close to getting a decent staff job at a state school on the East Coast, but the school implemented a hiring freeze due to COVID, which took away that opportunity. My spouse has never had a job outside of higher education and he fears that his PhD would be a liability when applying to industry jobs (because \"overqualified\").\n\nUntil this school year, my spouse and I made the same amount of money, despite the fact that I only have a liberal arts BA. Even now, he doesn't make much more than I do. I'm currently working on another degree in something more employable, so that I can get qualified for a better job with a salary that can support both of us.\n\nI get a lot of downvotes around here for discouraging people from going to graduate school, especially PhD programs, but the truth is that grad school isn't always the right decision and the vast majority of PhDs will never get a tenure track job. So many people, including my spouse, think that if they work really hard, get a PhD from the right program, have the right advisor, and get the right number of publications in all the right journals, that they will certainly beat the odds and get a tenure track position, but (while those things are generally helpful) that's not quite how it works. There are literally hundreds of applications per TT position, at least a few dozen of those are everything the department is looking for and more, it's a total crapshoot. Not to mention that the frequent moves (from one post-doc or temporary teaching position to the next) make it difficult to settle down, buy a house, and/or have a family, if that's your goal.\n\nTL:DR my spouse entered a PhD program without much understanding of what he was getting into, he got his PhD but it hasn't worked out very well for him career-wise.",
      "author": "AcademicSpouse",
      "created": 1623951226,
      "upvotes": 44,
      "replies": {
        "h24512m": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24512m/",
          "text": "My spose with a BA makes twice what I do with a PhD. I think there's this attitude of, \"You're in this for your passion, not the money,\" in graduate school. Yes, I'm in this for my passion, and to focus on my passion I need compensation which alleviates me from financial worries in order to focus on practicing my passion.",
          "author": "hdorsettcase",
          "created": 1623952082,
          "upvotes": 15,
          "replies": {
            "h24647i": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24647i/",
              "text": "Yeah, passion doesn't pay the bills! One needs a certain amount of money to pay for life's basic necessities. I really hate when employers go on about \"passion\" to try to justify paying poverty wages.",
              "author": "AcademicSpouse",
              "created": 1623952540,
              "upvotes": 9,
              "replies": {
                "h254ain": {
                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h254ain/",
                  "text": "Has your spouse considered working in the industry ?",
                  "author": "ProfessionnalCamper",
                  "created": 1623967302,
                  "upvotes": 2,
                  "replies": {
                    "h25m7pa": {
                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h25m7pa/",
                      "text": "He worries that his PhD would be a liability when applying for industry jobs because it makes him \"overqualified\", or that employers would consider him underqualified due to him not having industry experience. I don't necessarily agree with his assessment.",
                      "author": "AcademicSpouse",
                      "created": 1623976532,
                      "upvotes": 3,
                      "replies": {
                        "h25r8u4": {
                          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h25r8u4/",
                          "text": "He can assume he'll get a \"no\" and try it nonethless.\n\nIf he doesn't try to do it, he certainly won't get a position...",
                          "author": "ihavenoidea1001",
                          "created": 1623979240,
                          "upvotes": 6,
                          "replies": {}
                        },
                        "h25r7kk": {
                          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h25r7kk/",
                          "text": "I don’t either. Actually there are people who help PhDs to « translate » their experience in academia into something valuable for an industrial company. He learned plenty of things, he should give it a try.",
                          "author": "ProfessionnalCamper",
                          "created": 1623979222,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "h2676oy": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2676oy/",
          "text": "What field is your spouse in? I’m wondering what kind of industry jobs he’s applying for where a PhD might be a liability. This story is really very grounding to read.",
          "author": "ConsciousReindeer265",
          "created": 1623988053,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h2362e0": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2362e0/",
      "text": "I started dental school straight out of undergrad. I had just had a new baby too and and was completely overwhelmed with the workload and didn’t know how to study effectively. The grade minimum was 75 for this program, and I failed Anatomy with a 68 and Biochemistry with a 70. This was just the first semester! I sat out a year while I worked at a pizza shop. Many of my former classmates would come in to get food and I had to act excited like I was fine but I was dying on the inside. I was given the opportunity to restart the year. I did well the semester I failed. Turning those failed classes to a 82 in Anatomy and 90 in Biochemistry. However, I become overwhelmed again in the second semester and failed Physiology with a 72. I was dismissed completely from the program for failure to make progress. Crying in my advisor’s office, she recommended I join dental hygiene. I did so and completed the program in grand fashion. While there though I avoided my old classmates around the building and lied about why I was still there but my success spoke for itself. I had the highest grades in the class and I received numerous awards within the school and nationally. My picture was posted on the school website and on corporation websites so my cover felt blown. Immediately after graduation, I received a salaried job working for city government and was able to buy a house within 6mos. I used the pandemic to study for my entrance exam to get back into dental school. I took the exam and score 6 points higher then my first attempt years ago. I submitted my application and was accepted back into dental but this time around I deferred my accept for a year and plan to start on my own accord in 2022. Ill check back in a few years to let you know how everything turned out but yeah, that’s my story.",
      "author": "Good-Box850",
      "created": 1623937066,
      "upvotes": 157,
      "replies": {
        "h237i2o": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h237i2o/",
          "text": "Omg!!Thanks for sharing your story. It's so inspiring. I am sure you'll do great in dental school.",
          "author": null,
          "created": 1623937774,
          "upvotes": 20,
          "replies": {
            "h23un4q": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23un4q/",
              "text": "Thank you… I know it sounds cliche but definitely don’t get so discouraged by failure that you stop pushing. All this happened over the course of 5 years, a relatively short time. The analogy I think about is getting caught in a current. Most people tend to fight it but the actually way to survive it is swimming with the current.",
              "author": "Good-Box850",
              "created": 1623947733,
              "upvotes": 11,
              "replies": {}
            }
          }
        },
        "h259xsg": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h259xsg/",
          "text": "That's a great story, but surely it's a success story rather than a failure! :-D",
          "author": "kemushi_warui",
          "created": 1623970085,
          "upvotes": 6,
          "replies": {}
        },
        "h23kaub": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23kaub/",
          "text": "\"Bought a house within 6 months\" What how? Did you already have savings or were you making 800k a year or what?",
          "author": "Absolutelyphenomenal",
          "created": 1623943319,
          "upvotes": 11,
          "replies": {
            "h23surr": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23surr/",
              "text": "No, the position is close to 100k a year and I had about 20k is saving already. Plus the property was a fixer upper: had to put in a new kitchen and bathroom. But this is definitely not the feed for this convo. Lol",
              "author": "Good-Box850",
              "created": 1623946967,
              "upvotes": 14,
              "replies": {}
            }
          }
        },
        "h23faec": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23faec/",
          "text": "and at least you already have your tools this time!",
          "author": "guttata",
          "created": 1623941329,
          "upvotes": 1,
          "replies": {
            "h23tbbx": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23tbbx/",
              "text": "Yes! This saves me about 10k. All coming back to me in refund.",
              "author": "Good-Box850",
              "created": 1623947166,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h235f2a": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h235f2a/",
      "text": "Goals can change over time too so not necessarily giving up. Academia is what I am aiming for but I know it's difficult, especially times like these, so I guess as I learn more I'm reshaping my goals to make them more realistic.",
      "author": "cryoteqnics",
      "created": 1623936741,
      "upvotes": 33,
      "replies": {}
    },
    "h23f9v9": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23f9v9/",
      "text": "I've posted about my experience [before.](https://www.reddit.com/r/GradSchool/comments/eb60l7/after_15_years_2_programs_3_advisers_and_3/) Basically my advisor screwed me over in grad school which forced me to Master out after 7 years. I want back in at another institution, had the same thing happen, but this time filed a Title IX grievance and fought for a year to graduate with my PhD.  \n\n\nSome might consider that a success since I graduated, but I missed out on so much experience and learning because faculty refused to act in mentoring roles. I see people 10 years younger than me graduating with multiple publications  while I essentially have none. My advisors didn't connect me to peers and to this day are more detriments than assets when it comes to references. I got the piece of paper, but not all of the other things that were suppose to come with it. No post-docs for me. I'm a 'failed' PhD because I didn't go into research or teaching, which are the career paths the a PhD is suppose to prepare you for. Currently employed at an entry level position for a fraction of the pay I should be earning.  \n\n\nBut when it comes down to it I am happier. The work is nowhere near challenging to me so I can breeze through the day. It gives me time to think and plan about the future. My position is stable and supportive enough that I could make a career out of it, although I will never have the comfortable pay or professional challenge. I could jump ship and do something else or I could do a little something on the side.   \n\n\nI don't know if my story is a good one; in many ways things would have been better if I Mastered out earlier and started in industry from the bottom, but I wouldn't have been satisfied with myself. My advice? So many people in academia act like there's only one path: degree, post-doc, professor or research lead. There's so much more than that. Find your local professional organization and network with them, they represent a more diverse spectrum of careers than the faculty at your institution. Location matters a lot too, you might find more success in moving around. The city I was in 10 years ago had a fraction of the positions compared to where I am now.  \n\n\nGet sleep and therapy.",
      "author": "hdorsettcase",
      "created": 1623941323,
      "upvotes": 25,
      "replies": {
        "h23fscs": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23fscs/",
          "text": "How did your adviser screw you over and why didn’t you realize this earlier?",
          "author": "green-tea-11",
          "created": 1623941552,
          "upvotes": 5,
          "replies": {
            "h23h8oc": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23h8oc/",
              "text": "No putting my name on the publications I contributed to, making me do work that did not advance my dissertation, not providing me with mentorship, and isolating me from other professors who could have helped. I was a naïve grad student who trusted my advisor. My second time around I submitted a report on my progress to the graduate school every semester, so when the attempt was made to let me go they stepped in.",
              "author": "hdorsettcase",
              "created": 1623942093,
              "upvotes": 16,
              "replies": {
                "h23ixzg": {
                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23ixzg/",
                  "text": "Oh gosh 😕. Honestly I find myself in a somewhat similar situation - my dissertation hasn’t moved forward (some things out of his hands, some are in his hands), for the time being he’s asking me to work on things that don’t have much to do with my own dissertation except that they help me learn the methods but what I actually do makes no sense other than that. Would have been fine to do something that makes no sense for the sole purpose of learning but I’m 4 semesters into a 9 semester program . To top it off he’s asked me not to use the computers during office hours so im stuck working after hours - meaning I can’t mingle with my cohort, can’t meet people and I’m general I’m very isolated. If I have questions about what I do.. can always message him but since it’s outside office hours he sometimes takes hours to reply (but he has shown my lab mate how the methods work - in person not via chat). I’ve asked multiple times to be involved in other projects for the time being (both to learn but also to meet the rest of our team) but I’m in general given the cold shoulder and told to work on what I’ve been given (so continue working after hours). My dissertation itself - 2 pilot studies , and a funded project which for various reasons has to be cut short (also because my clock is ticking) so I won’t get to learn everything I was hoping for and I won’t get to do the number of experiments I was hoping I’d do. He recommends stuff (for example he was telling this student about all the possible scholarships they could apply for - in front of me while ignoring me completely) to my lab mate who is practically involved in every funded project he has but I get no recommendations. Even when I ask whether he will help me with xyz scholarship because he’d need to submit a letter, he kind of ignores the question. \n\nIdk whether I’m negative or whether I’ll be in your situation in a few years. A part of me wants to scream and leave.",
                  "author": "green-tea-11",
                  "created": 1623942739,
                  "upvotes": 9,
                  "replies": {
                    "h23l1vb": {
                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23l1vb/",
                      "text": "Do you have a thesis committee? This sounds very bad and you need to reach out to your committee.",
                      "author": "scienceislice",
                      "created": 1623943643,
                      "upvotes": 3,
                      "replies": {
                        "h23laop": {
                          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23laop/",
                          "text": "I’m about to meet them in 3 hours! I don’t know what to share with them - I’m a bit reluctant to tell them many of these things as I don’t want to put my supervisor in a bad light.",
                          "author": "green-tea-11",
                          "created": 1623943748,
                          "upvotes": 3,
                          "replies": {
                            "h23quo0": {
                              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23quo0/",
                              "text": "Is your PI going to be there? If he isn't going to be there then you can be a little more frank but I would stick to the facts not feelings/emotions (don't say something like \"He ignored me\" say something like \"I have asked him for x number of meetings and he has not been able to meet\" or \"He has assigned me these projects and I am unsure how they relate to my thesis work\").",
                              "author": "scienceislice",
                              "created": 1623946108,
                              "upvotes": 4,
                              "replies": {
                                "h23ryu1": {
                                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23ryu1/",
                                  "text": "No, he won’t be there. Yes, I will stick to the facts. I’m genuinely curious what they have to say as I have no idea whether what’s happening is normal.",
                                  "author": "green-tea-11",
                                  "created": 1623946590,
                                  "upvotes": 4,
                                  "replies": {
                                    "h25qlpi": {
                                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h25qlpi/",
                                      "text": "I hope it went well!",
                                      "author": "ihavenoidea1001",
                                      "created": 1623978895,
                                      "upvotes": 1,
                                      "replies": {
                                        "h2652ue": {
                                          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2652ue/",
                                          "text": "2 out of the 3 didn’t show up. I didn’t feel comfortable sharing with just the one , I wanted all their opinions - too bad.",
                                          "author": "green-tea-11",
                                          "created": 1623986783,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    },
                                    "h27jzt4": {
                                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h27jzt4/",
                                      "text": "I'm curious how it went? Some of the stuff you mentioned is very weird - why can't you use the computers in office hours? It could be well worth your while really bringing up with your thesis committee that you don't feel supported and seeing what their advice is to get you over the line.",
                                      "author": "spinach1991",
                                      "created": 1624024220,
                                      "upvotes": 1,
                                      "replies": {
                                        "h27lb21": {
                                          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h27lb21/",
                                          "text": "Unfortunately 2 out of the 3 didn’t show up. So, I didn’t feel comfortable sharing all of this with just the one who did show up. I did ask whether he thinks my project is feasible because the point of the PhD is to collect results and make sense of it but with the two pilot studies I’m not sure I’ll get any meaningful results (because n=3 for one and n=5 for the other). He didn’t reaaaally comment on it just said that I don’t need to be doing an article based thesis (but still, even if not - shouldn’t I still report some meaningful results?). Anyway I don’t know. \n\nMy Pi doesn’t let me use the computers during office hours because the software we use , we actually borrow from a different department. They allow us to use it for a day and a half during office hours, this time gets given to my lab mate because the stuff I’m doing is for learning and she’s producing data for publications so yeah.",
                                          "author": "green-tea-11",
                                          "created": 1624024849,
                                          "upvotes": 1,
                                          "replies": {}
                                        },
                                        "h2n8lus": {
                                          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2n8lus/",
                                          "text": "Are you still curious? I ended up meeting one of them again yesterday (was a different than the previous prof). It turns out they communicate with each other so they are well aware of the situation. Because throughout the past few months I have talked to pretty much all of them individually .. \n\nIt turns out , it just so it happens that since my advisor is new, he also has mentors - the same mentors I have. I had no idea .. otherwise I’d probably wouldn’t share as much as I did but anyway. \n\nThe one I spoke to yesterday was surprised that things were as they were, I gave her some examples of what’s been going on in the past few months and yeah. It all sounds, weird. The professor did seem understanding though and I did mention that I understand that my supervisor has kids and the pandemic might be difficult for him but it isn’t fair that he has 2 PhD students and they just get treated so differently. And I know he means well with providing me with old data to play with but the fact that I use the computers outside office hours and cannot mingle with either my cohort or the other people that use the same software I do is isolating... anyway whatever, she said that she will reach out to the other 2 profs and they will try to schedule a meeting with my supervisor as they are also his mentors and they do that stuff anyway. She said they will try to be discreet and not mention my meeting with them. I sincerely hope this gets resolved because it is stressing me out.",
                                          "author": "green-tea-11",
                                          "created": 1624365474,
                                          "upvotes": 1,
                                          "replies": {
                                            "h2nkfzk": {
                                              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2nkfzk/",
                                              "text": "Yes, I am! Apologies I actually started replying to you again yesterday but didn't have chance to finish. I was going to advise reaching out to them again, so it's good that you've been able to. Hopefully they will be able to encourage your PI to improve his supervision, and if not, now they are more aware of the problem they can help you assess your options and how you can resolve this. \n\nRemember that it is in no one's interest for you to fail. Especially as a new advisor, it would reflect badly on him for you to fall through the gaps; unless he really is just an arsehole (sadly this is not uncommon however), he should be willing to do what he needs to help you with some pushing from his mentors. If it turns out he is such an arsehole, then that committee is your key to resolving things without him. Keep up dialogue with them, they will help you get through this.",
                                              "author": "spinach1991",
                                              "created": 1624371744,
                                              "upvotes": 1,
                                              "replies": {
                                                "h2uy0w3": {
                                                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2uy0w3/",
                                                  "text": "My Pi just emailed me today to pretty much say I should consider other options if his way of doing things isn’t satisfying me. \n🙄",
                                                  "author": "green-tea-11",
                                                  "created": 1624516777,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "h2v7hci": {
                                                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2v7hci/",
                                                      "text": "That's shit, I feel for you. But, it's given you the first key bit of information for moving past this: you definitely can't rely on this guy. So you need to find out how you can do this with minimal involvement from him. \n\nYour next step is back to your thesis committee. Forget being deferential to your PI at this stage. He's being an arse and they need to understand this (this may be difficult, it will feel like you're going behind his back, but these people get away with their bullshit in the dark - part of the point of a thesis committee is to give the student a chance to resolve this kind of thing). Let them know that he has essentially decided not to cooperate in improving the situation. Make a list of your previous problems with him to refresh their memories if necessary. Try to get them all together for this, if possible - you want to lean on their collective responsibility, it will push them to be more responsive. It may mean mediating with your PI (if they are mentoring him they may be able to pressure him to behave better), or it may mean helping you explore your other options (how to complete the work more independently, perhaps finding collaborators or projects to complement your other work to help you get to the line as quickly as possible, even switching PI if really necessary).\n\nYou will have options. Even gritting your teeth and pushing through the work with this guy as quickly as possible will be better with the advice of your committee (and remember, a dissertation doesn't have to be perfect. It's a big piece of coursework. If you can get the work done, get some data out then you can write the dissertation). You have plenty of time to resolve this. I know people who saved their PhDs with data in their last couple of semesters. You might be able to find some collaborative projects to take the pressure off your work with the PI. Talk to your committee, there will be a solution!",
                                                      "author": "spinach1991",
                                                      "created": 1624525685,
                                                      "upvotes": 2,
                                                      "replies": {
                                                        "h2vdvf8": {
                                                          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2vdvf8/",
                                                          "text": "So that email was sent to me and the course coordinator. It felt a bit BS because he had listed a bunch of things that were just incorrect... I’m the email he talked about all the possible ‘resources’ that I have access to but I’m sorry - working 5-12am I don’t benefit from some of the people in my team that should be there to train me . I don’t do that always but when we (lab mate and I) had to learn the software and the lab mate was given priority then I did. \n\nI stand behind what I said. \n\nI reached out to my committee already multiple times. I need to give myself a day or two just to process that email. \n\nAs of now (but I want to sleep on this), I’m thinking of emailing him and saying thanks for this email but here are some challenges I’ve been having over the past 6 months: 1) not getting keys to the places I need to access . 2) working outside office hours , this early in my training - I miss on the opportunity to mingle with the personnel (he mentioned in the email that is there to facilitate my training) and I’m left on a figure it out on your own mode (with chat messages from him). 3) discussing tables and figures during lab meetings in a different language 4) being provided with an opportunity to work during office hours especially if I have language classes that I’m taking in the afternoon after work (my course work will be done in this language so I need to learn it) 5) having a more equal workload around journal clubs instead of consistently making presentations and not have the workload be somewhat more evenly split between the lab 6) being asked to move around equipment for projects I’m not involved in. Yet have skills (and again benefit from the entire team that he mentioned in that email) I could gain from being involved. Not to mention the added benefit of collaborating with my fellow lab mate on something 7) being provided with old data but not being told what data files are called; when I wanted to double check stuff in the data and asked for the original files I was declined because he had no time to share files with me . This miscommunication caused a delay in analysis 8) lack of communication. Not sure how to phrase this or whether to but a few months ago he said he would split some samples between me and my lab mate but he never said which samples I had to analyze. I obv asked and he would say ‘I’ll let you know’, but at the end of it , he never did. I had to message my lab mate only to find out that he had already talked to her and she was surprised that he didn’t mention anything to me. Not sure if I should add this . 9) .... so on and so on \n\nI don’t know whether this sounds rude or not, maybe I’ll try to provide solutions to these problems so that I seem a bit more solution based but yeah. This is preferential treatment and to me it’s obvious.",
                                                          "author": "green-tea-11",
                                                          "created": 1624531697,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "h2virdb": {
                                                              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2virdb/",
                                                              "text": "Yeah for sure, take your time. Prepare yourself to stand your ground. cc in the course coordinator and thesis committee members so they can see exactly how he deals (or doesn't) with your issues. \n\nTbh I think at this stage you don't need to worry too much about coming across rude (just try not to be deliberately antagonistic). This guy has a duty to you as your supervisor and he's failing it. He's made it clear he won't fulfil that on his own which is why you have to bring it to the attention of other people. It might make things awkward but you are fulfilling your role as his student and you need something from him in return. What you've described is certainly not normal, and the fact is it's making it difficult for you to advance. There's absolutely no reason for you to put up with it.",
                                                              "author": "spinach1991",
                                                              "created": 1624535483,
                                                              "upvotes": 1,
                                                              "replies": {
                                                                "h2vs237": {
                                                                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2vs237/",
                                                                  "text": "I just feel so crappy. I’ve always wanted to do a PhD. This just feels sooooo mehhhh and I absolutely hate the preferential treatment",
                                                                  "author": "green-tea-11",
                                                                  "created": 1624541111,
                                                                  "upvotes": 2,
                                                                  "replies": {
                                                                    "h2w2or6": {
                                                                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2w2or6/",
                                                                      "text": "Yeah, I understand the feeling. I spent a lot of mine feeling like I wouldn't ever finish. My PI was negligent (which is not as bad as yours who seems actively hostile) and I felt lost most of the time. I managed to pull through it, though I regret not looking for outside help earlier. That's why I think the most important thing is for you to build a strong rapport with your thesis committee (even if that is also a frustrating path).\n\nSadly, lots of people have shitty PIs. It's a role which requires a lot of skills that most researchers just don't have and/or aren't interested in acquiring. The bad news for you is you've clearly got a shining example of that. The good news is that a lot of people still get through the experience with a PhD. You can do this. Use your resentment for him to motivate you to finish, knowing that this was through your own power not his, and put a heavily sarcastic thank you in your acknowledgements as a fuck you. If you make it out the other side with any will to continue in academia, you can then do what I do: spend half my time giving advice to the master's and PhD students in my lab (and strangers on the internet) about how to survive the worst bits. Good luck, I really wish you well in getting through this!",
                                                                      "author": "spinach1991",
                                                                      "created": 1624546245,
                                                                      "upvotes": 1,
                                                                      "replies": {}
                                                                    }
                                                                  }
                                                                },
                                                                "h2vs3ox": {
                                                                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2vs3ox/",
                                                                  "text": "By the way thank you so much for your replies ❤️",
                                                                  "author": "green-tea-11",
                                                                  "created": 1624541135,
                                                                  "upvotes": 2,
                                                                  "replies": {}
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "h23o7p4": {
                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23o7p4/",
                      "text": "Meet with your committee and the Graduate School. Voice your concerns to them and move forward on their advice. I did not confront or accuse my advisor on my own, I always had backing and support from the Graduate School. Going solo against faculty is a very bad idea.",
                      "author": "hdorsettcase",
                      "created": 1623944987,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "h25qfop": {
                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h25qfop/",
                  "text": "The not putting our names in papers appears to be quite common, unfortunately.\n\nI almost had the same happen to me but I had a PhD student with the same advisor warning me & another person of what was happening.\nWe didn't even \"just\" contributed to the papers... We were the one's who had done all the work and they were mostly done and ready to publish. This advisor didn't even read it before it was ready to publish and sent to her ( because we were too naïve)\n\n Our advisor just couldn't do something in it ( or didn't want to) and so she tried to ask this other PhD student for help and told her she could put her name and the advisors name on it. \n\nThis advisor also didn't replied to any of my e-mails during the time she was supposed to be advising me. She ghosted me for weeks and when she read my progress she never said anything to help me improve my work. Then, a couple of weeks before actually turning my Thesis in, she sent me an e-mail basically telling me it was awful, made no sense and that I had to completly change it. She also proceeded to tell me she wouldn't be able to read it again before it was presented publicly.\n\nI was in panic due to that. Spent a couple of days with insomnia and with severe anxiety trying to change everything but it ended up worse. So, I sent the \"awful\" thing to a couple of friends, PhD students and people I trusted. I changed only 1 sentence and ended up receiving praise for \"the awful thing\" afterwards. Not only by the people who were there from other universities but also from her.\n\nShe was the biggest dissapointment and I honestly still hate her guts for this and other stuff she did to me.",
                  "author": "ihavenoidea1001",
                  "created": 1623978806,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "h24n4di": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24n4di/",
          "text": ">Currently employed at an entry level position for a fraction of the pay I should be earning. \n\nDepending on your field, you might actually be earning more now than you would have if you'd stayed in academia. Postdocs and adjunct positions aren't exactly paying big bucks, or even a living wage in some cases. Most academics never get one of the few coveted tenure track jobs.",
          "author": "AcademicSpouse",
          "created": 1623959743,
          "upvotes": 2,
          "replies": {
            "h25irsu": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h25irsu/",
              "text": "I'm about 10K under a starting salary for a professor. However my benifit package is pretty good an my company managed portfolio is hitting around 15%. However the difference in workload would be astronomical.",
              "author": "hdorsettcase",
              "created": 1623974685,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h24al6f": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24al6f/",
      "text": "I've been in academia 25 years and my failure narratives could form their own subreddit. Where to begin? \n\nProbably the failure with the biggest net positive impact was in my previous job at a SLAC. It was my second job; left the first one after four years for a lot of different reasons. For the first 7-8 years, the new place was great. I did good work and received tenure and promotion to Associate Professor. But then,  around the 7-year mark (circa 2008-2009) everything went completely to shit. \n\nThe institution itself was pretty much the same as before, and I didn't make any radical changes to my work post-tenure. But somehow, something changed between my students and me. I was trying out some newer teaching methods (IBL, flipped classroom) and maybe that was it. Students started to complain and a narrative started to form about me. This made work miserable, and to my discredit I used my blog and social media to hit back. (Big mistake.) It got to the point where, if was scheduled to teach a class with only one section, students were paying extra to take it from the local community college and transfer the credits rather than take it from me. (Not kidding; I learned about this second-hand.) \n\nI didn't get a ton of support, despite how much I was struggling. At first my dean pulled me into his office to ask about what was wrong, but as things \"progressed\", eventually I was threatened with dismissal, despite tenure, if I didn't bring my course evaluations up. My dean told me, literally, that I was a liability to the institution. The attitude was \"Fix yourself or you're out of here\". From there, I spiraled into depression and anxiety. \n\nUltimately I decided to go on the job market and look for a place where I could just start over, and try to build on successes and avoid mistakes. I applied to four positions, and got hired at one of them, and I've been there 10 years now. I earned tenure, again, four years ago and was promoted to full Professor; and generally speaking I've been very happy here, fully accepted, and had a really successful career (including writing a well-received book about flipped classrooms). \n\nI learned a lot from this failure: \n\n- It's possible to start over even if you're mid-career.\n- In fact, it's better to jump into the unknown and try to start over, than it is to languish in a place where you're just depressed and anxious all the time. \n- \"Grow where you're planted\" is among the all-time worst career advice. \n- You can avoid misspending 10 years of your life/career by paying more attention to the relationships you have with other people.\n- There are some seriously shitty deans out there -- don't be one of them, and don't put up with them.",
      "author": "Rtalbert235",
      "created": 1623954436,
      "upvotes": 23,
      "replies": {
        "h25hfbc": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h25hfbc/",
          "text": "Would you mind going into those problems with students, the kind of things you received on evaluations, and exactly what this \"hitting back\" was? How did thing change and progress from there?\n\nThese details could be invaluable to another. You had to start over after learning from these mistakes, but perhaps others can learn from yours and not their own \n\nI'd love to hear more.",
          "author": "drunkinmidget",
          "created": 1623973957,
          "upvotes": 7,
          "replies": {
            "h25qwnh": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h25qwnh/",
              "text": "It was a while back, and I can't remember all the details but basically:\n\n- I started using teaching techniques that were not just lecturing. IBL involves students working through guided discoveries of (mathematical) concepts, making conjectures about what they discovered, and then presenting proofs of those conjectures on the board and being open to criticism. Flipped learning involves students learning basic material independently prior to class and then building off that in class. Both of these are a _big_ culture change from what my students were used to. \n- I instituted these changes but did not have a corresponding plan to support my students or communicate with them. So they were struggling to adapt and I was sitting there thinking _What's wrong with you guys? Why don't you want to do the work?_ (Which would be great questions if I'd not asked them rhetorically.) \n- So class time turned into daily standoffs between the students and me. Students were angry and blamed me for not teaching the class (= lecturing) and would not do their work. Meanwhile I failed to reach out and try to understand what they needed and how I could help. \n- Some of the complaints were \"He doesn't teach the class\", \"We have to teach ourselves everything\", \"He doesn't help us\", and a lot of comparisons with other profs (\"Prof. G always helps us, but Prof. Rtalbert235 never does\"). Students would talk to other students (it was a small college) and although they'd never met me before, they'd start the semester with an impression of me that was super negative. \n- Hitting back -- a couple of times I live-blogged an exam session, not naming any names but making running comments like \"This one guy in the back is turning in his exam after 5 minutes, I bet I know how this will turn out\". Or I'd tweet angrily about what students were saying about me. It was all stupid and unprofessional and I had to take a hard look at myself afterwards. \n\nWhen I left, it was a complete leap into the unknown for me. I had no idea even if I was going to be able to reset my career --- maybe I really was just an asshole and I'll be just as bad off in the new job as in the old one. But I will say: I was committed to making the new job a better situation. I had uprooted my family from our home and social network and moved to a completely different state in the US where we knew nobody. My kids were just 1, 4, and 6 years old at the time and the move was scary for them. My wife had to find a new job. We almost went bankrupt because our house wouldn't sell. So it was such a huge change and sacrifice that I felt like I couldn't afford to F it up, and I did everything I could to fix the problems I had before. \n\n**Especially, I was much more intentional with my relationships with students.** Listening to them, asking them what they need, being sensitive to how different modes of teaching affect them, thinking about how to work _with_ them and avoid antagonistic relationships where I am working _against_ them. I just really committed to having a totally different mindset about students, and I followed through on that. My new students responded really well to this. My old ones probably would have too. \n\nI hope that helps.",
              "author": "Rtalbert235",
              "created": 1623979060,
              "upvotes": 12,
              "replies": {
                "h26biyx": {
                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h26biyx/",
                  "text": "Very insightful, thank you. Besides hitting social media to complain (although it made me chuckle), it's quite understandable where the good intentions didn't transfer well and good your adjustments to emphasize and connect fixed that right up. A lesson in pedagogy that many would be wise to learn.\n\nAppreciate you sharing",
                  "author": "drunkinmidget",
                  "created": 1623990843,
                  "upvotes": 1,
                  "replies": {}
                },
                "h2851hu": {
                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2851hu/",
                  "text": "I commend you for trying new teaching techniques. I've always thought there isn't enough support for teaching. At schools where you also need to do research, teaching is treated like a chore, and even if you would like to experiment and try new techniques, the need to focus on research means that you just don't have the time or mental energy to invest in it. It's easier to just follow the standard lecture-exam model. The response from your department shouldn't have been to fire you; it should've been to connect you with better teaching resources.",
                  "author": "weareedible",
                  "created": 1624033761,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h253bpd": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h253bpd/",
          "text": "This is a really sad story, happy to learn that you’re better now !",
          "author": "ProfessionnalCamper",
          "created": 1623966848,
          "upvotes": 5,
          "replies": {}
        },
        "h27g6vw": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h27g6vw/",
          "text": "I would like your opinion on flipped teaching. \nI also teach math, a variety of upper and lower courses, and believe flipping a classroom should be an occasional tool. \n\nI believe lecturing at a blackboard is still an important component. It lets me talk my way through problems in plain language. We need to to make lectures engaging. I use the time at the blackboard to make problems simpler and show methods and “tricks” that will not be found in texts. \n\nOf course, I also do group quizzes and other activities. I go around and help the students during these times. Basically, bringing office hours to them. \n\nI know if I was a student struggling, flipped classroom could be more frustrating.",
          "author": "Prudent_Tale5005",
          "created": 1624022354,
          "upvotes": 1,
          "replies": {
            "h27mecv": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h27mecv/",
              "text": "Well, I'm biased because I've devoted the last 10-15 years to using and studying flipped learning, and like [I said I wrote a book about it](https://rtalbert.org/book). So I think it's pretty great. \n\nIt's good that you use group quizzes and other active techniques. [Those are pretty well understood now to be the best platform for actual student learning](https://www.pnas.org/content/111/23/8410). Direct instruction, as you say, is also helpful. But the thing is, direct instruction can be done anywhere now through recorded video; the value proposition for doing it live in a class is not as strong as we might think. But active learning in groups can only be done when you have groups around to work with, and that's during a class meeting. So it makes sense to make active learning the primary focus of group meetings and to minimize everything else, or relocate it. That's the basic (oversimplified) idea of flipped learning. \n\nStruggling students might find flipped classrooms frustrating. They might also find more lecturing to be frustrating because they don't understand what you're saying or doing. Or, even worse, they could come away from a lecture *feeling* less frustrated but then crash into a wall of frustration later when they sit down to work and realize they don't *actually* understand the material. It's better IMO to confront the frustration head-on during class, through active learning in groups, when help is 100% available.",
              "author": "Rtalbert235",
              "created": 1624025367,
              "upvotes": 1,
              "replies": {
                "h27w98p": {
                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h27w98p/",
                  "text": "In my upper level courses, I am often the primary source to communicate the material. I can’t redirect students to others sources. Material is not in textbooks, or the students don’t have the maturity to understand the dense readings on their own. \n\nstudent involvement is one component to add to the classroom.\n\nWhat’s left out is how to be innovative to make challenging mathematics more assessable. For example, I taught my undergraduate class in dynamics cohomology. This can’t be done with flipped learning. I had to create the content and walk them through the material. It takes direct teaching to develop the concepts and thinking.",
                  "author": "Prudent_Tale5005",
                  "created": 1624029846,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h23sbt3": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23sbt3/",
      "text": "I left my humanities PhD program halfway into writing the dissertation.\n\nWhile program was good and I liked my advisor and the department, but I was burned out, struggling to get by on adjunct gigs/TA stipend, and I was having lots of trouble making any progress. Also my roommate had a mental break and committed suicide. So I left -- though looking back I probably should have left sooner.\n\nAt first I was pretty depressed about giving up and unsure what I could do. I applied to all sorts of jobs that people recommend for transitioning academics -- USAJobs, college admin roles, etc... -- but it went nowhere. Realizing that I needed to expand my skillset, I taught myself how to program and other CS fundamentals. One thing you become really good at in a PhD program is teaching yourself.\n\nThese days I split my time between teaching CS at university and research & development in the tech industry.",
      "author": "ilovemacandcheese",
      "created": 1623946744,
      "upvotes": 18,
      "replies": {}
    },
    "h23aw7y": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23aw7y/",
      "text": "I know this isn’t a failure by most standards, but i haven’t been able to get a job as a PI in the three years since I defended. I realize that’s nothing compared to some people who postdoc for ages, but I have a family and debt and I can’t push them through for something that MIGHT happen. So I gave up on academia and shifted to high school. I start in August and I’ll be teaching at an j dependent school that pushes research and internships, and I’ll have the opportunity to take my students into the field (I’m a marine biologist). It does hurt closing the door on academia, but I’m excited to see where this position takes me.",
      "author": "Takeurvitamins",
      "created": 1623939343,
      "upvotes": 51,
      "replies": {
        "h23g7kh": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23g7kh/",
          "text": "Did you require an additional accreditation to teach in a high school setting?",
          "author": "hdorsettcase",
          "created": 1623941740,
          "upvotes": 7,
          "replies": {
            "h23hc5l": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23hc5l/",
              "text": "No and I’ll explain. \n\nMy postdoc has been spent teaching STEM to high school kids as part of a program with a university that has a strong school of education. Lots of postdocs in my program get accreditation to teach in public schools, but my mom was a public high school teacher and there’s no way I’m doing that. Instead I checked out independent schools (look up NAIS.org). These are schools that don’t follow district curriculum guidelines and instead make up their own. This enables many of them to spend more time focusing on research and prepping students for specializing in topics instead of hitting state-mandated standards.",
              "author": "Takeurvitamins",
              "created": 1623942124,
              "upvotes": 22,
              "replies": {}
            }
          }
        }
      }
    },
    "h23t6qc": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23t6qc/",
      "text": "It's not as serious or as relevant as some of the other stories here, but when I was quite junior I applied to sit on a national committee run by a Government department which regulates and advises on the ethics of a particular type of research. I got an interview. It was in a very fancy government building, high security, the works. The interview was with a government chief scientist and two very senior civil servants. I totally blew the interview. Total disaster. I was just too junior for that role. I get out of this interview and I can't even leave because I have to wait for my security escort so I have to sit with the interviewers until the escort shows up after totally embarrassing myself. Finally, I leave. I figure it was an experience I can learn from and to put it behind me. But, they contact me a few weeks later to ask for a second interview. Somehow I convince myself that maybe that first interview wasn't the disaster I thought it was and go. Turns out the second interview was with the government's chief statistician who couldn't make the first interviews. I bombed just as hard a second time.",
      "author": "ACatGod",
      "created": 1623947111,
      "upvotes": 16,
      "replies": {}
    },
    "h252kkr": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h252kkr/",
      "text": "I did a 8 months internship in a lab, everything went well. I helped with the project, found new interesting perspectives, presented tons of papers, created tools for data analysis and so on. They were very happy with my work, especially my mentor and thus, he promised me a PhD position in his lab. Until the very last day of my internship he told me to be ready because I would join the team as soon as my Master’s results would come in. \n\nDuring those 8 months I applied to other PhD projects got accepted in one, and he told me to turn down the offer to stay in his lab, which *sadly* I did. \n\nHe was invited to my Master’s project defense, everything went well but the jury had some remarks for me. A day after, my mentor called me to tell me that actually, I am not a fit for the position anymore and that he don’t want me in his team because he didn’t like my answers at the jury’s questions. \nSo for 5 months straight he was telling me every day that I will stay in his lab as a PhD student, just to kick me out for no reason. \n\nI had a talk with him, he said that he was sorry, that he liked my work but he though that I didn’t understand the project given my answers to the jury. \n\nI still didn’t get over the fact that he told me to turn down offers in order to stay with him (I wanted to stay in his lab but only if my place was secured).\n\nAcademia disappointed me.",
      "author": "ProfessionnalCamper",
      "created": 1623966497,
      "upvotes": 14,
      "replies": {}
    },
    "h23cjvr": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23cjvr/",
      "text": "I came from a fairly academic family. Both my sister and myself were ok students, and both got graduate-level degrees. We both spent some time as adjuncts—and I mean, full time adjuncts, not just a couple hours a week. I suspect that neither I nor my sister were 100% committed to academic careers, but this was also *because academia was not committed to us.* Or, to put it differently, the universities believed we could be easily replaced—or believed that we were maybe not even necessary in the first place. And they seemed to go out of their way to remind us of this.    \n\n\nWe both found better treatment outside of academia.   \n\nAt this point, I look at a lot of grad students (outside explicitly practical ones like engineering and accounting) as victims of an MLM scheme.  \n\nIncidentally, I currently live in Japan. With Japan’s rapidly declining birth rate and shortage of young people, Japanese universities are fairly brutal in their treatment of adjuncts.",
      "author": "lifeofideas",
      "created": 1623940105,
      "upvotes": 39,
      "replies": {
        "h23q1zx": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23q1zx/",
          "text": "I would be interested in learning more about the adjunct situation in Japan if you’re willing to share!",
          "author": "snooper92",
          "created": 1623945767,
          "upvotes": 13,
          "replies": {
            "h24sgru": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24sgru/",
              "text": "[Japanese University Blacklist (and link to green list)](http://www.debito.org/blacklist.html)",
              "author": "lifeofideas",
              "created": 1623961998,
              "upvotes": 6,
              "replies": {
                "h24sjzl": {
                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24sjzl/",
                  "text": "Thank you!",
                  "author": "snooper92",
                  "created": 1623962037,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "h24rjs4": {
              "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24rjs4/",
              "text": "Are you interested in finding a job? Or the stories of frustrated adjuncts?",
              "author": "lifeofideas",
              "created": 1623961609,
              "upvotes": 2,
              "replies": {
                "h24s5yt": {
                  "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24s5yt/",
                  "text": "Mostly just curious about academic culture outside of the US.",
                  "author": "snooper92",
                  "created": 1623961867,
                  "upvotes": 4,
                  "replies": {
                    "h24ss6j": {
                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24ss6j/",
                      "text": "Such a big question!  \n\nEurope will be quite different, I think. I have an American friend teaching in the UK, and he says he wouldn’t want to deal with US academia. \n\nWhen I pondered this question, I remember reading that Germans, for example, tended to attach themselves to specific advisors (professors) and kind of follow that professor from institution to institution. I have no way of knowing if this was true when I read it, or now.   \n\nChina has two parallel university administrations. (1) Academic expertise; and (2) Political. The political guys have to sign off on any decisions made (like hiring, obviously). When I learned about this, I thought it was weird, but later I realized American universities have to achieve the same things, but they just do it in a different manner, without the explicit “political” label.",
                      "author": "lifeofideas",
                      "created": 1623962133,
                      "upvotes": 5,
                      "replies": {
                        "h27j1fk": {
                          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h27j1fk/",
                          "text": "I did my Bachelor and Master degrees in the UK, then a PhD joint between unis in France and Germany; now working as a post-doc in France. I moved from my PhD lab to my post-doc because someone I was working with was offered a lab leader position here, had money for a post-doc so offered me the job to go with him. I don't know how that compares with the US system. I will likely stay in academia while this guy has funding for me, but I have no great attachment to it (though I do like research) so I don't think I have the drive to set myself up independently.\n\nGenerally, academia in Europe treats its students OK because some degree of protection of workers rights generally applies. This does vary country to country though. In the UK, salaries for doctoral students are infamously low, but you are given them as a stipend so they are mostly tax-free. In France, it is now the law that a doctoral student has a contract and salary; they aren't super high paid but you get the benefits of being a contracted worker, and can't (normally) end up working for free as can be the case elsewhere. In Germany, again as a doctoral student you are generally contracted to the university and treated as a public servant which means a fairly good salary, much more than most people I knew were getting back in the UK (this may vary by state, mine included a very tasty christmas bonus!)",
                          "author": "spinach1991",
                          "created": 1624023756,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "h24u4vl": {
                      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24u4vl/",
                      "text": "[Japan: Lecturers Form Union](https://www.japan-press.co.jp/s/news/?id=11179) \n\nThis sounds familiar, I’m sure.",
                      "author": "lifeofideas",
                      "created": 1623962717,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h23vcb1": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23vcb1/",
      "text": "I've told my story elsewhere on here, but I can contribute one new bit here:\n\nThe mistake people make is assuming their career path will determine their happiness in life. They push themselves through graduate school on the belief that landing a dream job will somehow \"make it all worthwhile,\" and a title and salary will fill any emotional void in their life. It will not. Work is still work, and most of us are only there because they pay us to be. And you'll still have days where you feel depressed, unfulfilled, ignored, and aimless. Being called \"Doctor\" or \"Professor\" (and only in a few settings by a few people) is just part of a job. It's not a magical life booster that will justify the years you spent earning a poverty wage and reading dense books you've long since forgotten.\n\nPart of why people who have \"given up and moved on\" seem happier in their other careers is arguably because they have discovered contentment in life that doesn't come from their workplace. And part of why so many academics are perpetually unfulfilled is because they have cemented their entire self-worth into their career prospects. \"No job = I have failed at life.\" It's nice to have a job you love, but it's a better goal to have a good life all around.",
      "author": "Greenmantle22",
      "created": 1623948030,
      "upvotes": 35,
      "replies": {
        "h245nrf": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h245nrf/",
          "text": "Well said! 👏👏👏\n\nI think the mentality you're describing (along with sunk cost fallacy) is what keeps too many academics languishing as adjuncts or in toxic lab environments. To them, quitting means they're a failure, not just at their job but also at life. They're identity is so wrapped up in being an academic that they don't realize that quitting academia could (and likely would) pave the way for them to become more successful doing something else. It doesn't help that some PhD programs, including my spouse's, promote the idea that quitting academia = failure.",
          "author": "AcademicSpouse",
          "created": 1623952347,
          "upvotes": 11,
          "replies": {}
        },
        "h2553jk": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2553jk/",
          "text": "For me it's really about the ability to continue to learn and explore complicated concepts - and be paid for it. Theres a lot of freedom still in how an academic spends their time. My friends in industry are often bored, micromanaged, and while they still \"learn things\" it's clear they are no longer being stimulated intellectually at the same level. I will probably be forced out of academia soon due to geographical and family constraints, and it is this aspect I will miss the most.",
          "author": "HarvestingPineapple",
          "created": 1623967692,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "h23az6l": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23az6l/",
      "text": "I was doing well in my PhD program and had an amazing advisor. But I was struggling financially. I had access to student loans and a full assistantship, but I got sticker shock one fall at my student loan debt tally. I also hated the place I was living- great school stuck in an incredibly religious/conservative area. Each to their own, but it was terrible for me. I also saw fresh PhDs from my program all failing to get tenure track jobs so I just up and bailed. Moved to the closest city and worked odd jobs until I landed a tenure track job at a community college with my Master's. That was the minimum required degree, and I got the job by the skin of my teeth and now have tenure. I'm so much happier teaching at a CC. Still academia :) but still completely buried in student loan debt :/",
      "author": "EccentricName",
      "created": 1623939381,
      "upvotes": 33,
      "replies": {
        "h23ddc2": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23ddc2/",
          "text": "Can I ask what field you are in?",
          "author": "failuretobloom",
          "created": 1623940478,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "h23twg9": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h23twg9/",
      "text": "I got my bachelors in math, and I always dreamed of getting my PhD in math and becoming a professor. After 2.5 years in grad school, I dropped\n out with my masters. I’m lucky I guess because I ended up realizing how unhappy graduate school was making me early on. The grad school I went to was very toxic, and I wish I’d been more careful to ask students about their experiences before I ended up going there. The four other women in the program with me dropped out too; I never got to see any women pass the math qualifying exam while I was in the program. It’s tough, because I wish I had done more to change the way things were done in the department, but I just decided to leave instead. I am soooooooo much happier now though! I have my dream job working in operations research! Please don’t stay in graduate school if it’s ruining your mental health.",
      "author": "Sarahrunner",
      "created": 1623947417,
      "upvotes": 8,
      "replies": {
        "h24bqou": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24bqou/",
          "text": "Too much truth. Math departments usually make the qualifying exams harder. They make everything too abstract and hard. They don’t prepare you for outside job at all. I was lucky to pass qual exams in both Math and Operations Research department.",
          "author": "optimization_ml",
          "created": 1623954921,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h24eyxo": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h24eyxo/",
      "text": "Technically not a failure but a reconsidered path. Got a biomed PhD and while it went well, I came out with very negative views of the graduate student training system. Ended up going to medical school, worked a postdoc part time while there, and eventually became an anesthesiologist. I still do bench work and I’m aiming to start up my own lab in the next decade. I just didn’t do exactly what I set out to in the order I had hoped initially. I think it came out for the better though.",
      "author": "Eab11",
      "created": 1623956279,
      "upvotes": 6,
      "replies": {}
    },
    "h256vp2": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h256vp2/",
      "text": "Got my PhD in Psychology basically because I couldn’t figure what else to do with my life and both my parents had their PhDs. I lost steam on my research ideas pretty quickly because no one at my grad school worked directly in that area and I suck at networking.  Completed a few post docs without fanfare or grant development, then got a temporary appointment at a local university. \n\nStayed there in the temp position gradually moving up towards the salary I’d been making with a Masters, doing healthcare research, before my PhD ($60ks). Then the position was eliminated and I landed a LOWER paying full time lecturer position in the $50ks. \n\nI am still not making as much money as I did 15 years ago as a healthcare researcher. This type of underappreciated non TT position really makes me feel like a failure. Plus, I don’t have any real passion for my job.",
      "author": "katclimber",
      "created": 1623968564,
      "upvotes": 7,
      "replies": {}
    },
    "h2606mq": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2606mq/",
      "text": "Not exactly what you're talking about, but there are now quite a few successful academics who maintain public Failure CVs where they list all their failures - a way of trying to normalise getting an article rejected, failing to get a grant, not getting into your first choice school etc.\n\n[Johnannes Haushofer's CV of Failures](https://www.uni-goettingen.de/de/document/download/bed2706fd34e29822004dbe29cd00bb5.pdf/Johannes_Haushofer_CV_of_Failures[1].pdf)\n\n[Bradley Voytek's CV of Failure](https://738d9b89-a-62cb3a1a-s-sites.googlegroups.com/site/bradleyvoytek/professional/voytek_cv.pdf?attachauth=ANoY7crD5AfoMdd0aHc8exTTP9I55LNQXGBRdK_y0kJd8yHn9XOn2t3a6u9s7PzcTCVvOkRI1wMGEyBPjxRYO34QpqXc0hj5ApgKTzzE_BA7t8CeE26bG9xbEFLiMu2zV-cMwKoklONN5NO8gs1ZzpxLA-4h4eiOmios4YCGKimQe2M3u9g9w9pzDl76ipysBLjDmuhG_D_3O9ZmBK6IwYzpDilzIRA-c3vxndF8nJ1AmpGEQSJ2tXI%3D&attredirects=0)\n\n[Samuel Joseph Lloyd](http://everydayscientist.com/CV/sjl_CV-failures.pdf)",
      "author": "Solivaga",
      "created": 1623984040,
      "upvotes": 5,
      "replies": {}
    },
    "h26gof0": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h26gof0/",
      "text": "I've talked about this before here, but - I spent five years enrolled on a PhD and found out two years in that my advisor was disliked in the community and was neglectful and spiteful, perhaps because of it. \n\nSo because of this they simultaneously belittled my research but offered no advice or support on what to do. This came to a head and I switched supervisors, only to realise that the narrative was represented as me being the problem- despite supervisor #1 having multiple PhD students who had or were in the process of failing to complete.\n\nI limped along for about three years when I  should have just left - I submitted my patchwork thesis at the end and didn't even receive a masters, and when I read it back I can fully see why. Hindsight!\n\nI transitioned into education and I've made it three years in a tough-as-nails environment, publishing as I  go and rebuilding my confidence. I'm leaving my current role, though, because COVID has made education in my area way too stressful.",
      "author": "Cocanola",
      "created": 1623994532,
      "upvotes": 4,
      "replies": {}
    },
    "h26wft8": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h26wft8/",
      "text": "I guess I “failed.” I did successfully complete my doctoral program (English) in 2005, but had the classic two body problem and a young family. My partner got a TT job at a SLAC, where I adjuncted. I limited my job search to this region (obviously a bad move but you know, responsibilities) and tried for to find a TT job for several years, coming close a couple times but never landing a full time position. Then came the 2008 meltdown and the ensuing evaporation of already scarce humanities jobs. I was deeply depressed personally at this point and pretty disillusioned professionally. So I completed a totally different graduate program (Communication Sciences and Disorders) to become a Speech-language Pathologist. This profession has its issues for sure (that’s another post) but I’m always glad there’s plenty of work and I’m able to be at least partially self-employed. My employment struggles in academia and the stress of years of precarity have definitely made a mark on me. I juggle 3 different jobs (my own private practice and 2 per diem hospital jobs) by choice because I need my independence and don’t ever want some search committee of randos determining whether I can feed my family, and I try to avoid putting all my eggs in one basket; if one employer implodes, I need to be able to flex to the next thing and keep the ball rolling money-wise. I miss academia, but the sacrifices were too much and it was just unsustainable.\n\n*Edited to add just saw “STEM” heading as I posted. Oops, but maybe we should start a humanities failure thread...it will be long lol.",
      "author": "Chalee7",
      "created": 1624008257,
      "upvotes": 4,
      "replies": {
        "h286sc6": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h286sc6/",
          "text": "Fellow humanities PhD grad here! Very relatable. I ended up not even trying for academic jobs because I was so discouraged watching other grads try and fail to get jobs, or get jobs only to have the college lay them off or even shut down completely for financial reasons. (I think this could be characterized as a psychological failure on my part.) I'm currently enjoying the relative stability of nonprofit administration--though my job only requires a bachelors, so my PhD has been reduced to a curiosity.",
          "author": "weareedible",
          "created": 1624034526,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h25us2l": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h25us2l/",
      "text": "A lot of the comments here seem to indicate that one either 'succeeds' or 'fails' in academia, but there are actually many smaller mistakes that, if left uncorrected, can lead to issues somewhere in the middle that are even more problematic. For instance, publishing in predatory journals can lead to bad research practices in general, bombing an interview can lead to diminished self-confidence and/or a poor image if in a small field, joining a doctoral program when you don't actually want to do research (or don't yet know that you don't want to do research) can cause existential angst, not diversifying your portfolio of skills can make you look like too much of a niche-candidate, adjuncting for far too long (particularly at community colleges) can make you seem 'unworthy' of being hired full-time, and even preventing yourself from applying to positions that you believe are 'beneath' you can limit your employment prospects greatly. These are far more commonplace than most of the examples provided in the other comments, and they're generally the result of poor advising, limited academic support, etc. Truthfully, though, I think the biggest mistake that most graduate students make en route to a Ph.D. is not to enjoy the journey and engage in self-discovery. The odds of getting a TT position are incredibly low, and we're setting ourselves up for genuine failure if we believe otherwise.",
      "author": "tspier",
      "created": 1623981138,
      "upvotes": 3,
      "replies": {}
    },
    "h29njbz": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h29njbz/",
      "text": "\"Failure\" - how you define it all depends on your interests as an individual.\n\nLet me give you an example. I am thrilled with my job and don't consider it a failure at all - and conventionally, most people would consider it successful. It took me 10 years and 5 post-PhD jobs to land here, but I was okay with all the moves and love life.\n\nHowever, I have a friend who graduated at the same time as me, same program. He went straight to a lecturer position. He's lived in his favorite city on earth for all that time, found a partner, had kids, settled down, bought a house and then a bigger house. Most of that time, he's earned more than me, and we're only just about even now.\n\nI loved my path. He loved his. If he took my path, that would have been a failure to him, and if I had taken his, I wouldn't have been happy either.",
      "author": "uniadminthrowaway",
      "created": 1624059597,
      "upvotes": 3,
      "replies": {}
    },
    "h26jmlg": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h26jmlg/",
      "text": "This article discusses the [recent rise and longer history of 'Quit Lit'](https://www.insidehighered.com/views/2018/04/04/comparison-quit-lit-1970s-and-today-opinion). \n\nI'm not quite sure what this post is looking for as the genre is *booming*.",
      "author": "WrestlingStuffGuy",
      "created": 1623996822,
      "upvotes": 2,
      "replies": {}
    },
    "h26jvnt": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h26jvnt/",
      "text": "Left department A for departments B and C, years later returned to try A again.\n\nA had gone insane for a particular fashionable ideology which they continually demonstrated they didn't really understand, certainly couldn't grasp the fact they too were at risk by being beholden to this monstrous Moloch.\n\nReturning, the ideology is still there, ​but it's become such a broad church they are OK with criticism.\n\n\n\nDangle this for me, \"Hey, you want to upgrade your thesis to Doctorate?\"\n\n\n\n**\"Fuck no, bwah ha ha!\"**",
      "author": "Tramin",
      "created": 1623997026,
      "upvotes": 2,
      "replies": {}
    },
    "h2av6ve": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2av6ve/",
      "text": "Failure comes up from inside and outside. Failure from inside is the difficulties in finding a topic for thesis or dissertation, and publish papers. Failure from outside is the difficulties in the relationship with advisor, hunting a faculty position, and other relationships. Advising graduate students is the major duty of a professor.  If the professor dislikes the student or will not provide advise about the dissertation, it is the failure of department or the professor instead of students. You can not expect every student is genius to know everything without learning from professors. If the professor provided bad reference about the student who has no cheating or lying behavior and destroyed his/her career life, it is professor's career and reputation's failure. But no student dares to complain about that even though in America. Research world is small. One professor dislike you, which means your academia career is dead.",
      "author": "Leisha-u",
      "created": 1624086666,
      "upvotes": 1,
      "replies": {}
    },
    "h2rw9l8": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h2rw9l8/",
      "text": "Humanities, not STEM.\n\nGraduated, went on to a visiting professor position. The next year, the number of jobs in my area of expertise vanished for reasons I've never understood (trends come and go). I had also struggled to publish that year, which in hindsight was a major contributing factor, but it had been difficult to find the time alongside teaching responsibilities. I didn't secure another visiting position or postdoc. In my field, a C.V. gap in your post-Ph.D. career path is a death sentence, and I was wise enough to avoid the adjunct trap, so after the standard period of grief mourning my academic career I instead moved to a heavily populated metropolitan and stayed with generous family until I secured a job to pay the bills. Just under a year later I really \"shifted\" into research industry.\n\nBest decision of my life, never regretted leaving. Very much enjoy working 9-5 for a company that treats me well, compensates me well, and has great benefits. I also have much better career security - my company could disappear tomorrow but I could probably find a similar job in a couple months without the need to relocate. I miss teaching but if I ever want to do it again, I can probably get a weekend/evening adjunct job teaching one class.",
      "author": "cee2027",
      "created": 1624460576,
      "upvotes": 1,
      "replies": {}
    },
    "h5upevu": {
      "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h5upevu/",
      "text": "I went into product / industrial design and have struggled my whole entire life. Despite finally working as a Sr. at my last job, I can't find anything at this point. I'm broke again (for the second time) and have to move home... living with my mom. 🙄\n\nI'm 44, I have no wife, no property, no family, and no perceivable career future. I'm the prime example of a failure at life. All my hard work has been for not. \n\nFailure is real. Our stories never get told. 😔",
      "author": null,
      "created": 1626768643,
      "upvotes": 1,
      "replies": {
        "h6cxprp": {
          "link": "/r/AskAcademia/comments/o1wvcu/career_failure_stories/h6cxprp/",
          "text": "Thanks for all the votes and comments. 😒 What a useful sub. /s",
          "author": null,
          "created": 1627129747,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}