{
  "sid": "penm2k",
  "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/",
  "title:": "Where do you find journal editing services?",
  "text": "I am a Ph.D. student and I'd like to get my journal article reviewed before submission. I was wondering if some of you have any good suggestions to find an editing service. I'm in the STEM field.\n\nThank you!",
  "author": "BC_phd",
  "created": 1630346902,
  "updated": 1634079445,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hayr4se": {
      "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/hayr4se/",
      "text": "Do you want someone to review your article or to edit it? I'd argue they're two different things. \n\nRegardless, I think you should be getting your advisor and peers to review your work, and you should be editing your papers yourself. It's all part of the learning process.",
      "author": "01010100111011011011",
      "created": 1630351316,
      "upvotes": 23,
      "replies": {}
    },
    "hayhn8m": {
      "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/hayhn8m/",
      "text": "Your advisor and labmates should do that.",
      "author": "forever_erratic",
      "created": 1630347380,
      "upvotes": 30,
      "replies": {}
    },
    "hayhyv1": {
      "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/hayhyv1/",
      "text": "There might be a writing team within your university that would be able to provide assistance or ask some colleagues. As part of the peer review process at journals, most reviewers will make comments suggesting edits and once accepted, the journal editing service will do some changes as well. I would avoid paying money for an external company to edit your work before submission to a journal, not least because they are simply making profit for very little work.",
      "author": "Exonian13",
      "created": 1630347516,
      "upvotes": 9,
      "replies": {
        "haz4aip": {
          "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/haz4aip/",
          "text": ">not least because they are simply making profit for very little work.\n\nFor the customers I work with (mostly not native English speakers), the professional editing step takes the paper from the state where the referees refuse to review it to a state where it can be reviewed and published. That is, there is no paper without the external editing.\n\nThe authors are generally excellent scientists who have done fine work, but they lack the familiarity with English that would enable them to articulate their methods, results, and conclusions clearly enough.\n\nIt's great if one can turn to colleagues or the home institution for high-quality English editing, but many researchers worldwide don't have this favorable arrangement.\n\nIt's clear (from this thread in particular) that in academia, there's resistance regarding some types of professional services. Many PIs who wouldn't think twice about hiring a machinist to make a part or buying off-the-shelf equipment instead of building it, say, balk at hiring an editor (or an illustrator). They would consider English editing skills (and figure-making skills) to be part of being a good researcher. \n\nI don't necessarily take this position for countries in which English isn't spoken as a native language, for example. (I don't know if the OP here falls into this category, but it doesn't matter to me.)\n\nFor instance, whether a Chinese or Brazilian researcher can use English articles and prepositions smoothly has little bearing on their research ability, and having a professional scientific editor smooth out such issues is arguably money well spent.",
          "author": "Chemomechanics",
          "created": 1630356757,
          "upvotes": 9,
          "replies": {
            "haz73la": {
              "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/haz73la/",
              "text": "I can respect many aspects of your response but putting OP in a position where they have to pay for services cannot be the default position. If there are funds available to purchase the services of an academic editor that does not cause OP to be out of pocket then that is a completely acceptable use of funds. I would not recommend however that OP pays for services until all free avenues had been explored given the limited wage/funding/stipend that many students have (and many do not even have that)",
              "author": "Exonian13",
              "created": 1630357933,
              "upvotes": 4,
              "replies": {
                "hb0c8tl": {
                  "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/hb0c8tl/",
                  "text": "Yes. If indeed OP is at a university that isn’t native English speaking hiring a service would be the responsibility of the PI (if it was intact appropriate). If OP is just an ESL then it’s the responsibility of the PI and other lab mates to help them out. \n\n(This is exactly how it works in my lab with our ESL members: someone else + the PI review the paper, the PI to a greater extent, other students to the extent of just “does this make sense?” or small edits. Having OP hire a service puts him at a disadvantage to native English speakers.)",
                  "author": "little_grey_mare",
                  "created": 1630376828,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hb2kq6i": {
      "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/hb2kq6i/",
      "text": "Agree with others, your advisor and labmates/drinking buddies is the best and cheapest option. \n\nWell, if you really need someone else....now many publisher offer proofreading service, just email editor or someone. It is quite expensive but it is surely there.",
      "author": "COFenirr",
      "created": 1630425487,
      "upvotes": 2,
      "replies": {}
    },
    "hb05o07": {
      "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/hb05o07/",
      "text": "Try searching the Editorial Freelancers Association directory",
      "author": "grinzibo",
      "created": 1630373718,
      "upvotes": 1,
      "replies": {}
    },
    "hb1rjm8": {
      "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/hb1rjm8/",
      "text": "You also have open peer review platforms that allow you to post your paper as a preprint before submitting it to a journal, like arXiv. Make sure the journal you want to publish in allows this, but many of them do. If you're looking to have the language of your paper edited,  you could try Writefull.",
      "author": "Impressive_Chard_608",
      "created": 1630412508,
      "upvotes": 1,
      "replies": {}
    },
    "hb3udr1": {
      "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/hb3udr1/",
      "text": "You didn’t mention why you are seeking reviewers and/or editorial services, so hard to say what you need, but here are some options:\n\nProofreading for grammar: other PhD students or friends that are good at that. If this fails, paid services are easily found. I am editor for a scientific journal published by Wiley and we have editorial services linked on our website. It is often critical for non-native English speakers, but sometimes needed for native English speakers.\n\nReviewing the content and/or scientific aspects of the paper: your advisor(s) and anyone else in your network with sufficient expertise. If that fails go to upwork.com or fiverr and search for editorial services for your subject area.\n\nBut wait! If the paper is readable and uses college-level style and grammar then you can just submit it to a journal for review. You can also try emailing the journal editor directly and just asking her if she thinks it is ok for review or needs work.",
      "author": "OKswimmer2684",
      "created": 1630444236,
      "upvotes": 1,
      "replies": {}
    },
    "hayp8v8": {
      "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/hayp8v8/",
      "text": "I've edited papers for [Research Square / American Journal Experts](https://www.researchsquare.com/researchers/editing) on and off since 2007 and strongly recommend them. You'll get one or two (or more, depending on which tier you select) sets of eyes on your manuscript from subject matter experts. They'll cover proofreading, sentence and paragraph flow, natural language editing, field-specific terminology, figure formatting, and journal recommendations, depending on which services you need. Your institution may already have an account and funds to cover these professional editing services (or services from another provider).",
      "author": "Chemomechanics",
      "created": 1630350540,
      "upvotes": -1,
      "replies": {}
    },
    "hazy14n": {
      "link": "/r/AskAcademia/comments/penm2k/where_do_you_find_journal_editing_services/hazy14n/",
      "text": "This is coming from someone (me) who sucks at English but has published/currently writing, you will just need to improve your writing by 1) taking a writing class, 2) getting your coauthors to edit and really considering their comments, and 3) reading more papers to learn how to write scientifically. One option is to buy the Google grammar service (I think $10 a month), which edits for sentence structures and grammar. \n\nThere is always a concern with confidentiality when sharing unpublished data with any one other than your coauthors. \n\nHonestly, just write a good enough paper and submit it. I tried so hard to improve my paper for over half a year, with so many edits, and the journal rejected it within a day. Then their sister journal rejected it also within a day. Then a higher journal sent it to review. Who even knows what is going on in the minds of editors. So don't overthink it and just submit it.",
      "author": "chillzxzx",
      "created": 1630370155,
      "upvotes": 0,
      "replies": {}
    }
  }
}