{
  "sid": "qb2ce7",
  "link": "/r/AskAcademia/comments/qb2ce7/cover_letter_email/",
  "title:": "Cover Letter Email",
  "text": "Hi all! I have an academic job that I am applying for, but the application is not through a website. Instead, I have to email my cover letter and CV to the person advertising it. Does anyone have advice on how to word that email? It clearly shouldn't be a rehash (right?) of the cover letter, so should I just say \"I am applying for X position\"?",
  "author": "skydivingbigfoot",
  "created": 1634612019,
  "updated": 1636173396,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh6x9mr": {
      "link": "/r/AskAcademia/comments/qb2ce7/cover_letter_email/hh6x9mr/",
      "text": "I appreciate you asking this because we receive cover letters and emails that are atrocious that immediately get trashedI appreciate you asking this because we receive cover letters and emails that are atrocious that immediately get trashed\n\nYou want to limit it to just a few sentences. And make sure those sentences have capital letters and periods and no spelling errors\n\nYou want to say something simple like thank you so much for the opportunity to apply for this position. Attached you'll find my cover letter and resume.\n\nThen find one Sentence that just speaks to why you would be a good fit for this job or company.\n\nMake sure you say dear person's name. Tried to avoid  gendering people\n\nAnd sign it sincerely with however it is you want to be called\n I.e. If your name is Jonathan what you like to be called Jon that's how you sign it assuming that your email already has a signature on it\n If it doesn't it should with your email and phone number easy to find",
      "author": "Elsbethe",
      "created": 1634614053,
      "upvotes": 4,
      "replies": {}
    },
    "hh9o2vp": {
      "link": "/r/AskAcademia/comments/qb2ce7/cover_letter_email/hh9o2vp/",
      "text": "So I think you have two options. One is make your cover letter and email one and the same or just write a brief note in the email saying:\n\nDear whoever you are,\n\nI'm writing to apply for the job as a llama karma farmer which I saw advertised in the llama karma farmer fortnightly. I have attached my CV and cover letter as requested. If you need any further information please do get in touch at this email address. I look forward to hearing from you.\nYours Sincerely\nApprentice  llama karma farmer.",
      "author": "ACatGod",
      "created": 1634670584,
      "upvotes": 1,
      "replies": {}
    }
  }
}