{
  "sid": "pc17th",
  "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/",
  "title:": "Asking prospective Phd advisor questions related to racism/xenophobia a bad idea?",
  "text": "Hi,\n\nI’ve been in touch with a prospective Phd advisor in California whom I seem to have great chemistry with, research wise and personally. \n\nI work in Ecology where you’re often out doing field work close to rural communities. During my past stints as an intern I have had bad experiences working alone in the field in Europe(I’m brown), this also seems to be a problem in the States at least to some extent where ethnic minorities have in instances been made to not feel welcomed in the rural communities they were working close to, or they straight up encountered racist graffiti. \n\nWould it be appropriate to ask him how he would make sure his grad students(of color) feel comfortable working alone in the field? \n\nHe seems like a very progressive and transparent person from our chat and I don’t think he would avoid or think negatively of such a question but I was curious if there was any academic etiquette which would make such a question inappropriate?\n\nThank you",
  "author": "throwaway280699",
  "created": 1629989940,
  "updated": 1634079474,
  "over_18": false,
  "upvotes": 123,
  "upvote_ratio": 0.91,
  "comments": {
    "hafmosp": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hafmosp/",
      "text": "It's never inappropriate to seek reassurance that you'll be safe and supported at work, that's the bare minimum. Hope they're receptive to chatting about it, and maybe ask if there are any current/former students that it'd be worth talking to.",
      "author": "A1B6",
      "created": 1629991167,
      "upvotes": 63,
      "replies": {}
    },
    "hafngxw": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hafngxw/",
      "text": "Definitely ask because the response will potentially be very telling, but you might get a better answer by asking students in the program/lab.",
      "author": "mediocre-spice",
      "created": 1629991486,
      "upvotes": 53,
      "replies": {}
    },
    "haflbce": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/haflbce/",
      "text": "This is a really good question to ask. You should have a reasonable expectation of safety while in the field, and the professor should have a plan on how to best maintain safety in the field. While I'd ask the professor, I'd also privately ask his lab as well, especially if there are lab members of color. This discussion around field safety for BIPoC in ecology has been ramping up in recent years, so there's a chance that this professor has already considered this issue, and if not, it's one they need to be aware of.",
      "author": "MisterMarge",
      "created": 1629990595,
      "upvotes": 136,
      "replies": {}
    },
    "hafu4v9": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hafu4v9/",
      "text": "Mirroring what others have said, excellent topic to discuss. Even if he is not a POC, he might know a colleague/someone in the field that can give first hand experience. Getting your PhD isn't just about learning to apply the scientific method, its being able to effectively and efficiently conduct science. This sounds like a barrier you will definitely need to address and they/someone they know should be able to help and guide you.",
      "author": "CptSmarty",
      "created": 1629994152,
      "upvotes": 18,
      "replies": {}
    },
    "hafviw1": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hafviw1/",
      "text": "This is a very good question to ask and if he makes you feel like it is inappropriate or rude, then that's an indication that you probably would not want to work with him. \n\nIf you don't feel comfortable asking him, then perhaps finding a graduate student who has worked with him that may be able to tell you more.",
      "author": "CurvyBadger",
      "created": 1629994707,
      "upvotes": 12,
      "replies": {}
    },
    "hafmxo2": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hafmxo2/",
      "text": "Nope, this is a great question! I'm a minority and representation + inclusion is very important to me, so I asked professors who I interviewed with as well as grad students what the vibe was both within the university and in the city.",
      "author": "QueenoftheSundance",
      "created": 1629991267,
      "upvotes": 27,
      "replies": {}
    },
    "hahv2ym": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hahv2ym/",
      "text": "Ask - the answer will tell you if you want to work with them. During my phd interviews, I asked directly how each program supported women of color in their classes and research. One school not only said they were incredibly happy I asked, but had well thought out answers with evidence. The other schools scrambled. It became glaringly obvious not only where I would be comfortable, but which institution I was willing to support. You absolutely should ask, and you should have absolutely no shame in doing so.",
      "author": "red-whine",
      "created": 1630024666,
      "upvotes": 5,
      "replies": {}
    },
    "hai5w85": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hai5w85/",
      "text": "No just be straightforward. I think about this kind of stuff for my students doing remote fieldwork all the time.",
      "author": "eggplant_wizard12",
      "created": 1630029792,
      "upvotes": 3,
      "replies": {}
    },
    "hagi59h": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hagi59h/",
      "text": "This is a topic that has frequently been overlooked by a white and male dominated field. Not only is this an entirely appropriate question to ask, it is a question that every single university SHOULD have already considered and have a current answer for. I know my graduate school had not considered this topic until a woman of color professor was hired and instituted her own safety protocol for her students in the field. However, it is now being considered by the entire department. Many adjunct-level professors are also required to explain how they would approach protecting students belonging to marginalized groups, including race, sexual orientation, gender identity, etc as part of their interview processes. Usually that would be within a classroom context but it feels appropriate to mention here as well.",
      "author": "Yamakinmenervous",
      "created": 1630003610,
      "upvotes": 10,
      "replies": {}
    },
    "hah5nhr": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hah5nhr/",
      "text": "I guess I'm departing from the rest here...I would not ask a professor, \"how he would make sure his grad students(of color) feel comfortable working alone in the field.\"\n\nI wouldn't ask, firstly, because a professor does not move the cosmos. You want to ask him how he will control the environment you will be in when you are by yourself doing fieldwork? What could he possibly do? You want to be a researcher after the PhD presumably. What will you do when he's not there to move the cosmos for you? I wouldn't ask it, secondly, because you've phrased it in a way that is not his job. \r  \n\r  \nYour concerns are obviously valid and I'm not trying to diminish your experience, but you could frame it in a more appropriate way, e.g.: \"I have experienced xyz racism in previous fieldwork. What resources are available to me at x university *when* I encounter this kind of environment in the field at y location. Have you had experience mentoring people who come from \\[insert your demographic\\] encountering this kind of issue and, if so, how did you address it?\" That is plenty for the first email. If he responds to the effect that such as situation has not arisen, you could hopefully still feel things out from the response.",
      "author": "narwhal_",
      "created": 1630013143,
      "upvotes": 10,
      "replies": {
        "hahgpwf": {
          "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hahgpwf/",
          "text": ">What could he possibly do?\n\nPlenty! I firmly disagree that the supervisor has no control of the situation-- a student's safety is their responsibility, and it is reasonable to expect extensive planning and accommodation (\"moving the cosmos\") to ensure this. The topic of safety of marginalized folks during fieldwork has been a very active field of discussion in ecology in recent years, and the potential advisor's familiarity with the topic might be quite telling. For example, Demery and Pipkin (2021, [pdf link](https://www.canterbury.ac.nz/media/documents/oexp-science/biological-science/Field-work-safety.pdf)) outline the following actions for supervisors to support vulnerable individuals in the field.\n\nExcerpts from the linked piece:\n\n>\"What can supervisors do to support at-risk individuals?\n\n1. Self-educate on the experience of your team member’s identity, and the corresponding risk that they may encounter in the field...\n2. Contact relevant institutional offices... on how to best manage risk in the field\n3. Create a field risk management plan\n4. Provide materials to clearly identify researchers and their purpose\n5. Have a conversation with all research team members on the risks and preparations to minimize risk.\n6. Create a time and space to talk to research team members specifically about fieldwork safety concerns in advance of the field season, and touch base with them throughout the season\n7. Supervisors that do not share the same identity as their researchers... If researchers bring up potential or experienced risks, validate their experiences and assist in modifying the project so that they can safely continue conducting research.\n8. The scale of risk can increase dramatically in an international field site.\n9. At established field sites, introduce researchers (via e-mail or in-person) to the manager of those locations...\n10. When possible, introduce new researchers to established field locations...\n11. Assist researchers in establishing safe housing before arriving at the field location.\n12. Review and agree upon fieldwork and safety plans with the researcher before any fieldwork begins.\n13. Actively engage with researchers on how to reorganize fieldwork practices if and when there are restrictions on movement...",
          "author": "flyingtowels",
          "created": 1630017970,
          "upvotes": 16,
          "replies": {
            "hainp8m": {
              "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hainp8m/",
              "text": "These are mostly vague, broad, emotionally validating yet not actionable. The only supposedly actionable item might be preparing a material that will identify the researchers and communicate the purpose effectively. Even then, racists won’t care if you’re a researcher or not. So no, there is no set of safety measures that 100% prevents any foreseeable racial attack, let alone any physical assault. Again, it is not an easy undertaking to figure out whether an attack was racially motivated, so focusing on the racial aspect won’t cut it. From my perspective, getting burglarized by impoverished homeless people is way more likely than getting attacked for being a person of color.\n\nCalifornia is huge and diverse. But even the most pernicious of racists likely won’t have the audacity—unless deranged or mentally ill—to personally attack someone, especially if researchers move en masse. Your needs are best communicated when your advisor can clearly see that you’ve thought about it yourself and when the request is specific. It’s quite rude to ask to think about what they can do for you.",
              "author": "orgasmicstrawberry",
              "created": 1630038786,
              "upvotes": 6,
              "replies": {
                "hajmt9a": {
                  "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hajmt9a/",
                  "text": "While the most important aspect of safety to ensure might be safety from physical violence, many racist/exclusionary actions do not manifest as physical attacks but intimidation, use of slurs, microaggressions, exclusionary actions, etc. Establishing your formal role in a physical location (i.e., having a sign indicating that you belong there, and redirecting any queries towards a supervisor) legitimizes a researcher and reduces the chances that, e.g., a passing racist assumes ill intentions on the part of the researcher. There are also several  specific suggestions in the above list-- check out the paper for an unabbreviated version.\n\nI agree that, as in all things in an interview, the appropriate phrasing will go a long way. I do not agree that it is rude to ask, and would consider it a good sign of engagement from a potential student who is concerned about their safety and that of their peers. If a would-be advisor found it a rude question (\"what am \\*\\*I\\*\\* supposed to do to prevent someone from assaulting you?\") instead of a challenging question (\"well we follow the principles outlined in this NEE paper and seek to minimize risks\"), I would consider it a huge red flag. Also-- isn't an interview with a prospective advisor sort of about what they can do for you? A prospective student should come away from such an interaction with an in-depth understanding of the mutual expectations in an advisor-advisee relationship including funding, health insurance, mentorship style and engagements, support for x years, opportunities for collaborations, networking, etc.",
                  "author": "flyingtowels",
                  "created": 1630064992,
                  "upvotes": 1,
                  "replies": {
                    "hajtr7q": {
                      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hajtr7q/",
                      "text": "It is even more absurd to ask an advisor—or anyone around you—to prevent microaggressions or verbal accosting. It would be understandable if the request was to ensure inclusivity and diversity in the department/lab/team because the advisor gets to set the tone or at least have a say in how *they* approach these matters. But a random person out on the street? No matter how you spin it, unfortunately not even the US President has the right or power to regulate their behaviors.\n\nEngaging the local police is a bit different. The point is that the request/query needs to be specific enough. Otherwise, it would only sound like a passive aggressive ask to root out all existing microaggressions—which is inherently determined subjectively and therefore whose definition varies person to person. If the question is ill-defined, no advisor can solve it for you. If the question regards a broad range of human behaviors that don’t necessarily escalate to physical altercation, then it can come off as asking the advisor to be a superhuman. It’s a risky and touchy subject to broach.",
                      "author": "orgasmicstrawberry",
                      "created": 1630068778,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hb2zfja": {
              "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hb2zfja/",
              "text": "I had essentially the same questions as narwhal\\_, and also don't really have a sense as to how these suggestions could \"make sure his grad students(of color) feel comfortable working alone in the field.\" At best they do a bit of damage mitigation.\n\nThere is the obvious point (also made by orgasmicstrawberry below) that very few of these are actually plans - most are plans to make plans or plans to consult about plans (1-8;12-13).\n\nMore importantly, the concrete plans seem insufficient. Most of them are about familiarizing the researcher with the field location (9-11). But it is basically impossible to do this in even a slightly comprehensive way unless you're doing fieldwork in an extremely isolated location, with perhaps a few dozen people you know quite well. I've known some people working in such a situation (small teams in the arctic), and perhaps that is the OP's situation, but it seems fairly rare.  \n\n\nI don't have any solutions myself. The OP's questions seems *extremely* hard to answer to me. I don't do work in smaller/isolated locations myself these days, but I certainly did when I was younger and certainly experienced some pretty explicit racism (including slurs several times and assault once, though strangely enough never graffiti). I didn't know how to stop it then, and I certainly don't know how to stop it at a remove for my students. I can't imagine how any of suggestions (9-11) would have made any difference.  \n\n\nI know it is easier to complain than to fix things, but I don't think it makes any sense to pretend that you can make much of a dent in these things with the resources that a typical PI commands. Damage mitigation seems like the best thing you can do, and I don't think these are terrible suggestions to that end. In particular, I like all of the suggestions along the lines of \"let people adjust their project when they run into something they dislike; make it easy for students to tell you, and don't assume that the student has misinterpreted actions that they see as hostile.\" Unfortunately, it is hard to actually do any of that until something at least a little bad has happened...",
              "author": "HM_D",
              "created": 1630431391,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hage6ig": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hage6ig/",
      "text": "Yes you should ask.",
      "author": "n1cenurse",
      "created": 1630002005,
      "upvotes": 2,
      "replies": {}
    },
    "hafx7nk": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hafx7nk/",
      "text": "And all this time my dumbass thought xenophobia is the fear of xenomorphs.",
      "author": "FunBackground2575",
      "created": 1629995372,
      "upvotes": 4,
      "replies": {
        "hahr2mc": {
          "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hahr2mc/",
          "text": "No, thats just called being normal. Look i dont look down on those that are looking for a good time with a facehugger, but the chestburstin shouldnt be for anyone.",
          "author": "kaisong",
          "created": 1630022768,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hafysjz": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hafysjz/",
      "text": "Rural Californians are nowhere as racist as your average Euro lmao",
      "author": "grandpassacaglia",
      "created": 1629995989,
      "upvotes": -1,
      "replies": {
        "hafz4wg": {
          "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hafz4wg/",
          "text": "Can't comment on that but the field sites are in Texas and Colorado.",
          "author": "throwaway280699",
          "created": 1629996121,
          "upvotes": 13,
          "replies": {
            "hagpyfn": {
              "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hagpyfn/",
              "text": "Your experience will be entirely based on the local community. Both Texas and Colorado have some of the most progressive and regressive communities you're going to find in the US.",
              "author": "TacoCult",
              "created": 1630006752,
              "upvotes": 11,
              "replies": {}
            },
            "hagvggo": {
              "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hagvggo/",
              "text": "As someone (a minority - Pakistani American) who went to UCLA (in California) and grew up in Texas (Dallas) from the ages of 10-17, I can confirm that California is much less racist than the European attitudes I have come across, which is obviously purely anecdotal. \n\nTexas is more of a mixed bag, but it is getting more progressive, and as far as being bad for minorities go - it is not the worst. I actually felt okay living in Texas, but moving to California and growing up actually opened my eyes to a lot of things, and now Texas *does seem* a little worse (by comparison). \n\nAll that being said, I think that your questions and feelings are more than valid, and you should absolutely do that for a *feel* of how you will likely be received and treated. As others mentioned, maybe talk to some of the other students and grad students he works with. \n\nBest of luck!",
              "author": "calmrain",
              "created": 1630008968,
              "upvotes": 3,
              "replies": {
                "hagx2kx": {
                  "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hagx2kx/",
                  "text": "It completely depends on where in Texas you are. To this day there are still sundown towns there. You probably already know what those are, but 100% worth researching if not. On the other hand, I really enjoy visiting Austin’s gay bars, and have a fantastic time. They do it all",
                  "author": "UnresolvedDrama",
                  "created": 1630009620,
                  "upvotes": 1,
                  "replies": {
                    "hah7vv7": {
                      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hah7vv7/",
                      "text": "Oh for sure. I’ve only been in Austin three or four times, but I visited Sixth Street, and that place is crazy haha. Austin does feel a lot like a weird California twilight zone. \n\nBut, yes, of course, it depends largely where you are because both states are massive. Dallas (and Fort Worth) has experienced massive population growth and suburbanization in the last two decades. I went from seeing mostly white people when I moved there (at the age of seven in 2000), to seeing a lot more minorities by the time I was leaving the DFW area in 2011 (for Los Angeles).",
                      "author": "calmrain",
                      "created": 1630014090,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hagnsp8": {
          "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hagnsp8/",
          "text": "Uh so we're going to compare people from a large region of the United States to people from an entire continent? There is no possible way you could accurately make a claim this general. It depends entirely on the region and the people.",
          "author": "roseofjuly",
          "created": 1630005885,
          "upvotes": 6,
          "replies": {
            "hahbg4y": {
              "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hahbg4y/",
              "text": "Tbh, at least he's right for Hungary.\n\nHell, we're racist against whites too.\n\nHungarians REALLY hate romanians, to the point it's used as a derogatory term where I live.",
              "author": "Hoihe",
              "created": 1630015619,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hag2c4x": {
          "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hag2c4x/",
          "text": "[removed]",
          "author": null,
          "created": 1629997359,
          "upvotes": -1,
          "replies": {
            "hag40c4": {
              "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hag40c4/",
              "text": "you'd be surprised.",
              "author": "solstice_gilder",
              "created": 1629998008,
              "upvotes": 7,
              "replies": {
                "hagbdv5": {
                  "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hagbdv5/",
                  "text": "As a brown European, no I wouldn't.",
                  "author": "rohanps",
                  "created": 1630000880,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "hag5eey": {
              "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hag5eey/",
              "text": "[removed]",
              "author": null,
              "created": 1629998541,
              "upvotes": 6,
              "replies": {
                "hagbat5": {
                  "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hagbat5/",
                  "text": "I am European. And brown. So no, they aren't.",
                  "author": "rohanps",
                  "created": 1630000845,
                  "upvotes": 2,
                  "replies": {
                    "haggh52": {
                      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/haggh52/",
                      "text": "I’m American and brown.  We’ve had different experiences and there is of course no objective answer to “who is more racist”, but in my experience, the racism I’ve experienced in the US has been much easier to tolerate and much less normalized than the racism I’ve experienced in various European countries",
                      "author": "Visible_Negotiation4",
                      "created": 1630002934,
                      "upvotes": 1,
                      "replies": {
                        "hajzk4b": {
                          "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hajzk4b/",
                          "text": "Good for you.",
                          "author": "rohanps",
                          "created": 1630071483,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hag7cva": {
                  "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hag7cva/",
                  "text": "\"Europe\" spans a wide array of countries and cultures.\n\nSpeaking from a British perspective, I'd say we're just as much a mix of racist/anti-racist attitudes as you'll find in the states, it really depends on the kind of bubbles you're exposed to. I'd imagine the same can be said in many other European countries.\n\nI'm not saying that OP's concerns are unfounded, simply that I wouldn't expect an entire continent to be worse than certain red states.",
                  "author": "foibleShmoible",
                  "created": 1629999300,
                  "upvotes": 2,
                  "replies": {
                    "hagem5a": {
                      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hagem5a/",
                      "text": "As a brown person in a red state with family in Europe (multiple countries I’m not going to bother listing), that I frequently stay with , it is just as bad and unfortunately worse racism came from white liberals (which is something that occurs in the US too). Brown people aren’t the major minority group in the US so we get a level of privilege that we do not get in European countries. If op was black that would be a different convo that I personally can’t speak on but brown people do not live the black experience therefore racism towards black people cannot be equated/compared to brown people, even in red states. \n\nUK and France are probably the worst for brown people, but I’ve had some  bad experiences in Belgium, Amsterdam, and Switzerland. Actual hate crimes are a concern in UK and France but in general, there is a lack of knowledge on implicit racism among European liberals that will expose OP to a bunch of micro aggressions and blatantly ignorant comments in the workplace specifically among colleagues who do not think they are racist. I suggest OP read up on what is occurring between the French government and UNEF (college student Union) because those articles perfectly sum up the outdated understanding of racism most Europeans (and white people in general) have. The idea of “I’m against racism therefore I can’t possible be racist” is extremely rampant (just as it is in the US) so you can have an issue in addressing hurtful comments but hopefully you have people in your corner to help you out.\n\nI know Americans get a bad rep in Europe but even if I speak a language fluently, I get treated better when I speak English and pull the American card, because that unfortunately gives me a level of privilege and an inch more of respect than people who are just from my country receive, so OP I suggest pulling the American card, especially in rural areas to get better treatment. \n \n@fouvleshmobile my message veered off towards OP, but thank you for replying. My reply was long since I’m wordy, but I hope it didn’t come off as combative and know that I am genuinely open to having a convo with you in the comments of you have any critiques!",
                      "author": "Visible_Negotiation4",
                      "created": 1630002179,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hag5v2n": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hag5v2n/",
      "text": "I'm TIRED of this thing being an issue. What's with racists. One thing is having some time adapting or understanding a different culture, and a whole different thing is to deliberately be aggressive for a totally unsupported reason. Again, what's with racists.\n\nSo sorry that this is an inconvenient for you, and hopefully you won't have to put up with any threats or menaces for who you are.",
      "author": "queen_victoria_i",
      "created": 1629998721,
      "upvotes": -3,
      "replies": {}
    },
    "hajwplx": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hajwplx/",
      "text": "Of course this is appropriate. My own advisor takes pains to look after me beyond just monitoring my academic work, and it’s a large part of why I chose him. Definitely ask!",
      "author": "chuchinchichu",
      "created": 1630070192,
      "upvotes": 1,
      "replies": {}
    },
    "hanzozs": {
      "link": "/r/AskAcademia/comments/pc17th/asking_prospective_phd_advisor_questions_related/hanzozs/",
      "text": "Prospective PhD students in my former department in California often asked professors and prospective advisors about the culture and their values; I know of two cases where the answers to those questions dissuaded the prospective students from accepting the offer. Better to ask before you commit, also to signal your expectations.",
      "author": "TheoryProf",
      "created": 1630145492,
      "upvotes": 1,
      "replies": {}
    }
  }
}