{
  "sid": "at2yh1",
  "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/",
  "title:": "What hobbies do you do whilst studying on a degree?",
  "text": "A lighter discussion for the afternoon. \n\nI wanted to put this question to you all. I feel that it's important to talk about what people enjoy outside their studies. I think it's important for younger graduate students (like myself) to understand that it's not all about studying. \n\nI only ask because I actually picked up cross stiching in the last year to help me relax. It really helps. I also go to the gym and (when I can) take part in historical re-enactment. However, the great thing about something like cross stiching is that you can actually see things coming together and having a end point is an imporant thinking. Especially when doing a PhD. \n\nSo what are your hobbies outside work? Feel free to give suggestions and tips. ",
  "author": "DoodleCard",
  "created": 1550754544,
  "updated": 1634082326,
  "over_18": false,
  "upvotes": 97,
  "upvote_ratio": 0.95,
  "comments": {
    "egyalyp": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyalyp/",
      "text": "Reading fiction or non-fiction that has nothing to do with my area of study has been nice since it forces me to think about something else for a while. I also really like playing board games. ",
      "author": "_werebear_",
      "created": 1550756613,
      "upvotes": 67,
      "replies": {
        "egyh7vm": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyh7vm/",
          "text": "+1, both are fantastic for the escapism we’re all in need of every now and then.",
          "author": "i_give_ye_pestilence",
          "created": 1550762019,
          "upvotes": 9,
          "replies": {}
        },
        "egyisko": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyisko/",
          "text": "This is so important. It’s hard sometimes, especially if you’re at a point where you’re reading a lot for your program. But it’s soooo necessary to find something that reminds you to love reading. And for some faculty (including people who might someday hire you), “what are you reading” is a key discussion point.",
          "author": "phdr_baker_cstxmkr",
          "created": 1550763162,
          "upvotes": 8,
          "replies": {}
        },
        "egyrivv": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyrivv/",
          "text": "Same. I like to rotate; fantasy, sci go and then either history or a biography.\n\nRight before bed every night for an hour or so. ",
          "author": "Lokland881",
          "created": 1550769192,
          "upvotes": 5,
          "replies": {}
        },
        "egzf9ng": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egzf9ng/",
          "text": "I never really have time to read, but I recently discovered audiobooks, and they are a godsend. When walking on campus (or making dinner), I get to lose myself in a book. It's awesome, though not quite the same as reading physical books...",
          "author": "singingtangerine",
          "created": 1550784963,
          "upvotes": 3,
          "replies": {
            "egziaf1": {
              "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egziaf1/",
              "text": "[deleted]",
              "author": null,
              "created": 1550787013,
              "upvotes": 3,
              "replies": {
                "egzsjnf": {
                  "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egzsjnf/",
                  "text": "When I have time I do read paper books, which only makes me miss them more when I don't have time during the semester :(",
                  "author": "singingtangerine",
                  "created": 1550794541,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "egy9wex": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egy9wex/",
      "text": "drinking and crying - fortunately mostly drinking",
      "author": "thegreenaquarium",
      "created": 1550755944,
      "upvotes": 148,
      "replies": {
        "egyp7f0": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyp7f0/",
          "text": "Same, drink beer. Minus the crying lol.",
          "author": null,
          "created": 1550767619,
          "upvotes": 4,
          "replies": {}
        },
        "egz1mdk": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egz1mdk/",
          "text": "Drinking and crying... fluid intake and loss...",
          "author": "vingeran",
          "created": 1550775875,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "egybizm": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egybizm/",
      "text": "I go rock climbing twice a week. It's a bit of a price tag for the membership but it's definitely worth it. I just recently learned how to solve a Rubik's Cube while writing my dissertation. I play chess as well, but I've found lately I'm becoming a sore loser and it's not healthy for me to play (= . ",
      "author": "MrLegilimens",
      "created": 1550757436,
      "upvotes": 40,
      "replies": {
        "egye6lr": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egye6lr/",
          "text": "Came here to second this! I think it attracts a lot of academics because (with bouldering at least) there are \"problems\" that need to be solved. Your ability is very easy to measure and so there are very clear goals, clear things to improve, and it's great fun, good for your health and a wonderful community of people",
          "author": null,
          "created": 1550759666,
          "upvotes": 9,
          "replies": {
            "egyfm88": {
              "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyfm88/",
              "text": "I definitely don't do bouldering as much as I should! But by the time we're done on the top ropes I'm already pretty beat. ",
              "author": "MrLegilimens",
              "created": 1550760800,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "egyahjv": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyahjv/",
      "text": "Music has been a part of my life long before studying for a degree - so I practice every day.   \nBrazilian Jiu Jitsu is a lot of fun.  \nGoing out and being social when I can.  \nAnd cooking - I love to cook. ",
      "author": "RagidyyMan",
      "created": 1550756501,
      "upvotes": 32,
      "replies": {}
    },
    "egydes0": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egydes0/",
      "text": "Maybe not the most conventional hobby for grad school, but I got a dog. We do a lot of hiking on the weekend, and I do long walks or jogging with him in the AM before heading to lab and in the PM after I get home. Now that it's winter we are trying skijoring. Most people in my degree program have dogs, maybe it's doing our PhD at a University with a big vet school. A bunch of us get together often in the summer for pick-up soccer plus beer plus dogs, which is very delightful. It also gives me a solid excuse to leave lab, so I work more reasonable hours which has saved me from getting pretty burnt out, I think.",
      "author": "ZosterMonster",
      "created": 1550759034,
      "upvotes": 31,
      "replies": {
        "egyygu4": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyygu4/",
          "text": "\nAh I am jealous. Sadly I lost my dog that I look after periodically at whilst studying my phd two weeks ago. And my child hood dog from home a week before that. \n\nThat being said there is something about having a dog. Their unconditional love and affection is a major stress reliever. If I wasn't working abroad o think I would get a dog. Definitely. ",
          "author": "DoodleCard",
          "created": 1550773786,
          "upvotes": 7,
          "replies": {
            "egzkyze": {
              "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egzkyze/",
              "text": "I’m so sorry, that’s tough to deal with ",
              "author": "nonnihil",
              "created": 1550788909,
              "upvotes": 1,
              "replies": {
                "egzpi6g": {
                  "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egzpi6g/",
                  "text": "Dunno why I felt like mentioning it. But you're right. Every department with phd students should have a resident dog. \n\nThis needs to happen. ",
                  "author": "DoodleCard",
                  "created": 1550792237,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "egyaiqb": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyaiqb/",
      "text": "Cooking, knitting, sewing, reading, and learning a new language. I only cook on the weekends and I haven't read or sewn anything in a few months though.",
      "author": "goatsnboots",
      "created": 1550756531,
      "upvotes": 18,
      "replies": {
        "egyc8n9": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyc8n9/",
          "text": "My hobbies too 👌🏼 except the cooking, I’ll burn the apt down. ",
          "author": "emilynbauer",
          "created": 1550758066,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "egy9t4r": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egy9t4r/",
      "text": "A lot of those who I work with climb, as they enjoy the physical and mental challenges it provides. I’m getting into it currently and can see the appeal! It’s quite ‘relaxing’ in some senses. I also know a lot who cycle and swim.\n\n\n\n",
      "author": null,
      "created": 1550755856,
      "upvotes": 13,
      "replies": {}
    },
    "egyafuy": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyafuy/",
      "text": "[deleted]",
      "author": null,
      "created": 1550756457,
      "upvotes": 11,
      "replies": {
        "egyp5c0": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyp5c0/",
          "text": "+1 for running! It's the best thing for my mental health that I know of. Bonus points if it's on some beautiful trails (location dependent unfortunately). \n\nI also like hiking, rock climbing, and kayaking. Being physical and outdoors really does it for me. Indoor hobbies include baking and reading.",
          "author": null,
          "created": 1550767580,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "egy9w67": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egy9w67/",
      "text": "Weight lifting. Beyond being a hobby, it’s essential for my mental well-being and gives me an outlet for my stress and tension. Plus, the carryover to my research is huge. Both require strategy and discipline and force you to overcome adversity. \n\nNot to mention, being strong and looking good is never a downside.",
      "author": null,
      "created": 1550755937,
      "upvotes": 18,
      "replies": {}
    },
    "egyc5s8": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyc5s8/",
      "text": "Powerlifting. It's quite good for getting your mind away from the PhD. If you don't get your focus right in the gym, you're getting crushed. So you can't be thinking about the thesis or whatever. Plus, you can make it as simple as you want, or get complicated with different training methodologies. Once you get to lifting heavy weights it can take up quite a bit of time, which isn't great.",
      "author": "johu999",
      "created": 1550757998,
      "upvotes": 17,
      "replies": {
        "egyta1a": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyta1a/",
          "text": "Agree, but it depends on the person. I took up powerlifting and got sucked in the endless void of strength programming. It took my girlfriend making me realise that I was spending as much time designing periodisation training plans as I was doing my actual work to make me realise that I was using it as a distraction rather than a hobby. \n\nSo if you do take up lifting, find yourself a good program that makes you work hard for 5-6 hours per week in the gym, and then ban yourself from all lifting subreddits.",
          "author": "needlzor",
          "created": 1550770353,
          "upvotes": 7,
          "replies": {
            "egywilm": {
              "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egywilm/",
              "text": "Yeah, my favourite form of procrastination is to steal pirated copies of lifting and programming books and read them rather than things actually related to my research.",
              "author": "johu999",
              "created": 1550772499,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "egyit87": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyit87/",
          "text": "Same! We have a solid 5 graduate students in our department lifting daily at the rec. ",
          "author": "tatanka727",
          "created": 1550763174,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "egy9xrp": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egy9xrp/",
      "text": "I enjoy all the food related stuff that is within my reach. I enjoy seeing food-travel videos in YouTube. I try to cook recipes from different cuisines and try to learn different culinary techniques. I study engineering and believe me there's a whole lot of cool science behind different cooking stuff. We don't have certain ingredients and equipment in our country and therefore trying to improvise with whatever available adds a whole lot of spice to the experience! My dream is to buy an oven and have access to cured meats and be able to afford cheeses at the moment. Dunno if this was any help but I thought of sharing my experience ;)",
      "author": "BrownEukaryote",
      "created": 1550755980,
      "upvotes": 5,
      "replies": {
        "egyuokm": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyuokm/",
          "text": "I 100% share this dream",
          "author": "djingrain",
          "created": 1550771296,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "egyae07": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyae07/",
      "text": "Cooking and drawing mandalas\nDrawing mandalas help me relax, so I usually get into the drawing mode on a Friday evening or so just to avoid the headache I get because of my inability to relax \n",
      "author": "IntrovertedNerdHead",
      "created": 1550756409,
      "upvotes": 4,
      "replies": {}
    },
    "egye4ei": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egye4ei/",
      "text": "Me? I ate a lot of buffalo wings and drank on the weekends.  Later, I picked up mountain biking in the afternoons after \"work\", tried to go hiking when possible, and I tried to play on whatever intramural teams we had going at the moment in my grad program. In retrospect, while I'm glad I had at least some physical activity, I really wish I had more, as I wasted the most healthy years of my life.\n\nAlso- my advisor was an aikido master.  I tried that for a while with him, but I could only handle getting my mind kicked around, not my ass too.  BTW- he was a great, kind guy, I was just really bad at aikido.",
      "author": "Der_Kommissar73",
      "created": 1550759616,
      "upvotes": 5,
      "replies": {}
    },
    "egydw3z": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egydw3z/",
      "text": "Oh, god. So many: drawing (traditional and digital), got my black belt in karate, photography, cooking, hiking, movies, reading (fiction usually), model making, music, listening to podcasts/audiobooks and gaming (Nintendo Switch, and Twitch streaming)\n\nI think its incredibly important to have hobbies that expose you to non-academics/non-grad students. Also important to have something reliably constructive with defined benchmarks/endpoints. Science is frustrating, you can do everything perfectly right and get a negligible/shit result, so having something else in your life that doesn't do that is very rewarding.\n\nEdit to add: I maintained a strict work/life balance, scheduling my experiments and writing such that I minimized work in the evenings/weekends. Got my Ph.D. last August with no edits needed on my thesis post-defence.",
      "author": "taegre",
      "created": 1550759427,
      "upvotes": 3,
      "replies": {}
    },
    "egyawy9": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyawy9/",
      "text": "Painting and reading. I do that a lot to Destress. And I play some video games too",
      "author": "freyari",
      "created": 1550756891,
      "upvotes": 3,
      "replies": {}
    },
    "egybg9w": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egybg9w/",
      "text": "When i was in grad school i was heavily into the local music scene...there was one year i went to around 35 shows. Also hanging out pregaming with other people into the same music scene. And i took yoga classes fairly regularly and also took a few classes in tai chi and art at a local arts league thing.  Theee was one year I went to the gym all the time too.",
      "author": "abandoningeden",
      "created": 1550757370,
      "upvotes": 3,
      "replies": {}
    },
    "egydn3j": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egydn3j/",
      "text": "I play video games, watch youtubers that I follow, watch anime and lift weights and do calisthenics in my spare time. I like to forget work when I get home and do things I enjoy. Not that I don't enjoy the work I do in my PhD, but it's not the same as hobbies.",
      "author": "RandomPhysicist",
      "created": 1550759226,
      "upvotes": 3,
      "replies": {}
    },
    "egymu7q": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egymu7q/",
      "text": "Walking, birding, gardening and biking! I like all those activities because you can do them by yourself or with a friend. I recently got a bird feeder and I’ve found that watching birds while drinking coffee in the AM has been super relaxing too : ) Other than that I like thrifting or planning weekend trips. ",
      "author": "floweringdog",
      "created": 1550766005,
      "upvotes": 3,
      "replies": {}
    },
    "egyueac": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyueac/",
      "text": "Baking! Whenever I'm feeling stressed or need a break I like to test new recipes and improve my dessert and bread-making. It's pretty easy to take out your frustration on kneading dough. Plus when I'm done I have a study snack! It's a win-win.",
      "author": "hello_cello",
      "created": 1550771106,
      "upvotes": 3,
      "replies": {}
    },
    "eh00o5v": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/eh00o5v/",
      "text": "I like baking because it’s so precise that you can’t think of much else. I also love the process of trying out or creating recipes. I now also have lots of colleagues who know every Monday they get some baked treat and I like feeling like I’m making someone’s life a little better even for a few minutes. ",
      "author": "Rec0nSl0th",
      "created": 1550800765,
      "upvotes": 3,
      "replies": {}
    },
    "egyctjt": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyctjt/",
      "text": "I cook a nicer meal a few times a week. Been working through Gordon Ramsay's home cook book.\n\nThat, and Dark Souls on playstation. Love some dark souls. ",
      "author": "Calebchops",
      "created": 1550758550,
      "upvotes": 2,
      "replies": {}
    },
    "egygwvm": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egygwvm/",
      "text": "I taught myself how to knit and I love it for the same reason you like cross-stitching. I can see the finish product coming to life! \n\nI also started taking weekly piano lessons after I passed my quals to give me something to look forward to once a week that wasn’t lab related. ",
      "author": "walczykj",
      "created": 1550761790,
      "upvotes": 2,
      "replies": {}
    },
    "egysfjq": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egysfjq/",
      "text": "I impose an ~8:00am-4:30pm (weekday) working schedule so when I get home I can focus solely on hobbies outside of my PhD.\n\nCurrently I spend that free time climbing/powerlifting/snowboarding/hiking/camping, reading fiction, playing guitar, and cooking. I also like fermenting foods (sauerkraut, pickles) and beverages (kombucha, ginger beer). And of course social stuff like concerts/festivals and going out with friends.",
      "author": "OceanBiogeochemist",
      "created": 1550769800,
      "upvotes": 2,
      "replies": {}
    },
    "egysmhj": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egysmhj/",
      "text": "I started archery when I started my PhD. I really like it, it's quite meditative and my club is nice and the people are a different than my cohort (it's the university's club, so while we are all students, most are undergrads). Besides that, I love to cook and bake and do crocheting and gardening. I'm definitely unleashing my inner grandma.  ",
      "author": "ThreePenguins",
      "created": 1550769924,
      "upvotes": 2,
      "replies": {}
    },
    "egyco3i": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyco3i/",
      "text": "This is a great question. I think it's essential for an academic to have a cognitively stimulating hobby completely outside of your area of study. Mine is woodworking. I get an opportunity to create new items from raw materials. I go through the process of planning out a project and then working through the unforeseen obstacles as I advance the project along. Then I get the joy and pride of sharing something I built with others.\n\nIt flexes the same mental muscles as research, but it's on a much shorter time horizon and I can reach the same endgame more quickly. In fact, when I'm struggling with research, I'll go build something just to remember how to finish a project. Finishing research is a habit and woodworking helps me remember how to close the deal.",
      "author": "bs6",
      "created": 1550758423,
      "upvotes": 4,
      "replies": {}
    },
    "egydkwz": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egydkwz/",
      "text": "Made music and played squash! Squash is a great workout in a short amount of time and making music gave me a way of flexing the creativity muscle while relaxing.\n",
      "author": "Tibujon",
      "created": 1550759177,
      "upvotes": 1,
      "replies": {}
    },
    "egydv8g": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egydv8g/",
      "text": "Cooking(keeps me eating well), rock climbing/bouldering and running! I try to run two half marathons each year so it keeps me training for something. Rock climbing memberships are really expensive but once you’ve got your gear and all it’s a great social sport! :)",
      "author": "246011234567",
      "created": 1550759408,
      "upvotes": 1,
      "replies": {}
    },
    "egye83j": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egye83j/",
      "text": "Bouldering, gaming, and yoga",
      "author": null,
      "created": 1550759699,
      "upvotes": 1,
      "replies": {}
    },
    "egyed24": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyed24/",
      "text": "I'll second cross stitch! I love seeing a design come together. I can't really think too much about my research while cross stitching either, as I have to focus on the pattern.\n\nI also snowboard a lot in winter months - my university offers lessons at the local ski resort that I've taken 3 years in a row so far. I'm getting pretty good, and it's an exciting and fulfilling way to get out of the lab and into fresh air for the day.\n\nI find myself playing a lot of city-building or empire-building games as well, like Cities & Skylines, Civilization VI, etc.",
      "author": "vivalaemilia",
      "created": 1550759813,
      "upvotes": 1,
      "replies": {}
    },
    "egyem0s": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyem0s/",
      "text": "Completing a degree can be such a mentally stressful task and it all builds up in the form of tension through my body that I make it a priority to take good care of it. This means trying to eat healthy and picking up cooking (my hobby is doing it with a glass of wine by my side lol ). I also enjoy activities that make you become aware of every part of your body and your breathing patterns such as yoga and pilates. Unusually I pick up some heavy activities such as crossbox, and what I enjoy the most of them is that when I am 10 burpees deep and with 20 more to go I can only think of how much I can't wait for it to end and not on my pending work. \n\n&#x200B;",
      "author": "ellavienedelfuturo",
      "created": 1550760009,
      "upvotes": 1,
      "replies": {}
    },
    "egyewv4": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyewv4/",
      "text": "I like crafty things...these days I'm into big paint-by-numbers projects. Takes a long time to do but so satisfying when it's all put together. Helps me sort of clear my head and focus on just finding the next number 11, filling inside the lines and not missing any...\n\n&#x200B;\n\nI also like exercise. And drinking/dancing with friends when I'm feeling socially accepted. I have imposter syndrome even among my closest friends on my lowest days. ",
      "author": "khaleesi_onthatbeat",
      "created": 1550760250,
      "upvotes": 1,
      "replies": {}
    },
    "egyfobh": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyfobh/",
      "text": "Watching movies. Lots of them. I used to like doing this even in high school but i really went for it during my degree days. I would watch them while revising my tutorials or studying for finals. \n\n",
      "author": "givemeyourdonut",
      "created": 1550760845,
      "upvotes": 1,
      "replies": {}
    },
    "egyiki4": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyiki4/",
      "text": "Whitewater kayaking / cross country skiing. Depsite being busy I try to do these activities once a week minimum. Being outside is one of the best things to do contrasted to working inside at a lab bench all day! Also plan 2-3 day hiking/ canoeing trips every so often. Its important to take time for yourself. ",
      "author": "c0c0nutYAH",
      "created": 1550763002,
      "upvotes": 1,
      "replies": {}
    },
    "egyk57m": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyk57m/",
      "text": "I've been starting to read more fiction, I miss reading novels. I also play video games and watch YouTube a lot too - not quite a hobby perhaps but enjoyable :) ",
      "author": "cm0011",
      "created": 1550764134,
      "upvotes": 1,
      "replies": {
        "egyyz81": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyyz81/",
          "text": "I have moved to audio books and podcasts for reading non PhD related topics. Due to the fact that I have developed the ability to skim read papers. I find that I read far to slowly for reading to be relaxing and I don't want to loose my ability. So I listen to a lot of podcasts and audio books. \n\nOh I'm all about the YouTube. As I spend a lot of time on the microscope I need to have something on in the background. I sometimes dont listen and have ended up on the weird side of YouTube. \n\n",
          "author": "DoodleCard",
          "created": 1550774131,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "egymhat": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egymhat/",
      "text": "I have a part time bartending job so I can interact with non-academics. ",
      "author": "ldr6",
      "created": 1550765760,
      "upvotes": 1,
      "replies": {}
    },
    "egynfn8": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egynfn8/",
      "text": "Insect collection/identification ",
      "author": "jfaulkzx351",
      "created": 1550766416,
      "upvotes": 1,
      "replies": {}
    },
    "egypuz7": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egypuz7/",
      "text": "I play canoe polo twice or three times a week",
      "author": "FIST_IT_AGAIN_TONY",
      "created": 1550768061,
      "upvotes": 1,
      "replies": {
        "egyz0ge": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyz0ge/",
          "text": "What is canoe polo? ",
          "author": "DoodleCard",
          "created": 1550774153,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "egypvkg": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egypvkg/",
      "text": "Table top games really helped me through. Great for socializing too. Figurines as well, I got into DnD which eventually led me to painting figurines.",
      "author": "BonesOfAmber",
      "created": 1550768072,
      "upvotes": 1,
      "replies": {
        "egyz30p": {
          "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyz30p/",
          "text": "I love DnD and table top gaming. Just difficult to get everyone together and have the time! Did much more of that type of thing in my undergrad though. ",
          "author": "DoodleCard",
          "created": 1550774200,
          "upvotes": 1,
          "replies": {
            "egz1omo": {
              "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egz1omo/",
              "text": "Understandable. My university for grad school had a DnD society (club). This made it a lot easier.",
              "author": "BonesOfAmber",
              "created": 1550775918,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "egyq2wc": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyq2wc/",
      "text": "Weight lifting and running , learning Chinese, making bento boxes, shopping at thrift stores ",
      "author": "Deadbeat_student",
      "created": 1550768209,
      "upvotes": 1,
      "replies": {}
    },
    "egyq5sd": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyq5sd/",
      "text": "Calligraphy. My students comment on how pleasant it is to read my comments on their homework.\n\n&#x200B;\n\nWeightlifting. I'm not super serious about it, but seeing the slow progress is really nice. It happens faster than progress with my research, so it feels...productive.",
      "author": "nullomore",
      "created": 1550768261,
      "upvotes": 1,
      "replies": {}
    },
    "egyqfyf": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyqfyf/",
      "text": "Reading, releasing music, writing, basketball etc.",
      "author": "ThePersonof21",
      "created": 1550768453,
      "upvotes": 1,
      "replies": {}
    },
    "egyrcsu": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyrcsu/",
      "text": "Apart from general relationship stuff with my partner, since I started my postgrad I've really gotten into poker. The depth to the game is astounding, and I'm finding that I can spend so much of my time studying and playing the game. It doubles as social life, too, since when I'm not playing online there's the university's poker society.\n\nApart from that, I've started PC gaming a little bit again, now that Apex Legends has come out. I used to be a massive gamer, but as I got older and had more responsibilities it had to go on the backburner. But now I'm playing that for some of the weekend. It's nice because my other \"hobbies\" are usually things like poker, which are things I also study for to get better.\n\nI play guitar and write songs, too, but that's had to take a backseat since the workload increased and I picked up these new hobbies.\n\nI'm finding that I only really have one night a week (if that) free to see friends and have a social life, if I do everything else that I want to in the week. (I could prioritise social life ahead of the other stuff but I don't really want to). I never used to believe people when they told me how little free time you get when you live as an adult and have responsibilities and hobbies, but I'm definitely seeing that, now.",
      "author": null,
      "created": 1550769076,
      "upvotes": 1,
      "replies": {}
    },
    "egyrjxo": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyrjxo/",
      "text": "Family, reading and video games.",
      "author": "Lokland881",
      "created": 1550769212,
      "upvotes": 1,
      "replies": {}
    },
    "egysdlx": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egysdlx/",
      "text": "Honestly I don’t have a lot of time for hobbies, but I’ve got a world-building project on the go (has been for about three years now I guess really) and I’ve recently started relearning French. Trying my best to immerse myself in the language with podcasts, phrase books, videos etc etc. It’s coming along nicely I think.",
      "author": "Gauntlets28",
      "created": 1550769765,
      "upvotes": 1,
      "replies": {}
    },
    "egysmc8": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egysmc8/",
      "text": "Knitting and cooking. Both give you actual products to use or to give to others.",
      "author": "pineapplepizzaaa",
      "created": 1550769922,
      "upvotes": 1,
      "replies": {}
    },
    "egytjo5": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egytjo5/",
      "text": "I read a lot, mostly fiction and the occasional memoir. I also took up cooking (which I almost never did pre-grad school), and am finding ways to travel more! It's so important to give yourself a break every once and awhile. ",
      "author": "rockcandymelts",
      "created": 1550770535,
      "upvotes": 1,
      "replies": {}
    },
    "egytt47": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egytt47/",
      "text": "Rock climbing, as others have mentioned. Weekend trips. I also try to either read, play music or play a video game for 30 minutes or so a day. ",
      "author": "kittyful",
      "created": 1550770714,
      "upvotes": 1,
      "replies": {}
    },
    "egytues": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egytues/",
      "text": "Airplanes models, cycling and drinking ",
      "author": "ildared",
      "created": 1550770737,
      "upvotes": 1,
      "replies": {}
    },
    "egywf47": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egywf47/",
      "text": "Gaming, music, memes",
      "author": "tfburns",
      "created": 1550772435,
      "upvotes": 1,
      "replies": {}
    },
    "egyzfa0": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyzfa0/",
      "text": "I go to the gym three times a week and when I can I work on cosplay. Sewing & crafting help me get into “flow” which helps me stay away from drinking/using drugs to excess!\n\nI’m also trying to start paint nights with some other grad students, and I play dnd because having scheduled free time, for me, makes it easier to participate in my hobbies without the guilt",
      "author": "flowerbich",
      "created": 1550774424,
      "upvotes": 1,
      "replies": {}
    },
    "egz2pty": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egz2pty/",
      "text": "reading,\nmartial arts,\nplaying rts games",
      "author": "Griegz",
      "created": 1550776617,
      "upvotes": 1,
      "replies": {}
    },
    "egz4zrr": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egz4zrr/",
      "text": "Gyming/running, and occasional video gaming. I also work in retail one day per week to change the environment, socializing with non-academic people.",
      "author": "__foo_",
      "created": 1550778134,
      "upvotes": 1,
      "replies": {}
    },
    "egz5zkj": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egz5zkj/",
      "text": "I play DnD everyday Saturday and go out to happy hours with friends about 3 times a month. Other than that I enjoy just relaxing at home!",
      "author": "jazzapalooza",
      "created": 1550778784,
      "upvotes": 1,
      "replies": {}
    },
    "egz7gon": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egz7gon/",
      "text": "Help maintain a pretty well-known FOSS application, lift weights, look after my special needs kid, and bother my wife.",
      "author": "thisisbasil",
      "created": 1550779767,
      "upvotes": 1,
      "replies": {}
    },
    "egz7r29": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egz7r29/",
      "text": "I referee rugby. It usually takes up my entire Saturday, but 1) it’s social, 2) it’s exercise, 3) it keeps me around a sport I love so I make it work. ",
      "author": "rugbybackliner",
      "created": 1550779963,
      "upvotes": 1,
      "replies": {}
    },
    "egz9xcz": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egz9xcz/",
      "text": "I am both well through a masters and a big ol fan of pro wrestling. I also read, watch shows (god bless netflix's tiny seasons) and play videogames. Rarely get to beat them, but I've gotten to do a few that were really excellent recently. Board games and the bar with friends. Also, when I'm really stressed, building models cause using your hands instead of your head is so relaxing. I've only managed to slice my thumb once in the whole degree!\n\nEdit: Also done learned how to cook\n\n&#x200B;",
      "author": "De_Von",
      "created": 1550781387,
      "upvotes": 1,
      "replies": {}
    },
    "egzd7g5": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egzd7g5/",
      "text": "I am obsessed with travelling and bubble tea. I usually try to attend as many conferences and hackathons as I can just to get out of the city for a bit, and I like trying new bubble tea places :D",
      "author": "dudenotrightnow",
      "created": 1550783576,
      "upvotes": 1,
      "replies": {}
    },
    "egzh4z3": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egzh4z3/",
      "text": "Most recently I just got a Raspberry Pi to have a permanent solution added to my laptop second screen. Now I just spend time fiddling with it and thinking of projects to with it. ",
      "author": "MundaneEnd",
      "created": 1550786218,
      "upvotes": 1,
      "replies": {}
    },
    "egzhf2z": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egzhf2z/",
      "text": "I challenged myself to draw something every day to release the stress and go for a hike with my dog regularly... This semester I managed only to come home, stare at the wall and fall asleep so far but I'm sure it's gonna get better! Cleaning is quite good for clearing one's head. I'm also interested in weight lifting which I really wanna try. ",
      "author": "Lady_of_Ironrath",
      "created": 1550786407,
      "upvotes": 1,
      "replies": {}
    },
    "egzl55g": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egzl55g/",
      "text": "I can not recommend table tennis enough. Brain plasticity. Stress Release mindlessness and good fun. And best of all - not the game itself, rather the conversations and people you meet while waiting to play. And as you progress it just gets better. ",
      "author": null,
      "created": 1550789033,
      "upvotes": 1,
      "replies": {}
    },
    "egznidp": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egznidp/",
      "text": "Similar to what others have already mentioned, I also go bouldering regularly! I think it's a nice combination of strength training, improving body tension/control, mobility and agility on the physiological side with puzzle-solving as a challenge for the brain.\nAnd I have two cats I have recently started to train (clicker training, works similar to training dogs). It's only a few minutes a day, but it's fun and gives me a nice sense of achievement when they finally \"get\" a new trick :)",
      "author": "make_all_the_norms",
      "created": 1550790731,
      "upvotes": 1,
      "replies": {}
    },
    "egzr199": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egzr199/",
      "text": "I used to run, but then I got injured and just haven’t gotten back into it. \n\n\nI’ve been a live model on and off for many years so recently I was a model for an event where I was the canvas. I had an absolute blast. I stood there naked and shivering for 4 hours being painted, and then got all my decorations on (wig, tutu, hat) and got to strut my stuff on the runway. It’s made me want to seek out more opportunities like this outside of my PhD because it’s something I enjoy so much. ",
      "author": "shewhoruns",
      "created": 1550793388,
      "upvotes": 1,
      "replies": {}
    },
    "ehgdpi7": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/ehgdpi7/",
      "text": "I started taking dance classes! There’s a studio a 5 minute walk from my apartment and they offer drop in classes. I really make the effort to go as often as I can since I love it and it’s not too much to take an hour out my day do something for me even if there’s work to be done.",
      "author": "treatises",
      "created": 1551330237,
      "upvotes": 1,
      "replies": {}
    },
    "egycb7g": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egycb7g/",
      "text": "I bought a Warhammer 40k Start Collecting! set my sophmore year, and some paints and brushes. Used scholarship refund money hah spent about $180. Was still assembling and painting the same set by graduation. \n\nIt was super relaxing, any time I needed a break, turn on an audiobook and start painting. I have only played it 3 or 4 times. But audiobooks and painting Warhammer is still my numher 1 relaxation technique.",
      "author": "SheedWallace",
      "created": 1550758124,
      "upvotes": 1,
      "replies": {}
    },
    "egyimmp": {
      "link": "/r/AskAcademia/comments/at2yh1/what_hobbies_do_you_do_whilst_studying_on_a_degree/egyimmp/",
      "text": "Hobbies... I guess this is a question for social sciences",
      "author": "Kopuk_Ucurtma",
      "created": 1550763045,
      "upvotes": -5,
      "replies": {}
    }
  }
}