{
  "sid": "qiwmmw",
  "link": "/r/AskAcademia/comments/qiwmmw/how_to_efficiently_find_papers_or_research_with/",
  "title:": "How to efficiently find papers or research with practicable information, and applied protocols.",
  "text": "So lately I've been reading and looking at research within a few fields that interest me, e.g. sleep, injury and recovery, flexibility, and strength.\nMy aim is to find studies and papers that lead to practicable conclusions, applied protocols, and data.\nI've tried using Google scholar and also going through Journals. However one has to comb through the titles and such to find information that's practicable -most of the time all of the results are highly specialized. Practicable protocols and conclusions are there but they are somewhat sparse. Is there any possible way to go about this more efficiently? \n\nI'm sure there's someone who is more knowledgeable on this matter. Please let me know if you have any suggestions or useful comments. Thanks\n\nP.S I've found it useful to look into meta analyses but they are still very specialized a lot of the time",
  "author": "voicesinclouds",
  "created": 1635580008,
  "updated": 1635779293,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hinx4jm": {
      "link": "/r/AskAcademia/comments/qiwmmw/how_to_efficiently_find_papers_or_research_with/hinx4jm/",
      "text": "CS background here. I joined multiple communities and always ask for related papers of a topic. People always give me some, and even new papers that I have never heard of (and it's high quality). Joinning communities to ask for this stuff is the best way to get it done fast. You can try reddit first.",
      "author": "AerysSk",
      "created": 1635614061,
      "upvotes": 1,
      "replies": {}
    },
    "hioqs28": {
      "link": "/r/AskAcademia/comments/qiwmmw/how_to_efficiently_find_papers_or_research_with/hioqs28/",
      "text": "Z Library",
      "author": "chugotleung2016",
      "created": 1635626727,
      "upvotes": 1,
      "replies": {}
    }
  }
}