{
  "sid": "f9zbdw",
  "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/",
  "title:": "How do you structure your day in order to stay focused doing research full-time?",
  "text": "I'm a M.Sc. student in Electrical Engineering and I currently started writing my master's thesis. This is the only activity that I have and I am expected to work on it full-time. I usually start by 9am and until lunch (1pm) I am pretty productive and can maintain a high level of concentration. The thing is, when I return from lunch (2pm), I can work a little bit more until around 3:30-4pm, but the quality of the work decreases significantly. After 4pm, I don't even know what I'm doing anymore, but I usually try to continue until 6pm.\n\nI wanted to know how people that do research full-time structure their day to be able to work decently for the whole day. Do they get used to being focused for longer periods or they just accept that they can only do so much and then do other things?\n\nI go to the gym everyday before starting the thesis at 9am and I eat well. Sometimes I feel lethargic after lunch, but I'm working on that and it's getting better. I sleep properly and after I leave the lab at 6pm, I try to relax and not think about \"work\". It might be an issue that I don't have shallower activities scattered throughout the day, like meetings or a lot of e-mailing, because I feel that these would help me diverge my attention a bit to later on get back focusing on my project.",
  "author": "musktea",
  "created": 1582747708,
  "updated": 1634081513,
  "over_18": false,
  "upvotes": 123,
  "upvote_ratio": 0.99,
  "comments": {
    "fiv0qsy": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiv0qsy/",
      "text": "> Do they get used to being focused for longer periods or they just accept that they can only do so much and then do other things?\n\nThe latter.  Email?  That's work.  Planning and attending meetings?  That's work.  Trying to buy equipment through a glitchy eShop system.  That's work.  All of these little, tangential tasks may not be \"research\" but they're part of the job and should count toward your \"full-time\" work hours.  Also, don't be afraid to skip out an hour early if you feel you've done all you needed to do for the day.  It'll all come out in the wash when you need to work additional hours before a deadline...",
      "author": "elduderino260",
      "created": 1582751722,
      "upvotes": 129,
      "replies": {
        "fiv4ek6": {
          "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiv4ek6/",
          "text": "this needs to be higher. I always felt guilty because I felt I had to make up for \"lost\" time spent running to stores, answering emails, planning meetings, looking up some stuff for a student, etc. but that's all part of the job and you shouldn't have to spend extra time during the evenings or weekends to compensate for the time you weren't laser-focused at your bench doing the experiments or actively browsing the literature for a solution to a problem.",
          "author": "bchmgal",
          "created": 1582753612,
          "upvotes": 43,
          "replies": {}
        }
      }
    },
    "fiuuhcu": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiuuhcu/",
      "text": "I divide up my writing tasks and work on each for a chunk of the day. When I fatigue on one, I switch to another.\n\nTasks I can think of that you may be doing: analyzing data, making figures and tables, outlining chapters and sections,  actual writing, editing for content/logic, editing for flow, editing for grammar/typos, layout, incorporating feedback, reading literature. \n\nPersonally I have at most two 3hr chunks of high level intense thinking in me on a good day. I focus on difficult tasks when I'm feeling best and save others for when I'm tired.",
      "author": "cheesymm",
      "created": 1582748493,
      "upvotes": 98,
      "replies": {}
    },
    "fiv119s": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiv119s/",
      "text": "When I was working on my dissertation I tried to run errands in the middle of the day. Stores are less crowded and it gave me a mental (and physical!) break from my desk.\n\nI also never thought of it as a 9-5 type thing. As /u/sleeping_in_ says, it's about getting the work done, not putting in a certain amount of time. Some days I would be on fire and work for 12 hours, others I would barely work at all.",
      "author": "pipkin42",
      "created": 1582751874,
      "upvotes": 56,
      "replies": {
        "fiv7zdi": {
          "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiv7zdi/",
          "text": "Definitely this. I plan my timetable around the hours that I know I am able to be productive, rather than the ‘classic 9-5’. I’m productive in the morning and the evening, but useless between about 2-6pm, so I just use these hours for the simpler tasks or for my own downtime.",
          "author": "kallly",
          "created": 1582755492,
          "upvotes": 14,
          "replies": {
            "fivogl2": {
              "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fivogl2/",
              "text": "I’m actually so happy to hear I’m not the only one who is useless during “working hours”, ie. 2-6pm hahaha.",
              "author": "circuspunk-",
              "created": 1582764553,
              "upvotes": 16,
              "replies": {}
            }
          }
        }
      }
    },
    "fiv2hn4": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiv2hn4/",
      "text": "This sounds pretty normal tbh. You can’t expect to be firing on all cylinders at all times. Progress isn’t linear. To even have that many good quality, productive hours is a great thing. Maybe delay lunch a little more if at all possible just to get even more out of that morning spurt. Best of luck with everything.",
      "author": "SineadMcKid",
      "created": 1582752632,
      "upvotes": 32,
      "replies": {}
    },
    "fiutphz": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiutphz/",
      "text": "Op, this is a really important thing I found......it takes an equal amount of time to think as it does to write. So allocate plenty of time to a thesis.\n\nI don't really structure my life around time, I just think I have 1-2 weeks to do X. It doesn't matter when I do X, but X needs to be done by 1-2 weeks.",
      "author": "sleeping_in_",
      "created": 1582748086,
      "upvotes": 27,
      "replies": {}
    },
    "fiv2zam": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiv2zam/",
      "text": "You had a productive day if you managed to concentrate on your work for five to six hours. You need to rest mentally too, many of your ideas will actually pop up during, or thanks to, your less intensive parts of the day.",
      "author": "biendeluxe",
      "created": 1582752887,
      "upvotes": 17,
      "replies": {}
    },
    "fiv40qb": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiv40qb/",
      "text": "I can do 2-3 hours of \"deep work\" per day when I am really focused, after that I \"run out of brain\" and can only do light tasks the rest of the time.",
      "author": "parkway_parkway",
      "created": 1582753420,
      "upvotes": 18,
      "replies": {
        "fiwo6j1": {
          "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiwo6j1/",
          "text": "Yep! Same! I only read or write for 2-3 hours a day (might be more closer to deadline) and then do other stuff the rest of the day. Sometimes not even work related stuff!",
          "author": "ninasvanebruhn",
          "created": 1582794749,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fiv41cg": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiv41cg/",
      "text": "I use the app Toggl to track my time actually working  (e.g., reading or writing) but turn it off whenever I take breaks or even check email. Then I get a sense of how much time I actually spend on real work, which usually is much lower than I'd like, which then gamifys the process for me. Using a time tracking system will at least help you get an exact sense of your day and how to plan accordingly",
      "author": "jett11",
      "created": 1582753429,
      "upvotes": 11,
      "replies": {}
    },
    "fiv4wbg": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiv4wbg/",
      "text": "If I get 6 hours of good research work in, that's a pretty productive day. Sometimes it's more, most of the time it's less.\n\nI'm currently untenured (go up in about 18 months) and beat myself up a lot at the beginning about not getting a \"full day\" in. It compounded the stress of not having tenure even more. I eventually decided to just let it go and work as best I could.\n\nI have also found that carbs (esp. sugar) at breakfast or lunch makes me totally crazy during the day. The rest of my day is completely worthless if I even sneak a cookie. All I can think of is that next fix...",
      "author": "Racingram",
      "created": 1582753870,
      "upvotes": 9,
      "replies": {}
    },
    "fiv5pzs": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiv5pzs/",
      "text": "When I was in grad school and in my first year as a VAP, I liked to deliberately split up my day. Frequently something like 8:30 - 10:00 doing some work at home (writing or course planning usually), take a break to walk to campus, then 10:30/11 - 3:30 or so doing work on campus and having \"administrative lunch\" (emails and lunch, I get bored just eating so I have to do something). Depending on the day I'd either do my exercise thing then and afterwards do some a few more hours of work, or vice versa.  I really liked breaking up the day like that, since it gave my brain a break and got the blood going again. \n\nAnother thing to consider is if you have any work that doesn't need as much brain power, and save that for times when you know you need to get some stuff off your to-do list but don't have a ton of brain resources.  I'm in a field that has a lot of data that needs hand-marking, but does not have enough money for research assistants, so I often have a backlog of data to get through.  It's relatively time-consuming but pretty light on the brain, so even if I am tired from reading or writing or teaching or whatever I can just put on Netflix or a podcast and just churn through it.  Or even if I'm just having a Day where I can't really focus on anything, I can just be like welp here's this easy task that I know needs to be done, let's just do that today and let the brain bum out on TV.",
      "author": "FunnyMarzipan",
      "created": 1582754289,
      "upvotes": 5,
      "replies": {}
    },
    "fiv6xhs": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiv6xhs/",
      "text": "Sounds like you're doing a lot of the right things. No-one is consistently productive at the same level.\n\nMy advice would be to decide on a measurable output level you're happy with. It could be  hours worked, words written, papers read, or some other measure that works for your discipline and/or task you're working on. Make it reasonable - you're not setting out to punish yourself - and make it a level you can attain over the long term. Some weeks you might beat it; some weeks you might not attain it, and that's fine too.",
      "author": "cuccir",
      "created": 1582754924,
      "upvotes": 7,
      "replies": {}
    },
    "fivb57q": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fivb57q/",
      "text": "Personally? Poorly/by having a god forsaken screwed up circadian rhythm that changes constantly due to experiments having variable end times.\n\nIn general, I'd recommend scheduling your day around when you're productive. Personally, I personally can't do intensive thinking from ~1-4 PM, so I just do easier stuff then.\n\nThis one doesn't work for everyone, but personally my work requires some amount of physically running experiments, some amount of doing theory/running computations, and some amount of writing. Running experiments requires a different part of my brain than the other two do, so I can work longer by doing both every day. The biggest thing is to not force work when work isn't happening. Deadlines happen and sometimes you need to suck it up, but long term you'll get more done if you just stop when your body tells you to stop.",
      "author": "Mezmorizor",
      "created": 1582757208,
      "upvotes": 5,
      "replies": {
        "fivgcit": {
          "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fivgcit/",
          "text": "Came here to say this - my research productivity went up so much when I realized that I can do more when I start at 5a and work until 2p. OP may not be working in their peak window. \n\nAlso, having a list of tasks from week to week and day to day really helps when you’re feeling like a bum. You can usually find something less brain intensive to do or be kept on track when your attention wanes",
          "author": "phdr_baker_cstxmkr",
          "created": 1582759803,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fivd45f": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fivd45f/",
      "text": "I work quite intuitively. When I was writing my thesis I had good days where my brain was pretty much glued to the monitor and my fingers to the keyboard, but I had also days where I read up on one reference to write one sentence and that's it. I like to work on presentations or figures when I have poor focus. I worked at the institute, not home, to be able to get up and do a quick lab thing when tired, and to feel surveilled by people who would call me out for watching netflix.\nConcentration span can be increased by training. I had times during uni exam periods where I could easily study 8 h straight. Now it's harder, but I can still go a few hours. That's only natural. I think most people have an attention span of 45 min, or so I heard somewhere. \nI also found that I do my best work in the morning, mentally but also physically. So maybe consider doing gym at the end of the day? Thesis has higher priority.\n\nTbh, I think what helped me most was meditation and yoga. I started both about a month before I started writing and it improved my focus and reduced my stress. I'd recommend that to anyone!",
      "author": null,
      "created": 1582758198,
      "upvotes": 6,
      "replies": {}
    },
    "fivfb7f": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fivfb7f/",
      "text": "Based on your question, you can really benefit from the book Deep Work. It describes changes you can make to your lifestyle so you can spend a greater amount of time doing activities that are intellectually challenging.",
      "author": "peroperoname",
      "created": 1582759301,
      "upvotes": 4,
      "replies": {}
    },
    "fivvg0h": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fivvg0h/",
      "text": "I'm probably not doing it right, but it works well for me to work 9-12, then use that lull period in the middle of the day to run errands, followed by another few hours of work from 3-6 or so. It really helps me to stay productive during the post-lunch lull where I'm not productive anyway and helps motivate me to work later in the afternoon. If I do make it to the gym that day, it's usually during that time unless I'm planning to do cardio or something (because who wants to run after lunch).",
      "author": "ladut",
      "created": 1582768951,
      "upvotes": 2,
      "replies": {}
    },
    "fivyw6h": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fivyw6h/",
      "text": "Take vacations, sleep, know your limits, and don’t force things.",
      "author": "Sebo1128",
      "created": 1582771189,
      "upvotes": 2,
      "replies": {}
    },
    "fiwo15x": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiwo15x/",
      "text": "Lol.\n\nI'm a lecturer (equivalent to assistant prof in US). The other day my boss was telling me that for promotion I need to win a particularly big grant, and writing must start asap.\n\nI spent 8 days marking my coursework until Tuesday, then had coursework for *another*, then today I have meetings 10.30-12.30, then 2-3. So with times like that, you fucking *leap* and putting some headphones on and writing. Also milling around on Reddit because meh.",
      "author": "dl064",
      "created": 1582794531,
      "upvotes": 2,
      "replies": {}
    },
    "fivlk32": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fivlk32/",
      "text": "I'm not writing my thesis yet, but I'm doing my masters online and am currently not working thanks to coronavirus in my country. I have almost the same daily schedule as you, except I also put an hour's break in at 4pm. If the weather is nice, I take the dog for a walk. If it's not, I read a (fiction) book or play piano for an hour. The latter is Ok, but the days I actually get outside really re-energise me and stop me feeling like a recluse. I find myself thinking over subject stuff and having really good ideas during my walks, too, so it's not totally unproductive.",
      "author": "WheelMyPain",
      "created": 1582762761,
      "upvotes": 1,
      "replies": {}
    },
    "fiwhuir": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiwhuir/",
      "text": "I usually have a concentration dip the same time you do. That's usually when I go exercise or do something else and, maybe this is controversial, but I work a bit in the evening (8-10 pm). I usually have a surge of energy then. So in summary, just try find a system that works for you and take advantage of the flexible system.",
      "author": "Kureeru",
      "created": 1582786546,
      "upvotes": 1,
      "replies": {}
    },
    "fiwmcq5": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fiwmcq5/",
      "text": "The immense feeling of guilt you get from having an inbox full of people who remind you three times that they urgently need you to do something like send them some data, comment on their paper etc.",
      "author": "nickbob00",
      "created": 1582792181,
      "upvotes": 1,
      "replies": {}
    },
    "fix1bt1": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fix1bt1/",
      "text": "I’ve had a solid 6 months (1st year BS entry level PhD) of pure research time mixed in with class time and I honestly like when I have classes or other things to structure my day around. I’ve arranged with my PI to commit 2-3 hours per day to research only, then I’m free to work on my coursework/homework in the lab office. It’s really nice to have limited chunks of time like that because then I need to focus on order to be productive, and I have to tell my PI if I’m unable to do that research time during a busier time with classes. When I’m purely in research mode, I often have a mix of practical tasks (building equipment and running experiments), software tasks (programming and analyzing data) and administrative stuff (reading, writing, email). I try to break these up throughout the day so that when I can’t program anymore, there’s something I can solder, or it’s a good time to check email. I usually bring lunch and eat at my desk while reading a paper I’d been meaning to get to, or make that my email time, which for me prevents the post-lunch lull. I also eat breakfast and lunch relatively early (breakfast at 7, lunch at 11) to help with my 2:00 slump.",
      "author": "Kittens-and-Vinyl",
      "created": 1582810074,
      "upvotes": 1,
      "replies": {}
    },
    "fix1w7j": {
      "link": "/r/AskAcademia/comments/f9zbdw/how_do_you_structure_your_day_in_order_to_stay/fix1w7j/",
      "text": "I've recently discovered that doing 30 minutes of metta meditation after lunch or whenever I start getting a bit drowsy, reinvigorates me and gives me an additional 2 hours of focused writing on average...",
      "author": "synes",
      "created": 1582810517,
      "upvotes": 1,
      "replies": {}
    }
  }
}