{
  "sid": "r8cq7p",
  "link": "/r/AskAcademia/comments/r8cq7p/is_there_a_preference_for_slightly_older/",
  "title:": "Is there a preference for slightly older applicants for TT positions?",
  "text": "I’ve been out of academia for a few years now, but I keep up with most of the grad students at my institution and a number of people I worked with. One thing I’ve noticed is that, for those who went into academia, those who were mid/late 30s tended to get TT positions at a higher rate than those who were younger (29-32 let’s say). \n\nThese are all students with similar publication records and all were fresh graduates. Almost every one of the younger people didn’t get a TT offer and ended up doing post docs while the ‘older’ folks largely got TT offers. I’m in a social science field.\n\nTo be clear, it’s not a big sample, but it made me wonder. My university hired a handful of new TT professors while I studied and I noticed they were all in the late 30s age range (granted they also all had post doc experience so it could just be that).",
  "author": "AtmosphereDry3119",
  "created": 1638576536,
  "updated": 1639515693,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.91,
  "comments": {
    "hn51b3v": {
      "link": "/r/AskAcademia/comments/r8cq7p/is_there_a_preference_for_slightly_older/hn51b3v/",
      "text": "Based on my observations, I’d say most TT positions are looking for someone with multiple years of either teaching or research experience past grad school, but not so experienced that they’re almost the same years of experience as their current associate professors. \n\nThat tends to give an age range of about 30-35. Note that federal age discrimination laws in the US don’t kick in until 45, so it’s absolutely legal to hire someone over another based on age alone in their 20s and 30s.",
      "author": "WoodwardHoffmannRule",
      "created": 1638580125,
      "upvotes": 15,
      "replies": {
        "hnc1l91": {
          "link": "/r/AskAcademia/comments/r8cq7p/is_there_a_preference_for_slightly_older/hnc1l91/",
          "text": ">most TT positions are looking for someone with multiple years of either teaching or research experience past grad school, but not so experienced that they’re almost the same years of experience as their current associate professors.\n\nNot necessarily.  Most search committees hiring an Assistant Professor target *either* \"fresh\" PhDs (0-2 years out) or \"experienced\" PhDs (3-6 years out), but not both-- because they're so different. It depends on the needs of the school and how the department skews (junior or senior). \n\nPossibly you've personally observed more of the latter, but it doesn't mean the fresh searches don't co-exist (very common in the top-25 B-school job market)",
          "author": "DeskAccepted",
          "created": 1638719431,
          "upvotes": 1,
          "replies": {
            "hncfpeq": {
              "link": "/r/AskAcademia/comments/r8cq7p/is_there_a_preference_for_slightly_older/hncfpeq/",
              "text": "If only I’d prefaced my statement with “Based on my observations” I could have made it clear it was anecdotal and not a universal rule. Oh well.",
              "author": "WoodwardHoffmannRule",
              "created": 1638725272,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hn5h4si": {
      "link": "/r/AskAcademia/comments/r8cq7p/is_there_a_preference_for_slightly_older/hn5h4si/",
      "text": "At my university age doesn't matter-- experience does. We don't hire people who lack teaching experience (being a TA isn't enough) so most new TT hires are either coming from a VAP position elsewhere or a postdoc with teaching responsibilities. But I know plenty of people in the 29-33 or so age range who have been hired in recent years.\n\nIf anything there is age discrimination against older applicants...anyone who is 50+ is almost certainly going to trigger a \"how long will they be here?\" discussion, and I've heard of candidates much younger than that (i.e. early 40s) facing concerns about \"will they be set in their ways\" vs. the idea that a younger (\"fresh\") applicant will be more easily mentored into departmental/campus culture.",
      "author": "SnowblindAlbino",
      "created": 1638587883,
      "upvotes": 8,
      "replies": {
        "hn5k3sy": {
          "link": "/r/AskAcademia/comments/r8cq7p/is_there_a_preference_for_slightly_older/hn5k3sy/",
          "text": "That’s really interesting! When I was a PhD student I remember bejng nervous about my lack of teaching experience about halfway through. I spoke to serveral professors from various school in various countries and they basically all told me that teaching experience is only very slight considered. Might be field dependent.",
          "author": "AtmosphereDry3119",
          "created": 1638589372,
          "upvotes": 2,
          "replies": {
            "hnircux": {
              "link": "/r/AskAcademia/comments/r8cq7p/is_there_a_preference_for_slightly_older/hnircux/",
              "text": "> I spoke to serveral professors from various school in various countries and they basically all told me that teaching experience is only very slight considered. Might be field dependent.\n\nIt's instutional-type dependent. At PUIs that are teaching-focused it's an expectation for any hire; at R1s often nobody really cares. At SLACs like mine teaching experience is often the deciding factor in a search because *everyone* who is qualified can likely meet the research requirements...but can they teach from day one?",
              "author": "SnowblindAlbino",
              "created": 1638831560,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hn5rt1r": {
      "link": "/r/AskAcademia/comments/r8cq7p/is_there_a_preference_for_slightly_older/hn5rt1r/",
      "text": "Yes. \n\nWhen I was first interviewing for TT positions at the age of 30 (I looked much younger), I remember a second round interview where the dean looked at me as if I were her kid and spoke to me in a patronizing manner that I suspect was due to my age (whether she realized it or not).\n\nAfter that experience, I began growing out my facial hair prior to interviews and dressing in Noam Chomsky-like sweaters to not appear so indistinguishable from undergrads. I struggled to be taken seriously because I looked like I was in my early to mid 20s.\n\nNow that I am TT, I'd say looking as if you're between 30 and 40 is a great spot to be in while on the market. <30 and they question your preparedness, >40 and they wonder if you're too old school.",
      "author": "vindicated19",
      "created": 1638593369,
      "upvotes": 4,
      "replies": {}
    },
    "hn6y9lm": {
      "link": "/r/AskAcademia/comments/r8cq7p/is_there_a_preference_for_slightly_older/hn6y9lm/",
      "text": "From my experience both on the applicant side and the search committee side, I think it's much more about experience and demeanor than age. Experience (CV) will get you an interview, and interactions on the interview make or break the offer. Yes, some people are prejudiced (whether that's about age, gender, race, etc), but I don't think that's the main driver of hiring decisions. \n\nFor OP, I'd be curious what the older members of your cohort were doing pre-grad school and how much that work experience contributed to their job market success. Similarly, whether they were able to talk about their work and interact with senior faculty more confidently.",
      "author": "ZenosBrownie",
      "created": 1638624663,
      "upvotes": 2,
      "replies": {}
    },
    "hnc150o": {
      "link": "/r/AskAcademia/comments/r8cq7p/is_there_a_preference_for_slightly_older/hnc150o/",
      "text": "Geez... every week there's someone on this sub asking whether older candidates are at a disadvantage, now you're here asking if younger candidates are at a disadvantage. \n\nI have to say, I don't get the obsession with age on this sub. The tenure track is long and tenured professors rarely retire young, so +/- 10 years (or even 15) at the start is almost completely immaterial to your long term career.\n\nWhat did the mid-late 30's people do before getting a PhD?  Is it possible that they simply came across as more mature or more experienced in the interview, despite being fresh?  I can attest that candidates who have *relevant* pre-PhD industry experience often do very well in interviews, particularly if their industry experience is something they can easily bring into the classroom.\n\nI have sat on several search committees and age never came up, not even indirectly. Of course, experience is extremely important, and the two can't be completely disentangled because you need time to gain experience.",
      "author": "DeskAccepted",
      "created": 1638719236,
      "upvotes": 0,
      "replies": {}
    }
  }
}