{
  "sid": "e71lt5",
  "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/",
  "title:": "A student cannot graduate because of a couple points in your class. What's your \"merry Christmas, you lazy bum\" free-point limit?",
  "text": "I think it is silly to hinder a non-major from graduating because their final grade in my class is a 59 instead of a 60. But what about a 58 or a 57 or a 56? Do you have a line? Do you consider the financial cost of retaking your class and staying in school? Do you pull an extra credit assignment out of a hat and make them sign a NDA so they do not tell others? Or is hearing the lamentations of failing students the best thing in life?",
  "author": "wolfowls",
  "created": 1575652914,
  "updated": 1634081169,
  "over_18": false,
  "upvotes": 158,
  "upvote_ratio": 0.96,
  "comments": {
    "f9ur4y7": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9ur4y7/",
      "text": "[deleted]",
      "author": null,
      "created": 1575656222,
      "upvotes": 255,
      "replies": {
        "f9v5y7f": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9v5y7f/",
          "text": "[deleted]",
          "author": null,
          "created": 1575663712,
          "upvotes": 151,
          "replies": {
            "f9xtg15": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9xtg15/",
              "text": "This is potentially different though. One bad course really could pull your grades out of scholarship range and thus it wouldn't, in that case, be indicative of a pattern of poor performance, just one course.",
              "author": "cantgetno197",
              "created": 1575717964,
              "upvotes": 8,
              "replies": {
                "f9xyqe0": {
                  "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9xyqe0/",
                  "text": "but its also something that doesn't just happen, you can ask for help before you hit that make or break point",
                  "author": "tc1991",
                  "created": 1575720567,
                  "upvotes": 8,
                  "replies": {
                    "f9y3jf8": {
                      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9y3jf8/",
                      "text": "True.",
                      "author": "cantgetno197",
                      "created": 1575722794,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "f9vnaqj": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vnaqj/",
          "text": "This. When I taught undergrads, I would constantly have students come to me and tell me that I was the only thing standing between them and keeping their scholarships/getting into grad school. Which was annoying because it simply wasn't true. Maybe my class was their lowest grade, but if they didn't get a bunch of other low grades, my class wouldn't matter. I would never raise their grades. Now if someone came to me with a 59 and if I gave them a 60 they would graduate, I would probably not turn them away. I would first try to see what happened to the curve if I bumped everyone up 1% and, if I was still within the permitted distribution, I would do that. I would be very reluctant to just bump them up, but I would probably do it.",
          "author": "lh123456789",
          "created": 1575674688,
          "upvotes": 42,
          "replies": {
            "fa1gwmx": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/fa1gwmx/",
              "text": "I tend to do this too—I’ll play with dropping one lowest quiz grade for everyone, or a lowest homework assignment. If it’s enough to bump without being unfair, then I do it. I don’t advertise that I drop in my syllabus. \n\nFrankly, I teach gen ed courses—gen chem and organic. If my students don’t learn the material well enough to pass the class without a curve, they shouldn’t be going to med school anyway (almost everyone’s goal while they’re in my class before they realize everyone isn’t going to be and shouldn’t be an MD) and I’m not going to artificially inflate the grades so it appears they did better than they did. \n\nWhen my students beg for a curve, I always tell them they’re paying for an education and not a grade and if they would prefer to pay for a grade, Miller Motte is down the street.",
              "author": "Xylophelia",
              "created": 1575769683,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "f9vkiio": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vkiio/",
          "text": "[deleted]",
          "author": null,
          "created": 1575672704,
          "upvotes": 42,
          "replies": {
            "f9wx2tj": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9wx2tj/",
              "text": "Yeah, this is worth stressing at more than just the undergrad level. If the only thing stopping a PhD student from qualifying is the advanced math (or persuasive writing, human anatomy, etc) class their committee forced them to take, that one class may be more important than the entire rest of their curriculum.",
              "author": "OneHunted",
              "created": 1575700485,
              "upvotes": 8,
              "replies": {
                "f9x2rij": {
                  "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9x2rij/",
                  "text": "I was a TA for an upper division developmental genetics course that was attended by a handful of first year graduate students, spread across two different programs, who had to take it to fulfill a pre-req for their program. One of them was just a few points below the cut-off for a B, the minimum grade required for it to count, and would be put on probation if she got a C in that course. She was working her ass off for this class and super stressed about it, but doing perfectly fine in all her graduate coursework. The prof thought it would be ridiculous for her to end up on probation for this and said something like she was going to grade undergrads and grads separately at the end of the class. Whatever she did facilitated the grad student getting her minimum grade to keep going in the program.",
                  "author": "alexa-488",
                  "created": 1575703604,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            },
            "f9yhy3o": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9yhy3o/",
              "text": "And also let's not delude ourselves into thinking that overall performance in undergrad is a perfect indicator of performance in grad school. I was OK in my undergrad, I was kicking ass in my masters, but I slogged through my PhD. A lot of my friends were underwhelming all the way through but became amazing researchers. Performance in for example your algorithms and data structures class is an amazing indicator of your final GPA in a computer science undergraduate degree, but has literally nothing to do with how good of a CS PhD student you will be.",
              "author": "needlzor",
              "created": 1575728901,
              "upvotes": 3,
              "replies": {}
            },
            "f9y3x7m": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9y3x7m/",
              "text": "The university where I got my undergraduate degree had a writing test that needed to be passed in order to graduate.  There was an optional class that could be taken that essentially focused on writing and how to take the test.  While I was confident in my ability to pass the test, I needed the units to maintain my full-time status so I took it anyway. On test day, while reading the instructions for the test it quickly became obvious that what we were being taught for the preceding eight weeks really wasn't applicable.  When the results arrived I was one of three students who passed the test (I think there were 25 in the class.)  Lots of people were upset as this was all they needed for graduation, the gal who sat next to me all semester was in tears as she thought she'd lose her scholarship.\n\nThis upset me enough that I wrote a letter to the department chair about the issue.  The class was taught by an adjunct who I suspect was not given any information about the test beyond \"teach them how to write essays.\"  As someone who has been thrown into similar teaching situations I also felt some sympathy towards him.\n\nThe final day of class the prof indicated that he'd received a phone call from \"his boss\" and that if there were questions about test scores that they were welcome to meet with him.",
              "author": "ochaos",
              "created": 1575722976,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "f9wnz0u": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9wnz0u/",
          "text": "This depends a lot on the school. Plenty of people do fine in their major but then mess up in some distribution requirement. Hell, I know someone who nearly didn't graduate on time because they forgot they'd enrolled in a required gym class for the first month and had technically missed too many classes to pass.",
          "author": "mediocre-spice",
          "created": 1575695791,
          "upvotes": 6,
          "replies": {
            "f9xet48": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9xet48/",
              "text": "That scenario is a recurrent nightmare I’ve had for 20+ years.  Terrifying.",
              "author": "parrotlunaire",
              "created": 1575710158,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "f9w8xeu": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9w8xeu/",
          "text": "My classmates constantly make this argument at our OChem professor which annoys me so much. The dude has legitimate faults especially since it’s his first year teaching but don’t use that as an argument....every damn class they bring it up",
          "author": "God-of-Ass-Destroyer",
          "created": 1575688919,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f9uzqz1": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9uzqz1/",
      "text": "I once let a student keep turning in missed assignments well after the deadline until he had a passing grade and was able to graduate. He'd been messed up ever since his sibling died a few semesters before.",
      "author": "flipester",
      "created": 1575660598,
      "upvotes": 105,
      "replies": {
        "f9v8u3x": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9v8u3x/",
          "text": "I think life happens and sometimes it happens in one semester. One shitty semester of life can affect a student’s performance and it will have little to do with effort or ability. Whether or not as the prof, you can assess that is case by case, but there are reasons and circumstances by which to not be an agent of demolishing someone’s academic self-confidence over a couple of points.\n\nStudents have to meet with me, and sometimes get chewed out and frightened to death before I say “let’s make a deal”\n\nOther professors: don’t be a dick. It’s just life, that’s all.",
          "author": "casanovish",
          "created": 1575665150,
          "upvotes": 59,
          "replies": {}
        },
        "f9vfd05": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vfd05/",
          "text": "When my mom died 3/4 of the way through the semester, I was incredibly grateful for how helpful and understanding my professors were. In my biochemistry lab, they didn't even make me turn in the last few lab reports. I'm not sure how I would have gotten through that semester without their help.",
          "author": "pterencephalon",
          "created": 1575669205,
          "upvotes": 48,
          "replies": {
            "f9vygg5": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vygg5/",
              "text": "Same. I had a very painful miscarriage just before my first University exam period and the tutor of one of my Arts subject let me do an alternative assessment for their unit at home (that was the first exam I had to take after miscarrying). It was a big essay instead of short answer question exam so was actually kind of harder lol (but was covering same content/in scope of the whole unit) but I'm so incredibly grateful that I could do that assessment wrapped up in blankets with a hot water bottle, taking time to cry when I needed it, instead of being in an exam hall trying to keep it together. I'm sure I would have gotten a 0% on the exam had I sat it in the state I was in.",
              "author": "allevana",
              "created": 1575683144,
              "upvotes": 25,
              "replies": {}
            }
          }
        },
        "f9ylb93": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9ylb93/",
          "text": "I am so so grateful for professors who understand that life happens. I had a semester where my mental health was in the toilet (ended up in near hospitalization and eventually being diagnosed with bipolar disorder) and my professors that semester and the semester following were so kind and understanding. I am a good student which helps a lot, and I took minimal accommodations, but just knowing that I had their support took an extra weight off of my shoulders.",
          "author": "mermaid_k",
          "created": 1575730226,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "f9uloki": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9uloki/",
      "text": "It's about level of effort\n\n*  Did they attend 95% of the lectures (or if they did miss did they email you to let you know)?\n\n*  Did they turn in all the assignments?\n\n*  Did they half-ass their assignments?\n\n*  Did they ever come to office hours?\n\n*  Did they engage in the class or did they sit in the back and zone out?\n\nThose are the benefit of the doubt questions you have to answer (or you just curve the class for everyone and be done with it)\n\nAnd you never, **EVER** give a student > pull an extra credit assignment out of a hat and make them sign a NDA so they do not tell others?\n\nThat's a good way to get yourself in big trouble, tenure or not.\n\nRemember, you as a professor do not give a student a grade, they earned whatever it is they receive.  They don't start the semester with an \"A\" they start it with a 0 and work up from there.",
      "author": "k0np",
      "created": 1575653328,
      "upvotes": 169,
      "replies": {
        "f9up4wv": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9up4wv/",
          "text": "The \"NDA\" was a joke. I never give extra credit assignment that is not in the syllabus, but other professors here do, so students think it is normal.",
          "author": "wolfowls",
          "created": 1575655161,
          "upvotes": 68,
          "replies": {
            "f9vanvp": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vanvp/",
              "text": "I'm thinking the NDA would be some kind of ethical violation these days.",
              "author": null,
              "created": 1575666162,
              "upvotes": 10,
              "replies": {
                "f9w529w": {
                  "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9w529w/",
                  "text": "And terribly ineffective. I'm just imagining the kind of student who has to sign an NDA to pass a class. Is that someone who'd adhere to the NDA?",
                  "author": "JustSkipThatQuestion",
                  "created": 1575687130,
                  "upvotes": 10,
                  "replies": {
                    "f9w6psg": {
                      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9w6psg/",
                      "text": "At that point I'd sign anything you put in front of me.",
                      "author": null,
                      "created": 1575687902,
                      "upvotes": 6,
                      "replies": {
                        "f9wdiav": {
                          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9wdiav/",
                          "text": "Except a death waiver. Can’t pass if you’re dead.",
                          "author": "JustSkipThatQuestion",
                          "created": 1575690924,
                          "upvotes": 3,
                          "replies": {
                            "f9wyxvq": {
                              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9wyxvq/",
                              "text": "Yeah but sometimes the sweet release of death is more alluring than passing.",
                              "author": "Dr_fish",
                              "created": 1575701522,
                              "upvotes": 4,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "f9wcsbd": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9wcsbd/",
          "text": "Spot on.\n\nI have a student in my class this semester. She was in a class with me last semester as well. She practically lives in my lab (where I have my \"office\" hours) and works damned hard, but she usually makes Cs and the occasional B. \n\nShe doesn't screw around on her phone or computer, she WORKS. She emails me several times a week with really good questions. She meets with our counselors about learning strategies. I've never seen a student work so hard.\n\nThey have finals next week and if she needs a small bump, she's gonna get it. She's earned it.\n\nI also told her that, regardless of her final grade, if she ever needs a letter of rec, I'm in. I don't HAVE to write them but I'd gladly write one for her.",
          "author": "losthiker68",
          "created": 1575690606,
          "upvotes": 21,
          "replies": {}
        },
        "f9xur05": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9xur05/",
          "text": "> Did they attend 95% of the lectures (or if they did miss did they email you to let you know)?\n> \n> \n> \n> Did they turn in all the assignments?\n> \n> \n> \n> Did they half-ass their assignments?\n> \n> \n> \n> Did they ever come to office hours?\n> \n> \n> \n> Did they engage in the class or did they sit in the back and zone out?\n\n\nYou aren't required to attend classes at the Universities I went to or worked at. It's adviseable, but you won't see half the students. They'll learn the syllabus and still ace the exam. Also, generally office hours are only for students who have genuine questions or issues. This is a bit different during the master year when every professor guides a dozen orso students with their thesis, depending on the subject. \n\nMy mother studied at the Sorbonne in the 70s for a while. She remembers how many students would come put their voice recorders in front of the lecturer at the start of the class and then come back to pick it up once the class was finished, even when Foucault was speaking. While some professors do indeed take offense to these practices, simply showing up from time to time and listening is already considered to be a good effort.\n\nI mean, this is an academic environment with many students working/studying around the clock. It's not that they become jaded, but they start feeling at home. I've seen students eat, read a paper or sleep during class at times, but they'd still be engaged when something came up that stumped them. So these things never really play into my gradings. I look at redeemable qualities within the work they produced or extenuating circumstances.\n\nThe way university education is approached here is that these are adults who don't need to be taught how to act or behave. They don't haveWe teach them courses and give them the tools to succeed at those. Frankly, it's more worrying when someone fails my class who has attended all lectures and has been a model student. At least, the first few years I would be more likely be lenient when someone hadn't used all tools available and almost passed. I will obviously advise them to start using those tools - such as attending classes - because grading in the final two years will be far more strict and they require you to act more engaged and professional",
          "author": "Instantcoffees",
          "created": 1575718575,
          "upvotes": 5,
          "replies": {}
        },
        "f9uqkdg": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9uqkdg/",
          "text": "\"Level of effort\" is a hard thing to quantify. Why does the person who got a 59 and \"showed effort\" get a boost when the person with a 60 and \"showed little effort\" not get demoted?",
          "author": "RhodaMorgenstern",
          "created": 1575655906,
          "upvotes": 18,
          "replies": {
            "f9uv82m": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9uv82m/",
              "text": "> Level of effort\" is a hard thing to quantify\n\nI literally listed several ways to do so.  Same thing applies between say a B/B- or C+/B- when those areas are grey",
              "author": "k0np",
              "created": 1575658303,
              "upvotes": 33,
              "replies": {}
            },
            "f9vwtqo": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vwtqo/",
              "text": "The student with the 60 has met their grade requirement and doesn't need an adjustment. This is about raising a grade for one student, not lowering a grade for another, unrelated, and uninvolved student.",
              "author": "tamirabeth",
              "created": 1575681897,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "f9vk8ik": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vk8ik/",
          "text": "It can be argued that one should ignore how much effort a student put in when grading. If they put in a lot of effort, but still failed, there seems to be a different underlying reason, maybe they just cannot pass the course. In that case, why give them a bump. If the students did not put in effort, they could have if they would have worked harder, in that case, why give them the extra points for 'free'.\n\nPersonally I think medical reasons would be the best reason for creating reparation possibilities, which includes loss of loved ones. These are things outside ones control that impact students results without them having any control over them, and that are not linked to their abilities.",
          "author": "Haloisi",
          "created": 1575672506,
          "upvotes": 5,
          "replies": {
            "f9x1kmq": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9x1kmq/",
              "text": "If there were those types of traumatic reasons, I would send them to student life and they would send me a letter telling me to be flexible. \n\nI am here talking of free points for someone who could not even come up with an excuse. Sweet free points.",
              "author": "wolfowls",
              "created": 1575702983,
              "upvotes": 4,
              "replies": {
                "f9xbshe": {
                  "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9xbshe/",
                  "text": "I see. Well free points seems a big no-no, if you start handing out free credit without reason you are diluting the value of the degree program.",
                  "author": "Haloisi",
                  "created": 1575708486,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "f9y56f3": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9y56f3/",
          "text": "I wish I had saved the syllabus of a stats professor I had during my undergraduate degree.  He had a rubric of all the questions you listed (plus a couple more) and a specific number of what he called \"nudge points.\"   If someone was on the fence for a grade he'd run them through the rubric, see if they'd done enough to be nudged over or not.  It was spelled out so clearly it was really impossible to argue.",
          "author": "ochaos",
          "created": 1575723560,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f9v5nyt": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9v5nyt/",
      "text": "Grading is partially subjective. I always rounded a student up to the next number if their grade ended in a 9.",
      "author": "Kelleysob",
      "created": 1575663571,
      "upvotes": 23,
      "replies": {}
    },
    "f9vngog": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vngog/",
      "text": "An *additional* factor I look at is how it clusters with other grades. Let's say the student grade in question is 68.5%. Will I bump it up to a 70%/C or not?\n\nIf the other student grades look like this, I would be more likely to bump up the grade, because it really is closer to the other C's and not the other D's.  \n\n. . .85, 84, 83, 80, 72, 70,70, **68.5**, 62, 60, 60. . .\n\nBut if the grades other look this, I would be less likely to bump them up , because they are really so much closer to the other D's, and far from the lowest C. Also, if I gave the 68..5 a C, then I'd feel obligated to give the 69 a C as well.\n\n. . .85, 84, 80, 79, 79, 78, 77, 69, **68.5**, 68, 67, 62, 60, 55. . .",
      "author": "trailmix_pprof",
      "created": 1575674809,
      "upvotes": 15,
      "replies": {}
    },
    "f9urya2": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9urya2/",
      "text": "People do not fail to graduate because of 1 point.  They fail to graduate because overall they did not meet the requirements for graduation.  I grade at least partially on a curve and I also offer extra credit fairly regularly in my lower-level classes (mostly to give the best students a challenge--in my experience, the weak students never bother to do it), I \\*never\\* change my grading for individual students, nor would I ever do so based solely on the consequences for one student.",
      "author": "bigrottentuna",
      "created": 1575656632,
      "upvotes": 41,
      "replies": {}
    },
    "f9vgcdk": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vgcdk/",
      "text": "If they have a 69.5 then I will round up. There's always some subjectivity in grading and I'd rather give them the benefit of the doubt. If they have a 66, then nothing I do will get them 4 more percent so it is what it is. If they have a like a 68.9 then I might go double check their assignments just to see if I was grading too harsh or something. Usually I think I graded pretty fairly, but sometimes I find perhaps I was a bit harsh. \n\nTo be honest though, if they have that grade, then the probably didn't demonstrate they understood the material... so they get the grade they get.",
      "author": "Average650",
      "created": 1575669849,
      "upvotes": 13,
      "replies": {}
    },
    "f9uy0he": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9uy0he/",
      "text": "They can't graduate because of what **they** did. If I did my job right, no corrective action on my part is justified.\n\nI've had a *few* students over the years make calm and reasonable arguments about how a particular graded assignment was imprecise, or that the criteria didn't measure what I was teaching. When they can do that with a positive and respectful tone, and they impress me with the quality of their thinking, I might regrade an assignment and bump them up a bit. But that's them earning it. I don't give them a thing. \n\nAnd on those occasions I've noticed that word got around, and then a few other students do a clumsy and unconvincing job, and then get mad when I won't bump their grade; they call it unfair and say I'm playing favorites, and I just get to smile calmly and say \"Your friend was correct, and you are not. Welcome to adulthood.\"",
      "author": "Repent2019",
      "created": 1575659722,
      "upvotes": 54,
      "replies": {
        "f9vappn": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vappn/",
          "text": ">They can't graduate because of what they did. If I did my job right, no corrective action on my part is justified.  \n>  \n>I've had a few students over the years make calm and reasonable arguments about how a particular graded assign\n\nYes. OP is not hindering them from graduating.",
          "author": null,
          "created": 1575666195,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "f9vk4sy": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vk4sy/",
      "text": "59 would be my limit in that situation but as others have said, I wouldn't feel bad about failing them, either, because they shouldn't have cut things so closely in the first place. Plus, literally everything is on Canvas so there is no reason that this grade should be a surprise and they should have been working their butt off the whole semester to try to get that grade up.\n\nI used to be a high school math teacher and the only time I passed someone when they were not even \\*close\\* to passing was when I had this senior in Algebra 1. It was the FOURTH time she had taken Algebra 1, and she needed the math credit to graduate. She attended class every day and did the work, but things just didn't click for her (I do wonder if she perhaps had undiagnosed dyscalculia but I digress...).\n\nShe bombed the final exam and her overall grade in the class was like 50.1%. I changed that F to a D and mentally wished her well in her life. I never told her that I had done that but I just felt it was cruel to make her take it a fifth time--like, what point are we trying to make here??\n\nCollege is a different situation because they choose their major and their classes so you would never get someone like the girl above, who was stuck with meeting requirements that were set by someone else. However, I have had students who've experienced traumatic events during the semester and I absolutely work with them to extend deadlines during the semester and/or give them an incomplete. \n\nBut giving free points isn't helping anyone or being equitable--instead, it's devaluing the grades by making that grade able to be earned with less work.",
      "author": "Purple_Chipmunk_",
      "created": 1575672434,
      "upvotes": 17,
      "replies": {}
    },
    "f9utsoi": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9utsoi/",
      "text": "Just a note that my department policy is that all students in the class must be offered any extra credit options. So if you pulled an extra credit option out of your hat, in my department, it would need to go to all students. \n\nI am a grad student, so I have the benefit of getting a bunch of extra supervision of my teaching, but my guess is that there are systems in place to get supervision on this topic if you would like it. (E.g. in my department, faculty would talk to the program head.) That might alleviate some of your guilt/ambivalence if someone else is involved in the decision process.",
      "author": "intangiblemango",
      "created": 1575657572,
      "upvotes": 14,
      "replies": {}
    },
    "f9unc2m": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9unc2m/",
      "text": "Over here in the UK extra credit isn't even a thing you can offer. The assessments are allocated particular proportions of the module total in the specification. Each assessment is both internally and externally moderated (the former by another member of staff in the department, the latter by the programme external examiner, who is a senior academic at another department in the country).\n\nThe idea of having wiggle room on marking is completely alien.",
      "author": "OrbitalPete",
      "created": 1575654245,
      "upvotes": 23,
      "replies": {
        "f9vx8v9": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vx8v9/",
          "text": "I would much prefer this system. The number of student sob stories I hear each semester has been increasing exponentially over the last few years. I am not sure how to deal with it. So many of the students really do work 30+ hours a week (night shift, no less) and take a full credit load at the same time..and then of course, have mental health issues etc. etc. I do feel for them. I understand why they have a hard time getting to class sometimes. It's hard out there for many young people these days in my area. They really want the extra credit opportunities, but I'd really rather not have to deal with it at all.\n\nRelated issue- I write pretty firm rules regarding when I will accept late assignments etc. in my syllabus and then seem to end up breaking them at least once or twice every semester. How exactly does one go about telling a student that no, I cannot accept your paper tardy even though your brother died...or you were diagnosed HIV+...or you are dealing with legal proceedings against your rapist...or you were evicted. All of these are real, true examples from just the last year by the way. \n\n&#x200B;\n\nSorry I am ranting. Ugh, I am very ready for winter break.",
          "author": "breezeblock87",
          "created": 1575682220,
          "upvotes": 9,
          "replies": {}
        },
        "f9w0mnu": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9w0mnu/",
          "text": "It's going to be discipline dependent, but in general I would say that grades are flawed measurements. You can moderate as much as you can and there will still be some noise in them. You can minimise it with stuff like moderation (minimises mismatch between exam and learning outcomes), panel marking (minimises mismatch between markers), or second markers (same) but I don't think you can bring it down to 0 without spending a ridiculous amount of time, like making the students take the same test multiple times, then having them all assigned randomly and marked by multiple markers and averaging everything out. So the wiggle room is there regardless of whether you want it or not, it's up to you to decide whether you will fail a student with 49% (+/- something) and pass someone with 51% (+/- something).",
          "author": "needlzor",
          "created": 1575684806,
          "upvotes": 3,
          "replies": {}
        },
        "f9vx4z9": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vx4z9/",
          "text": "That seems much more preferable to our habit of sliding scales. How is grade inflation in the UK?",
          "author": "tamirabeth",
          "created": 1575682138,
          "upvotes": 2,
          "replies": {
            "f9x0ptr": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9x0ptr/",
              "text": "It's becoming a huge problem:  [https://www.bbc.co.uk/news/education-48951653](https://www.bbc.co.uk/news/education-48951653)",
              "author": "zainab1900",
              "created": 1575702500,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "f9uqh77": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9uqh77/",
      "text": "I just recently had this debate with a mentor. \n\nMy opinion is that sometimes you just have to take a hardline stance on grades. I provide an excess of opportunities to get a boost in my class (I use the top 5 graded quizzes out of 10). \n\nI now state at the beginning of my classes that no mystery points will appear at the end of the semester. I remind the students of this at the drop date and mid-semester and during the last lecture. I wish more professors would make their grades immutable so that there's less manipulation by students.",
      "author": "RhodaMorgenstern",
      "created": 1575655859,
      "upvotes": 30,
      "replies": {
        "f9vrnd4": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vrnd4/",
          "text": "Your mentor disagreed?\n\nPersonally I lean towards leniency. It seems that the profession heavily selects for hard working, conscientious, well organized, high achievers. After all it is so hard to get any TTAP job how could you be anything but. The problem with this is that a lot of profs, at least the ones I've met in person and on subs like this, simply cannot relate to students who aren't fully composed. They cannot imagine themselves ever waiting until the last minute on assignments or not reading the syllabus, so why should they care about those who do?\n\nI think I'm doing a bad job verbalizing this. But it just feels a bit wrong to me to be too harsh or absolute with grading schemes. It's almost like a person who grew up in affluence, and enjoys it today, judging a kid who grew up in poverty for not knowing how to invest properly.",
          "author": "Ut_Prosim",
          "created": 1575677910,
          "upvotes": 16,
          "replies": {
            "f9w3sd9": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9w3sd9/",
              "text": "you’re completely correct. 100%. this sums up the VAST majority of comments on this post. there are a LOT of people with the attitude of ‘well I can’t relate, so why should I even care? they should’ve worked harder’ and the sheer lack of empathy is honestly kind of stunning to me. \n\nas a student, myself and so many other students that I know from my background (working class, minority backgrounds - with a HEAVY emphasis on working class) simply have not grown up with the knowledge of how to apply themselves to certain things. I’m the first in my entire extended family to go to university. I came from one of the worst performing schools in my entire region, never mind just my town. I went to uni absolutely BLIND. completely clueless and out of my depth. nothing prepared me for it. \n\nI’ve never ever had the opportunities that people who came from much more comfortable backgrounds have had (especially considering these people so often have other family members with backgrounds in academia at the very least, or even private schooling in some cases). it sucks to read these comments and see myself stereotyped as lazy and stupid when I mostly struggle so hard because I’m being compared to people who were prepared for this their entire lives.",
              "author": null,
              "created": 1575686535,
              "upvotes": 16,
              "replies": {}
            }
          }
        }
      }
    },
    "f9uvu6j": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9uvu6j/",
      "text": "Everything is very regulated at universities in my country. We literally can't give extra credit to single students. If we do, we have to give it to everyone. \n\nSo no extra credit from me. I'm sorry, student, and happy holidays.",
      "author": "rpfflgt",
      "created": 1575658612,
      "upvotes": 15,
      "replies": {
        "f9ux29u": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9ux29u/",
          "text": "Same. Extra credit is for everyone, and while I will round a grade up from 69.51 to 70, I don't just give one student a whole point for no reason. If I'm going to do that, then I'll give the whole class the extra point.",
          "author": "Weaselpanties",
          "created": 1575659240,
          "upvotes": 11,
          "replies": {
            "f9wamrw": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9wamrw/",
              "text": "That's not what extra credit is, that's just adjusting the grading curve. Extra credit is usually done as optional additional work that any of the students could choose to do. It is not required, but adds to their grade if they do it.",
              "author": "starship-unicorn",
              "created": 1575689659,
              "upvotes": 3,
              "replies": {
                "f9wkobl": {
                  "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9wkobl/",
                  "text": "Yeah. That is because I talked about both. Sorry it wasn't clear, end of term burnout is real.",
                  "author": "Weaselpanties",
                  "created": 1575694189,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f9uwdm2": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9uwdm2/",
      "text": "Zero.\n\nWith the caveat that I think it is not always realistically possible to have a 1 point accuracy.  So for ALL students who are 1 point (not 1%) away or otherwise very borderline, I do check to make sure there wereany any bad questions I forgot throw out or if there was any subjective grading that I was too harsh on.  Almost always, it is the other way, and I think I was too generous.  \n\nThey should consider the financial cost of re-taking the class and could have done ANYTHING during the semester for that couple extra points.  \n\nIf I pull an extra credit question \"out of my hat\" the whole class gets that chance.  Why should a really hard working A- not get the chance to get an A?  \n\nKnowing slightly more than half the material is a low enough bar in any case.  It gives me no joy that they don't know anything.",
      "author": "PersephoneIsNotHome",
      "created": 1575658891,
      "upvotes": 9,
      "replies": {}
    },
    "f9vald1": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vald1/",
      "text": "Let's be accurate: by doing your job *you are not hindering anyone from graduating.*",
      "author": null,
      "created": 1575666116,
      "upvotes": 9,
      "replies": {}
    },
    "f9w0hon": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9w0hon/",
      "text": "Most of the classes I teach are core curriculum or major requirements where a C- is the lowest anyone can get to pass, so students really have to mess up (miss multiple assignments or classes) to fail, which makes failing them clear-cut.\n\nStill, I'd say a 68 would be my limit. I bump students up when I can sense they're going to complain--as an adjunct, even bullshit complaints can be enough to convince a department not to assign you courses next spring.",
      "author": "brownidegurl",
      "created": 1575684698,
      "upvotes": 3,
      "replies": {}
    },
    "f9w2c85": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9w2c85/",
      "text": "Why does it matter? The free-point limit should be different on each case to achieve what you are trying to do. Points are not currency. \n\nIf for example you think this person should graduate then you should give them enough points to achieve that, 1 or 100. That's my personal take on it at least.",
      "author": "iordanissh",
      "created": 1575685813,
      "upvotes": 3,
      "replies": {}
    },
    "f9wacsj": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9wacsj/",
      "text": "Here's the thing. The fact that someone has a 58 in my class doesn't mean I have ironclad evidence that they were 2% short of doing well enough to pass. Grading and assessment aren't that precise, no matter how hard I try. There's an underlying distribution there. I've given exams and homework assignments and graded as fairly as I can and the maximum likelihood estimate is 58. I'm not confident that the variance there is small enough to justify conclusively hitting that student with a large penalty.\n\nI do need to see something that says they're meeting me halfway, but if they've basically participated in class and made what looks like a serious effort, I'll try to come up with a point or two.",
      "author": "deong",
      "created": 1575689538,
      "upvotes": 3,
      "replies": {}
    },
    "f9uw9i9": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9uw9i9/",
      "text": "If a student is rolling with a 59 in my class, it wasn't that important to them and I'm not sure why it should be more important to me.",
      "author": "Weaselpanties",
      "created": 1575658833,
      "upvotes": 9,
      "replies": {}
    },
    "f9uu7yx": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9uu7yx/",
      "text": ">Do you pull an extra credit assignment out of a hat and make them sign a NDA so they do not tell others?\n\nHonestly not sure if this is the worst or best idea I've heard on this sub lmao.",
      "author": "prison_mic",
      "created": 1575657790,
      "upvotes": 6,
      "replies": {}
    },
    "f9wmxri": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9wmxri/",
      "text": "I believe in weighting improvement, or at least I did, when I was teaching. If a student started the semester out poorly, but has really picked it up after, say, the first exam, I was much more willing to weight one exam more heavily than the others.",
      "author": "psstein",
      "created": 1575695285,
      "upvotes": 2,
      "replies": {}
    },
    "f9xaxco": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9xaxco/",
      "text": "My university's policy is that if its their last subject to graduate they are pretty much guaranteed a supplementary exam (pass/fail only). Solves the moral dilemma but creates work and sometimes you just think the student was a bum.",
      "author": "etoni888",
      "created": 1575708019,
      "upvotes": 2,
      "replies": {}
    },
    "f9vcpri": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vcpri/",
      "text": "If this is the first I am hearing of it, graduation clearly isn't that important to them. Why should it be important to me?\n\n> Or is hearing the lamentations of failing students the best thing in life?\n\n[Crush them!](https://i.ytimg.com/vi/_XUu3_pLPUE/maxresdefault.jpg)",
      "author": "ph0rk",
      "created": 1575667485,
      "upvotes": 5,
      "replies": {
        "f9vi74a": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vi74a/",
          "text": "I do suppose nowadays it may be more like hearing the lamentations of their parents.",
          "author": "wolfowls",
          "created": 1575671106,
          "upvotes": 1,
          "replies": {
            "f9vllgm": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vllgm/",
              "text": "[Ooooooh](https://www.youtube.com/watch?v=nmaWsFdbYx0)\n\n(That's a good one)",
              "author": "ph0rk",
              "created": 1575673466,
              "upvotes": 1,
              "replies": {
                "f9vogqe": {
                  "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vogqe/",
                  "text": "Maybe I can get an award and hire the guy who did the *[Conan the Barbarian: The Musical](https://www.youtube.com/watch?v=OBGOQ7SsJrw)* to do a professor version of the song: \n\n\n\n> \n> Crom, why are they crying but did not study? \n> \n> Crom, if you’re my god then give me a grant!.\"\n\nMan, I need a vacation.",
                  "author": "wolfowls",
                  "created": 1575675539,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f9wf5dx": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9wf5dx/",
      "text": "Will your decision encourage them to keep trying to learn new things that are challenging or will your decision lead them to think they are too dumb to try difficult topics? Your job is to teach and encourage students to continue to seek knowledge. The LSAT, the MCAT, the GRE and many other exams will take care of the weeding step. A little shocking that you would call a student a lazy bum...that seems problematic.",
      "author": "madcat1970",
      "created": 1575691666,
      "upvotes": 2,
      "replies": {
        "f9wz9du": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9wz9du/",
          "text": "It's not problematic at all. Definitions of the word \"bum\" include \"someone who avoids work\" and \"one who performs a function poorly.\" And lazy means \"indolent\" and \"disinclined to activity or exertion.\"",
          "author": "wolfowls",
          "created": 1575701696,
          "upvotes": 2,
          "replies": {
            "fa5h24q": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/fa5h24q/",
              "text": "You are placing some negative judgement on the student. Have you called them lazy bum to their face?",
              "author": "madcat1970",
              "created": 1575815006,
              "upvotes": 1,
              "replies": {
                "fa61uu1": {
                  "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/fa61uu1/",
                  "text": "Nobody: It is so upsetting that I am not graduating because of a couple points in one class, but the real issue is that the professor used problematic language to describe me in reddit post.",
                  "author": "wolfowls",
                  "created": 1575820114,
                  "upvotes": 2,
                  "replies": {
                    "fa6p11b": {
                      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/fa6p11b/",
                      "text": "It just reflects the teachers perception of a student if they call them a bum. If student has low confidence about their ability to learn why try when your teacher thinks you a lazy bum?",
                      "author": "madcat1970",
                      "created": 1575827011,
                      "upvotes": 1,
                      "replies": {
                        "fa7lwdf": {
                          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/fa7lwdf/",
                          "text": "I do not understand why you are picturing a fragile student without confidence here. If that was the case, I would not have called them a lazy bum. I know a case of \"I just a need a D-\" senioritis when I see it.  \n\n> why try when your teacher thinks you a lazy bum?\n\nBecause: it's your future and your education; you want a degree and to graduate; you do not want to spend more money on college. It is not my job to have blind faith in all students' potential, or bolster the confidence of lazy students. This is college, not junior high.",
                          "author": "wolfowls",
                          "created": 1575835947,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f9wuhyq": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9wuhyq/",
      "text": "In my syllabi I’ll specify a participation/effort component worth ??%, which I’ll use to bump borderline students up in proportion to those factors. Generally this means everyone within 0.1% of a letter grade gets a boost; ok-students who generally showed up to class, asked questions, etc. are good up to ~0.5%, and students who *really* went above and beyond are good up to maybe ~1-1.5%. Never had anyone beg for scores or anything in the 5 classes I’ve taught so far..\n\nI’ve been on the receiving end of teachers’ favor twice in this regard. Once, a professor set a final curve specifically so I’d fall just above the A-cutoff without any sort of prompting, and then mentioned to me in passing that he’d done so. Another time, I sent a 12:01 AM extension request to a programming professor for a project b/c I’d had busy week and it was the last assignment of my college career, and failure on it meant putting a *summa* honor at risk. They thankfully granted the extension and I submitted the project the next morning!",
      "author": "phylogenik",
      "created": 1575699103,
      "upvotes": 1,
      "replies": {}
    },
    "f9xs7i7": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9xs7i7/",
      "text": "It's a bit different where I live. You get graded on 20 points and getting 12/20 is already a decent grade. It's very normal for students to get a lot of 10/20s and a few 9/20s. With the 9/20, they have to do the exam again either during the summer or the next year. It's also very normal for a class to lose over half its students the first year.\n\nThat being said, I got granted the courtesy of an extra point when I was at 9/20 for a second year thesis during my studies. I had failed to put my research into an extra bundle of graphics - something my classmates had done -, which made it seem as if I was making it all up. When I had to defend my paper, I showed the juror my research notes though. This was a course you couldn't really fail, so he felt that it would be silly for me to drop out over something like that when my research and paper itself were well-written.\n\nI'm still grateful to him for being understanding and showing some humanity. So I try to show that same compassion to those in similar situations. I'm not tacking on extra points when someone isn't close to the standard I expect though, even if I have to fail the entire class.",
      "author": "Instantcoffees",
      "created": 1575717377,
      "upvotes": 1,
      "replies": {}
    },
    "f9vbrid": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9vbrid/",
      "text": "Eh. Given context there is virtually no scenario where someone more than a point away just magically gets points. In my course there would have been plenty of opportunities for easy points or credit so if they failed to get those or failed despite of those then that’s on them. I don’t give handouts",
      "author": "Ronaldoooope",
      "created": 1575666870,
      "upvotes": 1,
      "replies": {}
    },
    "f9w5kho": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9w5kho/",
      "text": "I would like to rant that a while back in my graduate level elective class that I didn't even have to take, I was 0.5% away from a 3.0 for passing and my lovely professor wouldn't give me that. It's a good thing I don't need the class and no one cares about my gpa at this point  but I'm still bitter about it.",
      "author": "UnspectacularAim",
      "created": 1575687359,
      "upvotes": 1,
      "replies": {}
    },
    "f9zk8lz": {
      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/f9zk8lz/",
      "text": "There should always be extra credit available that will allow you to pass the class whenever. Not necessarily to get a better grade, but to get a passing grade instead of a fail.\n\nIt's as simple as allowing people that have failed to redo their essay or retake the test. It's not unfair if the opportunity is extended to everyone. Pedagogically it makes no sense to give feedback and then not let them improve upon it (most won't so it's not much more work).\n\nArbitrary deadlines are evil and whenever I teach, I allow people to submit assignments and take the test even years later if they decide to unfuck themselves and finish the course (and I am still employed). Doesn't matter if you're sick, enlisted into the marines, whole family died in a fire, had a drug addiction, burnout or simply played videogames.\n\nFuck admin that doesn't allow you to be flexible, it's a blessing when instead of 100 submissions over a 1 week period of time they arrive one at a time over the next year or so. Mostly during/after holidays when people try to catch up.\n\nI was the kid that never did anything on time, returned assignments 6 months late, took the final exam 2 years after the course ended and so on. FUCK instructors that have bullshit deadlines or deduce points for submitting late. Fuck you Fuck you Fuck you Fuck you. Did my PhD just fine even if I did miss a few deadlines. Missing stupid deadlines doesn't make me a bad person and missing a deadline doesn't mean I am stupid or incompetent, it just meant that I had other shit to do.\n\nI used to get amazing reviews from students too. Time of your student is just as valuable as yours. Don't be an asshole and penalize people for being late because you are on a power trip or too lazy to assess a late submission or create a test for a special case. They are uncommon enough that you won't even feel it as extra work but mean everything to the students.",
      "author": null,
      "created": 1575742591,
      "upvotes": 1,
      "replies": {
        "fa1sg66": {
          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/fa1sg66/",
          "text": "“Time of your student is just as valuable as yours”\n\nWhich is exactly why (beyond my states laws—yes, there are laws regarding this in the state that have no leeway around for funding as a state school) I have deadlines. My time matters. If they don’t respect my time enough to give it to me when I have time to grade it it, I don’t respect theirs enough to grade it “whenever they got around to it.”\n\nIt has nothing to do with a power trip. I imagine you teach a non building type of class. If a student doesn’t do the first unit in a math or science class, they certainly won’t be able to do the second. Or the third. Or the cumulative final. The deadlines are just as much for their benefit as it is for my time management.",
          "author": "Xylophelia",
          "created": 1575773778,
          "upvotes": 1,
          "replies": {
            "fa40xdz": {
              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/fa40xdz/",
              "text": "Except when someone has a rough week or two, you fuck up their entire semester. Not everyone can adhere to the every deadline for 4 years. One single soulless instructor like yourself and they don't get their prereqs done for their next year and you add up a lot of unnecessary stress to whatever is already going on in their life.\n\nYou are just lazy and on a power trip. It does not take a lot of effort to grade the handful of students that worked their ass off during the holidays catching up and instead you choose to fuck them over despite their attempts to make things right.\n\nYou are actually paid to teach a class. If you grade 10 fewer students in December and grade the 10 students during Jan-May, it's still the same amount of minutes spent grading their work. Allowing students to improve their grades, retake the exam etc. is also not a lot of extra work.\n\nYou spend more time reading and answering to sob stories and making exceptions (most will make up a story that will force you to accommodate them) than you'd spend actually grading their work.\n\nI know plenty of instructors like yourself that just teach because they are forced to. They don't care about their students. It's a shame that the administration keeps hiring people like you instead of people that actually want to teach and care about their students enough.\n\nYou can still have soft deadlines, retakes etc. and the majority of the class will adhere to 90% of them. But everyone has that one week when they have a flu, a family emergency or multiple deadlines at the same time and it would reduce a lot of stress if they know that they can put in the extra work during Christmas holidays and take the exam in January instead of December. Hell, I had a student that had a kid and still graduated on time because they could do all the work and take all the exams in bursts when the kid started sleeping through the night and the family/spouse could help out with the kid.\n\nEveryone is different and have different circumstances in life. \"I don't have time\" or \"I don't have the resources\" is a bullshit excuse.",
              "author": null,
              "created": 1575799846,
              "upvotes": 0,
              "replies": {
                "fa4xd3f": {
                  "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/fa4xd3f/",
                  "text": "That’s a lot of assumptions\n\nA) I teach community college in a low income rural community full of first generation college students because I have a supreme passion for advocating for those kids way more than research. I let other people chase grants for funding research that pays the bills instead of what they want to research   Every step j took in college and Grad school was intentionally aimed at this field. \n\nB) I went to college in my late 20s and early thirties, and I was that exact student you’re describing. \n\nYou are advocating for a ridiculous “even years later” 100% open policy. \n\nThat type of mentality you are teaching your students is why people in industry get fired for not meeting deadlines. It is part of your responsibility to teach those people who leave the ivory tower to function. Open assignment policies teach them that they can do whatever they want when they want. You’re doing a disservice to your students pedagogically. \n\nI have a kid working on every homework assignment that was due in September right now at no penalty for life circumstances. \n\nI teach a 5/5/3 load. There’s no fucking way I’m grading something after December 11. And I’m not going to bat against the Vice President of the college to do it either. Again there are laws. \n\nYou are insane if you think it’s acceptable to turn work in after a semester is over.",
                  "author": "Xylophelia",
                  "created": 1575809470,
                  "upvotes": 1,
                  "replies": {
                    "fa4zsvj": {
                      "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/fa4zsvj/",
                      "text": "I've turned in work years late. I've accepted work that is years late. There is no extra work involved.\n\nYou plan to spend X minutes per student on grading their work. If they do not return it by December that means you get -X minutes in December and +X minutes in whenever they return the work.\n\nYou already are legally required to provide reasonable accommodations whenever someone gets to serve a tour in Afghanistan or is disabled or a bunch of other reasons. You already MUST DO THAT.\n\nThere are concepts of inclusivity, accessibility, and availability. Instead of designing your course for a specific assumed model student and then scrambling in panic when someone actually asks for accommodations that you are legally required to give, you design your course to be flexible, accommodating and work for all kinds of people.\n\nThis not only benefits someone that is disabled, called up to serve in the military or otherwise has \"extreme circumstances\", it also benefits the average student that for one reason or another could not adhere to the schedule. Which is the whole point, instead of making returning late require you a giant sob story and fighting it, you make it the default. Return your assignment whenever given that you are still employed there.\n\nYou shouldn't care WHY someone is returning things late or taking an exam later. Students do not owe you an explanation that might be very personal to them. In fact, you are legally forbidden from demanding an explanation in most cases anyway.\n\nDesign your courses in a way that people do not need to ask you for special exceptions. That time you spent reading someones email and writing a response could be time spent just grading their damn work or creating an extra exam available for everyone.\n\nIt's not hard, you are simply disrespecting everyone else and making yourself the most important person in the world since you're the instructor and everyone has to beg for your mercy. That's called being on a power trip.\n\nGo take some pedagogical courses or something, this is super basic stuff of being a human being.",
                      "author": null,
                      "created": 1575810196,
                      "upvotes": 0,
                      "replies": {
                        "fa50e98": {
                          "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/fa50e98/",
                          "text": "You are so not reading anything and you obviously aren’t here to learn from others but rather to go on a soapbox about your own deluded ideas of how the world works. You are making nothing but assumptions. I have never had a student “have to ask”. I volunteer it WHEN it is acceptable. But again, I am not passing the state law deadline of final grades due. I am not doing a grade change for someone who shows up at my door a year later. I don’t have the glory of tenure because I chose these kids over that. I am the only income earner in my home. So yeah, I’m not losing my job because I didn’t follow state law policies of a hard date of the last day of the semester.",
                          "author": "Xylophelia",
                          "created": 1575810405,
                          "upvotes": 1,
                          "replies": {
                            "fa550il": {
                              "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/fa550il/",
                              "text": "Does state law forbid you from allowing a student to retake the exam the next semester? Does state law forbid you from recycling the points from the assignments from previous course instances so that you only need to retake the missing parts of the course? Does state law forbid you from splitting your course into smaller modules and allowing the students to do modules 1-3 now and 4-5 next year or 1-5 this year or one module per year?\n\nYou're trying to shift blame from yourself towards \"oh the administration just sucks\". There are a LOT of things you can do within the bounds of the system that will not fuck people over. You just choose not to for no good reason.",
                              "author": null,
                              "created": 1575811647,
                              "upvotes": 0,
                              "replies": {
                                "fa56bd1": {
                                  "link": "/r/AskAcademia/comments/e71lt5/a_student_cannot_graduate_because_of_a_couple/fa56bd1/",
                                  "text": "Community colleges are not run the same as universities. They are not governments. There is no bureaucracy. They are run like corporations. They are funded by the state. They are highly audited to ensure academic rigor. They run like a business. There is no faculty senate. We are required to take attendance, verify it daily, and drop REGARDLESS of reason if 15% of the course is missed. We are required to put on file at the STATE level our assessments, and who took them when and the scores, monthly. \n\nWe could lose SACSCOC accreditation for even showing a glimmer of the ludicrous suggestions you’re making in not having a deadline within the timeframe of the course. We aren’t even allowed to issue incompletes at CCs in our state. It’s an A-C or an F and that’s it. \n\nYou obviously know nothing about the differences—they are huge. \n\nAnd again, you are not prepping kids for the workforce but for the ivory tower. You are the one who is being soulless. I’d love to see one of your students roll up to their lineman 4 years later, “here’s the schematic for the project you put me in charge of and wanted 24 hours later and fired me for not completing on time. I didn’t do it because my dad died but instead of telling you and taking bereavement FMLA like I was supposed to, my professor told me it was your responsibility to recognize I needed you. So here it is and I want my back pay for all the work I haven’t done and my job back”\n\nRidiculous.",
                                  "author": "Xylophelia",
                                  "created": 1575812060,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}