{
  "sid": "q6xx2o",
  "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/",
  "title:": "What was the learning curve like for you during your PhD?",
  "text": "I just started my PhD. Because I’m a neuro specialty, my program has it set to where I can’t get less than an A- or else I am removed from the neuro specialty. \n\nI am very type A, insanely organized, and in undergrad I never had less than an A. My A’s pretty much determine the value I see in myself. So now here I am, in a program where everyone is incredibly accomplished, and I am no longer able to reach the standards and keep up. \n\nI don’t know what’s wrong with me. I just can’t focus. Maybe because in undergrad I would have one big project due once every two weeks, and now I have a big project to do every night? I set aside 8 hours yesterday to write a 7 page case study. How much did I write? A paragraph. That is all I could manage to do. I am burnt out and have barely started. A’s used to be my motivation, and because I’m not even getting A’s, I feel like there is no point anymore. I took a midterm today and scored an 86 and was genuinely disappointed in myself. I check what the class average is for every assignment and I have consistently been falling under the class average. I feel so inadequate. This midterm was supposed to be my easy midterm, and I couldn’t even manage an A. I have no motivation to write or study. I just feel constantly defeated. Last night I opened my DSM to read the diagnostic criteria and see if I have ADHD. I am already looking into psychiatrists to see if I need some form of medication. I just don’t understand what’s wrong with me because this isn’t who I usually am. My mom has tried reminding me that people are not built to study as much as I am required to during this time. But I feel like lots of other people manage it successfully. Or maybe they struggle too, and struggles aren’t talked about enough. \n\nI’m trying to tell myself there is a learning curve. I came straight from undergrad into an insanely rigorous program, and there are students who have masters degrees who know more than me and it’s ok they score higher because of that. But when I am seeing that I am falling below class average, that is why I am really starting to worry. Has anyone gone through something similar? When did you adjust? How do you not put all this pressure on yourself? Is there anything you learned about this process? \n\nI understand self care is important. I try to practice self care. But I get to a point where I have procrastinated so much that I can’t even practice self care because there is no time anymore.",
  "author": "adorationn01",
  "created": 1634079707,
  "updated": 1634581183,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgf5z8p": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgf5z8p/",
      "text": "Picture a brick wall. That's a good visualization of the learning curve, from my experience. \n\nThe country you're in will somewhat determine other advice, but one of the transitions that's hardest from undergrad to grad school is remembering that coursework (and grades) are a relatively small part of degree, especially a PhD in a science field. \n\nThat, and exactly what you mention: you're suddenly surrounded by a lot of very accomplished people, and being \"average\" means something very different. \n\nI wonder if perhaps some of your writers block / difficulty focusing is from stress about grades / performance? Sometimes working on letting go of that so you can just do work is helpful.",
      "author": "Eigengrad",
      "created": 1634083265,
      "upvotes": 30,
      "replies": {}
    },
    "hgg7g3d": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgg7g3d/",
      "text": "I’m curious why a Science PhD would have so much coursework. Shouldn’t you be in a lab, doing rotations, listening to speakers, maybe taking a few classes, a journal article club or two....\n\nCrazy. Or are you in an MD/PhD? \n\nNormally, I’d just say prioritize lab work, journal\nclubs, and papers over course work (100:1) but you have that weird grade cap requirement.  Dunno. I’d go to a different program, where you could put more energy towards doing and designing experiments and publishing.",
      "author": "DesertAlpine",
      "created": 1634102178,
      "upvotes": 15,
      "replies": {
        "hgjppiv": {
          "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgjppiv/",
          "text": "This seems to be an overarching issue in this sub... like I have no idea what the context is for most of these posts.\n\nI’m also doing my PhD in Neuroscience and my experience is nothing like this - and I don’t know any respected university in America or Europe where scientific PhDs aren’t primarily about hands on research.",
          "author": "Default_Dragon",
          "created": 1634167845,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hggoh4m": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hggoh4m/",
      "text": "Um, you were a straight A student and now you think you have ADHD because of the heavier workload with less less straightforward goals? Have fun learning new things if phd is what YOU WANT. It is a game you cannot lose, you either learn a bunch of new things and get your phd or learn a bunch of new things and realize that phd is not what you want. Just don't sacrifice your health, h-index don't matter if you are dead.",
      "author": "Acceptable-Ad-6453",
      "created": 1634116465,
      "upvotes": 15,
      "replies": {}
    },
    "hgg7wbj": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgg7wbj/",
      "text": "Succeeding as a PhD in Neuro requires being motivated by more than grades. It requires passion and purpose, which cannot be learned. Why did you go into a PhD in the first place? If it's something you fell into, you will struggle more than others. Not due to an inability, but due to the impossibility of working that hard for that long on something you aren't passionate about. \n\nIt sounds to me like you are having problems with motivation more than struggling with content. If this is true, you should really appraise your reasons for wanting a Neuro PhD. It only continues to get harder with every step. The challenges definitely change, but they don't get any easier. \n\nAlso keep in mind that grades matter very little outside of what is required to pass. The only time they will ever come up again is if you apply for federal post doc grants",
      "author": "ActionXPotential",
      "created": 1634102483,
      "upvotes": 13,
      "replies": {}
    },
    "hghw3n5": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hghw3n5/",
      "text": "I have some bad news for you: you’re going to have to be your own A here. You can go literally years without any positive reinforcement, you have to find joy in small victories. You have to be internally motivated to keep going and don’t look to mental health as an excuse when you fail if there are no other signs: be accountable and take ownership of your successes and your failures. \n\nI went through this too: I called it the “4.0 virus” because undergrad coursework and culture trains your brain to seek external validation and focus on outcomes instead of actual learning. This mindset and focus does not make one a good researcher. The answer is not in the back of the book and there is no dangling carrot every 4 weeks. It’s stick every day. Failure is the only way forward and you must, Yoda quote intended, “Unlearn what you have learned”. Focus on the process, not the outcome and know that success will be far away, but it will come if you are diligent and learn to ask the right questions to inch your way forward.",
      "author": "Ceej640",
      "created": 1634140608,
      "upvotes": 13,
      "replies": {}
    },
    "hghtz3r": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hghtz3r/",
      "text": "There is always a pretty massive learning curve, so it is normal that you feel overwhelmed early on. However, I think the bigger problem here is being motivated by grades as opposed to learning. A PhD is a research degree. The courses in the beginning are designed to get you up to speed, but they are not the main point of the degree nor does anybody care about how well you do in them as long as you pass. You need to find something that motivates you other than just being smart or being at the top of your class and focus on that. As cliché as it sounds, mistakes represent an opportunity to learn. If you don't adopt that mindset you will have an awful experience in your PhD.",
      "author": "CootaCoo",
      "created": 1634139738,
      "upvotes": 10,
      "replies": {}
    },
    "hgjrjqg": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgjrjqg/",
      "text": "Being “insanely organized” is the exact opposite of what ADHD is, and ADHD also does not appear miraculously when you are an adult. You have to have symptoms present before you even turned 12.\nThat said, anxiety/depression/burnouts can all make it very hard to focus. Therapy can be helpful. Other than that, PhDs are tough, especially when you are a perfectionist who self-defines as a straight-A person. You really need to be in love with learning and research. Grades matter very little for being a good researcher.",
      "author": "gleisner_robot",
      "created": 1634168714,
      "upvotes": 3,
      "replies": {}
    },
    "hgkmytk": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgkmytk/",
      "text": "Your description of yourself as someone whose self-image depends on their grades concerns me.\n\nIn some corners of academia, students like yourself are referred to as \"fragile perfects,\" because when they cannot achieve perfection as usual, they crack.\n\n(For this reason, many of us who direct graduate programs are wary of applicants with 4.0 undergrad GPAs.)\n\nThe remedy for this fragility is building resilience. Failures are important, because we learn from them, and they help us recognize and embrace our imperfections.  Perhaps this (very brief) article will help you.\n\n[from \"fragile perfects\" to \"resilient perfects\"](https://medic.upm.edu.my/upload/dokumen/2021040613530940_MJMHS_1017.pdf)",
      "author": "matthewsmugmanager",
      "created": 1634184308,
      "upvotes": 4,
      "replies": {}
    },
    "hgix0r0": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgix0r0/",
      "text": "I had a massive learning curve and spent an excessive amount of time \"zoning out\" my first two years of grad school. Thankfully my program doesn't kick you out at quite the level yours seems to. Establishing a routine, finding bullet journaling (the actual method, not the pretty stuff), and using pomodoros were all critical to my being able to get through that time. I couldn't understand it either, and I was really self-critical. I think of it like I was walking a tightrope and now I've built myself a web. Structures and scaffolds to support me. The final thing I recommend is writing yourself a letter (mine is called \"in case of angst\") that reminds you why you wanted to do this and also tells future you how to decide if this isn't worth it. Mine says basically \"keep trying for now, if it's still intolerable for 2 weeks, try changing something.\" I also find it helpful to remind myself that procrastination is a coping mechanism, not a personality trait (see https://www.forbes.com/sites/amyblaschka/2021/04/03/youre-not-lazy-youre-scared-how-to-finally-stop-procrastinating/?sh=5a3f7f806dab)\n\nThere's no one way to do life \"right\".",
      "author": "jenesaisquoi",
      "created": 1634155385,
      "upvotes": 3,
      "replies": {}
    },
    "hgoe8cr": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgoe8cr/",
      "text": "> I don’t know what’s wrong with me. \n\nPossibly the problem is this:\n\n> I am very type A, insanely organized, and in undergrad I never had less than an A. My A’s pretty much determine the value I see in myself. \n\nYou haven't learned how to fail yet, because you never fucked up in HS or undergrad. You're focused on grades instead of learning, but grades don't matter in grad school, not really. You need a broader perspective - this isn't \"school\" in the sense you're familiar with, it's an apprenticeship. Focus on *the work* and following your curiosity. Why are you in grad school? Presumably because you love your subject and want to do it professionally, right? So connect with that love of the subject and let that drive you. (If you don't have that passion in you somewhere, it may be time to bail on academia, because the only thing that makes it worth it is loving what you study - it certainly isn't lucrative, secure, or conducive to work-life balance.)",
      "author": "ExplainsSocialNorms",
      "created": 1634257137,
      "upvotes": 3,
      "replies": {}
    },
    "hggwohc": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hggwohc/",
      "text": "_____________/",
      "author": "01010100111011011011",
      "created": 1634123215,
      "upvotes": 2,
      "replies": {}
    },
    "hghzz68": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hghzz68/",
      "text": "Your experience is what everyone experiences. You will relearn how to think and problem solve, that’s part of the PhD. Failure is a gigantic part of it, that will not go away for a while",
      "author": "onetwoskeedoo",
      "created": 1634142200,
      "upvotes": 2,
      "replies": {}
    },
    "hgii141": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgii141/",
      "text": "It sounds like you might not be as passionate about what you are studying as the PhD workload demands. Maybe you have ADHD, but i wouldnt leap to that conclusion; most of the time, a lack of motivation can be chalked up to just that, a lack of motivation.\n\nMy somewhat contraversial opinion is that motivation is not something that can be controlled. You just have to adjust your goals until they align with what your level of motivation will allow you to do. Maybe that means dropping out of your program; maybe that means suffering through it; maybe that means getting some kind of accomodation. That is a choice you will have to make for yourself.\n\nIt is a painful process. Sorry to hear you are in the midst of it.",
      "author": "l_Have_Like",
      "created": 1634149339,
      "upvotes": 2,
      "replies": {}
    },
    "hgjqi4b": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgjqi4b/",
      "text": "Logarithmic. But at least I don't hit my limit.",
      "author": "Doctor_HowAboutNo",
      "created": 1634168219,
      "upvotes": 2,
      "replies": {}
    },
    "hgjweri": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgjweri/",
      "text": "Honestly, most of the technical aspects of my PhD I got a good look at during my masters, so from a technical perspective I knew *almost* everything I needed going in, or (at least) I knew what I knew, what I didn't know, and how to get to the position I needed to be in in order to finish the mathematical/scientific ends of my doctorate.\n\nThe real hurdle was time and people management. I ended up being the head PhD student pretty quickly, and I was working in a combustion lab, meaning I was not only responsible for everyone getting their experiments in, but I was also responsible for everyone getting their work done without unnecessary fire.",
      "author": "r3dl3g",
      "created": 1634171025,
      "upvotes": 2,
      "replies": {}
    },
    "hgikb56": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgikb56/",
      "text": "I truely didn't \"get it\" until my last year when I was writing my disseration.\n\n&#x200B;\n\nI honestly felt like I was swimming trying to catch up until I had my data ready to analyze and time to sit down, breathe and write.",
      "author": "DevinC0peland",
      "created": 1634150258,
      "upvotes": 1,
      "replies": {}
    },
    "hgk2684": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgk2684/",
      "text": "I'm very confused. What kind of PhD program is this!?",
      "author": "NorthAd7013",
      "created": 1634173751,
      "upvotes": 1,
      "replies": {}
    },
    "hgpceig": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgpceig/",
      "text": "Big project to do every night? We need more context, I have no idea what PhD program you’re talking about here..",
      "author": "animelover9595",
      "created": 1634273736,
      "upvotes": 1,
      "replies": {}
    },
    "hgg7yrk": {
      "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hgg7yrk/",
      "text": "Honestly sounds exactly like me when unmedicayed. I have adhd and I take probably only 10-15 mgs of addy. I am prescribed a much higher dose but spreading it out works ok for me. Definitely seek diagnostics. It could change your life! And again- it is possible without being super duoer medicated",
      "author": "spacecadet1825",
      "created": 1634102529,
      "upvotes": -6,
      "replies": {
        "hggxdko": {
          "link": "/r/AskAcademia/comments/q6xx2o/what_was_the_learning_curve_like_for_you_during/hggxdko/",
          "text": "Until this point she says she’s been “super organized” and that none of this is who she usually is. I know the straight-As can happen with ADHD, but there still have to be long-term symptoms to even pass a preliminary screener, and it really doesn’t sound like she does. (And I say this has someone who was diagnosed at 22 after graduating with honors—but my symptoms didn’t show up suddenly when I was stressed. They’ve been there my whole life, I just thought they were normal, and I was just barely able to compensate) Obviously no one can diagnose OP over the internet and I’m not discouraging a visit to a mental health professional, but this sounds a lot more like anxiety and/or burnout than anything else? I just don’t want OP to expect medicine to fix everything\n\nOP-I promise you aren’t the only one struggling, and it’s ok not to be naturally good at everything. It’s easy to forget that when you sailed through undergrad and suddenly hit something hard for you. Comparing yourself to others is turning into self sabotage because it’s making you feel inadequate and stopping you from even trying. Can you talk to an academic advisor about the content that’s giving you problems? Rather than framing it as “everyone else is getting the A- and I can’t“, think about it as “what can I do to get on track?” You may not have a masters but they would not have let you in if you weren’t as qualified as everyone else",
          "author": "velmah",
          "created": 1634123722,
          "upvotes": 7,
          "replies": {}
        }
      }
    }
  }
}