{
  "sid": "pvc10b",
  "link": "/r/AskAcademia/comments/pvc10b/what_should_i_do_about_abusive_faculty/",
  "title:": "What should I do about abusive faculty?",
  "text": "Throwaway because obviously. \n\nUS humanities field. I'm a noncitizen grad student. Abusive associate professor who is up for tenure and has their first book coming out soonish on a major press. I really don't think he should be getting away with what he's done. \n\nThe twist I suppose is that this happened in a personal capacity, not in any professional setting so there's no reporting him to any official academic authority. I don't believe in policing so I didn't report him to any police authority. He has more power than me from a financial standpoint (wealthy family) but also professionally (faculty in my field and even sub-field, alum of my department, works in the same region as my grad school etc.) and I guess I should say, physically, since he was much larger than me.\n\nAs it happened, we somehow ended up sharing an apartment together (completely platonically) but then ended up stuck together during covid lockdown where he rapidly began to unravel and scream and hurl abuse at me on the regular. He would demand that his dog be allowed to roam free throughout the apartment at all times, even when he's not home, and would grow abusive and angry if I ever asked him to keep his dog out of my room (where it chewed up, among other things, my sex toys and papers, and jumped on my bed and pillow).\n\nHe would fly into rages at the slightest thing, and begin swearing and screaming at me if I ever asserted my own boundaries. (Perhaps a little tangentially, he began attacking people on the street, in parks, and on the road as well. He also let his dog attack there dogs at the park, and would scream at the owners who were upset. He also, according to his rants to me, berates his students for asking for accommodations and does everything he can to refuse them because they were \"spoiled white women\".)\n\nAt home, he began to insult my family, using personal details against me to denigrate them and me until I was cowed into silence. He began to threaten to force me to break the lease, which was completely untenable for me as a grad student with a below poverty wage stipend (he also had the habit of insisting that because he had student loan debt that he, as faculty, was actually more disempowered financially than me, someone making poverty wages and can't legally work off campus). \n\nEventually, he began physically threatening me, bursting into my room and refusing to leave while berating me. The only way I could get him to stop was to start filming with my phone and saying this person is a faculty member who works with graduate students and he is currently physically threatening and intimidating me at which point he realized that his behavior could endanger his job. This was the leverage I needed to force him to move out (and I did all the legwork to replace him on the lease, etc.)\n\nIn any case, I'm wondering what I should do. I'm obviously still very vulnerable to him, given he is senior to me in my field and we share a lot of social/professional circles but the idea that he could get tenure and then will come out with a book (espousing politics that are entirely counter to his personal behavior) and be celebrated for it given his actions is abhorrent to me.\n\nAny advice?",
  "author": "OkVermicelli6616",
  "created": 1632592603,
  "updated": 1634078850,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.8,
  "comments": {
    "heb2wtd": {
      "link": "/r/AskAcademia/comments/pvc10b/what_should_i_do_about_abusive_faculty/heb2wtd/",
      "text": "This is absolutely awful, and I just want to say that no one deserves this treatment and I'm glad he's no longer in your house.\n\nI would suggest you contact student support services, or perhaps whatever advocacy/union organisation there may be at your school. They might be able to advise you on what your options are. I absolutely agree that this person needs to be stopped before he does more harm.\n\nGood luck with your studies and I hope you are able to find support!",
      "author": "DisastrousLetterhead",
      "created": 1632629868,
      "upvotes": 4,
      "replies": {
        "heb4qrv": {
          "link": "/r/AskAcademia/comments/pvc10b/what_should_i_do_about_abusive_faculty/heb4qrv/",
          "text": "Thanks for your support, I can't go to any campus authorities since it's not campus related unfortunately...",
          "author": "OkVermicelli6616",
          "created": 1632630869,
          "upvotes": 1,
          "replies": {
            "heg04n9": {
              "link": "/r/AskAcademia/comments/pvc10b/what_should_i_do_about_abusive_faculty/heg04n9/",
              "text": "I don't think this is correct. A professor who moved into a house with a student is already a big old red flag that the university should be acting on, the harassment and abuse takes it to the next level. It doesn't matter that it happened off campus, a professor is abusing a student and the university is supposed to act on that. I would look into reporting it.",
              "author": "ACatGod",
              "created": 1632724134,
              "upvotes": 5,
              "replies": {
                "heg2qsb": {
                  "link": "/r/AskAcademia/comments/pvc10b/what_should_i_do_about_abusive_faculty/heg2qsb/",
                  "text": "Sorry it wasn't clear from what I wrote: we're at different institutions now but he is an alum of my current department",
                  "author": "OkVermicelli6616",
                  "created": 1632726165,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "heb4x5r": {
              "link": "/r/AskAcademia/comments/pvc10b/what_should_i_do_about_abusive_faculty/heb4x5r/",
              "text": "Is there no general student support to give you advice? Depending on your relationship with your supervisors they also might be able to suggest something to do.",
              "author": "DisastrousLetterhead",
              "created": 1632630968,
              "upvotes": 2,
              "replies": {
                "hed17mb": {
                  "link": "/r/AskAcademia/comments/pvc10b/what_should_i_do_about_abusive_faculty/hed17mb/",
                  "text": "I did actually end up telling my advisor and he informed my committee since they all know the abuser in question. They were very sympathetic and he offered to pay for a motel so I could escape since I was literally barricaded in my room at the time. But that's about as far as they went. After I got him to move out, then it was considered \"resolved\"",
                  "author": "OkVermicelli6616",
                  "created": 1632673114,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hec5yiy": {
      "link": "/r/AskAcademia/comments/pvc10b/what_should_i_do_about_abusive_faculty/hec5yiy/",
      "text": "You in psych field? Or humanities?",
      "author": "DesertAlpine",
      "created": 1632658274,
      "upvotes": 1,
      "replies": {
        "hed183p": {
          "link": "/r/AskAcademia/comments/pvc10b/what_should_i_do_about_abusive_faculty/hed183p/",
          "text": "Humanities",
          "author": "OkVermicelli6616",
          "created": 1632673120,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}