{
  "sid": "buzhu3",
  "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/",
  "title:": "My father passed away during the last year of my PhD abroad, how to keep my motivation up and make it through to the end?",
  "text": "The title says it all, really. I admittedly came here to vent a little bit, but mainly to look for some advice, either from anyone who has gone through something similar or from those with general advice for getting through really rough times during a PhD.\n\nA little bit more about me and my situation:\n\nI am doing a PhD abroad, several thousands of kilometers from home, and my deadline to defend my thesis is in less than six months from now. My father passed away a few months ago and, though he had been ill for some time, it was rather unexpected. I quickly flew home and stayed for a few weeks before coming back to work. Since I've been back at work, I've been a complete mess and my motivation has just been hanging by a thread. I am constantly homesick and still grieving a lot. I can become very emotional at unpredictable times. It's very hard to concentrate. Additionally, I'm feeling more isolated than ever, as many friends have moved away recently and I don't speak my host country's language very well.\n\nWhile I would like to take a break (technically possible for up to one year, I believe), it would be complicated. For one, it would involve a visa extension, which would be tricky and expensive. I'm on a tight budget, especially after flying home on a moment's notice those few months ago, so I can't really spend a lot in general, let alone visa fees or extra airfare right now. Lastly, my mum is strongly encouraging me to stay and finish since I am so close to the end. She wants to see me finish my dream and she's worried that something could get in the way of me finishing if I were to take a break. I agree with her and finishing on time is probably my best option.\n\nOverall I've been very content with how my PhD has gone and I'm not behind schedule, even after taking almost a whole month away from work. Before my father passed away, I was already feeling a bit of the normal stress and pressure of a PhD student in their final year, but I was extremely motivated and I could handle virtually anything that came at me. But now I just feel so different... like I am suffocating. Dreading the next day, the next task, the next meeting, etc. Each day I feel the motivation draining away more and more and the growing feeling that an inevitable burnout is coming.\n\nHow can I survive or maybe even try to thrive during these last months? How can I find my motivation again? What are some ways to handle the grief and intense homesickness at the same time as the PhD? For anyone who has faced similar circumstances to any of the above, what helped you the most?\n\nThanks for any and all advice :)",
  "author": "cheeseballsmile",
  "created": 1559255391,
  "updated": 1634081880,
  "over_18": false,
  "upvotes": 111,
  "upvote_ratio": 0.98,
  "comments": {
    "epjq64k": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epjq64k/",
      "text": "Try talking to someone before making a decision. You don't have to fight the emotion in order to push through your degree - the degree is tough enough on its own. Your university must have grief counselors and therapists as part of their health services. Talk to them, or someone you are close to. It will likely take multiple sessions but it is worth it. They will help with what is causing the dread. All the best; you can get through this :)",
      "author": "Busta-Reims",
      "created": 1559257645,
      "upvotes": 26,
      "replies": {}
    },
    "epjybg2": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epjybg2/",
      "text": "A couple of things. First, it sucks losing your father and will continue to suck for a long time. Someone on Reddit said it better: its like being in the ocean during a storm. At first. You can just keep from drowning, but eventually, the waves get smaller and it becomes easier to keep above the waves. What I know is this, eventually, thinking of him will bring a smile to your face, not tears to your eyes. \n\nAs for the motivation, the only thing I can suggest is don't quit now. It will be much harder to get back into the swing of things if you take time off (It took me more than a decade to get motivated to finish my degree). I'm also willing to bet that your father would not have wanted to be the cause of you not finishing your degree. Mine was thrilled when he found out I was going back to finish before he died. Push thru that degree and share the diploma with him when you visit his grave.",
      "author": "davesoverhere",
      "created": 1559263123,
      "upvotes": 23,
      "replies": {}
    },
    "epk0rjo": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epk0rjo/",
      "text": "There is a PhD student who was public about the death of his father during his PhD studies. He is fully bilingual and ,similarly to you, was studying abroad. He is currently an Assistant Professor at Yale. On page 11 of his PhD thesis you can read his words about his father.\nhttps://cloudfront.escholarship.org/dist/prd/content/qt8jv7m3x0/qt8jv7m3x0.pdf?t=pdo223",
      "author": "4e5r6t7y8u9i0o",
      "created": 1559264966,
      "upvotes": 14,
      "replies": {}
    },
    "epk67ls": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epk67ls/",
      "text": "I am studying abroad as well and my father passed away last year (in my 2nd year of phd). I would say that my father was one of the reasons why I chose to pursue my Phd. I used to discuss these things with my father about how to make the next move (my career and stuff, since he was slightly related to my field). After he passed away I didn't know what I was doing and for whom? Why was I in a foreign land with no friends and family? Is my life even worth it anymore?\n\nWhile I am still in a similar situation as you are, in the end, these thoughts don't matter. What I did was to make list of the things that I can do right now? Griefing all day won't help me move forward in my life. I started making small objectives to do in a day. Maybe write an abstract or just a line of my paper. \n\nAlso, get someone to talk to. Your supervisor or co-worker or other friends not just about your work but your life in general. I don't know if any of these make sense since I am in the same boat as you are in and still trying to figure out who I am.\n\nEdit: a word",
      "author": "K4k4shi",
      "created": 1559268519,
      "upvotes": 10,
      "replies": {}
    },
    "epk9sux": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epk9sux/",
      "text": "See a counselor. If they suck, see another counselor. If they suck. See another counselor. \n\nReddit is great, but you know what’s really great? Someone who spent their whole career learning exactly how to help you through this. \n\nFrom a fellow PhD student who has ridden the ups and downs: I believe in you. Best of luck.",
      "author": "strumberries",
      "created": 1559270728,
      "upvotes": 9,
      "replies": {}
    },
    "epjyla8": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epjyla8/",
      "text": "I went through something kind of similar. I went back to school to finish my undergraduate degree and my father passed away. I had just started at a new school and didn't know anyone there. Honestly it was really hard to not quit. I just graduated a few weeks ago, and I'm so glad I finished and I know that he would he so proud of me. When he passed, I found a therapist and that was really helpful for me. I'm so sorry for your loss, if you want to talk feel free to DM me.",
      "author": "vannuys",
      "created": 1559263328,
      "upvotes": 6,
      "replies": {}
    },
    "epjz2pz": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epjz2pz/",
      "text": "Hey. Sorry for your loss. I can't begin to imagine what you are going through. I just wanted to motivate you to push forward and try and end it, surely your father would be very proud of that.\n\nAlso, talk to your supervisor/PI. Make sure he helps you. You are very brave, and you can do it!",
      "author": "Sonic_Pavilion",
      "created": 1559263700,
      "upvotes": 3,
      "replies": {}
    },
    "epk74zq": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epk74zq/",
      "text": "I am so sorry for your loss. My best piece of advice is to get yourself to therapy - my husband passed away halfway through my PhD and I was a complete mess. Having a good therapist was extremely important to helping me develop strategies to just get through the slog. I was also not progressing as fast as I wanted in my PhD and my lab turned incredibly toxic in my last two years, I got through this and you can, too. \n\nPeople in my cohort also had a really tough time empathizing with my loss and I empathize with the isolation you’re feeling. Often they don’t know what to say and then say nothing. It sucks. \n\nHappy to chat more, but resource all you can with your university, too and explore your options.",
      "author": "FluorescentBug",
      "created": 1559269094,
      "upvotes": 3,
      "replies": {}
    },
    "epjyt1e": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epjyt1e/",
      "text": "I’m very sorry for your loss. If you don’t exercise already, you might want start jogging in the morning? It will help with your mood and keep you motivated. Good luck and take care.",
      "author": "reb_chen",
      "created": 1559263495,
      "upvotes": 2,
      "replies": {}
    },
    "epkoqnk": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epkoqnk/",
      "text": "My father died the week I had the interview for a phd-position. He never found out, that I got it nor that I finished it. I know that my father would have been extremely happy and proud.",
      "author": "Krisselak",
      "created": 1559278224,
      "upvotes": 2,
      "replies": {}
    },
    "epl6j4p": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epl6j4p/",
      "text": "My dad died during me writing my master's dissertation. I buried myself in my work. Work-wise I got it all done and got a top mark. Emotionally, it just kept a lot of stuff deep down that eventually needed dealing with.\n\nIf this will be useful for you depends on you. I think you should definitely take a break from your PhD, even if it's just for a couple of weeks. It would allow you to begin dealing with it enough so that you can continue working well.",
      "author": "johu999",
      "created": 1559288572,
      "upvotes": 2,
      "replies": {}
    },
    "epjqt4z": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epjqt4z/",
      "text": "Talk to people about it. Don’t let it just sit in you.",
      "author": "TheIndividualChef",
      "created": 1559258122,
      "upvotes": 1,
      "replies": {}
    },
    "epjy4o4": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epjy4o4/",
      "text": "You might get better and more feedback on /r/gradschool!",
      "author": "valryuu",
      "created": 1559262979,
      "upvotes": 1,
      "replies": {}
    },
    "epkifc4": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epkifc4/",
      "text": "Do it for your dad",
      "author": "lednakashim",
      "created": 1559274933,
      "upvotes": 1,
      "replies": {}
    },
    "epkkhad": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epkkhad/",
      "text": "My heart aches for you. I lost my dad right after I graduated, while I was job searching. I, too, was dreading the next application, next rejection, next ghosting by a recruiter. But what really motivated me was well-meaning family members and family friends asking if I was going to drop everything and move back home with my mom. I love her, but damn it all I didn’t go through all of that phd crap just to move home. So for me, it was finding something to be a little spiteful about to kick my butt into gear. \n\nI hope that you have a support network where you are. Find a therapist or grief counselor if you need one. Do things that make you happy. It’s ok to feel sad. I still dread dad-specific holidays and I still cry sometimes.  But we have to keep going.",
      "author": "needlefish",
      "created": 1559275923,
      "upvotes": 1,
      "replies": {}
    },
    "epl6alt": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epl6alt/",
      "text": "Sorry for your loss :( \nI'm wondering if maybe you could write up at home? I know quite a few students who do this when they are writing up and it works quite well for them.",
      "author": "dogleish23",
      "created": 1559288415,
      "upvotes": 1,
      "replies": {}
    },
    "eplrba5": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/eplrba5/",
      "text": "My condolences to you on your father’s death. You’ve already got a full plate, so something has got to give here. I’ll suggest that it’s the thesis itself because it’s the most idiosyncratic thing you’ve got going on. If you were in good shape before, maybe just shoot for “adequate shape” these days. What would it look like if you dialed back the thesis effort 10%? 20%? What would it take to be passable without being perfect? Shave 10 hours a week off that you would normally devote to the thesis and take care of yourself. Find a therapist, go to the gym, read books and blogs about grief, whatever might help you grieve. I’ve been on enough dissertation committees to know that there’s a broad range in quality, but none that have been so bad that they disqualified a student.",
      "author": "croak_monsieur",
      "created": 1559301862,
      "upvotes": 1,
      "replies": {}
    },
    "epltdef": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epltdef/",
      "text": "You should seek for a therapist' help online, a therapist from your home country who can work with you online (on skype for example) or in your host country.\n\nI believe you will get through this, wish you the best.",
      "author": "asoww",
      "created": 1559303116,
      "upvotes": 1,
      "replies": {}
    },
    "epk0q38": {
      "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/epk0q38/",
      "text": "I am sorry, but let me try to motivate you by harsh truth: You now have one less family member to rely on if you find yourself in financial or other difficulties. So do your mom and siblings etc. Thus it is now even more important that you finish your PhD within your funding duration - and finish it well - so that you have higher chances to get a good job (academic or not) and keep fully supporting yourself (and if needed others). \\[My parents are alive. But my grandparents used to be my primary caretakers for most of my childhood, and my grandpa died a few months before the end of my thesis MSc, and this is how I looked at the situation. Obviously I finished, and started my PhD immediately.\\]\n\nAnd, if you have an option to get grief counseling through your school or health insurance (in English or another language you are fluent in), try that. \\[It wasn't available to me at the time. But now my school actually makes it pretty much mandatory for students who lose someone so close.\\] Your problem is obviously grief - which is very normal in your situation - and not your PhD.",
      "author": "AstraGlacialia",
      "created": 1559264937,
      "upvotes": -1,
      "replies": {
        "eplartx": {
          "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/eplartx/",
          "text": "[deleted]",
          "author": null,
          "created": 1559291415,
          "upvotes": 2,
          "replies": {
            "eplk67u": {
              "link": "/r/AskAcademia/comments/buzhu3/my_father_passed_away_during_the_last_year_of_my/eplk67u/",
              "text": "Thanks. Yes, also that, and also the OP is likely to feel even more isolated if they take a break for a year and then when they come back there will be even less people they knew (because even more students and postdocs will graduate / move on in the meantime), unless their advisor just happens to hire some people with whom the OP can communicate and get along better. (I am also in a country where I don't speak the language fluently enough to not be a burden in social situations, despite 3-4 years of learning.)",
              "author": "AstraGlacialia",
              "created": 1559297600,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}