{
  "sid": "q9k7pn",
  "link": "/r/AskAcademia/comments/q9k7pn/theory_across_the_humanities_and_social_sciences/",
  "title:": "Theory across the humanities and social sciences",
  "text": "So I'm an interdisciplinary academic and do a fair amount of theory.  It seems to me that \"theory\" is a topic that goes across the humanities and the social sciences (political theorists, literary theorists, social theorists, gender theorists, and some kinds of philosophy).  They seem to use a lot of the same sources (Foucault, Habermas, Butler, etc.) but they seem to both do very different things with them and also seem to be institutionally distinct.  \n\nBy unusual circumstances I was asked to be a part of a theory workshop that is from a different field and it felt... different.  Like we were speaking the same language but with very different dialects.  I think they thought some of my interpretations were kinda weird.\n\nIs that the experience of other theory people?  If you do theory in your field, do you interact with theorists in other parts of the academia?  Either in terms of reading their work, writing together, or going to the same conferences?",
  "author": "Remansilent",
  "created": 1634417080,
  "updated": 1634580509,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgwt3bv": {
      "link": "/r/AskAcademia/comments/q9k7pn/theory_across_the_humanities_and_social_sciences/hgwt3bv/",
      "text": "Always struck me that there's a great advantage to, like you, taking a cross disciplinary perspective regarding theory... Taking insights from one place to the other. But I suppose it needs to be done carefully, cognisant of each disciplines mores and epistemological biases. None of this is any help to your question tho ... !",
      "author": "dbrq",
      "created": 1634421703,
      "upvotes": 2,
      "replies": {
        "hgyuxgi": {
          "link": "/r/AskAcademia/comments/q9k7pn/theory_across_the_humanities_and_social_sciences/hgyuxgi/",
          "text": "I was about to post the same. The most profound insights in my experience come from theoretical cross-pollination over disciplinary borders. Something that is beginner's level stuff can do wonders when it is applied in a bordering field.",
          "author": "molobodd",
          "created": 1634464824,
          "upvotes": 2,
          "replies": {
            "hh1hsou": {
              "link": "/r/AskAcademia/comments/q9k7pn/theory_across_the_humanities_and_social_sciences/hh1hsou/",
              "text": "Absolutely! Look at Wendt trawling first year sociology textbooks and parlaying that into a generational impact on IR theory. Chapeau...",
              "author": "dbrq",
              "created": 1634510542,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgwq8yt": {
      "link": "/r/AskAcademia/comments/q9k7pn/theory_across_the_humanities_and_social_sciences/hgwq8yt/",
      "text": "Short answer: Yes.",
      "author": "molobodd",
      "created": 1634420415,
      "upvotes": 1,
      "replies": {}
    },
    "hgwn4lz": {
      "link": "/r/AskAcademia/comments/q9k7pn/theory_across_the_humanities_and_social_sciences/hgwn4lz/",
      "text": "They seem to be overtures of sophistry with a hint of pyramid scheming. Science isn't plural, imo",
      "author": "Grouchy-Ad1976",
      "created": 1634419009,
      "upvotes": -1,
      "replies": {
        "hgwue7c": {
          "link": "/r/AskAcademia/comments/q9k7pn/theory_across_the_humanities_and_social_sciences/hgwue7c/",
          "text": "Username checks out.",
          "author": "Weak_Lifeguard_5000",
          "created": 1634422300,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}