{
  "sid": "p32cax",
  "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/",
  "title:": "Interesting article ( actually topic for an article) but awful structure/poorly written: what to do as a peer reviewer? Medical journal",
  "text": "So I was invited to peer review an article, it is an original research article in a journal, but I do not know what to do. The whole structure is SO poor. They use the same paragraph from the abstract in the actual article body for some sections instead of writting a proper section. There are more references than real content in terms of pages. It is a disaster, however, the topic is clinically relevant and the method is valid/not as poor as the structure.\n\nShould I try my best and suggest structual changes in their paper? Even if it will look like I am working harder as a reviewer than they did as the writers? Or should I just reject the paper and suggest they re-structure it and resubmit? I am new to peer-reviewing and I would like some advice- what would you do in my position and why?",
  "author": "Medicaltangerine9296",
  "created": 1628782663,
  "updated": 1634079762,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.94,
  "comments": {
    "h8o4tcf": {
      "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8o4tcf/",
      "text": "Say what you said here (but fancy) to the editor, they can then decide.",
      "author": "PristineAnt9",
      "created": 1628784846,
      "upvotes": 22,
      "replies": {
        "h8qaah2": {
          "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8qaah2/",
          "text": "I agree. It would provide exactly what's wrong with the work they submitted and why. It hints at how they should fix the issue and ways to go about it without telling them exactly what to do, as they should be able to critically think for themselves or have the assignment rejected all together.",
          "author": "ThirdIRoa",
          "created": 1628817966,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h8o4uo8": {
      "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8o4uo8/",
      "text": "If relevant and timely with appropriate methods, I would ask for a major R&R letting them know it is structurally poor and will take *major* revisions for publication. Then list the most serious offenses with the caveat that they are not the only issues. Let them know their methods are appropriate so they do not try to revise the saving grace of the paper. Essentially, tell them what you told us, but be a little more specific. I would also be gentle, as surely Reviewer 2 isn’t asking us here :). I review for a different field entirely, however, so this may not be relevant.",
      "author": "biglybiglytremendous",
      "created": 1628784861,
      "upvotes": 17,
      "replies": {
        "h8okxi3": {
          "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8okxi3/",
          "text": "Agreed, but not R&R - that keeps it \"in the process\". It should be a rejection, with an invitation to submit a new manuscript (and start an entirely new review process) if it can be substantially improved. \n\nIt's actually not the same.",
          "author": "ThePhysicistIsIn",
          "created": 1628791276,
          "upvotes": 5,
          "replies": {
            "h8ompj6": {
              "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8ompj6/",
              "text": "No, it’s not the same, but I would personally ask for R&R pending major revisions for a re-review to see whether my suggestions were met and content reframed with original contributions rather than references. Once the review process stops with a rejection, the article (usually) gets an entirely new review panel, which, yes, is the entire point of peer review… but we all know how slammed people are, and I’m not sure someone would be willing to review an article this much a mess with constructive criticism if it was that poorly written. I honestly think some reviewers stop reading after the first page if it reeks of junior scholarship—when these are the very articles that need attention so the researcher can learn the ropes and contribute to scholarship. OP seems like they want to help without doing the brunt of the work, which makes sense to me for R&R.",
              "author": "biglybiglytremendous",
              "created": 1628791994,
              "upvotes": 2,
              "replies": {
                "h8omvpg": {
                  "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8omvpg/",
                  "text": "That’s precisely why I would move to reject. Fresh eyes should re-evaluate the article once it’s been completely revamped.",
                  "author": "ThePhysicistIsIn",
                  "created": 1628792065,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h8omjrw": {
      "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8omjrw/",
      "text": "If it would functionally have to be a new paper to satisfy your concerns, reject it.",
      "author": "smapdiagesix",
      "created": 1628791928,
      "upvotes": 2,
      "replies": {}
    },
    "h8ropv5": {
      "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8ropv5/",
      "text": "I am an Editor.  What you are saying is fine as part of a review.  Say pretty much what you have said here, highlight things like the repeated paragraph/s.  Point out any technical failings as well.\n\nRecommend revision (or major revision), and let the editor decide.  Remember - you recommend, the editor decides.  Let them work out whether the article is salvageable or not.  And thank you for taking the review on, and being serious about it.",
      "author": "Life_time_learner",
      "created": 1628851196,
      "upvotes": 2,
      "replies": {}
    },
    "h8ws6as": {
      "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8ws6as/",
      "text": "Textual revisions should be what people are hoping for, so don't feel bad asking for them.  Be as specific as you feel you can be without doing more work than you are comfortable with.  Be positive!  This work is good, what needs to happen for it to be accessible to the journal audience is clearer presentation.  Then give as much specifics as you can.  If they thought this was worth submitting, they may not be good enough at writing to interpret \"its bad\".  If you tell someone who wrote a bad paper that its bad, you haven't really added to the work.  Tell them (at least some of) what is bad with examples.    \n\n\nYour job as a reviewer is to identify the steps forward that will make it publishable, not just to identify the reason it is not publishable.  Too many reviewers think their job is the latter.",
      "author": "parrotwouldntvoom",
      "created": 1628949069,
      "upvotes": 2,
      "replies": {}
    },
    "h8ohtox": {
      "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8ohtox/",
      "text": "Can you contact the editor and say pretty much what you've said here - they need writing assistance before you can really review?",
      "author": "nezumipi",
      "created": 1628790049,
      "upvotes": 1,
      "replies": {
        "h8oinic": {
          "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8oinic/",
          "text": "Yes- I will put my post in nicer words and send the editor (but also to the author as I have to give author feedback?)",
          "author": "Medicaltangerine9296",
          "created": 1628790379,
          "upvotes": 3,
          "replies": {
            "h8oj06t": {
              "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8oj06t/",
              "text": "No, I mean contact the editor directly. Editors will sometimes send papers back to authors with instructions to improve the writing. Sometimes it happens because none of the authors speak fluent English and the paper just needs editing. The editor has to be notified that this is an issue before they can act, though.",
              "author": "nezumipi",
              "created": 1628790520,
              "upvotes": 3,
              "replies": {
                "h8vnfuw": {
                  "link": "/r/AskAcademia/comments/p32cax/interesting_article_actually_topic_for_an_article/h8vnfuw/",
                  "text": "Honestly, this is not great.  If I have sent the manuscript to two reviewers, and one says it should be edited/re-written before providing a review - what am I going to do?\n\nTell the other reviewer they have been wasting their time?  Withdraw it?\n\nReviewers can get REALLY sensitive if they think they are being jerked around (rightly).  \n\nOP needs to put his comments in his review - and leave it to the Editor.  Who knows, maybe the other reviewer will think its brilliant and well structured.  That is why we get multiple reviews - and that is why the Editor and not the reviewer make the final decision.",
                  "author": "Life_time_learner",
                  "created": 1628918886,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}