{
  "sid": "r7a9fu",
  "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/",
  "title:": "Paper rejected from journal - next steps",
  "text": "Hello AA community, \n\nI woke up this morning to a rejection letter from a journal I submitted my manuscript to. I submitted this paper about 3-4 months ago, so I was genuinely expecting acceptance with minor or major revisions. I'm in a pretty niche field (between sociology and environmental science) and I felt that the journal in question was the perfect place for my paper. They've actually accepted very similar research papers before, so the rejection was super surprising for me.\n\nNow, this is my first ever submission to a journal - so I wouldn't have been surprised with major revisions. What has surprised me, is that the rejection letter seemed to indicate that they felt the paper wasn't suitable for the journal. The editor said (I'm paraphrasing) \"the reviewers feel this paper is not suitable for publication in \\[this journal\\] and I agree, so we are rejecting the submission at this time\". \n\nThey then gave me the feedback from the reviewers, which I largely agree with, and can see their points—effectively they said the paper needs work and isn't ready for academic publication, although the research does offer a useful contribution to the field. Still, it sounds like the outright rejection was on the basis of the article not being appropriate for the specific journal; which I don't believe to be the case. \n\nMy question is this: Should I write to the editor, thank them for their time, let them know I will be applying the recommended changes, and ask if I can resubmit once these changes have been applied? Or should I accept the rejection, still make the changes, and find another journal to submit to? I don't want to waste anyone's time or annoy the editors/reviewers if it's inappropriate to resubmit to the same journal. What is the etiquette here?\n\nThanks in advance :-)",
  "author": "_LatsyrhC_",
  "created": 1638459902,
  "updated": 1638479806,
  "over_18": false,
  "upvotes": 25,
  "upvote_ratio": 0.93,
  "comments": {
    "hmxzgdb": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmxzgdb/",
      "text": "I would move on to another journal. If there were some good ref comments, it’s unlikely that the reviewers are trying to block publication. In my field, it’s rare to see an argument with an editor working out in your favor. \n\nNow, reading that, it doesn’t read to me that they felt like it wasn’t a fit for the journal itself. It reads like the paper needs some substantial work. That’s fine; that happens all the time to me. Adopt the changes, improve the paper, and find a similarly ranked journal.\n\nIf editors are real good, they may specify alternative outlets they feel are more suitable.",
      "author": "EconomistPunter",
      "created": 1638460352,
      "upvotes": 58,
      "replies": {}
    },
    "hmxzwjq": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmxzwjq/",
      "text": "Rejection after review is almost surely because of the reviewers' decision, regardless on whether the topic of your paper suits their journal or not. If it does not suit the journal, it will be rejected without review to begin with (desk rejection).\n\nMost journal usually do not reconsider resubmission. If they do, they will surely mention it in their rejection. I think it's better if you submit to another similar journal. Make sure to include the comments provided by the reviewers before submitting to other journal. There is a chance that you will get the same reviewer (especially if it is a niche field) and they will not like it if you don't consider their comments.\n\nAlso, a word of encouragement, keep in mind that paper rejection is the norm. We just don't see it because there is no public record on paper rejection. You will be surprised at the number of times a paper that you have cited actually got rejected before published.\n\nGood luck!",
      "author": "MarkZelVitch",
      "created": 1638460534,
      "upvotes": 35,
      "replies": {}
    },
    "hmy0l4p": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmy0l4p/",
      "text": "Sorry about the rejection. Probably doesn't make you feel better, but it happens to all of us, **a lot.**\n\n>\"the reviewers feel this paper is not suitable for publication in \\[this journal\\] and I agree, so we are rejecting the submission at this time\"\n\nThis is kind of a generic phrase that just means \"I'm rejecting it\". It could be because the perceive the paper to not be in the scope of the journal (though I would expect them to say explicitly elsewhere), or it could be that they think there are fundamental flaws in the logic/results/conclusions.\n\nThere is sometimes some ambiguity with whether a rejection is \"not this version\" or a \"no, never\". Ideally the editor would make it clear if the door was still open \"e.g. I am rejecting this version, but I am willing to consider a revision that addresses the reviewer's comments as a new submission\". It's worth asking a co-author (if you have any) or experienced colleague to read the rejection letter and see what they think. If it's unclear to everyone, then there's no harm in reaching out to the editor to clarify whether they would consider a re-submission.\n\nIt's also possible to appeal a decision, but ideally you should have a good ground for it (e.g. a reviewer got the wrong end of the stick, that you have data on something that was thought to be missing, that you can explain why a concern raised by reviewers isn't a problem etc.). If it reads like the reviewers and the editors have clearly understood everything then you're on shaky ground with an appeal.",
      "author": "Flemon45",
      "created": 1638460810,
      "upvotes": 19,
      "replies": {}
    },
    "hmy2smu": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmy2smu/",
      "text": "Your first ever rejection - have a drink!  Assuming you stay in academia, you'll have plenty of rejections (and hopefully many accepted papers) in your future.  \n\nRemember that reviewers are not specific to a journal, so even if a journal seems to be a good fit for your manuscript, you may still get rejected if the reviewers just don't like your paper.  It's ok, it happens, and it'll happen plenty of times in the future.  Don't take it personally, just move on and submit to the next journal (if you think the reviewer comments are helpful, you could make some appropriate changes first).",
      "author": "type_II_error",
      "created": 1638461696,
      "upvotes": 10,
      "replies": {}
    },
    "hmy1w7o": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmy1w7o/",
      "text": "Don't contact them. A rejection sucks, but it is part of the game.",
      "author": "molobodd",
      "created": 1638461334,
      "upvotes": 6,
      "replies": {}
    },
    "hmyb1rz": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmyb1rz/",
      "text": "Revise the paper based on reviewer comments and resubmit to a different journal. \n\nYour paper was rejected by peer-reviewers because it needs work. Rejection is a large part of the game. Get used to it, and keep moving. Everyone gets rejections.\n\nGood luck!",
      "author": "gggggggggggfff",
      "created": 1638464880,
      "upvotes": 7,
      "replies": {}
    },
    "hmy2xn0": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmy2xn0/",
      "text": "My first paper got rejected too and I felt the same way... fast-forward several years later and if I read the submitted manuscript now as an editor/reviewer I would reject it too.\n\nBest course of action is to target the weaknesses outlined in the reviewer's report and submit it elsewhere. Research is rarely (or never) so niche that only one decent journal is suitable.",
      "author": "tomatessechees",
      "created": 1638461750,
      "upvotes": 6,
      "replies": {}
    },
    "hmy3x7r": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmy3x7r/",
      "text": "Unless your rejection said \"revise and resubmit\", you should make edits with the consideration of the comments you received from reviewers and submit to a different journal. (Talk to your advisor/PI about what makes sense in terms of next steps.)",
      "author": "intangiblemango",
      "created": 1638462135,
      "upvotes": 4,
      "replies": {}
    },
    "hmyhnk1": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmyhnk1/",
      "text": "That's kinda just the phrase they say. It's the journal version of \"we'll keep your resume on file\". \n\nAlso, this was still a win for you! You didn't get desk rejected, and now have input from three other people in your field on how to improve your manuscript! Take whatever suggestions they offered that you agree with and move on to the next journal!",
      "author": "Pr0gr3s",
      "created": 1638467406,
      "upvotes": 3,
      "replies": {}
    },
    "hmy1wxq": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmy1wxq/",
      "text": "You should not write to the editor and argue the decision. They decided and it is done. You will achieve nothing aside from wasting your time and theirs, and potentially pissing them off.\n\nWhat you should do is take in the feedback and revise the paper accordingly. If you find along the way that you have revised the paper so significantly that it has evolved even more than they suggested in ways that you feel make it more appropriate for the journal, you could contact the editor, explain how it has evolved, and ask if resubmission might make sense. At that time you can point out the similarity between your article and others they have published. Just be careful to avoid appearing to argue the previous decision (which, as I said, is a closed matter).\n\nBut your best bet is going to be to find a different venue for it. Once they have rejected a paper, unless you have a \\*very\\* strong argument for why they should reconsider--and following the reviewers recommendations is not nearly enough--most editors will not do so.\n\nJust be aware that rejections is the norm and it often takes several submissions before an article is accepted, especially with one is getting started. Don't get discouraged.",
      "author": "bigrottentuna",
      "created": 1638461342,
      "upvotes": 5,
      "replies": {}
    },
    "hmy1rsn": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmy1rsn/",
      "text": "Most journals allow authors to appeal editorial decisions, which generally has a very low rate of success.\n\nIn your case, the best course of action is most likely to resubmit to a different (lower-impact) journal.",
      "author": "Hapankaali",
      "created": 1638461285,
      "upvotes": 2,
      "replies": {}
    },
    "hmy60x0": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmy60x0/",
      "text": "It might sound callous to say \"Get used to it\".\n\nBut get used to it; this is the rule, not the exception. Read the reviewers' criticisms, and see if there is any substance there. In the very unlikely case that the bulk of their comments are orthogonal to reality, then you should contact the editor to let them know that there are bad reviewers.\n\nAddress what is addressable and move on to the next journal.",
      "author": "jxj24",
      "created": 1638462961,
      "upvotes": 2,
      "replies": {}
    },
    "hmyaj2o": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmyaj2o/",
      "text": "Are you me? I had a very similar experience earlier this year, and am also working in a pretty niche field that, in broad terms, deals with the intersection of environment and sociology.\nPaper was rejected after a few months, but got rather constructive feedback that I largely agreed with. In retrospect, the paper definitely still needed some work. I took a month to incorporate reviewer comments and make sure that I was happy with the paper myself again, then submitted it to another journal, where it is now under review.\nConsider talking to your advisor (if applicable) if you are unsure which alternative journal would be suitable.\n\nAs far as first rejection experiences go,  I think we got pretty lucky. There will be harsher rejections, without helpful (and justified) reviewer comments, but at least now we're past that very first time. Bring on all the other rejections.",
      "author": "Lelislazuli",
      "created": 1638464683,
      "upvotes": 1,
      "replies": {}
    },
    "hmyfang": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmyfang/",
      "text": "Appeals are exceedingly rare.  I’d just move on to another journal.",
      "author": "Decisionsota",
      "created": 1638466500,
      "upvotes": 1,
      "replies": {}
    },
    "hmyggj4": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmyggj4/",
      "text": "`They then gave me the feedback from the reviewers, which I largely agree with, and can see their points—effectively they said the paper needs work and isn't ready for academic publication, although the research does offer a useful contribution to the field.`\n\nJust because the research is good doesnt make it publishable; you gotta sell your product/results.\n\nThey rejected your submission. Make those changes and find another journal.",
      "author": "CptSmarty",
      "created": 1638466950,
      "upvotes": 1,
      "replies": {}
    },
    "hmz2hca": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmz2hca/",
      "text": "Some journals in my field (engineering) have started rejecting instead of revisions in order to game the stats. It allows them to pretend they have a higher rejection rate and quicker decision time because the second submission is sent to the same reviewers and is done very quickly. Usually the editor's letter makes it somewhat clear that they would consider a new submission with changes.\n\nIf you really like that journal, you could ask very briefly and politely of they would consider the revised version. But don't appeal or disagree with the review, that's pointless.",
      "author": "wilililil",
      "created": 1638475460,
      "upvotes": 1,
      "replies": {}
    },
    "hmz2jtk": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmz2jtk/",
      "text": "No, move on. An editor is very unlikely to change their mind. Also, you don't have enough experience to interpret all the nuances of the referees' and the editor's comments so you might think there is a chance but in all likelihood the chance is zero.\n\n>  I submitted this paper about 3-4 months ago, so I was genuinely expecting acceptance with minor or major revisions.\n\nThis isn't a thing.",
      "author": "newyorkeric",
      "created": 1638475488,
      "upvotes": 1,
      "replies": {}
    },
    "hmz4pcd": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmz4pcd/",
      "text": "Plenty of great advise already here. Rejections sucks, regardless of their frequency, but they almost always bring a new perspective and insight that will improve your work(I wish I could say always, but sometimes reviewer's feedback is not up to professional standards).\n\nStep away for a week or so from this paper and related work. Comeback re-energized and with a clearer mind to go over each of the comments with your supervisor and co-authors and critically think how they can improve your manuscript. Apply that to your research and take special account into threading a story within the paper (this can be easily forgotten when focusing too much on the comments). Continue refining it, get feedback from colleagues and your supervisors, and find a new place for it once ready.",
      "author": "jucamilomd",
      "created": 1638476327,
      "upvotes": 1,
      "replies": {}
    },
    "hmzayli": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmzayli/",
      "text": "sounds like a revise and resubmit. so revise and resubmit.",
      "author": "tchomptchomp",
      "created": 1638478677,
      "upvotes": 1,
      "replies": {}
    },
    "hmzb6kr": {
      "link": "/r/AskAcademia/comments/r7a9fu/paper_rejected_from_journal_next_steps/hmzb6kr/",
      "text": "While it is common practice by editors to reject, based only on reviewers' reports and not allow authors to reply, I am very much against it. Reviewers/editors are not gold standards, they could be wrong, even in very elementary manners. However, since most of authors are used to this, they probably take this as granted, without thinking whether this is a right thing for editors to do. (Here is an example to show how strange this is. Say, person A violated some laws. Even so, person A still has the right to give a say, not forced to take whatever the judge says. Authors don't even have that minimal civil right. )\n\nBy the way, the OP and commenters here may like to take a bit time to give inputs in this related topic:\n\n&#x200B;\n\n[https://www.reddit.com/r/AskAcademia/comments/r3mpor/what\\_is\\_the\\_common\\_practice\\_of\\_reviewing\\_in\\_your/](https://www.reddit.com/r/AskAcademia/comments/r3mpor/what_is_the_common_practice_of_reviewing_in_your/)",
      "author": "tuyenttoslo",
      "created": 1638478760,
      "upvotes": 1,
      "replies": {}
    }
  }
}