{
  "sid": "qkcnvj",
  "link": "/r/AskAcademia/comments/qkcnvj/when_may_i_use_the_word_authored_vs_coauthored/",
  "title:": "When may I use the word \"authored\" vs \"co-authored\" about a paper?",
  "text": "Hello, academics. \n\nI have been wondering what is the right usage of the word \"authored\" vs \"co-authored\" about a paper I have had published - I am the second author listed on the paper, although I wrote the entire paper myself (boss is first). The research behind the paper has been shared half-half between myself and my boss, and he incepted the original idea, and handed over the rest of the work to me, including all authorship duties, when I joined the company.\n\nGiven that I am listed as second author, would it be inappropriate if I say (in academic situations or on documents) that I \"authored\" this paper, or should I only use \"co-authored\"? I don't want to break any rules of correct conduct or misrepresentation when I return to Western academia. \n\nThank you in advance.",
  "author": "ThatNerdOverThere-",
  "created": 1635768866,
  "updated": 1636169881,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hivjmzg": {
      "link": "/r/AskAcademia/comments/qkcnvj/when_may_i_use_the_word_authored_vs_coauthored/hivjmzg/",
      "text": "You should use 'Co-authored'. I am second author of a number of papers in my early career where the first author, my supervisor, has definitely not even read the paper, let alone at any point contributed to it.  Nonetheless, the matter of authorship is settled, and I would never try to mislead anyone about that. For best practice, you shouldn't either.\n\nAlso, to add: it sounds like your boss had a substantial contribution to the paper even if he didn't write it, and  has appropriately earned first author.",
      "author": "phonograhy",
      "created": 1635769197,
      "upvotes": 4,
      "replies": {
        "hivnhiy": {
          "link": "/r/AskAcademia/comments/qkcnvj/when_may_i_use_the_word_authored_vs_coauthored/hivnhiy/",
          "text": "Thanks! This clarifies it well.",
          "author": "ThatNerdOverThere-",
          "created": 1635771491,
          "upvotes": 1,
          "replies": {}
        },
        "hjgdkp1": {
          "link": "/r/AskAcademia/comments/qkcnvj/when_may_i_use_the_word_authored_vs_coauthored/hjgdkp1/",
          "text": "How do you get over the fact that your supervisor got first author while you got second? Authorship conflicts is such a common issue in academic and I cannot understand how anyone could just sit back and accept it?",
          "author": "chillzxzx",
          "created": 1636140447,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hivs9j7": {
      "link": "/r/AskAcademia/comments/qkcnvj/when_may_i_use_the_word_authored_vs_coauthored/hivs9j7/",
      "text": "if there is more than one author, they are all co-authors, including you. \n\n   \nIf you are the first name listed, you can call yourself the \"first author\", and claim it as a first author publication. In my field (biology), the last author is usually the PI, and the first author is the grad student or postdoc who did most of the actual work. So the first and last author gain the most prestige.",
      "author": "apple-masher",
      "created": 1635774046,
      "upvotes": 2,
      "replies": {}
    },
    "hiy3de8": {
      "link": "/r/AskAcademia/comments/qkcnvj/when_may_i_use_the_word_authored_vs_coauthored/hiy3de8/",
      "text": "I’d say that if you reference just that one paper, and you are second author and not second in a co-first author, then ‘co-author’ is correct, however, if you are referencing multiple papers it is pretty standard to write ‘authored n papers’, ie. not really caring where in the list you. Hence my supervisor is the author of 400+ papers, but obviously not all first or last!",
      "author": "LowCommercial9845",
      "created": 1635809466,
      "upvotes": 2,
      "replies": {}
    },
    "hj46v9o": {
      "link": "/r/AskAcademia/comments/qkcnvj/when_may_i_use_the_word_authored_vs_coauthored/hj46v9o/",
      "text": "I would think that when you use the phrase \"authored\" or \"co-authored\" it would strictly apply to the writing process.\n\nBut, you can say \"I am an author on XY papers\" with no real implication as to the writing process.  However, flip it and \"I am an author of XY papers\", and you would come back to the writing process.\n\nMeh.  Neither looks great.  \"I have XY publications\".",
      "author": "Life_time_learner",
      "created": 1635918973,
      "upvotes": 2,
      "replies": {}
    }
  }
}