{
  "sid": "qp018c",
  "link": "/r/AskAcademia/comments/qp018c/advice_on_how_to_correct_my_behavior_of/",
  "title:": "Advice on how to correct my behavior of interacting with professors in the class, looking for general advice on how to behave in grad school.",
  "text": "Hi all,\n\nA little information on my situation. I was taking three courses this semester. And was really worn down due to the pressure I had on myself due to the amount of homework these courses have been asking us to do. Plus, I am so lonely. I do not have nobody to talk to. Non of the colleagues are my friends and no friends outside of the work as well.\n\nSo, in one of the class the professor thought I was a good students and he thought he could mentor me and will give extra attention to help improve my concepts of that course. I took him for granted and started speaking too much in the class. All the fellow student started resenting me and as now we are at the end of the semester, I think the professors has also started regretting his decision of mentoring me because I spoke too much of big words in the class such as I want to work on developing new methods in the primary research field. So, I think may be my fellow classmates thought that I am belittling their potential by speaking such big things. And some also might think that I am arrogant. But I am not. The reality is that I lack social skills and I am not that much polished, but grad school expects you to behave professionally. Otherwise they will judge you and outcast you.\n\nLong story short, now I think every one hates me because I spoke too much. And I think I spoke in the class as I had no one to talk to outside the class and no one to provide guidance. So, I am looking for guidance on how to behave in general in the grad school so that you do not have to face trouble due to your over spoken-ness in the future. Please provide general tips on how to behave and how to include that type of behavior in your habit.\n\nPlease recommend any book that I can read to get out of this misery. I want to learn social skills and behave in a socially acceptable manner.",
  "author": null,
  "created": 1636325647,
  "updated": 1636654686,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.2,
  "comments": {
    "hjrelqh": {
      "link": "/r/AskAcademia/comments/qp018c/advice_on_how_to_correct_my_behavior_of/hjrelqh/",
      "text": "Not to be a downer, but if you’re talking down to your peers (even without realizing it) and only caring about an adult’s approval, you’re unlikely to have a meaningful grad school OR professional experience.\n\nWe dealt with a very similar situation this past year, and ultimately the person could not handle a leadership position (such as a tutor) or work well in a group setting— all due to the lack of communication skills. \n\nAs much as I want to say joining clubs or sports teams will solve the problems, if you ultimately value a mentor perspective over your peers and don’t know how to communicate with your peers, communication skills won’t get better. Self-help books are great, but I really suggest finding a professional that can help (school therapist, “normal” therapist, really anyone who understands your problem and can provide suggestions and perspectives!)\n\nTLDR: lacking communication skills means limiting your future success. There is no overnight fix, but you can look into finding a therapist, or a similar professional to help. I wish I could offer a book suggestion, but I think the best resources will come from an empathetic professional. \n\nGood luck!",
      "author": "eptesicusfscus",
      "created": 1636341346,
      "upvotes": 8,
      "replies": {
        "hjtot7q": {
          "link": "/r/AskAcademia/comments/qp018c/advice_on_how_to_correct_my_behavior_of/hjtot7q/",
          "text": "I really agree with this. Without wanting to sound harsh, I also think OP needs to stop thinking about themselves. The other students don't hate you, they may find you a bit annoying in class but you're massively over-estimating your importance in their lives. All OP did in this post was talk about themselves, even when acknowledging their behaviour had negative impacts on others it was still about them. \n\nI definitely think coaching or therapy would be the way forward.",
          "author": "ACatGod",
          "created": 1636391342,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjqh742": {
      "link": "/r/AskAcademia/comments/qp018c/advice_on_how_to_correct_my_behavior_of/hjqh742/",
      "text": "Maybe join a club at your college, anything really.. chess or whatever, just to meet people",
      "author": "DeepSeaDarkness",
      "created": 1636325872,
      "upvotes": 7,
      "replies": {
        "hjqjpcz": {
          "link": "/r/AskAcademia/comments/qp018c/advice_on_how_to_correct_my_behavior_of/hjqjpcz/",
          "text": "Any book recommendation on improving my behavior? A self help book that teaches you how to behave in certain types of situations as I believe that most situations can be categorized in few certain type of situations and you can work on those situations to improve your social behavior. But never found any text that describe this problem in this context. \n\nI am really terrible at interpersonal skills. Any help regarding that would also be appreciated.",
          "author": null,
          "created": 1636326987,
          "upvotes": -2,
          "replies": {
            "hjqvxfs": {
              "link": "/r/AskAcademia/comments/qp018c/advice_on_how_to_correct_my_behavior_of/hjqvxfs/",
              "text": "I know this is a children's book, but I have an excellent undergraduate student who is on the spectrum and struggled mightily with social skills prior to college, and she told me that this book enabled her to be successful socially. \n\nhttps://www.karnacbooks.com/product/the-asperkids-secret/34265/",
              "author": "matthewsmugmanager",
              "created": 1636332424,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "hjtzyzw": {
      "link": "/r/AskAcademia/comments/qp018c/advice_on_how_to_correct_my_behavior_of/hjtzyzw/",
      "text": "I suggest that you prove your worth by having publications rather than classroom interactions. Help out your fellow students voluntarily. Rest we cant appease everyone.\n\nJust focus on studying hard and covering your course. Dont worry about others. They wont help you in getting a job after the course.",
      "author": "Strombreaker_1992",
      "created": 1636395839,
      "upvotes": 0,
      "replies": {}
    }
  }
}