{
  "sid": "p6gihd",
  "link": "/r/AskAcademia/comments/p6gihd/literature_reading_strategies_cognitive_fatigue/",
  "title:": "Literature reading strategies (cognitive fatigue)",
  "text": "**Field of research:** Business (Human Resource Management). **Country:** Australia.\n\nI'm currently writing a thesis (this is my first research project), and I've collected most of the data (interviews) and written my literature review. Analysing the data brought about new theories/themes and I need to go back and substantially tweak the review chapter.\n\nThe thought of going back and reading a lot more really discourages me, because, honestly, reading academic literature really tires me out and I don't know why. I sit at my computer, and by the time I've read 3 or 4 papers my brain feels pretty tired... similar to if I sat on my phone for a few hours without a break. This scares me because it seems that I have such a low threshold for cognitive fatigue when it comes to reading - and this just happens to be one of the biggest components of an academic's job. There's just so many articles out there...\n\nDoes anyone here have similar experiences? What can I do to feel energised about reading literature?",
  "author": "childrensparacetamol",
  "created": 1629247484,
  "updated": 1634079566,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.84,
  "comments": {
    "h9czgyy": {
      "link": "/r/AskAcademia/comments/p6gihd/literature_reading_strategies_cognitive_fatigue/h9czgyy/",
      "text": "Feeling tired after reading 3-4 papers is fine. It's normal. Go for a walk and get some coffee. Play Pokemon Go for twenty minutes and then get back into it. You're fine.",
      "author": "wetbogman2",
      "created": 1629250440,
      "upvotes": 11,
      "replies": {
        "h9e03o2": {
          "link": "/r/AskAcademia/comments/p6gihd/literature_reading_strategies_cognitive_fatigue/h9e03o2/",
          "text": "hahaha might I just say don't start to play whatever game on screen .. it's a little hard to \"get away\" especially when (dry) articles are awaiting ..",
          "author": "sunnyseasun",
          "created": 1629275734,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h9d0o5m": {
      "link": "/r/AskAcademia/comments/p6gihd/literature_reading_strategies_cognitive_fatigue/h9d0o5m/",
      "text": "A few things that work for me, that may not work for you, and certainly don't work for everyone, but might be worth a try (sorry if the formatting is weird; I'm on mobile):\n\n1. Pomodoros—essentially sprints for your brain. Requires more intense focus/energy upfront, but you get things done more quickly (minimizing overall time spent reading from screens), and frequent breaks are built in. Look up \"pomodoro technique\" and adjust how you like. Might reduce overall screen fatigue and get you through those papers faster so you can do things you enjoy more.\n\n2. Learn to read faster—same idea as above re: minimizing total time spent on screens and reducing overall fatigue building up throughout the day/week. There are some good strategies discussed on [this blog post](https://pianoer.wordpress.com/2006/02/05/speed-reading-techniques/). Part of it includes adjusting your reading technique to be more \"active\", which may make the reading itself feel more engaging and less like a drag, which may provide a small boost in your energy while doing it. Hopefully. I assume your thesis topic is something that is interesting to you, so reconnecting with that interest/curiosity and making it a focus of the task could help it feel less like a burden.\n\n3. Blue light filtering glasses—why not reduce physical as well as mental strain? Especially if, for you, reading for long periods on screens comes with headaches, sore/tired eyes, etc.\n\n4. Plan your study schedule in advance (in a very general way) so your reading tasks are spread out in between literally everything else you have to do. Read 2 articles, then write an assignment for a different class. Read 2 more articles, then clear out your email inbox. Etc.\n\n5. If you're the type of person who doesn't need your study space to be the same every day, try doing your reading somewhere where your brain can get some stimulus from outside the screen. I like to do my heavy reading outside when the weather's nice, or in a quiet cafe when it's not. I find it helps with the fatigue as well, and makes it an overall more enjoyable task.\n\nGood luck on your thesis!!",
      "author": "femme_de_lettres",
      "created": 1629251047,
      "upvotes": 8,
      "replies": {
        "h9dawzd": {
          "link": "/r/AskAcademia/comments/p6gihd/literature_reading_strategies_cognitive_fatigue/h9dawzd/",
          "text": "I agree on everything!! — Except unfortunately the current research shows no evidence that blue light filtering glasses make a difference, whereas taking frequent eye breaks to look a certain distance away (which works with the pomodoro method) is proven to work. This is coming from someone who paid an embarrassing amount for blue light filtering lenses and immediately after read the literature on whether they are effective… \n\nI think most academics tend to go long periods never looking away from their computer, absorbed in their work, bc they have achieved a flow state. It can take some adjustment to switch to pomodoro, but it does help. For those times when you do have long flow states, just be sure to take extra long breaks, and be mindful that those breaks are restorative to support your work and prevent burn out.",
          "author": "aegiskey",
          "created": 1629256443,
          "upvotes": 5,
          "replies": {
            "h9dcd9r": {
              "link": "/r/AskAcademia/comments/p6gihd/literature_reading_strategies_cognitive_fatigue/h9dcd9r/",
              "text": "That's good to know about the blue light glasses not working! (Though disappointing.) I think I only paid $10 to get the coating added to my prescription lenses. I had thought it helped my headaches, but hey, I'll take a placebo effect if that's all it is :)",
              "author": "femme_de_lettres",
              "created": 1629257268,
              "upvotes": 4,
              "replies": {}
            },
            "h9e06cr": {
              "link": "/r/AskAcademia/comments/p6gihd/literature_reading_strategies_cognitive_fatigue/h9e06cr/",
              "text": "might i also say, that the \"break\" times after the flow state will give the most precious thoughts about what had been done before.",
              "author": "sunnyseasun",
              "created": 1629275807,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h9do8cf": {
          "link": "/r/AskAcademia/comments/p6gihd/literature_reading_strategies_cognitive_fatigue/h9do8cf/",
          "text": "Thank you for putting so much effort into this response. These are great ideas and you've really helped a student out :)",
          "author": "childrensparacetamol",
          "created": 1629265197,
          "upvotes": 3,
          "replies": {
            "h9fdok8": {
              "link": "/r/AskAcademia/comments/p6gihd/literature_reading_strategies_cognitive_fatigue/h9fdok8/",
              "text": "Happy to help! I hope some of the ideas work for you!",
              "author": "femme_de_lettres",
              "created": 1629305304,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h9ehjp2": {
      "link": "/r/AskAcademia/comments/p6gihd/literature_reading_strategies_cognitive_fatigue/h9ehjp2/",
      "text": "I may be a minority here but... 4 years into a PhD (with an Honours thesis before that) in Psychology in Australia and the number of papers I have read start to finish would be <20. Papers are D R Y A F (and I've published). A cognitive fog passed over my brain just thinking about reading them. I absorb nothing when I sit and read them just to read them. My eyes glaze and eyelids droop. I drift listlessly in the ether. \n\nMy perusal of a paper is quick and driven by a need. I'm on a mission. I'm looking for answers to questions (some specific, some broad). I'm ctrl+F'ing. I'm jumping from citation to citation like a bird eating Hansel's breadcrumb trail. I'm drawn to systematic reviews and meta-analyses like a moth to a flame, because those precious authors have done the hard work for us. \n\nWhen my questions are more broad, or I'm skimming one because it appeared in my alerts and is relevant to my work, I'm at risk of snoozing and forgetting everything. So that's when I summarise it out loud, as I go. I doodle and scribble key points and ideas. I tell myself \"that's interesting!\" regardless of how true that is. \n\ntl;dr: reading papers is tedious af but having a specific question/purpose and consuming information in more than one modality (i.e., not just eyeballs) can help.",
      "author": "ravencrawr",
      "created": 1629289878,
      "upvotes": 3,
      "replies": {}
    },
    "h9dqk21": {
      "link": "/r/AskAcademia/comments/p6gihd/literature_reading_strategies_cognitive_fatigue/h9dqk21/",
      "text": "Something that has been a huge help to me throughout my academic career has been text to speech. If I’m having trouble focusing, the voice reading it aloud allows me to follow along. I zone out during this sometimes, and of course with denser literature you’ll have to pause and reread, etc. But this is a great tool, especially when you have to deal with quantity. You can either “read” a whole article following along with the voice to keep you plugging away at a steady pace, or just use it to re-engage when you’re fading, and go back to regular reading once you’re focused again.",
      "author": "actual__thot",
      "created": 1629267090,
      "upvotes": 2,
      "replies": {}
    },
    "h9e01dl": {
      "link": "/r/AskAcademia/comments/p6gihd/literature_reading_strategies_cognitive_fatigue/h9e01dl/",
      "text": "Hello, cannot give advice but maybe share experience. English is not my native language, and when I started to read that sort of papers .. almost passed out after 2. (had a very reading intensive studies so there was \\_for 1 task\\_ 15 of such papers ..).\n\nIt got better after a while! - so my \"advice\": don't give up. it \\_will\\_ be better by time. \n\nsomething else: by time you will be quicker in 'scanning' through the articles to find the 1 sentence that is important for you and the 2 sentences that you can cite. - also, you will be quicker in finding out whether that certain article gives you just any insight.\n\nAnother hint: maybe ask a librarian, in this field! it's \\_their job\\_ to find the most important articles (and maybe even sort them). Wishing you the best!!",
      "author": "sunnyseasun",
      "created": 1629275674,
      "upvotes": 2,
      "replies": {}
    }
  }
}