{
  "sid": "akht58",
  "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/",
  "title:": "How do you keep your motivation & energy levels up as a PhD student? What keeps you going?",
  "text": "Quick backstory: I'm a first year PhD student in STEM, and have just joined a new (and very successful) lab after a semester of rotations. My first semester was by no means exhausting, but I came into this program with burnout, and have had no time to recover. I earned my B.S. and M.S. while working full-time, worked overnights in a factory on breaks to support myself.... now that I'm actually here in a PhD program, I feel like I have little left to give in terms of effort. \n\nSo what keeps your energy levels up? What motivates you to pursue a degree or career that requires so much hard work? \n\nI used to always set achievable short-term goals, but I feel like my PhD program (like many others) is really about accomplishing things in the long term. I'd be interested to know what works (or what hasn't worked) for any of my fellow grad students. Thanks! ",
  "author": "BiologyPhDHopeful",
  "created": 1548635398,
  "updated": 1634081938,
  "over_18": false,
  "upvotes": 105,
  "upvote_ratio": 0.98,
  "comments": {
    "ef4ynw2": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef4ynw2/",
      "text": "I’m just a second year PhD in a STEM field so I’m by no means close to being done...but I’ve asked a few students and post docs this question.\nThey all usually conclude that it really helps to, you know, love the science. You don’t have to love the experiments or the reading, you just have to do those things to keep moving forward. But you should like to be curious and just really want to know what’s next. What’s going on with the protein you’re looking at? What’s the next possible thing it could be doing in the cell? What’s your model? They’ve just told me to driven like you’re a detective seeking answers. You want to know answers. The reading and experiments get you there but you need the mental drive to want to know answers.\n\nI’ve also had other people just say that they love having their own project. They love that they decide what happens next, where the project goes, etc.\n\nSorry this is long winded, I just understand where you’re coming from. It seems like there’s no light at the end of the tunnel this early in the program sometimes. Especially on the bad days.",
      "author": "allycat503",
      "created": 1548637184,
      "upvotes": 56,
      "replies": {
        "ef5jn6v": {
          "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5jn6v/",
          "text": "This is why I got into science. The legwork is often tedious, long, and exhausting but at the end of the day I literally have the opportunity to push the boundaries of human knowledge, and damn if that isn’t satisfying.",
          "author": "clearlyasloth",
          "created": 1548653232,
          "upvotes": 12,
          "replies": {
            "ef61ajt": {
              "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef61ajt/",
              "text": "There's something to be said for this, but I think that this narrative can feel disheartening for students struggling with grad school. \n\nIf it works for you, that's wonderful, but there's so much shit to put up with in grad school (difficult material, conflicts with advisors and students, financial pressures, etc. on top of general stress) that even people who are super passionate about science and knowledge may not find that to be enough to get through day by day, week by week. Big picture that can help, but maintaining a healthy life and being productive many times needs more than that.",
              "author": "GJLGG",
              "created": 1548676127,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "ef4zecx": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef4zecx/",
      "text": "I'm also a first year PhD student with a b.s. and m.s. with no break in between. I've been viewing a PhD as a culmination of medium term goals (complete your courses, pass your QEs, publish, write dissertation) that can be further broken down into shorter goals (study, read, lab work, write). To accomplish those short-term goals, I reserve about 9 hours/day during the weekday to on-campus work; once I leave for the day I do not think about my work so I don't experience burnout. On weekends I keep Saturday for hobbies while Sunday is chores, shopping, and some light, at-home coursework/research. \n\nSo, instead of motivating myself to work, I have disciplined myself to work. Keeping a consistent schedule helps me maintain a disciplined, consistent workload without experiencing burnout. The key is to do extra work (the work without due dates) when you have free time on-campus. Sure, on rare occasions I have to work more than my allotted time, but that's okay; I still reward myself after accomplishing those tasks.\n\nHope this helped.",
      "author": "EiaResh",
      "created": 1548637716,
      "upvotes": 42,
      "replies": {}
    },
    "ef51xwo": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef51xwo/",
      "text": "Recent chemistry phd graduate (now postdoc). I was fortunate to work in a less demanding group and division (computation and theory). What I will say is, if it's possible, leave one full day a week for just you.  Whatever you do, make sure it's just for you enjoy and to decompress. I stayed home and played video games/hung out with my neighbors. \n\nMy other advice is make sure you have friends both in your lab, in your department and outside of the university. Take some time to hang out with your lab mates and have the camaraderie (and to complain with). Have your department friends to hear other stories and to talk to about your experience (and to complain with). And have those friends well outside of your university so that you can experience what the rest of the world is like (and to also complain too; if you can't tell you will complain a lot about a lot of things, just make sure you have the right people to complain too).\n\nLastly: exercise. You would be surprised how some physical activity will improve your mood and overall energy. Try to hit up the gym or go for a jog.\n\nYour first year can be really daunting, especially looking out for the next few years. Just stay grounded and you'll come out relatively sane ;-)",
      "author": "rinzler_1313",
      "created": 1548639548,
      "upvotes": 14,
      "replies": {
        "ef5c9tn": {
          "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5c9tn/",
          "text": "Thank you. I could certainly benefit from some regular exercise. \n\nThe social part is something I would love to improve on, but am struggling a bit. My cohort consists of only 6 (relatively antisocial) people, and my lab is mostly post docs and research associates that are far older than myself.  (Still very nice people, though.)  I'll have to work on finding friends outside my cohort! ",
          "author": "BiologyPhDHopeful",
          "created": 1548647054,
          "upvotes": 5,
          "replies": {
            "ef5cqog": {
              "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5cqog/",
              "text": "I understand, i'm fairly antisocial, and from what you describe it doesn't help when your cohort is tiny and you're surrounded by more senior lab mates. I'd start with the people in your lab, and start with asking around if they want to have lunch or get coffee with you. Something benign like that can lead to getting lab dinner or even hitting  up a bar on a Friday night. These things take time, but ultimately you'll find someone in the lab/dept that will be friends with.",
              "author": "rinzler_1313",
              "created": 1548647397,
              "upvotes": 3,
              "replies": {
                "ef75jos": {
                  "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef75jos/",
                  "text": "Will do! At this stage, I'm sure I can only benefit from spending time with people who have more experience. ",
                  "author": "BiologyPhDHopeful",
                  "created": 1548705021,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ef4z50n": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef4z50n/",
      "text": "Pay attention to your health. In the midst of all the projects and stress it’s easy to put your body's needs in the backseat. Make sure you're still exercising, eating relatively healthy foods, and getting a decent amount of sleep (most) nights.",
      "author": "soupstained",
      "created": 1548637523,
      "upvotes": 17,
      "replies": {}
    },
    "ef51mi3": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef51mi3/",
      "text": "Hi, I don't necessarily motivate myself by keeping in mind my long term goals. Obviously, I have some long term goals but I find it more effective to focus on short term goals. To make sure to be constantly productive, I try to work on three to four different tasks per day that all relate to my research, and I spend 1.5-2 hours on each task. These tasks include working on different articles, doing coursework, applying to scholarships, working on conferences. With that process I end the day with the feeling that I've really moved forward in different aspects of my research. I also start the day with the most daunting task. \nI also live with a chronic illness and that way of working has helped me tremendously because it ensures that all aspects of my work progress even if I have flares up and stuff like that. It's more rewarding for me to see how much I can accomplish in a day rather than stressing about the future. At last, I've recently downloaded an app that's called Forest and it basically blocks you from using your phone or certain websites on your computer for a set amount of time. This also really helps for productivity.\n\nEdit : someone said to eat candy to feel better. Of course, it's fine once in a while, but I think that it's important that you eat very very well to maintain your health and energy levels. I eat organ meats (very rich in vitamins and minerals) and nutrient dense foods (with fats) so that I don't feel like I'm craving all sorts of foods while working. Cravings and blood sugar variations car really hinder your focus.\n\nPhysical exercise also helps. I cannot do lots of physical exercise due to my health but I've learnt to appreciate the benefits of a simple 15 minute walk for example. It really makes a difference.",
      "author": "canadienne-francaise",
      "created": 1548639325,
      "upvotes": 8,
      "replies": {}
    },
    "ef54pfk": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef54pfk/",
      "text": "I had a lot of trouble with this throughout my PhD and I still struggle to stay motivated as a postdoc. I love my field as much as anyone but that alone doesn't really help for me. If anything, I'd use it as an excuse to waste time because I'd read papers completely unrelated to my work to avoid having to deal with struggling through actually accomplishing something. Of course reading papers is an important part of academic work but not when you have a week left to submit job applications and haven't finished your research proposal...\n\nWhat works to motivate me is the feeling of small accomplishments along the way. Like you said, this whole career is based on long term goals so its easy to get overwhelmed and feel like you aren't accomplishing anything. At least for me, it really helps to reflect on what I have accomplished recently, even if its just writing an abstract, reading a paper I'm supposed to be refereeing, or editing 1 page of a manuscript. The momentum built from these small things really builds up. \n\nAlso you might want to consider taking some time off if that's an option in your program and given your personal situation. I didn't work full time during college so I didn't have it as bad, but I also felt extremely burnt out before my PhD. I took a year off  in between where I tutored to make a living and it really helped when I finally started my PhD. ",
      "author": "AmpleLineBundle",
      "created": 1548641454,
      "upvotes": 7,
      "replies": {
        "ef5brvt": {
          "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5brvt/",
          "text": "Thanks for the advice! I get pretty distracted too, and I do love \"my science.\" I'll try to focus on small accomplishments. ",
          "author": "BiologyPhDHopeful",
          "created": 1548646683,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ef56pnw": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef56pnw/",
      "text": "Finished my PhD a few years ago and your assessment is completely correct. Whereas in undergrad you have deadlines to meet for assignments, exams to prepare for - a PhD is a marathon. No hard deadlines, just an open-ended endeavor. \n\nA PhD is a lesson in real problem-solving - always keep the question you are asking in mind and set small goals to get there. Relax and breath a little bit too - its not a sprint like undergrad. ",
      "author": "zero2hero2017",
      "created": 1548642916,
      "upvotes": 5,
      "replies": {}
    },
    "ef54qp6": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef54qp6/",
      "text": "I worked in industry for 6 months prior to graduate school. Grant-writing and the publishing grind will beat out profit-motivated science for me every time. The thought of returning to that world makes me want to do every possible thing I can to avoid it.\n\nI'm sorry this answer doesn't really help in your situation. I also realize it probably won't be a popular answer on Reddit. Just wanted to give you an honest answer regarding my experience.",
      "author": "Melkovar",
      "created": 1548641477,
      "upvotes": 5,
      "replies": {}
    },
    "ef5160z": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5160z/",
      "text": "When I was doing mine... Fear of failure! 😁",
      "author": "runnergal45",
      "created": 1548639001,
      "upvotes": 7,
      "replies": {}
    },
    "ef588h4": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef588h4/",
      "text": "1.  You could (and maybe should) work 60 hours a week but you don't NEED to. If it takes you more than 5 years (assuming you're in the US) that's **OK**. This of course assumes that your department or PI can support you the whole time. Talk to your PI about your concern and they can help you set a timeline that keeps you level, productive and happy. Timelines in general will help you be productive and efficient.\n\n2. Don't do too much (or any) service. I did service but once I served on a grad committee for a year and organized a few outreach events I turned down almost every request to do service. Service is NOT necessary as a grad student. Service IS beneficial as a grad student. Too much service is a death sentence for a grad student (IMO because your long term goals should be beyond your current department).\n\n3. Make time for friends and personal life. Keep it separate from the lab so that you get the most out of your lab time and your friend time. Throughout grad school we tried to have regular game-nights, karaoke, trips to downtown etc.",
      "author": "roach_brain",
      "created": 1548644013,
      "upvotes": 3,
      "replies": {}
    },
    "ef5dbwy": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5dbwy/",
      "text": "Fourth year chemistry PhD student here. Having a great advisor keeps me motivated, my friends in the graduate program, my hobbies, and clubs that I have joined.\n\nWhat had gotten me out of my depression and feelings of quitting grad school was doing an internship at a company I could see myself working at in the future. It gave me the confidence and motivation that I needed at the time and I finally started seeing a light at the end of the tunnel.\n\nAlso, group therapy helps and is fun!",
      "author": null,
      "created": 1548647846,
      "upvotes": 3,
      "replies": {}
    },
    "ef5u2jj": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5u2jj/",
      "text": "You can make artificial short term goals. For example, I run an academic blog, and try to have a new post written every week. Each post might not contribute to your thesis or some paper (in fact, most of them won't) but it will give you a sense and record of accomplishment and increase your prominence in your local research community. Over the 8 years I've been running my blog (definitely not on a weekly schedule for most of the time), it has definitely helped both my writing, my ideas, and my career.",
      "author": "DevFRus",
      "created": 1548665765,
      "upvotes": 3,
      "replies": {}
    },
    "ef65363": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef65363/",
      "text": "Those 3 letters after your name. I stuck with it so people could call me Dr.\n\nThis is paraphrasing a quote I heard previously, but a PhD doesn't really come down to intelligence or mental endurance. The one thing common to almost all PhDs is pure bull-headed stubbornness. \n\nYou have to possess the drive to continue pushing toward that end goal even though it isn't financially or mentally beneficial to do so, and you *should* quit. The people who successfully finish are those that refuse to admit it was a bad idea, a waste of time, or that bowing out would make more sense.",
      "author": "ilessthan3math",
      "created": 1548680447,
      "upvotes": 3,
      "replies": {}
    },
    "ef5i784": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5i784/",
      "text": "I started boxing, eating really healthy, taking vitamins, having a Saturday girlfriend, and smoking weed. ",
      "author": null,
      "created": 1548651815,
      "upvotes": 3,
      "replies": {}
    },
    "ef57hwl": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef57hwl/",
      "text": "Copious amounts of marijuana. ",
      "author": "HoosierTrip",
      "created": 1548643499,
      "upvotes": 4,
      "replies": {}
    },
    "ef59f2n": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef59f2n/",
      "text": "I am in undergrad right now for pre med and I’m working full time to support myself. It’s nice to know that others have made it through while working full time because it sure hasn’t been easy. Ask yourself what motivated you to do that. Also taking some small vacations here and there really help me. Even if you can only spare a couple days to just try and reset.",
      "author": "medical_pioneer",
      "created": 1548644886,
      "upvotes": 2,
      "replies": {
        "ef5bkap": {
          "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5bkap/",
          "text": "It's possible, and worth it! I am allowed a month of paid vacation per year in my lab (and yes, that's very generous for a PhD student.) I feel a bit guilty taking time this early in the year, but I will be sure to take a real vacation later on. Itll be my first vacation in 6 years and I'm really looking forward to it. Best of luck to you! ",
          "author": "BiologyPhDHopeful",
          "created": 1548646515,
          "upvotes": 3,
          "replies": {
            "ef5cz8c": {
              "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5cz8c/",
              "text": "Thanks! Best of luck to you as well. How many years did it take to get your B.S. while working full time?",
              "author": "medical_pioneer",
              "created": 1548647572,
              "upvotes": 1,
              "replies": {
                "ef75ebc": {
                  "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef75ebc/",
                  "text": "4 years for B.S., 2 years for M.S. with Thesis... this may explain why I'm feeling a bit burnt out in my PhD. But, if you have no problem taking a bit more time, I would highly reccomend it. Its much healthier! ",
                  "author": "BiologyPhDHopeful",
                  "created": 1548704930,
                  "upvotes": 1,
                  "replies": {
                    "ef76enj": {
                      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef76enj/",
                      "text": "I would also like to complete my B.S. in the 4 years especially with med school being 4 years then having to do residency. Going to be rough lol",
                      "author": "medical_pioneer",
                      "created": 1548705542,
                      "upvotes": 1,
                      "replies": {
                        "ef7ihar": {
                          "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef7ihar/",
                          "text": "Pro tip: try seeing if you can work for your university at least part time. It eliminates major commutes (assuming your campus(es) aren't too large), and many student-oriented jobs work around busy class schedules. I worked as a GA, TA, RA, etc... and as a pharmacy tech... which in your case would give you tangible patient contact hours for med school. ",
                          "author": "BiologyPhDHopeful",
                          "created": 1548712796,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ef4z0lt": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef4z0lt/",
      "text": "eat candy and cake to feel better...study while listening to long symphonies/operas so you can simultaneously educate yourself in classical music and have your brain follow complex, non-lyrical themes over long times (eg, >1 hr) instead of typical songs <5 min (too much start and stop feel is distracting)...remind yourself that this is the most important thing you will ever do (i mean fulfilling your destiny, not doing the degree per se)...remind yourself of past achievements...occasionally print and hang up nice figures (data visualizations) from your work",
      "author": "patriotto",
      "created": 1548637437,
      "upvotes": 2,
      "replies": {
        "ef50ktg": {
          "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef50ktg/",
          "text": "White/pink noise. Something like Philip Glass would work too, but classical music and jazz tends to be terrible study music because they're really complex. You're either listening to it and not studying or studying and not listening to it. The former is bad because you're not studying, and the latter it's just blocking out distraction and white/pink noise does that job better.",
          "author": "Mezmorizor",
          "created": 1548638575,
          "upvotes": 2,
          "replies": {
            "ef50rf8": {
              "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef50rf8/",
              "text": "Glass is an excellent choice!",
              "author": "Florentine-Pogen",
              "created": 1548638704,
              "upvotes": 1,
              "replies": {}
            },
            "ef5283z": {
              "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5283z/",
              "text": "If anyone finds white/pink noise too hash, look up soundscapes on youtube - gives you stuff like crackling fire, rain, train noises and so forth. The timer app Forest also gives you rainforest sounds. \nI've used these instead of study music throughout undergrad, they are much less distracting and also have a calming effect (at least on me).",
              "author": "laakmus",
              "created": 1548639751,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ef5alfo": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5alfo/",
      "text": "I tried to make a game out of it to see how fast I could finish the program. There were other classmates of mine that were also going the same or faster. But I wanted to see how well I could keep up with them. I wrote a blog post about it here: A Doctorate by the Numbers — University XP https://www.universityxp.com/blog/2017/6/17/a-doctorate-by-the-numbers",
      "author": "notdaveng",
      "created": 1548645766,
      "upvotes": 1,
      "replies": {}
    },
    "ef5ikl9": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5ikl9/",
      "text": "For me, something I learned early on is that I need to get an average of eight hours of sleep every night. I'll be fine if I get too little sleep on any given day, but on day two I notice my performance starts to suffer.\n\nI've also found that it's easier to work in really concentrated bursts (eg a week of really intense work followed by a more relaxed week). ",
      "author": "Alternative_Squirrel",
      "created": 1548652156,
      "upvotes": 1,
      "replies": {}
    },
    "ef5u2wz": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5u2wz/",
      "text": "anxiety and a protestant sense of duty mostly but others have better answers",
      "author": "kongnico",
      "created": 1548665779,
      "upvotes": 1,
      "replies": {}
    },
    "ef5viaf": {
      "link": "/r/AskAcademia/comments/akht58/how_do_you_keep_your_motivation_energy_levels_up/ef5viaf/",
      "text": "I used to be a junky and a drunk. Everyday I get now is a miracle. I make it through with 100% gratitude.",
      "author": "Astra_Starr",
      "created": 1548667900,
      "upvotes": 1,
      "replies": {}
    }
  }
}