{
  "sid": "q4myr2",
  "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/",
  "title:": "What is the typical STEM post-doc recruitment process like (in the US)?",
  "text": "Hello,\n\nI am graduating next year and have recently started looking for post-doc positions. For now I have started with cold emailing the famous labs in my field (biology/genomics) mostly at top universities where I would be lucky to get in. In the last week I emailed 6 labs and got 3 responses. One PI said no, one was on leave and told me to email him again later and one said he would be 'happy to chat later this month'. \n\nI will email a lot more people in the upcoming days but am just curious how does the process usually go from here. Should I treat the upcoming zoom 'chat' as a formal interview?  Or will it really be an informal chat to see if I am a good fit and will possibly be followed by a more formal meeting? Is it common for postdoc applicants to be asked to give a seminar/presentation of their PhD research? Do the PIs usually tell you their decision after a couple of meetings?  \n\nI know it will vary from lab to lab but just asking about general practices. \n\nThanks!",
  "author": "attackseek",
  "created": 1633791518,
  "updated": 1634579380,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hfztok6": {
      "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hfztok6/",
      "text": "Maybe field dependent, but in Astronomy any postdoc that doesn't suck gets advertised on the job register, you apply to them all, and hope someone likes you.  Then a zoom or two, offer if you're a lucky fucker, and you're off to who knows where.\n\nYou can cold email people to occasionally find a one-year postdoc from someone who doesn't have enough money to offer 2 or 2+1 years and thus can't really advertise it.  But it's not a good path.  I did it to stay afloat as I transitioned out, though.",
      "author": "Spambot0",
      "created": 1633795675,
      "upvotes": 8,
      "replies": {}
    },
    "hfzpkyg": {
      "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hfzpkyg/",
      "text": "I actually responded to a posting on researchgate.  I wrote a written application and got a response to have a skype interview. we did it and it seemed like a good fit a couple of weeks later I got the offer. Was pretty straight forward.",
      "author": "CreepyBumblebee31",
      "created": 1633793800,
      "upvotes": 4,
      "replies": {
        "hfzqzw9": {
          "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hfzqzw9/",
          "text": "> did\n\nSounds great. Wish it works like that for me too. Though I am not responding to job posts but am randomly emailing PIs whose research I find interesting.",
          "author": "attackseek",
          "created": 1633794456,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg02qem": {
      "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hg02qem/",
      "text": "The fact that you're looking into applications now is a great start, gives you plenty of time to prepare. My application process was a little bit of both networking and cold emailing, and was slightly more challenging because my SO was also looking for a postdoc position at the same time and we wanted to be in the same area. So I applied cold to 5 labs and to 1 networked PI, got a response from 3 (including the PI I'd met before) and interviewed with all.\n\nThe interview includes meeting with the PI, all/most of the lab members, some other PIs that the lab you're interviewing with collaborates with, a presentation, and probably dinner. For the virtual meet/chat, definitely treat it as a formal interview - I'd rather take that caution and be overdressed than to assume it's informal and be wrong. If you get to the official interview part (even if it's still virtual, cuz COVID), your presentation will most likely be very similar to your defense presentation. It might be in front of the whole department, or it might just be with the lab you're interviewing for - I would try to ask in advance if you can, so you can tailor your talk appropriately. \n\nAs for the decision, I would say after the interviews I heard back from the PI within a week or two (I received offers from two labs) but it was pretty obvious that I was going to get offers from those labs when I left. That's not a bragging thing or anything, the interviews just felt like they went really well and that I could have been a good fit for both.\n\nBest of luck on your interviews!",
      "author": "MightyMitos19",
      "created": 1633799680,
      "upvotes": 3,
      "replies": {
        "hg0b1xk": {
          "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hg0b1xk/",
          "text": "That's good to know. I am outside the US now so pretty much everything will be virtual in my case. \n\nAlso the offers you received from the labs, were they informal acceptances or something like a formal job offer letter from the department with all the terms etc? I am basically curious how much time there is to make a decision if one gets multiple offers.",
          "author": "attackseek",
          "created": 1633803320,
          "upvotes": 3,
          "replies": {
            "hg0s0g8": {
              "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hg0s0g8/",
              "text": "It started a little informal I guess, with the PI emailing or calling that they'd like me to join their lab.  Once I'd accepted the position, then they set up for the official offer letter with terms - I think I got it within a week or two of accepting, but that will likely vary by institution. \n\nHappy cake day, btw!",
              "author": "MightyMitos19",
              "created": 1633810890,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hg150fg": {
      "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hg150fg/",
      "text": "Varies widely. One thing people often overlook is how important the meeting with other lab members is if they do a more formal interview. The PI will definitely want the input of their current lab members, so don't blow this part off. I know many PIs who have rejected candidates because their lab didn't think they'd be a good fit. Additionally, make sure that you are also asking these people a lot of questions. They are likely to be the ones to hint at workplace culture issues and any toxic problems. Also talk to recent grads/former postdocs as they might talk more freely.",
      "author": "AwkwardAccountant5",
      "created": 1633816609,
      "upvotes": 3,
      "replies": {}
    },
    "hg3i5qf": {
      "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hg3i5qf/",
      "text": "Since you're international, the zoom chat is likely to see if there's a fit - for you and for the PI. If it seems like a good match, the PI will probably fly you in for a one day interview with the PI, the lab members, and a presentation of your work (Note: not sure how COVID will affect this process). The decision will likely come either the day of the interview or within \\~1 week.",
      "author": "NorthAd7013",
      "created": 1633869385,
      "upvotes": 2,
      "replies": {}
    },
    "hfzo1qs": {
      "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hfzo1qs/",
      "text": "It is mostly a homie hookup system in STEM. There are very few postdoc jobs posted annually and even fewer funding schemes.\n\nIf you want to get a postdoc, your best chances will be via networking.",
      "author": "MarineProf",
      "created": 1633793098,
      "upvotes": 0,
      "replies": {
        "hfzpjzq": {
          "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hfzpjzq/",
          "text": "Yeah, but I was asking more about how the process would work in the case of PIs who do reply to my emails and are potentially interested.",
          "author": "attackseek",
          "created": 1633793787,
          "upvotes": 2,
          "replies": {
            "hfzq1po": {
              "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hfzq1po/",
              "text": "From experience, if they reply back to your email/letter including a CV, they are at least partially interested.  You’ll likely have a chat. The PI will gauge your competence and begin to think about how you fit into a project timeline (namely, do you need sponsorship? This can be seen as a big negative as the process is timely and not guaranteed). You are likely to have follow on conversations, but I’ve never seen anyone present as a part of an application.  Usually just basic questions about research and related skills.",
              "author": "MarineProf",
              "created": 1633794023,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hgc7qav": {
      "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hgc7qav/",
      "text": "There is no typical process. Everyone does it differently. Only if it is university sponsored might there be rules. If soft money (grants held by PI) then it is up to them how they build their team.",
      "author": "Chemastery",
      "created": 1634035116,
      "upvotes": 1,
      "replies": {}
    },
    "hgmr63b": {
      "link": "/r/AskAcademia/comments/q4myr2/what_is_the_typical_stem_postdoc_recruitment/hgmr63b/",
      "text": "I'm curious about this process too. I'm applying for an NSF postdoc (math), which requires a project sponsor from the university I would like to go to. My PI/sponsor is eager to take me on, and we've been talking a lot over zoom and emails. But the NSF reviewers have to approve the proposal, and the faculty committee has to make an offer, and they won't meet until the end of the year. There \"may be budget cuts due to the pandemic\" but this is a top private school with a large endowment and a medium/large department. I know things look to be going well, but the lack of guarantees is making me nervous.",
      "author": "BillCosbyOnlyFans",
      "created": 1634230807,
      "upvotes": 1,
      "replies": {}
    }
  }
}