{
  "sid": "ook6be",
  "link": "/r/AskAcademia/comments/ook6be/is_it_easier_to_grade_on_an_ipad_and_get_the/",
  "title:": "Is it easier to grade on an ipad and get the apple pen or is using a macbook just as good?",
  "text": "I just want to grade like in coffee shops or on flights and don't want to lug my laptop everywhere. Thanks!",
  "author": "estellethegreat1",
  "created": 1626847807,
  "updated": 1634082480,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "h5z89dq": {
      "link": "/r/AskAcademia/comments/ook6be/is_it_easier_to_grade_on_an_ipad_and_get_the/h5z89dq/",
      "text": "Surely it depends on what you're grading...?",
      "author": "polyphonal",
      "created": 1626853432,
      "upvotes": 11,
      "replies": {}
    },
    "h5zhea3": {
      "link": "/r/AskAcademia/comments/ook6be/is_it_easier_to_grade_on_an_ipad_and_get_the/h5zhea3/",
      "text": "It depends! I’d you want to physically write on the documents and circle I’d say iPad. If you want to edit documents using track changes for example in Word I’d say MacBook or iPad with a keyboard. My MacBook broke and I had to use track changes on my iPad to grade and it was a pain without a keyboard IMO.\nEdit: using an iPad to read papers though has been a game changer for me.",
      "author": "adnamanda",
      "created": 1626860770,
      "upvotes": 4,
      "replies": {}
    },
    "h5zz14q": {
      "link": "/r/AskAcademia/comments/ook6be/is_it_easier_to_grade_on_an_ipad_and_get_the/h5zz14q/",
      "text": "Notability and Apple Pencil/iPad are great. You will have to export the file as a PDF after to return it. It’s a bit more work up front to get your files in the app, but much easier to edit. \nIf you’re giving a lot of written feedback, it’s easier on the MacBook.",
      "author": "NotWhatICameHereFor",
      "created": 1626873007,
      "upvotes": 3,
      "replies": {}
    },
    "h60rlt7": {
      "link": "/r/AskAcademia/comments/ook6be/is_it_easier_to_grade_on_an_ipad_and_get_the/h60rlt7/",
      "text": "I don't find an iPad a full on replacement for a laptop for things like writing, but I absolutely love my iPad for grading and teaching. \n\nI use it to grade writing, grade exams, write answer keys, and as a digital whiteboard for lectures. Even for digital office hours. \n\nI do not at all regret buying a 12.9\" iPad solely for that.",
      "author": "Eigengrad",
      "created": 1626885658,
      "upvotes": 2,
      "replies": {}
    },
    "h6wknnr": {
      "link": "/r/AskAcademia/comments/ook6be/is_it_easier_to_grade_on_an_ipad_and_get_the/h6wknnr/",
      "text": "I know 2 profs who got iPads and Apple Pencils to use for virtual STEM classes (to draw equations) - they ended up not using them at all because they couldn't figure out how to use it.  I'm sure you won't be like them :)\n\nA few things that will make grading assignments on iPads easier:\n\n1) Get a clear screen protector for the iPad - you can find one for a few bucks (some people swear by a product called Paperlike that's $30 - probably unnecessary). It'll add a little friction and make it less slippery to write. \n\n2) Figure out which app(s) you want to use - I like GoodNotes ($8) because I can import pdf files into the app (from Google Drive), mark it up, and then export back to pdf. There are probably a ton of other apps out there (Notability is another that has good reviews).\n\n3) You don't have to get the Apple Pencil (it's like $100 or more) - there are other styluses that will work well for writing like the Adonit Note (costs about $50).  Presumably you won't need the pressure sensitivity feature if you're just marking up papers.",
      "author": "ApricotBandit",
      "created": 1627522610,
      "upvotes": 2,
      "replies": {
        "h6wl7ah": {
          "link": "/r/AskAcademia/comments/ook6be/is_it_easier_to_grade_on_an_ipad_and_get_the/h6wl7ah/",
          "text": "this is very helpful! thank you so much!",
          "author": "estellethegreat1",
          "created": 1627522875,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h5z6wm5": {
      "link": "/r/AskAcademia/comments/ook6be/is_it_easier_to_grade_on_an_ipad_and_get_the/h5z6wm5/",
      "text": "iPad + apple pencil + the right software and you're good to go, but don't expect anyone but you to be able to read your handwritte notes. But you can always look at your notes again and write your students a quick review of their paper.",
      "author": "williamsRB",
      "created": 1626852718,
      "upvotes": 2,
      "replies": {
        "h60rot9": {
          "link": "/r/AskAcademia/comments/ook6be/is_it_easier_to_grade_on_an_ipad_and_get_the/h60rot9/",
          "text": "Practice helps. I give all my feedback this way and my students seem to interpret what I say fine.",
          "author": "Eigengrad",
          "created": 1626885693,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "h5z6hrc": {
      "link": "/r/AskAcademia/comments/ook6be/is_it_easier_to_grade_on_an_ipad_and_get_the/h5z6hrc/",
      "text": "I hope someone replies to this - I definitely need this excuse to buy an iPad!",
      "author": "PlayfulChemist",
      "created": 1626852530,
      "upvotes": 1,
      "replies": {}
    },
    "h5z6irp": {
      "link": "/r/AskAcademia/comments/ook6be/is_it_easier_to_grade_on_an_ipad_and_get_the/h5z6irp/",
      "text": "I hope someone replies to this - I definitely need this excuse to buy an iPad!",
      "author": "PlayfulChemist",
      "created": 1626852543,
      "upvotes": 1,
      "replies": {}
    },
    "h609n8g": {
      "link": "/r/AskAcademia/comments/ook6be/is_it_easier_to_grade_on_an_ipad_and_get_the/h609n8g/",
      "text": "If you're using the Canvas/Blackboard apps to grade the experience is garbage. Incredibly slow. Tap once to place a comment. Tap again to bring up a comment window. Type in the comment slowly. Faster to use computer and mouse.\n\nThe Office suite is also crippled on the iPad, so it really doesn't work as well there, either. I use it to mark up PDFs and read but it isn't as great a setup as you might think for getting work done.",
      "author": null,
      "created": 1626878041,
      "upvotes": 1,
      "replies": {}
    }
  }
}