{
  "sid": "qlho4v",
  "link": "/r/AskAcademia/comments/qlho4v/professors_not_responding_to_letter_of/",
  "title:": "Professors not responding to letter of recommendation requests",
  "text": "Hi,  I am applying to grad school and I need 3 letters of rec and I emailed asking teachers from my undergrad that I knew the best during my time there. So far one wrote me a great letter but two others have not responded to my email at all and it has been a couple weeks. The deadline would be in a month and I understand they may be busy so in a week or so if they still do not respond I was planning on sending a follow up email but not sure what to say without sounding pushy or desperate. Any advice would be much appreciated :)",
  "author": "FanEast289",
  "created": 1635897024,
  "updated": 1637381886,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj2xusj": {
      "link": "/r/AskAcademia/comments/qlho4v/professors_not_responding_to_letter_of/hj2xusj/",
      "text": "To be honest, you probably should have emailed them more than a month in advance (assuming your initial email was recent). Following up in a week is probably a good idea. You could mention that you sent a previous email but weren’t sure if they received it, and repeat the text you sent last time. But I’d line up another recommender or two in the meantime. \n\nWhen I was in grad school and going on the job market, I had a heck of a time getting my *committee members* to write letters for me. Even with 2–3 months advance notice.",
      "author": "EconGuy82",
      "created": 1635897534,
      "upvotes": 8,
      "replies": {
        "hj7f074": {
          "link": "/r/AskAcademia/comments/qlho4v/professors_not_responding_to_letter_of/hj7f074/",
          "text": "True, figures they are probably busy",
          "author": "FanEast289",
          "created": 1635976554,
          "upvotes": 1,
          "replies": {
            "hj7met9": {
              "link": "/r/AskAcademia/comments/qlho4v/professors_not_responding_to_letter_of/hj7met9/",
              "text": "Some are busy. Some are scatterbrained. Some are just jerks. And in some cases, it could be a mistake (e.g., an email that gets deleted or goes to spam by accident). Unfortunately, it can be hard to know which is which. I’ve made it a priority to be responsive to students because I had such a bad experience myself. But it’s something you’ll probably see a lot of if you remain in academia.",
              "author": "EconGuy82",
              "created": 1635979635,
              "upvotes": 1,
              "replies": {
                "hj7o4g2": {
                  "link": "/r/AskAcademia/comments/qlho4v/professors_not_responding_to_letter_of/hj7o4g2/",
                  "text": "Oh ok. Yea that's why I'm actually asking teachers that I had a good relationship with in and out of the classroom so they know for sure who I am. I still remind them in the email though",
                  "author": "FanEast289",
                  "created": 1635980370,
                  "upvotes": 2,
                  "replies": {
                    "hj7pgb2": {
                      "link": "/r/AskAcademia/comments/qlho4v/professors_not_responding_to_letter_of/hj7pgb2/",
                      "text": "Good luck! Hope they’ll pull through for you!",
                      "author": "EconGuy82",
                      "created": 1635980958,
                      "upvotes": 1,
                      "replies": {
                        "hj7rw59": {
                          "link": "/r/AskAcademia/comments/qlho4v/professors_not_responding_to_letter_of/hj7rw59/",
                          "text": "Thanks!",
                          "author": "FanEast289",
                          "created": 1635982026,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hj33nbm": {
      "link": "/r/AskAcademia/comments/qlho4v/professors_not_responding_to_letter_of/hj33nbm/",
      "text": "yes, email them to  follow up with them (respectfully). But i’d probably recommend considering plan B recommenders (just in case ) GOODLUCK!",
      "author": "mrg9605",
      "created": 1635899916,
      "upvotes": 2,
      "replies": {}
    },
    "hj36kjd": {
      "link": "/r/AskAcademia/comments/qlho4v/professors_not_responding_to_letter_of/hj36kjd/",
      "text": "Email a follow-up reminder and include a bullet-list document that has specific qualities about yourself that are relevant to the context in which you knew the letter writers    \n(how you did in their class, what interested you, what labs you were good at, topics you excelled at, topics you struggled with, etc. etc.). Include your resume/CV. \n\nEXAMPLE EMAIL:\n\nProf so&so,\n\nI just wanted to send a follow-up email about the letter of recommendation you so graciously agreed to write me. The letter is due on X at Ypm and I've listed the website/contact at the end of this email. Additionally, I know we are all busy with the ongoing semester, so I've included my resume/CV along with a document that may help in writing my letter. Please let me know ASAP if I you are unable to finish a letter in time so that I can find an alternative letter writer.\n\nThank you again,\n\nFanEast289",
      "author": "TAacademicadvice001",
      "created": 1635901145,
      "upvotes": 1,
      "replies": {}
    },
    "hjltyz3": {
      "link": "/r/AskAcademia/comments/qlho4v/professors_not_responding_to_letter_of/hjltyz3/",
      "text": "You say one wrote you a \"great\" letter. I guess you have seen it? Just in case, make sure that you are not asking or otherwise hinting or implying that you should see the letter, which would be inappropriate for a grad school recommendation and could put people off.",
      "author": "ndrsng",
      "created": 1636238410,
      "upvotes": 1,
      "replies": {
        "hjluiyb": {
          "link": "/r/AskAcademia/comments/qlho4v/professors_not_responding_to_letter_of/hjluiyb/",
          "text": "I didn't ask to see it they wanted me to see it. I guess it wasn't a big deal to them",
          "author": "FanEast289",
          "created": 1636238656,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}