{
  "sid": "q6ipni",
  "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/",
  "title:": "No PC at my desk, IT dragging their heels",
  "text": "\nAs the title says, I ordered a workstation weeks ago and IT still hasn't installed it.\n\nWhilst it is possible to use another workstation on campus, I'm a PhD student and need access to the office as well as elevated IT permissions which regular workstations can't/don't have.\n\nI know departments are very overworked thanks to covid-- what can I do here?",
  "author": "Weekend_metalhead",
  "created": 1634032709,
  "updated": 1634579172,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.71,
  "comments": {
    "hgceooy": {
      "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hgceooy/",
      "text": "There's a worldwide shortage of computers and computer parts. Find out where the delay is as it may not be your IT dept, but rather the supplier. If it's the supplier ask IT if they have any \"loaners\" that you can get in the meantime.\n\nI had a 12-week delay this time last year for some lab computing kit. Currently, we have a 6-month delay on laptop docks.",
      "author": "Kiss_It_Goodbyeee",
      "created": 1634039901,
      "upvotes": 10,
      "replies": {
        "hgcgtc9": {
          "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hgcgtc9/",
          "text": "The PC was delivered and they just aren't fitting it",
          "author": "Weekend_metalhead",
          "created": 1634041218,
          "upvotes": 5,
          "replies": {
            "hgctqfg": {
              "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hgctqfg/",
              "text": "Then I'd contact them, copying in your supervisor, saying that the delay is affecting your work and ask them to commit to a delivery time.",
              "author": "Kiss_It_Goodbyeee",
              "created": 1634047852,
              "upvotes": 6,
              "replies": {}
            },
            "hgdy7ys": {
              "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hgdy7ys/",
              "text": "What does fitting it mean here?",
              "author": "yakiguriumai",
              "created": 1634064653,
              "upvotes": 1,
              "replies": {
                "hge1cek": {
                  "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hge1cek/",
                  "text": "Fitting i.e., installing it on my desk and loading the university's windows image...",
                  "author": "Weekend_metalhead",
                  "created": 1634065936,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hggjltz": {
              "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hggjltz/",
              "text": "Use the phrase \"duty of care\" as in they are failing in their duty of care to you and your studies. Not to IT to their boss. Or better get your supervisor to.",
              "author": "whats-a-bitcoin",
              "created": 1634111879,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "hgc627q": {
      "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hgc627q/",
      "text": "Keep sending reminders. Go to the IT office. Call them. Raise the issue with your boss (usually what works best). You can also send a reminder email to IT, and CC in your boss.\n\nFrom my experience, when people drag their feet you only get results by being that person who keeps complaining. Sorry, it sucks.",
      "author": "Cell_Division",
      "created": 1634033745,
      "upvotes": 4,
      "replies": {
        "hgdjid2": {
          "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hgdjid2/",
          "text": "Just be aware that cc'ing in the boss might result in very slow delivery times with any future requests.",
          "author": "cgknight1",
          "created": 1634058631,
          "upvotes": 2,
          "replies": {
            "hge4r2i": {
              "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hge4r2i/",
              "text": "In which case, CC the boss in the next email too!\n\nI live in a country where efficiency is not a thing. Trying to be competitive in academia when simple shit doesn't get done is really hard, and it can tank your career. When I started here, it took **5 months** for the finance team to send through a simple order I made for a piece of equipment.  But it got done in under 2 minutes when I eventually asked my PI to step in. I know OP might not be in quite the same situation, but I think in academia you have to be willing to complain a lot if it's to get your work done faster, because it isn't the sort of place to be forgiving. The competition against institutes with tons of cash and who have huge teams of people to get stuff done is very real, and your career depends on keep up with them.",
              "author": "Cell_Division",
              "created": 1634067311,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgcavhd": {
      "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hgcavhd/",
      "text": "Remember to try the \"honey\"/empathy approach before you escalate (if you haven't already).\n\nAs one with friends in IT in academia, I know every day all day is one giant never-ending list of requests. \"I want please give me will you X Y, Z?\" You cross one item off the list, and another one appears. \n\nYeah, it's their job, but the peope I know got into IT because of the niftyness of computers, not for the people. \n\nSo, anything you can do to show appreciation will probably go a long way, even if it's just noting how busy they might be due to the increased demand due to covid crap.\n\nIt's unlikely they're \"dragging their heels,\" as you stated in the title, but simply perpetually behind, like most IT departments, as so much of the job is reactive (fixing others' issues), which often cannot be planned for.",
      "author": "gobucks314",
      "created": 1634037405,
      "upvotes": 3,
      "replies": {}
    },
    "hgcgmjv": {
      "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hgcgmjv/",
      "text": "Let’s see:\n\n1. There is a global shortage on computer parts with certain components having months and months of delays.\n2. If you are in the UK, you probably also have the supply chain disruptions.\n3. Lockdown means that the IT department is only now able to go through the thousands computer campus wide, used for teaching, and do any in-person work needed. This means that even if the PC was delivered, they have a backlog.\n4. IT departments are typically understaffed and overworked\n\nYou may keep sending them reminders or elevate it, but IMO that is not worth it. It won’t speed things and will only get people crossed. You stating that they are “dragging their heels”, to be frankly honest, makes you sound like immature and entitled for wanting your toy(s). Especially considering the larger context.\n\nSimply ask them for a loaner, if available, and ask them if they have an ETA. My honest advice is to always have a good relationship with the IT department as you never know when you will need a favour from them.",
      "author": "RecklessCoding",
      "created": 1634041105,
      "upvotes": 1,
      "replies": {
        "hgcgwv3": {
          "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hgcgwv3/",
          "text": "It's physically ready- there are no supply chain issues in this case. Frankly I'd ask them to let me set it up myself at this rate. They won't install it.",
          "author": "Weekend_metalhead",
          "created": 1634041276,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgcoggj": {
      "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hgcoggj/",
      "text": "Not saying you need/should do this, but I always keep one work laptop and one private laptop alive, and save everything work-related in the cloud.\n\nI have been in your situation way too many times to worry about this daily. All computers break down at some point, and then it will take forever to get a new one.\n\nI don't know your situation, but we can access most services via private computers if we use the official VPN.",
      "author": "molobodd",
      "created": 1634045350,
      "upvotes": 1,
      "replies": {}
    },
    "hgeudz4": {
      "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hgeudz4/",
      "text": "Weeks? HAHAHA. Try months and that was pretty-pandemic.",
      "author": "Broric",
      "created": 1634077960,
      "upvotes": 1,
      "replies": {}
    },
    "hgcep16": {
      "link": "/r/AskAcademia/comments/q6ipni/no_pc_at_my_desk_it_dragging_their_heels/hgcep16/",
      "text": "You ordered it, but do they have it available to setup for you?  You can use other workstations as mentioned. If on a network your permissions would work  with computers on network, they are not pc specific. \n\n I would nicely ask if they can provide a status on the computer. See what the response is and go from there.",
      "author": "mearsov",
      "created": 1634039907,
      "upvotes": -1,
      "replies": {}
    }
  }
}