{
  "sid": "oky99f",
  "link": "/r/AskAcademia/comments/oky99f/interviewing_for_an_administrative_positionrole/",
  "title:": "Interviewing for an Administrative Position/Role",
  "text": "Hello all! I have an acquaintance who is transitioning from an industry role and applying for an administrative position at an R1 university. I was a former graduate student (at a different institution) and they are asking me for advice for the interview as to what points to touch on or picking my brain about what they may be asked. I confess I feel a bit out of my depth here, I obtained my PhD and moved into Publishing. Any thoughts on information or advice I can provide them? Thank you all in advance!",
  "author": "Usera27",
  "created": 1626372074,
  "updated": 1634082530,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "h5dm5ow": {
      "link": "/r/AskAcademia/comments/oky99f/interviewing_for_an_administrative_positionrole/h5dm5ow/",
      "text": "It's hard to be very specific without knowing much about the role but I work for an academic organisation that attracts a lot of administrators/support services staff from big name corporations because they want to do more socially conscious work. The big problem they have is adjusting from a very corporate environment where they can lean on company rules, policy and hierarchy to get stuff done to the chaos of academia where the culture is much more informal in terms of corporate governance processes and line management so you have to find ways of getting people do stuff that doesn't rely on the implicit notion that you have in corporations that failure to follow policy will get you fired. In addition, governance processes are likely to be lax or missing which adds another layer. Your friend should address knowing it's a very different culture and that they will need to be flexible and adjust to a different way of working. If I were giving this answer I would then talk about the importance of getting to know the organisation, recognising that key stakeholders (depending on the job this might be faculty, senior administration etc) are very busy but ensuring you build up good working relationships with them. \n\nYour friend should also recognise the pressures that faculty are under - teaching loads, research loads, committee work, and having to secure funding. Being aware of that and that you need to support them even when you need them to do something is important.\n\nLastly, this is probably less relevant to your friend but may be something to look into, we are an open access organisation which affects everything from putting our data in repositories to our technology transfer strategy. A lot of people coming from industry, and especially our lawyers, really struggle with the idea of giving stuff away, not aggressively protecting IP and taking on the risk in projects to enable smaller partners to collaborate. It's a huge adjustment when you've been working for Google and aggressively pushing supply partners.",
      "author": "ACatGod",
      "created": 1626426801,
      "upvotes": 3,
      "replies": {
        "h5hlxmp": {
          "link": "/r/AskAcademia/comments/oky99f/interviewing_for_an_administrative_positionrole/h5hlxmp/",
          "text": "Thank you so much for taking the time to provide some thoughts and write out your response! Upon speaking with her, she explained that it was a position as an administrative assistant at the Business department at the institution. My understanding is that she’d act as a liason between faculty and students, and one of her responsabilities would be helping with enrollment of students into online courses. I did talk with her about the differences in culture of industry (she comes from the field of finance) vs academia. I told her she should focus on the explaining why she’s making the transition to academia and why she’d like to work at that particular institute. She told me she’d gone back to school, I also told her that she should touch on how her experience as a nontraditional student would help her to guide and relate to the community she’d be serving. We talked about some other experiences she could touch upon, but won’t go into detail here. Im glad that what you touched on as overlapp with what we discussed! Thank you once again for your help!",
          "author": "Usera27",
          "created": 1626501920,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}