{
  "sid": "pq28ag",
  "link": "/r/AskAcademia/comments/pq28ag/manuscript_decision_is_ready_but_they_are_waiting/",
  "title:": "Manuscript decision is ready but they are waiting on \"a few internal checks\" to tell me",
  "text": "I have a manuscript current in the review/publication process. I got the peer reviews back, addressed all the concerns/suggestions and submitted my revisions 4 months ago. One month ago I asked the journal for an update and they said:\n\n>At this time, the Academic Editor has submitted their decision. I'm sorry for the delay in getting the decision letter to you. There are a few internal checks that are performed at this point in the process to ensure that the peer review was completed in line with our journal requirements.\n\nIs it normal for \"a few internal checks\" to take a month?\n\nIs it impatient of me to email and ask for another statues update?\n\nDo you think this response bodes well for me? As is does this mean they are leaning towards accepting it if they need to do more checks?",
  "author": "VforValmont",
  "created": 1631892167,
  "updated": 1634078963,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hd7ve0p": {
      "link": "/r/AskAcademia/comments/pq28ag/manuscript_decision_is_ready_but_they_are_waiting/hd7ve0p/",
      "text": "The answer to first question, No. Perhaps delays due to some reason, pandemic or otherwise. Give them time if u r in no hurry.",
      "author": "redditigon",
      "created": 1631892885,
      "upvotes": 3,
      "replies": {}
    },
    "hd86mgk": {
      "link": "/r/AskAcademia/comments/pq28ag/manuscript_decision_is_ready_but_they_are_waiting/hd86mgk/",
      "text": "This is definitely too long. 4 months is a long time to hear back from the first round of reviews, let alone the second round where they're sending the revisions to the same reviewers who should mainly be checking to see if their points were addressed. I'm inclined to think the paper is going to be accepted, because why would they waste so much time on something they're rejecting? But you followed up a month ago and STILL haven't heard back. That's ridiculous. \n\nI don't think you're being impatient if you contact them again, in fact you've been excessively patient in my opinion. If you haven't already, check your spam folder just in case something got sent there (I've had emails from my PI, who's at the same university as me, get sent to spam before, so it's entirely possible). If nothing is there, then you absolutely should contact them back. Be respectful, but let them know that this extended amount of time to receive a response is having a significant and negative impact on your ability to apply for funding related to the paper. At the very least, ask for more detail on what exactly is remaining for these internal checks so you know when to expect a response by. \n\nGood luck, I hope it all works out!",
      "author": "MightyMitos19",
      "created": 1631897577,
      "upvotes": 4,
      "replies": {}
    },
    "hda5wc4": {
      "link": "/r/AskAcademia/comments/pq28ag/manuscript_decision_is_ready_but_they_are_waiting/hda5wc4/",
      "text": "It probably means that the editor felt that the revisions you made were fairly major and/or the subject matter was outside their direct area of expertise, so they needed to put it out for review again - probably to the original reviewers.",
      "author": "pixiepasty",
      "created": 1631929823,
      "upvotes": 1,
      "replies": {}
    }
  }
}