{
  "sid": "b2qhna",
  "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/",
  "title:": "Did your parents attend your thesis defense?",
  "text": "so, this may be a stupid question but i would definitely appreciate some input...my masters thesis defense is at the end of april. the room i'm holding it in is a conference room, there are probably about twenty chairs down a long table. this information feels necessary for me to report for some reason. for some reason, this set up seems less comfortable for me to have my parents present than if it were in a more lecture style room. is it normal for parents to come to a thesis defense? would i be a super weirdo if they did? \n\ni'm a first gen american and college student, so i'm the first in my family to do something like this and my parents are very proud. my dad would really like to attend, but i don't want him to if it will be odd. ",
  "author": null,
  "created": 1552955672,
  "updated": 1634081840,
  "over_18": false,
  "upvotes": 116,
  "upvote_ratio": 0.98,
  "comments": {
    "eiug9hm": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiug9hm/",
      "text": "PhD thesis defense are generally public, anyone can attend and its really very normal for friends and family to be there. Whether master thesis defenses are public or not depend on the school. I wouldn't think inviting your parents is weird. Maybe just check in with your supervisor about your intentions, but really there shouldn't be an issue. Goodluck!!",
      "author": "DawieKabouter",
      "created": 1552958291,
      "upvotes": 58,
      "replies": {
        "eiv59y3": {
          "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiv59y3/",
          "text": "Your country bias is showing! This is definitely not true for the UK. ",
          "author": "liedra",
          "created": 1552985508,
          "upvotes": 38,
          "replies": {
            "eiv8coh": {
              "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiv8coh/",
              "text": "For those curious, here in the UK we tend to have closed door thesis defenses - you and a panel across a table, that's it. I'm only in the first year of my PhD, but I've had friends do theirs.",
              "author": "geol_and_anon",
              "created": 1552990435,
              "upvotes": 8,
              "replies": {
                "eiv8xwz": {
                  "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiv8xwz/",
                  "text": "Yeah, I was getting really confused for a minute - every one of my friends that has had their viva was behind closed doors!\n\nIronically, my master’s viva was public and my friends from my cohort attended, as I did for theirs.",
                  "author": "ayeayefitlike",
                  "created": 1552991261,
                  "upvotes": 9,
                  "replies": {}
                },
                "ek94uvy": {
                  "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/ek94uvy/",
                  "text": "At my university in the US, we have an open-doors presentation-style \"defense\" followed by the closed-doors actual thesis defense. ",
                  "author": "LivingByChance",
                  "created": 1554566201,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "eiw4e8j": {
              "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiw4e8j/",
              "text": "I’m in the U.K. and our vivas are public so I guess it depends where you are!",
              "author": "DevilInHerHeart_",
              "created": 1553015473,
              "upvotes": 4,
              "replies": {}
            },
            "eivchym": {
              "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eivchym/",
              "text": "Curious, I was ambitious in my extrapolation :) I have a sample of two. And since we inherited our academic system from the UK, I assumed it is the same there.\n\nEDIT: To clarify, my frame of reference is from my experience in South Africa and Australia. Both past British colonies.",
              "author": "DawieKabouter",
              "created": 1552995504,
              "upvotes": 0,
              "replies": {
                "eivk6xc": {
                  "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eivk6xc/",
                  "text": "Lol. There are some substantial differences between the US and UK systems. And I wouldn't really say the US inherited the system from the UK... The Indian system is more similar to the British one than the US... In the sense that they also inherited from the UK. ",
                  "author": "tardarsource",
                  "created": 1553002284,
                  "upvotes": 4,
                  "replies": {
                    "eix40dw": {
                      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eix40dw/",
                      "text": "My frame of reference is from my experience in South Africa and Australia. Both past British colonies, hence the UK influence.",
                      "author": "DawieKabouter",
                      "created": 1553038763,
                      "upvotes": 2,
                      "replies": {
                        "eix8usl": {
                          "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eix8usl/",
                          "text": "So you have no experience with the US and are just throwing random thoughts around in case one sticks. (i.e. What does Australia have to do with the US...)",
                          "author": "tardarsource",
                          "created": 1553042260,
                          "upvotes": 1,
                          "replies": {
                            "eixbbrw": {
                              "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eixbbrw/",
                              "text": "My bad, I somehow missed that OP was looking for an american perspective. I was just throwing my 2 cents in the ring based on my experience.",
                              "author": "DawieKabouter",
                              "created": 1553044064,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "eiv5ud9": {
          "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiv5ud9/",
          "text": "This was the case for me. For my master's, I would not want my parents there. For the PhD thesis, yes ",
          "author": "Zifnab_palmesano",
          "created": 1552986447,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "eiudia5": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiudia5/",
      "text": "Mine didn't and I didn't want them to come. The committee can look pretty hostile for people not acquainted with this kind of procedure, and I have seen relatives quite stressed even with a very tame committee. ",
      "author": "BarkingPorsche",
      "created": 1552956174,
      "upvotes": 117,
      "replies": {
        "eiug4z5": {
          "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiug4z5/",
          "text": "This happened at my dissertation defense! My mom came and afterwards she was like, “who was that asshole asking all those questions?” Lol. I was glad to have her there, though. ",
          "author": "tootsunderfoots",
          "created": 1552958194,
          "upvotes": 79,
          "replies": {
            "eiv08kx": {
              "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiv08kx/",
              "text": "The nitpicking pedantry begins way earlier in the process. Halfway through my dissertation process I assumed I was the worst writer in the history of writing. Every modicum of irrelevant bullshit is critiqued. And you are made to redo it, and redo it, and redo it until every wrinkled English Composition chair can get off on the satisfaction that not a single infinitive was split, nor single phrase was uttered in passive voice.",
              "author": "Prof_Acorn",
              "created": 1552977761,
              "upvotes": 14,
              "replies": {
                "eiv4ssa": {
                  "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiv4ssa/",
                  "text": "was uttered *by whom*?",
                  "author": "ModernContradiction",
                  "created": 1552984735,
                  "upvotes": 14,
                  "replies": {}
                },
                "eiw1vge": {
                  "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiw1vge/",
                  "text": "If they are critiquing your writing it either means your writing is so bad they can't understand your research or that they have no issues with your actual research. Usually you have a really good idea which of the two it is.",
                  "author": "starship-unicorn",
                  "created": 1553013893,
                  "upvotes": 6,
                  "replies": {
                    "eiwdpk9": {
                      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiwdpk9/",
                      "text": ">or that they have no issues with your actual research.\n\nSo why critique anything then?\n\nJust once I wanted to hear \"This chapter is great. No edits needed.\"",
                      "author": "Prof_Acorn",
                      "created": 1553021322,
                      "upvotes": 1,
                      "replies": {
                        "eiwep5r": {
                          "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiwep5r/",
                          "text": "Because your research is fine and your writing needs refinement. If the research was the problem, they would almost certainly be ignoring any grammar issues. Fixing grammar sucks, but it is way easier than fixing a flawed research design, botched data collection, complete misunderstanding of theoretical grounding, etc. Plus, grammer fixes can be outsourced to someone else if the cost is worth less to you than the time and effort it would take to fix and learn yourself. But outsourcing the research itself is obviously a terrible plan.",
                          "author": "starship-unicorn",
                          "created": 1553021970,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "eivc9tk": {
                  "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eivc9tk/",
                  "text": "Its just preparation for what you will spend the rest of your life doing if your career will involve peer reviewed research ",
                  "author": "abandoningeden",
                  "created": 1552995259,
                  "upvotes": 4,
                  "replies": {}
                },
                "eivvtlq": {
                  "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eivvtlq/",
                  "text": "Pardon me, but was a prepositional phrase just used to end a sentence? *Tsk tsk tsk.*",
                  "author": "Guluronate",
                  "created": 1553010092,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "eius4ke": {
              "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eius4ke/",
              "text": "This made me laugh and I'd probably be entertained if that happened.",
              "author": "NTGuardian",
              "created": 1552968049,
              "upvotes": 12,
              "replies": {}
            }
          }
        }
      }
    },
    "eiudwjo": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiudwjo/",
      "text": "Mine attended my PhD defense - it was an open defense, so there were others in the room, too. I was nervous about having them there, but it was really wonderful! Ask your advisor if it is an open/public defense, and if it is, invite your parents!",
      "author": "Galactica13x",
      "created": 1552956474,
      "upvotes": 68,
      "replies": {
        "eivnefy": {
          "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eivnefy/",
          "text": "Ditto, but I told them they had to sit where I couldn't see them. ",
          "author": "ZenosBrownie",
          "created": 1553004648,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eiuezfw": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuezfw/",
      "text": "No, and I only can think of one person whose parents went to theirs out while I was in grad school. It was more common for significant others to attend",
      "author": null,
      "created": 1552957314,
      "upvotes": 25,
      "replies": {}
    },
    "eiudq8r": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiudq8r/",
      "text": "My parents attended my PhD defense, and I loved having them there. Sure they didn't understand everything, but seeing their smiling faces in the room  really calmed me. I was in a conference room too, with limited seating. As long as your committee has priority on where to sit, I really don't see an issue with your parents attending. If you have concerns, talk to your advisor. Otherwise, enjoy them being proud of you! Congrats!",
      "author": "ekochamber",
      "created": 1552956339,
      "upvotes": 56,
      "replies": {}
    },
    "eiugqgd": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiugqgd/",
      "text": "I preferred to celebrate with my adviser and colleagues at/after the defense and then with my family at graduation. I think that's a fair compromise, but I was also a first gen college student so I don't think my family really understood the importance of the defense.",
      "author": "psychoyooper",
      "created": 1552958661,
      "upvotes": 20,
      "replies": {
        "eiwxsvq": {
          "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiwxsvq/",
          "text": "If your family doesn't consist of academics, it's unlikely they even know what a phd involves.  I had to explain the process to every family member, because it was such a foreign concept to them that they couldn't even relay the process to another family member for me.  Not without getting every possible detail wrong anyway.",
          "author": "KansaiBene",
          "created": 1553034374,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eiuk4ly": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuk4ly/",
      "text": "My parents attended though they were throughly threatened that if they asked a question (during the part of the defense attendees are allowed to ask questions) that I would never speak to them again. \n\nMy daughter, who was 5 at the time, also attended my defense. She raised her hand to ask a question and my committee gave her the opportunity to ask her question. \n\nMy defense was also attended by a number of graduate students at various stages of working on their doctorate as well as many friends. One of my committee members, who was totally worthless, attended my defense remotely (web conferencing). ",
      "author": "red_ajah",
      "created": 1552961294,
      "upvotes": 28,
      "replies": {
        "eiunqfe": {
          "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiunqfe/",
          "text": "May I ask what your daughter’s question was? She sounds like a cutie ",
          "author": null,
          "created": 1552964180,
          "upvotes": 36,
          "replies": {
            "eivbngu": {
              "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eivbngu/",
              "text": "Her question was about why it took me so long to finish my dissertation. Note I only worked on my dissertation for a little less than a year. My major professor damn near fell out of his chair as I was the only candidate he has ever worked with to finish the dissertation phase in less than three years.\n\nWhen you are five and your mom is working 18 hrs/day to finish her thesis, a year is a very long time. ",
              "author": "red_ajah",
              "created": 1552994569,
              "upvotes": 24,
              "replies": {}
            }
          }
        }
      }
    },
    "eiudi3h": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiudi3h/",
      "text": "Yes they did!",
      "author": "NeuroscienceNerd",
      "created": 1552956170,
      "upvotes": 19,
      "replies": {}
    },
    "eiuh12z": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuh12z/",
      "text": "Totally have them come - not odd at all, my parents were at mine and my spouse's parents were at hers. Mine was in a small classroom and we filled it. My spouses was at a long table and we overflowed ;-)\n\nYou have been a student for a long time, might as well let them enjoy the dog and pony show at the end of it. :-)\n\nTruly, let them be proud. Be proud yourself. Enjoy it. If you have the same fear as me - I understand, I was scared of failing until the day of. I told my brothers not to fly home for it - I shouldn't have. Life is weird.  \n\n\nJust noticed this might be for a Master's defense, I think everything still stands if everyone is local or if you are not going any further. ",
      "author": "GetCookin",
      "created": 1552958894,
      "upvotes": 16,
      "replies": {}
    },
    "eiuhmrs": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuhmrs/",
      "text": "They should come if you want them to. I have seen numerous people have them attend.\n\nFor me- my (now) ex-wife came, and a couple students from my program... but there were like 5 people total besides the committee.\n",
      "author": "airwalker12",
      "created": 1552959360,
      "upvotes": 8,
      "replies": {}
    },
    "eiuf52t": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuf52t/",
      "text": "I had friends and family at my doctoral defense. Not weird.",
      "author": "rhetoricetc",
      "created": 1552957433,
      "upvotes": 13,
      "replies": {}
    },
    "eiukz2q": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiukz2q/",
      "text": "My *undergraduate* honors thesis defense was attended not only by my girlfriend (now wife) but one of our best friends as well. I mention this because it was held over a weekend at a mountain lodge, so was really cool.\n\nMy doctoral dissertation defense was attend by exactly nobody: just me and my four committee members in a room. I had already taken a job and left town, so flew back for the defense. But in our department nobody ever went to them anyway. I didn't even think to invite my parents, who lived 3,000 miles away.  I didn't attend graduation for my Ph.D. or my second masters, though my parents did come for the ceremony for my first master-- in part because it was a Big Deal at a Fancy Univertsity.\n\nI know friends from other schools have had relatively large audiences at defenses, including family. I would simply ask your chair what typical practice is and base you decision on that-- and your own desires.",
      "author": "SnowblindAlbino",
      "created": 1552961954,
      "upvotes": 5,
      "replies": {}
    },
    "eiut2nx": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiut2nx/",
      "text": "My MS was closed, but PhD was public. Told my parents I cared more about them attending my defense than graduation. They came out along my brother and his wife. Had a ton of the students I TAed and mentored show up, so my defense felt more like a victory lap than a contentious debate. I also knew my committee and was pretty confident of things going smoothly. \n\nHeck, my dad even taped it, so I have my defense in all its SD glory. Kinda hurts to watch now, I've really grown as a speaker since then. ",
      "author": "racinreaver",
      "created": 1552969002,
      "upvotes": 6,
      "replies": {
        "eiw3l32": {
          "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiw3l32/",
          "text": ">  Kinda hurts to watch now, I've really grown as a speaker since then.\n\nMaybe this should be the corollary to \"never go back and read your PhD thesis\": \"never go back and watch your thesis defense, should you be so unfortunate as to have it on video.\"",
          "author": "justaboringname",
          "created": 1553014965,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eiuf1n2": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuf1n2/",
      "text": "Mine attended.  Even my in-laws that were super uncomfortable cause no one in their family ever went beyond a bachelor's.  None of my relatives understood what was going on but it was great having them there.  They waited around for after I had my closed portion with just my committee.  I don't know if you have do to that part but it was nice to have them there when I found out I passed and officially got my PhD.",
      "author": "AimanaCorts",
      "created": 1552957359,
      "upvotes": 12,
      "replies": {}
    },
    "eiuiseg": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuiseg/",
      "text": "My family did not attend my defense, but I did livestream it so they could tune in. They could still be part of it, I did not have to worry about any of their travel logistics, and I could go out and celebrate with my fellow graduate students afterward. Graduation events tend to be better geared towards family with the pomp and such.",
      "author": "seis-matters",
      "created": 1552960261,
      "upvotes": 4,
      "replies": {}
    },
    "eiv5exs": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiv5exs/",
      "text": "This has to be one of the more bizarre traditions I’ve seen from other countries! I didn’t have a defence in Australia (written reports from examiners only) and in the UK they are very closed to the examination team, a supervisor to take notes (but otherwise be very quiet) and perhaps another academic observer (for early career academics who want to examine PhDs).",
      "author": "liedra",
      "created": 1552985740,
      "upvotes": 5,
      "replies": {
        "eivcgy5": {
          "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eivcgy5/",
          "text": "Even supervisors often don't go! At my uni I've never heard of a supervisor sitting in ",
          "author": "crownsandclay",
          "created": 1552995475,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eiudtq7": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiudtq7/",
      "text": "That's not weird! I'm not there yet, but every defense I've seen has had parents in attendance. ",
      "author": null,
      "created": 1552956413,
      "upvotes": 6,
      "replies": {}
    },
    "eiuhra9": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuhra9/",
      "text": "Mine did, and it really made it more special. My defense was held in a small basement conference room (thanks, terrible schedulers!) with about 12 or so chairs around a table, and a few more along the wall. My dad had to work, but my mom came and sat along the wall, along with a couple of my friends and grad school colleagues. \n\nIn all fairness, my thesis was a \"project\" so to speak, which had already been presented in its appropriate setting, so my defense was more of a conversation with my committee. There were some tough questions, but it wasn't overly intense, so I don't think it came across as stressful or hostile to the onlookers.\n\nGood luck with your defense!",
      "author": "bennetinoz",
      "created": 1552959458,
      "upvotes": 3,
      "replies": {}
    },
    "eiula11": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiula11/",
      "text": "My parents wanted to come for graduation and I told them to come to the defense instead.  Idk if the rules are different for masters though.",
      "author": "intirb",
      "created": 1552962195,
      "upvotes": 3,
      "replies": {}
    },
    "eiuqo0j": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuqo0j/",
      "text": "No, I didn’t realize this is a thing for your masters.  I was 30, married, and 800 miles away from my parents, and it never occurred to me that you would invite anyone.  I didn’t even invite my husband.  Then again, my defense was basically “your research was great, good writing” and some chatting about my thesis.  Everyone came to my graduation, where I skipped out early after crossing the stage because I was hot, hungry, and pregnant.",
      "author": "postcardigans",
      "created": 1552966685,
      "upvotes": 3,
      "replies": {}
    },
    "eiut9cs": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiut9cs/",
      "text": "While my parents did not attend my PhD defense, which was open to the public, half of the defense's I've attended over the years included parents or close relatives. It's not odd at all. I've even seen parents ask questions, which was very endearing.",
      "author": "wondert",
      "created": 1552969193,
      "upvotes": 3,
      "replies": {
        "eiw3sr3": {
          "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiw3sr3/",
          "text": "I would have fallen over on the spot if my mom had asked a question at my defense, mostly because she's an accountant and has zero understanding of (or interest in) atmospheric chemistry.",
          "author": "justaboringname",
          "created": 1553015099,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eiv69e3": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiv69e3/",
      "text": "As someone from the UK it blows my mind that Americans do this. Here it is only people actually involved that are there, and it’s a formal thing through and through.",
      "author": null,
      "created": 1552987141,
      "upvotes": 3,
      "replies": {
        "eiw3p0m": {
          "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiw3p0m/",
          "text": "We do that with the advancement to PhD candidacy, but once you've gotten the thesis written and your advisor says you're OK to defend it, we tend to assume you've gotten your shit more or less figured out.",
          "author": "justaboringname",
          "created": 1553015033,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eiukl0u": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiukl0u/",
      "text": "Haven’t graduated yet but I know I’ll invite mine to my PhD defense, but only because both of them have been through it (Mom masters and Dad PhD) so I know they’d appreciate the chance. Like some others have said though, I don’t think I’d invite them if they hadn’t also done it, because it can be harsh for them to see and potentially distracting for me",
      "author": "kendeh",
      "created": 1552961646,
      "upvotes": 2,
      "replies": {}
    },
    "eiuo8p3": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuo8p3/",
      "text": "In my institution we have a closed defense and then an open defense. In the former, the committee is expected to be total hostile assholes and put you under fire. This is the \"real\" defense where the chance of failure is highest. If you pass it, the open defense is intended for you to show off to your friends and family - the commitee will make sure that you made the appropriate changes, but will in general be tamer. For us it's mostly ceremonial and the families are expected to be there. I'd ask around to see if it's usual for family to attend at your institution.",
      "author": "_giskard",
      "created": 1552964594,
      "upvotes": 2,
      "replies": {}
    },
    "eiup5sq": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiup5sq/",
      "text": "My parents came to my PhD defense. They couldn’t follow along with my research but wanted to support me. It was in a small lecture style room with about 24 seats which did actually fill up. ",
      "author": "Maddprofessor",
      "created": 1552965353,
      "upvotes": 2,
      "replies": {}
    },
    "eiuqzmf": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuqzmf/",
      "text": "Not me, but I went to my friend's PhD defense. She had already cleared it with her panel. Her husband and her other friend brought presents and cake, and I brought balloons. :) It was cool! And afterwards I got to talk to a famous (in academia) feminist scholar that was on the panel. ",
      "author": "set_phrases_to_stun",
      "created": 1552966982,
      "upvotes": 2,
      "replies": {}
    },
    "eiusehb": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiusehb/",
      "text": "A colleague's mother came all the way from Russia to attend the PhD defense. It was great to see and you should definitely invite them. The person in question definitely appreciated the support and the mother was more than happy to make tasty food for the defense, which everyone attending appreciated.",
      "author": "dementor500",
      "created": 1552968323,
      "upvotes": 2,
      "replies": {}
    },
    "eiuykl2": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuykl2/",
      "text": "It may be a little odd. But you have the right to record it, maybe try that out? My master's defense was very very tame. Didn't take long, wasn't very probing in the questions at all. Get the PhD and invite them to that one.",
      "author": "FakeyFaked",
      "created": 1552975523,
      "upvotes": 2,
      "replies": {}
    },
    "eiui1w5": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiui1w5/",
      "text": "I loved having mine there! My parents were a huge support throughout my studies, and everyone was very welcoming of them being there too. Everyone’s defense seems to be reflective of them as a person. I’ve known some to be pretty much just them and the committee, some who invite their SO and university friends, and others (like me) who invited everyone under the sun (and most came!) \n\nWhile going through my Ph. D years, earlier cohorts seemed less family focused, so I worried that my intention to have my family there would be “odd”. However, by the time my cohort came around 4:6 of us had family at our defense. It’s what suited us and made us happy. One girl, originally from Bolivia, even had worked with the department chair ahead of time so that she could get a Skype-system set up with her parents back home so they could see everything. \n\nPlus, my dad brought some amazing apple fritters as a snack and I’m pretty sure that’s what most people remember rather than my nervous-sleepless-rambling mess. ",
      "author": "graygoohasinvadedme",
      "created": 1552959689,
      "upvotes": 3,
      "replies": {}
    },
    "eiuk4le": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuk4le/",
      "text": "Congrats! My parents did not attend my PhD defense but it would not have been weird if they had. My sister came and I'm so glad she was there. If you want them to be there, you should invite them. Since you'll be the first in your family to get this degree, it might be really nice to have them there so they have a better sense of your work and how academia works. I bet they'll be so proud.",
      "author": "Gggorilla",
      "created": 1552961294,
      "upvotes": 2,
      "replies": {}
    },
    "eiuiwt2": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuiwt2/",
      "text": "My parents asked to attend my defense. It was fine. I did warn them that some defenses get contentious so they knew what to expect. \n\nIt made me nervous until I got started. I’m glad they came though, it really helped them understand what I was working on at the time. ",
      "author": "My_Ears",
      "created": 1552960357,
      "upvotes": 2,
      "replies": {}
    },
    "eius9t3": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eius9t3/",
      "text": "I recently went to a friend's defense in a similar style room. her friends and grandparents sat in \"extra\" chairs around the perimeter of the room and only the committee sat at the long table",
      "author": "ryegrass-reststop",
      "created": 1552968193,
      "upvotes": 1,
      "replies": {}
    },
    "eiuwiya": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuwiya/",
      "text": "Mine attended, and I was so happy to have them and my wife there. It helped calm me down, for sure.",
      "author": "Geldarion",
      "created": 1552972850,
      "upvotes": 1,
      "replies": {}
    },
    "eiv7gj4": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiv7gj4/",
      "text": "Nope.  ",
      "author": "invisible760",
      "created": 1552989077,
      "upvotes": 1,
      "replies": {}
    },
    "eivav90": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eivav90/",
      "text": "I invited mine - it was more meaningful to have them there than at graduation. My program had public defenses - there were over a hundred people in attendance. \n\nAfterwards they helped me pack up and drive 8 hours to start my postdoc the next morning. ",
      "author": "skleats",
      "created": 1552993673,
      "upvotes": 1,
      "replies": {}
    },
    "eiw12zg": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiw12zg/",
      "text": "My family came to my seminar, which was immediately before the defense. I would have been too stressed to have them in there for the actual defense. Also, the defense was almost 3 hours, and my family would have been bored and nervous for me.",
      "author": "likecrazy3311",
      "created": 1553013391,
      "upvotes": 1,
      "replies": {}
    },
    "eiw2yax": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiw2yax/",
      "text": "In belgium (at the KU Leuven, not sure if the other universities are different) we have two sessions: the closed PhD defence and the public one. The closed one actually decides if you’re going to graduate, and it’s where the professors will ask the difficult questions. The public one is for family and friends and is basically a mini show where the professors wear robes and there’s a reception afterwards. \n\nFor masters, there’s no public one just the private one. ",
      "author": "Amytheforevercurious",
      "created": 1553014568,
      "upvotes": 1,
      "replies": {}
    },
    "eiw3b3l": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiw3b3l/",
      "text": "My mom and fiance came to mine, but it was in a lecture-style room instead of a conference room. I think you're right that there's a difference. That being said, if your defense is open to the public and they want to come, there's absolutely no reason not to have them there because they're partly responsible for your success (plus they're probably proud as hell).",
      "author": "justaboringname",
      "created": 1553014790,
      "upvotes": 1,
      "replies": {}
    },
    "eiw3ia8": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiw3ia8/",
      "text": "My institution has partly open door then closed door. So like your regular presentation where you are just talking then questions from the audience- then they dismiss the audience and then the committee rails you until they run out of stuff. Then they dismiss you and bring you back. But yeah the committee generally doesnt talk while the audience is there. I plan on bringing my parents and siblings to the audience portion. ",
      "author": null,
      "created": 1553014915,
      "upvotes": 1,
      "replies": {}
    },
    "eiwa4u4": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiwa4u4/",
      "text": "I am a first gen student as well, and my parents came to my defense. I really wanted them there and they wanted to be there. My defense was public and in a lecture room with more seating, but I think if your defense is public and you want them there then it should be no problem. Are you able to defend in a larger room, it might make you more comfortable?\n\n&#x200B;",
      "author": "mstarrs",
      "created": 1553019114,
      "upvotes": 1,
      "replies": {}
    },
    "eiwa7me": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiwa7me/",
      "text": "Wouldn't be weird at all!! Almost everyone in my department has their parents (& sometimes siblings too) come to their defense and I will too. If I weren't across the country and expensive to get to I'm sure my whole extended family would want to come lol! ",
      "author": "spec_of_cp",
      "created": 1553019161,
      "upvotes": 1,
      "replies": {}
    },
    "eiwbam3": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiwbam3/",
      "text": "It's not something that I've seen happen at my school but it would probably not be weird as long as they're not disruptive. You could talk to your advisor and see what they say. I personally am planning on not having my parents there and telling them not to come if they ask, but we have a not-great relationship and them being there would add waaaay more stress to an already-stressful event. ",
      "author": "bbbright",
      "created": 1553019825,
      "upvotes": 1,
      "replies": {}
    },
    "eiufjao": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiufjao/",
      "text": "No",
      "author": "Monkey_Brain_Oil",
      "created": 1552957734,
      "upvotes": 1,
      "replies": {}
    },
    "eiuilry": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuilry/",
      "text": "They came and it was great!",
      "author": "Average650",
      "created": 1552960118,
      "upvotes": 1,
      "replies": {}
    },
    "eiukec4": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiukec4/",
      "text": "Yup, plus my sister and boyfriend. I think it's up to you and your supervisor!",
      "author": "chipmonkey_763",
      "created": 1552961503,
      "upvotes": 1,
      "replies": {}
    },
    "eiuvc6i": {
      "link": "/r/AskAcademia/comments/b2qhna/did_your_parents_attend_your_thesis_defense/eiuvc6i/",
      "text": "From these comments it sounds like this really depends on the program and department. In principle it’s not weird (if it’s a public defense) but in my program it’s more of a professional thing with committee members and lab members in attendance, maybe a significant other at most. It would be pretty weird and unusual to have your parents there and personally that would not remotely interest me. It’s up to you! ",
      "author": "ourannual",
      "created": 1552971443,
      "upvotes": 1,
      "replies": {}
    }
  }
}