{
  "sid": "r4t9zu",
  "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/",
  "title:": "I need a reference letter, i have asked several professors in my unversity, but they claimed that they don't have time , so can i submit one by myself or it's a bad idea .",
  "text": "I was thinking sending one by myself ,do you think i will get caught up .\nAnd how do they verify the letter.\nIf you have any suggestions please let me know\nThanks.",
  "author": "chomakher",
  "created": 1638182954,
  "updated": 1639840003,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hmirnf4": {
      "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmirnf4/",
      "text": "I don't understand, are you suggesting that that you will forge a letter from a professor who refused to write you one?",
      "author": "polyphonal",
      "created": 1638186092,
      "upvotes": 9,
      "replies": {
        "hmk5z0w": {
          "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmk5z0w/",
          "text": "He did not refused , he ask me to write the letter and he will just sign it",
          "author": "chomakher",
          "created": 1638210317,
          "upvotes": 1,
          "replies": {
            "hmkywmh": {
              "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmkywmh/",
              "text": "This is a normal practice. I ask my students to do this, even ones I think are fantastic, and then edit how I see fit. I have taught hundreds of students in the past few years, so even the details of the memorable may get mixed up. This approach is the best outcome for everyone involved.",
              "author": "Ok-League-2953",
              "created": 1638221898,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmiq6gu": {
      "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmiq6gu/",
      "text": "You can submit and write many documents including personal or intent statements, but you cannot generally submit a letter of recommendation or serve as a reference for yourself that is written by you. (And definitely don’t sign someone else’s name to a letter you write without their knowledge as though they had written it.)\n\nAs a previous commenter mentioned, some professors will ask you to list out some important things to highlight which they then use in their letter and sign off on, but if they have told you they don’t have time, I wouldn’t push that. If someone can write a strong and positive letter on your behalf, they will make time to help with this. \n\nConsider which other professors you believe can write in on your behalf. Email or tell them about your new endeavor and how you believe you are well suited for it and how your work, knowledge, or behavior in their class has prepared you for this next step. Then ask if they can write for you.\n\nIf you have to ask “how do they verify the letter”, then whatever you have in mind is probably not a good idea. Your integrity (and the integrity of your work) should be of great importance to you even when you aren’t immediately called out on things. Also, keep in mind that it’s a small word and people know people.\n\nIt sounds like you need to continue to ask around or think of some other options. (Does it need to be from a professor or can it be a college staff member, boss, high school teacher, personal reference, etc.?) \n\nYour college career center or student services offices may have some insight for you to consider.",
      "author": "REC_HLTH",
      "created": 1638184959,
      "upvotes": 6,
      "replies": {}
    },
    "hmiw1g1": {
      "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmiw1g1/",
      "text": "Forging a letter is an extremely bad idea.",
      "author": "meanmissusmustard86",
      "created": 1638189160,
      "upvotes": 6,
      "replies": {}
    },
    "hmjeeqv": {
      "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmjeeqv/",
      "text": "As a professor I can decode their reply for you. They simply don't want to recommend you. We generally like to write letters for students we legitimately think are exceptional. If I had to guess I suspect your apparent willingness to forge a letter is likely related to their unwillingness to write you a letter.",
      "author": "mathisfakenews",
      "created": 1638198925,
      "upvotes": 5,
      "replies": {
        "hmjyxcp": {
          "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmjyxcp/",
          "text": "Such an underrated comment this! 🔥",
          "author": "caspartheholyghost",
          "created": 1638207527,
          "upvotes": 1,
          "replies": {}
        },
        "hmk59oc": {
          "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmk59oc/",
          "text": "That's not the case here , actually many students in my class request a recommendation letter from the teachers because of a scholarship. Duo to the large number the teacher sayed that he can't give all of us , so he told me to write my own . And he will just sign it",
          "author": "chomakher",
          "created": 1638210042,
          "upvotes": -3,
          "replies": {
            "hmmjqgg": {
              "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmmjqgg/",
              "text": "This sounds horribly unethical.",
              "author": "smallthingsrock",
              "created": 1638247446,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hmiwgup": {
      "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmiwgup/",
      "text": "So either you left it too late to ask for letters or your professors are letting you down gently by not giving you one. Either way you need to accept your lot and not commit *actual forgery*.",
      "author": "foibleShmoible",
      "created": 1638189439,
      "upvotes": 3,
      "replies": {}
    },
    "hmioa8x": {
      "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmioa8x/",
      "text": "Usually they don't verify but you can Write IT and ask for a signature.",
      "author": "The-Noobmaster1",
      "created": 1638183430,
      "upvotes": -1,
      "replies": {}
    },
    "hmircz8": {
      "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmircz8/",
      "text": "You can't send one with your own name on it but see if you can find someone who would be happy to sign off on one you wrote.",
      "author": "ACatGod",
      "created": 1638185875,
      "upvotes": 1,
      "replies": {}
    },
    "hmlc0t6": {
      "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmlc0t6/",
      "text": "Assuming that you are saying that the professor has agreed to provide you a letter of reference but asked you to write it, that is not unusual.  \n\nI will note that it is very unusual for the professor to not actually submit the letter.  Likewise, it would be very unusual for you to directly submit the letter.  These are almost always submitted anonymously (I.e., you don’t know what they say).  This is by design.  What is almost always the case these days is that you submit an application electronically which includes contact information for your letter writers.  They then receive a request to submit their letters electronically through a similar portal to yours.  I suppose it might happen but I cannot imagine any circumstances under which a professor would allow you to actually upload and submit the document.  Even if I asked you to write it for whatever reason, I would still want to see it.  Regardless of who wrote it, the letter reflects (either poorly or well) on me.  Reputation is a rare and precious commodity that is usually closely guarded for good reason. It’s hard to earn and easy to lose.\n\nIf, on the other hand, it is more along the lines of what others are suggesting (which honestly is how your post reads) then you should find alternative letter writers.",
      "author": "DicaxErsatz",
      "created": 1638227382,
      "upvotes": 1,
      "replies": {}
    },
    "hmnjw7v": {
      "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmnjw7v/",
      "text": "Yeah, your first post and title grossly misrepresent what actually is happening. What seems to be happening is more common than you might think. What your initial post suggested is purely unethical",
      "author": "pkollias",
      "created": 1638274336,
      "upvotes": 1,
      "replies": {}
    },
    "hmus0fs": {
      "link": "/r/AskAcademia/comments/r4t9zu/i_need_a_reference_letter_i_have_asked_several/hmus0fs/",
      "text": "It’s not uncommon for professors to ask to write it yourself and then they’ll just sign, but it’s generally a bad idea. It’s very easy to tell when a letter is a genuine recommendation and when is a recommendation to *not* accept you, which is your case. LORs will be the only important part of your application packet until your ability to print money becomes more important (a position which 99% of people will never even reach), so getting good at networking and making productive connections with your seniors is a skill which you should develop ASAP.",
      "author": "tpolakov1",
      "created": 1638397353,
      "upvotes": 1,
      "replies": {}
    }
  }
}