{
  "sid": "j1yk75",
  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/",
  "title:": "Advice to your younger academic self",
  "text": "If you could go back and tell your younger self one thing about academia or the PhD process, what would you say? What did you wish you had known early on? I’ve been asked to speak at an induction day for new PhD students and would love to hear your experiences/advice (as students and/or supervisors) - and to share them with my group and others on here. Apologies if there’s a recent thread on this.",
  "author": "ZacharyEzraRawlins",
  "created": 1601383763,
  "updated": 1634080635,
  "over_18": false,
  "upvotes": 226,
  "upvote_ratio": 1.0,
  "comments": {
    "g7248c0": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g7248c0/",
      "text": "Choose an advisor who's good at networking and has a very good standing in the community. That really helps.",
      "author": "Ofbearsandmen",
      "created": 1601387054,
      "upvotes": 268,
      "replies": {
        "g728m5s": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g728m5s/",
          "text": "Choose an advisor who will also champion for you.",
          "author": "N1H1L",
          "created": 1601389111,
          "upvotes": 145,
          "replies": {}
        },
        "g7401h3": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g7401h3/",
          "text": "Work with people that will champion you and understand that pushing you also pushes them. Don't be afraid to move onto someonr else. Stop trying to be perfect and get the experiments done that make the big papers. Oh and importantly shout about yourself more, it horrible to do and we all know why, but it's needed more and more these days. Be happy in what you do and make sure it's developing your career not someone else's. I would say trust no one as well but that's a little too x files. But as everyone is climbing over one another for the few academic jobs around remember that the ones doinh the work aren't always the ones recognised or promoted. Oh and have a family earlier. Don't wait. Life's too short x",
          "author": "_Fallen_Azazel_",
          "created": 1601416697,
          "upvotes": 18,
          "replies": {}
        },
        "g72kofz": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72kofz/",
          "text": "I remember hearing this before applying, but the real problem is the good advisor should choose you. Coming from low tier universities you will most likely be rejected by top researchers.",
          "author": null,
          "created": 1601394224,
          "upvotes": 43,
          "replies": {
            "g72l88z": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72l88z/",
              "text": "As someone who now hires PhD students I'd say this is only partially true. Coming from a top university helps, not going to lie. But if you're good and show strong motivation you have a chance.",
              "author": "Ofbearsandmen",
              "created": 1601394443,
              "upvotes": 42,
              "replies": {
                "g73i4v0": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73i4v0/",
                  "text": "My own advisor told me once, *I hired 3 students from that school, they all turned out great. I will seriously look at future candidates from that school. And the reverse is true too.*",
                  "author": "N1H1L",
                  "created": 1601408456,
                  "upvotes": 15,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g724f0q": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g724f0q/",
      "text": "Find an advisor with a track record of getting their students graduated and hired.  I went with someone who was an authority in their field to the detriment of all else, and regretted it ever since.",
      "author": "DieMensch-Maschine",
      "created": 1601387150,
      "upvotes": 151,
      "replies": {
        "g72sqgl": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72sqgl/",
          "text": "Agreed. When I was starting my MS I decided to go with the PI that had a reputation for being a serious hardass, but he consistently got his students graduated in a reasonable time-frame, good connections for employment afterwards, and inclusion on publications.",
          "author": "VentureIndustries",
          "created": 1601397276,
          "upvotes": 34,
          "replies": {
            "g73igq1": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73igq1/",
              "text": "100%. It's far better to work for a hardass whose students consistently graduate on time with a productive PhD rather than a softy with aimless students. *Karen Kelsky* of **The Professor Is In** makes the exact same points too.\n\nRegarding the hardass thing - we had the exact such case in my own department during my PhD. He was a slave driver, and at that time we all pitied his students. Looking back I now see he had a close to 100% completion rate for his PhD students, nobody took more than 5 years for their doctorate, all had at least 4 first author publications, and everyone is successful post their PhD. For all his abrasive behavior, he ensured his students won or came close to winning society awards, and fought hard for his students to be placed at good places. ***I now seriously admire him.***",
              "author": "N1H1L",
              "created": 1601408597,
              "upvotes": 41,
              "replies": {}
            }
          }
        },
        "g728gcf": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g728gcf/",
          "text": "but how do we know that?",
          "author": "ichkaodko",
          "created": 1601389046,
          "upvotes": 22,
          "replies": {
            "g728q3n": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g728q3n/",
              "text": "Look at their alumni.",
              "author": "N1H1L",
              "created": 1601389153,
              "upvotes": 56,
              "replies": {
                "g738hq1": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g738hq1/",
                  "text": "Yeah helps to look at their CV, usually lists past PhD students (in fact, it's a good sign if it does list them)",
                  "author": "lurkergroove",
                  "created": 1601404031,
                  "upvotes": 21,
                  "replies": {}
                }
              }
            },
            "g734ddk": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g734ddk/",
              "text": "Ask their current students. They tend to know how the people in the cohorts before then turned out.",
              "author": "SnowblindAlbino",
              "created": 1601402275,
              "upvotes": 17,
              "replies": {}
            },
            "g73txh9": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73txh9/",
              "text": "find out where and how their past student's are employed, how long it took them to graduate.  These are totally fair questions to ask the prof or their current graduate students.",
              "author": "TourmalineTart",
              "created": 1601413562,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "g725jo6": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g725jo6/",
      "text": "Figure out how to do the PhD in a way that is what you want it to be and makes you happy. Being miserable working day and night for 5+ years, to get a job where you can continue to be miserable, just doesn't make sense.\n\nFor me, that means working 9-5 M-F. I had to come to terms with the fact that doing so might mean I wouldn't get an academic job, but improved my life so dramatically (and I got a job at a school that values work-life balance, and not at schools where I would have hated my life -- living the life you want also serves as a matching mechanism).",
      "author": "openunmarkeddoors",
      "created": 1601387711,
      "upvotes": 84,
      "replies": {}
    },
    "g723b8i": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g723b8i/",
      "text": "1. a huge portion of the job is public speaking, which I did not realize when I started out. \n2. the labor situation is as bad as everyone says.\n3. publish, publish, publish. \n4. a huge portion of the job is being able to get other people (readers, students) excited about difficult, abstract, boring things and to help them see value and interest in knowledge (even if it doesn't have immediate instrumental application).",
      "author": "crackmethisnut",
      "created": 1601386595,
      "upvotes": 121,
      "replies": {
        "g74g7e3": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74g7e3/",
          "text": "#4 is a great point and (I think) usually not stated that clearly to grad students.",
          "author": "huskiegal",
          "created": 1601425854,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "g72kitj": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72kitj/",
      "text": "1. Don't give up if they don't respond to your email. Send 5 follow-ups. Most people don't hate you, or make fun of you; they are just busy, and bad with email management. Always follow-up, again and again.\n2. Learn to write shorter emails.\n3. Finish things. Starting things is easy. Finishing is hard. Put 75% of your efforts in finishing things.\n3. Fight perfectionism. Treat everything as a draft (treat your entire life as a draft!). Nobody cares about perfection, as perfect things remain unreleased / unpublished / unfinished / unhappened. As \"[Done Manifesto](https://lifehacker.com/the-done-manifesto-lays-out-13-ground-rules-for-getting-5864004)\" put it: making something makes you right.\n3. Publishing more is more important than publishing in good journals. Impact is a lottery; don't obsess about it.\n3. When teaching, don't worry about grades. And in general, remember that you are not a drill sergeant, prepping for a space invasion. Teaching may be super-exciting, so it's important to set limits on your time, or it takes 100% of your time.\n4. Connect with people. Talk to people; meet new people; speak publicly; make it a habit. It's called \"networking\" sometimes, which makes one sound like a tool, but the core idea is that we are in it together, and we depend on each other _a lot_. Take a habit of getting to know at least 1 new person every n days. It's especially important now, with everyone so isolated. Not sure how to do it in practice, but you need to find a way!",
      "author": "ampanmdagaba",
      "created": 1601394163,
      "upvotes": 55,
      "replies": {
        "g72mwby": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72mwby/",
          "text": "All of this is solid advice, but I want to co-sign 2. for infinity.\n\nWriter shorter emails, but also- for the love of all things joyous- stop obsessing over how to ask for things, whether the tone is right etc. I still do this but I see how long it’s taking me: time I do not have. Say your please, thank you but just get to the point and ask and stop obsessing over whether it sounds right, and just hit send.",
          "author": "readmethings",
          "created": 1601395121,
          "upvotes": 25,
          "replies": {
            "g72tavr": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72tavr/",
              "text": "> Writer shorter emails, but also- for the love of all things joyous- stop obsessing over how to ask for things, whether the tone is right etc.\n\nOMG, so true! I'm almost 40 years into this business of living, and I still cannot do it. I write, and delete, and write, and delete, and rephrase, and delete, and my emails are still way longer than they should be.\n\nEVEN THOUGH I know perfectly well that it is a horrible practice. Even though I know that longer emails are less likely to be answered, even when they are read, as we have this subconscious assumption that longer emails somehow deserve longer replies, that end up never happening. It's ridiculous, how hard it is, when it goes against your nature :)\n\nThat's why I included it on the list haha! Maybe I'll listen to my own advice now!!",
              "author": "ampanmdagaba",
              "created": 1601397488,
              "upvotes": 15,
              "replies": {}
            }
          }
        }
      }
    },
    "g726s7w": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g726s7w/",
      "text": "1. Plan ahead. Have an idea of what you will be doing after your PhD and work towards it! Build your resume towards your dream position!\n2. Organize your work-life balance.\n3. Choose a mentor who likes to treat his students as colleagues.\n4. Always stand up for yourself.\n5. Build your network.",
      "author": "Nathan082617",
      "created": 1601388334,
      "upvotes": 47,
      "replies": {}
    },
    "g71z8ki": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g71z8ki/",
      "text": "Publish earlier and a lot. Academic careers snowball and it is important to start out on a high trajectory. Of course, quality is important too, but it's OK to have a few average papers to start out and start building your CV. Anyway, I compare academia to wealth - the wealthy will continue to get wealthier. It's not right, but it's reality.",
      "author": "OttawaExpat",
      "created": 1601384432,
      "upvotes": 165,
      "replies": {
        "g728znr": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g728znr/",
          "text": "**Correct but average** published papers are way better than *manuscripts in preparation*. At the very least, publications show that the person knows how to start a project, coordinate it and finish it. Those are attributes that are desired everywhere you go.",
          "author": "N1H1L",
          "created": 1601389271,
          "upvotes": 71,
          "replies": {
            "g72k2lp": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72k2lp/",
              "text": "Exactly. And in my experience, no one talks about the quality of a published paper after the fact. All that's mentioned is which journal it was published in and when. A baseline level of quality is assumed by way of its having been published, but beyond that nobody is making comparisons for things like grant applications",
              "author": "mcgilead",
              "created": 1601393980,
              "upvotes": 31,
              "replies": {
                "g72rqfs": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72rqfs/",
                  "text": "In my field, there are three tiers. \n\n* **Nature/Science levels**: Only one here or two will get you positions at extremely good schools. However my own personal recommendation to young scientists is to not aim there. It's too time consuming to get there and there is very little guarantee of getting one unless your PI has a track record in such journals. It's too risky.\n\n* **10+ IF journals**: They are reputed and well respected, with way faster and saner review processes. A few here looks exceptionally good and will look very good on your resume. Aim here.\n\n* **Everything else**: Still peer reviewed and incomparably better to have an *APL Materials* on your resume than a manuscript that's being polished for months to get into *Nature*. \n\nEveryone I have seen who has more than 10 first authors gets interviews, even at top 10 schools. Of course, how you do after that will depend upon you and the hiring committee, but a certain minimum number is guaranteed to get your foot in the door at almost everywhere. \n\nEarly career scientists should really aim for quantity above quality in my opinion. Quality can come after you are tenured. It sounds cynical, but it is what it is.",
                  "author": "N1H1L",
                  "created": 1601396918,
                  "upvotes": 34,
                  "replies": {
                    "g73w1lr": {
                      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73w1lr/",
                      "text": "> 10+ IF journals:\n\nI'd be a bit hesitant to recommend a blind impact factor assessment.  A lot of the journals in my field approaching 10 are *blatantly* impact factor hacking (I'm looking at you MPDI) and I think there's going to be blow-back (which can retroactively hurt you).  \n\nBut I agree that having papers in respectable and well-known, if lower tier, journals in your field should be prioritized over low-percentage submissions to Nature.",
                      "author": "rlrl",
                      "created": 1601414634,
                      "upvotes": 10,
                      "replies": {
                        "g73z7b7": {
                          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73z7b7/",
                          "text": "Oh yeah absolutely. Looking at *Materials Today* too. What I meant was that there are several mid-tier journals that offer a great balance of responsive reviews, cache and reputation in the community. It's field specific and it's one of the jobs of a grad students to know those journals along with their topic of research. Those are the places early career researchers should be going to.",
                          "author": "N1H1L",
                          "created": 1601416260,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g7223fy": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g7223fy/",
          "text": "Boy isn't this the truth. Depending on your University sometimes quality doesn't matter 🙄😬 but it does to me!\n\nSadly, also learn the art of self-promotion. It's a skill that I haven't mastered and quite frankly I'm just not comfortable mastering.",
          "author": "gmann5092",
          "created": 1601385989,
          "upvotes": 65,
          "replies": {}
        },
        "g72lder": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72lder/",
          "text": "Related: if your work is rejected from a prestigious venue, get it published somewhere else. You've put the work in and deemed it publishable - don't lose heart because the best journal/conference in your field didn't want it on this occasion.",
          "author": "dajoli",
          "created": 1601394506,
          "upvotes": 25,
          "replies": {}
        },
        "g73fuv7": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73fuv7/",
          "text": "Hello, as someone with no research experience and published papers, am I doomed to even dream of starting a PhD track? I have spent most of my professional life earning for the family,  so I had never thought about it until recently.",
          "author": "rhett21",
          "created": 1601407466,
          "upvotes": 11,
          "replies": {
            "g73k3zs": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73k3zs/",
              "text": "You are not doomed. I had no papers at the start of my PhD. The unspoken purpose of a PhD is to ramp up your academic CV and publish. A PhD by itself is a necessary but not adequate qualification for an academic/research job. What really counts is the quality/quantity of your contributions (pretty much measured through pubs).",
              "author": "OttawaExpat",
              "created": 1601409278,
              "upvotes": 9,
              "replies": {
                "g73lzoc": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73lzoc/",
                  "text": "What about research experience? I basically have none and I don't want to waste my boss' recommendation letter only to be thrown away by the admissions committee. My goal would be gaining the experience, and publish as much as I can. It will be for Chemical Engineering. Like any PhD, all I can offer for now is endurance and pliability, do they even consider values without papers?",
                  "author": "rhett21",
                  "created": 1601410122,
                  "upvotes": 5,
                  "replies": {
                    "g75v05h": {
                      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g75v05h/",
                      "text": "There are comments on here about how you need multiple papers to get into a PhD program. In chemical engineering, I do not think this is the case. Normally, it is tough to find good engineering PhD students because they are valued in industry (so many of the good ones go straight to industry). I do not think you need to worry.",
                      "author": "OttawaExpat",
                      "created": 1601466234,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "g73n6r3": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73n6r3/",
                  "text": "It’s also highly field dependent. It’s much harder to have a humanities or social  science paper published in top journals than it is, say, in my field of Astrophysics, where it is now almost a requirement to be published in the standard journal (Astrophysical Journal) to even be considered for grad school admission. My university explicitly indicated that they are ranking applicant PhD students by # of papers, and that all accepted students last year had a first author paper— something that could never happen in almost any other field.",
                  "author": "UnexpectedClock",
                  "created": 1601410698,
                  "upvotes": 3,
                  "replies": {
                    "g75v2to": {
                      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g75v2to/",
                      "text": "That is crazy. How good can the papers be in that journal if you need to submit there to start a PhD program. That means the journal is flooded with submissions by junior researchers without a grad degree.... That doesn't add up to me.",
                      "author": "OttawaExpat",
                      "created": 1601466300,
                      "upvotes": 2,
                      "replies": {
                        "g7b12qy": {
                          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g7b12qy/",
                          "text": "I think you have valid concerns that don’t really manifest. My take is that \n\n(1) there are really only two “main” astronomy journals for most types of research, excluding some niche elite tier that many career researchers never submit to (usually these special cases are to report earth shattering papers like LIGO’s first detection or the main results from a satellite).  Even Nature astronomy is often somewhat nonreputable because it tends to post very speculative, click-baity science (I know this is hard to swallow but everyone understands it to be true) \n\n(2) The journal acceptance rate is ~80%, but that is not perceived as a negative. Astronomy as a field is very undemanding when it comes to publishing results. Unlike almost any other field, importance simply does not come into play when it comes to journal articles. Much of astronomy is continually improving measurements of single objects, and then, of course, some very important papers come from aggregating And analyzing these measurements en masse.\n\n(3) Speaking from experience, It would be very hard to distinguish between papers from students vs. Those from people with PhDs. I occasionally receive correspondance about papers I have written and no one is any the wiser.\n\n(4) Astornomy papers often have huge author lists, so the field’s content quality is kept up my having many eyes on any given work (this collaboration oriented nature is effectively demanded by the huge amount of cost for any space mission or telescope or long term project). The journal review process is almost incidental, anyway: preprints are the go-to and almost always are only minorly different than the published versions.\n\n(5) the field’s pace is very very fast. New superlative discoveries are made every day. Focusing on rejecting papers or demanding serious revisions because of style rather than substance/validity would take much too long. Hence why preprints dominate.",
                          "author": "UnexpectedClock",
                          "created": 1601572548,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g73n0o7": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73n0o7/",
                  "text": "I want a career in teaching and haven’t published anything. I’m twenty one and just finished my degree in english is there still time? How do you just get published? Just ask journals to publish you? I’m so new to this and I feel like I’m failing already!",
                  "author": "bee_ghoul",
                  "created": 1601410616,
                  "upvotes": 2,
                  "replies": {
                    "g75uvp6": {
                      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g75uvp6/",
                      "text": "There is a formal submission process. Just google any journal (maybe start by searching the big publisher databases like Elsevier). There's always a guide for authors. Go from there. The first one is a learning curve and after that it's routine stuff.",
                      "author": "OttawaExpat",
                      "created": 1601466123,
                      "upvotes": 1,
                      "replies": {
                        "g76fqnf": {
                          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g76fqnf/",
                          "text": "That’s brilliant, thank you!",
                          "author": "bee_ghoul",
                          "created": 1601479032,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g7328ca": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g7328ca/",
          "text": "This does not really hold true in the UK where REF is important. In the UK you want high impact well cited papers. It would be better to have 2 papers with 100 citations in the UK than 100 papers with 2.",
          "author": "dukesdj",
          "created": 1601401354,
          "upvotes": 5,
          "replies": {
            "g75v4la": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g75v4la/",
              "text": "Yup, so I hear. It actually hurts you to submit something weak (or you know...without buzzwords or something innovative and risky).",
              "author": "OttawaExpat",
              "created": 1601466344,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g724prh": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g724prh/",
      "text": "I would say to decide what your end goal is with your degree and make every effort to spend time working towards that goal. For example, I wanted to go towards professoring at a small teaching focused college and the advisor I first picked didn't really care what my goals were. I ended up quitting the first lab and switched to an advisor who was willing to help me work toward my goals but I essentially wasted my first year and a half because my advisor only wanted me to spend my time in the lab and discouraged me from spending time on my teaching.",
      "author": "CHEIVIIST",
      "created": 1601387295,
      "upvotes": 40,
      "replies": {
        "g727k03": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g727k03/",
          "text": "Same. Develop a career plan even as early as your first year and share it with your professors and seniors. Sometimes it just sucks because some students (like me) have only realized in later years what they really wanted to do in life.",
          "author": "cobie1em0ji",
          "created": 1601388696,
          "upvotes": 18,
          "replies": {}
        }
      }
    },
    "g7280ce": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g7280ce/",
      "text": "My 5c.\n\nFocus on the work your advisor sets but don’t be afraid to venture into other parts of the literature that you find interesting.  \n\nBe as happy as you can be during the challenges you will face. My biggest regret is not being able to stay more positive and happy throughout what were some of the most difficult and challenging times of my life. The professors I worked with changed my life for the better and they will probably never know or understand how difficult it was for me to finish my studies, or how useful their help was in getting me there.\n\nBe focused. The process can be demoralizing, humiliating and seem impossible at times, it’s critically important to remain focused.\n\nBe grateful to the professors and those around you especially when it feels like they’re busy with other things and not focused on whatever it is that is critically important to your project. Pretty much everyone in academia, especially professors, are doing what they do because they want to help other people, and not enough thanks is given for that.\n\nBe kind. Spend a few minutes a day being kind to the staff at the university. Tell them a joke or an insight into your work etc...\n\nLearn to use a digital citation manager endnote or zotero on day 1.\n\nFile everything so that if you returned to the file system in ten years you could easily pick up where you left off.\n\nGo to as many relevant science-based conferences as you can.",
      "author": "marinegeo",
      "created": 1601388873,
      "upvotes": 31,
      "replies": {
        "g7354px": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g7354px/",
          "text": ">Learn to use a digital citation manager endnote or zotero on day 1.\n\nWe literally require our freshmen to learn Endnote in the first semester and use it in all their major classes. Are there really graduate students who haven't yet figured that out?",
          "author": "SnowblindAlbino",
          "created": 1601402587,
          "upvotes": 14,
          "replies": {
            "g73ctv3": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73ctv3/",
              "text": "I wasn't introduced to these tools in undergrad, and while my graduate professors recommended them, I was so accustomed to citing manually, organizing manually, etc. that I couldn't be bothered. It wasn't until I started writing my thesis that I realized how incredibly useful a citation manager could be, and now I use it constantly! Definitely second this piece of advice.",
              "author": "to_neverwhere",
              "created": 1601406139,
              "upvotes": 16,
              "replies": {}
            },
            "g73glwx": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73glwx/",
              "text": "Things move fast, I’ve been out of university systems for three years now, so things may be different today. As of three years ago, yes, I knew grad students who didn’t use citation management.\n\nI also attended a “writing” course at a university back in 2016 where digital citation management was not mentioned. When I mentioned it at the end of the course the leader was quick to dismiss it and recommended that all students learn the “traditional” way. While I agree, we should all learn to write citations the right way, the way it was presented made me think the person leading the course simply didn’t know/understand. So, as this contrasts with your comment above, and it seems like there is a wide variety of undergraduate experiences out there.\n\nI don’t know for sure but I feel like most people who write regularly, or are active in the literature, use digital citation management and that those are likely the best people to be giving advice to current students.",
              "author": "marinegeo",
              "created": 1601407802,
              "upvotes": 3,
              "replies": {
                "g73z93m": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73z93m/",
                  "text": "> I don’t know for sure but I feel like most people who write regularly, or are active in the literature, use digital citation management and that those are likely the best people to be giving advice to current students.\n\nAbsolutely. I know my department is hardly alone in teaching it to undergrads, but by the same token I do encounter seniors from other departments who say things like \"Why didn't anyone tell me about this before?\"",
                  "author": "SnowblindAlbino",
                  "created": 1601416287,
                  "upvotes": 3,
                  "replies": {
                    "g73zv45": {
                      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73zv45/",
                      "text": "Awesome, lucky students!",
                      "author": "marinegeo",
                      "created": 1601416606,
                      "upvotes": 2,
                      "replies": {
                        "g74e8ud": {
                          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74e8ud/",
                          "text": "They probably wouldn't agree with you the first year, but by the time they are juniors/seniors they are always saying things like \"I can't believe my roommate doesn't know how to export sources from the library catalog into a ref manager. How do they get anything done?\"",
                          "author": "SnowblindAlbino",
                          "created": 1601424709,
                          "upvotes": 2,
                          "replies": {
                            "g74vg20": {
                              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74vg20/",
                              "text": "Yes, or when you’re asked for a paper’s citations to be changed to suit the format of a different journal...",
                              "author": "marinegeo",
                              "created": 1601434121,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "g744e1s": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g744e1s/",
              "text": "But what if you use LaTex?",
              "author": "N1H1L",
              "created": 1601419044,
              "upvotes": 3,
              "replies": {
                "g74w321": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74w321/",
                  "text": "The few people I know who used LaTex for their thesis are such good programmers they don’t ever do repetitive actions on a computer.",
                  "author": "marinegeo",
                  "created": 1601434463,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g73191m": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73191m/",
      "text": "Cliche, but you miss 100% of the shots you don't take. Apply for that fellowship. Nominate yourself for that award. Submit to that top tier journal. Someone will get it and they are made out of DNA and insecurity just like you.",
      "author": "zinfandelightful",
      "created": 1601400879,
      "upvotes": 32,
      "replies": {
        "g73auzh": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73auzh/",
          "text": "“They are made out of DNA and insecurity just like you”\n\nReally love this!",
          "author": "pandacorn93",
          "created": 1601405184,
          "upvotes": 18,
          "replies": {
            "g73l634": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73l634/",
              "text": "Thanks! It was an epiphany I had when I got a job at a Fancy Name University. I expected everyone there to be members of a more advanced species, like the X-Men or something. But they were just humans, no different from anyone else.",
              "author": "zinfandelightful",
              "created": 1601409728,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "g7283m0": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g7283m0/",
      "text": "I have two:\n\n1. Please publish more!! The job market is seriously as bad as they say it is. Focusing on your teaching will NOT HELP YOU. \n\n2. You wouldn’t be in the program if you couldn’t do it. You absolutely can. Don’t let imposter syndrome keep you hiding from opportunities.",
      "author": "FemmeLightning",
      "created": 1601388910,
      "upvotes": 90,
      "replies": {
        "g72ohf3": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72ohf3/",
          "text": "To reiterate: Job searches don’t care about teaching. Everyone has experience teaching and it won’t differentiate you.",
          "author": "crimbuscarol",
          "created": 1601395719,
          "upvotes": 28,
          "replies": {
            "g734qs1": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g734qs1/",
              "text": ">Job searches don’t care about teaching. Everyone has experience teaching and it won’t differentiate you.\n\nThat is 100% inaccurate for a significant slice of the market.  All teaching-focused institutions and many, if not most, PUIs absolutely care about teaching. In fact, in the SLAC world the exact opposite of what you say is true: everyone who earns a Ph.D. can do research, but a great many cannot teach. A strong teaching record will absolutely open doors that the lack of one will close.  For example, my school will not interview anyone who has not been the instructor of record for at least one class-- being a TA is meaningless. We have no problem finding those candidates who meet that expectation *and* have a record of publication.\n\nThe problem is that is generally quite hard to excel at *both* teaching and research as a graduate student.",
              "author": "SnowblindAlbino",
              "created": 1601402427,
              "upvotes": 31,
              "replies": {
                "g735th2": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g735th2/",
                  "text": "Good point. I’ve just seen grad students focus all of their energy on being a TA and not getting anything else done. And I’m proofreading friends job letters right now and that are all spending a full page talking about teaching. While being a good teacher is super hard, everyone writes the same stuff about teaching in their job letters. You have to balance. In my field (history) I would focus on getting one really good publication, teaching 1-2 classes, and apply to big dissertation completion prizes.",
                  "author": "crimbuscarol",
                  "created": 1601402878,
                  "upvotes": 14,
                  "replies": {
                    "g73zwj8": {
                      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73zwj8/",
                      "text": "> While being a good teacher is super hard, everyone writes the same stuff about teaching in their job letters.\n\nThat's not been my experience actually, and I've read thousands of cover letters (as a committee member on far too many searches). What's true, I think, is that *good* cover letters are often similar but those are maybe 1/4 of a typical pool. It's actually not that easy to write a cover letter than hits all the right buttons for a committee, and at a teaching-oriented institution the teaching part is the non-negotiable starting point that determines if they bother to read anything else in your file.\n\nFWIW, I'm a historian as well though my hiring experience has been across the board as I've often served as an outside member on committees for other departments.",
                      "author": "SnowblindAlbino",
                      "created": 1601416627,
                      "upvotes": 7,
                      "replies": {
                        "g743as2": {
                          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g743as2/",
                          "text": "Huh interesting. Obviously you have more experience than I do, so I will defer. I just got a job and it seemed like everyone could talk a big game with teaching but perhaps that’s my own misinterpretation of the hiring process\n\nEdit: to clarify. I got multiple on campus interviews and had never taught my own class. Only TA’ed",
                          "author": "crimbuscarol",
                          "created": 1601418443,
                          "upvotes": 1,
                          "replies": {
                            "g74e3pu": {
                              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74e3pu/",
                              "text": "It varies from place to place, to be sure. We simply toss applications with no real teaching experience, as there are endless piles of applicants and we never have a problem finding ones from top programs who have a strong teaching record *and* publications. But obviously there are lots of schools that don't care at all about teaching. The ones in between those two poles are probably the hardest to navigate, as you might not know what a given committee is actually looking for in terms of non-negotiables. Suffice it to say, if you don't teach at least one course on your own you're going to be locked out of at least some portion of the market.",
                              "author": "SnowblindAlbino",
                              "created": 1601424625,
                              "upvotes": 1,
                              "replies": {
                                "g74lj0m": {
                                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74lj0m/",
                                  "text": "I have a specific question about the type of teaching experience that a SLAC considers relevant. I've been considering a career at a SLAC (I love research and have a great publication record, but I also love teaching). As a graduate student I've focused extensively on the research aspect because I was a high school teacher prior to attending grad school. Would experience as a high school teacher be beneficial as an applicant at a SLAC, or is being the instructor of record the only teaching experience that will prevent my application from being immediately discarded? (of course, there could be other reasons as well, but I am just asking about the teaching experience)",
                                  "author": "donut_gobbler",
                                  "created": 1601428957,
                                  "upvotes": 1,
                                  "replies": {
                                    "g74q0ib": {
                                      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74q0ib/",
                                      "text": "> Would experience as a high school teacher be beneficial as an applicant at a SLAC, or is being the instructor of record the only teaching experience that will prevent my application from being immediately discarded? \n\nThat can be a plus for sure, as can teaching at community colleges, or even with incarcerated populations. What we're looking for (we=my colleagues in this case, so a narrow sample) is evidence that a candidate can not only manage a classroom and grade papers (which TAs do) but that they can build a syllabus, establish learning goals and assessments, select appropriate materials, etc. etc.  All things that high school teachers do, but that far too many graduate programs don't bother with. Since we have no problem finding great candidates who do have that experience, so we tend to favor them in the process.",
                                      "author": "SnowblindAlbino",
                                      "created": 1601431353,
                                      "upvotes": 2,
                                      "replies": {
                                        "g74tb6d": {
                                          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74tb6d/",
                                          "text": "Thank you for explaining your reasoning. That makes a lot of sense, and will also help me in writing a more appropriate cover letter.",
                                          "author": "donut_gobbler",
                                          "created": 1601432999,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g73d73c": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73d73c/",
                  "text": "The most frustrating part of this is that interdisciplinary programs are a lot more common. So some of us can’t get experience as an instructor of record (because the undergrad equivalent of my program doesn’t exist at my school and I’m not enrolled in the CS program) and the adjunct market is so saturated.\n\nI don’t think I will ever have a shot even though I basically did everything for my professors as a TA.",
                  "author": null,
                  "created": 1601406314,
                  "upvotes": 4,
                  "replies": {
                    "g73zjph": {
                      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73zjph/",
                      "text": "> I don’t think I will ever have a shot even though I basically did everything for my professors as a TA.\n\nAdjuncting or a teaching postdoc are the most common routes in that case. Which, as you note, are competitive too now. It's really unfortunate that grad departments don't recognize this and create opportunities for their students to actually teach (or at least for those who want them).  There may be extra-departmental options in some cases though; when I left my Ph.D. program I'd taught a half-dozen classes on campus but some were through other departments/programs, like the Honors College.",
                      "author": "SnowblindAlbino",
                      "created": 1601416441,
                      "upvotes": 3,
                      "replies": {
                        "g744zzr": {
                          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g744zzr/",
                          "text": "Absolutely, that’s if you’re lucky enough to be at a school that offers that. Typically they reserve those at our school for the PhD students in those “pure” programs (e.g. only psych students teach psych classes, CS students can only teach CS classes, bio students can only teach bio classes), because there’s a limited number of positions. So in my case there isn’t an opportunity even if I tried to create one. :(",
                          "author": null,
                          "created": 1601419379,
                          "upvotes": 1,
                          "replies": {
                            "g74drbu": {
                              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74drbu/",
                              "text": "That's too bad. At my school the honors college solicited grad students to teach one-off classes on interesting topics. They were selected by a panel of students, so lots of competition but it really favored interesting, trendy, interdisciplinary topics.",
                              "author": "SnowblindAlbino",
                              "created": 1601424420,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "g73ueb5": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73ueb5/",
              "text": "I have been told by numerous people that a large part of the reason I was hired (at my LAC) was my teaching experience and the teaching demo I did on my interview.\n\nHow much a school cares about your teaching experience depends on the kind of school you want to wind up at. Also, I definitely went to grad school (Big US R1) with people who did not teach by the time they graduated; it's very dependent on your program and your funding.",
              "author": "TourmalineTart",
              "created": 1601413796,
              "upvotes": 6,
              "replies": {
                "g73uo0h": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73uo0h/",
                  "text": "If you can get to the interview and teaching demo stage it is crucial. A lot of people don’t make it that far because they’ve focused exclusively on teaching and don’t have good research",
                  "author": "crimbuscarol",
                  "created": 1601413931,
                  "upvotes": 2,
                  "replies": {
                    "g73v9qc": {
                      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73v9qc/",
                      "text": "I think it's much more than that.  Having teaching experience isn't enough; you have to be able to translate the teaching experience you do have into a learning experience for yourself such that you can actually develop a teaching philosophy and write a competitive teaching statement. We read a lot of crap teaching statements from people with \"teaching experience\"; it's the quality of the experience I think that matters most.",
                      "author": "TourmalineTart",
                      "created": 1601414239,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g7254v2": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g7254v2/",
      "text": "in the vein of uncommon or contrarian advice: “implement things from scratch instead of relying on or trying to modify existing open-source implementations”. Working in applied computational statistical methods development I wasted a huge amount of time trying to wrap my head around convoluted, buggy backends after being convinced not to reinvent square wheels. Unfortunately off-the-shelf wheels were riddled with holes that were very difficult for me to fix (as someone without a formal CS background — any fairly trivial change would require that I edit a dozen files, none of which was documented anywhere). Things went much smoother when I started doing everything except low-medium level stuff from scratch (i.e. using only very established statistical computing libraries... which incidentally went eschewed by other software I’d been trying to modify and use, which is where a lot of the bugs came from). Getting novel algorithmic tricks implemented went from something very frustrating to something with much more rapid turnaround.",
      "author": "--MCMC--",
      "created": 1601387503,
      "upvotes": 24,
      "replies": {}
    },
    "g72xsue": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72xsue/",
      "text": "To **my** younger academic self: don’t do it. For the love of god, just don’t.\n\nTo someone else’s: \n\nCultivate good self-management habits (Follow a schedule, make to-do lists, etc). You’re only really accountable to yourself. Re-evaluate the standards you set for yourself regularly. What looks trivial to you is not necessarily trivial to someone who hasn’t put in the work you have. Don’t be afraid of failure: failing often and learning from your failures is how you get somewhere.",
      "author": "chisquared",
      "created": 1601399257,
      "upvotes": 18,
      "replies": {}
    },
    "g72kbwc": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72kbwc/",
      "text": "Find an advisor that isn’t dog shit",
      "author": "theoneandonlypatriot",
      "created": 1601394089,
      "upvotes": 15,
      "replies": {
        "g73azm9": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73azm9/",
          "text": "Great advice! Resonates well.",
          "author": "theclarice",
          "created": 1601405247,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g72js2f": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72js2f/",
      "text": "Decide what matters to you in terms of happiness. Getting a TT job is already difficult, getting a TT job in a good location (whatever that means for you- close to family, close to friends and a support network, employment options for a partner, city or rural, etc.) is very difficult.",
      "author": "gettingtowork",
      "created": 1601393860,
      "upvotes": 12,
      "replies": {}
    },
    "g725kbv": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g725kbv/",
      "text": "[removed]",
      "author": null,
      "created": 1601387720,
      "upvotes": 23,
      "replies": {
        "g72eqit": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72eqit/",
          "text": "Glad it’s helpful :)",
          "author": "ZacharyEzraRawlins",
          "created": 1601391779,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "g72m7ef": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72m7ef/",
      "text": "Stay out of the department politics and toxicity. Put your head down, work hard, while also leaving time for yourself and your family. Learn to negotiate and occasionally say no to requests.",
      "author": "igohard69",
      "created": 1601394840,
      "upvotes": 11,
      "replies": {}
    },
    "g72vi8s": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72vi8s/",
      "text": "Good response. Unless you become an academic superstar many years down the road, you will not have the luxury of choosing where to live. If you have a close-knit family and expected to stay (physically)close to them, or for your kids to grow up with their cousins the way you did, this is out the window for most academics.",
      "author": "AcademicX",
      "created": 1601398329,
      "upvotes": 9,
      "replies": {}
    },
    "g72zfv5": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72zfv5/",
      "text": "Know yourself, ... your needs, your effective work habits, your areas of growth potential, know your boundaries and your limits, know your self-care regimen and know that this career path will be long and hard so know how crucial taking care of yourself so that you can continue doing what you love day after day is",
      "author": "ScientistLiz",
      "created": 1601399999,
      "upvotes": 10,
      "replies": {}
    },
    "g72d6yw": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72d6yw/",
      "text": "Meet with a librarian to talk databases and always use a ref manager.",
      "author": null,
      "created": 1601391131,
      "upvotes": 10,
      "replies": {}
    },
    "g72zhk1": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72zhk1/",
      "text": "Figure out an organization system that works for you as early as possible! Save and organize PDFs, books, etc. Annotate them so you can easily review later. And keep some kind of notebook where you drop all your ideas for things you’re interested in. Can also fill this with content that you write then end up not using, even just a sentence you think sounds really good but maybe didn’t fit in a particular paper.",
      "author": null,
      "created": 1601400022,
      "upvotes": 8,
      "replies": {}
    },
    "g72muql": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72muql/",
      "text": "Remember when everyone says when you start as an academic, learn to say no? And you think yes, that's great advice. And you think, yes, I can say no. You need to say no, even when you think you should say yes.",
      "author": "ardbeg",
      "created": 1601395104,
      "upvotes": 9,
      "replies": {
        "g744f0g": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g744f0g/",
          "text": "Agreed! I wish I had Marie Kondo-d my opportunities earlier on. \n\nNow, I ask myself: Does this spark joy (or is it ABSOLUTELY necessary?). \n\nIf not, the answer is no. For people, parties, collaboration opportunities, conferences.\n\nIt is SO much better to get out with 3 good papers than 10 half-baked unpublished projects.",
          "author": "fiftycamelsworth",
          "created": 1601419059,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "g72n3wv": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72n3wv/",
      "text": "Find a field and topic which is of *genuine* interest, not one which will satisfy what you think people want.  Build more professional networks, try to do at least one publication.",
      "author": "saltsage",
      "created": 1601395203,
      "upvotes": 7,
      "replies": {}
    },
    "g7345hl": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g7345hl/",
      "text": "I would have done even more interdisciplinary work than I did (and I have graduate credits in at least ten different departments). And I would have really jumped into more tool skills (GIS, stats, what are now called \"digital humanities\") and skipped the useless second, third, and fourth languages I studied as a humanities grad student.  Would have found more theory courses, and fewer \"content\" courses. \n\nBut beyond those general issues I wouldn't change much. As a grad student in the 90s I was mostly on my own, with relatively hands-off advisors. I made a conscious choice to teach as much as possible, which cost me opportunities in research, but it was ideal preparation for a career in a liberal arts college which is what I wanted.\n\nIf anything, today I'd simply pass back some of the wisdom I've accumulated about academia-- and particularly the reality of the multiple, different markets that exist for different types of institutions. Making an informed choice relatively early on between seeking an R1, R2, liberal arts, CC, etc. career should be a core part of the advising process but it wasn't even spoken about in my department...I had to navigate that entirely on my own.",
      "author": "SnowblindAlbino",
      "created": 1601402188,
      "upvotes": 7,
      "replies": {}
    },
    "g73ax6q": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73ax6q/",
      "text": "In the words of Dalton, one of the 20th century's greatest philosophers, \"It's just a job, it's nothing personal.\"",
      "author": "WrestlingStuffGuy",
      "created": 1601405214,
      "upvotes": 8,
      "replies": {}
    },
    "g72rs49": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72rs49/",
      "text": "Honestly a PhD is no longer worth the stress, hassle, and general harassment I received. It's damaged me mentally and I suffer from severe depression. My advice would be, truly evaluate whether it makes sense for you to sacrifice everything (jobs, being close to family, etc.) and whether you have the resources you need to be successful. Ruining yourself financially, even if you have a \"full scholarship\" or tuition waiver is not worth it. \n\nCarefully evaluate your finances and try to work alongside your degree so you don't end up on the market with little to no job experience.",
      "author": null,
      "created": 1601396934,
      "upvotes": 17,
      "replies": {
        "g743rv4": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g743rv4/",
          "text": "Glad this advice was somewhere in the comments! My best advice to my younger academic self would be \"don't go to grad school\".",
          "author": "fiftycamelsworth",
          "created": 1601418701,
          "upvotes": 4,
          "replies": {}
        },
        "g73ai2v": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73ai2v/",
          "text": "What field was it in? Was it STEM?",
          "author": "theclarice",
          "created": 1601405010,
          "upvotes": 2,
          "replies": {
            "g73argq": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73argq/",
              "text": "Yes. Highly employable field. Still not worth it. I lost ~80k a year in potential employment opportunities. Granted I did work full time these last few years of my PhD. But 80 x 3 is a lot of money to lose. For most of my PhD I barely made enough to feed myself and put gas in my car despite a tuition waiver and scholarships. I worked multiple jobs at one point.",
              "author": null,
              "created": 1601405137,
              "upvotes": 1,
              "replies": {
                "g77adn2": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g77adn2/",
                  "text": "Do you really think it’s accurate to call it “lost income”? Most people at the age of 30 are with no savings and often has to switch careers anyway due to wrong path that lost their interest/saw a better one etc. Also, if money is a primary - doctors in USA make on average 200-300k, even the bed ones.",
                  "author": "Nevermindever",
                  "created": 1601491316,
                  "upvotes": 2,
                  "replies": {
                    "g77arrs": {
                      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g77arrs/",
                      "text": "Yes it is accurate to call it lost income. I had a master’s degree before I started my PhD. I had multiple job interviews. My starting offers ranged from 76k-88k. Peers I know make around 100k working full time while pursuing their PhD part time. \n\nMedical doctors? There’s no way a person with a PhD in my field is making 300k right out of their PhD, unless they have previous job experience. Your comment is misinformed.",
                      "author": null,
                      "created": 1601491471,
                      "upvotes": 1,
                      "replies": {
                        "g77kaur": {
                          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g77kaur/",
                          "text": "You’re likely living in a high col area so those number would not give you much although it may not seem like it now. \nBut if you are still counting it as lost income, think about what you’re gonna gain with a PhD - maybe 20k+ yearly? Then you will earn back those three lost years in 12 years",
                          "author": "Nevermindever",
                          "created": 1601494995,
                          "upvotes": 1,
                          "replies": {
                            "g77kix6": {
                              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g77kix6/",
                              "text": "Are you a troll? \n\nA PhD will not increase my earning potential by 20k...",
                              "author": null,
                              "created": 1601495076,
                              "upvotes": 1,
                              "replies": {
                                "g77lvp0": {
                                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g77lvp0/",
                                  "text": "On average it will (in USA), so over a career it’s like a million of additional income. I can look up your specifically field you want.",
                                  "author": "Nevermindever",
                                  "created": 1601495549,
                                  "upvotes": 1,
                                  "replies": {
                                    "g77m9pm": {
                                      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g77m9pm/",
                                      "text": "I don’t need you to look it up for me thanks. Your numbers aren’t accurate...even if that is true on average, that’s not true for all of us who are graduating this year and dealing with a crumbling economy and job market. Are you in undergrad? Your lack of awareness of the job market seems to indicate that you are...",
                                      "author": null,
                                      "created": 1601495683,
                                      "upvotes": 1,
                                      "replies": {
                                        "g77nr3u": {
                                          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g77nr3u/",
                                          "text": "This is definitely lowest low for economy, lower then Great Depression.but what makes you feel like peers who have had 3 years of 80k salary has any advantage over you",
                                          "author": "Nevermindever",
                                          "created": 1601496263,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g74an59": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74an59/",
          "text": "Best comment right here :)",
          "author": "cobie1em0ji",
          "created": 1601422600,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g72oan1": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72oan1/",
      "text": "Evaluate your personality, work style, etc. to see if it is a good match for academia. The most successful academics are aggressive, ambitious, extroverted, self-promoters, confident public speakers, and good at schmoozing/sucking up. It is part of the game.\n\nIf you love research but want to be left alone to do it, would feel uncomfortable constantly patting yourself on the back publicly (conferences, social media, etc.), don’t want to suck up to people year-round to get grants and collaborators, and dislike public speaking, an academic job is not a good fit for you. \n\nThis does not mean the PhD is not a good idea, just working in academia. Look at industry/agency jobs and not academia if you do not have the qualities in my first paragraph or don’t think you could develop them.",
      "author": "AcademicX",
      "created": 1601395648,
      "upvotes": 16,
      "replies": {
        "g731r5k": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g731r5k/",
          "text": "> The most successful academics are aggressive, ambitious, extroverted, self-promoters, confident public speakers, and good at schmoozing/sucking up. It is part of the game.\n\nWhile that's widely my impression as well, the question is how far you can get if your ambition is to be just a pretty good academic, rather than the most successful one. I do see people getting tenure that are not the most aggressive self-promotors.",
          "author": "ColourlessGreenIdeas",
          "created": 1601401125,
          "upvotes": 6,
          "replies": {
            "g73s6tw": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73s6tw/",
              "text": "I'm not referring to those who have simply obtained tenure; that bar is way too low. I was referring to those whose names are known by everyone in their field (or at least their subfield), are constantly publishing and getting grants, and spend a significant amount of time traveling due to receiving invitations to speak. \n\nThe markers of success mentioned above don't normally happen without a lot of extra effort to self promote and maintain active outreach and schmoozing with others in the field. If someone is not comfortable with self-promotion, public speaking, etc., and finds all of that networking and outreach a hindrance to job satisfaction, academia may not be a good match for that person.",
              "author": "AcademicX",
              "created": 1601412812,
              "upvotes": 1,
              "replies": {
                "g744x2a": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g744x2a/",
                  "text": "Some of them have reached a level of skill in self promoting where it actually sound humble and new rather than a self promotion\n\nAmazing skill if you ask me! Always blew my mind",
                  "author": "MindWonderer-1",
                  "created": 1601419334,
                  "upvotes": 3,
                  "replies": {}
                },
                "g758tgu": {
                  "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g758tgu/",
                  "text": "I'm confused. Your initial advice was to evaluate if your personality is a good match for academia. Are you implying that only the most successful researchers are a good match for academia?",
                  "author": "ColourlessGreenIdeas",
                  "created": 1601442747,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g745kpa": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g745kpa/",
          "text": "TOTALLY agree with this! \n\nSuccessful academics are really successfully marketing their brand, and shamelessly self-promoting. Honestly, narcissism and entitlement (with a touch of sociopathy) are very useful tools for being a successful academic.\n\nThey don't blink twice about publishing their mediocre work, because they believe it's amazing. They don't feel bad about disproportionately self-citing. They don't feel weird about getting huge grants and not doing them well enough. They're excited to talk in front of huge crowds about their work. They don't mind stretching the truth to get the recognition and money that they feel that they deserve. They don't mind using students in a somewhat unethical way for free labor, because they believe the students are so lucky to work with them. They don't mind getting out of service requirements, and doing a terrible job as a teacher.",
          "author": "fiftycamelsworth",
          "created": 1601419701,
          "upvotes": 3,
          "replies": {
            "g749kgx": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g749kgx/",
              "text": "You're not wrong. Even when the work is mediocre the most well known academics have the confidence to keep publicizing and sharing it.  If there is an opportunity to be interviewed or featured in anything, they will grab the limelight even if they are not the most qualified to speak on a subject. You have to be willing to cite yourself a dozen times in an article and then go on to share with others how often your work is cited, while including your self-citations, without feeling sheepish about it. People who would feel uncomfortable with this type of brazenness will often be stuck at the associate level.  Not always, but often.",
              "author": "AcademicX",
              "created": 1601421977,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "g72uy1u": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72uy1u/",
      "text": ">If you could go back and tell your younger self one thing about academia or the PhD process, what would you say?\n\nStop. Don't do this. Your current ideas of Academia are wrong and this field is a mess. The dissertation process will demand you sacrifice everything important in your life and will leave you penniless and unemployable, simultaneously overqualified and underqualified. Either take a few years off to research different fields and go do that, or go back to coding since that's where all the jobs are, or just stay at your current job and marry that girl before the PhD process destroys your relationship.",
      "author": "Prof_Acorn",
      "created": 1601398108,
      "upvotes": 13,
      "replies": {}
    },
    "g73tk6a": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73tk6a/",
      "text": "Write more, publish more, that goes without saying. \n\nBut also, I should have enacted my \"No Assholes Rule\" for collaborators much, much sooner. I don't know why it took me so long to realize that once I was finally in the position to decide who I worked with, that I could chose to work with people I enjoy.",
      "author": "TourmalineTart",
      "created": 1601413394,
      "upvotes": 6,
      "replies": {
        "g77ifn5": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g77ifn5/",
          "text": "What would you characterise as an asshole?",
          "author": "Nevermindever",
          "created": 1601494333,
          "upvotes": 1,
          "replies": {
            "g77vy1m": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g77vy1m/",
              "text": "Big egos and excess machismo, sexism and racism, disregard for other people’s schedules, absenteeism when it comes time to write or support student work and progress, inability to provide constructive criticism to collaborators and students... general assholery.",
              "author": "TourmalineTart",
              "created": 1601499423,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g74aaj1": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74aaj1/",
      "text": "\\-This isn't finals week in college. It's your life. It's not a sprint. You can't ever stop self-care. Self-care must ALWAYS come first. You can't show up if you haven't been well-taken care of. You need to be well-nourished, get enough sleep, exercise, spend time doing nothing, spend time with people that love you, and set boundaries. Set boundaries, and always, always put your *needs* first. There is no shame in this. Think about kids in a grade school--the ones with really responsible parents, and the ones whose parents aren't bathing them, feeding them, making them go to sleep, letting them get exercise, creating a safe home environment for them. Those kids can't show up fully to school, because they aren't being well taken care of. You're the kid AND the parent now. Take care of yourself so you can really show up.\n\n\\-About 80-90% of your job is going to be some form of organization, emailing, or paperwork. This isn't you wasting time; it's part of your job. It's not you procrastinating working, it's not you doing other menial tasks during your work time. It IS work. Put it on your to-do list, and schedule time for it. Feel good about doing it. \n\n\\-Learn to prioritize your time. I use Trello. I create cards, break them down into tasks of an hour or less, and sort them based on how important they are. I don't try to tackle everything at once. I look at it, and ask myself \"what is the absolute minimum that I could do today and go to bed feeling good about myself?\". Then, I put ONLY those on the to-do list for the day, (Including time wasters like email). Then, I do my best to do only those items. When I'm done, I can add other things. This stops me from procrasti-working, and feeling like I didn't get done what I needed to.\n\n\\-Say no to opportunities and people that don't spark joy or contribute significantly to your growth. Definitely say no to those that give you a yucky feeling.\n\n\\-Go into mentorship meetings with a goal in mind, and maybe even a schedule. Your mentor isn't superhuman, and they have a lot on their plate besides you. They might be good at figuring out your needs, and they might not. Don't leave it up to chance. One way to help ensure that you get the mentorship you need is to figure out what you actually need from your mentor (tangibly) and tell them. What are your needs, and what specific actions do you need from them to help you meet those needs?\n\n\\-Ask your mentor to describe your tasks to you in detail in the beginning, and take notes. If they say \"give me a run-down by next week\", say \"talk me through what a successful run-down looks like to you\". This will help you know what to do, and also help them really consider what are reasonable goals for you.\n\n\\-Track your time. Again, I use Trello, and have a list that says \"done\", where I put completed tasks. Sometimes, I create tasks and put them straight into the done column if it was something productive that I did that deserves to be celebrated. This means that at the end of the day, you have a tangible list of the things that you have done. This keeps up motivation.\n\n\\-Don't be (too) afraid to take up professor time. Sure, be respectful of their time. But not \\*so\\* respectful that you never ask them for meetings. Go, meet with them, introduce yourself, ask them questions. Keep it up. People like to mentor, and feel invested in you. Distribute your mentorship among multiple people.\n\n\\-If you find yourself continually failing in an area, don't just self-flagellate. It doesn't really MATTER if you're the problem. Find a solution. One of my most successful ways is to find a buddy to share that load with. I was insecure in stats, so I started a weekly statistics help group with some of my friends, where we meet, and say \"here's what I'm thinking about this week as far as my stats projects... talk through it with me\", and then co-work. I wasn't getting up early, so I found a running buddy to meet me at 7am to go for runs. I wouldn't start my stupid dissertation, so I bet 4 of my friends that I'd pay them $100 if I didn't get it done by a certain date.\n\n\\-Don't try to be perfect. You won't ever be perfect, and neither will your work. This isn't undergrad, where they will tell you how many words and sources you need, and you'll get an A. There is nobody laying out an assignment and giving you an A, so you will never get that \"A\" feeling. Instead, figure out the absolute bare minimum that needs to be done for the task to be done and for you to feel good. Go ahead and write down the things that you want to do, but then highlight the things that you NEED to do, and the first time, do only those things. Then, only once you're done, if you still want to, go back and do the \"want\" list.\n\n\\-Hang around with people who are (or are striving to be) someone that you want to be. If your friends get high and eat junk food, guess what you'll do. If your friends brag about procrastinating, guess where your life is going. Raise your bar for finding friends. Pay attention to how you feel and how you behave when you're around/ immediately leave the presence of those people. Are they  bringing you up? Are they holding you accountable? Are they helping you grow? Do they make you feel good? If not, acquaintance-zone them.\n\n\\-Apply for summer internships every summer, no matter how much pressure you feel to keep working on your projects.\n\n\\-Your coworkers are your coworkers, and your friends are your friends. There is going to be some overlap, but it's less than you think. Take things slow, set boundaries. In grad school, people (including professors) don't always set boundaries, so set your own, and err by being friendly, distant, and close-lipped.  You can always deepen a relationship; it's a lot more awkward to begin intimately and have to recede to a professional relationship.\n\n\\-Don't assume that people are on your team. People in academia succeed by being selfish and self-promoting. They aren't all on your team, and they aren't all trying to build you up. A lot of people are very insecure, and will actively work to discourage you from feeling secure and succeeding. Others just won't see you on their own pathway. You are your own advocate. Don't expect to be able to rely on other people. Provide for yourself, and be pleasantly surprised. Don't rely on others and be disappointed.",
      "author": "fiftycamelsworth",
      "created": 1601422396,
      "upvotes": 7,
      "replies": {}
    },
    "g73kqie": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73kqie/",
      "text": "Adopt practices that are going to be valued in a few years time, or will be the norm. If this is a science PhD programme, that means Open Science (sharing code, data if you can, pre-prints, pre-registrations). Some fields are on top of this (psychology), but many others are far behind\n\nIf you adopt these now, you will stand out when you go into the academic job market. And your research will be seen as more trustworthy, and since you’re putting more effort into it for public consumption, probably will be more trustworthy too.",
      "author": "DrLaneDownUnder",
      "created": 1601409537,
      "upvotes": 4,
      "replies": {}
    },
    "g72f8q6": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72f8q6/",
      "text": "Meet with every professor outside of class at least once during the semester. Making a good impression and making sure you understand what they want out of an assignment can go a long way.",
      "author": "lala__",
      "created": 1601391987,
      "upvotes": 9,
      "replies": {}
    },
    "g7275ww": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g7275ww/",
      "text": "[deleted]",
      "author": null,
      "created": 1601388530,
      "upvotes": 18,
      "replies": {
        "g774n1b": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g774n1b/",
          "text": "Why exactly?",
          "author": "Nevermindever",
          "created": 1601489050,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g72o7ub": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72o7ub/",
      "text": "I'm currently a PhD student, but I have a few things that have stood out to me so far that I should have paid more attention to in the application process (and that I think other prospective PhD students should, too):\n\n1. Remember to make friends outside of your department. Seriously! I heard this a few times before starting my PhD, but I naively assumed that I would have plenty of friends in my department. This did not happen. I wish I had continued to stay in contact with the few people I met during orientation week who were not from my department.\n2. Try to learn about the department culture before attending, and try your best to find a department whose culture is not catty or overly competitive. Yes, academia is competitive and yes, most departments seem to be catty. However, I thankfully ended up in a department with an overwhelmingly supportive environment, which I did not realize would be so important.",
      "author": "BonnieviewDrive",
      "created": 1601395616,
      "upvotes": 8,
      "replies": {
        "g7467de": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g7467de/",
          "text": "Department / research group people are colleagues, not friends. At least that's how I like to see them.",
          "author": "aknb",
          "created": 1601420062,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g72dh0d": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72dh0d/",
      "text": "Get out. Now.",
      "author": "notifyoulikefish",
      "created": 1601391249,
      "upvotes": 16,
      "replies": {}
    },
    "g72oa1e": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72oa1e/",
      "text": "Do ANYTHING else.",
      "author": "YellowSubmarine8901",
      "created": 1601395641,
      "upvotes": 7,
      "replies": {}
    },
    "g72ajly": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72ajly/",
      "text": "Don’t bother with Twitter - no hiring committee gives a shit.",
      "author": "Bob_the_blacksmith",
      "created": 1601389950,
      "upvotes": 14,
      "replies": {
        "g746zg6": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g746zg6/",
          "text": "Twitter is a swamp of negativity and like Facebook, Instagram, and Reddit to an extent, a waste of time. Time you'll never get back.",
          "author": "aknb",
          "created": 1601420509,
          "upvotes": 3,
          "replies": {}
        },
        "g72fuvg": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72fuvg/",
          "text": "Definitely bother with Twitter - many great cooperations/academic friendships have been forged there.",
          "author": "WriterOfLetters",
          "created": 1601392241,
          "upvotes": 14,
          "replies": {
            "g732muu": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g732muu/",
              "text": "See if you can make twitter work for you, if not, don't bother with it.",
              "author": "ColourlessGreenIdeas",
              "created": 1601401548,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "g72l18t": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72l18t/",
          "text": "That's the worst advice possible :)\n\n1. In the pandemic situation, this is one of the main tools for networking\n2. Helps you to stay abreast of the literature\n3. Helps _a lot_ to promote your work\n4. Hiring committees care a lot about it (even many of the older folks); it's also very important in the industry, and is absolutely critical in smaller companies / startups\n\nArguably, Twitter in the top three tools for a modern academic, right after google scholar and library genesis :)",
          "author": "ampanmdagaba",
          "created": 1601394368,
          "upvotes": 9,
          "replies": {}
        },
        "g72hofw": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g72hofw/",
          "text": "Can you expand on this? I was under the impression it was important but I hate using it.",
          "author": null,
          "created": 1601392999,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g73pz8j": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73pz8j/",
      "text": "Be your own worst critic. Play devils advocate in everything you do",
      "author": "Achiocho",
      "created": 1601411882,
      "upvotes": 3,
      "replies": {}
    },
    "g73yu9l": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73yu9l/",
      "text": "As bitter as it sounds \"academia is not a meritocracy\"; don't focus on the research, focus on making the research (and yourself) look good on paper.\n\nNetworking is your main job since it's not about what you know, but who you know and how you cash in on those connections.\n\nYour aim isn't to publish good papers; your aim is to publish papers.\n\nIf your area of research isn't profitable it isn't getting funded.\n\nOh and...  Ignore all of the above and just do what you love, because at the end of the day if you did all of the above you'd likely suffer terminal imposter syndrome.  You might as well become the best you can in your field, publish only good papers you feel are ready, and network with people you respect and like.",
      "author": "HexesOfVexes",
      "created": 1601416071,
      "upvotes": 3,
      "replies": {}
    },
    "g73b209": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73b209/",
      "text": "Get a therapist right away. You know you have some shit to untangle so start on it before it becomes a bigger problem.",
      "author": "Harmania",
      "created": 1601405279,
      "upvotes": 4,
      "replies": {}
    },
    "g74urio": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74urio/",
      "text": "You are replaceable. So take it easy on yourself and have fun while you’re there.",
      "author": "dub_banjo",
      "created": 1601433755,
      "upvotes": 2,
      "replies": {}
    },
    "g74axeq": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74axeq/",
      "text": "Take your holidays.\n\nWhile you’re young and starting out, have more fun than you think you can afford.",
      "author": "nrnrnr",
      "created": 1601422766,
      "upvotes": 1,
      "replies": {}
    },
    "g74go0z": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74go0z/",
      "text": "Choose an advisor not just based on similar research but find someone you can have a good relationship with and feel comfortable confiding in. Being honest with your advisor and knowing they have your back can make the process sooo much better and less emotionally taxing.",
      "author": "Burrosonthebrain",
      "created": 1601426129,
      "upvotes": 1,
      "replies": {}
    },
    "g73ewoz": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g73ewoz/",
      "text": "Don't do a PhD.",
      "author": "sdcouple10",
      "created": 1601407031,
      "upvotes": -2,
      "replies": {}
    },
    "g75edrg": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g75edrg/",
      "text": "Buy reddit and prevent this question ?? So many things but it no longer matters. Wouldn’t this question be better serve as, can you recommend grad students ..... ?",
      "author": "FoCoCS",
      "created": 1601447660,
      "upvotes": 0,
      "replies": {}
    },
    "g74lqxd": {
      "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g74lqxd/",
      "text": "\"PLEASE MAKE YOUR MASTER THESIS BETTER, DON'T BE OBSESSED WITH FINISHING IN LESS THAN TWO YEARS PLEASE\"",
      "author": "MaDeVi55",
      "created": 1601429083,
      "upvotes": -1,
      "replies": {
        "g774k58": {
          "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g774k58/",
          "text": "Why? No one read it anyway",
          "author": "Nevermindever",
          "created": 1601489020,
          "upvotes": 1,
          "replies": {
            "g78m87a": {
              "link": "/r/AskAcademia/comments/j1yk75/advice_to_your_younger_academic_self/g78m87a/",
              "text": "Because I rushed it, made it very bad and I didn't learn to do a lot of stuff I had to fast-learn (and, for some things, I'm still learning) during my first PhD year",
              "author": "MaDeVi55",
              "created": 1601513952,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}