{
  "sid": "g91u92",
  "link": "/r/CollegeMajors/comments/g91u92/100_lost/",
  "title:": "100% lost 😩",
  "text": "I am a junior in high school and am researching and trying to figure what major I want to take on in college.. I don't have the best GPA (3.2) but I am bringing that up. I can't stress enough that I am *terrible* at anything regarding history so I'm steering clear of that.  I am very good at math (so far I've taken algebra 1 , hon. algebra 2, geometry, next year I am taking pre-calc and calc). I'm also good at English, I've gotten 90's+ in every english course. I am considering a degree in something in the business/finance world but I don't specifically know what/what I actually want to do after college. I don't want to leave school with a major I won't ever use. Anyone have any suggestions/recommendations on how to go about deciding this or even recommending majors?",
  "author": "bigant18",
  "created": 1587998163,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "fpkwa1l": {
      "link": "/r/CollegeMajors/comments/g91u92/100_lost/fpkwa1l/",
      "text": "Econ, CS,bio, chem, physics, engineering. Just choose one that interests you.\n\nAlso remember that college math is very different from high school math. There is a lot more emphasis on proofs, and they 'why' of math. It's a challenge, but math major's are quite marketable.",
      "author": "vishthefish05",
      "created": 1588702136,
      "upvotes": 1,
      "replies": {
        "fpmtrod": {
          "link": "/r/CollegeMajors/comments/g91u92/100_lost/fpmtrod/",
          "text": "I get what you're saying with the math courses... I didn't expect it to be the same. one of my parent's coworkers studied abroad and graduated with a math major but has no idea what to do with it and became a bank teller, so I'm looking for something more specific than that at least. I have been looking into computer science and it seems somewhat interesting to me, I'm just struggling with what I want to do after college, career-wise... would you be able to  spitball any interesting careers you know of?",
          "author": "bigant18",
          "created": 1588741511,
          "upvotes": 1,
          "replies": {
            "fpno4e0": {
              "link": "/r/CollegeMajors/comments/g91u92/100_lost/fpno4e0/",
              "text": "An applied math or statistics major could be quite marketable for a career in quantative finance. I would agree that math can be quite broad, but from the right university, it should land you a career in wall street.\n\nComputer science is great! It is hella marketable in this day and age. It is quite math heavy in some college's though.\n\n\nIf you pair up a compsci degree with psychology, you could go into AI or user interface design. A user interface designs a website that is easy to use and is \"human\" friendly. I can't really explain it well, just search it up I guess \n\nAll the best!\n\nEdit: Just realized that an applied math major could also lead to a actuarial science job.",
              "author": "vishthefish05",
              "created": 1588768681,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "foso5d8": {
      "link": "/r/CollegeMajors/comments/g91u92/100_lost/foso5d8/",
      "text": "CS, Engineering, Accounting, Actuarial Science \n\nTake your pick",
      "author": "Reav101",
      "created": 1588034589,
      "upvotes": 1,
      "replies": {}
    },
    "foqtofn": {
      "link": "/r/CollegeMajors/comments/g91u92/100_lost/foqtofn/",
      "text": "Look up some job listings you’re curious about and read what educational requirements they are asking for. \n\nIf you are good at math, you should certainly consider a STEM degree. Computer science is very math heavy and can open up a lot of doors if you’re interested in tech. I am an information systems major which is a mix of programming/tech classes and business courses.",
      "author": "infjetson",
      "created": 1588000635,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634060872
}