{"sid": "pe7p4l", "link": "/r/CollegeMajors/comments/pe7p4l/possible_anthropology_major/", "title:": "Possible anthropology major", "text": "Finishing up highschool and I'm starting to think about different majors. Anthropology looks really interesting but I was previously thinking about doing something centered around economics or marketing. Do anthropology related jobs pay well? (100k+ per year) Any good majors to pair it with? Really just looking for more information about jobs and job availability as I consider it thx.", "author": "UnderstandingHour", "created": 1630284891, "retrieved": 1632957538, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"hba30eq": {"link": "/r/CollegeMajors/comments/pe7p4l/possible_anthropology_major/hba30eq/", "text": "If making 100k or over is a high priority to you, I would not major in anthropology.", "author": "postmaloneismediocre", "created": 1630558473, "upvotes": 1}, "havvfgz": {"link": "/r/CollegeMajors/comments/pe7p4l/possible_anthropology_major/havvfgz/", "text": "Here are some videos that I found helpful regarding anthropology jobs:\n\nHighest Paying Jobs for Anthropology Majors by Calvin Raab: [https://www.youtube.com/watch?v=Mfs8hFhFIqo](https://www.youtube.com/watch?v=Mfs8hFhFIqo)\n\nHighest Paying Jobs for Anthropology Majors and Careers for Anthropology Majors by Alivia Brown (her channel is pretty much dedicated to explaining anthropology and anthropology work, I highly recommend you check her out): [https://www.youtube.com/watch?v=qYeRMSvs0MY](https://www.youtube.com/watch?v=qYeRMSvs0MY), [https://www.youtube.com/watch?v=cmaOeCd7UxY](https://www.youtube.com/watch?v=cmaOeCd7UxY)\n\nThe Curious and Captivating Careers of Anthropology by the AAA (American Anthropology Association): [https://www.youtube.com/watch?v=U1Cm3MgpQ14](https://www.youtube.com/watch?v=U1Cm3MgpQ14)\n\nCareers with Anthropology Degree by UCL (University College London): [https://www.youtube.com/watch?v=ZKY0aIK2sFI](https://www.youtube.com/watch?v=ZKY0aIK2sFI)\n\n(I've recently become interested in anthropology as well, so if you ever want to message me sometime feel free to do that. Also, you might want to look into UX if you're interested in marketing as well. If you don't know what UX is, it's basically the use of psychology, anthropology, sociology, and other social sciences combined with technology to create user interfaces for electronics and other technology so that companies can improve the use of their products and attract customers. However, I don't know how much STEM it requires, I'm sure it depends on what part of UX you want to look into so keep that in mind if STEM is not your strong suit. It is a very competitive industry, but also with a very quickly increasing job demand and there are all sorts of \"bootcamps\" you can do if you want to learn the basics. Here's an article with more information: https://xd.adobe.com/ideas/career-tips/how-to-get-into-ux-design/)", "author": "itsmematthewc", "created": 1630292988, "upvotes": 2}}}