{
  "sid": "q5ms76",
  "link": "/r/CollegeMajors/comments/q5ms76/accounting_vs_economics_vs_finance/",
  "title:": "accounting vs. economics vs. finance",
  "text": "can someone help me grasp the pros and cons between these majors?",
  "author": "puddingsweetpotato",
  "created": 1633921315,
  "updated": 1636188386,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hg8t0hx": {
      "link": "/r/CollegeMajors/comments/q5ms76/accounting_vs_economics_vs_finance/hg8t0hx/",
      "text": "If you have good enough grades for accounting. That will make you the most money right after graduating, you will also have quick and easy job hunts. \n\nEconomics (my major) it can be hard to find jobs. You won't make great money to start. \n\nFinance depends alot on your gpa and involvement in clubs/internships etc. But it's a good option.",
      "author": "Spread_N_Spit",
      "created": 1633969392,
      "upvotes": 1,
      "replies": {
        "hh8efpi": {
          "link": "/r/CollegeMajors/comments/q5ms76/accounting_vs_economics_vs_finance/hh8efpi/",
          "text": "What do you plan on doing with the econ degree?",
          "author": "caffeineaddict24",
          "created": 1634651849,
          "upvotes": 1,
          "replies": {
            "hh8qih9": {
              "link": "/r/CollegeMajors/comments/q5ms76/accounting_vs_economics_vs_finance/hh8qih9/",
              "text": "Well I planned on finding a cool job after graduation. That didn't really happen. I searched for far too long. Couldn't even find any decent internships in college that wanted econ. Then I ended up applying for management jobs in the construction industry due to a little experience estimating project cost in an internship. I spent a few years there now I work on the owners rep side of development. \n\nIn short, the industry i'm in I woulda been better off with engineering or construction management degrees. \n\nFinding a decent job that wanted an econ degree was like finding a needle in a haystack.",
              "author": "Spread_N_Spit",
              "created": 1634657074,
              "upvotes": 1,
              "replies": {
                "hh8qwz5": {
                  "link": "/r/CollegeMajors/comments/q5ms76/accounting_vs_economics_vs_finance/hh8qwz5/",
                  "text": "I was under the assumption that econ was extremely versatile, financial analyst, actuary, data analyst, and many more",
                  "author": "caffeineaddict24",
                  "created": 1634657240,
                  "upvotes": 1,
                  "replies": {
                    "hh8rdi2": {
                      "link": "/r/CollegeMajors/comments/q5ms76/accounting_vs_economics_vs_finance/hh8rdi2/",
                      "text": "Versitile but for those jobs you listed they'd rather have a finance degree. \n\nVersitile in my opinion isn't good for a degree. That just means you were able to learn a bunch of info that doesn't directly relate to anything you'll do at the job. Also means you have everyone that graduated with any type of versitile degree to compete for jobs with. \n\nMost good data analyst positions I was looking at wanted master's degrees, incredible grades and had tons of applicants.",
                      "author": "Spread_N_Spit",
                      "created": 1634657440,
                      "upvotes": 1,
                      "replies": {
                        "hh8rizn": {
                          "link": "/r/CollegeMajors/comments/q5ms76/accounting_vs_economics_vs_finance/hh8rizn/",
                          "text": "Oof. Never looked at it that way.",
                          "author": "caffeineaddict24",
                          "created": 1634657504,
                          "upvotes": 1,
                          "replies": {
                            "hh8rwct": {
                              "link": "/r/CollegeMajors/comments/q5ms76/accounting_vs_economics_vs_finance/hh8rwct/",
                              "text": "Me neither. Untill I graduated haha. \n\nIf you don't know what you want to do, take gen eds first and get serious about finding out what specific job or industry you want. Ask people to shadow, Google a bunch. Then work backwards to see what they're looking for. \n\nThe more you specialize the better.",
                              "author": "Spread_N_Spit",
                              "created": 1634657661,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}