{"sid": "nk68cv", "link": "/r/CollegeMajors/comments/nk68cv/the_only_thing_i_feel_like_id_enjoy_and_is_a_good/", "title:": "The only thing I feel like I'd enjoy and is a good financial decision is also something I feel like I'd hate. Major advice?", "text": "Edited", "author": "constantlyyconfused", "created": 1621884843, "retrieved": 1632846540, "over_18": false, "upvotes": 15, "upvote_ratio": 1.0, "comments": {"gzewy05": {"link": "/r/CollegeMajors/comments/nk68cv/the_only_thing_i_feel_like_id_enjoy_and_is_a_good/gzewy05/", "text": "3 years out of college in the mid-80's salary wise. My route was a Masters of Accounting at a cheap school with good scholarships. As a result, no debt, plenty saved, plenty of time for hobbies i.e. passions, and I am happy. \n\nFind something you like (not love) that will provide a good ROI.", "author": "TX_Godfather", "created": 1621963602, "upvotes": 1}, "gzd8o1j": {"link": "/r/CollegeMajors/comments/nk68cv/the_only_thing_i_feel_like_id_enjoy_and_is_a_good/gzd8o1j/", "text": "There's not a chance in hell you'll make $80k out of undergrad unless you major in software engineering (unless you move to SF/LA/NYC for certain fields, but then your housing costs are so high it offsets that $80k salary). And to do that, you might better off saving yourself $100k in tuition, room and board + missed opportunity cost by just teaching yourself, using online courses and freelancing your way into a high paying coding/designing job at some point. I know a guy who didn't go to college and now works at Facebook making $400k/year. Not saying it's easy, but it's possible and preferable to spending $100k on a degree.\n\nMy biggest piece of advice is to follow your passion and work hard - things will turn out better if you chase passion instead of money (within reason). Don't pick a major just because of the money - that's why we have so many shitty doctors in America. How many times do you go to the doctor and they're an arrogant prick or they don't even bother to look you in the eye or really try to understand your problem? Often for me, and it's because those people aren't passionate about helping others or medicine - they just wanted to be rich.\n\nWell let me tell you this, a doctor spends 12 years learning and training before the big bucks. That's 12 years they don't get to make money (opportunity cost) + tons of student loans + a major drain on their mind and bodies. Even the ones that make it out and get a high paying job often have $300k in student loans and are 30+ years old with zero in the bank. That's not financial security. \n\n If you really want to be financially secure, understand it's not what you make, it's what you keep. Be careful and smart with your money. Make a path for early graduation and like I did and save yourself a year's worth of tuition and board + get a salary for that year.\n\nWhen you do graduate, don't get yourself a new car like most of the idiots I see on the gram. Don't blow it at the club on the weekends. Don't get new clothes unless necessary. It's not about what you make, it's about what you keep.\n\nThere are a lot of guys in finance that work hard, save/invest most of their money, live at home for as long as they can, drive beat up cars, etc. and then retire by their early 30s with $800k-$1M in the bank. Then they can focus on starting a business, traveling, consulting, ubering for fun, etc.\n\nWe're all going to live to be 100. Sacrificing your 20s might not seem smart according to shitheads on Twitter, but those individuals will be working for someone else until they're 65, or older, or until Andrew Yang gives us Universal Basic Income.", "author": "killerpapers", "created": 1621927825, "upvotes": 1}, "gzbt6ab": {"link": "/r/CollegeMajors/comments/nk68cv/the_only_thing_i_feel_like_id_enjoy_and_is_a_good/gzbt6ab/", "text": "Some sort of nurse?", "author": "Platinum_Party_7", "created": 1621896753, "upvotes": 2}, "gzbie7u": {"link": "/r/CollegeMajors/comments/nk68cv/the_only_thing_i_feel_like_id_enjoy_and_is_a_good/gzbie7u/", "text": "Registered nurse pediatric endocrinology (or other speciality) and 2nd language Spanish.", "author": "Accurate-One-7037", "created": 1621891475, "upvotes": 2}, "gzbfvhk": {"link": "/r/CollegeMajors/comments/nk68cv/the_only_thing_i_feel_like_id_enjoy_and_is_a_good/gzbfvhk/", "text": "Elementary teaching", "author": "Fuckyouhass", "created": 1621890297, "upvotes": 0}, "gzbftyl": {"link": "/r/CollegeMajors/comments/nk68cv/the_only_thing_i_feel_like_id_enjoy_and_is_a_good/gzbftyl/", "text": "Lab", "author": "Fuckyouhass", "created": 1621890278, "upvotes": 0}, "gzbftil": {"link": "/r/CollegeMajors/comments/nk68cv/the_only_thing_i_feel_like_id_enjoy_and_is_a_good/gzbftil/", "text": "Nutrition", "author": "Fuckyouhass", "created": 1621890273, "upvotes": 3}, "gzbfsqb": {"link": "/r/CollegeMajors/comments/nk68cv/the_only_thing_i_feel_like_id_enjoy_and_is_a_good/gzbfsqb/", "text": "Orthophonie(speech therapy)", "author": "Fuckyouhass", "created": 1621890263, "upvotes": 2}, "gzbfpzr": {"link": "/r/CollegeMajors/comments/nk68cv/the_only_thing_i_feel_like_id_enjoy_and_is_a_good/gzbfpzr/", "text": "Nursing", "author": "Fuckyouhass", "created": 1621890228, "upvotes": 7}, "gzb5apl": {"link": "/r/CollegeMajors/comments/nk68cv/the_only_thing_i_feel_like_id_enjoy_and_is_a_good/gzb5apl/", "text": "Com sci", "author": "biggerarmsthanyou", "created": 1621885502, "upvotes": 1}}}