{"sid": "mbavsb", "link": "/r/CollegeMajors/comments/mbavsb/should_i_do_audio_engineering_or_is_there_a/", "title:": "Should I do audio engineering? Or is there a better major for me?", "text": "Just to get some things off the start: I'm in 9th grade, 14 and probably very naive.\n\nSo for quite a while, I loved music, mainly edm, rock and video game osts. I want to do work on ost's and recently my school did a long presentation about major options for high school and I was also thinking about college majors in the meantime. My mom said I should pursue audio engineering, but I'm still kinda confused about what I should be majoring if I want to do this career. Once again, feel free to flame me in the replies because I probably don't know anything about college, or how jobs work.", "author": "TotallyNotMasque", "created": 1616491877, "retrieved": 1632957214, "over_18": false, "upvotes": 4, "upvote_ratio": 0.84, "comments": {"gs07jpz": {"link": "/r/CollegeMajors/comments/mbavsb/should_i_do_audio_engineering_or_is_there_a/gs07jpz/", "text": "Relax. You are too young to be worrying about your major. Focus on your grades, ECS, and enjoying your time as a kid/teenager. Most people go into college figuring on one thing, but what isn’t advertised is that you don’t have to declare until at least 2nd semester sophomore year, if not first semester junior year. I’m telling you as a college student, and many others will tell you as well, college is over glorified. It is a lot of work, and I would much rather be 14 again. I know high school sucks too, but it won’t suck so much if you take a deep breath and realize that it is all going to be okay. I hope that I’m not coming off as harsh, because this is the same advice I give to everyone who is over focused on college in the a2c subreddit as well because I was that kid too and I wish I wasn’t.", "author": "hobgoblins46", "created": 1616553171, "upvotes": 1}, "grxztgv": {"link": "/r/CollegeMajors/comments/mbavsb/should_i_do_audio_engineering_or_is_there_a/grxztgv/", "text": "You're really far from college, so why not just pick that for now and see where your life goes in high school? :)", "author": "althyastar", "created": 1616516470, "upvotes": 5}}}