{"sid": "plvw4o", "link": "/r/CollegeMajors/comments/plvw4o/economics_major/", "title:": "Economics major?", "text": "Any economics majors in this sub? I’m considering majoring in economics but I’m not really sure what to do with it career wise. Is it useless or can you get a job with just a bachelors? I’m not interested in getting a masters  or any degree higher than that. My current major is in accounting but I can’t stop thinking about economics.", "author": "ShyCoconut0_0", "created": 1631315523, "retrieved": 1632846496, "over_18": false, "upvotes": 6, "upvote_ratio": 0.88, "comments": {"hcib3c6": {"link": "/r/CollegeMajors/comments/plvw4o/economics_major/hcib3c6/", "text": "Hi! I’m an economics major in my senior year right now. There is a lot you can do with economics, especially because many schools place a heavy emphasis on data analysis associated with economics. For me, it is functioning in much the same way as a business analytics degree. Because of this, there are my positions available with just a bachelors. If you wanted to specifically become an economist, most positions would require a masters. If you’re genuinely interested in economics, you should give it a shot! Especially because during recessions, demand for people with a degree in econ actually goes up so firms can make better decisions and plans in the face of financial turmoil. If you have any questions, feel free to hit me up!", "author": "Spwaaa", "created": 1631410195, "upvotes": 4}, "hcg83u8": {"link": "/r/CollegeMajors/comments/plvw4o/economics_major/hcg83u8/", "text": "My husband was an Econ major and he’s a dentist. I also have a friend that was an Econ major who is a VP of real estate for a big tech company. There’s quite a few options, if you like it go for it.", "author": "dondraperswife", "created": 1631377490, "upvotes": 1}, "hce8a4w": {"link": "/r/CollegeMajors/comments/plvw4o/economics_major/hce8a4w/", "text": "Many Econ majors get jobs in finance. It depends on your school, though.", "author": "postmaloneismediocre", "created": 1631330592, "upvotes": 1}, "hcdlrqr": {"link": "/r/CollegeMajors/comments/plvw4o/economics_major/hcdlrqr/", "text": "Accounting will guarantee a job while economics you will have to network like crazy to get a job. Maybe minor in economics.", "author": "sluttyjubilee", "created": 1631318882, "upvotes": 1}}}