{"sid": "dh4hs8", "link": "/r/CollegeMajors/comments/dh4hs8/english_vs_journalismmass_communication/", "title:": "English vs Journalism/Mass communication", "text": "I'm currently a sophomore with 30 credit hours getting my basics out of the way at a local community college. I'm having  a bit of a problem deciding on a major, since I have to pick before Spring of this year starts. I'm debating between English and Journalism or Mass Com., as I love writing long forms of works such as essays and research papers, but don't believe I'd do well in a non-creative environment. I'm probably not going to pick English because I don't enjoy writing literary analyses and would rather create my own forms of work rather than critique someone else's. However, that still leaves me undecided between Journalism and M.C., so if anyone has majored in any of these areas can give me a run down if I would do better in one field or another, I'd really appreciate the advice.", "author": "Mo-xie", "created": 1570932525, "retrieved": 1632848165, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"fl35pao": {"link": "/r/CollegeMajors/comments/dh4hs8/english_vs_journalismmass_communication/fl35pao/", "text": "Hi! I hope this post is not too delayed. I looked over the Mass Communication program curriculum at an esteemed university for you. It's emphasis is on media variety overall from my understanding (exploration of film, radio, advertising, design, etc.) Explore various curricula and see what fields acknowledged look promising to you. It depends also how you enjoy being creative. Although I was a science major, I contributed for my school magazine because I love to write also and learned about the field in that way plus it was very independently creative! You can join various clubs to wet your whistle and also looks great on your resume! I say you should also consider Creative Writing as a concentration. It's not as literature heavy but you get to take more classes that focus on your favorite type of writing", "author": "VitaminRee", "created": 1584769716, "upvotes": 1}}}