{"sid": "lb0mjs", "link": "/r/CollegeMajors/comments/lb0mjs/majoring_in_psychology_help/", "title:": "Majoring in psychology help??", "text": "I plan on getting a degree in psychology I’m in my first semester and I just rather find out  now then later. I heard it’s a useless degree and only low paying jobs are available with it? I do plan on becoming a mental health counselor in nyc with it and getting a masters does anyone have any advice or experience so far?", "author": "Aroberts3498", "created": 1612285498, "retrieved": 1632847026, "over_18": false, "upvotes": 8, "upvote_ratio": 1.0, "comments": {"gls48kj": {"link": "/r/CollegeMajors/comments/lb0mjs/majoring_in_psychology_help/gls48kj/", "text": "Serving Americorps after college is a great way to test the waters in the field, gain experience, build your resume and grad school application, and earning scholarship money.", "author": "turboshot49cents", "created": 1612299641, "upvotes": 3}, "glrc90g": {"link": "/r/CollegeMajors/comments/lb0mjs/majoring_in_psychology_help/glrc90g/", "text": "Well it's already good that you understand that in order to succeed with a psychology major you are going to need to go the masters route. Psychology is mostly a degree for many entry jobs but if you want to get into a psychology related field you will need to go higher on the education ladder. However while in graduate school you should plan to have a steady job to continue funding your education and also living expenses.", "author": "safespace999", "created": 1612288663, "upvotes": 5}, "glr7mnn": {"link": "/r/CollegeMajors/comments/lb0mjs/majoring_in_psychology_help/glr7mnn/", "text": "It is not useless if you like helping people. You can be a counselor, psychiatrist (if you go med school route), clinical psychologist (PhD route). Psychiatrists can make 200k+, clinical psychologists 100k+ and counselors between 60-90k+ with a masters. If you enjoy helping people solve their mental health issues then it is not useless. You'll make enough for a good living as a counselor, especially if you find the work meaningful.", "author": "biggerarmsthanyou", "created": 1612286848, "upvotes": 5}}}