{"sid": "jw8o2j", "link": "/r/CollegeMajors/comments/jw8o2j/any_advice_or_info/", "title:": "Any advice or info?", "text": "Well I’m already in my second year and for the spring semester I’m trying something different and I kind want any advice or any information on these majors and what careers that this might go to. These are my interests, but I’m not completely passionate yet on one that I might want to do or if it’s right for me and I don’t know any career that might be good in these majors even with some research that last me in the future, but might be something I like. I just want advice or any info I’m still in a process of trying. \n\nHuman development and family- I went into this because I’m a very curious person about what affect people and how or why they turn out this way, but I don’t what career this would be that won’t end up like babysitting maybe research or something still debating \n\nRehabilitations- I’m not specifically sure if the physical therapy part or helping people talk about their problems addictions because rehab your kind of like helping people back to almost normal and you are not really talking to a lot people just one on one session maybe so more less anxiety but I don’t know if there more to it\n\nINformation science technology- well this is a recent thing I’m trying because of the pandemic I’ve been thinking hard what job and what might really fit me. I’m new to this coding thing so instead of computer science I heard this was less intense. I’m really mostly want to work remote if I’m given and I’m really an\nintrovert so I’m not too well with people just small so yea.\n\nHuman centered designed and development- it kind of a new program your kind of seeing how people interact with technology and creating to have them use it their daily life so it does sound like I can have both, but I don’t know any career since it’s still new.\n\nI just want to look at the careers that you might suggest I don’t mind dealing with pros and cons (maybe add that too if you could) because I’m looking for internship soon and it my first work experience and don’t know where to start. Thank you I appreciate this.", "author": "prbly5", "created": 1605671711, "retrieved": 1632847125, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"gebxyig": {"link": "/r/CollegeMajors/comments/jw8o2j/any_advice_or_info/gebxyig/", "text": "I am concerned for you my friend, because I don’t really sense any connection with anything you are currently considering.  You are very introverted, but appear to be most interested in fields that involve interacting with strangers in a stressful context.  You will get over your introversion to an extent, I am very introverted myself, but can easily teach a 600 seat lecture.  The problem with introversion is that interacting with people leaves you exhausted not energize, and you need time alone to recharge.  I don’t think I could personally work with people 8 hours a day all week long.  Maybe you are different, but the first question I would ask myself is will I be energized with meeting with clients perhaps one or 2 an hour all day long? \n\nHow well put together do you feel?  You will need a strong center if you want to interact with people dealing with major problems, otherwise they will drag you down to where they are.  It is hard to deal with other people‘s problems if you have your own problems to deal with.\n\nAsk yourself, what are you good at?  Do you like working with people or things?  Are you better thinking things through logically, or do you ”feel” the right way forward?  Are you creative, would you like to design or build things?  Are you good with writing, math, getting computers to do what you want, fixing things, problem solving?  Does the answer to any of these questions suggest a path forward?\n\nSome possibilities such as engaging in research, or therapist often will require advanced degrees (at least a Masters or maybe a Ph.D.)  Do you have the desire, resources and ability to follow such a path?\n\nRegarding the human centered design, I would tend to avoid a new program, mainly because nobody really knows what hiring their graduates actually means.  What skills do they bring to the table, how will that help my business?  You will need to be really good at marketing yourself to get hired from these programs.  Maybe it could be a minor if you are interested in the subject.\n\nI don’t really have a good bead on information science technology.  It could be quite a few different things.  It may be a computer science shadow program.  Shadow programs mimic a prestigious program at the university, but are run by another college (e.g. an arts and sciences program while computer science is in engineering).  They provide bodies and tuition revenue for struggling colleges, and an outlet for students that could not get into the prestigious program.  Shadow programs are usually not worth your time, as recruiters really only want the real deal.  On the other hand, it could just be a very different program from computer science, perhaps with more of a business information technology perspective.  If you want the straight story, ask somebody in computer science about it.  If they speak respectfully about it, it is probably a pretty good program.  If it is not, the computer science types will be happy to tell you why.  If it is not a good program, it is probably best to stay away or do computer science.  If it is a good program, look at the classes and ask yourself do these topics appeal to you?  If you saw an article in a magazine about the topic, would you read the article or just turn the page?\n\nI am not trying to discourage you.  You may actually really thrive in any of these jobs.  You might become a passionate physical therapist.  You might set your sight on becoming a psychologist.  I just think you need to look at yourself a bit more closely and ask what you are best at, what sorts of thing might it be best to avoid, and what sorts of things hold your interests.  Understanding this will make your choices clearer or perhaps suggest some other directions you have not yet considered.\n\nWhatever you do do, it will be hard work and you will need to apply yourself to it.  But, once you have a goal and a plan, you can get there. I know you can.", "author": "dmstew", "created": 1606878968, "upvotes": 1}}}