{"sid": "avehf0", "link": "/r/CollegeMajors/comments/avehf0/picking_major_based_on_studies_vs_career/", "title:": "Picking major based on studies vs career", "text": "I thought maybe this could be an interesting discussion. I see two main schools of thought in picking a college major: pick a career based on your major or pick a major based on your intended career. Which, in your opinion, wins out in the end?\n\nPersonally, my career plans are fairly broad and flexible; throughout my childhood up until now I have wanted to be a florist, a park ranger, a zookeeper, a dog groomer, an artist, a bartender, a baker, a truck driver, a fashion designer, an animator, an entrepreneur, a nail technician, and plenty of other career paths. Even now, though I’m fairly confident in my general short term career plan, I don’t really know what I want to be when I grow up. I do, however, know that 1) having a bachelor’s degree, in general, is going to improve my career and salary prospects, 2) that I know lots of people who went on to do things they never would have imagined in their undergrad, and 3) that I would rather spend my time and money studying a subject matter I find inherently interesting and rewarding.\n\nSo while I did look at what possible jobs I could get with various degrees, I think the primary decision maker was whatever major I felt was a good fit given my interests and talents rather than, “I want to be x so I’m going to study y”. \n\nWhile there is no one size fits all approach, I am curious what method you guys typically recommend and which you feel is generally better for someone who isn’t sure what to major in.\n\n", "author": "puffy-jacket", "created": 1551280270, "retrieved": 1632957519, "over_18": false, "upvotes": 3, "upvote_ratio": 0.81, "comments": {"ehegktp": {"link": "/r/CollegeMajors/comments/avehf0/picking_major_based_on_studies_vs_career/ehegktp/", "text": "I always advocate for picking a major based on studies simply because there's no guarantees when it comes to the career path -- even if you study in a high in-demand career field, you may not find work after you graduate, either because you are not qualified enough (eg. not enough experience, need a graduate degree, etc.) or because everyone went into that major *because* it was in-demand (and by the time you graduate, there are more graduates than there are jobs and it's no longer an in-demand field anymore).\n\nYou also have to consider that the particular career/job you want after graduating may not be hiring when you do, whether it be universal (again, more graduates than there are jobs, or even older employees who are choosing not to retire) or local (they may be hiring elsewhere but not where you want to live). People might work hard toward a *very* specific job and then have no opportunity to actually work in that job, and end up using their degree for something else entirely (whether it be in their field or not).\n\nMeanwhile, even in a stereotypically \"unemployable\" major, you can still manage to get the necessary experience and whatnot in order to become employed after you graduate. If you do internships, research and teaching assistantships, network with businesses and organizations, build a rapport with your profs, etc. then you have a better chance already of finding a job than someone in a high in-demand major who *hasn't* done those things. If someone in a high in-demand major *does* do those things, then they have a better chance, but it still doesn't guarantee anything (some of the reasons for which I have already mentioned above).\n\nI chose to study my passion, which was history, and so many people told me that I'd never find a job with a history degree. However, I had a full-time job in my field before I even finished my BA. I didn't continue with it because I chose to go onto graduate school, but the fact is that I made the efforts necessary to find work in my stereotypical \"unemployable\" field while I watched friends of mine with stereotypically \"employable\" degrees go nowhere because they didn't make those efforts. *You* make *yourself* employable, so I'd personally rather study something I absolutely love than to waste my time with something that may go nowhere.", "author": "xPadawanRyan", "created": 1551282242, "upvotes": 3}}}