{"sid": "jfi3zl", "link": "/r/CollegeMajors/comments/jfi3zl/what_should_i_major_in/", "title:": "What should I major in?", "text": "For a while I’ve wanted to combine my two passions (asian studies and religious studies) into either a double major or major/minor combo depending on what the university offers. I planned to teach abroad in Korea for a few years, then come back to America to continue work in teaching (either as a professor or teaching Korean to American students).\n\nI guess I’ve realized the potential job market for Asian studies isn’t the biggest. There’s teaching, diplomacy, and translating/interpreting. I was thinking of scrapping the religious studies, (it’s definitely my biggest passion, but the least practical of the two), and going for a double major in something useful as a back-up in case I don’t want to teach. The job market for religious studies and Asian studies professors is also extremely competitive and difficult to get into, even though that is what I planned as an end goal for so long.\n\nI’m a strong writer and I think combining Journalism and Asian Studies into a double major could be a good idea. It seems like a good combination for jobs writing about Asian politics/pop culture/etc. My top school at the moment would also make this very easy for me, as 18 credits of the Journalism major need to be fulfilled by a minor or second major. I also considered the classic asian studies/business, but I hate STEM and the business majors I’ve seen require classes in calculus and other math courses.\n\nI’m open to any major suggestions or feedback on the ones I am considering. Thanks to everyone who read through this mess!", "author": "leswheein", "created": 1603303478, "retrieved": 1632957336, "over_18": false, "upvotes": 5, "upvote_ratio": 0.86, "comments": {"g9qq533": {"link": "/r/CollegeMajors/comments/jfi3zl/what_should_i_major_in/g9qq533/", "text": "If you want to teach Korean in the US, it might make sense to major in that. I’m not sure what the requirements are to teach Korean specifically in the US (are you talking about at a school or as a tutor?), but in general, the requirements to teach anything here in a formal setting are more strict than simply knowing the language and having some sort of degree, from what I’ve seen. You may also have to take some additional teaching courses or get a certificate to teach in the US. \n\nAs for religion or Asian studies or journalism, if it’s your passion, go for it! A double major or minor is great. Journalism is awesome but NOT something to do just because it’s “practical” — the field has been seriously hemorrhaging jobs for over a decade and is only projected to continue declining.  (BTW, if you do want to get into journalism today, it’s way more about working for your school newspaper, doing internships, and getting clips in other newspapers than about the major. Be prepared for a lot of crap pay and career instability, but if you love it enough it might be worth it.) \n\nIf you just want a real career path that involves writing and communication, consider digital marketing/content marketing. That’s where the jobs are right now. Some jobs are remote friendly, so you can live anywhere if you play your cards right, and having international experience can help your career. Also, you can do marketing with any major. Yes, there’s a marketing major, but most of the marketing professionals I know majored in something totally unrelated. You just need internship experience.", "author": "Lily9879", "created": 1603443790, "upvotes": 1}, "g9kgmpg": {"link": "/r/CollegeMajors/comments/jfi3zl/what_should_i_major_in/g9kgmpg/", "text": "That sounds like a great plan are you intrested in academia law school or the foreign service that might match your intrest that offers good careers", "author": "bhenchodland", "created": 1603305953, "upvotes": 2}}}