{"sid": "p90550", "link": "/r/CollegeMajors/comments/p90550/can_anthropology_be_a_hobby_and_more_questions/", "title:": "Can Anthropology Be a Hobby? (And More Questions Regarding Major and Career Advice)", "text": "(I was going to post this in the \"Ask Anthropology\" sub but they're strictly against college or career-related posts, let me know if this is not relevant enough.) So I'm currently majoring in Cognitive Science (technically I'm completing my AA in Psychology before transferring to a Cognitive Science program at a four-year) as I have both a deep interest in psychology and other social sciences as well as STEM. I recently got introduced to anthropology through a class I happened to take as a requirement, and I've been on a tear of learning more about it. I'm particularly interested in ethnographic/fieldwork qualitative research. However, I don't think I would want to necessarily do it as a career. I'm more interested in psychology and specifically psychological research, which is usually more quantitative. I'm wondering if it's possible just to be an ethnographer as a hobby? I wouldn't necessarily be interested in studying cultures in other countries, I'm more interested in subcultures in the US. Do you need a PhD or MA in Anthropology to learn ethnographic methods? I know that having multiple PhDs is kind of pointless, so is it possible to do anthropological research with a Psychology PhD?  I've also considered adding an Anthropology minor to my Cog Sci major. WIll a minor give me an appropriate intro to fieldwork, if I take classes that deal with that? Sorry if this sounds really disorganized and tangential, I hope this made sense.", "author": "itsmematthewc", "created": 1629582946, "retrieved": 1632958261, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"haid8j6": {"link": "/r/CollegeMajors/comments/p90550/can_anthropology_be_a_hobby_and_more_questions/haid8j6/", "text": "Anthro grad here, i would look into a lot of cultural anthro related courses for a minor. and that should get your feet wet into some fieldwork. I would also ask a counselor or whoever on what classes would give you more ethnography opportunities.", "author": "CroolSummer", "created": 1630033287, "upvotes": 2}, "h9xmxp6": {"link": "/r/CollegeMajors/comments/p90550/can_anthropology_be_a_hobby_and_more_questions/h9xmxp6/", "text": "are you coming off a wealthy family? if you dont need job to survive, this is good field.", "author": "ghostmode342", "created": 1629654600, "upvotes": 1}}}