{"sid": "n9quu4", "link": "/r/CollegeMajors/comments/n9quu4/international_business_fashion/", "title:": "International Business- Fashion", "text": "Hey! So I plan to get my bachelors in International Business at a university in Europe. I have always had an interest in fashion but do not think that I’d have much success going into the fashion industry directly. I wonder if it is possible to get my bachelors in International business, and if there are any job opportunities out there with that degree where I could work in the fashion field. Please let me know if I am looking at this wrong and if people with an International Business degree don’t typically end up in that field. Sorry hope this made sense I’d really appreciate any and all possible feedback/advice. Thank you!", "author": "iamgia07", "created": 1620715803, "retrieved": 1632846561, "over_18": false, "upvotes": 4, "upvote_ratio": 1.0, "comments": {"gyjd40p": {"link": "/r/CollegeMajors/comments/n9quu4/international_business_fashion/gyjd40p/", "text": "Fellow IB major here who used to work for a fashion startup; While your major doesn't directly lead to the fashion world, it can be used on the business side to your benefit. If you are hell bent on getting into fashion, then switching or double majoring could be considered, but if you can, try to get involved in fashion circles around your campus/city. Building connections and working with others with similar interests can take you very far, and having a slightly different skillset can help if you show how you can be useful.", "author": "OtherwiseNoteWorthy", "created": 1621316490, "upvotes": 1}, "gxpeypo": {"link": "/r/CollegeMajors/comments/n9quu4/international_business_fashion/gxpeypo/", "text": "If you want to go into the business side of the fashion industry, you should probably have something in your degree to specialise in that: International business doesn't typically feed into fashion. You'd probably be better off getting a dual major in Fashion and International business", "author": "StarvinPig", "created": 1620719448, "upvotes": 1}}}