{
  "sid": "qc6zsm",
  "link": "/r/CollegeMajors/comments/qc6zsm/linguistics_or_anthropology_minor_in_spanish_for/",
  "title:": "Linguistics or Anthropology + minor in Spanish for teaching Spanish or English.",
  "text": "Hello, \n\nSo, I've finally decided wtf I want to do and it's in the title, but I'm unsure if I should learn linguistics or anthropology and go into the linguistics field of it to teach Spanish. \n\nAlso, do I need a teaching degree? Would that mean I'd double major and minor?\n\nI've decided to self-teach Japanese, so that's off the table, but I feel that it is my duty to teach Spanish or teach English to Spanish speaking peoples. \n\nAny advice on what I should choose over the other (linguistics vs. anthropology with a subset in linguistics)? Thanks for any advice! Peace!",
  "author": "ManicTypist",
  "created": 1634753167,
  "updated": 1634849359,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hheb20d": {
      "link": "/r/CollegeMajors/comments/qc6zsm/linguistics_or_anthropology_minor_in_spanish_for/hheb20d/",
      "text": "That depends on where you plan to teach. You will probably need a teaching certification, which might mean either a teaching degree or some sort of post-bacc certificate program. You need to look up the requirements in your area. In my home state, I believe you have to go through a special teacher prep program (often a post-graduation certificate program) regardless of what your bachelor’s degree is in, and there are a few specific courses you’re supposed to take as an undergrad if you want to teach English (IDK about Spanish). Or at least, that’s how it was a few years ago when I was a student looking at career options. The requirements might be looser if you want to teach outside of the U.S. or in another state.\n\nIt’s quite possible that either a linguistics or anthropology degree will be just fine, depending on where you plan to teach. Majoring in English, Spanish, or teaching are more obvious choices, but those might not be the only options. Good luck with your research!",
      "author": "Lily9879",
      "created": 1634756782,
      "upvotes": 2,
      "replies": {
        "hhfr4sx": {
          "link": "/r/CollegeMajors/comments/qc6zsm/linguistics_or_anthropology_minor_in_spanish_for/hhfr4sx/",
          "text": "Honestly, I'd be teaching in the USA, most likely either English to Spanish speaking children, be it in a school, special school, or social working setting. \n\nThanks for the requirements recommendation!!!! I know in some state you don't need a license to be a sub, but in others you do, so you're totally right. \n\nThanks very much!",
          "author": "ManicTypist",
          "created": 1634779107,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}