{"sid": "c4evtv", "link": "/r/CollegeMajors/comments/c4evtv/can_i_still_get_into_decent_schools_as_a_biology/", "title:": "Can I still get into decent schools as a Biology or Meteorology major with little to no extracurricular regarding those subjects?", "text": "\nI’m doing a health/biology week long program at Dartmouth this summer. That’s about it for science. I will be taking AP Bio senior year, though. My school only offers 6 APs so taking that is a big deal for me. \n\nEarth science/meteorology is one of my true passions but I’ve never done much about it other than online research and watch hundreds of documentaries. \n\nI play 4 instruments and devote most of my time to those because they help me get by. \n\nThis is my list regarding each subject:\n\nBiology: Dartmouth Pre-College health careers Program (2019)\n\nMath: American Math Competition (11) (ik this is irrelevant since I didn’t score high), Math Honor Society (11,12), Math tutoring at elementary school \nNational Honor Society (11,12)\n\nMusic: Band clarinet(9,10,11,12), Piano (9,10,11,12), Piano lessons (9th), Guitar (9,10,11,12), Ukulele (11,12), All county band 2019 (11)\n*i realize I never got any awards for these specifically, im not comfortable competing/performing. However my school recognized me and awarded me the RIT Innovation and Creativity Award Scholarship \n\nVolunteering: Turkey Trot volunteer (9,11) yeah... school doesn’t require volunteering and I live in a hard place to get in/out of so I can’t just go wherever I want. My dad doesn’t drive and my mom is constantly at work. \n\nLanguage: Spanish club (9,10,11,12), French club (9,10,11,12)\n*i’m very good at Spanish and will be pursuing a Seal of Biliteracy from NYS\n\nArt: Ceramics summer programs (9,10,11)\n* what can I say I love pottery. \n\n\nNOW I realize my ECs are all over the place, as am I. I don’t believe we should all know what we want to do at this age and I’ve only recently decided to pursue these fields in university. \n\nSo my original question.... [title]", "author": "md8x", "created": 1561334373, "retrieved": 1632957514, "over_18": false, "upvotes": 4, "upvote_ratio": 0.84, "comments": {"erwl87n": {"link": "/r/CollegeMajors/comments/c4evtv/can_i_still_get_into_decent_schools_as_a_biology/erwl87n/", "text": "Yes you can. Most people have absolutely zero experience in their major prior to choosing it. I didn’t have an archaeological experience/ volunteering prior to majoring in it and I was still able to get into a really good program. \n\nDepending on your school, you simply just message the advisor for your major and they mark you as being enrolled in their program. Some schools require you to fill out applications and put you on a waiting list, but even most of these individuals have ever done anything within their major. If you’re just shooting for a decent college in your field, you should be fine. \n\nMay I ask what college you plan to attend for these majors?", "author": "The_Max_Rebo", "created": 1561347051, "upvotes": 1}}}