{"sid": "bfeuw9", "link": "/r/CollegeMajors/comments/bfeuw9/i_know_what_i_want_as_a_career_but_i_cant_decide/", "title:": "I know what I want as a career, but I can’t decide which major to choose.", "text": "Basically I want to work in a business, preferably an international business, and I want to work in the marketing + advertising side of things. I hear a marketing major isn’t worth getting, since the idea of marketing changes every time. I also don’t want to get an advertising major because I feel like it won’t teach me important things if you get what I mean. I was interested in International Relations (my current plan) but I just want to get the opinions of other people. I’m currently in my first semester of community college, so there’s no serious rush.\n\nEveryone IRL tells me to “quit doing this stupid stuff and become a doctor” (really hurts my confidence 😔)", "author": "rhythmblues", "created": 1555782026, "retrieved": 1632848193, "over_18": false, "upvotes": 7, "upvote_ratio": 1.0, "comments": {"eldcbcg": {"link": "/r/CollegeMajors/comments/bfeuw9/i_know_what_i_want_as_a_career_but_i_cant_decide/eldcbcg/", "text": "Business Data Analytics and Marketing would be a great double major if you’re willing to double major.", "author": "thekidboy", "created": 1555788480, "upvotes": 1}, "eldbfjd": {"link": "/r/CollegeMajors/comments/bfeuw9/i_know_what_i_want_as_a_career_but_i_cant_decide/eldbfjd/", "text": "I don't know if they have it at your university, but I know my ex is earning her major in International Business. I might even suggest History if you are looking to work in marketing and advertising. History degrees prepare you with a solid core of persuasive skills, research skills, and critical thinking discipline [that many employers look for](http://www.bbc.com/capital/story/20190401-why-worthless-humanities-degrees-may-set-you-up-for-life). The data on where we end up working after college shows us in a [broad range](https://www.historians.org/wherehistorianswork) of professions. If it interests you at all it is definitely worth pursuing if you want to work in the business world and want to distinguish yourself among a sea of Business majors.", "author": "jupchurch97", "created": 1555787899, "upvotes": 1}, "eld9s9i": {"link": "/r/CollegeMajors/comments/bfeuw9/i_know_what_i_want_as_a_career_but_i_cant_decide/eld9s9i/", "text": "The marketing field has/is strongly moving towards data-driven decision making, especially with college hires -- think customer segmentation, control group testing, etc. Picking a related major will undoubtedly help you down the road, including areas like business analytics, comp sci, or even finance. Data related fields are also a great way to build tangible career capital. You're early on and your interests may change later, but understanding how to analyze and work with data is a valuable transferable skill that would position you for success.\n\nAlso not sure who is telling you that a business major is 'stupid' given that it has one of the highest earning potentials/floors of any, so do not put any credence in that. PM me if you want data to back that up.", "author": "jobcareer", "created": 1555786800, "upvotes": 1}, "eld45n0": {"link": "/r/CollegeMajors/comments/bfeuw9/i_know_what_i_want_as_a_career_but_i_cant_decide/eld45n0/", "text": "You could always try comp sci/programming and try getting into more of the marketing analytics side of things.  You're right that marketing is always changing, but that data analytics side is one major part of it that is here to stay.  Being able to aggregate and splice data as you need to is a great way to make yourself stand out from other students vying for these positions, since you then have a skill to supplement what you want to do.  Plus, this ties in with advertising in that it helps you better define your target customer and understand what people are saying about your product.", "author": null, "created": 1555783040, "upvotes": 2}}}