{"sid": "ch6zvk", "link": "/r/CollegeMajors/comments/ch6zvk/please_help_which_major_should_i_choose/", "title:": "Please help, Which major should i choose?", "text": "i finally finished school ( igcse) and i can't' decide ,  \nmy father wants me to study engineering like himself, i wanted to study business and i think it is the easiest for me and the one which i will be able to achieve high grades, but now that i think about it, in my country there are so many business graduates, perhaps the most popular major here, and i feel that i will not find jobs with a good salary, on the other hand , i was thinking about studying computer science, i tried python before and it wasnt that hard but i got bored, compute science jobs in my country are more likely to have higher salary jobs, as it is a major that requires a higher score than business, i have some interest in studying programming, and i sit most of my day in front of computers anyway Xd, but i absolutely hate math, especially calculus which i failed in school 2 times only to succeed the third, thats why i am afraid of studying cs cuz i will probably fail calculus the first time and maybe more. which do you think should i study?", "author": "KhGamed", "created": 1563967970, "retrieved": 1632958163, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"euqi956": {"link": "/r/CollegeMajors/comments/ch6zvk/please_help_which_major_should_i_choose/euqi956/", "text": "Okay. I’ll say this. I’m currently a university student myself- people with a degree hardly go about using it. I’m in programming for animation. And yet I’m thinking about a coffee shop. \nYou’re looking at this very tactically which in some aspects is good, however it very well may bite you in the bum later on. \nGo get the degree that you’ll enjoy doing. Whether there’s a lot of people working those jobs or not, if you’re good at what you do then you’ll get a job regardless. Just don’t choose something due to people telling you or for financial reasons. People live out of vans and travel like crazy and they survive simply by a blog or podcast. They’re happy and live insane lives. It doesn’t take much but don’t over think it.", "author": "HollowRibcage", "created": 1563979011, "upvotes": 2}}}