{"sid": "ekt2f4", "link": "/r/CollegeMajors/comments/ekt2f4/what_should_my_college_major_be/", "title:": "What should my college major be?", "text": "Hi there, I'm finishing high school and have to decide what should I major in college. As a child, I always wanted to be an architect but when I started high school I found interest in web/UI/UX design and programming. I took some online courses, did lots of personal projects and I absolutely love it. I've been learning it for 2 years now and don't want to stop.\n\nThe problem is though there are not any colleges near me where you can learn this. There are graphic design (not so related) and computer science and IT (require A-math level).\n\nI have high chances of getting into architecture school and I still love architecture/interior design but I'm worried about regretting that decision and I know how much hard work and dedication it takes to finish this degree. I took some career counseling but still haven't been able to figure it out. Any advice?\n\nPS I'm not from the US and every college teaches you one particular field you want to specialize in. there are not really majors and minors here which makes it even more difficult, so if you decide to change your major, here that's equal to dropping out of college and hoping you get accepted into the one you want.\n\nThanks in advance", "author": "nikola1236", "created": 1578311077, "retrieved": 1632957377, "over_18": false, "upvotes": 5, "upvote_ratio": 0.86, "comments": {"fddzlbl": {"link": "/r/CollegeMajors/comments/ekt2f4/what_should_my_college_major_be/fddzlbl/", "text": "I would say to choose the major that is actually available to you. Also, architecture seems to be your longer held passion. I went through a similar thing in high school. I decided in high school to get a major in Zoology to work with animals, even though I had wanted to be an English teacher all throughout middle school. Now, in college, I've decided to go back to becoming an English teacher because English is the one subject I've always loved. I realized I don't like science as much as I thought.", "author": "AnonymousPinkDolphin", "created": 1578327792, "upvotes": 1}}}