{
  "sid": "q220wz",
  "link": "/r/CollegeMajors/comments/q220wz/major_in_physics/",
  "title:": "Major in physics",
  "text": "Hey guys, so I’m about to apply to college/university and I was wondering if I can become an engineer or have a future in engineering with a physics degree?",
  "author": "AQT2002",
  "created": 1633457152,
  "updated": 1636189089,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hfij8pt": {
      "link": "/r/CollegeMajors/comments/q220wz/major_in_physics/hfij8pt/",
      "text": "I think it's possible to become an engineer with a physics degree but if you know what kind of engineer you want to be it would be better to pick that as your major instead of physics. Also, this only really applies if you're in the US. I don't know what the expectations are in other countries.",
      "author": "anonymoususer666666",
      "created": 1633461423,
      "upvotes": 1,
      "replies": {
        "hfiji2f": {
          "link": "/r/CollegeMajors/comments/q220wz/major_in_physics/hfiji2f/",
          "text": "Yeah I would but that’s where I ran into a little problem unfortunately. I don’t know what type of engineer I want to be and so many choices doesn’t make it easier either",
          "author": "AQT2002",
          "created": 1633461531,
          "upvotes": 2,
          "replies": {
            "hfikats": {
              "link": "/r/CollegeMajors/comments/q220wz/major_in_physics/hfikats/",
              "text": "Ok that makes sense, if you're still a freshman you can just take the engineering prerequisites (like the calc sequence, linear algebra, physics, etc) and do some googling to see what fields interest you then start that major your sophomore year. You could also ask your school's career center about how many of their physics graduates end up in engineering or what they typically do after graduation if you're still really unsure. Hope this helps and good luck finding a major.",
              "author": "anonymoususer666666",
              "created": 1633461855,
              "upvotes": 1,
              "replies": {
                "hfiko97": {
                  "link": "/r/CollegeMajors/comments/q220wz/major_in_physics/hfiko97/",
                  "text": "Thank you I’ll make sure to remember this and good luck to you too!",
                  "author": "AQT2002",
                  "created": 1633462003,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "hh5vtyr": {
              "link": "/r/CollegeMajors/comments/q220wz/major_in_physics/hh5vtyr/",
              "text": "How do you know you want to be an engoneer and not a cs major or physicist or accountant?",
              "author": "42gauge",
              "created": 1634595830,
              "upvotes": 1,
              "replies": {
                "hhj2c3q": {
                  "link": "/r/CollegeMajors/comments/q220wz/major_in_physics/hhj2c3q/",
                  "text": "I wouldn’t say any of those really interest me maybe except a physicist",
                  "author": "AQT2002",
                  "created": 1634844959,
                  "upvotes": 1,
                  "replies": {
                    "hhjy26e": {
                      "link": "/r/CollegeMajors/comments/q220wz/major_in_physics/hhjy26e/",
                      "text": "Well why do you want to be an engineer and not a cs major or accountant? What makes engineering better than those two to you?",
                      "author": "42gauge",
                      "created": 1634858599,
                      "upvotes": 1,
                      "replies": {
                        "hhn2qvr": {
                          "link": "/r/CollegeMajors/comments/q220wz/major_in_physics/hhn2qvr/",
                          "text": "I felt more of a pull towards it, more of an interest whereas when I think of the other two I don’t have any interest or attraction towards the idea of it, and I’m not saying they’re bad just not for me personally",
                          "author": "AQT2002",
                          "created": 1634921639,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hic4fam": {
              "link": "/r/CollegeMajors/comments/q220wz/major_in_physics/hic4fam/",
              "text": "If it helps, you could always major in MechE \nAnd then either go to grad school for something more specialized or try and snag a job in a different field with just a undergrad (MechE is very flexible) \n\nTo become an engineer with a physics degree you’d might have to go to grad school anyways.\n\nHowever If you only think you wanna become a engineer but still wanna leave a door open for a possible physics career. Physics is probably the better choice",
              "author": "DectiveHorrorCats",
              "created": 1635390854,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfz4z2x": {
      "link": "/r/CollegeMajors/comments/q220wz/major_in_physics/hfz4z2x/",
      "text": "Hell yeah!!! Physics STRONK! Understand math, the universe, and everything!\n\nI’m pursuing an Engineering Physics BS but I also plan to get a computer science MS (for job prospects, if I’m honest). Even without the MS though, physics majors are similar to math majors in that they can sort of act like technical generalists and adapt to many different quantitative fields like software engineering, finance, data science, engineering, etc. Now, that’s not to say a physics major’s knowledge is equivalent to an electrical engineer who specializes in chip design or a CS major who knows how to build Linux from scratch.  But you bet your ass that a physics major COULD learn those things if they needed to, which makes them very flexible.\n\nPersonally, I recommend CS as a non-physics job for physics majors because it’s probably the most abstract and mathematical kind of engineering — you work with concepts and abstractions more than physical devices, for which physics equips you well.  I also know physics majors who have gone into aerospace, electrical, and mechanical engineering.  Having a master’s in one of those things in addition to the physics BS helps though, so that you at least have some field-specific knowledge when you go to interview.\n\nCheck out APS for more: https://www.aps.org/careers/",
      "author": "civis_romanus",
      "created": 1633783326,
      "upvotes": 1,
      "replies": {}
    }
  }
}