{"sid": "l1aw5j", "link": "/r/CollegeMajors/comments/l1aw5j/history_double_major_with_art_history_geography/", "title:": "History double major with ___? (Art history, geography, anthropology)", "text": "Hi,\nI am going to be attending SUNY Geneseo as a transfer student, and I know I'm going to major in history, and have been debating what to double major or minor in. Originally I was thinking about art history, as I am interested in that but the program here is not super great from the looks of it. I am now considering:\n\nAnthropology: have an interest in archeology, biological and linguistic, not so much in cultural. Had a really bad intro to cultural anthropology prof at my current college, who kind of made me dislike cultural anthropology mostly just because he was stupid and painful at lecturing. \n\nOr\n\nGeography\nI wasn't ever considering this until I was looking thru the college's catalog, I do enjoy geography although never been full on geography nerd, thought it might be a nice fit with history. Apparently the program at Geneseo is really good.\n\nSo for clarity, I am planning on going on to grad leval for history want to become a history instructor at the college leval, it's definitely my passion, so I'm wondering which out of these options might be most beneficial and/or complementary with history.\n\nThanks,", "author": "KafkaFranzisaBug", "created": 1611155049, "retrieved": 1632956943, "over_18": false, "upvotes": 7, "upvote_ratio": 0.89, "comments": {"gjyckwc": {"link": "/r/CollegeMajors/comments/l1aw5j/history_double_major_with_art_history_geography/gjyckwc/", "text": "I truly think it’s tradition to have a terrible Cultural Anthropology professor. Really left a poor impression for me on the subfield, but I do recognize it’s significance, purpose, and benefit towards my focus of Archaeology.\n\nI personally think you’ll be fine going with either major/minor, as they both compliment History quite well. Archaeology and History really go hand in hand, as the former covers the prehistoric aspects of our species in order to reconstruct past human landscapes. Archaeology can also help fact check historical myths and documents, such as how Battle of Little Bighorn really occurred, so it isn’t all prehistory. Overall, it can give you a broader perspective of the past and what to focus on in any time period. I minored in History and found my major of Anthropology to be extremely beneficial to it. \n\nGeography can be equally beneficial, especially if you’re interested in historic demography. Art history is decent too, but many of those courses are also usually cross listed with Anthropology, so you can still take plenty of that at the same time.\n\nI think the best way to decide is to pick the one most relevant to your main major’s focus. What is it you’re trying to study more of with your history major? Do you have any plans for your thesis?", "author": "The_Max_Rebo", "created": 1611157564, "upvotes": 3}}}