{"sid": "cwrnwg", "link": "/r/CollegeMajors/comments/cwrnwg/i_should_get_degrees_in_both_anthropology_and/", "title:": "I should get degrees in both Anthropology and _______?", "text": "I am so in love with anthro, I cannot conceive of a career without it. However, I know there isnt a lot of demand for anthro majors.\n\nI think I could, and should, double major or minor in another field to broaden my prospects.\n\nI have thought of marketing, foreign language, and international business. Also climate change effects on societies.\n\nDo you guys have any ideas?\n\nThanks!", "author": "ImPlayingTheSims", "created": 1567029958, "retrieved": 1632956906, "over_18": false, "upvotes": 7, "upvote_ratio": 1.0, "comments": {"ez7zxf9": {"link": "/r/CollegeMajors/comments/cwrnwg/i_should_get_degrees_in_both_anthropology_and/ez7zxf9/", "text": "Every degree you just listed = useless. Anthropology is prolly your best choice IMO. For your interest in climate change and all that, do environmental engineering or science. Might as well major in something in demand like the STEM field or some other field that won't leave you with no job and tons of debt. TBH if money ain't an issue or you get free tuition or w.e then none of the above matters.", "author": "TiNyUzi", "created": 1567730962, "upvotes": 1}, "eyli5su": {"link": "/r/CollegeMajors/comments/cwrnwg/i_should_get_degrees_in_both_anthropology_and/eyli5su/", "text": "[deleted]", "author": null, "created": 1567185034, "upvotes": 1}, "eyky8tr": {"link": "/r/CollegeMajors/comments/cwrnwg/i_should_get_degrees_in_both_anthropology_and/eyky8tr/", "text": "You mentioned an interest in climate change so I think environmental science/studies or geography would be a good second major or minor. \n\nIt’s true that there aren’t many jobs directly in the field of anthropology but that doesn’t mean there isn’t something out there for you that you could do with that background. I’m taking an anthro course for a gen ed requirement and the professor was talking about an anthro student who was really interested in studying different sports subcultures, now she has a job in sports journalism. So while it’s good to be realistic about job prospects don’t be afraid to go with what really interests you.", "author": "puffy-jacket", "created": 1567171504, "upvotes": 1}, "eykbfhf": {"link": "/r/CollegeMajors/comments/cwrnwg/i_should_get_degrees_in_both_anthropology_and/eykbfhf/", "text": "Depending on which side of anthropology you fall on, GIS could be a very lucrative pursuit. It goes hand in hand with anthropology, as well as about a dozen different fields. I’d say that it has a use in about every field that you’ve expressed interest in! It’s growing pretty fast and job outlook is really good, so it would offer stability. You can absolutely use it if you find work in anthropology, but if you cannot, you can certainly find employment in something else with GIS. \n\nThis is 100% on computers though, so if you’re not proficient or really like working on them, it might not be the degree for you. Even then, I don’t really like working on computers, but will say that GIS is pretty fun to use and it’s really satisfying to input data and see your results appear. Of course, I’m only getting a certificate in GIS, not a full degree, so this experience might be different for you. Good luck!", "author": "The_Max_Rebo", "created": 1567143700, "upvotes": 2}, "eyetf2a": {"link": "/r/CollegeMajors/comments/cwrnwg/i_should_get_degrees_in_both_anthropology_and/eyetf2a/", "text": "Psychology and sociology I think are the obvious choices that would go hand in hand with anthropology pretty well, so you can consider those.\n\nAnother option is double majoring in management/Human Resources/occupational psychology (explore what options your university of choice has in these areas). Definitely could find something after college in one of those areas, but it might not be your cup of tea.", "author": "numbersaremygameyall", "created": 1567038746, "upvotes": 2}, "eyeq70c": {"link": "/r/CollegeMajors/comments/cwrnwg/i_should_get_degrees_in_both_anthropology_and/eyeq70c/", "text": "What’s your dream job?", "author": "slouchingbethlehem", "created": 1567037400, "upvotes": 2}, "eyediok": {"link": "/r/CollegeMajors/comments/cwrnwg/i_should_get_degrees_in_both_anthropology_and/eyediok/", "text": "Maybe you could study psychology along with it, as it has some relation, yet it can be a little more applicable in career paths. Or maybe archeology?", "author": "E_enzo", "created": 1567032274, "upvotes": 3}}}