{"sid": "cvcq52", "link": "/r/CollegeMajors/comments/cvcq52/should_i_major_in_biochemistry_im_terrible_at/", "title:": "Should I major in Biochemistry? I'm terrible at math but like highschool chem?", "text": "So I am going into school this year and want to apply for various stem scholarships, some of which ask me to declare my major. I am not really good at math - for some context, my math sat score was a 620 - and don't enjoy it. I like the aspects of high school biology and chemistry but am not sure whether biochem as a major and profession would be right?", "author": "redfishbluebitch", "created": 1566760097, "retrieved": 1632848274, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"eyoe6k6": {"link": "/r/CollegeMajors/comments/cvcq52/should_i_major_in_biochemistry_im_terrible_at/eyoe6k6/", "text": "At my alma mater, biochem majors only have to take up to calc 2 which isnt crazy, but will definitely challenge anyone who is just trying to get through the math classes to get to their programs. Along side that, they are also required to take the mechanics and electromagnetism physics courses. These requirements could be very different at your university, but generally you may have to learn and apply relaticely high level math for biochemistry.", "author": "Christhomps", "created": 1567275423, "upvotes": 1}, "eylae2m": {"link": "/r/CollegeMajors/comments/cvcq52/should_i_major_in_biochemistry_im_terrible_at/eylae2m/", "text": "Even if you’re not the best at math if you’re willing to put in the work and have the attitude that you can get better you will be fine... worst case scenario maybe the math involved in biochem will be too much for you and you will still have time to transfer to a different, less math intensive major.", "author": "puffy-jacket", "created": 1567179921, "upvotes": 1}, "ey47fbn": {"link": "/r/CollegeMajors/comments/cvcq52/should_i_major_in_biochemistry_im_terrible_at/ey47fbn/", "text": "620 isn’t bad at all. Plus SAT math doesn’t equal college math. Put time into strengthening your fundamental understanding of math, and make sure you actually study, and don’t leave things last minute. I personally think you should be fine", "author": null, "created": 1566783861, "upvotes": 2}, "ey3u01o": {"link": "/r/CollegeMajors/comments/cvcq52/should_i_major_in_biochemistry_im_terrible_at/ey3u01o/", "text": "Math and science will always go hand in hand. Be careful because you will be taking calculus. Currently what I’m doing.", "author": "ShadyAssBitch", "created": 1566773665, "upvotes": 2}}}