{
  "sid": "asgtps",
  "link": "/r/CollegeMajors/comments/asgtps/need_help_with_deciding_a_major/",
  "title:": "Need Help with Deciding a Major",
  "text": "I know there are tons of posts about this but I was curious of some interesting majors. I am currently finishing up my prereqs and am wanting to start deciding on a major.  I just cannot decide on something. I have considered going into biology, engineering, criminal investigations, the list goes on. I know I want to do something that makes a positive difference. If anyone has any ideas of a degree that does not cost a fortune but can help people or even animals, please offer your ideas. thanks a lot :)",
  "author": "swedishchef2012",
  "created": 1550618153,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "egutm49": {
      "link": "/r/CollegeMajors/comments/asgtps/need_help_with_deciding_a_major/egutm49/",
      "text": "You seem similar to me in the fact that we both have outrageous amounts of interests, which I presume you do considering the breadth of your choices! \n\nThere are innumerable degree choices that in some way, shape, or form assist and help people/ animals. That also includes innumerable ways to approach helping people and animals as well. What exactly do you want to assist people or animals with? If you can narrow this down, I may be able to suggest a few careers/ degree pathways! ",
      "author": "The_Max_Rebo",
      "created": 1550635873,
      "upvotes": 1,
      "replies": {
        "egvw00z": {
          "link": "/r/CollegeMajors/comments/asgtps/need_help_with_deciding_a_major/egvw00z/",
          "text": "I would say I would love to be behind the scenes of healthcare. I have considered being a doctor or vet but the patient interaction is where I'm lacking. I like to work alone so maybe something in a lab? Thanks for the help :)",
          "author": "swedishchef2012",
          "created": 1550679627,
          "upvotes": 2,
          "replies": {
            "egvx6zc": {
              "link": "/r/CollegeMajors/comments/asgtps/need_help_with_deciding_a_major/egvx6zc/",
              "text": "Have you considered Microbiology? That sort of degree can lead to work in immunology, parasitology, and pathology. Although most people get this degree as their ticket to medical school, the ones that do not tend to find work either on pharmaceuticals or lab work relating to healthcare. \n\nI briefly considered this major so I could study parasites in someway, so I’ve done some research already. Although there aren’t tons of jobs within this sector, many have very low bars of entry, with some only requiring an AS rather than a BS/BA. This could work to your advantage if you get a BS/BA. Just be sure to get actual lab experience if you go this route via internships or volunteer work, as many firms will not hire someone without it despite their qualifications. \n\nI’m happy to answer any questions you have relating to this major too! ",
              "author": "The_Max_Rebo",
              "created": 1550680460,
              "upvotes": 1,
              "replies": {
                "egwqzdm": {
                  "link": "/r/CollegeMajors/comments/asgtps/need_help_with_deciding_a_major/egwqzdm/",
                  "text": "That is a major I have considered. I always thought being a pathologist was amazing but was scared of the path of med school. I was just nervous about some of the classes. I know organic chemistry and some difficult math. Courses are required. I was always someone that struggled with math so hopefully I'll do ok. Thanks for your advice. I really appreciate it!!! :-)",
                  "author": "swedishchef2012",
                  "created": 1550700109,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634059796
}