{
  "sid": "a4odhz",
  "link": "/r/CollegeMajors/comments/a4odhz/to_anyone_thinking_of_changing_majors/",
  "title:": "To anyone thinking of changing majors:",
  "text": "I switched majors from Kinesiology to Computer Science this year, and I think it is the best decision I could have made.\n\nI was doing well in my classes too, 3.6 GPA, thinking of applying for honours, etc. But I was not happy.\n\nI just was kinda going through the motions with my classes and I knew if that was the case, then I would just be going through the motions with my career.\n\nI started learning Python to get into coding and fell in love. It is so much fun just to have the freedom to create, and in this exploration I discovered my passion for coding.\n\nNow I'm no genius or what have you, in fact my C in Grade 12 would love to say otherwise but I know that this is what will make me happy.\n\nSo basically my advice is to not just do something for the money, but to try and follow something you are really passionate about. But also be realistic about the job market, if that is one of your concerns.\n\ntl;dr follow your dreams my dudes.",
  "author": null,
  "created": 1544387062,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "ec1ugdw": {
      "link": "/r/CollegeMajors/comments/a4odhz/to_anyone_thinking_of_changing_majors/ec1ugdw/",
      "text": "Doing criminal justice right now I was undecided whether or not to continue with this major, but then I started to take courses and I started liking it a lot, now I want to be part of the criminal justice field to help people, I talked with detectives/officers/court officers all of them said that the job is stressful sometimes but when you resolve a case and help someone is a joy beyond money that last a lifetime I want to do that too :)",
      "author": null,
      "created": 1545149613,
      "upvotes": 2,
      "replies": {}
    },
    "ebnlppz": {
      "link": "/r/CollegeMajors/comments/a4odhz/to_anyone_thinking_of_changing_majors/ebnlppz/",
      "text": "[deleted]",
      "author": null,
      "created": 1544648371,
      "upvotes": 4,
      "replies": {
        "ebnltvd": {
          "link": "/r/CollegeMajors/comments/a4odhz/to_anyone_thinking_of_changing_majors/ebnltvd/",
          "text": "Try coding on Python using eithet codecamedy or following a YouTube video series by Corey Schafer. His videos are absolutely amazing.",
          "author": null,
          "created": 1544648457,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ebg9uno": {
      "link": "/r/CollegeMajors/comments/a4odhz/to_anyone_thinking_of_changing_majors/ebg9uno/",
      "text": "Ha ha, just \"going through the motions\" in your kinesiology classes...very good!",
      "author": "prairiedad",
      "created": 1544388564,
      "upvotes": 11,
      "replies": {
        "ebg9wuy": {
          "link": "/r/CollegeMajors/comments/a4odhz/to_anyone_thinking_of_changing_majors/ebg9wuy/",
          "text": "🙃 someone got the pun. finally",
          "author": null,
          "created": 1544388606,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634060243
}