{"sid": "fpkki1", "link": "/r/CollegeMajors/comments/fpkki1/marketing_vs_computer_science/", "title:": "Marketing vs. Computer Science?", "text": "Hi all, I'm currently in a dilemma.\n\nFor the past few days, I've been heavily considering changing my major from marketing to computer science. I'm a second-semester freshman, so I still have time, but not much. I want to graduate on time.\n\nI don't go to a well-known university so a marketing degree wouldn't be so valuable. I was planning on transferring to NYU Stern if I stuck with business, but 1) it's extremely selective 2) I would be in so much debt. I know internships are important and I do plan on interning over the summer and gain experience in the field throughout college because I am interested in it. With computer science, I've always wanted to learn how to code and have a hard, technical skill. I'm more interested in web development.\n\nThe thing is, I haven't had any experience or have much knowledge of either subject. I'm still doing gen eds. I haven't learned about analytics, strategy, or any of the actual stuff in business. I've never coded in my life. I'm horrible at math and I don't know if I'll be able to handle the math classes that will come with comp sci. I really don't know what to do. I am interested in both, but what if I'm not? I know a lot of college students go through that point where they don't know what to do but I want to get out of it and figure it out. I don't plan/want to go to grad school and if I do, then I'll think about it post-grad. I don't want to minor, because that means extra classes=more time when a minor won't mean much on my resume.\n\nMarketing pros: I can finish my degree on time/early, I want to learn more about marketing, I want to do marketing internships\n\nMarketing cons: I don't go to a good university for marketing so I will have to really rely on my internships to get a job, not downplaying marketing AT ALL but I want a harder skill\n\nComp sci pros: Fast-growing field, teaches a hard skill, doesn't really matter where I go for school\n\nComp sci cons: so much math, I will have to take extra classes just to get into the math I need, possibly have to load on classes/take an extra sem or year, I've never coded or even have the mindset for it- I don't logically think well\n\nMy desired plan is to go with compi sci and do marketing internships. From what I've read so far, it's easier to get into marketing w comp sci degree but not so much the other way around. But then again, it all depends. Whatever the outcome is from all of this, I know for sure I want to do at least one marketing internship at a record/social media company AND learn how to do programming.\n\nI'm a person who doesn't have one passion because I am literally interested in everything but I don't think that will serve me well. That's why I want to develop a hard skill because at least I will have something under my belt.\n\nI hope I don't sound close-minded about all of this. I just want insight to help me pick the best path for myself.", "author": "sunnymeadowlane43", "created": 1585259772, "retrieved": 1632956301, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"flumxpa": {"link": "/r/CollegeMajors/comments/fpkki1/marketing_vs_computer_science/flumxpa/", "text": "I think a good major for you is Information Systems (MIS/CIS) if your school offers it. It’s a mixture of business and CS/programming classes and doesn’t require too much math.", "author": "Unlikely-Text", "created": 1585505851, "upvotes": 2}}}