{"sid": "jrgh3w", "link": "/r/CollegeMajors/comments/jrgh3w/help_i_dont_know_what_major_to_choose/", "title:": "Help I don't know what major to choose", "text": "I'm stuck in life and I don't know what to major in. I you have being thinking about it for a year yet I can't choose on career that feels perfect or right and it's  really frustrating. I want to do some creative art degree or something with nature and culture or writing but I just can't decide. I have to start applying for colleges and it's stressing me out because nothing feels right. I have so many interests and things I would like to try out but never did like music and writing and editing. I don't want to choose major just because I'm interested in it because what if I don't like it after a while or what if I'm not good at it. At this point you'll probably say try out the things you are interested in but I don't have enough time for that and to be honest even when I had the time I didn't tried any of those things. Anyways, for most of my passions I don't really need to go to college like painting and video editing and writing, I could easily learn these skills online and it makes it even hard to choose a major. I like doing all the things and there is no one thing that I'm passionate about more comparing to the rest of them. So, as you can tell by now I'm super confused and I don't have anyone to talk to about this stuff. \n\nI have no idea what I should do so please help me I really need it.", "author": "artsy08lc", "created": 1604992185, "retrieved": 1632847139, "over_18": false, "upvotes": 10, "upvote_ratio": 0.87, "comments": {"gbubid5": {"link": "/r/CollegeMajors/comments/jrgh3w/help_i_dont_know_what_major_to_choose/gbubid5/", "text": "Okay first of all, relax. Breathe. You’ll be fine.\n\nYou don’t need to know what to major in as soon as you get to college. Seriously. Most people change 2-3 times by the time they’re in their junior year. Not to mention it’s hard to know what to major in before you’ve been in any of the classes. \n\nIf you’re interested in creative arts, look at a creative writing major or English. Do you want to teach? Would you rather write stories? Work in publishing/editing?\n\nIf you’re interested in nature, maybe look into environmental studies or environmental science. Would you prefer to do research? \n\nYou also mentioned video editing or painting. I know my school has a new media major and art degrees as well. Our Mass Communication department also focuses on video editing. Do you have any experience in video editing? \n\nThink about those questions and help them guide you in your search to find a major. A specific major isn’t as important as the experience you gain and the skills you refine for post-graduation plans. Of course, this depends on what kind of work you want to do as a career. If you’re going to be an engineer, obviously the major WILL matter. But for a lot of jobs, the skills you gain are what are most important. Especially skills that can be applied to many different jobs. \n\nDM me if you have any other questions!", "author": null, "created": 1605026559, "upvotes": 2}}}