{"sid": "auf7ko", "link": "/r/CollegeMajors/comments/auf7ko/tips_on_moving_out_during_college/", "title:": "tips on moving out during college", "text": "So this isn't related to a college major but what are some tips on trying to live on your own while in college? Any tips from people who have done it? How did you handle the finances, how much should I try and make to live decently, will I be able to juggle school and work? Thanks for any tips \n", "author": "swedishchef2012", "created": 1551057969, "retrieved": 1632958180, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"eh7s31w": {"link": "/r/CollegeMajors/comments/auf7ko/tips_on_moving_out_during_college/eh7s31w/", "text": "Scholarships are really big here. I managed to get enough to cover my apartment so I can’t give much advice apartments and such.\n\nMy big thing is food. Being able to feed yourself properly is a way bigger deal than some people would think. Actually cook and make stuff at home, and learn to make healthy good food or you’ll feel like death (coming from a guy who’s meal yesterday was a bag of 98 cent jelly beans and 4 blocks of ramen). My roommate orders two Pizza Hut pizzas Monday, and eats that with other food brought to him throughout the week by what I think is uber eats (he has $$$ to do whatever and drives a new car). \n\nSpeaking of cars, do to have one or plan on it? Getting something reliable that’s easy to fix yourself is always recommended. Or having a good bike (good as in good for point a to b). Bike wise trashy but functional is best since theft rates are high. \n\nIf you get roommates, please make sure you know them if possible. My first apartment was 3 guys who screamed all the time (in Chinese), left trash everywhere, left raw fish out making the apartment smell like a pet shop, and a naked man lived on my couch. My sister (twin by the way, and we live in the same complex), moved in with two people she knew from high school-community college and all is pretty well, but the one girl they didn’t know (who was kicked out of her last apartment in this same complex) is who’s caused all the problems, her adorable but insane cats as well. Also don’t live on campus. Prices are way higher and it’s always a catch-22. \n\nAs for working and school, depends on your major. You can do it with any major but some struggle more than others. I dumpster dive , repair vintage electronics, and was taught by watchmakers growing up so I get by, but if you do normal fast food/retail it really just depends. A buddy of mine (mechanical engineering major) had a breakdown after a week working at a local restaurant and quit. I also know a girl (psychology major) who works 12 hour shifts at some sort of factory and another who works at Walmart.\n\nSorry if this is a bit much or rambling. On the local level I try to give a lot of advice after going through hell first and second semester.\n\nOh also if your state (if you’re in the US) offers a free two years at a community college TAKE IT. I know people who went straight to university, lost their money, and are really regretting the extra two years of debt. \n\nAnyways good luck! ", "author": "Angros-offical", "created": 1551058969, "upvotes": 2}}}