{"sid": "pgauyw", "link": "/r/CollegeMajors/comments/pgauyw/i_need_help_deciding_on_a_career_to_pick_my_major/", "title:": "I need help deciding on a career to pick my major for :(", "text": "I have been thinking about different subjects in which I want to study. I'm a fan of math and science, I basically hate reading though. \n\nI have had three ideas, a financial planner, a relationship counselor, and an exotic animal veterinarian. \n\nFinancial planner- I've always been really good with handling money and budgeting, especially for other people. The only problem is that when doing research I found that this is a very difficult career to get into. Very few are successful and even then a small percentage make the really good money doing it. \n\nRelationship counselor- More of a whim like career choice. My friend and her boyfriend had been having issues for a while and kinda made me the middle man. They both actually said they appreciated having me there to help mediate things so I was like \"dang I should be a relationship counselor\". Totally not disregarding this idea but definitely not super serious about it. \n\nVeterinarian- I love dearly my dwarf hamsters and was considering becoming a vet because of this. Around me there are barely and exotic animal veterinarians, so trying to get any type of help for them is borderline impossible. My last dwarf hamster lived for 3 and a half years. For about a year and a half he had a cyst thing on his side that no one was able to help me with, so I just cleaned it with some diluted peroxide on a qtip. I can only hope I did everything I could for him :( In my research I found that it would be about 12 years of school for an exotic animal vet (sheeeesh) and that it would be super expensive. \n\n\nUltimately I would have the most passion and drive for something that was able to directly help my dwarf hamsters. I know asking strangers isn't very smart most likely but I guess I was wondering if anyone had any insight as to alternatives or support for what I've mentioned. Thank you for reading.", "author": "Dethrowawaytion", "created": 1630557690, "retrieved": 1632957537, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"hbeh5c2": {"link": "/r/CollegeMajors/comments/pgauyw/i_need_help_deciding_on_a_career_to_pick_my_major/hbeh5c2/", "text": "I would recommend doing something in finance/accounting, maybe not precisely a financial planner, but something in that field. You're right, the relationship counselor thing seems like you came to that on a whim, veterinary school is competitive, long, and you have to deal with sick and dead animals a lot, not sure if that's something you would find appealing. There are a lot of careers in finance and accounting, and these often pay well with a four year degree. Just my thoughts.", "author": "postmaloneismediocre", "created": 1630638828, "upvotes": 2}}}