{"sid": "a6m804", "link": "/r/CollegeMajors/comments/a6m804/i_am_aware_im_in_rcollegemajors_but_how_important/", "title:": "I am aware I'm in r/CollegeMajors but, how important is a Minor?", "text": "Like a lot of people, I am majoring in Computer Science. I also have a thing for Math & Finance/Economics, and I've been thinking about getting a Minor in Math or Economics. I know the Minor is usually great to complement your Major but I'm wondering how valuable it is by itself. Say, for example, that I major in History and Minor in computer science. When I'm out of college, will my Minor be of any use all by itself? Those are completely unrelated fields and none of them will complement each other. \n\nI ask because Math and Economics are right below computer science if I were to rank them. I would like to Major in what I like and Minor in something I like but that would also give value to my Major. If it's not as important, then I might do the minor in Economics. If a minor is very important, then I'll Minor in Math.\n", "author": "_Jerov_", "created": 1544934536, "retrieved": 1632957402, "over_18": false, "upvotes": 5, "upvote_ratio": 0.86, "comments": {"ebwrh4i": {"link": "/r/CollegeMajors/comments/a6m804/i_am_aware_im_in_rcollegemajors_but_how_important/ebwrh4i/", "text": "I know a lot of people at out university who are CS/CE majors minor in Math because it is only one extra math course you need to take. It can be a really nice complement to your major especially if you ever decide to teach. Because figure each minor is generally between 18-21 credit hours in that subject. If you have at least 18 credit hours in a single subject, most states will allow you to earn a teaching license in that subject. Math is a highly in demand field for all grade levels. Even if that isn't your primary goal, it gives you a rather safe back up plan or even an opportunity to switch careers later in life. \n\nChoosing your minor is the important part, you want those minors that complement your major. I am a history major and a math major really wouldn't aid me much. That is why I have two minors in American Studies and Religious Studies.", "author": "jupchurch97", "created": 1544969572, "upvotes": 2}, "ebw87ow": {"link": "/r/CollegeMajors/comments/a6m804/i_am_aware_im_in_rcollegemajors_but_how_important/ebw87ow/", "text": "As you said, a minor can be a nice complement to related majors. However, it isn't too valuable by itself. It could demonstrate that you have an interest in or are somewhat knowledgeable in the subject area, but it won't be able to professionally exhibit a proficiency, mastery, or expertise thereof, if that's what you're looking for. As a general rule, most employers won't place heavy consideration on your minor, since they'll care significantly more about what you majored in.\n\nI hope that helped!", "author": "EggcellentName", "created": 1544940137, "upvotes": 3}, "ebw3d9o": {"link": "/r/CollegeMajors/comments/a6m804/i_am_aware_im_in_rcollegemajors_but_how_important/ebw3d9o/", "text": "Just wanted to add that college minor discussion is totally allowed here as well! I should add that to the sidebar.\n\nYou're in the right place!", "author": "clashFury", "created": 1544934767, "upvotes": 2}}}