{
  "sid": "lz84ab",
  "link": "/r/CollegeMajors/comments/lz84ab/any_advice_about_journalism/",
  "title:": "Any advice about journalism?",
  "text": "TL;DR: Might like journalism, but freaked out by movie; would rather write stories for TV/radio than the newspaper, believe I need to major in broadcast journalism; not many schools offer this major\n\nFor background I am currently a HS junior (I know I have a lot of time to figure this out, but hear me out). I'm good at writing, I don't get bored when the news comes on, I'm good with deadlines, and I like to stay updated with current events, so I thought a major in journalism might be a good idea (I'm more interested in TV/radio broadcasting vs a newspaper so I believe that falls under broadcast journalism?). However, a few weeks ago I watched the movie All the President's Men, and if you've seen the movie you'll see where I'm coming from. I know I'm not supposed to take career inspiration from TV but is journalism really THAT stressful? Is it really going to look like that on an everyday basis or is the job just waaaay overdramatized for the movie? There is no way I could deal with that much stress on an everyday basis.\n\nIn addition to that does anyone have any other advice about journalism? Any experience with a broadcast journalism major? Can you get a job with ABC news with a journalism major instead of a broadcast journalism major? There is a VERY limited number of schools with broadcast journalism majors, and none of which I would otherwise want to apply to. I think more schools (and more recognizable schools) might just have journalism programs instead (this is part of why I'm trying to figure this out now; if I'm going to major in broadcast journalism I have to choose my college/university very carefully to make sure they have it).\n\nAny advice would greatly be appreciated! I'm ok with PM too if you'd rather talk there. Also sorry for the length",
  "author": "siameserose",
  "created": 1615056205,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "gq1v8bd": {
      "link": "/r/CollegeMajors/comments/lz84ab/any_advice_about_journalism/gq1v8bd/",
      "text": "Journalism programs these days have classes dedicated towards tv/broadcast writing not just for newspaper writing. Nevertheless the skills needed for regular journalism are applicable towards broadcast journalism as well.",
      "author": "kwuhoo239",
      "created": 1615079664,
      "upvotes": 1,
      "replies": {
        "gq4cjl0": {
          "link": "/r/CollegeMajors/comments/lz84ab/any_advice_about_journalism/gq4cjl0/",
          "text": "This actually helped a lot more than you might think, thank you!",
          "author": "siameserose",
          "created": 1615141413,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634060542
}