{"sid": "psx52w", "link": "/r/CollegeMajors/comments/psx52w/software_engineering_vs_computer_science/", "title:": "Software engineering vs computer science", "text": "Which one is easier and involves less math", "author": "Alarming_Research720", "created": 1632274762, "retrieved": 1632956997, "over_18": false, "upvotes": 5, "upvote_ratio": 0.86, "comments": {"hdt485r": {"link": "/r/CollegeMajors/comments/psx52w/software_engineering_vs_computer_science/hdt485r/", "text": "Software engineering is generally more focused on the \"programming\" of computer science, and your courses will probably revolve around the specific technologies and practices typically used by software engineers, so for example you may learn more about web development, testing, take more classes on specific languages such as javascript and java, etc. A computer science major, on the other hand, will generally be more theoretical and academic. So you could learn about computer vision, artificial intelligence, advanced algorithms, CS theory, etc. Since computer science is a field of applied math, whereas software engineering is more of a specific job title, the computer science major will likely require more math. However, I'm guessing you will be required to take math classes for a software engineering degree as well.\n\nOverall, a lot of it depends on the specific curriculum, and this is hard to answer without looking at what a particular school has to offer. Speaking in generalities, I will say that a software engineering degree (IMO) would involve less math than a CS degree, and might be a bit easier. However, I would balance this by saying that computer science is a tried and tested degree, and more people will probably respect and recognize it as opposed to a software engineering degree. The strong theoretical foundations you learn in a CS degree are timeless as well, where as if you learn the language of the month and specific framework from a software engineering degree, I don't know if the knowledge will be as applicable in say 10 or 20 years. I would personally recommend getting the CS degree, unless you are really poor at math. Just my 2 cents.", "author": "postmaloneismediocre", "created": 1632285244, "upvotes": 7}, "hdsnk57": {"link": "/r/CollegeMajors/comments/psx52w/software_engineering_vs_computer_science/hdsnk57/", "text": "I have the same doubt!", "author": "thelewdfolderisvazio", "created": 1632276168, "upvotes": 1}}}