{
  "sid": "gkpiwl",
  "link": "/r/CollegeMajors/comments/gkpiwl/physics_vs_chemistry/",
  "title:": "Physics vs Chemistry",
  "text": "To put it simply, I like chemistry as a subject but I don’t like chemistry-related jobs. I don’t 100% like physics as a subject, but all of my dream jobs are physics based. \n\nI was admitted to college as a physics major, but it felt wrong so I switched to chemistry. But now, I feel the same feeling of regret towards chemistry. I haven’t started college yet. I don’t know what to do.",
  "author": "Leafu_Zenshi",
  "created": 1589608052,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "fqtni96": {
      "link": "/r/CollegeMajors/comments/gkpiwl/physics_vs_chemistry/fqtni96/",
      "text": "I am currently in a similar situation. Haven’t started uni yet but I had to choose between the two majors. I like both equally as a subject and as a job, I am a little better in chemistry than physics when it came to grades. I first thought to myself what do I want to study in physics for the rest of my life? My answer was particle and nuclear physics. Then I searched around and found out that I could take the chemistry program and after graduating with a masters I could apply for a PhD position in nuclear chemistry. Which is quite similar to nuclear physics which is something I wanted. I could just went and took physics but my grades in mechanics would affect my ability to obtain my degree with a high GPA. So it all depends of what you want to study and research later in life. Is it something pure physics then go with physics but if it is something that is in between where both overlap then go with the one you feel more comfortable with and can obtain a higher GPA with. Hope I helped.",
      "author": "mar7_photographer",
      "created": 1589642422,
      "upvotes": 1,
      "replies": {}
    },
    "fqt7l18": {
      "link": "/r/CollegeMajors/comments/gkpiwl/physics_vs_chemistry/fqt7l18/",
      "text": "A lot of chemistry is based on physics. I like to say that chemistry is basically applied physics.\n\nThe best way would be to attend a class in both these subjects.",
      "author": "vishthefish05",
      "created": 1589632374,
      "upvotes": 1,
      "replies": {}
    },
    "fqsl68g": {
      "link": "/r/CollegeMajors/comments/gkpiwl/physics_vs_chemistry/fqsl68g/",
      "text": "[deleted]",
      "author": null,
      "created": 1589610437,
      "upvotes": 2,
      "replies": {
        "fqslk1g": {
          "link": "/r/CollegeMajors/comments/gkpiwl/physics_vs_chemistry/fqslk1g/",
          "text": "Aww thanks for the response. That is a good idea. I guess I should get some exposure to college level physics and chemistry. After all, I can’t make an educated decision based on the insignificant amount of chemistry and physics I’ve learned in high school. \n\nI had a shitty physics teacher and maybe that is why I have a weak attitude towards it. But I will give it the benefit of the doubt and take introductory physics courses like you suggested. Who knows, maybe I’ll love it.",
          "author": "Leafu_Zenshi",
          "created": 1589610766,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634060939
}