{"sid": "obcg37", "link": "/r/CollegeMajors/comments/obcg37/what_should_i_major_in/", "title:": "What should I major in?", "text": "I am a senior in high school looking to get a bachelors. I have a interest in agriculture and natural science, as well as finance and business. I love working with my hands and being in the outdoors. I am very into health and nutrition as well as observing the culture and design of family owned restaurants. What are some potential career paths and majors that I should look into?", "author": "osad22", "created": 1625107217, "retrieved": 1632956773, "over_18": false, "upvotes": 8, "upvote_ratio": 0.91, "comments": {"h3pz83a": {"link": "/r/CollegeMajors/comments/obcg37/what_should_i_major_in/h3pz83a/", "text": "Maybe major in business  or econ and minor in agriculture/natural science", "author": "tha_oz", "created": 1625169598, "upvotes": 1}, "h3prqbj": {"link": "/r/CollegeMajors/comments/obcg37/what_should_i_major_in/h3prqbj/", "text": "Have you thought about double majoring or taking on a minor? In your case, it’s well worth it. \n\nPerhaps a major in horticulture and a minor or double major in business management might be the way to go.", "author": "Earlgreyandbooks", "created": 1625166349, "upvotes": 1}, "h3pidhs": {"link": "/r/CollegeMajors/comments/obcg37/what_should_i_major_in/h3pidhs/", "text": "Ag business.\n\n Become a crop insurance adjuster, or other ag insurance person. Farm loan person. Manager of some forestry or agricultural enterprise.\n\nO ya. Iowa State, ag business major, minor in agronomy &/or animal science. Ag studies/agronomy with a business minor. Great agricultural school. Agronomy has a full 18 free elective credits so it basically tells you to get a minor. \n\n[This](https://catalog.iastate.edu/planofstudy/) will help a lot if you don't know what exactly each major does. They don't have environmental engineering listed but it is a new major at Iowa State. We're top in ag engineering if you decide to try out engineering. \n\nI'd also look into careers you're interested in. Try being a farm hand, working in a garden center, shadowing a loan officer, etc to try & see what you like/don't like. The BLS website has some basic information as well.\n\n& I'm personally an ag engineering major, so that's what I know about. ISU & U of I offer offer majors such as dietetics if you want to become an official dietician.", "author": "Gamerz1818", "created": 1625162318, "upvotes": 2}}}