{"sid": "iekgf2", "link": "/r/CollegeMajors/comments/iekgf2/mis_or_cs/", "title:": "MIS or CS?", "text": "I think that I would like to be part of a software developer team, but I also like managing people, so that's why I thought that I would take MIS major. However, will it be a disadvantage for me to get a job in that sector if I got a MIS instead of CS degree? Since CS seems to have much more programming courses while MIS have more business related course", "author": "i-came-here-to-fap", "created": 1598110283, "retrieved": 1632847584, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"g39hldg": {"link": "/r/CollegeMajors/comments/iekgf2/mis_or_cs/g39hldg/", "text": "CS. More versatile and more well known.", "author": "BetUrProcrastinating", "created": 1598723580, "upvotes": 1}, "g2q0p2q": {"link": "/r/CollegeMajors/comments/iekgf2/mis_or_cs/g2q0p2q/", "text": "If you want to program, do CS. From there, you can move on to being a product manager or other managerial roles. If you do want to become a manager, adding on a MBA would be a good idea. In general, a CS degree gives you flexibility in what you want to do.\n\nA MIS major prepares you well for roles such as a business analyst, data analyst, or consultant. Depending on the path you take, you can also go into IT, software engineering, or become a product manager or scrum master, but it all depends on what you do in college.\n\nBoth degrees are excellent and can land you well-paying jobs, and you can get similar roles with either degree, but like said, a CS major allows you to do things MIS majors can, while the opposite is not true. That is not to say that a MIS major is inferior, but it's just that it's not meant to lead to the same careers as CS majors, hence why they are separate.", "author": "SnooSeagulls4617", "created": 1598296932, "upvotes": 1}, "g2i0dw2": {"link": "/r/CollegeMajors/comments/iekgf2/mis_or_cs/g2i0dw2/", "text": "Go CS and maybe an MBA if you want to work upper level management", "author": "editedbylp", "created": 1598120575, "upvotes": 1}, "g2ht8hg": {"link": "/r/CollegeMajors/comments/iekgf2/mis_or_cs/g2ht8hg/", "text": "CS is more employable and demonstrates more hardlined skills with coding whereas MIS is more soft skills and typically is less desired\n\nI would recommend the CS major as a safer alternative", "author": "Reav101", "created": 1598117394, "upvotes": 1}, "g2hpydg": {"link": "/r/CollegeMajors/comments/iekgf2/mis_or_cs/g2hpydg/", "text": "If you want to be a pm then MIS seems  good for you", "author": "tha_oz", "created": 1598115959, "upvotes": 1}}}