{
  "sid": "abavnm",
  "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/",
  "title:": "The Majors Megathread: Helpful information regarding the various majors of our community",
  "text": "Hello everyone from the staff of r/CollegeMajors! In this megathread, we'd like to discuss your major, and all that entails it. We hope that this can be a \"database\" for helping people that are unsure about their major and would like to see someone else's experiences in it, or for people who have not decided a major and would simply like to shop around! We ask that if if you come across this thread, please share and discuss your major, no matter how old this thread is or if it's a duplicate, and feel free to ask questions about someone's major! \n\n*When posting about your major:* \n\n***Please do:***\n\n* Discuss what your major is and what it is about\n* Discuss why you chose your major\n* Discuss your experiences in the major\n* Discuss general advice regarding it \n\n***Please do not:***\n\n* Attack someone's choice of major\n\n&#x200B;",
  "author": "The_Max_Rebo",
  "created": 1546287887,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "ed1dak8": {
      "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed1dak8/",
      "text": "**Bachelor's of Science in Supply Chain Management (SCM), also pursuing Pre-Med**\n\nNow before I get the first question people ask me: \"why are you majoring in business instead of a science if you want to go to med school\", it is because I love business and would not mind pursuing that as a career path. You only need to complete the pre-requisites to apply to med school as well as having a Bachelor's, not a Bachelor's of Bio and whatnot. Not everyone gets into medical school despite their best efforts. What would I do with a Bachelor's in Bio? Personally I wouldn't want to work in that science capacity and would likely need to get a Master's or PhD in order to become a professor which is more appealing than being a biologist or anything else of that sort. So I am majoring in business so I have a solid backup plan. In fact I just saw a post in r/premed about a applicant saying he just finished his 3rd application cycle to med school, is giving up, and doesn't know what to do with his Bachelor's in Biology. *I am in no way condoning majoring in Biology, this is just how I personally feel about how majoring in Bio would not benefit me*\n\n&#x200B;\n\nI chose SCM because of it is a new and upcoming industry that is rapidly evolving. This is basically logistics, in terms of purchasing (negotiating purchase prices of products from other companies), procurement (getting product), distribution (how products get shipped and moved between places). Many companies are focusing more on this aspect of their business to become more cost-efficient, and to drive productivity. This is just something that interests me and my university has an average student graduating with about 4 job offers averaging $60k/year starting salary post-graduation. I am involved in the SCM Association and help facilitate career fairs so I am having a great time!\n\n&#x200B;\n\nIn regards to medical school, I want to be a doctor but after my career as a doctor, I want to become a CEO of a hospital or sit on a hospital Board of Directors (BOD). I believe that there is a strong discrepancy in the business of healthcare. Yes, healthcare is a business, but we have MBA's running hospitals without regards to providing quality patient care. There needs to be a balance of making money and serving your community. While I believe MBA's shouldn't be running hospitals, neither should doctors as most don't have a business background. This is why I want to pursue this unique career path. Having a background in business and having been a doctor myself, I will better understand how to better serve patients across the hospital by acknowledging both patient care as well as making sure the hospital doesn't go out of business.\n\n&#x200B;\n\nFeel free to ask me questions about anything, PM or comment reply!",
      "author": "Harry0706",
      "created": 1546378759,
      "upvotes": 3,
      "replies": {
        "ed1i0r7": {
          "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed1i0r7/",
          "text": "[deleted]",
          "author": null,
          "created": 1546382565,
          "upvotes": 2,
          "replies": {
            "ed1j2b1": {
              "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed1j2b1/",
              "text": "Yes, so my major requires I do general studies electives so all my pre-reqs for med school like BIO CHM PHY BCH, will be covering those credits for my degree. In terms of the MCAT, yes the pre-reqs that most med schools require do in fact prepare you for the MCAT, from what I hear psych and sociology are very lightly touched on, but not emphasized as heavily as other subjects like bio and chem. In terms of the pre-reqs themselves each school has slight variations, a few requiring stats, some requiring advanced English composition, a few require 2 instead of 1 semester of calculus. Generally pre-meds continue to study material learned in courses even after those courses are finished in order to stay fresh for the MCAT, or wait to revisit topics till 3-6 months before they scheduled their MCAT and start mass studying all subjects.",
              "author": "Harry0706",
              "created": 1546383428,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ed06wvn": {
      "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed06wvn/",
      "text": "[deleted]",
      "author": null,
      "created": 1546336767,
      "upvotes": 6,
      "replies": {
        "ed1kgj8": {
          "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed1kgj8/",
          "text": ">Also, please for the love of god submit all of your assignments using LaTeX.\n\nHaha, this is an excellent piece of advice. Learning LaTeX is super easy and it's really useful, both for math and physics. I'd also like to say that programming is an invaluable tool, and learning Mathematica, Python, and Matlab is strongly recommended.",
          "author": "bitchassshortie",
          "created": 1546384577,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ecz5637": {
      "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ecz5637/",
      "text": ">Discuss what your major is and what it is about\n\nI'm a physics and pure mathematics double major. My physics degree \"concentration\" is \"preparation for graduate school,\" as I plan on pursuing a Ph.D. in theoretical particle physics.    I'm currently a sophomore.\n\n>Discuss why you chose your major\n\nI'll start with physics first. I took a physics course during my last semester of high school, and by the third week of class, I knew that I wanted to pursue physics for the rest of my career. I suppose this isn't helpful for students who don't know what they would like to major in, because I quite literally just *knew* that physics was what I wanted to do with my life. I can't imagine doing anything else. It's the first thing I think of when I wake up in the morning, and it's the last thing I think about before I go to sleep. I don't want to work in industry, and I really want to do theoretical physics, so.....graduate school, here I come!\n\nNow I'll talk about math. I never put effort into math classes during middle school and high school, which meant that I thought I was terrible at math. I was really nervous about taking calc I, but to my surprise, I LOVED it. That love/passion for math continued with each course I took, so naturally, I decided to double major in it. I will say that a math minor was already included with the physics major (as my school requires calc I-III, linear algebra, and ordinary differential equations \\[and also \"strongly recommends\" linear algebra II, partial differential equations, and calc-based stats\\] for the physics major). I chose the pure math track over the applied math track, because a lot of the math courses that I want to take are pure math based (such as abstract algebra, chaos and fractals, etc.). I might switch to the applied math track once I take those higher level pure math courses; the applied math track is a bit easier to complete, and requires fewer classes.\n\n>Discuss your experiences in the major\n\nI go to a smaller university, which means that I have the opportunity to be assertive with professors in terms of research. I started doing physics research during my freshman year, did an REU the summer after my freshman year (in biophysics/soft matter physics), and published a paper in my university's journal of undergrad research last semester. I hated the research I did as part of the REU, and realized that I do NOT want to pursue biophysics or soft matter physics at all. This was an important realization, and I think that figuring out what I *don't* want to pursue was as important as figuring out what I *do* want to pursue. I did more research last semester (mostly in astronomy), and have a couple of research projects lined up for next semester. I'm probably going to focus on math research next semester, because I'm a lot more interested in the math research going on at my university. The math dept. is substantially larger than the physics dept., which means there's a wider selection of research to participate in.\n\nNow I'll talk about how I know that I want to do theoretical particle physics. The primary subfield of physics that I've been interested in since the beginning is particle physics. I've always felt very drawn to particle physics, but I still experimented with other subfields that interested me at the time. After experiencing some research in astrophysics and biophysics, I can finally say that particle physics is definitely what I want to do. I'm completely intrigued by particle physics, and spend a lot of time reading research papers. I just really love particle physics. It's kind of hard to explain in writing, so I'm sorry if this isn't helpful!\n\nI don't have much general advice, because everyone is different and tends to ask different questions. Don't hesitate to leave a comment if you have any questions. :)",
      "author": "bitchassshortie",
      "created": 1546296033,
      "upvotes": 6,
      "replies": {
        "ed09bsd": {
          "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed09bsd/",
          "text": "[deleted]",
          "author": null,
          "created": 1546339931,
          "upvotes": 3,
          "replies": {
            "ed0r00j": {
              "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed0r00j/",
              "text": "Thank you! \n\nI have two projects lined up. One of them deals with celestial mechanics (from a math POV), where a lot of extensive work has been done with the three body problem. I can't give you a more definite answer because the professor and I haven't discussed exactly what I'll be doing, so I'm not sure yet. \n\nThe other project I'll be working on is dealing with graph theory. My professor does a lot of work with the independence polynomial, but I won't know the exact research project I'll be doing until the first week of the semester. He sent me six articles to read during break. I can post one of them here if you're interested in reading about it. Sorry that my answers aren't very in-depth!\n\nI don't think I'll end up doing both projects at the same time. I'm also doing an independent study in theoretical particle physics, so I probably don't have the time to do two different research projects anyway. ",
              "author": "bitchassshortie",
              "created": 1546363050,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ecyzvif": {
      "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ecyzvif/",
      "text": "**Major: B.A. in Anthropology, focus in Archaeology**\n\n*What is Anthropology?*\n\nI think anthropology can easily be summed up as the study of the human experience. In US Anthropology, you have the accepted four sub-fields: Cultural Anthropology, Linguistic Anthropology, Physical/Biological Anthropology, and Archaeology. Each section focuses on a different aspect of humans and their relatives, be it the cultures that they live in, their methods of communication, their physical traits and abilities, or simply their daily daily lives. Despite these four boundaries, I'd argue that each of the sub-fields requires the other three for their existence and success, hence why they are all a smaller piece of the whole of anthropology. There are two types of schools that teach Anthropology: Four Field (You take classes in all four sub-fields as your core classes) and Two Field (You take classes in two of the sub-fields as your core classes, usually split between Cultural/Linguistic and Archaeology/Physical). My college is a four field, so I've taken classes in all four sections. My focus is on Archaeology, which is the study of a culture from the tools left behind by that culture. Of course, archaeology can be split into about a thousand sub-fields, but the easiest divide is between Prehistoric Archaeology and Historic Archaeology. Although they use similar methodologies, they both have different paradigms that they usually attest to.\n\n*Why did I choose Anthropology?*\n\nIt was not an easy decision, but it came from having interests in biology, geology, and history. Every time I focused on one, I felt that I would be missing opportunities in the other, and I would incessantly swap between them, and I never really could settle down. Then, I learned about the field of anthropology, specifically archaeology. From my understanding, the field seemed to be the the exact mid ground between my three interests. Despite this, I still went in incredibly unsure as to if this was the right path for me. However, I made sure to sign up for a technical field school for archaeology, because I figured that the only way to know for sure was to actually go out and do it for a semester. Over the semester, I stood out in the hot Arizona sun for days at a time doing tedious tasks such as hammering nails into the ground and calculating true distances with tape measures. I remember sitting in front of an exposed soil wall, carefully mapping out the stratigraphy as the 115 degree heat reflected off directly into my face, causing my tinnitus to go into overdrive. When the heat finally went away, incessant winter rain storms froze me as I dug ditches into the ground finding nothing but dirt and mud. On the last day, the worst storm I've stood in came, and blessed us with ice cold rain as we filled in our units that we so carefully dug over the course of the semester. I still remember being able to see my breath, and losing feeling in my digits. Despite this, I loved every second of it.\n\n*Experiences/ General Advice*\n\nThe one thing you can be sure of is that there will be a lot of papers and reading. My best advice to that is to just simply start on everything as early as you can so you can display your best work. Now, working in the field of anthropology usually requires a graduate degree, but the sub-field of archaeology is unique in the fact that you can be a private archaeologist (Cultural Resource Management) with just a BA or BS. Now, your opportunities are limited in how much you'll make and what positions you can get, but it's a good spot to be in before graduate school. I believe 90% of all archaeologists work in CRM, so you can bet that if you do archaeology, you'll work in CRM at some point. If you want to be eligible for CRM, be sure to do at least one field school to show you the ropes while you're getting your BA or BS, and learn your basic artifacts. Don't wait until senior year to do this, get it done as fast as possible so you can take advantage of internships and volunteer opportunities in CRM/ Academic Archaeology, and to see if you actually enjoy the field! Along with that, try to volunteer in a museum that deals with archaeology to understand the other side of the field, and why it's important to keep good notes. ***The most important part of archaeology is the not what you find, but what you find out!***",
      "author": "The_Max_Rebo",
      "created": 1546292170,
      "upvotes": 6,
      "replies": {
        "ed08zki": {
          "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed08zki/",
          "text": "[deleted]",
          "author": null,
          "created": 1546339500,
          "upvotes": 2,
          "replies": {
            "ed1foi5": {
              "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed1foi5/",
              "text": "Good question!\n\nYes there are quite a few distinguishing points that divide up the four sub-fields, but there are also just as many points that merge them together. So, a good thing to keep in mind is that even if you choose a specific sub-section, you likely won't ignore the methods and research of the other three fields. Anthropology is also notable for it's use of fieldwork, so my focus will regard just that.\n\n***Cultural Anthropology***\n\nThis sub-field focuses on contemporary cultures, and how they interact with the society and people within them, and around them. This area of focus is not too distant from sociology, apart from the focus on the culture rather than the society itself. Despite this faux distinction, social anthropology is a sub-section of cultural anthropology, and the lines are really blurry as to where the anthropology ends and the sociology begins. In fact, many cultural anthropologists I know had trouble deciding if they wanted to pursue sociology or anthropology! Fieldwork relies on interviews and participant observation, which is where you actively participate in the culture you're studying. Fieldwork can take you from the heart of Africa, the villages of Eastern Europe, or even the offices of a Fortune 500 company (Either studying them, or working for them).\n\n***Linguistic Anthropology***\n\nThis sub-field focuses on how language affects the social life of those who partake in it. This sub-field is also not too far from sociology, and many of the discussions I had in the class almost mirrored the ones from sociology. Again, the \"accepted\" division is the culture vs society argument, but it's hard to distinguish sometimes, especially in Socio-linguistics. Field work can range from going out to Native American Tribes whose languages are about to go extinct and trying to preserve it via recordings, studying the prose and syntax of the so-called \"Valley Girl,\" to even deciphering written language, be it a coded message of a murderer or the written language of the Minoans.\n\n***Biological/ Physical Anthropology***\n\nThis sub-field focuses on the biology and behavior of humans, their relatives, and their ancestors. This is a very science heavy field, and as such requires considerable amounts of knowledge in Organic Chemistry and Biology. A popular sub-section is palaeoanthropology, which study's the fossil remains of human ancestors, also known as hominids. Primatology is also popular for many who focus in this area. Fieldwork can range from observing the behavioral patterns of Chimpanzees and Bonobos, working in a coroners office and determining the identity of skeletal remains, to studying human remains on an archaeological dig.\n\n***Archaeology (New World Only, Usually)***\n\nThis sub-field focuses on studying past cultures from the material evidence that they left behind. As fancy as that sounds, most of it is just trash that the culture discarded. This is another science heavy field, and it's important to have a good knowledge of biology, chemistry, geology, and sometimes physics depending on what you're doing! Archaeology is very multidisciplinary at it's core, and it makes use of any science field it deems relevant. Although there's the heavy emphasis on science, you also can't ignore the more social aspects of past humans. Fieldwork can be anything from observing the construction of a building on federal land, hiking around large vasts of lands looking for indications of human activity, to the stereotypical digging of a site (which is always very fun!).",
              "author": "The_Max_Rebo",
              "created": 1546380629,
              "upvotes": 2,
              "replies": {
                "egl99aw": {
                  "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/egl99aw/",
                  "text": "Anthro major here. I’m finishing up my junior year right now and looking into internships. I’m interested in the museum side of things and I’m also curious about forensic anthro. Do you have any recommendations on where to look for internships in the forensic field?",
                  "author": "MrFuntFuntingAround",
                  "created": 1550310851,
                  "upvotes": 1,
                  "replies": {
                    "eglrzt8": {
                      "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/eglrzt8/",
                      "text": "Oh man, that’s a fun subsection of Physical! While I don’t know specifically where to find them, I know that many of my peers interested in Forensic Anthropology usually do their internships for our State Museum’s Bioarchaeology Lab or for the County Coroner. Obviously, only the latter is close to Forensic Anthropology, but I think you should be alright with any internship that has you handling and studying actual human bones. Just be aware that the bodies at the coroner are a little “fresher” than some care for, but they do employ Forensic Anthropologists and a few of my professors did just that. \n\nI’d start your search with those two, but I’d highly suggest asking your professors that have experience in Forensic Anthropology about the best areas to intern in. I honestly know quite little about interning as an FA, as I focus on Archaeology, so I’d take my advice with a grain of salt. However, I can likely get in touch with a professor that has a Masters in Forensic Anthropology, as I’m sure she has some good recommendations. ",
                      "author": "The_Max_Rebo",
                      "created": 1550335051,
                      "upvotes": 2,
                      "replies": {
                        "egqi93a": {
                          "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/egqi93a/",
                          "text": "Yeah, unfortunately my school tends to focus on the cultural and archaeological fields. Granted, the professors are amazing and the program is definitely preparing me to do research and field work, so I’m glad I’m pursuing this degree. Forensic anthro seems really interesting to me though. There is an upper division Forensic Anthropology elective that I plan on taking next semester so I guess that will answer any other questions I might have. Thank you for this information! ",
                          "author": "MrFuntFuntingAround",
                          "created": 1550506532,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ecyy228": {
      "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ecyy228/",
      "text": "Well hey, I suppose I'll come along and get us started (though since I write long responses, I wouldn't be surprised if someone else responds by the time I finish writing this). I guess I'll edit in now too all the degrees/programs in which I've studied so people know what this long response will entail:\n\n- **Social Service Worker (SSW) Diploma [community college].**\n\n- **Bachelor of Arts (BA) in History.**\n\n- **Master of Arts (MA) in History.**\n\n- **Doctor of Philosophy (PhD) in Human Studies.**\n\n-\nMy BA was in history. I didn't actually *major* in history, I specialized in it, which involves doing less electives and more courses in the subject of history (and my school requires you to minor if you major, but not if you specialize). I chose to study history because it was my passion - it *is* my passion - and I did not want to waste my time in university studying something I did not enjoy. I did end up in community college first, though, because I did poorly in high school due to issues with my mental health, and could not get into university.\n\nI studied social work in community college because community colleges here only allow you to do professional \"in demand\" programs, so I couldn't study history there -- but I did so poorly in high school that I did need to go to community college before university, so I picked the most social science-oriented program, and studied in that. So, aside from my BA and MA, I also have what is here called an \"SSW Diploma.\" Social work, I can say basically, involves a lot of sociology, psychology, law, and then hands-on placements.\n\nA BA in history is *not* a degree that demonstrates that you know history, which is a common misconception -- people are always asking me about different periods of history that I never studied, and getting confused when I tell them I don't know anything. No, a BA in history teaches you *how to be a historian*, focusing on three major skills: critical thinking, data analysis, and communication. This is in part why many history graduates do end up in business, marketing, or government jobs.\n\nIn terms of communication, a history degree demonstrates that you know how to write, because while many academics do give presentations, historians more often than not publish articles and books about their research. People think that you have to get an English degree to demonstrate that you know how to write, but many BA degrees demonstrate that, because subjects like history, philosophy, etc. involve mostly reading and writing. If you want to write or learn to write, pursue a BA, but choose your program, subject, major, specialization, etc. based on the *type* of writing you want to do (and the skills you want to obtain).\n \nHowever, a BA in history is not specialized enough to get a job in most *history* fields -- you can end up in non-history jobs that value the skills that you obtain throughout a history degree (the three I mentioned above), but if you want to work in some sort of history-related position, you generally need to attend graduate school. I did go onto an MA in history directly after finishing my BA, but it wasn't because I *needed* it, it was because I *wanted* it. I wanted to continue my education in history because, again, it's my passion -- but I was perfectly aware that I was unlikely to find work involving my passion without it.\n\nAn MA in history, for anyone considering one, is *even more* reading and writing. Since you are supposed to learn critical thinking, data analysis, and communication during a BA in history, the MA is where you put those skills to use and develop them further -- and this is also where you become an \"expert\" in a specific historical subject. A BA in history doesn't demonstrate that you know any specific subject in history, but the MA does, since you often have to either do a thesis or research project.\n\nPersonally, I found that my MA was the most enjoyable education I ever received. Yes, it was incredibly stressful - grad school is going to be, whether you are prepared for it or not - but I don't test well, so the lack of exams in my MA program made it easier for me to do well. My major strengths are research and writing, and that's pretty much what the MA involves, so I found it quite easy. It also helps to be passionate about your research topic, and let me tell you, I absolutely *loved* my research topic and to this day (even doing a different one for my PhD) still write about and present on it -- it's hard to put into my past something I worked so hard on.\n\nNow, my third subject of study - since I've never majored (like I said, my BA was a specialization, and there are no majors in grad school) - is \"human studies.\" This is actually just a broad term applied to an interdisciplinary social sciences and humanities PhD program, it's not indicative of what I know or am researching besides that my research involves humans. I chose to do an interdisciplinary degree, however, for two reasons: a) there are more disciplines and their associated methods than just history that I want to use for this research, and b) there are particular profs I wanted to work with at a school that doesn't have a PhD in history.",
      "author": "xPadawanRyan",
      "created": 1546290951,
      "upvotes": 13,
      "replies": {
        "ed07o2e": {
          "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed07o2e/",
          "text": "[deleted]",
          "author": null,
          "created": 1546337816,
          "upvotes": 3,
          "replies": {
            "ed0kjgk": {
              "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed0kjgk/",
              "text": "Pretty much, yes -- you take courses on specific periods, events, people, themes, etc. in history in order to build and develop the necessary skills for being a historian. So, you emerge with the skills necessary to be a historian, but also a little extra knowledge on some particular areas of history (though no one would, at the undergraduate level, consider you an expert on any of these areas).\n\nAs for whether I held the misconception at any time, I did at one point, but I was corrected before I even finished high school. See, history was my passion - *is my passion* - but I wanted to study journalism for most of my life, because I wanted to write and I thought that's how you became a writer. Finally, in my last year of high school, I switched to wanting to study history because I was informed by our TA (who was a journalism student) that any BA can teach you to write, but journalism is very much more hands-on and media-oriented. Well, I wanted to write about my passion - history - and I certainly didn't want to do anything media-related.\n\nI guess it's a good thing I changed my mind anyway, because many journalism programs at schools all around here closed/shut down in 2011/2012, when I was finishing up community college -- by the time I got to university, there was no more journalism at my school. Thankfully, all I wanted to study was history.\n\nAnd my MA thesis was on sodomy prosecution between 1700 and 1750, focusing specifically on a major event in 1726, and comparing the before (1700 to 1725) to the after (1727 to 1750) -- my committee didn't want me doing a fifty year period, they thought it was too much for an MA thesis (which should be more narrow), but my story began right in 1700 and since the major event occurred in 1726, I wanted to give a generally equal period to compare the before and after. I was looking specifically at *why* the event and changes occurred.",
              "author": "xPadawanRyan",
              "created": 1546357060,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ed2219x": {
          "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed2219x/",
          "text": "Were you supporting yourself throughout earning your degrees? not to be presumptuous but I feel like your finances need to be taken care of if you are gonna pursue something like history. ",
          "author": null,
          "created": 1546399752,
          "upvotes": -2,
          "replies": {
            "ed23vv5": {
              "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed23vv5/",
              "text": "No, I lived with my mother during most of my undergrad, moving out briefly toward the end when I could no longer focus due to family drama. I did work, but I certainly couldn't afford to support myself for the most part, because I had to manage my time well so that I could attend class, do homework, study, work, and relax (because if I didn't get the chance to relax, I was certainly going to burn out).\n\nI wasn't able to support myself until graduate school, because the funding I receive as a graduate student fills in what my student loans and part-time wage never covered. However, that means that yes, during my MA, I was certainly supporting myself. In any case, it really is nobody's business but mine, so your opinion on my situation is not welcome -- one of the requirements here was to not be judgemental about majors and I found this comment to be judgemental about studying history. Please be careful about what you say.",
              "author": "xPadawanRyan",
              "created": 1546401476,
              "upvotes": 3,
              "replies": {
                "ed244vh": {
                  "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed244vh/",
                  "text": "If you look at a list of majors and their correlated earnings, history isn't too high up. That's not \"judgemental\", just a fact, and it should be accounted for when choosing a major since this is r/collegemajors",
                  "author": null,
                  "created": 1546401711,
                  "upvotes": -2,
                  "replies": {
                    "ed24ghj": {
                      "link": "/r/CollegeMajors/comments/abavnm/the_majors_megathread_helpful_information/ed24ghj/",
                      "text": "And not everyone chooses to attend university just for a high-paying job. I've made it clear that history is my passion -- I would certainly not be able to focus on an education if I was not passionate about it, and I would hate myself and my life if I chose to work in a field that I did not like. In any case, I'm in a good situation -- I'm working on my PhD, I want to be a professor, and most PhD students at my school are offered professor positions once they've completed their comps. So, I'm only about a year away from obtaining my dream job.",
                      "author": "xPadawanRyan",
                      "created": 1546402018,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634060182
}