{"sid": "gt0ec1", "link": "/r/CollegeMajors/comments/gt0ec1/need_help_deciding_my_major/", "title:": "Need Help Deciding My Major?", "text": "\nSo, I’m struggling with trying to decide what to major in. I love politics, law, crime, and history. Basically anything in that field. I like making a change, and leaving an impact. Fighting for justice and what’s right. But unfortunately, the degrees I’m interested in aren’t in demand, and don’t have good employment rates. \n\nI don’t want to waste my time going to college, and majoring in something I don’t enjoy, but at the same time my interests aren’t really going to get me anywhere. I plan on being a lawyer in the future. I want a degree that can get me a steady job if law doesn’t work out. I want a degree that could have me making $70,000 or more. I’m a high-achiever, and very ambitious. I love gaining knowledge.\n\nI just don’t know what to do because I’m atrocious at STEM, except for science. I was thinking maybe a business degree, but I don’t know if they have good job turnouts either. I was thinking about economics, but I’m not sure if I’d be good with that math. I’m good at basic math/algebra.", "author": "OkFondant0", "created": 1590783315, "retrieved": 1632956843, "over_18": false, "upvotes": 7, "upvote_ratio": 0.83, "comments": {"fw3dnwz": {"link": "/r/CollegeMajors/comments/gt0ec1/need_help_deciding_my_major/fw3dnwz/", "text": "I have all the same interests as you! Also being a high-achiever and wanting to go into law, I think I've found my niche and maybe you'll be interested as well. Pretty sure I'm going for international relations, because it's so general and has a lot of opportunities. But I'm also looking into criminal justice, forensics, or really anything other than STEM. Would love to hear if you've found a concentration yet!", "author": "KiwiKaylee", "created": 1593199468, "upvotes": 2}, "fs8xoxq": {"link": "/r/CollegeMajors/comments/gt0ec1/need_help_deciding_my_major/fs8xoxq/", "text": "Ugh. I feel you. I would love to go into forensics psychology but I’m not entirely sure if it makes a lot of money. I don’t care if I can’t make a six digit salary (much to my parents chagrin, haha), but I would like it if I could make at least $70,000 or more!", "author": "eeeshiieee", "created": 1590790887, "upvotes": 3}}}