{"sid": "oz0unm", "link": "/r/CollegeMajors/comments/oz0unm/is_a_double_major_in_international_business/", "title:": "Is a Double Major in International Business & Marketing with a Minor in Business Administration Good Combination (Undergrad)", "text": "Rising Sophomore in College about to switch from Health Administration after realizing for months I been lying to myself and I always wanted to be more global and marketing aspect even tho medical and business still my thing but as for my under grad I don't think I'ma want it. I know end goal after graduation I will get my MBA, just haven't narrow a concentration which I got plenty of time to figure out. Anyways, the reason I ask is because, I want to after graduation (about 3 ish more years) want to work a lil in my home state of FL before leaving to Australia and have permanent residence there. It's my dream to travel the world but more importantly to go to that country.\n\nI am hoping by scholarships and working (once out of helicopter parents household which pandemic made it worse) that I be able to go study abroad in 2023 (2nd sem of Junior Year and 1st Sem of Senior year, basically a year) in Sydney Australia, to UTS (Univ of Technology Sydney) which my college have a student exchange program there for the business program. \n\nAnother factor of me switching my major is that there wasn't to many classes concerning Health Admin that could transfer over however International Business, Marketing & Business Admin can which is making me exciting. \n\nIs this a good decision like would I be able to find stable careers, both in Florida and in Australia (areas like Gold Coast, Brisbane, Sunshine Coast, Palm Beach, & Sydney are good and top of my list of areas to live/work in) without struggling in life and decent pay as a future bachelor degrees holder until I get my MBA or no? Lemme know and thank you", "author": "MemeQueen1414", "created": 1628230016, "retrieved": 1632958023, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"h7z7rdf": {"link": "/r/CollegeMajors/comments/oz0unm/is_a_double_major_in_international_business/h7z7rdf/", "text": "Main point I want to make is that double majoring and especially minors don’t mean as much as colleges would make it seem. I graduated 10 years ago with a double major in math & CS. While I was in college I had the arrogance that I was getting 2 degrees. I thought a minor was like adding a half of a degree.\n\nThe reality is that a double major equates to more like a .1 or .2 of a degree. So you will walk out with 1.2 if you double major. Minors are like .01. So you would be looking at getting 1.21 degrees. It’s more… but let’s be real… it’s not like it’s that much better than someone with 1 degree.\n\nGeneral rule of thumb for an MBA is that you want to graduate, work 1-2 years, then go back for your MBA. \n\nHaha! I am also planning on moving to Aus. I’m in San Francisco and am currently planning on moving to Melbourne in 2-3 years. If you’re looking to travel the world, I would suggest moving to a place like Germany or something like that. If you’re around Berlin, lots of English spoken and you can literally find $90 flights to Ireland, Italy, Morocco, and all those places there. If you go to Aus, you will be severely limited in places to easily travel to. Just something to think about.", "author": "travishummel", "created": 1628281747, "upvotes": 2}}}