{"sid": "je5id4", "link": "/r/CollegeMajors/comments/je5id4/what_happens_when_you_pick_up_a_wrong_major/", "title:": "What happens when you pick up a WRONG MAJOR", "text": "Hey guys, being a graduate student and seeing/talking with students for over 3 years, I decided to share a realization that would help you. \n\nOf course, you want to decide your right major, and get this heavy decision off your chest and continue enjoying life. Even if people say, \"Oh well you can change your major if you don't like your current one\" and this phrase sounds like a relief but it's actually not, in the long run, it makes you doubt ANY major you have chosen, even the one that can be right for you.\n\nSo do you really wanna know what happens if you find yourself not liking the major? Well...\n\n𝒀𝒐𝒖'𝒍𝒍 𝒍𝒐𝒔𝒆 𝒎𝒐𝒕𝒊𝒗𝒂𝒕𝒊𝒐𝒏 𝒂𝒏𝒅 𝒇𝒆𝒆𝒍 𝒍𝒊𝒌𝒆 𝒇𝒂𝒍𝒍𝒊𝒏𝒈 𝒃𝒆𝒉𝒊𝒏𝒅, the interest of studying overall will decrease because \"being interested in what you study\" your brain will confuse with \"what it's easier to study\" which is impossible, any field you pick requires a consistent amount of studying/working. \n\nSo being in this mode of not fully committing to your major, will also impact your mental health, you'll start doubting your natural talent and skills, especially during these online times. \n\nNot only that but also you'll lose the opportunity to train yourself to learn which is a skill in itself that you can apply for your future careers.\n\nOverall, realizing that the major you picked is not a good fit even if it's true, you'll just be in this \"let's survive through mindset\" which is not effective at all, because you're wasting TIME, a LOT of fuc\\*ing time. \n\nSo nothing really bad happens, it's all about how disciplined and productive enough to still doing your studies and at the same time using your free time to learn more about what you may be curious about at the moment, go all in, listen to your heart and see what currently attracts you.\n\nOtherwise, you'll become a miserable person who got the degree but is still confused about the career options and chooses to work at a minimum wage job. \n\n𝗖𝘂𝗿𝗶𝗼𝘂𝘀 𝘁𝗼 𝘀𝗲𝗲 𝘄𝗵𝗮𝘁 𝘆𝗼𝘂 𝗮𝗿𝗲 𝗰𝘂𝗿𝗿𝗲𝗻𝘁𝗹𝘆 𝗱𝗼𝗶𝗻𝗴 𝗶𝗳 𝘆𝗼𝘂 𝗳𝗶𝗻𝗱 𝘆𝗼𝘂𝗿𝘀𝗲𝗹𝗳 𝗦𝗧𝗨𝗖𝗞 𝗶𝗻 𝘁𝗵𝗲 𝗺𝗮𝗷𝗼𝗿 𝘆𝗼𝘂 𝗱𝗼𝗻'𝘁 𝗿𝗲𝗮𝗹𝗹𝘆 𝗹𝗶𝗸𝗲?", "author": "NikitaRetro80", "created": 1603126642, "retrieved": 1632956453, "over_18": false, "upvotes": 24, "upvote_ratio": 1.0, "comments": {"gaw48e3": {"link": "/r/CollegeMajors/comments/je5id4/what_happens_when_you_pick_up_a_wrong_major/gaw48e3/", "text": "Interesting what you said about confusing easiness with interest. I feel like my majors are easy and interesting, but this past semester they've gotten difficult and feel really useless. I've been getting back into my techy phase, trying to learn to code websites and capturing/analyzing data packets. Makes me sorta wish I chose a STEM major... Every few weeks I go to my campus major list and look at the majors I probably should have chosen, because the arts/social sciences are so subjective. The grading logic of professors makes me mad because if they simply don't like something I turn in, they have the power to give me a lower grade. The grading system in natural science classes is something I miss, even though I was really bad at math in high school.", "author": "kickitlikeadidas", "created": 1604321997, "upvotes": 2}, "g9du6jw": {"link": "/r/CollegeMajors/comments/je5id4/what_happens_when_you_pick_up_a_wrong_major/g9du6jw/", "text": "You really like your fonts.", "author": "BloodyLemons", "created": 1603152701, "upvotes": 3}, "g9daf95": {"link": "/r/CollegeMajors/comments/je5id4/what_happens_when_you_pick_up_a_wrong_major/g9daf95/", "text": "This post is a personal attack and I don’t like it!", "author": "Rebel_Scum59", "created": 1603142092, "upvotes": 3}}}