{
  "sid": "qnprnf",
  "link": "/r/CollegeMajors/comments/qnprnf/need_serious_help/",
  "title:": "Need serious help",
  "text": "I really need help. Here is my backstory for context:\n\nI started college fall of 2017 in a small university with the intention of transferring into my dream school. I completed my Associates in one semester, then successfully transferred in spring of 2018.\n\nOnce entered into my dream university, I knew immediately what I wanted to study: animation. In order to get into the animation program, you must take the pre-requisite classes, apply, and you can only apply twice, and each application is open once every summer.\n\nUnfortunately, after two years, I did not get accepted into animation.\n\nIllustration was my backup plan. However, in 2019 my school's art department decided to add another obstacle because my school's art programs have become increasingly competitive. In order to apply for your program, you must first take a pre-pre-requisite class. If you pass, then you can take the pre-requisite classes, then apply for the program. In other words, I had to take a step backward and take that stupid pre-pre-requisite class.\n\nUnfortunately, I did not pass the portfolio review at the end of the pre-pre-requisite class. Meaning, I could not take the pre-requisite classes for illustration.\n\nAnd, as usual, you can only apply twice.\n\nAt that point in my life, I was already pretty depressed. It got so bad that cried almost 3 times a week, and I could literally no longer enjoy food. I was just existing, not living. But I decided to push onward because some of my professors said I might be better suited for the design program.\n\nLuckily the design program at my university does not require a pre-pre-requisite class. There are only pre-requisites, and then you can apply.\n\nSo, winter semester of 2021, I took the pre-requisites to design, then applied for the program summer of 2021. Did I get accepted? No I did not.\n\nNow that it's almost the end of 2021, I am home taking a break from college. I'm currently working as a freelance artist, and also part time at my local mall.\n\nBack in September 2021, I received an email from my art department that students who applied for design this past summer can re-apply earlier instead of waiting until summer of 2022, and that application is only open for people who applied this past summer. I took that opportunity to apply for design one last time. And I will get the results sometime this December.\n\nIf I do get into design, then that's great. I'll probably graduate from college in two years because design is a short degree, and I've already completed all my GEs.\n\nHowever, if I don't get into design, I literally don't know what else to do. I don't know what else to major in. I'm not particularly interested in anything else.\n\nI do have one more chance at the portfolio review for illustration, but that's another wild ride, and even if I do pass the portfolio review AND get accepted into illustration the first time, that major will take me about 5-6 years to complete from now. It's already been 4 years since college started, I'm not sure I want to stay in college for another 5 years.\n\nI suppose if I don't get into design, I could pursue a degree in Japanese? I've been learning it on the side for these past years but have never taken any classes.\n\nOther than that, I have no idea what to do. Any advise? I will appreciate any responses, and thank you to everyone who has read this far.\n\nHelpful side note, my university tuition is cheap and I currently have no debt.",
  "author": "KeepCalmToKeepCalm",
  "created": 1636162312,
  "updated": 1636655973,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {}
}