{
  "sid": "pq77qn",
  "link": "/r/CollegeMajors/comments/pq77qn/major_and_minor/",
  "title:": "Major and minor",
  "text": "I want to do a minor in sociology but I don’t know what my major should be. I thought about communications but I’m not good at public speaking. I don’t want to do psychology…. Or anything that has to with tech. \nI’m just wondering what would be a good major.. for a minor in sociology.",
  "author": "navyblue45",
  "created": 1631907774,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hdsfrt5": {
      "link": "/r/CollegeMajors/comments/pq77qn/major_and_minor/hdsfrt5/",
      "text": "I wouldn't pick a major on what I want to study. More what job/industry I want to work in then work backwards. \n\nSee what those applications are asking for. Also ask how easy it is to find a job with said major.",
      "author": "Spread_N_Spit",
      "created": 1632272462,
      "upvotes": 1,
      "replies": {}
    },
    "hda6c3x": {
      "link": "/r/CollegeMajors/comments/pq77qn/major_and_minor/hda6c3x/",
      "text": "Anthropology maybe? I'm considering minoring in it and it complements sociology pretty well. It's a very broad discipline, you can concentrate in many fields and it's fascinating regardless of what field you're interested in. It complements sociology well in the sense that sociology is the study of society while sociocultural anthropology in particular studies culture (there's a lot of overlap). Also, sociology studies groups and mass human behavior while sociocultural anthropology studies cultural groups and has more of an individual focus. Research in anthropology can be quantitative (e.g. for physical/biological anthropology, archaeology, and some areas of medical anthropology) or qualitative (for linguistic and sociocultural anthropology), while modern sociology is more quantitative as far as I understand. A unique feature of qualitative research in anthropology is ethnography, where anthropologists directly live with people of other cultures and write reports of their observations. I personally have found it fascinating and it might be something to look into based on your interests.",
      "author": "itsmematthewc",
      "created": 1631930046,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634060134
}