{
  "sid": "f2k5gu",
  "link": "/r/CollegeMajors/comments/f2k5gu/currently_majoring_in_eet_considering_switching/",
  "title:": "Currently Majoring in EET, considering switching. Again.",
  "text": "There is a lot to cover here. Not even sure if this subreddit is the best place to ask but i'll give it a go.\n\nright now, I am going to a Bachleors electrical Engineering Technology at SIUC. But what has led me to this major isn't really what I wanted to begin with.\n\nWhen I was a little kid, I used to spend a lot of time sitting in my parents basement taking apart electronics, and putting them back together. I was using an oscilloscope, creating DC-DC converts and reading schematics and datasheets by high school, so I thought I would Major in Electrical Engineering.\n\nThen something strange happened senior year of high school. I stumbled into the IT asset revovery and resale business by accident upon visiting a scrap yard in Michigan, and ultimately started an ITAD business myself. I was making 70K a year just going to scrap yards and flipping computer parts in ebay, craigstlist, and Amazon and paying a couple of friends to pack and ship things for me. I thought I was just gonna open up an ITAD and resale company out of college but no, my parents insisted I acquire higher education. My business ended my Senior year when I went off to college. This is where things take a downturn.\n\nI chose Electrical engineering as my Major, and ended up failing my first year of school at UofM Dearborn. The Calculus and Chemistry got me. I was put on probation, and for a complex list of reasons I do not want to explain here, Transferred to SIUC in Illinois.\n\nUpon transferring to SIUC, I chose a Bachleors in EET becuase it seemed \"easier\". But Now i'm finishing off my second semester as a Sophomore at 21, and I'm still not sure if it's right for me. Recently as of October 2019, I've gotten into teaching myself Altium Designer, fusion 360, and I love my solidworks class. But I learned that we never cover any design work in EET, It's just technician work.\n\nI'm considering switching back to EE again, since the classes my junior and senior year are more appropriate for what I wanted to do to begin with. unfortunently I would have to go back again and try to get those hard Math, Physics, and Chemistry classes out of the way. That would mean instead of graduating in 5 years, it would be 6 years. I didn't particularly feel like spending 6 years to get a college degree, but here we are.\n\nBut on the other hand, I also am really into entrepreneuership and the business side of things, and am currently minoring in Economics, so I am not sure what to do at this point. I've been good with business, and I've been good with engineering. I'm not sure which one to pick.\n\nThere is a third option here; Industrial engineering. My School offers it, and it looks to be a good blend of Business and Engineering. It would still extend my school time to 6 years, but would require me to only retake my math classes. I could take these classes at a community college while working part-time for a year, and pay for the classes.\n\nOr, does any of this even matter? Maybe just stick with my major, and get something like a minor in Economics or business (I am halfway to meeting both of these). The goal is to be employable today and maybe even own a business one day, whether the market is doing well or poorly. At this point, the chose I want to make seems like a dice roll.\n\nTL;DR: I'm a second Semester Sophmore Student in EET who likes both Engineering and entrepreneuership, and has been good at both outside the classroom. Is it worth it to switch back to electrical Engineering, or even switch to Industrial Engineering instead given I would extend my time in school from 5 years to 6? Or maybe just stick with my major, and pick up one or two minors?\n\n&#x200B;\n\nPS: My parents are paying for the first 5 years of my education, no matter what Degree I get or how long it takes. I've already used up three of those years, but I could use the cash I made from my business to pay for the 6th year of college.",
  "author": "CUDAcores89",
  "created": 1581475735,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {},
  "updated": 1634061427
}