{"sid": "owkpcu", "link": "/r/CollegeMajors/comments/owkpcu/grad_school_for_bio_after_bachelors_in_engineering/", "title:": "Grad School for Bio after Bachelors in Engineering?", "text": "Context: I'm a high school senior starting to apply for colleges, and I've always been interesting in biochemistry/molecular biology research as a career. However, I've done some research and read about how difficult it is to complete a PhD, and how you pretty much can only get good jobs after a PhD, which is expensive and takes up a lot of time. I'm not sure if this is a path that I want to commit to just now, so I'm currently planning on majoring in mechanical engineering instead, since I enjoy the subjects that are covered and it's much easier to get a good job in the field. My hope is that I can get my undergrad in engineering, and then later, if I decide I still want to go into biology and research, I can go to grad school for biology. My question: is that possible? I haven't been able to find any sources or stories about people doing something like that. Any answers, advice, or sources with more info would be appreciated.\n\ntldr: If I get a bachelor's in mechanical engineering, can I get a master's or PhD in biology?", "author": "OrderOfDagon3", "created": 1627929123, "retrieved": 1632958027, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"h8bmrgu": {"link": "/r/CollegeMajors/comments/owkpcu/grad_school_for_bio_after_bachelors_in_engineering/h8bmrgu/", "text": "It may be possible. you just need to research more about it. I can't give you direct advice as it differs from country to country. I think some graduate schools could accept you but I am not sure. You could instead major in a more related field to increase your chances(ex: biochemistry, biomedical engineering...) especially since engineering degrees are known to be of the hardest majors (The American Society for Engineering Education found that between 40% to 50% of engineering students drop out or change their majors).this is not to discourage you, but just to encourage you to further your research as knowledge is the key to success.\n\nI hope I helped.", "author": "wistigrift", "created": 1628537772, "upvotes": 1}}}