{"sid": "i8mcos", "link": "/r/CollegeMajors/comments/i8mcos/picking_a_college_major/", "title:": "Picking a College Major", "text": "Hi, i’m trying to pick a college major but i’m not sure what options there are and what would be best for me. I’m going to list a few things about me, and if anyone has the time to read, i would appreciate a few suggestions of what majors or fields of study that i would enjoy. thank you! \n\n\ni like organization- having a list of things to do and checking things off makes me feel really productive and great. i have a list on my phone if things i need to do everyday. \n\ni like exploring new things- i was really interested in astronomy/space exploration. i think it’s cool to learn stuff beyond earth’s atmosphere.\n\ni like learning new things about earth- during my environmental science class i thought it was interesting to learn about coral reefs. i also was interested in how humans can affect the environment and what we could do to improve & stop destroying habitats and oceans. \n\ni enjoyed math- i liked algebra, geometry, algebra 2, pre calc, and i am very good at thinking logically. i struggled in calculus though, and did not enjoy it as much as other maths, so i’m not sure if math based majors would be best.\n\ni am good at memorization- i can memorize pretty well, and step by step processes are ideal for my learning strategies. \n\ni’m not creative or imaginative- i’m bad at thinking outside of the box and coming up with my own ideas. i’d rather stick to what i am told/ what i learn rather than having to come up with something new and creative myself. \n\ni like learning abstract things- although i’m not creative, i’m really interested in learning things that are not typical. i was interested in my psychology class, specifically when it came to learning about different ways of thinking and different ways that humans act in society.\n\ni like natural disasters- i always thought lightning was cool and i also always watched a bunch of videos of tornados and hurricanes because i thought it was interesting. i enjoyed the natural disasters unit of my environmental science class. \n\ni was pretty good at chemistry, but not biology- i never really thought chemistry was super interesting, but i grasped concepts in my chemistry class pretty easily compared to the rest of the students in my class. biology, not so much.\n\ni like technology- i have always enjoyed playing video games, and have been interested in technology and how it works for a while. technology also appeals to my interest in exploring the abstract and understanding things that are super complex. coding and understanding the different parts of a computer are kinda boring to me though, and i’m not the best at dealing with frustration so i’m not sure about computer science.\n\ni think cyber security might be cool- it would be something new everyday, which is less bland than sitting at a desk and coding everyday. i also went on a field trip with my IT class, and this one girl talked about how her job includes trying to break the security systems of different softwares, such as trying to break into face ID on iphones, and i thought that was really cool. although, you might need to be creative for that, and i’m really not creative lol. \n\ni am an introvert and have social anxiety- i wouldn’t want a career or job that would put me one-on-one with people (such as becoming a doctor or lawyer). i get anxious in social situations, and i would like to say i prefer working alone, but that’s not practical in most jobs, so i think i can manage working in groups lol. \n\ni like helping people- i get really happy when i am able to make other people happy or do something that improves their day. \n\ni get bored easily- lol this is probably not something i should consider when picking a major, but i don’t want a job that would result in doing the same thing everyday. i would get bored of it super easily, i would need new projects and things to learn to keep it interesting. \n\n\nthanks for reading all of that, ik it’s a lot of information. what major or career do you think would be best for me based on my interests?", "author": "iiCammie", "created": 1597266672, "retrieved": 1632957479, "over_18": false, "upvotes": 4, "upvote_ratio": 1.0, "comments": {"g1y2d4x": {"link": "/r/CollegeMajors/comments/i8mcos/picking_a_college_major/g1y2d4x/", "text": "You could consider a combination of geology and computer science--the former is surprisingly quite fun and similar to space exploration, and CS would better your job prospects. They also overlap in some cases, such as geophysics as far as I'm aware. Good luck! :)", "author": "hlwaileyx", "created": 1597721496, "upvotes": 3}, "g1adabs": {"link": "/r/CollegeMajors/comments/i8mcos/picking_a_college_major/g1adabs/", "text": "Industrial engineering and some computer engineering. You make things work better for people without being in a physician or therapist like place. It is also full of variety. I think you’d flourish— especially if you have an interest in contract work.", "author": "AuthenticStereotype", "created": 1597286786, "upvotes": 2}}}