{
  "sid": "iupv5x",
  "link": "/r/CollegeMajors/comments/iupv5x/major_change/",
  "title:": "Major Change",
  "text": "Hi Guys,\n\nI have decided that I want a career in Marketing/Public Relations.\n\nWould a Public Relations degree be worth it?\n\nOr would it be better to do a Business Admin degree and minor in Communications or Marketing?\n\nOriginally, my gut said Public Relations degree but now I am starting to hear that communications degrees are worthless.",
  "author": "kaytielette",
  "created": 1600368896,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "g623wai": {
      "link": "/r/CollegeMajors/comments/iupv5x/major_change/g623wai/",
      "text": "a PR degree would get you a job working in a social media or advertising team, or maybe for an elected official/political campaign. It's definitely a niche field but there are tons of interesting career paths. But it is not the best overall degree to try to get...",
      "author": "_User_Unknown",
      "created": 1600654301,
      "upvotes": 1,
      "replies": {}
    },
    "g5p0iln": {
      "link": "/r/CollegeMajors/comments/iupv5x/major_change/g5p0iln/",
      "text": "If you’re doing Marketing you have to make sure you are able to intern or there is a focus like Digital Marketing, Social Media Marketing, SEO, and etc... If the Marketing major is similar to the one I recently did then they just give you the basics and potential employers want you to know a lot that the major didn’t cover. I ended up purchasing online courses to learn those things.",
      "author": "thedukejr03",
      "created": 1600431134,
      "upvotes": 1,
      "replies": {}
    },
    "g5mladm": {
      "link": "/r/CollegeMajors/comments/iupv5x/major_change/g5mladm/",
      "text": "Communications degrees or degrees similar to it are most definitely *not* worth it. You'll be wasting 4 years of your life and be in debt for a degree you can't even get a job with.",
      "author": "ExhilaratingMyth",
      "created": 1600373784,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634061366
}