{
  "sid": "qczahk",
  "link": "/r/CollegeMajors/comments/qczahk/physics_major_who_is_lost_as_fuck/",
  "title:": "Physics Major Who is Lost as Fuck",
  "text": "Buckle up, lads, because you're in for a journey. After high school, I didn't really know what I wanted to do with my life, so I decided to go into welding because I heard that they made a lot of money. Long story short, I hated it, so I quit after 4 months. Throughout my high school years, I really loved space related things (still do), especially black holes, so I would spend vasts amount of time researching black holes and all there is to know about them, and I got hooked. I continued to do this after my high school days, so I decided to turn my passion into a career. I set myself on a journey to becoming an astrophysicist; I was essentially inspired by the likes of Neil deGrasse Tyson, Lawrence Krauss etc. \n\nI live in Québec, Canada, so the educational system here is a little different. There's an intermediate position between high school and university. You choose a  program in what we call CÉGEP to allow you to pursue whichever degree would naturally follow up from your experience in CÉGEP. I chose the science option to get through all my math, physics, chemistry classes. Throughout my experience, I believed that math was my weakest link while I was barely passing in some of these math classes. Also keep in mind, I studied very little throughout my \"CÉGEP\" days and I would mostly go off on what I understood conceptually. I was good at understanding these new concepts and applying them immediately, but I just lacked the interest to study and hone those skills to really cement them in my toolset. It was different for physics; I enjoyed the subject and everything came to me really easily, and I finished my first class off with an easy A (mechanics, of course). The more classes I went through (optics and E&M), the more I realized it was getting tougher, but I pulled through without any good studying. \n\nSide note: This will come in later, but during my CÉGEP days, I took a psychology class which I absolutely loved; it was the only class that I genuinely enjoyed going to school for out of my entire educational history. I didn't need to study once because I soaked everything due to my genuine fondness over the subject. \n\nImmediately after I graduated CÉGEP, I got into physics at my current university, and I never thought that I would prefer my calculus class over my physics classes. I dropped my other physics class because it was so dreadfully boring that I knew I would fail from such  disinterest and now I feel like I should've dropped both. I feel like I'm trying to convince myself that I truly love physics, but I don't know anymore. I still really do love anything space related, but my classes are painful to go to. I also just horribly failed my midterm for classical mechanics after barely studying and hoping for the midterm to resemble the practice exam which he gave us (jokes on me, it didn't). I considered switching to geoscience since it envolves a lot of hands-on work, but I'm scared it might just be another garbage shoot.\n\n I would love to study psychology, but I feel like something is holding me back. The idea that if I pursued psychology and got a Bsc., and possibly/most likely a master's, I would be stuck without any real enjoyable career. \n\nThanks for reading; any advice would be greatly appreciated.",
  "author": "TheBatCrusader",
  "created": 1634844136,
  "updated": 1636188463,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhjczmi": {
      "link": "/r/CollegeMajors/comments/qczahk/physics_major_who_is_lost_as_fuck/hhjczmi/",
      "text": "Have you considered opening up to any of your physics professors about this exact issue? It is very likely that they have also gone through something similar at some point in their studies/career, and they may be able to give some insight that could change your perspective. You should also try posting this in one of the physics subs, as I imagine there will be some interesting inputs from them as well.\n\n&#x200B;\n\nIn my opinion; if your heart is in physics, then you should try and push through - don't let your spark die just because things became slow. It is a possibility that the interesting stuff lies ahead in future classes. What you don't want, is to look back and regret not sticking it out with what you were once passionate about.\n\n&#x200B;\n\nGood luck my friend:)",
      "author": "jvst_joshin",
      "created": 1634849205,
      "upvotes": 1,
      "replies": {}
    },
    "hi9plig": {
      "link": "/r/CollegeMajors/comments/qczahk/physics_major_who_is_lost_as_fuck/hi9plig/",
      "text": "Also a physics undergrad.. I focused on turning a passion into a career too. I loved spending hours learning about space and quantum from people like Sagan, Brian Greene, and Feynman. Honestly I still do. However, I've been losing my drive for the subject recently with the difficulty of the course load. Seems like Im working nonstop sometimes. \n\nI guess my best advice would be to ask yourself what got you passionate about astrophysics in the first place? Maybe something you enjoyed from psychology is connected with that and you could try pursuing that instead. Or take a few psych classes and see if you keep loving that more than physics. I would also say don't be too disappointed that you struggle with physics.. its really really tough. Talk to the professors if you are struggling and see if they can help you, or talk to an advisor if you are really considering changing majors.\n\nBest of luck!",
      "author": "Spiritual-Row-909",
      "created": 1635354675,
      "upvotes": 2,
      "replies": {}
    }
  }
}