{
  "sid": "id181r",
  "link": "/r/CollegeMajors/comments/id181r/degrees_for_people_who_suck_at_math_but_like/",
  "title:": "Degrees for people who suck at math, but like science and art.",
  "text": "Hello, I've been in college going on two years now on and off (multiple medical issues and hospitalizations). \n\nI'm looking at a communications major, but I'm not sure I'm passionate about it. \n\nI can write well, especially business emails and formal documents/essays. I also like poetry and traditional art. (I'm not talented enough to go for an art degree however)\n\nI'm creative, and good at empathizing with people. However, I don't want to go into social work or anything in the medical field that involves direct contact with patients. I communicate better via technology, in person communication can be difficult for me. \n\nI've taken a forensic science course and really enjoyed that, but upon researching careers, I didn't find any I was interested in. I enjoy science, especially natural and earth sciences. \n\nI'm not any good at math, at all. It is my weak subject.\n\nI also have the odd talent of being able to analyze information and interpret it to others. My mother always called it the gift of \"dumbing things down\", not to offend. \n\nAny suggestion would be helpful, and I will research each one. Thank you.\n\nTL;DR I am creative, with an artistic mind, a love for the natural sciences, good communication skills, emphatic, but bad in-person skills. I work better alone. Please no math centered degrees, that's my weak point. Any suggestions would be helpful, thank you.",
  "author": "rascalsnags",
  "created": 1597887816,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "g39jeu1": {
      "link": "/r/CollegeMajors/comments/id181r/degrees_for_people_who_suck_at_math_but_like/g39jeu1/",
      "text": "If you're good at \"dumbing things down\" and science you might want to consider technical writing as a career, lol. IDK much about the field, but my aunt works as one and that seems to be what the job is like: you talk to scientists/people who know a lot about a specific topic, and then you collate that info and write it in a way that's presentable to the layperson. I think a lot of medical companies need technical writers, so a double degree in communications/English and biology could be a good idea.",
      "author": "BetUrProcrastinating",
      "created": 1598724517,
      "upvotes": 2,
      "replies": {
        "g3f4616": {
          "link": "/r/CollegeMajors/comments/id181r/degrees_for_people_who_suck_at_math_but_like/g3f4616/",
          "text": "Actually I have been looking into that career! Thank you for the advice! I still need to do some more research but so far it looks good. Definitely one of the options I'm considering heavily.",
          "author": "rascalsnags",
          "created": 1598835644,
          "upvotes": 1,
          "replies": {
            "g3f4734": {
              "link": "/r/CollegeMajors/comments/id181r/degrees_for_people_who_suck_at_math_but_like/g3f4734/",
              "text": "Hi considering heavily, I'm Dad👨",
              "author": "dadbot_2",
              "created": 1598835661,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g27896i": {
      "link": "/r/CollegeMajors/comments/id181r/degrees_for_people_who_suck_at_math_but_like/g27896i/",
      "text": "You’d need to have pretty good soft skills to be successful as a comm major, but if you get lucky you could get into online PR that doesn’t require too much in person stuff. But being successful in general does require you to do a lot of networking, so I would recommend trying to improve your soft skills during college, there are lots of ways to do this. But I do know of many introverted accountants, and accounting isn’t very math intensive but not sure it’ll please your passions in the natural sciences.",
      "author": "editedbylp",
      "created": 1597920342,
      "upvotes": 2,
      "replies": {
        "g2etz7i": {
          "link": "/r/CollegeMajors/comments/id181r/degrees_for_people_who_suck_at_math_but_like/g2etz7i/",
          "text": "Y'know I did think about accounting. I've always loved doing personal budgeting. Though I know that's peanuts compared to the profession. I always assumed accounting was math intensive, but I suppose i should've looked into it further before writing it off. Thank you very much for your suggestion! I'll be sure to research more into it and speak with my advisor about the major required math courses.",
          "author": "rascalsnags",
          "created": 1598071898,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g26zcn4": {
      "link": "/r/CollegeMajors/comments/id181r/degrees_for_people_who_suck_at_math_but_like/g26zcn4/",
      "text": "If i were you i would probably major in chemistry or something like biology (preferably genetics). They offer a lot of career opportunities and they are not at all math heavy degrees though they are still difficult to obtain. Also having an artistic and an analytical mindset helps a lot with these majors so i think you would enjoy it.",
      "author": "nevermind0275",
      "created": 1597911053,
      "upvotes": 2,
      "replies": {
        "g26zt9j": {
          "link": "/r/CollegeMajors/comments/id181r/degrees_for_people_who_suck_at_math_but_like/g26zt9j/",
          "text": "The chem major curriculum includes physical chemistry which is really math intensive from what I've seen. My university you have to take 1 year of calc for a biochem major, and chem majors requires multivariable calc and recommends a linear algebra or differential equations class. Some areas within chem aren't as math heavy, but the degree is overall.",
          "author": "trans-2butene",
          "created": 1597911532,
          "upvotes": 2,
          "replies": {
            "g2etntt": {
              "link": "/r/CollegeMajors/comments/id181r/degrees_for_people_who_suck_at_math_but_like/g2etntt/",
              "text": "Thank you for the warning, math-heavy majors don't agree with me, I'll have to see what the requirements are for my campus.",
              "author": "rascalsnags",
              "created": 1598071742,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g2etk44": {
          "link": "/r/CollegeMajors/comments/id181r/degrees_for_people_who_suck_at_math_but_like/g2etk44/",
          "text": "Thank you for the suggestion! I have always been fascinated by DNA and genetics, it's certainly something to look into. I appreciate your help!",
          "author": "rascalsnags",
          "created": 1598071693,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634059852
}