{"sid": "eglr81", "link": "/r/CollegeMajors/comments/eglr81/should_i_double_major_in_math_and_engineering/", "title:": "Should I double major in math and engineering", "text": "So basically I’m hoping to be an engineer. But of course job security for mechanical engineers won’t be great in coming years so I wanted to get a double major in math and complete a training program for teaching so I can be a math teacher if stuff doesn’t work out. (Btw I’m not just treating it as a throwaway career math is my best subject I feel like I’d enjoy teaching it yadayadayada). My dream school (an in state university) allows students to do a dual degree in engineering and lsa so that would be allowed and I think there would be overlap in some of the math classes required for both majors. However I’m not sure if this is practical money and time wise plus prospective teachers have to do student teaching and I would prefer to try to get an engineering job right out of college. Idk. Thoughts and advice on this please, thanks!", "author": "minecraftpiggo", "created": 1577505118, "retrieved": 1632848003, "over_18": false, "upvotes": 2, "upvote_ratio": 0.75, "comments": {"fcl7uar": {"link": "/r/CollegeMajors/comments/eglr81/should_i_double_major_in_math_and_engineering/fcl7uar/", "text": "JMO: A full double major is a commitment and a teacher cert program requires a LOT of education classes as well. I'd go with a strong minor and look at doing an initial certification leading to master's degree program after the bachelor's instead. [Here](https://www.tc.columbia.edu/mathematics-science-and-technology/mathematics-education/degrees/initial-certification--transitional-b-ma/) is an example of the type of thing I mean although of course it will vary by your state.\n\nNote that admission requires 24 credits of undergrad math classes. You should be pretty close to that by the time you do your engineering courses (I assume calc 1-3 and diffeq and possibly stats as well) -- to fill that out you'll probably want linear algebra, proofs (sometimes included in discrete), stats if not already taken. \n\nThis has the advantage of not requiring you to complete effectively three majors (math, engineering, education) in undergrad, which would probably take as much time as the extra year. During your senior year, you can apply both for jobs AND for certification programs. \n\nAlso, tip: Get some experience volunteering in a high school before you commit to ANYTHING. Talk to some teachers.", "author": "jessamina", "created": 1577741691, "upvotes": 1}, "fcaqfsp": {"link": "/r/CollegeMajors/comments/eglr81/should_i_double_major_in_math_and_engineering/fcaqfsp/", "text": "I mean sure why not", "author": "puffy-jacket", "created": 1577574544, "upvotes": 1}, "fc7jazv": {"link": "/r/CollegeMajors/comments/eglr81/should_i_double_major_in_math_and_engineering/fc7jazv/", "text": "Why will there not be any security in mechanical engineering soon?", "author": "TheBrookAndTheBluff", "created": 1577509219, "upvotes": 3}}}