{"sid": "pylu6t", "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/", "title:": "What should I do?", "text": "I'm 19 and trying to major in acting, photography, and writing, but my mother is at it again picking and choosing my interests for me saying I should do nursing and child care. I can't do those two things because they're too stressful for me to do. She thinks I'm an object and expects me to do what she wants but not what I want to do. What should I do?\n\n[View Poll](https://www.reddit.com/poll/pylu6t)", "author": "Majestic-Back-2334", "created": 1633014812, "retrieved": 1633029486, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hevki7c": {"link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hevki7c/", "text": "If she is paying for college you should respect that and get a degree that will easily land you a good paying job. Don't go to 4 years of college to do something you think is fun. Do it to have a degree that will send you wherever you want to go in life. \n\nEven if you're taking out a loan. I would only look at Healthcare, accounting, engineering or any kind of STEM degrees. Those degrees will instantly land you high paying job right out of college. You may only have to do it for a few years before you can translate that experience to a different type of job that will pay you well for you experience. You could spend a year or more after college looking for a job with the kind of degrees you are wanting to pursue. You will still be able to persue your passion outside of work. \n\nIf you truly want to get into photography, as mentioned above. Just get a cheap car and a good camera and go create an amazing portfolio/Instagram/website.\n\nThere should be a \"listen to your mom\" option. You may not like it but she is right.", "author": "Spread_N_Spit", "created": 1633024231, "upvotes": 2}, "hevblj1": {"link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hevblj1/", "text": "A triple-major in three disparate fields wouldn't be wise. You may be able to do an English major with a concentration in creative writing. A double-major in theater and English would likely be doable.", "author": "qwertyrdw", "created": 1633020578, "upvotes": 3}, "hev2emg": {"link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hev2emg/", "text": "Have you considered waiting to declare a major until you take a few classes and narrow down your interests? \n\nAs someone who is now going back to college after 15 years, and as someone that went to college for a degree in photography at 20 years old, and then quit after several semesters when I realized I didn’t ACTUALLY need a degree to do anything in photography, don’t do it. By the time I quit, I’d wracked up a ton of student loan debt that haunted me for years until was I was able to pay them all off… so don’t major in photography. Take some classes in it, for sure! Even minor in it, but please don’t go into debt for a degree in photography. \n\nI was a photographer for several years before getting into a different business, and 99% of what I learned was not from my college experience. As a hobby now, it’s great, but I learned my lesson the hard way for sure, and it was an expensive lesson.", "author": "kateminus7", "created": 1633016789, "upvotes": 3}}}