{"sid": "ksos1o", "link": "/r/CollegeMajors/comments/ksos1o/i_have_no_idea_what_im_doing_please_help/", "title:": "I have no idea what I'm doing please help", "text": "Starting from middle school, I had a idea in my head that I would major in engineering. My dad did (he works with software currently), which led me to take a pre-engineering class in middle school. I loved it, and that was that.\n\nSo from then, all I've ever thought about is what classes I needed to take to major in engineering - I'm a junior this year. Then in 10th grade I started exploring a bit more, just to see what other options were available. I read about anesthesiologists, and I was sold. The idea of working closely with surgeons, and being in high stress situations was exciting. So I adjusted my college ideas by thinking that I would major in engineering, probably biomedical or environmental (those were my top more interesting choices), and take courses to satisfy medical school requirements at the same time. A lot of people said that engineering and premed was basically suicide, but I want to try it out. I joined a couple of organizations that relate to medicine for extracurriculars, and in one of them I joined as a graphic designer.\n\nI have never thought about anything art related, mainly because I suck at drawing. But making graphics for the organizations was really fun and I looked forward to creating them a lot more than I did with anything else in my life. So now I have no idea what I should do?\n\nOn one hand, engineering has been in the back of my mind for at least 5 years, so I'm very out of the loop. I haven't taken any art classes offered by my school - I might consider it for next year - I'm not very good at drawing, but the thought of creating them on a daily basis as a job makes me want to major in it. If I do, I also need a portfolio to submit with my applications should I choose to major in graphic design, which is also something I have no idea how to do, seeing that I never thought about majoring in any art.\n\ntldr: I wanted to become an engineer, changed my mind to being an anesthesiologist, then to a graphic designer. I'm way out of the loop and I don't know what I should choose.", "author": "ap7125", "created": 1610059278, "retrieved": 1632847065, "over_18": false, "upvotes": 5, "upvote_ratio": 1.0, "comments": {"gii2iat": {"link": "/r/CollegeMajors/comments/ksos1o/i_have_no_idea_what_im_doing_please_help/gii2iat/", "text": "If you want to go to medical school, get a business major cause then you can have a high gpa without worrying too much about the non pre-med requirements", "author": "almostdedxd", "created": 1610075435, "upvotes": 1}, "gihgyxt": {"link": "/r/CollegeMajors/comments/ksos1o/i_have_no_idea_what_im_doing_please_help/gihgyxt/", "text": "My best bet would be to apply as a biomedical engineering major and you could probably switch it to something else if you’d like wherever you go. Graphic design would be an okay choice if you had already been doing it for a while but it’s not that realistic at this point. You would be better off having it as a hobby or passion. You don’t need to do it professionally for it to be a big part of your life.", "author": "TheBrookAndTheBluff", "created": 1610064248, "upvotes": 3}}}