{"sid": "ol2qxb", "link": "/r/CollegeMajors/comments/ol2qxb/i_know_what_i_wanna_do_but_im_looking_for_a/", "title:": "I know what I wanna do, but I’m looking for a back-up/side career.", "text": "Hello!\n\nI would like to be an indie artist or start my own little art business, though it’s a bit high-risk and my parents said I still need to go to college. Which I agree with because I don’t have a valid reason not to get a degree right now.\n\nI spent my first year at an art school, but I am transferring to a cheaper, local, and smaller college (I do have a list already of some to apply to in fall) because it just was not the place for me. I'm currently taking a break from college rn. I still gotta pay off that one year of art school lol. Better sooner than later after I’m done with college.\n\nThe arts is not a big thing where I live. Most colleges do have a general fine arts degree, but I don’t wanna get a fine arts degree personally since I’ve been going to school/college to learn fine arts for 5 years now. I much rather focus on the specific crafts I’m interested in than on everything. I think I wanna take business courses or minor in business, but I don’t want to major in business.\n\nA bit of info about me...\n\n*(most interested in)*\n\n* I love being creative and entertaining people; digital illustration/modeling, playing music on multiple instruments, photography, and crafting.\n\n*(interested in)*\n\n* I like helping people with their problems and organizing a plan for them.\n* My favorite subjects in school were history and english since we got to do research and I like researching. And we would have socratic seminars, which were fun.\n* I like caring, helping, and handling animals.\n\n*(Weaknesses)*\n\n* I am neurologically disabled. According to my evaluation, I show moderate to significant weaknesses in phonics skills, word recognition, reading comprehension, math concepts, math reasoning, and basic writing skills. If the job can make accommodations/504 for it then that would be perfect. I also do have assistive technology to help with most of it.\n* I’m not a super social person and don’t like verbally talking much, but when I do socialize it can be exhausting after a while and I’m someone who tends to like working independently and/or small, slow pace, & quiet work environments.\n* I get distracted and burnt out quickly if what I’m doing is uninteresting, so I don’t like working long hours or having no breaks. And I don’t like doing the same thing every day; I like variety.\n\n*(Dislike)*\n\n* Never really liked most of science in school except for nutritional health, but we didn't learn that in science class rather PE.\n\nAs far as a job goes...\n\n* **Salary:** At least $40K starting out, but overall would like enough to live comfortably and be able to save up for retirement. I don’t care that much about being rich or owning luxurious things.\n* **Values:** I would like to be respected, be secure financially, work in the background, and have a good work-life balance. I don’t want to travel as much. I don’t wanna live in the city.\n\nHopefully, I gave enough info and this is readable. Thank you! :D", "author": "donuthoop", "created": 1626385608, "retrieved": 1632846509, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"h5dgzcc": {"link": "/r/CollegeMajors/comments/ol2qxb/i_know_what_i_wanna_do_but_im_looking_for_a/h5dgzcc/", "text": "I'd look into dental careers, they are very well respected and lend themselves to be quite profitable. For example, my first job was with a lady who was extremely artistic and very solitary, I heard rumors that she may have been autistic but i never could tell to be honest. My job was to make models of patients teeth, and then that went to her where she would cast a crown or bridge with various precious metals like gold, platinum, or zirconia. I am skipping SEVERAL steps in between, but eventually she would dye them a beautiful pearly white and paint faint streaks of light blue on the surface near where the gums would be. It was really a beautiful process. And then bam, you got yourself close to a thousand dollars per tooth. People go to dental school or university programs for this type of work, but in all honesty it is extremely dependant on your level of skill in the field and that comes with time and hard work, not a university education specifically. But yeah, this is the \"working artist's work\" because it's for people who can create and add beauty to something and there's nothing more empowering than a beautiful smile. As any job there are times for leeway but there are also times where you have to be exact and extremely meticulous. I don't know if this is something you're interested in but I can tell you I always felt good telling my teachers and friends parents what I did and everyone was always impressed when they heard I worked as a dental technician. It is a respected career and can earn you decent money if you dedicate yourself", "author": "WhoaTheFutureDude", "created": 1626422215, "upvotes": 2}, "h5ceo70": {"link": "/r/CollegeMajors/comments/ol2qxb/i_know_what_i_wanna_do_but_im_looking_for_a/h5ceo70/", "text": "I would recommend a degree that would only take 2 years, so you can get back to art, and also secure a chill career so you can focus on art. \n\nI would recommend dental hygienist or PTA but you dislike science. \n\nMaybe a paralegal? Takes two years and is aligned with your interests in English and history. It wouldn't put you in debt and seems chill enough to allow you to focus on art.\n\nAnother suggestion would be an education degree which would guarantee a job (although not high paying). Yet you could possibly teach art. Also you would have all of summer to focus on art. \n\nBest of luck, hope this helps.", "author": "sluttyjubilee", "created": 1626397847, "upvotes": 2}}}