{"sid": "gj5mgx", "link": "/r/CollegeMajors/comments/gj5mgx/maths_or_computer_science/", "title:": "Maths or Computer Science", "text": "Hey, what do you think would be the better choice.\n\nFirst of all I am in my last year before my final exams of secondary eduction here in Germany. I am really good at maths getting mostly A's in my classes and I also chose to focus on physics as one of my main subjects here at school. In addition to that, I also go to a class where we start working with university maths, where I also get mostly A's.\n\nNow the thing is: Lately I have been very. passionate about maths, but I have always been passionate about computers and programming too.\n\nIf I choose a CS Major I will only have maths up to Analysis II, Calc II and linear algebra II and the rest of the classes is focused on programming stuff.\n\nIf I choose a maths major I will have maths up to Analysis III, Calc III, linear algebra III, and I can choose computer science as \"area of application\". That means I will learn a lot about CS too, but the focus is on maths.\n\nShould I focus on maths? Is there so much difference between e.g. Analysis II and III or do I learn most important methods in Analysis II/Calc II/Algebra II?\n\nI'd really like some opinions about all of this!\n\nThank you!", "author": "AlterionBlackthorne", "created": 1589397443, "retrieved": 1632956251, "over_18": false, "upvotes": 0, "upvote_ratio": 0.5, "comments": {"fvapuwq": {"link": "/r/CollegeMajors/comments/gj5mgx/maths_or_computer_science/fvapuwq/", "text": "I have the feeling you’d love UF, they required Calculus 1, 2, and 3 if you want to transfer to their CS program. Also physics with calculus 1 and physics with calculus 2, general chemistry and fundamentals of programming.", "author": "FelixNoHorizon", "created": 1592533454, "upvotes": 1}, "fqpa84l": {"link": "/r/CollegeMajors/comments/gj5mgx/maths_or_computer_science/fqpa84l/", "text": "You could try dual majoring too, also Computer science will probably land you more jobs than a math degree.", "author": "Insomnimanic1", "created": 1589540473, "upvotes": 1}, "fqlg1wg": {"link": "/r/CollegeMajors/comments/gj5mgx/maths_or_computer_science/fqlg1wg/", "text": "Being a math major and then choosing CS would be fine. Mathematicians are in high demand, and can branch out to almost any subject. Many math major's go onto fields like data science, which overlaps with CS", "author": "vishthefish05", "created": 1589457085, "upvotes": 1}}}