{"sid": "ivmy95", "link": "/r/CollegeMajors/comments/ivmy95/what_are_better_alternative_majors_than_biology/", "title:": "What are better alternative majors than biology?", "text": "So I am currently working towards a bio degree and went in knowing the field was oversaturated. However, as semesters went by, I started to become more and more paranoid about the fact I may end up jobless and struggling. I want to decrease those chances by shifting degrees but, hopefully, still being able to do something bio-related.\n\nI know bioengineering would be one's first thought for me, but that was my original major until I realized I just am not an engineering type of person. Next, I had considered bioinformatics, which, granted, still isn't out of the question, but programming is not my strong-suit or passion.\n\nI'm sorry for sounding really pick and indecisive, but I'm scared of picking something and then regretting it.\n\nAre there any suggestions you guys have? I do plan on going to grad school if that helps with giving advice. Again, I'm sorry for being so picky.", "author": "Regular_Enthusiasm57", "created": 1600495017, "retrieved": 1632847536, "over_18": false, "upvotes": 4, "upvote_ratio": 0.84, "comments": {"g5viysh": {"link": "/r/CollegeMajors/comments/ivmy95/what_are_better_alternative_majors_than_biology/g5viysh/", "text": "Environmental Science is pretty similar to bio. There are jobs in the private (environmental consulting) and public sectors (city governments, EPA, etc.). The youtuber Kristina Lynn has some videos on environmental careers.\n\nGeology is a similar degree with good job prospects I believe.\n\nI went to a seminar about Geography when I was first starting college and they claimed there was always a job for a geographer (take that with a grain of salt obviously cuz I know nothing about it).\n\nAnd of course, there's always teaching, no matter the degree...", "author": "filledesfleurs", "created": 1600554656, "upvotes": 1}, "g5tviy2": {"link": "/r/CollegeMajors/comments/ivmy95/what_are_better_alternative_majors_than_biology/g5tviy2/", "text": "I'm not sure I'm aligned with these statements like \"programming isn't my passion\" and \"engineering isn't for me\". I think people have this unrealistic expectation that they will find that one perfect major that they have this God given talent for and life will be easy breezy (covergirl haha). \n\nI studied math and was in the exact same place as you. My sophomore year was ending and I was on track to graduate, but I didn't have the slightest clue of what to do with a math degree. In a panic I asked every professor in the math department and the consensus was \"oh gee.... well... umm.. you could become an actuary? ... or a umm... well you could become a professor\". I was distraught. I wasn't the best at programming but I was taking computer science 2 (java) and I wasn't liking it very much. I was excited that this was my last computer science class I had to take.\n\nMy professor was always trying to convince the bio and math majors to switch to computer science. One day he told me to quit math and go for comp sci and I responded \"what sort of company can I work for with that degree?\" And he quickly responded \"any company in the world\". That confidence convinced me to add it as a minor, and eventually turn it into a major. I've been in the field for 7 years now.\n\nI would still rather be doing math than coding. At the end of the day, this field pays really well and people make the best of the situation they are in. I had close to $170k in student debt so I didn't have time to find my passion, I could do that later. I am now debt free and work is fun. The people in the field are mostly fucking weird, but there are some that are fun to be around.\n\nLooking back at what my classmates did with math and computer science degrees, I now realize that your major doesn't really dictate what job you get. One friend is a cop, and another is a brew master (she studies chemistry in her spare time to try and keep up with coworkers). Most jobs want to hire smart people. No matter what, focus on exemplifying critical thinking and problem solving -> that will give you a great chance to be hirable", "author": "travishummel", "created": 1600531975, "upvotes": 3}}}