{
  "sid": "f0y3am",
  "link": "/r/CollegeMajors/comments/f0y3am/which_major_would_be_the_best_for_working_with/",
  "title:": "Which Major would be the best for working with graphene?",
  "text": "As the title says, what's the best college major to take to learn what it takes to develop graphene? I really want to develop and hone the production and applications of the 2D polymer known as graphene because I think it's going to be the Next Best Thing since silicon and that it provides a lot of applications for the future, like cleaning water, electronics, materials, making much more efficient solar panels, batteries, etc. So getting ahead in graphene is vital. \n\nSo my question is, what college major is best suited for learning the skills necessary to develop graphene and it's applications? I've heard some say Chemistry and others say Physics, so I'd like for some solid advice here, please.",
  "author": "Diogenes_Camus",
  "created": 1581197522,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "fh14eb6": {
      "link": "/r/CollegeMajors/comments/f0y3am/which_major_would_be_the_best_for_working_with/fh14eb6/",
      "text": "This is school dependent but i think its btwn chemistry, chemical engineering, and materials science",
      "author": "davvidho",
      "created": 1581210749,
      "upvotes": 2,
      "replies": {
        "fh1s4ac": {
          "link": "/r/CollegeMajors/comments/f0y3am/which_major_would_be_the_best_for_working_with/fh1s4ac/",
          "text": "Interesting. This may be just my uninformed opinion talking here, so correct me if I'm mistaken, but I always considered the difference between Chemical Engineering and Materials Science to being that the former deals with producing graphene while the latter focuses on using said produced graphene to manufacture applications for graphene. Of course, I could be mistaken in such an opinion and that both fields have a lot of overlap on what they do with graphene. \n\n\nWhat exactly are the differences between Chemical Engineering and Materials Science, as they relate to graphene?",
          "author": "Diogenes_Camus",
          "created": 1581222578,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634060868
}