{"sid": "o5cwg1", "link": "/r/CollegeMajors/comments/o5cwg1/i_need_advice_computer_science_and_risk_my_gpa_or/", "title:": "I need advice: Computer Science and risk my GPA OR Political Science, maintain a 3.0+ GPA and then go to law school?", "text": "So here's my problem: I have a trouble deciding on whether I should study Computer Science (math goes up to Calculus 1, but I am only strong in math if a graphing calculator is permitted otherwise I'm just awful in the subject)  but I have heard the Computer Science degree provides you a job right out of college and the job is enough to help you pay back your debt quickly. However, I am interested in law school, where I think it is harder to get into that vs. graduate school.\n\nI'm a transfer junior, planning on taking the LSAT upon graduation and going to law school. However, am I willing to study either Economics or Computer Science, which I think the latter would be more difficult. I am minoring in psychology since the major itself is not that good (you'll be very limited to what you can do after college, that major is really if you're doing grad school).\n\nWhat are my job prospects? Law enforcement, but lawyer is also on the list. I also like CS because in video games, I like computer players (NPCs, Bots, whatever you like to call them) and want to learn to program artificial intelligence to perform tasks similar to what humans do. However, I am probably putting too much thought into this and would like to anyone whose been in a similar position has to share.\n\nHowever, my eyes are on my grades and GPA, under no circumstances am I willing to have a C or lower because most of my grades consist of A's and B's, with only 1 D with a few C's. Thanks in advance!", "author": null, "created": 1624331469, "retrieved": 1632956854, "over_18": false, "upvotes": 6, "upvote_ratio": 0.88, "comments": {"h2mdtaa": {"link": "/r/CollegeMajors/comments/o5cwg1/i_need_advice_computer_science_and_risk_my_gpa_or/h2mdtaa/", "text": "Computer science is, at most universities, a degree that has heavy ties in mathematics typically requiring calculus 1-3, linear algebra, and discrete math. While I do not want to discourage you from the major, you may want to think carefully about pursuing this degree since you mentioned that you are \"only strong in math if a graphing calculator is permitted\". This can be taken in two ways (1) you are only comfortable with plug-and-chug formulas or (2) you prefer the thinking aspect than the computational aspect of adding/subtraction/etc. The latter *might* be okay, but the former is certainly problematic. CS Is largely a field that emphasizes problem-solving and is not the best choice for everyone. Liking NPCs and A.I. in video games may not necessarily translate to enjoyment for the field of computer science. People who enjoy great food may not necessarily enjoy cooking... even if they may consider becoming a chef at first. The field of AI is one that requires heavy mathematics (more so than your traditional software engineering role common to CS graduates), and if you're not comfortable with math, it may not be the most optimal path to walk. Especially, if you are leaning towards law school. In terms of your attitude towards grades, my CS friends and I commonly utter the mantra of \"C's get degrees\" before a tough project deadline. Not that we all have horrible grades, but many of us don't get straight A's and are content with that fact since grades is typically not the end-all-be-all for CS majors.\n\nTLDR: If you aren't comfortable with some math (without your graphing calculator) and not obtaining straight A's, CS might not be the right path for you. Fascinated by AIs and building AIs are very different things.", "author": "MasterLink123K", "created": 1624339267, "upvotes": 2}, "h2m2rvz": {"link": "/r/CollegeMajors/comments/o5cwg1/i_need_advice_computer_science_and_risk_my_gpa_or/h2m2rvz/", "text": "1. Never pick a major for the money. You can do plenty in life with a degree in anything. I'm saying this as someone who is working a job that isn't in what I got my degree in.\n2. You sound all over the place: lawyer, computer science, econ, psychology...it sounds like you want to be a lawyer so why not pick a major that is geared toward law school? Why not pre-law? Why are you picking majors that have nothing to do with law school?", "author": "Cheran_Or_Bust", "created": 1624331871, "upvotes": 10}}}