{
  "sid": "opdsjv",
  "link": "/r/CollegeMajors/comments/opdsjv/what_should_i_major_in/",
  "title:": "What Should I Major In?",
  "text": "I want to create medicine or products that help people get better / improve their life. \n\nOriginally, I was thinking I could major in biomedical engineering, but that field is too specific and oftentimes other engineering majors are able to become BM engineers, without majoring in BME.\n\nNow, I’m thinking I should major in chemical engineering, but do y’all have any other suggestions?",
  "author": "bubblewubb1es",
  "created": 1626960384,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "h651mmo": {
      "link": "/r/CollegeMajors/comments/opdsjv/what_should_i_major_in/h651mmo/",
      "text": "The important thing at the undergraduate level is breadth. I think the best specialties for what you say are Biology or Chemistry. Both can prepare you well for medical school in case you want to go, or to work in a startup related to biotechnology and health.",
      "author": "Saborizado",
      "created": 1626969535,
      "upvotes": 2,
      "replies": {
        "h651wo2": {
          "link": "/r/CollegeMajors/comments/opdsjv/what_should_i_major_in/h651wo2/",
          "text": "i definitely do not want to go to medical school 💀 i want to do an undergrad in 4 years and be out and in the work field. \n\nwould you say majoring in chemical engineering is good if you want to be a chemist ? or is chemistry a better option ?",
          "author": "bubblewubb1es",
          "created": 1626969653,
          "upvotes": 1,
          "replies": {
            "h656b6a": {
              "link": "/r/CollegeMajors/comments/opdsjv/what_should_i_major_in/h656b6a/",
              "text": "The old joke is that with chemistry you learn to make a new molecule, but with ChemE you learn to produce 800 tons in the cheapest way possible. If what you like is the business aspect, I believe that engineering courses teach you to see problems from a different perspective than a science course.\r  \n\r  \nChemical Engineering degrees tend to be easier to hire, pay much more (even at the bachelor's level), and are better stepping stones to a wider variety of jobs. Chemistry degrees are valuable too, but unless you want to be a lab monkey, you will probably need a master's or doctorate.\r  \n\r  \nSince you say you want to work directly, opt for Chemical Engineering.\n\nsource: I have relatives in the business",
              "author": "Saborizado",
              "created": 1626971488,
              "upvotes": 3,
              "replies": {
                "h657rdv": {
                  "link": "/r/CollegeMajors/comments/opdsjv/what_should_i_major_in/h657rdv/",
                  "text": "thankyou so much for your help :D",
                  "author": "bubblewubb1es",
                  "created": 1626972090,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634060643
}