{"sid": "nb5t18", "link": "/r/CollegeMajors/comments/nb5t18/if_you_had_the_chance_again_what_would_you_major/", "title:": "If you had the chance again, what would you major in?", "text": "Hi guys! \n\nI was wondering for those who were in college before, what would you major in again and why? Thanks!", "author": "Superb-Disk-8202", "created": 1620871548, "retrieved": 1632956646, "over_18": false, "upvotes": 13, "upvote_ratio": 1.0, "comments": {"gz8gdu2": {"link": "/r/CollegeMajors/comments/nb5t18/if_you_had_the_chance_again_what_would_you_major/gz8gdu2/", "text": "I quit Biochemistry because of external factors. Freshmen didn't get to choose their class sections, so I had an EXTREMELY late lab (7:30pm - 10:30pm), making me come back to my dorm around 11:00 - 11:30pm. I know it doesn't *sound* like a lot but it made me miserable. A few month before the semester started, I had a job at a chain bakery (start time was 2:30pm), and I'd come home around 1:00am - 3:00am, so it reminded me of that a lot. My advisor gave me a lot of random 30 minute breaks in between my classes, so it was also extremely annoying because I didn't know what productive thing to do in between classes. Don't even get me started on COMMUTING from dorm to classes. Big waste of time. I think maybe I just didn't know how to time manage...\n\nTo this day, **I still wonder** what would have happened if I had a normal lab time. I dedicated my **whole** high-school career to Biochemistry just for me to become exhausted.\n\nThough, I'm equally happy with my double major today (Economics concentrating in Data Science, and Nursing).", "author": "EmilyEmlz", "created": 1621826003, "upvotes": 1}, "gyw813j": {"link": "/r/CollegeMajors/comments/nb5t18/if_you_had_the_chance_again_what_would_you_major/gyw813j/", "text": "Currently I do Finance and Accounting as a double major. I'm really happy with both, but if I had to do something else, I would choose to pair a \"people-y\" major with my academic portfolio (ie. communications, marketing, or psychology). \n\nJust remember to get the degree. I know more than 80% of Americans land in jobs completely separate of their field of study.", "author": "JakeFromSF2011", "created": 1621560917, "upvotes": 2}, "gy7j2e2": {"link": "/r/CollegeMajors/comments/nb5t18/if_you_had_the_chance_again_what_would_you_major/gy7j2e2/", "text": "I’m still in college but 3 years behind due to constantly changing it & taking time off. I wish I just stuck with one thing even if I couldn’t see myself doing it. A degree doesn’t put you in a box—you can always branch out or go back to school. Even people who major in something and work in that field say they learn most on the job. Personally I wish I never switched from my communication disorder major (switched due to fear/anxiety). I’m currently switching back to it. I was doing mass communications but my greatest fear is feeling unfulfilled and/or being at a desk/computer job...so...that’s more likely with that degree.", "author": "roseyelephant33", "created": 1621082305, "upvotes": 1}, "gy0cwgl": {"link": "/r/CollegeMajors/comments/nb5t18/if_you_had_the_chance_again_what_would_you_major/gy0cwgl/", "text": "I've always wanted to be an obgyn doctor but the idea of med school and all the tests that come with it is just terrifying.", "author": "althyastar", "created": 1620931518, "upvotes": 2}, "gxz8k70": {"link": "/r/CollegeMajors/comments/nb5t18/if_you_had_the_chance_again_what_would_you_major/gxz8k70/", "text": "I’d probably go for computer science instead of information systems, but the CS math requirements were really intimidating and knocked my confidence. The IS math requirements followed the business school math sequence. \n\nAll in all, I think I am ending up with a lot of the same job prospects. Plus having lots of database knowledge gives me an edge.", "author": "infjetson", "created": 1620914385, "upvotes": 3}, "gxxpjdb": {"link": "/r/CollegeMajors/comments/nb5t18/if_you_had_the_chance_again_what_would_you_major/gxxpjdb/", "text": "Sociology and Economics, rather than the current Economics and Accounting that I attempted.", "author": "DetectiveTacoX", "created": 1620874823, "upvotes": 4}}}