{
  "sid": "oladrq",
  "link": "/r/CollegeMajors/comments/oladrq/how_can_a_psychology_major_be_used_in_the_video/",
  "title:": "How can a psychology major be used in the video game industry?",
  "text": " I'm majoring in animation right now, but I'm planning on changing it. I have an associates in studio art from community and once I got into university last fall for my bachelor's, attending Fresno state by the way, I changed from studio art to animation. While I was excited for both of my choices to get into art field at the beginning, its slowly demotivating me. Taking these art classes, especially during community, made me less creative and uninspired. I did make a few good projects but the others were sub-par because I felt I wasn't given enough time to work on them and rushed it to get it done. Recently I started looking back at the classes that were interesting at community and the only ones were psychology, sociology and also history. Out of those three, psychology seemed the most interesting. With the art degree, I was planning on getting into the video game to work on art side of games, but with psychology I was hoping there would be opportunities. I did a little bit research and it seems like there is but I need more advice if this would be worthwhile for me.",
  "author": "zEpicAvenger98",
  "created": 1626413297,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "h5f74qt": {
      "link": "/r/CollegeMajors/comments/oladrq/how_can_a_psychology_major_be_used_in_the_video/h5f74qt/",
      "text": "Honestly, though it may be interesting, a bachelor’s in psych isn’t worth much in most fields, including video game design. If art and animation classes weren’t interesting to you, maybe video game isn’t the field you want to go into.",
      "author": "officialkodos",
      "created": 1626457420,
      "upvotes": 1,
      "replies": {
        "h5q4c0r": {
          "link": "/r/CollegeMajors/comments/oladrq/how_can_a_psychology_major_be_used_in_the_video/h5q4c0r/",
          "text": "Well I wanted to know if there were any opportunities in this industry, in any form, whether applying psychology to any development aspect or studying like the social aspects of games, like the mmo genre. I did like the art classes in community. I was really excited in the beginning and that excitement just fell and I am taking some art classes this semester, finally in-person, and I'm a little worried. I did have an hopeful outlook in art, since I could remember. I remember drawing pictures of marvel characters I had on my phone and I would draw it freehand. They looked pretty good, not super accurate, but good nonetheless. Regarding the animation degree, I'll stick with it. In community, the art classes were fun but I wish I was taught more. I think that's the reason why  I felt the way I felt about it. This past year, my first semester in university was only online, which was a little unmotivating. I got through it fortunately. And this coming fall, my school will finally get to have in person classes again. So I'm really thankful for that and hopefully get me motivated again.",
          "author": "zEpicAvenger98",
          "created": 1626676662,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634060952
}