{"sid": "jq7vu0", "link": "/r/CollegeMajors/comments/jq7vu0/choosing_a_college_major/", "title:": "Choosing a college major", "text": "Hi!\n\nI’m currently going through the tedious process of applying to college but there’s only one issue, I don’t know what I want to major in :/ \n\nI love helping people & understanding them but I also love writing. I could envision myself writing a book one day. & even creating an online platform where I can reach people with my writing. I’m also really intrigued with art & music. I have so much passions and I don’t know what to do, ughh! I’ve considered psychology but I know a bachelors won’t get me far, I’ve considered English but I’m not entirely sure if it’s the right fit for me, & recently considered business administration. What major do YOU think would be best suited for me? \n\nThanks!", "author": "nicole03427", "created": 1604821453, "retrieved": 1632955668, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"gcgjin3": {"link": "/r/CollegeMajors/comments/jq7vu0/choosing_a_college_major/gcgjin3/", "text": "Some other options could be social work, or doing something like art therapy (which I think often requires a masters depending on where you live).", "author": "Celestial-Thestral", "created": 1605496802, "upvotes": 1}, "gblax18": {"link": "/r/CollegeMajors/comments/jq7vu0/choosing_a_college_major/gblax18/", "text": "While it's hard to suggest a major for you when I don't know you, possibly public relations? Public relations encompasses psychology, art, business, and writing. You produce copy (writing), correspond with journalists, you design graphics, analyze consumer psychology, and are in charge of event planning for a business. The main goal of a public relations professional is to build a solid reputation for a business/organization/nonprofit. In an agency you meet with clients (fulfilling your need to socialize with people). If you like helping others, nonprofits sometimes look to hire a public relations specialist. \nIt is a pretty broad field, but encompasses a lot of what you are looking for.", "author": "__WhatIsLife__", "created": 1604830202, "upvotes": 4}}}