{"sid": "nlv553", "link": "/r/CollegeMajors/comments/nlv553/finance_or_chemical_engineering/", "title:": "Finance or Chemical Engineering?", "text": "I'm currently a sophomore finance major with a 3.77 GPA. I enjoy finance to an extent and am still confident in my future going down this route. Although, as I am beginning my junior year and getting into some of the upper division courses, the stuff is just boring to me. I knew I would expect this and that this would happen, but I see everyone else in other majors being able to learn hands on and would love to major in something where I could learn how to build and make stuff.\n\nI've been researching Chemical Engineering and it is something that interests me. I've always done well in math and science courses and I feel it would be a major that I'd be much more motivated to complete.\n\nI see that it is happening more now than ever of big banks hiring STEM graduates so I feel I could get a Certificate of Finance and still be able to take that route if I ever wanted to.\n\nThis switch would set me back about a year but it honestly isn't that big of a deal for me to take a few summer semesters.\n\nAny thoughts? Thank you.", "author": "buyhighsellverylow", "created": 1622074010, "retrieved": 1632846533, "over_18": false, "upvotes": 10, "upvote_ratio": 1.0, "comments": {"gzwmsqd": {"link": "/r/CollegeMajors/comments/nlv553/finance_or_chemical_engineering/gzwmsqd/", "text": "what position do you see yourself working in finance? it's quite broad, but fintech (financial technology) is the best specialization. However, this is still only scratching the surface of technology which is taking over so getting into coding is actually way better.", "author": null, "created": 1622319925, "upvotes": 1}, "gzpt8u3": {"link": "/r/CollegeMajors/comments/nlv553/finance_or_chemical_engineering/gzpt8u3/", "text": "If you still want to go the finance route, I would talk to your academic advisor and ask if switching majors would be detrimental to your employment prospects after graduation. Maybe talk to alums as well.", "author": "wistful_eunoia", "created": 1622171615, "upvotes": 1}, "gzlo7d4": {"link": "/r/CollegeMajors/comments/nlv553/finance_or_chemical_engineering/gzlo7d4/", "text": "Double major? Idk haha", "author": "TheNameIsZander", "created": 1622090175, "upvotes": -1}}}