{
  "sid": "lti8nl",
  "link": "/r/CollegeMajors/comments/lti8nl/advice_on_a_major/",
  "title:": "Advice on a major",
  "text": "Hello everyone, I’m a 20 year old college student. I went into college thinking I wanted to do nursing but after working in the field I decided it wasn’t for me. Now I don’t know what I want to do. I love culture, learning foreign languages, history, and biology. I’m really good at memorization and have always been. I am a humanitarian at heart, but I also want to make money and I really don’t where to go with any of my skills. Any advice would be most appreciated and very helpful. Thank you all.",
  "author": "Ariel33245",
  "created": 1614407893,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "gp3sf2s": {
      "link": "/r/CollegeMajors/comments/lti8nl/advice_on_a_major/gp3sf2s/",
      "text": "I agree with the other commenter - I think public health might be a good choice of career. You already have experience in it, it seems to involve some of your interests/goals (biology, culture, helping people), and it's definitely a big field with a lot of opportunity for stable careers. I can't say exactly what kind of jobs are available, but I think it might be something to consider.",
      "author": "BetUrProcrastinating",
      "created": 1614474317,
      "upvotes": 2,
      "replies": {}
    },
    "gozam7w": {
      "link": "/r/CollegeMajors/comments/lti8nl/advice_on_a_major/gozam7w/",
      "text": "The best major out of all of them in my opinion is Computer Science. Then the other STEM fields, Then business with a useful concentration (Like accounting). Then Medical majors that are tailored for a specific job.\n\nThe rest are there just to take your money.",
      "author": null,
      "created": 1614426504,
      "upvotes": -5,
      "replies": {}
    },
    "goyn40k": {
      "link": "/r/CollegeMajors/comments/lti8nl/advice_on_a_major/goyn40k/",
      "text": "Maybe a Public Health—Global/International Studies combination? Might be especially relevant given the coronavirus pandemic and the future awareness we’ll need to prevent similar disasters. The Public Health major esp. could let you study biology ~and~ help people without entering nursing. Not sure about this since I’m not an expert, but I’d venture that as the medical field grows in the next few decades, plenty of jobs on the admin/community/policy side of medicine will open up, too.",
      "author": "aphrodite727",
      "created": 1614414618,
      "upvotes": 4,
      "replies": {}
    },
    "goyhalu": {
      "link": "/r/CollegeMajors/comments/lti8nl/advice_on_a_major/goyhalu/",
      "text": "Have you considered being a professor? You'd get to study and learn about your favorite subjects while also teaching. There's a lot of memorization and research involved. You can also make a good amount of money.",
      "author": "RealtaScript",
      "created": 1614409830,
      "upvotes": 2,
      "replies": {
        "gpr6luj": {
          "link": "/r/CollegeMajors/comments/lti8nl/advice_on_a_major/gpr6luj/",
          "text": "Doesn't that ultimately depend on where you work and how many years you spend in the field? Professors typically don't start out with a great salary.",
          "author": "chobibi",
          "created": 1614934424,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634059176
}