{"sid": "phkixp", "link": "/r/CollegeMajors/comments/phkixp/what_should_i_major_in/", "title:": "What should I major in?", "text": "Hello!\n\nI've been struggling with what to major in when I go to college, so I'm hoping someone could help me :)\n\nI'm 15 years old and a Junior at a Performing Arts High School. I've been in musical theatre since I was very, very young and more recently got into writing for the screen and stage and teaching the arts. I also really got into Physics after taking a few summer classes, but I feel like I'm not smart enough for that lol. I'm relatively good at both science and math, but my very poor memory doesn't help when it comes to remembering the basics of ANYTHING. I'm also really into political science and debate, which is something that I got into in my free time. I'm having such a hard time deciding because I think about only pursuing arts, and not having science and math makes me feel weak. When I think about only pursuing physics, not having the arts heavily in my life hurts too. And majoring in both hurts my head and knowing myself, it would be too much for me.\n\nSo here are some things to keep in mind...\n\nInterests: Musical theatre, Film, Theatre education, Physics, Politics, Debate\n\nStrengths: Outgoing, Devoted, Creative, Great balance of logic and emotional thinking\n\nWeaknesses: Poor memory, Doesn't work well with large groups, poor problem solving\n\nI would really love to stay in Cali for college and grad school, so I don't want anything that isn't offered to its fullest where I live :)", "author": "ifuckedup0226", "created": 1630728383, "retrieved": 1632846497, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"hbjhycg": {"link": "/r/CollegeMajors/comments/phkixp/what_should_i_major_in/hbjhycg/", "text": "maybe you should do journalism/media studies/theatre something like that and focus on the play/musical and politics side of it?", "author": "oakflowersD", "created": 1630736892, "upvotes": 1}, "hbjeyy3": {"link": "/r/CollegeMajors/comments/phkixp/what_should_i_major_in/hbjeyy3/", "text": "Well what type of work would you like to do? Ultimately a degree is for getting a job. I'm not saying you need to be a doctor/lawyer/high-paying-whatever of course! Just that you need a general field picked out. Something to consider is finding a steady but maybe \"boring\" day job while performing at night or whenever.", "author": "Cgo3o", "created": 1630734640, "upvotes": 2}}}