{"sid": "jnoz75", "link": "/r/CollegeMajors/comments/jnoz75/degree_for_digital_marketing/", "title:": "degree for digital marketing?", "text": "is a business degree better than cs/is/it for a job at digital marketing? I feel that cs can open up more opportunities but a friend said that cs is overkill for digital marketing and studying business is less rigorous academically so I can have more time for projects/work", "author": "complexinferiority", "created": 1604459213, "retrieved": 1632957468, "over_18": false, "upvotes": 5, "upvote_ratio": 1.0, "comments": {"gec7tlj": {"link": "/r/CollegeMajors/comments/jnoz75/degree_for_digital_marketing/gec7tlj/", "text": "Computer science and digital marketing are almost completely separate things.  If you are interested in how to sell stuff, reach targeted customer groups more effectively, maybe gather better information about their purchasing habits and desires - marketing.  If you are looking to do this through google ads, social media etc. - digital marketing.  If you want to know how google scans all of the information on the internet, organizes that information, and connects it to poorly worded search queries - computer science.  If you want to analyze the key individuals that are important nodes in a communications net - computer science.  If you want to do digital marketing, go with the business program, major in marketing and be sure to take whatever electives in digital marketing that are available.  Use some fee electives to pick up some digital design, website design/layout type courses.", "author": "dmstew", "created": 1606885017, "upvotes": 1}, "gb435l7": {"link": "/r/CollegeMajors/comments/jnoz75/degree_for_digital_marketing/gb435l7/", "text": "i like digital Marketing as well, got sôw online courses and thought i won’t need a degree to get into it but I also plan on going for IT or computer engineering. I like UX/UI design. My interest are kinda all over the place lol", "author": "jin_kaos", "created": 1604496109, "upvotes": 1}, "gb31tdd": {"link": "/r/CollegeMajors/comments/jnoz75/degree_for_digital_marketing/gb31tdd/", "text": "I agree that a degree in business with the concentration in marketing or whatever your uni has it under is best. You could even minor or take electives in CS/stats for the coding and/or analytics. My uni has analytics courses embedded into the marketing courses for the major and you can take up the minor in stats which has data science type courses to learn the analytics side more in depth. So it depends how you’re school handles it. Let me know if you have questions.", "author": "twin0912", "created": 1604465380, "upvotes": 1}}}