{"sid": "bd0t7k", "link": "/r/CollegeMajors/comments/bd0t7k/should_i_switch_from_accounting_to_computer/", "title:": "Should I switch from Accounting to Computer Science?", "text": "My GPA is currently a 3.47 and I am a sophomore going into junior this fall 2019. I have finished all my prerequisites required to declare the Accounting major but I had a sudden change of heart looking at the job prospects for different majors. I find both subjects fairly interesting but I have recently found out that computer programmers and all those tech majors are on high demand. Therefore their salary is better as well as their chances of being hired after college. Accountants do get payed well too but not as much as I would like to earn.", "author": null, "created": 1555231008, "retrieved": 1632957989, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"f0gvdun": {"link": "/r/CollegeMajors/comments/bd0t7k/should_i_switch_from_accounting_to_computer/f0gvdun/", "text": "Look into an Accounting and CIS double major. Might be CIS OR MIS where you are. Computer informations systems or management info systems. It’ll combine both and with a bit more learning/training/vertical ions in both you can make more money  and look better to potential employers", "author": "shayskates33", "created": 1568607004, "upvotes": 1}, "ekwsshr": {"link": "/r/CollegeMajors/comments/bd0t7k/should_i_switch_from_accounting_to_computer/ekwsshr/", "text": "I kind of assumed accountants with CPA would be paid more than developers, especially after a few years of experience.  \n\n&#x200B;\n\nWere you planning on getting your CPA?  \n\n&#x200B;\n\nOnly go into CS if you actually enjoy programming, the theory, and aren't adverse to taking the math classes involved.", "author": "PianoConcertoNo2", "created": 1555291960, "upvotes": 1}, "ekvtq7v": {"link": "/r/CollegeMajors/comments/bd0t7k/should_i_switch_from_accounting_to_computer/ekvtq7v/", "text": "it really depends. In my, admittedly somewhat limited, experience, it's very hard to predict whether a person will end up liking programming/computer science. Programming is a manner of thinking that is really different from what most people are used to, so a lot of people are intrigued because they like computers and want a good salary, but then the work is different from what they expected, and they end up not liking it. Before you even consider doing a double major, you should see if you like programming. Maybe take an intro comp sci class over the summer? There's also a lot of online resources that you could use to learn more about CS.\n\n&#x200B;\n\nCS is probably one of the last professions you should go into just for the money (probably losing to doctors). It's a lot of work in school, but even more importantly, you're almost expected to be putting in a lot of outside work to learn relevant technologies. Unlike a major like engineering, which is designed to prepare you for the specific job of being a civil, mechanical, etc. engineer (same with accounting) there are too many subfields of computer science and the industry moves too quickly for a degree to prepare you adequately for a lot of the jobs CS majors go into. Want to be a web developer? Almost none of what web developers need to know is taught in a university setting, since a technology even 5 years old can be very out of date. Want to go into data science? get ready to learn a bunch of extra stats and do Kaggle competitions etc. If you want one of those uber high paying CS jobs, you're probably going to have to put in a lot of extra work to learn those sexy new languages/frameworks that are in demand. Take all of this into consideration before you consider switching. CS can pay very well, but it requires a lot of extra work and outside learning in order to get into one of those top jobs.", "author": "HauntingMastodon", "created": 1555263840, "upvotes": 1}}}