{"sid": "iqdj1g", "link": "/r/CollegeMajors/comments/iqdj1g/im_conflicted_on_the_art_major_i_should_choose/", "title:": "I'm conflicted on the art major I should choose.", "text": "So I'm planning on doing a minor in business, and a major in either acting or film making/producing. That's where I'm struggling, because I'm interested in doing both of these things but am trying to figure out what would be necessary. I want to be an actor, but I also want to make films in other words. I'm leaning towards doing acting because it would look better on my resume when doing auditions, but then again I should do film making/producing to know how to do it. I could also do a major in one and do a class outside of college for the other. Anyways, I'm just a bit conflicted and I was wondering what ya'll thought! ;)", "author": null, "created": 1599775783, "retrieved": 1632847553, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"ge0v4zh": {"link": "/r/CollegeMajors/comments/iqdj1g/im_conflicted_on_the_art_major_i_should_choose/ge0v4zh/", "text": "It seems to me that acting is easier to study on your own (or in a class outside college) than film production is, because film production requires specialized, expensive equipment (which I assume you will have access to in film production courses). Also, film production may give you some technical skills that could be transferable to a career outside the entertainment industry if need be. Lots of employers need video editing skills even if they're not making feature films.", "author": "ultimate_ampersand", "created": 1606653350, "upvotes": 1}, "g4xbnau": {"link": "/r/CollegeMajors/comments/iqdj1g/im_conflicted_on_the_art_major_i_should_choose/g4xbnau/", "text": "I don't think anyone is going to give you the thumbs up to major in any kind of performing arts. You can follow your passion of becoming an actor or film creator without getting yourself $50,000 into debt. Most people will tell you to major in business and minor in film or acting. \n\nThat being said, if you are still very passionate and don't care if you don't ever end up with a job in that field, can you double major? Maybe major in both film and acting. If your primary goal in life is to become an actor, then I think acting would be better. Try taking a class or two in both and see which one you like more.", "author": "strangercats13", "created": 1599915381, "upvotes": 1}, "g4rs5bn": {"link": "/r/CollegeMajors/comments/iqdj1g/im_conflicted_on_the_art_major_i_should_choose/g4rs5bn/", "text": "Is it possible to major in business and minor in the other? I would rather have the technical skills of business as a major imo", "author": "tha_oz", "created": 1599782283, "upvotes": 1}}}