{
  "sid": "qayajz",
  "link": "/r/CollegeMajors/comments/qayajz/major_decision/",
  "title:": "Major Decision",
  "text": "I'm currently trying to settle on a major as I have to decide by the end of this semester. Not really big into STEM. I need something easier than that. History is by far my favorite subject, but I'm worried about job prospects after undergrad. Not big into going to grad school either. Spare me the \"why go to college if you're gonna ask questions like this?\" lecture. I have to be here so I'd appreciate any advice anyone can give, maybe someone with a History degree or something related? I've heard so many different things. History degrees are useless or anything that isn't STEM is useless for that matter. But then I hear that you can pretty much do whatever you want with any degree, or that if I go for something like Computer Science I have to be EXCEPTIONAL at it since the field is so crowded. Not sure what to do.",
  "author": "One_Box_69",
  "created": 1634598244,
  "updated": 1637404002,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hh68ulw": {
      "link": "/r/CollegeMajors/comments/qayajz/major_decision/hh68ulw/",
      "text": "History isn't too bad of a degree to go into, but double majors are always better (Especially if you can pair stuff with a really strong niche). What else do you like to do?\n\nIn terms of career prospects, you can do that sorta research on your own (It'd be dumb to get a degree for career purposes without understanding what sort of careers are available with that degree), also gives you some ideas in terms of direction for a major to pair it with.\n\nIt is true that CS is super crowded, but that's not for no reason. Programming skills are really good to have now, and perhaps pairing it with history wouldn't be the worst idea (Again, niche). If you like CS, then that's definitely a viable option",
      "author": "StarvinPig",
      "created": 1634602071,
      "upvotes": 2,
      "replies": {}
    },
    "hh6b2xx": {
      "link": "/r/CollegeMajors/comments/qayajz/major_decision/hh6b2xx/",
      "text": "History isn’t to bad",
      "author": "SnooPaintings430",
      "created": 1634603146,
      "upvotes": 2,
      "replies": {}
    },
    "hh6ntgq": {
      "link": "/r/CollegeMajors/comments/qayajz/major_decision/hh6ntgq/",
      "text": "History is a fine field, but I am quite biased. I double-majored in history and poli sci as an undergrad. History is quite a versatile field because everything has a history--whether its military history, the history of the refinement of methods for producing sausage fit for human consumption, or the history of computing. I recall having read an NYT article from sometime in the early 50's predicting that someday computers might be as small as \"a small room.\" If we could go back and bring that reporter to our time so he could see how we carry computers around in the palm of our hands, he'd probably stroke-out.",
      "author": "qwertyrdw",
      "created": 1634609248,
      "upvotes": 2,
      "replies": {}
    },
    "hh6oi82": {
      "link": "/r/CollegeMajors/comments/qayajz/major_decision/hh6oi82/",
      "text": "What are you actually interested in? If you love history, then that's what you should major in. Your not going to be able to major in computer science or STEM if you don't love what your doing. \n\nHistory is sometimes common for teaching? You could major in history and get a teaching certification at the same time if you have any interest in teaching.",
      "author": "DanHassler0",
      "created": 1634609605,
      "upvotes": 2,
      "replies": {}
    },
    "hh6ou3n": {
      "link": "/r/CollegeMajors/comments/qayajz/major_decision/hh6ou3n/",
      "text": "Same here with me. Good luck and keep us updated. :)",
      "author": "applegreenblue",
      "created": 1634609771,
      "upvotes": 1,
      "replies": {}
    },
    "hhh40cx": {
      "link": "/r/CollegeMajors/comments/qayajz/major_decision/hhh40cx/",
      "text": "If you're okay with a median or slightly below median starting salary, your history degree is fine for jobs that don't need a specific degree. Learn to market your writing, research, and critical analysis skills as those are aplicable to virtually any business situation",
      "author": "42gauge",
      "created": 1634812270,
      "upvotes": 1,
      "replies": {}
    },
    "hjsmumv": {
      "link": "/r/CollegeMajors/comments/qayajz/major_decision/hjsmumv/",
      "text": "No degree is useless as long as you're the best at it. If history is something you love and are passionate about , no doubt , you'll excel at it and that's what matters. Be the best in your field.",
      "author": "La-Madame",
      "created": 1636373649,
      "upvotes": 1,
      "replies": {}
    }
  }
}