{"sid": "gmqvuq", "link": "/r/CollegeMajors/comments/gmqvuq/would_it_be_wise_to_major_in_something_that_you/", "title:": "Would it be wise to major in something that you aren’t good/talented at?", "text": "I’ve been looking at other options for college majors, but it seems that i dont have any skills or talent to take it up. Ie Information technology: I have basic info about python since I tried to study it but I wasn’t interested enough to continue studying it. Im also not into tech which may pull me down when im going to take this major.\n\nOther options are: Engineering and Architecture", "author": "Lorhenzoshi", "created": 1589902639, "retrieved": 1632957369, "over_18": false, "upvotes": 4, "upvote_ratio": 0.84, "comments": {"fr7c1b6": {"link": "/r/CollegeMajors/comments/gmqvuq/would_it_be_wise_to_major_in_something_that_you/fr7c1b6/", "text": "Also, if you are looking for a career similar to engineering but don’t want to do the math, I recommend Industrial Design. I was in school for it this past semester, very fun and full of great people.\nMy professors described it as “engineering without the math,” it is a creative career that has a pretty good job outlook. Let me know if you’re interested, I would be happy to give you more detail.", "author": "holciamp", "created": 1589943927, "upvotes": 1}, "fr5xvzi": {"link": "/r/CollegeMajors/comments/gmqvuq/would_it_be_wise_to_major_in_something_that_you/fr5xvzi/", "text": "Here is my advice;\n\n• Start yourself off with a pros and cons list for the careers you are interested in\n• Determine your own personal skills and preferences for each\n• Take time to reflect on what you want out of life\n• Identify the things you need to work on whether it be personal changes or the education you look for\n• Research your options\n• Remember that things change constantly, take everything step by step and consider your options\n• Every piece of advice offered might not translate to you because you are your own person and you decide what you want\n• Criticism is important, it puts your decisions and experiences on a silver platter so you have the opportunity to improve or change \n\nThose fields require serious dedication, organization, good written and communication skills, and requires a lot of mental and emotional balance. Consider your current state of mind; are you happy with yourself? Do you find yourself bouncing back if something fails? If this doesn’t work out, do you have a backup plan?\n\nI recommend taking this time to learn more about the subject you want to pursue and do some serious research. I recommend looking at Youtube videos, here are some I quick searched that might help you out:\n\nWhat I wish I knew before becoming a math major- https://youtu.be/wk28BSaLszo\n\n4 reasons NOT to be a math major-\nhttps://youtu.be/Qo3uqaoXyxk\n\n4 reasons to be a math major- \nhttps://youtu.be/N6vNN52MTnw\n\nJobs you can get in Mathematics-\nhttps://youtu.be/zBCty_wGPRE\n\n“The skills students gain in STEM fields go beyond number crunching and technological innovation. \"Engineering degrees help students develop creative problem-solving techniques,\" says Jennifer Stephan, associate dean of undergraduate advising for the school of engineering at Tufts University in Massachusetts.”\n-https://www.usnews.com/education/best-colleges/articles/2017-10-24/determine-whether-a-stem-major-is-the-right-choice\n\nUltimately, If you think you have the motivation, determination, and passion to learn the many concepts, work yourself until you understand everything, and think you can handle the large workload that comes along with it, 𝗚𝗼 𝗳𝗼𝗿 𝗶𝘁.", "author": "holciamp", "created": 1589916498, "upvotes": 2}, "fr5cdwv": {"link": "/r/CollegeMajors/comments/gmqvuq/would_it_be_wise_to_major_in_something_that_you/fr5cdwv/", "text": "It will make you miserable and you might end up hating yourself because of it, choose something that your are good at and that you like. This will give a higher chance of success in that major/field.", "author": "mar7_photographer", "created": 1589906232, "upvotes": 3}, "fr57lsy": {"link": "/r/CollegeMajors/comments/gmqvuq/would_it_be_wise_to_major_in_something_that_you/fr57lsy/", "text": "All the subjects that you stated involve math.\n\nDo you like that?", "author": "vishthefish05", "created": 1589903904, "upvotes": 2}, "fr55d1j": {"link": "/r/CollegeMajors/comments/gmqvuq/would_it_be_wise_to_major_in_something_that_you/fr55d1j/", "text": "You might be miserable if you major in something you aren't good at or aren't interested in. Take classes and figure out what you like.", "author": null, "created": 1589902788, "upvotes": 5}}}