{"sid": "ig7nqu", "link": "/r/CollegeMajors/comments/ig7nqu/theatre_tech_nerd_but_still_wants_to_make_rent/", "title:": "Theatre + Tech Nerd, but still wants to make rent.", "text": "Hey y'all !! I'm a rising junior in HS, and getting super stressed about the future. I make pretty good grades (and maybe that's why I'm stressing out... too afraid of \"throwing my potential away\", even though I know that isn't possible) The way I explain myself to people is \"I love studying how people live\". \n\nHistory is fasciniating to me, but I really only care about the way people lived - I could care less about what's happening in WW1, but seeing how WW1 affected people and their lifestyles is fascinating.\n\nI'm also a huge arts person. Again, I love \"creating life\". Animatronics and puppets are fascinating to me, projecting human emotion onto an inanimate object and \\*feeling\\* things because of it is so super cool. Technical theatre as well - I have SM'ed for my school production and I absolutely love being a leader and a reliable figure for people. I'm also incredibly interested in fashion (A little bit of a punk myself !), specifically textile design, and again - emotion through art.\n\nThrough this, I discovered a love for American Sign Language !! I'm Hard of Hearing myself (not in a super impactful way, just enough to be a little annoying sometimes haha.) so I feel a strong connection with the Deaf community. I love how expressive the language can be, and definitely plan on becoming fluent, whether it's for a career or not. Plus, you don't need a degree in ASL/Deaf studies to become an interpreter, so I consider it a good \"Plan B\" since it's a fairly stable job even though I do have an incredible passion for it already.\n\nI also like science, but truly despise doing labs. I need specific instructions in order to function, and it just doesn't work out. And while I am technically good at math, I absolutely despise it.\n\nSo, the current careers I'm considering are Prop Master and ASL interpreter. I love incorporating life into art and art into life, and I love being useful to people, but I also love being able to afford food and medication. I guess my problem is that I'm \\*too\\* passionate, and I'm pursuing a career in the arts mostly because I'm a little afraid that if I don't major in it, it will disappear from my life. I'm not quite sure where to go from here.\n\nThank you so much for reading!", "author": "cody_flight", "created": 1598341401, "retrieved": 1632957803, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"g804uqo": {"link": "/r/CollegeMajors/comments/ig7nqu/theatre_tech_nerd_but_still_wants_to_make_rent/g804uqo/", "text": "Whatever college you pick, make sure it has a drama department or at least a drama club for you!\n\nYou seem very passionate about the animatronics. Reminds me of Jim Henson.  Read up on him/his life (after all, the inventor of the Muppets IS a piece of history!) and all of what he did to make his dreams come true and learn a bit from it that might help you.", "author": "peachpitafterdark", "created": 1602079586, "upvotes": 1}, "g2swuas": {"link": "/r/CollegeMajors/comments/ig7nqu/theatre_tech_nerd_but_still_wants_to_make_rent/g2swuas/", "text": "Check out an anthropology degree! Not really sure what you could do with it, but it's a cool major\n\nEdit: it's more than just \"studying old things\". I took a Plagues and People class in the anthropology department, and it was the most interesting class!", "author": "AceOfRhombus", "created": 1598365863, "upvotes": 1}, "g2s6748": {"link": "/r/CollegeMajors/comments/ig7nqu/theatre_tech_nerd_but_still_wants_to_make_rent/g2s6748/", "text": "Have you thought about sociology? It's the study of interactions with people, and it can open jobs with a master's such as social work, law, public policy, etc. And for the arts, you could consider animation, theater, or fashion/textiles. ASL usually requires a bachelor's degree, usually in deaf studies or something similar, but you can always look for certificates and associate's.", "author": "kaimamaster1315", "created": 1598345054, "upvotes": 1}, "g2s5wo2": {"link": "/r/CollegeMajors/comments/ig7nqu/theatre_tech_nerd_but_still_wants_to_make_rent/g2s5wo2/", "text": "As I've told someone else on here, having any bachelor's degree is enough to get plenty of jobs out there. I have a bachelor's in accounting and am not doing anything in accounting rn.", "author": "Cheran_Or_Bust", "created": 1598344737, "upvotes": 3}}}