{
  "sid": "pylu6t",
  "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/",
  "title:": "What should I do?",
  "text": "I'm 19 and trying to major in acting, photography, and writing, but my mother is at it again picking and choosing my interests for me saying I should do nursing and child care. I can't do those two things because they're too stressful for me to do. She thinks I'm an object and expects me to do what she wants but not what I want to do. What should I do?\n\n[View Poll](https://www.reddit.com/poll/pylu6t)",
  "author": "Majestic-Back-2334",
  "created": 1633014812,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hevki7c": {
      "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hevki7c/",
      "text": "If she is paying for college you should respect that and get a degree that will easily land you a good paying job. Don't go to 4 years of college to do something you think is fun. Do it to have a degree that will send you wherever you want to go in life. \n\nEven if you're taking out a loan. I would only look at Healthcare, accounting, engineering or any kind of STEM degrees. Those degrees will instantly land you high paying job right out of college. You may only have to do it for a few years before you can translate that experience to a different type of job that will pay you well for you experience. You could spend a year or more after college looking for a job with the kind of degrees you are wanting to pursue. You will still be able to persue your passion outside of work. \n\nIf you truly want to get into photography, as mentioned above. Just get a cheap car and a good camera and go create an amazing portfolio/Instagram/website.\n\nThere should be a \"listen to your mom\" option. You may not like it but she is right.",
      "author": "Spread_N_Spit",
      "created": 1633024231,
      "upvotes": 2,
      "replies": {
        "hevs1ad": {
          "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hevs1ad/",
          "text": "But, that's not fucking fair! I don't want to do healthcare. I don't wanna do accounting. I don't want engineering. AND I MOST CERTAINLY DO NOT WANT A FUCKING BITCH ASS STEM DEGREE!!!! I just want to become an actress so I can voice act and star movies & TV shows. I already have a love for movies and a big dream to be famous one day. I wanna get a job to take pictures and write stories and for probably write for newspapers too. Healthcare, accounting, engineering, and STEM are cool and all, but they're not what I wanna do because they ain't my thing. They aren't the things I chose to do nor what I want in life. And if you wanna torture me with the whole \"your mom is right, you should listen to her\", then maybe you should go fuck yourself 'cause I'm not gonna do this bullshit anymore with anyone who dares to try and raise me up with saying, \"you should do this and that\", type of shit. It is getting really annoying and it's pissing me off altogether. Like I said before, I don't wanna do Healthcare. I'm not interested accounting. Engineering is not what I want. And NEITHER IS STEM OR WHATEVER FUCKING BULLSHIT YOU THINK IS GREAT FOR ME!!!!! I SAID I WANT TO DO ACTING, PHOTOGRAPHY, AND FUCKING JOURNALISM!!!!! And if no one is going to listen to me about what I want to do, THEN I'LL JUST NOT GO TO COLLEGE NOR GET A DEGREE!!!! I'll stay at home all the time and rethink my life again to see what's next and find something new to do instead of going to a community college to waste my time.",
          "author": "Majestic-Back-2334",
          "created": 1633027389,
          "upvotes": -2,
          "replies": {
            "hevtobk": {
              "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hevtobk/",
              "text": "Life isn't fair. \n\nGood luck becoming famous hahaha, college will just hold you back. \n\nPeople say these things because guess what. They have been in the same place you are now. They wish they would've made a different decision. \n\nJudging by this response. You should stay at home with mommy and grow up a little more. But then again, if I was your mom I would not be able to wait till you moved out. Can't imagine how shitty her life must be having a little shit like you as a kid.",
              "author": "Spread_N_Spit",
              "created": 1633028061,
              "upvotes": 1,
              "replies": {
                "hf0vbrp": {
                  "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hf0vbrp/",
                  "text": "Or I can just go and planned what I've been wanting to do after high school because if you and anyone else, including my family, aren't gonna listen to me about what I want, then I can just make whatever I want happen and not seek approval from other people I will just waste my time, like I've always done asking people like you and folks, what to do with my life and it's really starting to irritate a lot right now. I heard the saying, \"Quitters never prosper\", before and I know it's supposed to mean the truth, but really, it means a lie because I'm quitting and that means I will quit because everyone doesn't agree with my decision and are just acting like assholes for no reason 'cause they don't wanna listen to me and just rather be rude instead of being polite and respectful of my choice.",
                  "author": "Majestic-Back-2334",
                  "created": 1633124281,
                  "upvotes": 0,
                  "replies": {
                    "hf0vnyh": {
                      "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hf0vnyh/",
                      "text": "You have so many issues. I don't even know where to start. \n\nYou say you're 19. You act like a 12 year old with a serious mental disability.",
                      "author": "Spread_N_Spit",
                      "created": 1633124444,
                      "upvotes": 1,
                      "replies": {
                        "hf6ahc2": {
                          "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hf6ahc2/",
                          "text": "10 reasons I act like a 12-year old with a serious handicap mental disability -\n\n1. I don't get what I want.\n\n2. I'm too sensitive. \n\n3. No one ever listens to me. \n\n4. I'm constantly jealous of what other people have that I don't. \n\n5. I am short-tempered. \n\n6. I have a very bad temper. \n\n7. I'm always seen as the bad guy. \n\n8. I don't get to follow my own path. \n\n9. People don't give me a break. \n\n10. My biggest dreams are being replaced with what my mom wants me to do and be.",
                          "author": "Majestic-Back-2334",
                          "created": 1633226808,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hevblj1": {
      "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hevblj1/",
      "text": "A triple-major in three disparate fields wouldn't be wise. You may be able to do an English major with a concentration in creative writing. A double-major in theater and English would likely be doable.",
      "author": "qwertyrdw",
      "created": 1633020578,
      "upvotes": 3,
      "replies": {
        "hevskma": {
          "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hevskma/",
          "text": "But, this is NOT FAIR!!!!! I'm 19-years motherfucking old and an adult now. Can't I just ever live my life and get out there so I can do so many stuff without doing thing my mother wants me to do? Like it's not your life. It's mine. Do you even know how much fucking stress I am under right now because I'm already dealing with too much bullshit? DO YOU FUCKING UNDERSTAND HOW I FEEL RIGHT NOW?!!!",
          "author": "Majestic-Back-2334",
          "created": 1633027610,
          "upvotes": -2,
          "replies": {
            "hevtwds": {
              "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hevtwds/",
              "text": "You think being 19 is stressful? \n\nWait till you have bills to pay and nothing but a photography degree.",
              "author": "Spread_N_Spit",
              "created": 1633028154,
              "upvotes": 3,
              "replies": {}
            },
            "hewz6bv": {
              "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hewz6bv/",
              "text": "I have some more bad news for you, then, there are going to be college subjects that you *have* to take to get a B.A. because any college or university has required courses in order to be a well-rounded student (and so the university can make more money per student). You can expect at least a quarter of your 120 credit program to be composed of these general required courses no matter your major/majors.\n\nI know all too well what it is like to be dealing with stress brought on by an overbearing parent; I attempted suicide several times. Very happy to still be here. It also took me over a decade to earn my B.A.",
              "author": "qwertyrdw",
              "created": 1633046838,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hev2emg": {
      "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hev2emg/",
      "text": "Have you considered waiting to declare a major until you take a few classes and narrow down your interests? \n\nAs someone who is now going back to college after 15 years, and as someone that went to college for a degree in photography at 20 years old, and then quit after several semesters when I realized I didn’t ACTUALLY need a degree to do anything in photography, don’t do it. By the time I quit, I’d wracked up a ton of student loan debt that haunted me for years until was I was able to pay them all off… so don’t major in photography. Take some classes in it, for sure! Even minor in it, but please don’t go into debt for a degree in photography. \n\nI was a photographer for several years before getting into a different business, and 99% of what I learned was not from my college experience. As a hobby now, it’s great, but I learned my lesson the hard way for sure, and it was an expensive lesson.",
      "author": "kateminus7",
      "created": 1633016789,
      "upvotes": 3,
      "replies": {
        "hevsywd": {
          "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hevsywd/",
          "text": "Or I can just not fucking go to college and just find something else to do instead because you seem to be wasting my time telling me bullshit I have no control over handling or dealing here.",
          "author": "Majestic-Back-2334",
          "created": 1633027771,
          "upvotes": -3,
          "replies": {
            "hevtqmk": {
              "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hevtqmk/",
              "text": "Wow you can use the F word. You're so cool.",
              "author": "Spread_N_Spit",
              "created": 1633028088,
              "upvotes": 4,
              "replies": {}
            },
            "hevtrvp": {
              "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hevtrvp/",
              "text": "You're right. It doesn't seem like college is the place for you right now. You don't seem to have a grasp on what you want to do, nor the problem-solving skills to handle the rigors of higher education. Or hell, go to college, do what you want. You're grown. You know what's best for you. Just don't complain when you're massively in debt and can't find a job that pays more than minimum wage. Yolo, right?",
              "author": "kateminus7",
              "created": 1633028103,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hew4qme": {
      "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hew4qme/",
      "text": "I was on the same boat as you. I felt pressured by family to take up nursing or anywhere in the medical feild. I thought like you. After spending many years of my life in school, I just wanted to be free. I wanted to work at a cafe and make my own money. I want to voice act and do all those kind of entertainment stuff. I was angry, and it sounds like you are too. And although it sounds like you feel more pressure from family about being in STEM and is burnt out, instead of ranting on Reddit, you should visit you college's counseling/wellness center to discuss your concerns with family and major. They can provide clarity and give you options.\nLike you said, YOU'RE AN ADULT. YOU CAN MAKE YOUR OWN CHOICES. But the choices you're making are emotional and lazy. You basically said that instead of pursuing what YOU DO WANT TO DO, you want to stay at home and DO NOTHING. You don't need your mother's approval to be tik-tok famous (which can lead to acting/making money) and go on YouTube to learn photography tips. You can even go on websites like Wattpad to get money from writing of you're good enough. You have the resources, but you're not using them because you're not opening your mind up to the possibilities and planning your future. You're hung up on your family's approval of you.\nTake different classes in community college and explore. Don't just take STEM classes cuz like you said, it's you're life. You have the FREEDOM TO EXPLORE YOUR INTERESTS.\nIf you really want to quit community college, THEN DO IT. AND GET A JOB AND DISCOVER WHAT YOU LIKE. Do you know what you need to get a job in photography? A high school degree. So you're all set to be an intern AND LEARN.\nYou should do what you want to do. What you feel passionate about. Your mom isn't right for pressuring you into this, but what you're doing isn't right either. You're feeding on the anxiety she gave you to justify your unwillingness to work for what you want. You have a choice and it's up to you to decide what to do, please remember that. I think you're putting too much pressure on yourself about the future. Life is not linear. Things change and go up and down, side to side. Just because you take classes in STEM doesn't mean you'll end up in STEM. You have your entire life to learn, explore, and live for yourself.",
      "author": "mangohairtie",
      "created": 1633032754,
      "upvotes": 3,
      "replies": {}
    },
    "hewcx1p": {
      "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hewcx1p/",
      "text": "Don’t major in child care/nursing if you already know those things are stressful for you. If you’re not interested in or good at those, you probably won’t do well with those degrees. Also, childcare usually doesn’t pay much.\n\nI don’t know anything about acting, but photography and writing (especially writing!) are both useful skills in well-known/respected careers, such as marketing. If your mom is just worried that you won’t be able to get a job, you might be able to appease her by taking a marketing class or two (maybe add a bit of web design/development, too) and doing a marketing internship. I got a digital marketing job with my English/creative writing degree, and a lot of my classmates also got into traditional marketing/PR/editing jobs. Plus, a couple of them have published books now! :) \n\nWhatever you major in, if you’re concerned about getting a job (or want to appease your mom), try to get some work experience through internships, your student newspaper, a relevant part-time job, and/or freelancing while you’re in school. That kind of thing usually matters more than your major anyway — and then you can study whatever you want!",
      "author": "Lily9879",
      "created": 1633036367,
      "upvotes": 1,
      "replies": {}
    },
    "hewcx5q": {
      "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hewcx5q/",
      "text": "I hate to be judgmental, but based on how you've responded to other's comments, you seem really immature. I'd recommend using either college or a job as a way to gain experience being an adult. You can decide on your major or career choices later.",
      "author": "itsmematthewc",
      "created": 1633036368,
      "upvotes": 1,
      "replies": {
        "hf6927d": {
          "link": "/r/CollegeMajors/comments/pylu6t/what_should_i_do/hf6927d/",
          "text": "The only reason I'm immature is because no one ever listens to what I say and what I wanna do. It is obnoxious and unbelievable. I'm trying to act like a mature adult and be grown up, but it always fades away when I'm being taken for as an idiot and complete coward who has no confidence here.",
          "author": "Majestic-Back-2334",
          "created": 1633226110,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634059534
}