{
  "sid": "n13dzo",
  "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/",
  "title:": "Hesitant about studying Computer Science",
  "text": "Hello everyone,\nI'm currently contemplating about studying CS. It is a field that really interests me from an academical and even business point of view. \nHowever, I know that many people who study CS. Everyone of them is really into PC hardware/software and gaming stuff, which I really don't care about. Am I overthinking this or is it actually preferable to have a certain flair / knowledge in aforementioned things ? Thanks in advance!",
  "author": "badassf1sh",
  "created": 1619699795,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "gwhnwqs": {
      "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwhnwqs/",
      "text": "I totally know what you're talking about, I feel kind of out of place in some of my CS classes surrounded by all of these gamers, lol. But honestly, it doesn't matter. CS is about logic, problem solving, and building things. If that appeals to you, I would recommend studying it, regardless of whether you're into PC/hardware stuff.",
      "author": "BetUrProcrastinating",
      "created": 1619829581,
      "upvotes": 1,
      "replies": {}
    },
    "gwbt7t6": {
      "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwbt7t6/",
      "text": "CS has very little to do with hardware or gaming. If you like logical thinking and puzzle solving, then u will enjoy CS classes in undergrad. I don’t have as much knowledge about what software engineers do in industry.",
      "author": "quasar_1618",
      "created": 1619721023,
      "upvotes": 2,
      "replies": {}
    },
    "gwaryr4": {
      "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwaryr4/",
      "text": "You dont have to fit that profile, all that's important is you have solid interest in it and are willing to make that materialize into more than just interest",
      "author": "silenca",
      "created": 1619706134,
      "upvotes": 1,
      "replies": {}
    },
    "gwaiott": {
      "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwaiott/",
      "text": "I got into programming because I wanted to change how my blog looked. Tech has incredibly diverse options and you can end up working in almost any field with a CS degree :)",
      "author": "Scene_Usual",
      "created": 1619701717,
      "upvotes": 2,
      "replies": {
        "gwaje1g": {
          "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwaje1g/",
          "text": "It was something similar for me as well. I have a banking background and one time I helped out rebuilding our website, that's how I got interested in studying CS eventually.",
          "author": "badassf1sh",
          "created": 1619702076,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gwahoey": {
      "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwahoey/",
      "text": "It doesn’t have to do anything with pc hard ware and gaming. On a average work day you will code from 2-6 hours depending on your role and company. Apple you work longer but most companies fall between those numbers. And the higher the role the more business meeting and stuff and the less coding. If you can focus doing work at a computer desk for a couple hours then you fine. Look up some day in the life videos of working and studying cs. Also remember it’s very math oriented. Also what college are you planning on going too, t10 or a t100. You can ask me any questions if you want.",
      "author": "ChurninPark",
      "created": 1619701185,
      "upvotes": 1,
      "replies": {
        "gwajyki": {
          "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwajyki/",
          "text": "As I already have working experience, I'm not really bothered about how my average work will look like after I graduate; not to say that I don't care about what I'll be doing afterwards, but I understand that there are a lot of possibilities and career paths. What I'm more worried about, is whether I'm cut out for studying CS in Uni (T10)",
          "author": "badassf1sh",
          "created": 1619702365,
          "upvotes": 1,
          "replies": {
            "gwakg7y": {
              "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwakg7y/",
              "text": "My opinion, if your smart enough to get accepted into a t10 then you can handle Cs. As long as you like math and science and are good at both then I don’t think you’ll struggle a lot. The average gpa for cs is like a 2.8-3 so it’s going to be hard but if you like it then it’s worth it, especially from a t10.",
              "author": "ChurninPark",
              "created": 1619702611,
              "upvotes": 1,
              "replies": {
                "gwapwxl": {
                  "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwapwxl/",
                  "text": "College ranking will not matter 2 years into your CS degree.",
                  "author": "Acrocane",
                  "created": 1619705208,
                  "upvotes": 1,
                  "replies": {
                    "gwauw6z": {
                      "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwauw6z/",
                      "text": "Yeah it will, your last two years are when most people do there internships and a good school helps you get a internship at a fang company.",
                      "author": "ChurninPark",
                      "created": 1619707406,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gwah42d": {
      "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwah42d/",
      "text": "What aspects of CS are you actually interested in?",
      "author": "Acrocane",
      "created": 1619700885,
      "upvotes": 1,
      "replies": {
        "gwaj5wh": {
          "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwaj5wh/",
          "text": "What I found to be interesting was Theoretical Computer Science and Business related applications.",
          "author": "badassf1sh",
          "created": 1619701963,
          "upvotes": 1,
          "replies": {
            "gwaqfep": {
              "link": "/r/CollegeMajors/comments/n13dzo/hesitant_about_studying_computer_science/gwaqfep/",
              "text": "Definitely look into business analytics or IT if you want more practical applications of CS. A good deal of schools may also offer business with a concentration in something like information analytics or systems. Not sure about the theoretical stuff but sounds like something for a PhD route.",
              "author": "Acrocane",
              "created": 1619705445,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634059562
}