{"sid": "icz1i8", "link": "/r/CollegeMajors/comments/icz1i8/idk_what_to_major_in_because_i_have_no_interests/", "title:": "idk what to major in because i have no interests and i'm bad at math", "text": "ok i'm a senior in highschool and have no interests like at all. I'm not that good at math or science so I don't want to major in something that involves those two things which is kind of hard to do but I also am not the biggest fan of business so I don't want to go into that field either. I am taking a sociology class at the moment but both of my parents and counselors have told me that its hard to find a good paying job with a sociology degree, i also have wanted to try out some computer programming classes because that does seem like something I might like but I would have to do something that doesn't involve like hard math. So i have no clue what to choose :) pls help", "author": "jaglory", "created": 1597879738, "retrieved": 1632956791, "over_18": false, "upvotes": 9, "upvote_ratio": 1.0, "comments": {"g39iy1u": {"link": "/r/CollegeMajors/comments/icz1i8/idk_what_to_major_in_because_i_have_no_interests/g39iy1u/", "text": "comp sci seems like it good be a good fit for you. The major does normally require some math (discrete math, a calc class, maybe Lin algebra, maybe stats...), but many software development jobs require very little math in them. IT could be another choice, which I think has some programming in it, but is overall more on the administration side of tech, and more about integrating technology into businesses' needs. It also requires less math than com sci.", "author": "BetUrProcrastinating", "created": 1598724273, "upvotes": 1}, "g27gws2": {"link": "/r/CollegeMajors/comments/icz1i8/idk_what_to_major_in_because_i_have_no_interests/g27gws2/", "text": "You could be an education major.", "author": null, "created": 1597927254, "upvotes": 1}, "g25q6xs": {"link": "/r/CollegeMajors/comments/icz1i8/idk_what_to_major_in_because_i_have_no_interests/g25q6xs/", "text": "Information Systems involves a lot of programming, but usually incorporates business math instead of computer science math (stats & finance vs. calculus).", "author": "infjetson", "created": 1597880782, "upvotes": 3}}}