{"sid": "h8jk4a", "link": "/r/CollegeMajors/comments/h8jk4a/currently_an_english_major_but_considering_a/", "title:": "Currently an English major, but considering a change. Help??", "text": "After graduation I plan to teach English abroad, most countries only require you to have a BA in something, they don't really care what. English is a lot of theories and discussing literature. I like to read as much as the next guy, but I hate theories, so boring. I like to write, create stories, much more into writing songs, plays, etc. I thought about switching to Educational Studies because that could lead to a teaching path. And I feel like 20 or so years in the future, I either see myself working in Television, like as a writer/producer type job, or running one of the Korean style study rooms (because I love the idea of them and more places should have them). I can see how English or Education could fit into these ideas. What do you all think? Stay English major, or switch to Education, or something else??", "author": "kbsths99", "created": 1592094966, "retrieved": 1632847677, "over_18": false, "upvotes": 2, "upvote_ratio": 0.75, "comments": {"furlyzt": {"link": "/r/CollegeMajors/comments/h8jk4a/currently_an_english_major_but_considering_a/furlyzt/", "text": "\\-English major won't qualify you to teach as you need a certain amount of student teaching hours to be qualified. \n\n\\- \"I like to write, create stories, much more into writing songs, plays, etc.\" Sounds more like a theatre program as outside of maybe a couple creative writing electives this won't ever happen through your regular curriculum. \n\n\\- Writing stories/songs/plays is also a hobby not a career, a major in English won't change this fact.\n\n\\- \"I feel like 20 or so years in the future, I either see myself working in Television, like as a writer/producer type job.\" This would require a long career in television/journalism, if you don't plan to do any internships or work studies in the immediate future involving this line of work then this is a pipe dream at best. \n\n\\- \" Running one of the Korean style study rooms.\" I hope you have family that live in South Korea, strong connections with people that live in the country, and have at least a C1 level of mastery of Korean for the CEFR exam to even be considered in a pool of a thousand applicants all applying for the same job.\n\n\\- Regardless of your choice (English or Teaching) I hope you are prepared for at a minimum to get a master's degree to make your chosen career path economically viable.", "author": "Reav101", "created": 1592104596, "upvotes": 1}}}