{
  "sid": "q6z0j0",
  "link": "/r/CollegeMajors/comments/q6z0j0/should_i_major_in_business_or_psychology/",
  "title:": "should I major in business or psychology?",
  "text": "I'm gonna be completely honest\n\nso rn I'm a business admin major BUT I've been thinking of switching over to psyc\n\nbut at the same time I'm doing good in and do like my classes so far soo ahh idk\n\nTbh/ I seriously just want to become rich and have job security and a stable income but I want to enjoy my work too and have good work/life balance \n\nany advice?",
  "author": "kashmiri-chai",
  "created": 1634083361,
  "updated": 1636189603,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgf7fgw": {
      "link": "/r/CollegeMajors/comments/q6z0j0/should_i_major_in_business_or_psychology/hgf7fgw/",
      "text": "It depends on what your career goal is. But I would say having a psychology background would be helpful in business and not much vice versa.",
      "author": "Disastrous_Fig_3762",
      "created": 1634083945,
      "upvotes": 1,
      "replies": {}
    },
    "hgi91dl": {
      "link": "/r/CollegeMajors/comments/q6z0j0/should_i_major_in_business_or_psychology/hgi91dl/",
      "text": "If you just want to be rich, you’re probably better off in business (especially a finance concentration) or maybe computer science. Psychology isn’t known for leading to super high-salary jobs unless you go on to med school or the right type of grad school (and even then, you’ll have lots of loans to pay off before you can truly build wealth). You can get a decent job with any major if you do the right extracurriculars and at least one career-related internship, but that doesn’t necessarily mean “rich” — although IDK what you consider rich.",
      "author": "Lily9879",
      "created": 1634145815,
      "upvotes": 1,
      "replies": {}
    },
    "hh63ecg": {
      "link": "/r/CollegeMajors/comments/q6z0j0/should_i_major_in_business_or_psychology/hh63ecg/",
      "text": "Neither a psych nor business major are especially good financial prospects.",
      "author": "42gauge",
      "created": 1634599432,
      "upvotes": 1,
      "replies": {}
    }
  }
}