{"sid": "ldfxzr", "link": "/r/CollegeMajors/comments/ldfxzr/to_physical_therapy_assistant_or_not_to_pta/", "title:": "TO PHYSICAL THERAPY ASSISTANT OR NOT TO PTA?", "text": "Hey, it's been a few years since I've been to college; I had to drop out for family reasons, but the time as come for me to go back. I, in the long term, want to own a wellness center: combine the physical wellness (Physical Therapy, personal training, etc) with mental wellness (psychotherapy, psychiatry, therapy). I believe the two are so fundamentally linked that to pursue the wellness of the mind, one must work the body and vice versa.\n\nI took a few psychology classes when I was going for my undergraduate as a SPED teacher, and I loved it a lot. Now, I'm pondering what is the best route for achieving this goal? I want to go back to school and get a certificate within the next year or two just so I can make some money and go back to school again. I am currently unemployed because of COVID, but will do something menial until I achieve the completion of such a certificate.\n\nIf someone can explain to me the pros and cons of PT/PTA work, what the best route for wanting pursue this full mind, body, wellness institute is. I know I need many certifications, but I'm not sure if PTA is the right way to go now or complete something else while trying to make money until I can go back to school.\n\nThis is my first reddit post. If I'm in the wrong sub, please direct me to the right place. Thank you!\n\n&#x200B;\n\nCross posted, just in case.", "author": "kristinmabbott", "created": 1612555536, "retrieved": 1632957264, "over_18": false, "upvotes": 5, "upvote_ratio": 1.0, "comments": {"gzpszyz": {"link": "/r/CollegeMajors/comments/ldfxzr/to_physical_therapy_assistant_or_not_to_pta/gzpszyz/", "text": "Current PTA here..piece of advice go to cheapest school that you can go into if you decide to go into physical therapy. As long as you pass boards no employer will care where you went to school and you will be happy with your ROI. If you have any specific questions fire away ... I’ll try to help best I can.", "author": "nyudiego", "created": 1622171475, "upvotes": 1}}}