{"sid": "pwttlx", "link": "/r/CollegeMajors/comments/pwttlx/should_i_switch_from_chemistry_to_biochemistry/", "title:": "Should I switch from Chemistry to Biochemistry?", "text": "Currently on a general chemistry cirriculum. Going into college, I had no clue what I wanted to do. I knew I wanted to get into some kind of science major, and I decided on Chemistry because it was the one I was best at. That, and I derive great pleasure from being surrounded by and working with strange chemicals. There's also something amazing about learning the fundamentals of how matter is put together. \n \nMy goal is research. What kind of research? Not really sure. I can't say there's a specific field in chemistry that I'd like to get into. I really just like playing with chemicals. At first, I figured I might put my meager efforts towards the most pressing matter that humanity is facing, global warming. But the fight against global warming seems to be mainly on the engineering front, and it's a bit too late to switch majors to ChemE. \n \nAlternatively, I've always been interested in genetics. Learning about how the source code of life works, and figuring out how to edit it sounds like an incredible frontier to get into. Switching to biochem at this point would be relatively painless. I would only need to take a couple of additional labs and I would be on track. Though I haven't actually had the opportunity to take a Biochem class yet, so I don't know how well I'll take to it. \n \nIn terms of courses, I'm much more interested in taking the higher level Chem courses than I am Biochem (higher level Biochem courses are biology based, and I'm not a huge fan of biology classes). But research in the biochemistry department at my school is much more interesting to me than research in the chemistry department. \n \nSo I have a handful of questions. If I graduate with a chemistry degree, would I be able to go to grad school for biochemistry if I choose? Does either degree have better job prospects/pay than the other? Does anyone have a personal opinion on Biochem vs Chem? \n \nThanks in advance", "author": "VeXedZenith", "created": 1632786843, "retrieved": 1632846493, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"helxxx5": {"link": "/r/CollegeMajors/comments/pwttlx/should_i_switch_from_chemistry_to_biochemistry/helxxx5/", "text": "I feel like posting this on r/Chemistry and or r/Biochemistry would be much more useful to you", "author": "jvst_joshin", "created": 1632844850, "upvotes": 1}}}