{"sid": "b4xwhl", "link": "/r/CollegeMajors/comments/b4xwhl/going_into_university_soon_and_still_have_no_idea/", "title:": "Going into university soon and still have no idea what I want to do as a career or even what to Major in. Love all subjects.", "text": "I love English and literary analysis, but I also love science and math because I excel in them so easily and science is just super interesting. I also adore history and social sciences. Lately I’ve been considering a political science or philosophy major but it seems like there’s limited career options with that. I decided on civil engineering for a while, but I also love English and would want that to be involved in my career in a sense that isn’t solely for the use of communication and proposals and such. I just don’t quite know what to do. It’s a common strategy to think of your favorite subjects at school and go from there, but they’re all my favorite subjects so I really don’t know what to do. I used to be all STEM until I realized I don’t completely suck at English, it’s only more challenging. I guess I’m asking for some guidance or to know if anyone else relates to my situation and what they’ve done. P.s. I have no passion for a certain subject or career. And I have some idea of the things I do not like. ", "author": "LJenni", "created": 1553443176, "retrieved": 1632956986, "over_18": false, "upvotes": 5, "upvote_ratio": 0.86, "comments": {"ekkw4cb": {"link": "/r/CollegeMajors/comments/b4xwhl/going_into_university_soon_and_still_have_no_idea/ekkw4cb/", "text": "please give this episode a listen 😊🤞🏼 https://soundcloud.com/inunisonpodcast/finally/s-FWpxI hopefully it helps.", "author": "aarti_ha", "created": 1554931601, "upvotes": 1}, "ej9wtkv": {"link": "/r/CollegeMajors/comments/b4xwhl/going_into_university_soon_and_still_have_no_idea/ej9wtkv/", "text": "Are you going to be a college freshman? If so, it’s alright to not be 100% on a career goal or path. The fact that you’ve looked into it already is honestly more than I ever did, which is the case for a lot of people. \n\nYour first year or two essentially has you taking basic classes to fulfill the education requirements of your state, so you’ll have to take social science courses, science courses, English courses, etc. These are your gen eds, and while a lot of people view them as a chore, they’re quite useful in determining your major. You basically get free reign over what classes you utilize for them, so it would be a good idea to fill them with classes that you’re interested in major wise to test the waters and see if you enjoy them. Then, reflect on which area you were invested in most,  and go from there. \n\nOn top of that, keep researching majors and careers, and try to start narrowing down your major pool. A good place to start is with majors at your University that you don’t want to take, as they’re easier to identify. \n\nIf you still have trouble after that, then there’s usually academic advisors who can help you figure out the right area for you via short tests and questionnaires.  \n\n", "author": "The_Max_Rebo", "created": 1553445153, "upvotes": 1}}}