{"sid": "k0in1l", "link": "/r/CollegeMajors/comments/k0in1l/what_should_i_do/", "title:": "What should I do?", "text": "I have no intrests and No real hobbies. So I was wondering, what do i do? I need to go to college and get a degree, but i dont know in what. I've completed a good amount of pre res and the time has come to pick a major but I have no idea. Any tips?", "author": "lilbeans23", "created": 1606268744, "retrieved": 1632957596, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"geg37p1": {"link": "/r/CollegeMajors/comments/k0in1l/what_should_i_do/geg37p1/", "text": "First, no you don’t need to go to college and get a degree.  There are a great many productive things you can do in your life with trade or apprenticeship training.  Many of them pay better than many college educated people get paid.  College is expensive, so you should really only pay for it if is necessary for the type of work you want to do.\n\nRather than look for a major, ask yourself where you want to contribute to society.  You are going to do something (that is what a job is, they pay you for it because it adds value to somebody).  If you could choose how to contribute, what way would you choose?\n\nNext, there is a lot to be said for doing something that you are good at.  The act of doing it and doing it well is intrinsically rewarding and your interest and desire to do it will grow over time.  What are you good at?  Writing, math, understanding people, working with your hands, fixing things, planning, organizing things?  Even if you are merely sort of good at something, you will get better at it by doing.  Where are your weaknesses?  What do these suggest about possible jobs you would like to do?\n\nIf this still doesn’t help, and if you are confident that your path runs through college work off of a short list of professional degrees.  This limits your decision set considerably.  It is easier to choose between 3 or 4 things than it is to choose among hundreds.  The professional degrees tend to have ready job markets for their graduates, as they are trained to do a particular type of work.  Business is probably the ultimate generic professional degree.  There are many different types of specializations in business that could potentially interest you, but the degree itself is applicable across all industries in some capacity.  Engineering is good if you have strong math skills and like working with things more than people.  Usually, however, engineers know they want to be engineers from a pretty early age, so I suspect that this is not you.  Other professions include but are not limited to medicine (nursing, MD, dentistry, physical therapy etc.) and law (paralegal and attorney).\n\nIf you truly have no hobbies and no interests, then you really need to get out in the world and do some things.  I am concerned for your mental health, especially if you are under COVID lockdown.  Please try to engage in the world somehow.  Volunteer somewhere, join a club on campus, start a blog, build something, learn to cook (and cook for or with a friend), something...  \n\nI hope you find your path and find yourself along the way.", "author": "dmstew", "created": 1606963090, "upvotes": 2}, "gdsvg69": {"link": "/r/CollegeMajors/comments/k0in1l/what_should_i_do/gdsvg69/", "text": "if you honestly dont have an interest in anything be logical about it look at what you're good at and what makes money and if you're not good at anything pick something you won't hate and something you're not horrible at .", "author": "Stillmangang", "created": 1606510941, "upvotes": 1}, "gdie9rh": {"link": "/r/CollegeMajors/comments/k0in1l/what_should_i_do/gdie9rh/", "text": "Aye, when you were completing prerequisite classes, were there any that stood out to you/that you excelled in? I would use your prerequisite classes as a tool to help you gauge your interests.", "author": "muchagracias", "created": 1606269914, "upvotes": 1}}}