{"sid": "nbsv34", "link": "/r/CollegeMajors/comments/nbsv34/what_business_major_should_i_pick/", "title:": "What business major should I pick?", "text": "I'm an incoming penultimate and have to choose a business major (am pursuing a business degree). To keep it short, I have learnt nothing much from the past 2 years. I'm someone who learns /EXTREMELY/ well on my own, and have never enjoyed the spreadout lecture/project/assignment format. \n\nI can choose a business major, or no major at all (general degree). Both options require me to take the same amount of modules, so there's no advantage in having no major.\n\nI'm torn between finance and marketing. Honestly, I'm not very interested in finance (don't think I can stand another 2 years with those finance hardo people) and I struggle with keeping up finance grades in the uni format due to how competitive it is (love reading about finance by myself). Marketing, however, is an \"easy\" major, but I'm afraid it will limit my career choices. I am interested in design and am building up my own UX/UI portfolio now.\n\nI'm not interested in taking up another major as I have to take additional courses + I don't want to delay graduation for academic purposes. Thoughts?", "author": "blitzmixer", "created": 1620943962, "retrieved": 1632956860, "over_18": false, "upvotes": 8, "upvote_ratio": 1.0, "comments": {"gyjc3h7": {"link": "/r/CollegeMajors/comments/nbsv34/what_business_major_should_i_pick/gyjc3h7/", "text": "Marketing is similar to a psychology degree in that it is very general. Can be useful in a variety of ways, but you need to stand out as an individual for it to carry serious weight past having a degree. Since you're independently driven, if you're looking towards marketing, having experience actually marketing (social media pages, being a brand ambassador, etc.) will go a long with in tandem with your degree.\n\n&#x200B;\n\nOn the finance side, you will have a great chance of landing a job post graduation, so long as you can tolerate those 'finance hardo people', as you call them. It can also be useful in charity fields, which has their own personal benefit of working at.\n\n&#x200B;\n\nYou seem to be more interested in marketing overall, so I'd reccomend it.", "author": "OtherwiseNoteWorthy", "created": 1621315732, "upvotes": 2}, "gy6fcoa": {"link": "/r/CollegeMajors/comments/nbsv34/what_business_major_should_i_pick/gy6fcoa/", "text": "Personally I don't think taking marketing would limit your options too much. I've been doing a some window shopping for jobs online and a lot of them say Bachelor's required but that doesn't necessarily mean it has to be specialized or for a specific field. I know a lot of people that have degrees that aren't actually using them in their job. For one, my cousin has a degree in Special Ed but she works at a law firm.", "author": "himonobi", "created": 1621049278, "upvotes": 2}, "gy3ry8g": {"link": "/r/CollegeMajors/comments/nbsv34/what_business_major_should_i_pick/gy3ry8g/", "text": "Do your research and weigh your options.", "author": "vavonni159", "created": 1621003192, "upvotes": 1}, "gy179p7": {"link": "/r/CollegeMajors/comments/nbsv34/what_business_major_should_i_pick/gy179p7/", "text": "Go with marketing", "author": "yellochoco44", "created": 1620944844, "upvotes": 5}}}