{"sid": "ahpq7a", "link": "/r/CollegeMajors/comments/ahpq7a/bs_business_admin_vs_ba_business_admin/", "title:": "B.S. Business Admin vs. B.A. Business Admin", "text": "Is there a big difference in terms of quality/career outlook between a B.S. and a B.A. in this subject? What concentrations should I look for, and which should I avoid?\n\nI'm looking to transfer to a four year school after I get my A.S. in Business after the spring 2019 semester. My local state college offers a B.A., would it be worth it to pay more and drive a bit further to go to my (more prestigious) state university and get a B.S.? \n\n\nWhat if I'm looking to get a master's afterwards?", "author": null, "created": 1547928724, "retrieved": 1632957521, "over_18": false, "upvotes": 5, "upvote_ratio": 1.0, "comments": {"eety56j": {"link": "/r/CollegeMajors/comments/ahpq7a/bs_business_admin_vs_ba_business_admin/eety56j/", "text": "Neither unless you go to a top 10-15 School.  \"Accounting or MIS?\" is the proper question. No one is going to hire a state school kid with a management degree. You may be in luck if you want to do insurance sales or become a personal banker \n", "author": null, "created": 1548318649, "upvotes": 2}, "een9vzk": {"link": "/r/CollegeMajors/comments/ahpq7a/bs_business_admin_vs_ba_business_admin/een9vzk/", "text": "Although I’m not knowledgeable in the nuances of Business Admin majors, either one will work for Graduate school. You honestly don’t even need a business oriented degree to gain admission to an MBA program, and many people take this opportunity to change their fields. Just be sure to obtain a very solid GPA in the bachelors you choose, as that matters more than if it’s a BS or BA. Most people say 3.0+ for most Graduate programs, 3.5+ for selective ones.\n\nThat being said, there’s usually not a whole lot of difference between a BA and a BS in the same field. There certainly can be differences, such as the gen ed requirements and other extra classes, but they should all have the same core courses. They are from different schools however, so they may have more difference than I’ve mentioned, so be sure to compare the course requirements between them. \n\nNow, the BS may give you a slightly better impression to employers, but if your goals are graduate school, it doesn’t matter too much if it’s a BA or a BS. I’d personally go with the degree that you feel more comfortable with course wise, as your GPA is king for graduate programs. \n\nYou mentioned that the BS will cost more, so it’s important to know how much more. Graduate school can be very expensive, so I wouldn’t break the bank for your bachelors if it’s just for the Science title instead of Arts. \n\n", "author": "The_Max_Rebo", "created": 1548107112, "upvotes": 4}}}