{"sid": "prfyyi", "link": "/r/CollegeMajors/comments/prfyyi/how_do_i_find_a_major/", "title:": "How do I find a major?", "text": "Currently, I’m in community college and struggling to choose a degree. I thought about a stem major such as computer science, but I’m taking a basic math course right now and struggling, and I also hate math with a passion. I’m not skilled in art, and law does not appeal to me. How do I search for a major and a career that I won’t have a hard time graduating with?", "author": "OdeToSnapshoot", "created": 1632083827, "retrieved": 1632956750, "over_18": false, "upvotes": 9, "upvote_ratio": 0.92, "comments": {"hdj9spx": {"link": "/r/CollegeMajors/comments/prfyyi/how_do_i_find_a_major/hdj9spx/", "text": "Ken Coleman has a guide on his website about getting clear on your career and goals and how to work towards that. Get qualified for the job you want!", "author": "treeless-plain", "created": 1632099346, "upvotes": 1}, "hdiwk70": {"link": "/r/CollegeMajors/comments/prfyyi/how_do_i_find_a_major/hdiwk70/", "text": "Research on the career trajectory you find most sustainable for you to last in, after check what courses your college offers (or other colleges/unis you might deem fit for you), and see if you think any specific degree matches those sustainability standard", "author": "luffyismysunshineboi", "created": 1632093062, "upvotes": 2}, "hdioire": {"link": "/r/CollegeMajors/comments/prfyyi/how_do_i_find_a_major/hdioire/", "text": "A bachelors in information technology is a great degree with many career opportunities and the salary is not that bad. At least in my university it requires only 2 math courses the 2 math courses are computational statistics and the other is college algebra. And only 2 science courses .", "author": "OpinionatorOnThings", "created": 1632089484, "upvotes": 3}, "hdic7lo": {"link": "/r/CollegeMajors/comments/prfyyi/how_do_i_find_a_major/hdic7lo/", "text": "Zach Star on YouTube has lots of great videos about individual stem majors & how to get started with them! I watched him a lot 3 years ago when I was deciding what major to go into. Math is tough for a lot of people (including myself) and it’s normal for it to not come naturally as other topics. If you’re really interested in computer science I’d say look more into it & stick with the math! Once you develop the habit and skill of problem solving that comes with math, the rest of your future courses (other programming courses, future math classes) will seem more manageable. Good luck lmk if you have other questions", "author": "matteophysics", "created": 1632084211, "upvotes": 7}}}