{
  "sid": "gro7bc",
  "link": "/r/CollegeMajors/comments/gro7bc/i_need_help_cs_or_finance/",
  "title:": "I need help! CS or Finance",
  "text": "So for a lil background I’ve had my fair share of major changes between chemistry and biology focused majors. I’ve decided that it’s just not for me. I will always love science, but I don’t want it be my career. \n\nI’ve done a lot of research on other majors and I’ve limited it down to Computer Science and Finance. I like both the career outlooks for these majors. I can complete both by only adding an extra semester, and overall I’d like either. \n\nI’m really bad at deciding, and I thought I’d see if anyone could offer more clarity or even provide another major option that would have both or still be in the wheelhouse. \n\nThanks to all who comment!",
  "author": "lyndsmah",
  "created": 1590600740,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "fs1h0vb": {
      "link": "/r/CollegeMajors/comments/gro7bc/i_need_help_cs_or_finance/fs1h0vb/",
      "text": "seconding what the guy below me said. They are very different career paths, and its hard to recommend one if you don't have experience in either. Can't speak for finance, but computer science is a good major if you like project based work, and if you like problem solving. downsides are that it requires a bunch of outside work to get jobs (projects, learning frameworks/languages, studying for internships). take classes in both to start with, that will probably help narrow down what you're interested in.",
      "author": "BetUrProcrastinating",
      "created": 1590628067,
      "upvotes": 1,
      "replies": {}
    },
    "fs0fzb7": {
      "link": "/r/CollegeMajors/comments/gro7bc/i_need_help_cs_or_finance/fs0fzb7/",
      "text": "Idk much about finance, but I was a math major and I switched to CS. CS is very interesting and difficult. There are a shit load of opportunities and it seems its currently booming. Idk how long this will last. The jobs pay a bunch.\n\nCS people are pretty strange which is my main complaint. It's a dick measuring contest between arrogant anti-social assholes hahah. Idk if finance is very different. The pay is solid and it ramps up a bunch after 2-3 years. Silicon Valley, New York, Seattle, Colorado, or Austin are places you would likely end up in the US.\n\nI think it's a solid career and has provided me with lots of job opportunities. Lots of projects get destroyed which can ruin your excitement.\n\nSomeone once told me \"working in software is like parts come in and you spend 15 minutes putting it together, then your boss takes what you built and hands you $50. Then a new parts come in and the process repeats. Eventually you find out your boss takes the product into the next room and smashes it with a hammer. He continues to pay you. How long do you continue?\". He told me this while we were working on the same team, that was 5 years ago and as of today everything we worked on over the last 6.5 years has been destroyed... but we got paid well in the process hahah.",
      "author": "travishummel",
      "created": 1590608955,
      "upvotes": 3,
      "replies": {}
    },
    "frzzcg1": {
      "link": "/r/CollegeMajors/comments/gro7bc/i_need_help_cs_or_finance/frzzcg1/",
      "text": "It seems you decide on these based on career outlooks but these two careers are vastly different. Do you enjoy coding and solving problems ? Or do you enjoy working with numbers, model,...etc.? Am not sure about finance but with computer science, it requires a lot of patience and has an initial learning curve. I would recommend you take an intro class in both and decide for yourself / try an online Intro to Python class and intro to finance on Coursera / Udemy.",
      "author": "withaining",
      "created": 1590600988,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634060158
}