{"sid": "krf8bq", "link": "/r/CollegeMajors/comments/krf8bq/which_major_should_i_choose/", "title:": "which major should i choose", "text": "I am a senior in high school and here in Brazil (where i live) you need to apply for the major you want. \nSo the thing is, i already did a bunch of tests on the internet, i searched into my personality: infp 9 enneagram, and i even did those tests that analyzes your intelligences (i got high intelligence at communications and music) but i still dont know what i should do. I would love to be a college professor and write books about my researchers, and i really want to write my own fictional book, i also want to travel the world and idk maybe work with social media\nRight now i am considering international relations ( it really annoys me office works sometimes, i would hate my life if i worked in some place like the show the office seems like, but like idk how it is in real life, and i would have more chance of becoming rich, which is something really important to me, and than maybe someday i could teach people on that field, like being a college professor), psychology ( i dont really want to work with anything unless research, but i like the day to day of a therapist, but i dont like seeing people crying) and communications like journalism, midia studies or book publisher (idk i dont feel like i would get any money working with this, and idk if i could become a college professor after but it just seems so cool to be a journalist or a book publisher) \nAt the end of the day I really dont know what i should do, i want to have as much freedom as possible at work, and i want to work in a big city and get away from my hometown, but i am so afraid of all that changes, and i dont know how hard it is to get a job. Idk i think i have some options though, like i could get a undergrad in psychology, masters in communications and phd  on psychology, or i could try and apply for colleges outside my country and get a double major on psychology and communications (maybe a minor in english), or i should just go with international relations or law and work with environmental issues \nWhat do u think i should do?", "author": "Technical-Age-4389", "created": 1609903663, "retrieved": 1632847069, "over_18": false, "upvotes": 2, "upvote_ratio": 0.76, "comments": {"gi9y10d": {"link": "/r/CollegeMajors/comments/krf8bq/which_major_should_i_choose/gi9y10d/", "text": "https://youtu.be/AkZw8KOLWKI \n\nCheck out this video to help decide", "author": "yellochoco44", "created": 1609912186, "upvotes": 1}}}