{
  "sid": "pv4gp6",
  "link": "/r/CollegeMajors/comments/pv4gp6/went_with_a_safe_major_that_i_wasnt_super_fond_of/",
  "title:": "Went with a \"safe\" major that I wasn't super fond of, now its seriously affecting my mental health. Not sure what to do",
  "text": "(I already made a post about this on r/findapath buy realised I maybe should have posted here first):\n\nI'm in my second year of college studying CS. CS isn't the major I actually wanted to go with when I came to college, I only picked it because the one I was actually interested in is a \"useless degree.\" \n\nI'm rly trying to just suck it up and get through CS. But my mental health is deteriorating. My entry programming class is killing me man  I'm getting a lot of anxiety attacks, I've started skipping meals, got insomnia, always acting weird and impulsive around folks, my friends even stepped in and made me start therapy. \n\nI went into CS because it's stable and flexible and a responsible degree to pick. I hate myself for letting my mental health get in the way of me and my degree. \n\nI'm thinking about taking this semester off college to ease the anxiety, but I'm not sure what to do. I want to make a responsible decision, and I feel like I *should* be in college at all times. \n\nAnd I don't even know what I'd pick besides CS when I went back. I don't want to pick a \"useless degree\" but I don't want to go into engineering or accounting either... I'm just so lost.  \n\nI dunno if anyone here can provide any insight. I'm just kinda not feeling good rn and would appreciate any words of wisdom.",
  "author": "throwaway9936494",
  "created": 1632566936,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "heb0y8t": {
      "link": "/r/CollegeMajors/comments/pv4gp6/went_with_a_safe_major_that_i_wasnt_super_fond_of/heb0y8t/",
      "text": "If you legitimately are having panic attacks due to your CS coursework... maybe you should reconsider it. Not to say you should outright drop it, but you should come up with a concrete plan going forward, otherwise you may wind up forcing yourself through 2/3 more years of CS. classes, still hating it, and then end up hating your job after college. However, this may be caused by poor mental health, and you might end up liking computer science much more if you have time to get your mental health fixed. \n\nI personally would recommend taking a gap semester, if possible. During this time, I would recommend learning more about programming on your own, and building some small projects by yourself. The user interface of a website, some kind of game AI, a web server, some algorithmic programs, etc. Use this time to focus on programming and CS outside of school, in less of a stressful environment, while going to therapy and trying to improve your mental state. This may give you good insight into whether you really can stomach programming/CS, or if it is truly a subject you don't like. I kind of know that feeling as well, since I started my CS major with zero knowledge of programming, and it honestly took a couple of years before it really \"clicked\" for me and I started enjoying my classes and doing well. It is a very different style of thinking, and there's a lot of groundwork you need to do before you can start getting very proficient, so maybe it is just the anxiety of these classes that is making you hate CS, which you can overcome.\n\nAlso during this gap semester, I would recommend exploring other career paths. So just look up videos on like \"accounting 101\" or something like that, see if you can find some courses on Udemy, talk to more people on reddit in /r/engineering or /r/accounting or something. basically, do what you can to expose yourself to many different career paths and start thinking about which one is right for you.",
      "author": "postmaloneismediocre",
      "created": 1632628811,
      "upvotes": 1,
      "replies": {}
    },
    "he8jw18": {
      "link": "/r/CollegeMajors/comments/pv4gp6/went_with_a_safe_major_that_i_wasnt_super_fond_of/he8jw18/",
      "text": "I don't often advise this to people but to you I would say - drop off the major.  I was in the same boat (initially want to do literature / English) but luckily I was good at CS and managed to graduate with it but if you feel the major is causing you depression, that's very bad. I don't think a marketable major is worth your mental health.\n\n1. I would 100% suggest taking some time off and looking into how to do a marketable major but still combine your interest in archaeology / history. Maybe become a high school teacher? I know some writing majors who manage to use their skill to do technical writing (which make very good money) and they're not in STEM or business.\n2. If finance is an issue, definitely check on Indeed / linkedin for top in demand jobs. See what strike your interest.\n3. Go on something like [whatforwork.com](https://whatforwork.com) and try to explore different jobs there.\n4. But you don't have to major in CS, engineer or accounting to make good money. You just need to find a niche that paid well and combine your interests.",
      "author": "withaining",
      "created": 1632587273,
      "upvotes": 6,
      "replies": {
        "heb04j7": {
          "link": "/r/CollegeMajors/comments/pv4gp6/went_with_a_safe_major_that_i_wasnt_super_fond_of/heb04j7/",
          "text": ">(initially want to do literature / English) but luckily I was good at CS and managed to graduate with it\n\nLol that's literally what I did as well",
          "author": "postmaloneismediocre",
          "created": 1632628360,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634060252
}