{"sid": "ktw4tn", "link": "/r/CollegeMajors/comments/ktw4tn/health_science_or_biology_major_for_nursing/", "title:": "Health Science or Biology major for nursing?", "text": "The title pretty much says it all, I applied for the biology major not knowing that there was a health science major but I still have time to change it. So, I wanted to know if there were any suggestions on which major I should go for if I want to pursue nursing.", "author": "Andelyse", "created": 1610216216, "retrieved": 1632957457, "over_18": false, "upvotes": 4, "upvote_ratio": 1.0, "comments": {"giok6p7": {"link": "/r/CollegeMajors/comments/ktw4tn/health_science_or_biology_major_for_nursing/giok6p7/", "text": "Nursing is a major all on its own. Your school might not offer it? Health Science and Bio are typically PhD or MD/DO undergrad routes. With nursing you take your prereqs and if/when you pass you get placed then you get placed in a cohort or whatever the school calls the group.", "author": "DarthCinodehna", "created": 1610219363, "upvotes": 2}, "gioi0ct": {"link": "/r/CollegeMajors/comments/ktw4tn/health_science_or_biology_major_for_nursing/gioi0ct/", "text": "Isn’t nursing already the major. All the schools I know just have you be a pre-nursing major and you take all the prerequisites needed. Usually this gets you the AS in allied health or biology or both. And then you apply to nursing programs whether that be the AS/AA in nursing, then transfer to a university to get the bachelors which is like only a semester or two more. \n\nThe other option is you get accepted right away to a university and just get your bachelors there. \n\nThe biology major and health science major is different as it is not for nursing. Unless the health science major is like the Allied health courses, otherwise, health science is like public health/ healthcare policy/admin type work. I’m not sure what school you go to but I’d ask a counselor to clarify this for you because you shouldn’t be majoring in either of those for nursing. Let me know if you have more questions.\n\nUnless you’re going to do an accelerated nursing program afterwards then that’s an entirely a different story and you could just choose either major, preferably biology so you can also take the nursing prerequisites if needed, and then apply to accelerated nursing programs.", "author": "twin0912", "created": 1610218337, "upvotes": 3}, "giofam6": {"link": "/r/CollegeMajors/comments/ktw4tn/health_science_or_biology_major_for_nursing/giofam6/", "text": "Are you doing nursing for this degree, like where you do the prerequisites and then get into the nursing program sophomore year? I’m a health science-public health major and I like my major too much to do nursing, so I’m going to finish my degree and do an accelerated nursing program", "author": "oopsss34", "created": 1610217040, "upvotes": 1}}}