{"sid": "bavzgl", "link": "/r/CollegeMajors/comments/bavzgl/whats_a_good_major_for_someone_who_is_interested/", "title:": "What’s a good major for someone who is interested in the hardware side of technology?", "text": "I’m very interested in the subject of circuitry and electricity and I’d love to take classes on the subject but I am told that it’s a very hard subject. On top of being a hard subject I am told that the prerequisite classes are very difficult and I am not a great student in gen ed classes. \n\nThe reason I am interested in circuitry in particular is because of my hobby of electronic musical instruments, this has caused me to have a pretty basic understanding of how breadboards work and how circuitry works. I’d like to maybe use the subject of circuitry to apply it to music technology??? Or maybe even just get a strait music technology degree??\n\nI really could just use some advice because I don’t know what’s out there", "author": "blueshades09", "created": 1554741426, "retrieved": 1632848210, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"ekz26mg": {"link": "/r/CollegeMajors/comments/bavzgl/whats_a_good_major_for_someone_who_is_interested/ekz26mg/", "text": "Computer Engineering sounds like a good fit, as does Electrical Engineering.  If you really are interested in circuitry and electricity, you should take the class even if you think it is hard.  If something is hard, that means you will probably learn a lot from it.", "author": null, "created": 1555365516, "upvotes": 1}, "ekk18d3": {"link": "/r/CollegeMajors/comments/bavzgl/whats_a_good_major_for_someone_who_is_interested/ekk18d3/", "text": "computer engineering or electrical engineering are probably closest.", "author": "HauntingMastodon", "created": 1554912688, "upvotes": 1}, "ekg4kt5": {"link": "/r/CollegeMajors/comments/bavzgl/whats_a_good_major_for_someone_who_is_interested/ekg4kt5/", "text": "My immediate thought is Electrical Engineering, or Computer Engineering as an alternative.", "author": "EggcellentName", "created": 1554783460, "upvotes": 1}}}