{
  "sid": "org1fn",
  "link": "/r/CollegeMajors/comments/org1fn/how_easy_is_political_science/",
  "title:": "How easy is Political Science ?",
  "text": "So recently I switched out of computer engineering because it was too difficult for me and time consuming. I was wondering if majoring in political science is an easy major for me. I'm not looking for anything math heavy but a liberal arts major that won't include complex formulas and equations. Any political science majors here that can provide me a synopsis on their curriculum and the level of difficulty.",
  "author": "Miserable-Quail-1161",
  "created": 1627234721,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "h6ndco0": {
      "link": "/r/CollegeMajors/comments/org1fn/how_easy_is_political_science/h6ndco0/",
      "text": "u left a garanateed high paying employment major for career where u will be flipping burgers for minimum wage? talking about short sight",
      "author": "ghostmode342",
      "created": 1627344301,
      "upvotes": 1,
      "replies": {
        "h6o1a44": {
          "link": "/r/CollegeMajors/comments/org1fn/how_easy_is_political_science/h6o1a44/",
          "text": "I failed like 2 CS classes and I was dangerously close to losing my financial aid. So i figured i have to choose an easy major to save myself from dropping out. Honestly i just want my degree and to get it over it. It might sound stupid in the grand of things but i don't regret anything because i'm on track to graduating on time anyways.",
          "author": "Miserable-Quail-1161",
          "created": 1627356754,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6i5wlo": {
      "link": "/r/CollegeMajors/comments/org1fn/how_easy_is_political_science/h6i5wlo/",
      "text": "What is your end game?  What do you want to do as a career ?  Whether or not a major is “easy” really means nothing if you don’t have a job to pay off the loans",
      "author": "YYR123",
      "created": 1627240830,
      "upvotes": 5,
      "replies": {
        "h6o1u3f": {
          "link": "/r/CollegeMajors/comments/org1fn/how_easy_is_political_science/h6o1u3f/",
          "text": "I want to be a correctional officer. Also, to be honest I just want my degree so my parents won't look at me as some drop out failure. Computer science is such a difficult subject and it felt like a burden on my chest studying it. Political science has been a walk in the park for me so far and it just consists of writing papers about arbitrary things.",
          "author": "Miserable-Quail-1161",
          "created": 1627357083,
          "upvotes": 1,
          "replies": {
            "h6pmx9t": {
              "link": "/r/CollegeMajors/comments/org1fn/how_easy_is_political_science/h6pmx9t/",
              "text": "Not sure what state you are in but I’m not sure a degree is required to be a correction officer. I’d research that before taking on loans.  That’s a great career.  If you research and pass the civil\nService exam I don’t see how your parents would fault you.  You have direction and a plan.  Good luck!!",
              "author": "YYR123",
              "created": 1627396689,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634060379
}