{
  "sid": "gtspog",
  "link": "/r/CollegeMajors/comments/gtspog/need_help_finding_a_major/",
  "title:": "Need help finding a Major",
  "text": "Greetings reddit. Normally I would never ask people on the internet for help but honestly I’m stuck. I have lost all motivation and passion due to my morals being brought down from the pandemic. I no longer know what I want to do. There are some things I’m good at but some things I don’t want to do.\n\nThings I don’t want to do:\nOnly two things really. Computer Science and statistics. When I was younger I wanted to do CS as a major and make video games however, when I actually started studying it as a sophomore and as a junior, I realized that I do not wanna work a job that makes me write hours of scripts. I find that very boring and I also have this complex where I don’t like jumping onto bandwagons so anything that’s being hyped at the moment, like CS, makes me negligent towards it.\n\nWith Statistics I though since I do rather well with graphs and math in general, that I’d excel in it. However, it’s basically a calculator class where you basically let the calculator do all the work and all you have to do is memorize how to interpret the situation. I did well in AP Statistics except for the most important unit, probability. It was my teacher’s favorite unit so he geeked out on us and made it complicated by giving us scenarios that we won’t be asked on the AP exam. \n\nThings I’m good (decent) at:\nI excel at high-school lvl Algebra and Geometry however, my 11th grade teacher would only teach us calculator tricks for Algebra II/Trig so my skill is poor with those. \n\nI have always had a talent for theatrical performances. Throughout my life I have tried theatre,not as a hobby, but just to do it. It’s like I was drawn to it. I also transferred a lot throughout my life so some schools I just faked my personality for the fun of it. My skill is currently above my peers for theatre the only problem is that my singing needs lessons. \n\nMy strongest suite is my memory. I have a skill that I feel lucky to have where if a teacher demonstrates something on the board, I can remember it making me not have to study. With this I have aced tests easily thought it my life without studying. The only issue is that audio learning and online learning do not have the same effect nor does practical learning (example of this is trying to explain Pythagorean’s theorem with physical triangles rather than showing us the formula on a chalk-board or a smart board although this is different to me than seeing someone work in person as to me that does not feel like practical learning and I can actually learn from that.) \n\nThings I’m bad at:\nOnline Learning (Learning from websites besides google [Websites that have 1999 Ui especially])\nAudio Learning (Learning from hearing what someone says rather than them just doing it. Worse than leaning online for me)\nStudying (At least depending on my environment) - Im bad at studying unless I’m in a quiet environment which is nearly impossible when I have to take care of my 3 year old sister and my 70 year old grandmother with Alzheimer’s while my mom works as an essential worker. \n\nWith all of this, is there two majors I can go for which can benefit me giving my strengths and weaknesses? Around 2017-2019 I was in my first high school. My school had a merger so the smartest kid from another hs and me (highest standardized test scores in my hs; not calling myself smart) and we became best friends. We had a friendly rivalry that made each of us want to be better than the other. I was #2 class rank while he was #1 (I later dropped to #7 because my CS teacher for my sophomore year graded my midterms wrong. If they did it right I’d actually temporarily be #1 class rank). Without him I’d probably be top 50 at most. In my new school I don’t have anyone I want to rival. The best students are lifeless due to studying most of the time just to get into an ivy while I am having trouble to be motivated. While quarantined I feel all alone. None of my friends from either of my schools are in contact with me. I’m not interesting or anything I mostly just observe others rather than doing things. Due to my grades though I am almost always chosen as the leader of the group and though I might sometimes have a good leadership, in other moments I am too reluctant to take action. \n\nCould Reddit help me find a major? I can do the rest of the research on my own but I need at least a shove in the right direction. Even motivation would help! Thank you in advance.\n\nP.S How do I gain the motivation I once had?",
  "author": "SirLancelot7dsGC",
  "created": 1590899981,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "fum7zvf": {
      "link": "/r/CollegeMajors/comments/gtspog/need_help_finding_a_major/fum7zvf/",
      "text": "This book might help you find out what path you should take. \n\nWhat Color Is Your Parachute? 2020: A Practical Manual for Job-Hunters and Career-Changers https://www.amazon.com/dp/1984856561/ref=cm_sw_r_other_apa_i_3w74Eb4C2NNXZ\n\nI've just begun reading it as I'm in the same boat, but very different situation than you. I'm actually looking to change my career path from logistics to computer science. This book basically is an in depth way of figuring out who you are and what kind of job you want. So if you figure out what kind of job you want, then that should lead you to what you should major in, I would think.",
      "author": "mr_jiffy",
      "created": 1591981767,
      "upvotes": 1,
      "replies": {}
    },
    "ft570j7": {
      "link": "/r/CollegeMajors/comments/gtspog/need_help_finding_a_major/ft570j7/",
      "text": "Graphic design",
      "author": "Reav101",
      "created": 1591461181,
      "upvotes": 1,
      "replies": {}
    },
    "fslabdq": {
      "link": "/r/CollegeMajors/comments/gtspog/need_help_finding_a_major/fslabdq/",
      "text": "The first thing that popped into my head was to stay in academia. You could go the professor route i a subject you love, and help people who also suck at studying.",
      "author": "AuthenticStereotype",
      "created": 1591062895,
      "upvotes": 1,
      "replies": {}
    },
    "fses4g3": {
      "link": "/r/CollegeMajors/comments/gtspog/need_help_finding_a_major/fses4g3/",
      "text": "I recommend taking some time away from the topic I know it might seem harsh and you feel like you’re in a rush but honestly this is something you don’t want to rush into unless you have the money, I had a similar issue of not being able to pick a major and actually wanted to do CS at some point. Now I’m in the Army(Active duty) still confused about my major but a little more stable now still trying to discover who am I, and what will I do after I finish this contract. Just keep going don’t stress over that so much cause you’re only doing yourself harm it will come in time.",
      "author": "Endglo",
      "created": 1590920082,
      "upvotes": 2,
      "replies": {
        "fseutq6": {
          "link": "/r/CollegeMajors/comments/gtspog/need_help_finding_a_major/fseutq6/",
          "text": "Can agree with what is said^^ also the university you pick is over rated. I went to a the top 3 school where I am from and can’t say I enjoy it. Also will be a junior next fall and thinking of switching my major to math. I switched twice already. Visit schools before applying, at least consider it more.",
          "author": null,
          "created": 1590922819,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634060339
}