{"sid": "huawnw", "link": "/r/CollegeMajors/comments/huawnw/wow_my_interests_suck_i_dont_want_to_be_a_burden/", "title:": "Wow! My interests suck, & I don't want to be a burden!", "text": "Hey! *Almost* highschool student here, & I just realized. When the time comes for me to graduate. I'm literally fucked. My interests are tied with what most people consider the 'useless degrees'. That being, writing, musical theatre, psychology, & sociology. There's also my side hobby of photography, & that sort of ties in writing, since I did consider going for something in communications.\n\nI'm not too anxious in terms of my marks in school, seing as I'm consistently on the higher end of the honour roll, but that also screws me over, because I'm Asian. More specifically Filipino. Which means I'm expected to be one of two things by literally everybody. **A**, a doctor, or **B**, an engineer. \n\nProblem is, science is boring to me (Yet I have never failed the class, lol) & the only sciences I enjoy are the ones where you study & examine people & how they act. (Psychology & Sociology).\n\nBut then comes another problem. \"Oh! He has amazing marks in Language Arts, he could be a lawyer!\" & now we arrive at the mess that is my future. \n\nTo summarize, **1:** My interests are rooted in either the film industry, writing, or being a therapist (or something idk). **2:** I'm expected to go to some hoity toity university & spend an ungodly amount of time studying to get into a high paying job to some day help out my family (Who I deeply care about, & don't want to disappoint.)\n\nI still haven't told my parents about what I want to spend my life doing & I have to constantly lie to them about what I want in my future, even though I already narrowed it down to three fields of work...\n\nI am so fucked when I tell them. I am scared of what they'll say, when I tell them. When I tell them that their son, that they expect to succeed in life. Is nothing but a gay disaster, that doesn't know what to do & is scared of his own future. Please help, I honestly need it 'cause my life literally depends on it.\n\n\\-I may have hyperfixated on this. I did *not* realize that I spent too much time typing this out, only for like- two people to notice it. whoops.", "author": "Demiro-Mistereo", "created": 1595202752, "retrieved": 1632956493, "over_18": false, "upvotes": 19, "upvote_ratio": 0.96, "comments": {"g1sz1fy": {"link": "/r/CollegeMajors/comments/huawnw/wow_my_interests_suck_i_dont_want_to_be_a_burden/g1sz1fy/", "text": "You forgot nurse lol\n\nBut to be honest you have a lot of time to figure that out. But remember, fuck what other people think. You do what YOU want to, not what your parents want, not what your grand parents want, not what your uncles or aunts want, what YOU want.\n\nI’m also Filipino and for a very long time I felt pressured by my family to become something “great” in their eyes. A nurse or engineer primarily, but I realized they can fuck off. It’s my life. And yours is yours.", "author": "Seikosha1961", "created": 1597636984, "upvotes": 1}, "fymkl1g": {"link": "/r/CollegeMajors/comments/huawnw/wow_my_interests_suck_i_dont_want_to_be_a_burden/fymkl1g/", "text": "You sound a bit like me. I’m an incoming sophomore in college who also loves writing and psychology (and economics, sociology, sort of poli sci, basically all the social sciences). I was strongly considering Industrial Organizational Psychology for a while, decided it wasn’t for me but you may wanna look into that. There’s a sub for it: r/iopsychology. Right now I am thinking of being a marketing major, and studying marketing online in my free time. :)", "author": "shirbert6540", "created": 1595217507, "upvotes": 1}, "fym9f93": {"link": "/r/CollegeMajors/comments/huawnw/wow_my_interests_suck_i_dont_want_to_be_a_burden/fym9f93/", "text": "Wow, I definitely agree with other people that you are way too young, but at the same time, I was in your shoes a few years ago. I'm really good at writing, art, theater, English, etc., but I'm also not half bad at math. I struggled for a long time major-wise; I'm interested in pretty much everything. I started out as a business major, settled on mass comm with a minor in business to hopefully work in children's publishing. I'm also thinking about maybe being a professor or lawyer one day. I know my paycheck isn't going to be perfect, but I have confidence I can at least pay my bills at the end of the day. \n\nI 100% feel the whole \"gay disaster/burden\" thing, but if you can work hard and keep your head up, I'm sure you'll do great. Go to college, maybe undecided, then figure out what you want to do. You have time, don't stress. Enjoy the world while you still can, you'll be fine; the fact that you're even worried about this stuff this early shows you can survive.", "author": "las921", "created": 1595210256, "upvotes": 1}, "fylzyg8": {"link": "/r/CollegeMajors/comments/huawnw/wow_my_interests_suck_i_dont_want_to_be_a_burden/fylzyg8/", "text": "I understand the pressures from family/society but I say do whatever you want. You don’t want to go to college for something you don’t want to do and be stuck in a boring 9-5 job for the rest of your life. \n\nIf your parents are paying for your college, maybe double major? Do the easiest thing that would be acceptable and then do whatever you want. Therapy might be a little better than anything else just because it pays a decent amount of money (by my standards).\n\nAnother route would be doing something easy and then writing on the side. Maybe you can save up some money so that you can just write.  \n\nYou could also just not listen to anything they say and study whatever the hell you want. It’s your life, not theirs. You shouldn’t have to be ashamed about what you love (or your sexuality for that matter) Don’t get yourself stuck in a job that doesn’t satisfy you. \n\nEither way, I’d recommend building your skills the next four years. Take writing classes or act in the play. Find what you really love to do and do it. You’ll find a way to be happy with what you do. Don’t worry about it too much, it will just cause you stress and won’t actually solve the problem.", "author": "Konigenkatja", "created": 1595204535, "upvotes": 2}, "fylz9x9": {"link": "/r/CollegeMajors/comments/huawnw/wow_my_interests_suck_i_dont_want_to_be_a_burden/fylz9x9/", "text": "Definitely aren’t f’ed\n\nWriting and psychology are some of the most useful tools in any industry.\n\nLook into David Perell (his content on Twitter is one of the best). He is a beast and looking at his stuff will open so many ideas for you.\n\nIf you really want to find something interesting where you can use the interests above, look into marketing. Combine writing and psychology... you’ll be a powerhouse in that industry.\n\nI run a podcast and talk to ton of recruiters with my work on LinkedIn. When it comes to marketing, those are the two skills people look for because they’re incredible hard to teach.\n\nYou’re young and got a TON of time, don’t spend time stressing. Start exploring and you’ll never look back.", "author": "Declassified_College", "created": 1595204130, "upvotes": 5}, "fylxvx6": {"link": "/r/CollegeMajors/comments/huawnw/wow_my_interests_suck_i_dont_want_to_be_a_burden/fylxvx6/", "text": "How old are you? You’re wayyyy too young to be worried about this. Go out and enjoy the world! You’re just a kid. Don’t rush yourself into worrying about this. You have four years for gods sake, and even then some people don’t figure out what they want until they’re in college (me included).", "author": "hobgoblins46", "created": 1595203295, "upvotes": 7}}}