{"sid": "i2wfml", "link": "/r/CollegeMajors/comments/i2wfml/sophomore_in_hs_very_confused/", "title:": "Sophomore in HS Very Confused", "text": "I've been looking at a lot of colleges such as UCONN, JWU, SCSU, SUNY Oneonta, etc. I've been considering a lot of different paths and degrees, and I'm most interest in majoring in Human Dev. and Family Sci., Political Science, Government, Economics, Sociology, Education, and Social Work. Obviously I can't get 7 bachelor's degrees, but I'm not really sure what I should consider majoring in.\n\nI have a great passion for social justice and advocacy. But I'm also incredibly interested in the world of Politics, Government, and Economics. Sociology is very interesting to me, and I love studying sociological topics. I've always wanted to be an educator since I was very little, and could very well see myself as a secondary ed teacher or a professor. I could also see working in mental health, such as a counselor or therapist.\n\nPlease help me. Right now UCONN seems like the best choice, as it offers degrees in all of these subjects, aside from government. Does anyone have any good advice. I'm also interested in doing a double or triple major, but only for degrees that would be well paired together such as Poli. Sci. and Economics, or Sociology and Social Work.\n\nThank you all so much.", "author": "kaimamaster1315", "created": 1596458925, "retrieved": 1632847623, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"g11bwm1": {"link": "/r/CollegeMajors/comments/i2wfml/sophomore_in_hs_very_confused/g11bwm1/", "text": "SUNY Oneonta has a great education program, and a program for Education Counseling.\n\nGiven your like for Education, Social Work and Family Sci, this might be a good choice.", "author": "ThadiasMcCoy", "created": 1597095402, "upvotes": 1}, "g07cn7d": {"link": "/r/CollegeMajors/comments/i2wfml/sophomore_in_hs_very_confused/g07cn7d/", "text": "I am a sophomore in High School too. You can filter out the ones you hardly can get a job from (Sociology, Education, Social Work). \n\nYou are passionate about Social Justice and Advocacy, if you study Political Science and Government, not only you can be an advocate, but you also can get a job. Economics major can get you a banking job if you choose this path", "author": "thiagowinters", "created": 1596460425, "upvotes": 1}, "g07civp": {"link": "/r/CollegeMajors/comments/i2wfml/sophomore_in_hs_very_confused/g07civp/", "text": "UCONN is a great school. It is very common to not be sure what you want to major in. During your first year you can take classes in poli sci, Econ, sociology, psych, etc. It might help to talk to upperclassmen when you are there along with talking to advisors. You might want to look into liberal arts colleges bc they are very flexible when it comes to majors.", "author": null, "created": 1596460345, "upvotes": 3}}}