{"sid": "mz63hn", "link": "/r/CollegeMajors/comments/mz63hn/is_it_worth_it_to_study_computer_science_pros_cons/", "title:": "Is it worth it to study Computer Science? Pros & Cons?", "text": "Hi, I'm a 21 year old female in college and was just wondering if this degree is worth it. I like being intellectually challenged and creating things. Just what are some of the pros and cons as well? Thanks!", "author": "Superb-Disk-8202", "created": 1619466121, "retrieved": 1632958058, "over_18": false, "upvotes": 2, "upvote_ratio": 0.67, "comments": {"gw684t1": {"link": "/r/CollegeMajors/comments/mz63hn/is_it_worth_it_to_study_computer_science_pros_cons/gw684t1/", "text": "As a woman programmer: yes it’s worth it. There are lots of downsides to the field itself (very male-dominated both in school and outside of it, but this is slowly getting better), but the degree will be incredibly useful as more and more areas of society become tech-focused. I’m happy to answer any questions and offer any advice you’d like 💕", "author": "Scene_Usual", "created": 1619618420, "upvotes": 2}, "gvzvjli": {"link": "/r/CollegeMajors/comments/mz63hn/is_it_worth_it_to_study_computer_science_pros_cons/gvzvjli/", "text": "I mean, it's hard to give pros and cons without knowing you personally/without having heard why you're interested but I'll try to give my experiences. The main pros of CS are that it's challenging and stimulating, widely applicable, and leads to decent careers. To explain, programming and computer science skills can be used in many different disciplines, since those skills let you deal with large amounts of data, interact with other pieces of software, and create your own applications that many people can use. All of those things are used in great capacity in many different industries and fields. \n\nThis also means that computer science can be very interesting, because there's so many niches of it. Personally, I am not super into the mathematical side, but some of my friends are interested in computer vision, artificial intelligence, machine learning, algorithms/computer science theory, and bioinformatics. Me personally, I find the programming aspect of computer science to be the most interesting, so I am more drawn to systems, programming language stuff, and web development. It's such a broad major that there's probably something interesting you can find that overlaps with your other interests. And there's also the money aspect of things. Computer science is one of the highest paying degrees for the entry level. Its not uncommon for smart, well prepared CS students to get 100k jobs right out of school. You also get to build cool stuff. If you want to make an app or you have a cool idea for a project, you can get started immediately.\n\nThe cons: Ok, so there's the obvious one, which is that computer science is a difficult field and can be pretty stressful at times. Some math involved, although nowhere near as much as in other engineering, but the main stress comes from coding projects, which can take a lot of time, and there can be a lot of debugging involved, which is daunting and stressful in its own way. Programming is definitely not for everyone. In addition, the competition is steep for computer science. Programming is unique in that it's a skill that can be learned entirely on one's own, with just a computer. People in other disciplines aren't really doing finance, accounting, or engineering stuff on their own in high school and college, at least, not until they get an internship. However, there are a lot of people who began programming in high school, meaning that you are going to be at a disadvantage (at least initially) if you have no programming experience, both in doing well in classes, and also in getting internships. The fact that programming jobs pay so well means that the amount of people majoring in CS is steadily going up, and there's also a ton of international students and people from other disciplines enticed by high salaries, glamor, and a lack of formal requirements for many software jobs. This means that getting internships and jobs can be difficult, since there are a ton of applicants. Because of the deluge of candidates, interviews are getting much tougher, to the point that giving very tricky logic problems in the space of 40 minutes is the norm, and people spend literally hundreds of hours and months of their time practicing interview questions to get a good job.\n\nLastly, there's a good chance you will be constantly learning in programming, be it your job or your school classes. this is both a pro and a con. This is nice because you don't have to get stuck in some dreary desk job doing mindless work if you don't want to (although there are definitely a lot of programming jobs working on old, boring tech, it's just not necessary to work like this), you can jump to an interesting company using cool new tech. the downside is that you might be in trouble of having some of your knowledge become obsolete, as a new framework or language comes out. This can probably be mitigated by working on learning the fundamentals.\n\nIn short, computer science has high salaries and a lot of cool stuff going on, and you can build your own stuff and apply it to many different fields. However, it's very competitive, difficult, and frustrating at times, and is certainly not for everyone. I really can't provide a more in depth answer because I simply don't know what kind of work you like and what you're good at. You should definitely take a class if you're itnerested in it. but don't feel obligated to pursue it because you hear its the future or some shit.", "author": "BetUrProcrastinating", "created": 1619483823, "upvotes": 2}, "gvzaqb8": {"link": "/r/CollegeMajors/comments/mz63hn/is_it_worth_it_to_study_computer_science_pros_cons/gvzaqb8/", "text": "Are you seriously asking if a degree that’s consistently on lists regarding the “top degrees to get” and “highest paying majors” is worth getting?", "author": "PianoConcertoNo2", "created": 1619473649, "upvotes": 5}, "gvz3643": {"link": "/r/CollegeMajors/comments/mz63hn/is_it_worth_it_to_study_computer_science_pros_cons/gvz3643/", "text": "Following.", "author": "flawedgawd", "created": 1619470283, "upvotes": 2}}}