{"sid": "ktb78c", "link": "/r/CollegeMajors/comments/ktb78c/needing_serious_helpadvice_with_what_to_do/", "title:": "Needing serious help/advice with what to do", "text": "Hi reddit, this is my first post ever. I am a fourth year college student (22F) at a large state school with several major changes under my belt, and I'm afraid I may be wanting to change again..\n\nI began college the way many do in that I pursued biology and had the idea that I would go to medical school. Well, I work in a hospital right now not even providing care and I dislike it. I get verbally abused by patients on occasion and it is not something I prefer to tolerate, plus I would prefer not being in school for forever. I switched to chemical engineering after my freshmen year based on the advice I received from a past teacher. This was relatively fine, however I did not have a great support system, my mental health derailed and I didn't try to get help, I was working too much at my part time job, and I visited one plant and freaked out. That made me rethink everything and I switched again, this time to sociology/psychology thinking, \"I wanted to go to law school when I was younger, let's try that\". Found out very quickly that that is an absolute no for me, as I believe sociology/psychology, while great fields, are not rigorous enough for me, and after an \"internship\" I just knew I hated it. I did a 360 turn and went back to biology with no exact idea of what I want. Now, of course, I am wondering if I made a bad decision of quitting engineering and if I should go back. Any advice/help/knowledge/anything is greatly, greatly appreciated. (I do have an appt with my school's career center soon :/)\n\nSome foundational information: my college is free until spring 2023 and I have a 3.678 GPA. Occasionally in my free-time I make an attempt at learning some code. I also have GAD, but take medication that helps greatly. Knowing what to do with my life is just my biggest stressor ever.", "author": "BrightBuddy", "created": 1610138287, "retrieved": 1632956763, "over_18": false, "upvotes": 11, "upvote_ratio": 1.0, "comments": {"gilmwla": {"link": "/r/CollegeMajors/comments/ktb78c/needing_serious_helpadvice_with_what_to_do/gilmwla/", "text": "what was wrong with chemical engineering?", "author": "BetUrProcrastinating", "created": 1610150605, "upvotes": 4}, "gilcva0": {"link": "/r/CollegeMajors/comments/ktb78c/needing_serious_helpadvice_with_what_to_do/gilcva0/", "text": "What subject has made you the most passionate and curious about it? What major has brought you the most joy?", "author": "TheBrookAndTheBluff", "created": 1610145696, "upvotes": 6}}}