{"sid": "j9i896", "link": "/r/CollegeMajors/comments/j9i896/confused_college_freshman/", "title:": "Confused College Freshman", "text": " Hey everyone I'm currently attending a CC trying to finish my basic classes and then will transfer to a uni. Right now my major is nursing which I HATE and now I'm clueless on what to do for my future. I think working in the government would be cool like public policy and I also like helping others which I why I decided to major in nursing in the first place. Does anyone have good major suggestions?\n\n\\- side not I am for sure that social work is not for me\n\n( Also I know I have time to figure it out but I'm a major control freak and have a ten-year plan and everything is falling apart LOL)", "author": "lowkeysus22", "created": 1602468128, "retrieved": 1632847196, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"ge0lfft": {"link": "/r/CollegeMajors/comments/j9i896/confused_college_freshman/ge0lfft/", "text": "What about public health? There are government jobs, it's sort of public policy-adjacent, it's about helping others, and some of your nursing prerequisites (like intro biology) might also count toward a public health major.", "author": "ultimate_ampersand", "created": 1606648679, "upvotes": 1}, "g8p7z4z": {"link": "/r/CollegeMajors/comments/j9i896/confused_college_freshman/g8p7z4z/", "text": "Oof. So that's what I am lol. I'm a control freak like you in the sense that I needed to plan out my future at least five years in advance to feel comfortable. As a current freshman in college I totally get where you're coming from and still kinda if get where you're coming from since I'm trying to choose the best minor to match my major. The way I went about choosing major was finding what career FIELD I wanted to work in. I'm not talking about a specific job, like nurse, but the the more broad umbrella that nurses work under (i.e medical field). If you can pin point where you want to be in 10 years than you work backwards and come up with a game plan to reach your goal. So far, it's working well for me. I have set goals for myself to keep on my track and to hold myself accountable.", "author": "theenigmaticlover", "created": 1602602960, "upvotes": 2}, "g8kdwvl": {"link": "/r/CollegeMajors/comments/j9i896/confused_college_freshman/g8kdwvl/", "text": "Take some classes that sound interesting to you as your elective credits. But there are career advisors on most college campuses.", "author": "Tiedbison305407", "created": 1602479856, "upvotes": 1}}}