{
  "sid": "iey12m",
  "link": "/r/CollegeMajors/comments/iey12m/cs_vs_ce_vs_se/",
  "title:": "CS vs CE vs SE",
  "text": "I think I still have some questions that I wanna ask as a final highschool year student and who is almost certain that will proceed into 'digital technology' field in the future.  I'm currently at that stage just like others of choosing universities and degrees/major. I came across 3 options when I had to choose a major, which were Computer Engineering, Software Engineering, and Computer Science. As much computer science was a very well-known and most taken major out of all three, I came to a conclusion that I'm not the kind of a person who would like to just sit in front of a computer and just program all day (I know that's not this isn't the case 100%). I'm more kind of a person who is interested in learning about the in-depth theoretical perspective of the computer, but also hardware and technological perspective of the computer as well. \n\nRegardless of what my undergrad degree would be, I have a set goal where I really wanna do my post grad in the US (possibly high-tier unis such as MIT) and hopefully work and places such as Google or Microsoft. (I know I have to work hard for this and I will). I really wanna do projects on AI field like smart home where I can also integrate designers and scientists to create some sort of facility that would be beneficial for the community. Even start my own business if I can.   But putting all of this aside, being 100% certain that that is what I wanna do, I still could not chose what would be a good major to take. I'm am planning on moving to Australia from NZ next year to study in top-tier unis overthere. \n\nThrough my research, I have figured out that some universities just simply don't haev engineering department (University of Melbourne) so my only choice is major in computing (which I think is a CS major roughly) or go to a little bit low-tier uni (Monash) and study engineering there. Sorry it's been a long message but I just want to know if its really worth diving into engineering field so early on if I wanna do my post-grad regardless. Your help will be much appreciated and thank you so much!",
  "author": null,
  "created": 1598161821,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "g2ksflu": {
      "link": "/r/CollegeMajors/comments/iey12m/cs_vs_ce_vs_se/g2ksflu/",
      "text": "\"  theoretical perspective  \" - that would be CS\n\n\"  hardware and technological perspective \" - CE\n\n\"  or go to a little bit low-tier uni (Monash) and study engineering there. \" - Undergrad prestige doesn't matter, go to the cheapest school. Preferably do your two years of community college then go to an in-state four year college.",
      "author": "Reav101",
      "created": 1598184786,
      "upvotes": 3,
      "replies": {
        "g2ksku9": {
          "link": "/r/CollegeMajors/comments/iey12m/cs_vs_ce_vs_se/g2ksku9/",
          "text": "I smell the sign of double degree/major",
          "author": null,
          "created": 1598184916,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634059524
}