{
  "sid": "qbhr6f",
  "link": "/r/CollegeMajors/comments/qbhr6f/quarter_life_criss/",
  "title:": "Quarter Life Criss",
  "text": "Hello, I am currently a third year chemistry student and have been facing doubts about my chosen career path. I've been doing a lot of research and can't help but feel like I was conned into pursuing a difficult degree being told \"all the money is in STEM\" etc. etc. and am now seeing that there are other fields of study that earn much more on average and are easier to earn a degree in. \n\nFirst of all, I do love chemistry. I find it very interesting and I do well in my chemistry classes. However, I don't want to feel like I've wasted all this time studying and not experiencing life throughout college only to achieve a worse salary than someone of either a different stem major or otherwise. \n\nI will not switch out of chemistry, but what do you think would be best to have a specialization in? For instance, would biochemistry be better than general chemistry? (ChemE isn't an option, I am not interested in that at all).\n\nOr, am I being ridiculous and should stop worrying about all of this and the data i'm reading online are not entirely accurate depictions of the job market for chemists.",
  "author": "Opening_Recipe_2539",
  "created": 1634668440,
  "updated": 1634750382,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hhc5bae": {
      "link": "/r/CollegeMajors/comments/qbhr6f/quarter_life_criss/hhc5bae/",
      "text": "What careers are you interested in (regardless of whether they relate to chemistry)? See what kinds of skills, knowledge, and/or experience entry-level roles in those fields require and figure out how to get it before (or soon after) you graduate. For example, if you want to work in tech, you might be able to break in by just taking a few extra computer science classes, building a portfolio, and doing a summer or part-time internship rather than switching your degree. There are plenty of people in software engineering and similar careers who don’t have a computer science degree (a lot of them get started with bootcamps). If the job you’re interested in does require a specific major, you can switch, but you don’t necessarily have to.\n\nHere’s the thing about majors: they often don’t correlate to people’s careers as well as you would think. Often, they’re only related to your future job in the broadest sense (i.e. your education helped you develop problem-solving and critical thinking skills that apply to a broad range of jobs.) Lots of people with STEM degrees end up in roles that don’t directly relate to the degree, and may not even be in STEM, but are nevertheless good jobs. You don’t HAVE to be a chemist, lab technician, etc. just because you got a degree in chemistry. If you like what you’re studying, it’s perfectly fine to stick with it.\n\nIt sounds like you’re mostly worried about job prospects, so think about how you can boost your chances of getting a job after you graduate (internships, either paid or part-time unpaid for college credit, are usually key.) I did just fine with my English degree even there aren’t a lot of jobs that directly relate to studying literature and creative writing, and so did most of my classmates who were motivated. I work in digital marketing alongside people with degrees in psychology, economics, culinerary science, or nothing at all. For me, a 10 hour/week marketing communications internship at a nonprofit, plus writing samples and connections from working at my student newspaper, were far more important than my degree. (By the way, I didn’t do either of those things until junior year — you still have plenty of time!)\n\nAnother thought — can you talk to chemistry grads from your college? You can probably find people on LinkedIn at least. See what they’re doing now and ask them what it took to get there.",
      "author": "Lily9879",
      "created": 1634716095,
      "upvotes": 1,
      "replies": {}
    }
  }
}