{
  "sid": "ge5sf4",
  "link": "/r/CollegeMajors/comments/ge5sf4/environmental_science_or_engineering/",
  "title:": "Environmental Science or Engineering?",
  "text": "I have no idea what the difference is between the two is, or if it's even worth it when it comes to finding a career. \n\nI have looked at a ton of Reddit posts already and I just want newer, fresher opinions.   \n\nAnything helps, thank you!\n\nEDIT: \n\nNeed to clarify: Environmental science vs environmental engineering, not just plain engineering.",
  "author": "littlemoonbug",
  "created": 1588711562,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "fpoz1fo": {
      "link": "/r/CollegeMajors/comments/ge5sf4/environmental_science_or_engineering/fpoz1fo/",
      "text": "if you go on r/Environmental_Careers it is full of people who regret choosing Environmental Science as a major, so I couldn't really recommend it.",
      "author": "Reav101",
      "created": 1588793109,
      "upvotes": 1,
      "replies": {}
    },
    "fplg167": {
      "link": "/r/CollegeMajors/comments/ge5sf4/environmental_science_or_engineering/fplg167/",
      "text": "Engineering in and of itself is a vastly broad field, you'd have to clarify which one exactly you mean (big four are civil, mechanical, electrical/computer, and software if you're not an elitist engineer).\n\nDon't know much about environmental science but can answer a lot of engineering questions, feel free to PM me.",
      "author": "TopSplit",
      "created": 1588712049,
      "upvotes": 1,
      "replies": {
        "fplgnd9": {
          "link": "/r/CollegeMajors/comments/ge5sf4/environmental_science_or_engineering/fplgnd9/",
          "text": "My apologies, I meant environmental engineering.",
          "author": "littlemoonbug",
          "created": 1588712362,
          "upvotes": 1,
          "replies": {
            "fplj0wg": {
              "link": "/r/CollegeMajors/comments/ge5sf4/environmental_science_or_engineering/fplj0wg/",
              "text": "Ultimately it boils down to the university/industry and what science and engineering mean in respect to those. some universities' computer science degrees are very similar to other universities' computer engineering degrees, while some are far from being as intensive as a computer engineering degree. Most likely with science you'll probably be dealing with a lot more research-based work, and probably follow a pure academia route (Masters, etc), and engineering tends to be more application-focused.",
              "author": "TopSplit",
              "created": 1588713585,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634059653
}