{"sid": "gdz287", "link": "/r/CollegeMajors/comments/gdz287/ideas/", "title:": "IDEAS? （；＿；）", "text": "Hello,\n\nSo lately,  I’ve been trying to decide what I should major in. I’m currently in the liberal art/general studies program at my school and planning to switch. At first, I was going to apply to the nursing program at my school, but realized it wasn’t for me. What made me stray away from nursing is that my personality just isn’t suitable for it. And I also just don’t care enough about working in that type of environment. \n\nHere are some of the stuff I enjoy: creative writing, linguistics, editing, photography, music, and appreciating animations/art. Mainly I just enjoy the creative aspect that I would like to exercise in a career. \n\nRight now, I’m looking into public relations or at least the communications/digital media transfer major at my school. I know it might seem obvious of which majors I should be looking from what I’ve listed, but I wanted to post this on Reddit anyways. Maybe some of you guys have other ideas. \n\nThanks!", "author": "Susanstyles", "created": 1588690048, "retrieved": 1632847742, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"fpp0i4j": {"link": "/r/CollegeMajors/comments/gdz287/ideas/fpp0i4j/", "text": "If you are lost and don't know what to do while being fairly early on into your major. Try a semester at a community college and took a lot of generals while you decide where you want to be 5 years from now. This minimizes how much you have to pay while giving you more time to decide what you want to do.", "author": "Reav101", "created": 1588793827, "upvotes": 2}, "fpkawg1": {"link": "/r/CollegeMajors/comments/gdz287/ideas/fpkawg1/", "text": "Studying English could be good. You could specialize in literature, linguistics(if you pair an English major up with a psych major), story writing, history,etc. \n\n\nThe fields that you have listed seem great as well! All the best and hope this helped.", "author": "vishthefish05", "created": 1588691319, "upvotes": 2}}}