{"sid": "gp2mmi", "link": "/r/CollegeMajors/comments/gp2mmi/how_did_you_decide_your_major/", "title:": "How did you decide your major?", "text": "I'm very stuck on what I should major in. I'm going to community college to mainly decide on that, but I'm so unsure and want to narrow it down. I'm looking at anywhere between criminal justice, psychology, sports science, and maybe computer science, but I've decided that I most likely wont do computer science as a major and I will only just get courses in it. So how did you decide, and if you could help me in any way, please tell me.", "author": null, "created": 1590229441, "retrieved": 1632847707, "over_18": false, "upvotes": 9, "upvote_ratio": 1.0, "comments": {"fsamxin": {"link": "/r/CollegeMajors/comments/gp2mmi/how_did_you_decide_your_major/fsamxin/", "text": "At first I listened to my family and started as a bio major, and that was the worst mistake of my life.   \nHowever, I met friends that encouraged me to major in what I was passionate about. I'm a History and Theology major now and I couldn't be happier.  \n\n\nWhat are you mostly passionate about and what could lead to a career that you would enjoy?   \nIf you're going to work for the rest of your life, it might as well be in a field you're passionate about not something you'll hate.", "author": "AgoraphobicDisaster", "created": 1590834671, "upvotes": 2}, "fru2m9f": {"link": "/r/CollegeMajors/comments/gp2mmi/how_did_you_decide_your_major/fru2m9f/", "text": "Hey! I went to CC too to decide on my major before transferring to a 4-year.\n\nTake a wide variety of GEs, attend job fairs / networking events if available, join some clubs, etc. You're at CC so really just go all out with trying everything and anything (class-wise) that interests you. If you're curious, maybe drop in on a class then decide if you want to take it.\n\nFor me working backwards helped, by either looking at specific careers that interested me & looking at the related majors, or narrowing it down by crossing off majors that I absolutely hate/are bored by.", "author": "badassbuffy", "created": 1590463280, "upvotes": 2}, "froh2lh": {"link": "/r/CollegeMajors/comments/gp2mmi/how_did_you_decide_your_major/froh2lh/", "text": "I've been thinking about this question ever since middle school. I come from a lower-income family so definitely a major that would increase the chances of finding a higher income job was a factor, and I also didn't want a major that would lead me to a career that I don't enjoy and would be doing for the rest of my life. If anything, I wanted a major that would satisfy both of these conditions, and I settled on computer science. \n\nWhy? Because for one, it's one of the largest growing jobs in the market and one of the better-paying ones (ranging from a starting pay of 60k to six figures). My second reason for settling with computer science is because of my experience with my first ever programming class. I didn't know a thing about code at all starting out. Our second or so lab which took most of the people about an hour and a half to finish took me about six. But here's the thing, I actually enjoyed the challenge and the content, and I didn't dread the time spent towards that assignment. It's rare for me to find a subject that I genuinely like learning and actually engages me. I've been able to progress in my studies and have been able to get to the point where things \"click\" for me now, which is a point where I'm glad I'm able to get to, and IMO, it just shows how Compsci is for me. \n\nTo answer your question, I've decided on my major based on what I wanted out of it. I wanted a major that would lead me to a growing job market with good pay and something that I actually liked. Yours could be different, or you may decide on Compsci as well :) . If anything, I had to jump around the various clubs and programs offered in my city/school in order to find something that I actually wanted to do for a living, so it may take a while for you to settle on one. \n\nDoes your school have any criminal science, computer science, psychology, or physical science clubs? If you do, I'd say involve yourself in those clubs so that you can be with others with the following major and get to know what that major is really like from those in the major itself. Have you tried taking the first course of any of these fields to see if you enjoy the content or not? This is what I'm trying to do, as I'm trying to find another major to go along with my Compsci major. \n\nLastly, the point I'm trying to get out is to explore. Find out what subjects you like and enjoy, and more importantly, engages you; and go on from there.", "author": "xyang074", "created": 1590338828, "upvotes": 2}, "frmjndf": {"link": "/r/CollegeMajors/comments/gp2mmi/how_did_you_decide_your_major/frmjndf/", "text": "I found a balance of what I enjoyed and what I'm good at.\n\nMy first semester was science heavy and going to a school known for it's high rate of sending kids to prestigious med schools they were basically weeding out courses. It was tough. I enjoyed some aspects but didn't want to struggle like that for 4 years bc I'm not really gifted in STEM like that. \n\nI thrived in my econ class and I enjoyed it. So I went for that. Still no regrets.", "author": "alexxarivera15", "created": 1590303163, "upvotes": 2}, "frl1epd": {"link": "/r/CollegeMajors/comments/gp2mmi/how_did_you_decide_your_major/frl1epd/", "text": "[deleted]", "author": null, "created": 1590267561, "upvotes": 2}, "frjxjq3": {"link": "/r/CollegeMajors/comments/gp2mmi/how_did_you_decide_your_major/frjxjq3/", "text": "Careerexploreer.com", "author": "holciamp", "created": 1590245291, "upvotes": 2}, "frjii0l": {"link": "/r/CollegeMajors/comments/gp2mmi/how_did_you_decide_your_major/frjii0l/", "text": "Honestly think of your long term goals and personal interests.", "author": "locostasia", "created": 1590233833, "upvotes": 4}}}