{"sid": "ptd2jg", "link": "/r/CollegeMajors/comments/ptd2jg/i_think_ive_made_a_mistake/", "title:": "I think I've made a mistake.", "text": "I applied to 2 different universities. There was a tight deadline between enrolling in each of them so I already enrolled into one of them, only to find out they extended the deadline last minute. \n\nThroughout high school I was very sure I'd pursue architecture, and so I applied to both places for arch. For uni A i applied for B.arch; for uni B, I applied for B.arch, and bsc in computer science as a second choice. I got accepted in both; but for cs in uni B with a scholarship.\n\nI've been having conflicting feelings regarding choosing my major since I'm starting to understand (recently) that my chances of pursuing my masters abroad is going to be highly unlikely if I go with architecture since my family is worried about finding good enough work to support myself after graduating. If they had the financial luxury to send me abroad for my undergrad they would. So money is issue and seeing how long it would take for an architect to earn enough without burdening my parents even after grad school, licensing exams and entry level jobs - I can't help but feel a bit concerned. \n\nI'm aware that cs in no way is easy but comparing the 2, it seems like it would take a smaller dent on my family in the long run. I told my parents about this and and they said not to worry about the nonrefundable enrollment fees for uni A if I choose uni B. They said choosing now would be better than regretting it later on, and that if i go for cs in uni B, I have more chances of finding a stable job and so not have to worry about  'minuscule' enrollment fee.\n\nI'm kind of torn between which one to go for - I was pretty passionate about architecture since hs, probably to an extent I shouldn't have. It wasn't passion in particular, I was just good at art(majority of my achievements are art related) and it was honestly the grinding and hard work in math & science that me decent grades. Architecture just seemed like a good middle ground. I already stated why cs seems like a brighter option. The only closest eca to cs are my graphic designer roles for school clubs and major events. Studies aside uni B is closer to home, overall better reputation and has a pretty good campus; my parents don't feel super safe with having me commute all the way to uni A (this country isn't super safe in general). Uni A doesn't have a proper campus.. yet. I enrolled there hearing that their architecture course is good and that's it. On the other hand if it means leaving the country sooner and being independent, I am more than willing to work hard for cs. I kind of feel selfish for considering going to arch since it might hurt my parents financially more. I already feel awful for the enrollment fee. \n\nI feel like I'm being too naive since I have no experience in either arch or cs and all this decision making feels.. overwhelming. I have a week to decide before uni B's deadline is over and I'm not sure where to go from here. I'm so torn.. Thanks for reading", "author": "Zealousideal-Rich628", "created": 1632333358, "retrieved": 1632958003, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hdx5kkl": {"link": "/r/CollegeMajors/comments/ptd2jg/i_think_ive_made_a_mistake/hdx5kkl/", "text": "What appeals to you about computer science? Have you done a lot of programming so far?", "author": "postmaloneismediocre", "created": 1632366235, "upvotes": 2}}}