{"sid": "ojkoyo", "link": "/r/CollegeMajors/comments/ojkoyo/what_should_i_major_in/", "title:": "What should i major in?", "text": "Im a senior in high school this year and I’ve broken down my options down to 4 majors. Software engineering, computer science, Business management, or Business administration. I want do something i don’t have to do a lot  of math and make a good salary out of College. May I help recommending a salary?", "author": "ToxicBoys4Life", "created": 1626198080, "retrieved": 1632956752, "over_18": false, "upvotes": 11, "upvote_ratio": 1.0, "comments": {"h55t6uu": {"link": "/r/CollegeMajors/comments/ojkoyo/what_should_i_major_in/h55t6uu/", "text": "you top dollar software eng or computer sc. you are not even make anything close  to that if you go with any business degree.", "author": "ghostmode342", "created": 1626274989, "upvotes": 1}, "h53m9xc": {"link": "/r/CollegeMajors/comments/ojkoyo/what_should_i_major_in/h53m9xc/", "text": "Software Engineering with a minor in Business Admin", "author": "jdigitaltutoring", "created": 1626222596, "upvotes": 4}, "h52vypc": {"link": "/r/CollegeMajors/comments/ojkoyo/what_should_i_major_in/h52vypc/", "text": "At some schools, software engineering is basically CS minus the math so maybe look into that.", "author": "tha_oz", "created": 1626209492, "upvotes": 2}, "h52mae9": {"link": "/r/CollegeMajors/comments/ojkoyo/what_should_i_major_in/h52mae9/", "text": "Business management and business admin are going to be roughly the same, as would software engineering and computer science, only that software engineering would likely have extreme math requirements. I’d suggest one of the business degrees if you won’t want to do math and then learn to program on your own if you want. I took one intro to programming class and got the basics down, from there the sky is the limit. Personal projects and studying leetcode are probably the two most important things in software development.", "author": "officialkodos", "created": 1626205162, "upvotes": 1}, "h52h6nx": {"link": "/r/CollegeMajors/comments/ojkoyo/what_should_i_major_in/h52h6nx/", "text": "If you don't want to do math CS is out of the picture. Other poster is right, CS is basically a math degree. I've never had any exposure to a straight up software engineering program, I'd think CS would be better in preparing for stuff like LeetCode.", "author": "OGMagicConch", "created": 1626202916, "upvotes": 3}, "h52dux2": {"link": "/r/CollegeMajors/comments/ojkoyo/what_should_i_major_in/h52dux2/", "text": "Cs is basically a math degree", "author": "shytries", "created": 1626201422, "upvotes": 3}}}