{"sid": "gqp39v", "link": "/r/CollegeMajors/comments/gqp39v/im_in_need_of_some_help_picking_a_major/", "title:": "I'm in need of some help picking a major", "text": "When i first entered community college last semester i wanted to major in history, but after realizing there isn't a big demand for museum educators and that everyone wants a museum job i changed it to general studies until i decided. I keep going back and forth trying to find something i like but at the same time something i could find a job with in at least a year or so. \n\nI really enjoy English but I'm a little leery of taking that without something else to compliment it because it seems like a lot of my friends that were English majors had a difficult time finding something that wasn't teaching. I also like earth sciences (dinosaurs, storms, volcanoes, etc.), and of course history. I considered graphic design but I'm not artistic enough. Is there anything out of those i listed that i could major/minor in and find a job with?", "author": "ohtimorousme", "created": 1590462397, "retrieved": 1632847703, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"fs4iydv": {"link": "/r/CollegeMajors/comments/gqp39v/im_in_need_of_some_help_picking_a_major/fs4iydv/", "text": "I'm an English senior over at CSU in CO. When I went into English, I thought I'd only be able to teach. Turns out it's way more than that. Can write for magazines online, in print, can do technical writing. My advice, find something you like to write about, be it philosophy, sociology, sciences anything. In my case, I like condensing information into a useful format. So, I'm going to do technical writing.", "author": "IggfullSend", "created": 1590696708, "upvotes": 1}, "fs0oej5": {"link": "/r/CollegeMajors/comments/gqp39v/im_in_need_of_some_help_picking_a_major/fs0oej5/", "text": "I was in the same shoes as you last semester (still kinda am). I was an general studies major who wanted to switch to English because I love writing. I looked at my university English courses and they are all based on reading books (of course), as I kept researching I realized this major was mainly for those who wanted to become an English teacher and I was more into the business side. I ended up major in communications because it is a pretty broad major. I am now considering minoring in Info systems to gain proficient programming skills.", "author": "Zorojuro97", "created": 1590613013, "upvotes": 1}, "frwqd7w": {"link": "/r/CollegeMajors/comments/gqp39v/im_in_need_of_some_help_picking_a_major/frwqd7w/", "text": "This is a tough choice, but honestly don't stress too much about it because you will find something you love eventually. I have a lot of friends who graduated with certain degrees and switched their careers to something else entirely. So, let's dissect it one by one.  \n\n\nWhat do you enjoy doing? What do you see yourself doing in a few years? Do you see yourself working with kids and teaching? Do you see yourself at a desk with a computer? What would you rather do – have a sedentary job where you sit by a computer for 6-8 hours or an active job?  \n\n\nI'm a graphic designer myself so I'm more knowledgable with that career path; there's plenty of things you can do as a graphic designer. You can design websites, applications, or do branding and logo design, poster design, you can play around with fonts and become a font designer or typographer, you can animate short videos, illustrate and lean more towards the artistic side of design. It's not just about being 'artistic' or talented, you actually get to study composition and layout-ing and  a lot of other things.\n\n&#x200B;\n\nI'm not super well-versed in what one can do with English, history and general studies. Maybe communicate with some of your professors to discuss (if that's an available option to you) and try to visualize what you would like to keep studying and working in the future.\n\n&#x200B;\n\nI hope this has helped you, even a little, because choosing majors is a pain.", "author": "xSaveMeFromMyself", "created": 1590525770, "upvotes": 1}, "fru30vl": {"link": "/r/CollegeMajors/comments/gqp39v/im_in_need_of_some_help_picking_a_major/fru30vl/", "text": "What classes did you enjoy and get an A in. List them out and then figure out the profitability/debt ratio.", "author": "DetectiveTacoX", "created": 1590463552, "upvotes": 3}}}