{"sid": "ilgb2l", "link": "/r/CollegeMajors/comments/ilgb2l/changing_her_major_need_advice/", "title:": "Changing her major - need advice", "text": "(First off English is not my first language so I apologize for any grammatical errors)\n\nHey, my gf studies early education & special education. Recently she has felt that it might not be the path that she want. She has been certain all the way through highschool that she wants to become a teacher. She loves working with kids, and i believe that is a part of why. We both love travelling and she fears that working as a teacher may not give the same financial rewards as a business degree will.\n\nShe also feels a marketing degree would allow her to have more growth and opportunities than a teaching degree.\n\nIf she were to change, she would change to be a marketing major and a double minor in german(she already speak a little german through highschool education) and international buisness.\n\nI was wondering if anyone who has experience with switching majors could respond and give their input on how / why they changed, or if anyone who is pursuing a degree within marketing, could tell alittle how they feel the studies are and the job market as a marketing major.", "author": "Chicken_nugt", "created": 1599083011, "retrieved": 1632957783, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"g3ryf78": {"link": "/r/CollegeMajors/comments/ilgb2l/changing_her_major_need_advice/g3ryf78/", "text": "She should look up the stats in the area where you guys live (job outlook, length of time for degree, average pay,etc) for each major. Make a pros and cons list; and talk to marketing professors as they normally have a good idea of what to expect in the job market. \n\nI changed from Psychology to Accounting. Best decision I ever made. I already have a job as a low tier accountant, making twice as much as I did as a behavioral assistant, and i don’t even have my degree yet. I love the social sciences, but it doesn’t make money.", "author": null, "created": 1599084350, "upvotes": 2}}}