{
  "sid": "eib7qv",
  "link": "/r/CollegeMajors/comments/eib7qv/life_after_biology_degree/",
  "title:": "Life after biology degree",
  "text": "I am second guessing my major.  I really enjoy science and declared biology early on with no real plan. Now I am struggling to find my “end game”.  What can one actually do for a living with a biology degree",
  "author": "YYR123",
  "created": 1577837811,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "fctaa1v": {
      "link": "/r/CollegeMajors/comments/eib7qv/life_after_biology_degree/fctaa1v/",
      "text": "There's actually a lot you can do. You can, obviously, be a biologist. If you go to vet school, you can be a vet. Even with just a biology degree you can be a vet tech. You can be a biology teacher if you get a license or teach at college level. You can become a physician if you attend a little bit more of medical school. This is just a shortlist. I would recommend doing a Google search for \"What can you do with a Biology degree?\" and see what comes up. Otherwise, if none of the careers sound interesting to you, then maybe you should consider switching majors. I, personally, was going to actually become a biology major just like you but changed my mind and now have decided to become an English major to become a teacher. Just test the waters a little bit. Maybe over the summer, take a few non-biology related classes. You could try environmental science, criminology, astronomy, etc. You could even try non-science related classes too. You may discover something more interesting to you. I know I enjoy science, but I like English much more. I know switching majors is risky, but sometimes taking risks will lead to better results.",
      "author": "AnonymousPinkDolphin",
      "created": 1577937120,
      "upvotes": 3,
      "replies": {
        "fcxh0hb": {
          "link": "/r/CollegeMajors/comments/eib7qv/life_after_biology_degree/fcxh0hb/",
          "text": "Thank you so much for your reply ! It was very helpful!!!",
          "author": "YYR123",
          "created": 1578062707,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634061392
}