{"sid": "a7k63o", "link": "/r/CollegeMajors/comments/a7k63o/looking_to_go_back_to_school_only_vaguely_sure_of/", "title:": "Looking to go back to school, only vaguely sure of direction, looking for advice.", "text": "Hey everyone.\n\nSo, after wanting to go back to school for some time and not having the means to because of my work schedule, I am now jobless and still don't really have the means to go back to school unless I can get grants/scholarships. Nevertheless, I am trying to figure out what I would even go back for.\n\nFor professional and personal/hobby reasons, I'm interested in something involving ergonomics, workplace health and safety.\n\nThe first time I was at college, I failed to get into nursing school, became an EMT, and then joined the military to become a field corpsman (reserves). After, I spent several years as a phlebotomist (part of what got me interested in ergonomics/workplace safety is the guy at the blood bank in charge of safety was an idiot and very out of touch with the realities of our work. I've also been a firearms instructor where I focused on body mechanics, ergonomics, and teaching/learning strategies to develop success with my students; with that I still like to design tools and accessories in my spare time that are ergonomic/efficient.\n\nAll of this is really just to help paint a picture of what I am interested in doing, to see what is out there. I'm at a loss of what I should specifically study: kinesiology, risk management, occupational health and safety, psychology, or something else entirely.\n\nHaving worked a lot of bullshit shifts in my life, I really crave a 9-5 job, and I don't think I would really do well or survive in a graduate school program, so I'm hoping that options exist for a relevant career path that only require a bachelor's degree and maybe certifications outside of school.\n\nAlso just for additional information, I am a severely depressed person and it's been a very rough year. So I apologize for any of this sounding particularly gloomy.\n\nAnyway, I really, *really* appreciate any and all help or advice for getting me pointed down some sort of right path. I can answer any additional questions if I didn't cover something.", "author": "Misfit-Joker", "created": 1545203719, "retrieved": 1632958188, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"eca8sve": {"link": "/r/CollegeMajors/comments/a7k63o/looking_to_go_back_to_school_only_vaguely_sure_of/eca8sve/", "text": "Bump for hopefully more academic help.", "author": "Misfit-Joker", "created": 1545434493, "upvotes": 1}, "ec3rg67": {"link": "/r/CollegeMajors/comments/a7k63o/looking_to_go_back_to_school_only_vaguely_sure_of/ec3rg67/", "text": "I’m here to help you as I walked down this path. I was going to school in 2012-2014 mindlessly was depressed never went to school failed/dropped my classes. Again I tried in 2016 same thing. Now in 2018 I’m back into it and kinda sorted my depression and anxiety out a little more.\n\nMy problem was I was going to school mindlessly instead of wanting to be there. My advice to you is if you’re not mentally stable or you feel you truly don’t wanna go and get a degree for a future job, don’t go to school till you’re fully committed. Last thing you want to do is waste money. Trying to do school while depressed will make your life a lot worse. And I mean like really the yourself if u wanna give school your 200% effort. For someone with depression you’ll have to work much harder cuz that’s how I felt and from my experience. \n\nNow I’m not saying this to scare you off because there’s also other options. U CAN go to school and work on your mental state too. I went to the school counseling center while in school and they helped me and gave me a whole bunch of benefits. \n\nAlso about what u wanna do that’s kinda up to you. I changed my major three times and lost time on a few classes but was worth it cuz I finally figured out what I wanted to do. Go on other reddit pages of what’s interesting to you ask people about their careers and the journey in school it took to get there. Go to your school job / career fare ask people around. I would say figure out what kinda career path and major u want first before u really head into school \n\nTL;DR \nFigure yourself out mentally first before you go to school \n\nIf you do go to school use the schools counseling centers to help assist you throughout college\n\nBefore you sign up and register for school figure out your career and major. I know I didn’t answer this but ask around you’ll get answers ", "author": "VIllainLife", "created": 1545213359, "upvotes": 2}}}