{"sid": "pfokzr", "link": "/r/CollegeMajors/comments/pfokzr/why_should_i_major_long_ranting_paragraph/", "title:": "why should i major? (long ranting paragraph!)", "text": "hello, i am a current first year college student. i came in undecided and intended to go into architecture. im taking a required college option course right now for architecture (philosophy) and i enjoy the atmosphere and the people in the class (by far, my favorite class). now, i am thinking about switching my major to possibly something else. i have been in the interest of computer science, psychology, architecture (more interested in interior design) , advertising & public relations (because we didn't have marketing, and that was the closest thing), business, etc. im very open, yet picky about what you want to do. for computer science, i heard that many people are getting jobs even through bootcamp coding experience, and i don't know how i feel about putting in so much effort and time into cs major of i can just do bootcamps too, but then again, i know here are more nob opportunities for degree filled people, so im not entirely sure how i feel about that. computer science is heavily mathematics based, and i don't know of i would enjoy anything after calc (up to calc 3 requirement for cs major here & linear algebra). also, the work load is heavy, is it really worth it and manageable? however, in general, i know that i don't like science itself. things like chem, bio, physics are required for computer science too, however, the medical field isn't my favorite place. i know i want to work with others during my job, i want to build a strong community and where i can dedicate a job/internship/etc, i want to have a good pay (i know this sounds classic and like something everyone says, but i rather do something that pays, rather than pursue something i feel passionate about that doesn't pay remotely well and have job opportunities out of college). things like law and finance aren't my area either (law: i don't want to engage in any false helping towards others and i hate long readings, finance: dealing with interest is against my religion and i rather not relate anything to it). i am open to hi eat opinions so please help me out.", "author": "Aggressive_Foot_4513", "created": 1630479812, "retrieved": 1632958013, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hba1p7p": {"link": "/r/CollegeMajors/comments/pfokzr/why_should_i_major_long_ranting_paragraph/hba1p7p/", "text": "I can offer my advice about computer science. Yes, some people do bootcamps and end up with jobs like a year later. But I personally would not recommend this route for someone in your position. There are a lot of bootcamp grads who often don't have much relevant work experience and often have the same cookie cutter projects. They are also lacking in CS fundamentals, namely data structures, which makes it harder for them to find jobs. They can be a decent option if you're coming from an unrelated field and you already have a degree, or if getting a 4 year college degree is just not an option for you for whatever reason. Many bootcamp grads don't get programming jobs, and those who do are often extremely committed and working 80 hours a week to learn as much as possible and absolutely grinding. Going to a four year college will give you more time to learn the computer science fundamentals, do more interesting projects, network, and get internships, so I would generally recommend the college route.\n\nThe workload is (generally) heavy in computer science, but what matters most is if you enjoy programming or not. If you enjoy programming, then the work will be manageable and not seem to onerous. If you dislike programming, computer science is most likely a terrible thing to major in unless you are a hardcore theory nerd and just want to do the mathy stuff. Computer science does have some math reqs (what you mentioned of calc 3 and linear algebra is pretty standard), but these are not central to a lot of what you're going to be doing in your classes, so if you slack and don't get a great grade in these, it really is not that important. Unless of course, you are concentrating in a subdomain of computer science that requires these classes (computer vision, machine learning, etc.). \n\nIf computer science seems interesting to you, I would definitely recommend taking an intro to CS class at your school. After that I think you will be much better informed about the subject and will have the ability to decide whether it might be for you or not.", "author": "postmaloneismediocre", "created": 1630557661, "upvotes": 1}, "hb60tb8": {"link": "/r/CollegeMajors/comments/pfokzr/why_should_i_major_long_ranting_paragraph/hb60tb8/", "text": "choose something that will pay. plently of people follow their passion and get useless degree, then go back to college to get a better degree.  dont follow your passion, make it a side gig.", "author": "ghostmode342", "created": 1630488109, "upvotes": 2}}}