{"sid": "kcs9w8", "link": "/r/CollegeMajors/comments/kcs9w8/does_every_major_succeed_or_some_really_end_up/", "title:": "Does every major succeed? Or some really end up unemployed and on welfare?", "text": "Tell me how you made it", "author": "da_mfkn_BEAST", "created": 1607927165, "retrieved": 1632956876, "over_18": false, "upvotes": 8, "upvote_ratio": 0.83, "comments": {"ggecpkm": {"link": "/r/CollegeMajors/comments/kcs9w8/does_every_major_succeed_or_some_really_end_up/ggecpkm/", "text": "There's no real answer to this, because there are tons of successful (and unsuccessful) people from every major. So you can't really speak in generalities like that. What I think you might be asking, is \"which majors are MORE LIKELY to lead to successful careers, and which ones are harder to get high paying jobs with.\"", "author": "BetUrProcrastinating", "created": 1608411174, "upvotes": 2}, "gfv4vwa": {"link": "/r/CollegeMajors/comments/kcs9w8/does_every_major_succeed_or_some_really_end_up/gfv4vwa/", "text": "I know quite a few liberal arts majors who worked retail/food service/childcare and then went back to school in a completely different field. I also know quite a few liberal arts majors who have stable white-collar jobs with health insurance and a retirement plan. I have such a job and I have colleagues who majored in psychology, anthropology, English, communications, wildlife biology, creative writing, political science, business, kinesiology, international relations, religious studies, and African-American studies. I don't know anyone on welfare. \n\nIn my experience, as long as you get work or work-adjacent experience outside the classroom (jobs, internships, research assistantships, volunteer work, leadership positions in student organizations, whatever), a liberal arts degree is not some kind of kiss of death. Sure, if you have a BA in anthropology it's unlikely you'll have an anthropology-related job, because most anthropology-related jobs a) require a graduate degree and b) are very scarce even for people with PhDs, but that doesn't mean you'll, like, die alone in a cardboard box. \n\nReddit loves to reduce this discussion into \"either you're a rich happy engineer or you're a poor miserable English major,\" when there are plenty of middle-class people with non-STEM degrees. I mean, I don't recommend taking on a bunch of debt to get a degree in painting, but if you know you'd be miserable as a CS major or other \"practical\" major, and you just want to get a degree in something because (whatever your reasons are), then go to community college, apply for financial aid and scholarships, transfer to a school you can afford, and don't neglect your professional development outside the classroom. Which also means major in something you can manage that won't completely consume your life and leave you with no time/energy to do professional development stuff. \n\nAlso bear in mind that simply picking an \"employable\" major does not guarantee that you will be employable in that field. Obviously, you have to actually complete the degree, which might not happen if you pick a major that you hate or that is just a really bad fit for your strengths. I know someone who tried to major in physics, was so stressed out that she ended up in the hospital with a bleeding ulcer, switched her major to sociology, and is fine now. If I had tried to major in engineering and couldn't or wouldn't change my major, I would not now be an engineer, I would have either flunked out of college or dropped out before I could flunk out. Even if I had somehow made it through, I would be competing for jobs against people who actually liked engineering and were good at it.", "author": "ultimate_ampersand", "created": 1607988524, "upvotes": 6}, "gfsn3rp": {"link": "/r/CollegeMajors/comments/kcs9w8/does_every_major_succeed_or_some_really_end_up/gfsn3rp/", "text": "Like dont put your self through debt and all that stuff but if you or your parents can fund it then you should go ahead and do whatever major that is the most interesting to you. Getting a job isn't a good measure of success imo and I've seen people who were happier before being considered \"successful\". Arts majors are good for a lot of things but won't necessarily get you a job. You could do a degree in Bsc or Business but then thats going to be a lot of hard work and dedication on your part.", "author": "johnwithcheese", "created": 1607935614, "upvotes": 1}, "gfsk4bk": {"link": "/r/CollegeMajors/comments/kcs9w8/does_every_major_succeed_or_some_really_end_up/gfsk4bk/", "text": "I think you have the question framed incorrectly. Every major has a chance of succeeding, but not everybody has a chance of succeeding.\n\nPeoples major that are part of always growing or newly growing industries will usually have an easier time finding jobs, but also consider that many people may go into that job in order to find work and it saturates the field making finding entry levels a bit tedious.  \n\nIt depends on how involved in your field you are, and what career you position yourself for. If you go to school without networking, building industry experience, or getting involved your chance of success will greatly dwindle.", "author": "safespace999", "created": 1607932660, "upvotes": 11}, "gfsgwld": {"link": "/r/CollegeMajors/comments/kcs9w8/does_every_major_succeed_or_some_really_end_up/gfsgwld/", "text": "Cmon. U really think every major succeeds? Hell nah. Just look up the countless liberal art majors that are in $100k+ debt working at Starbucks. There will ofc be a select few that do succeed but don’t let it distract u from the majority of them who don’t get a job in their field...", "author": "TiNyUzi", "created": 1607929675, "upvotes": -3}, "gfsfruy": {"link": "/r/CollegeMajors/comments/kcs9w8/does_every_major_succeed_or_some_really_end_up/gfsfruy/", "text": "Liberal art majors are gonna come and try to defend themselves rn", "author": null, "created": 1607928662, "upvotes": -1}}}