{
  "sid": "mkn0ig",
  "link": "/r/CollegeMajors/comments/mkn0ig/what_is_the_best_thing_to_do_if_youre_undecided/",
  "title:": "What is the best thing to do if you’re undecided?",
  "text": "I think I want to be a mechanical engineer but I also wanted to be a clinical psychologist because I understand that they do statistics and some math as well. I was interested in psychiatrist but I don’t think I’m interested in medicine anymore. I did take a liking to architecture for a while but I’m not sure.",
  "author": "idgaf2170",
  "created": 1617635686,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "gtgr59o": {
      "link": "/r/CollegeMajors/comments/mkn0ig/what_is_the_best_thing_to_do_if_youre_undecided/gtgr59o/",
      "text": "I honestly don't think clinical psychologists do as much math as you think (mainly statistics). Architecture is definitely more of a civil engineering thing, which also involves a lot of math and maybe some statistics. So if you're thinking about architecture but still want to use math frequently, civil engineering is a good idea. If you're solely interested in a career based off its usage of math and/or stats, I would go with any field of engineering.",
      "author": "Acrocane",
      "created": 1617637920,
      "upvotes": 2,
      "replies": {
        "gtgzihw": {
          "link": "/r/CollegeMajors/comments/mkn0ig/what_is_the_best_thing_to_do_if_youre_undecided/gtgzihw/",
          "text": "I’m a psych student on my way to getting a PhD. Stats plays a big role if you are a researcher, but even then it’s nowhere near engineering levels of math.",
          "author": "Zam8859",
          "created": 1617641694,
          "upvotes": 2,
          "replies": {}
        },
        "gtha51a": {
          "link": "/r/CollegeMajors/comments/mkn0ig/what_is_the_best_thing_to_do_if_youre_undecided/gtha51a/",
          "text": "I’m an architecture student and there’s actually very little math. Calc 1 and physics (non-calc based) at most. It’s design, so art and design with a little stem mixed in.",
          "author": "petitesoldat",
          "created": 1617646490,
          "upvotes": 1,
          "replies": {
            "gthags8": {
              "link": "/r/CollegeMajors/comments/mkn0ig/what_is_the_best_thing_to_do_if_youre_undecided/gthags8/",
              "text": "Oh yes of course. I was sort of implying civil engineering, but I see how the 2 paths could be very different",
              "author": "Acrocane",
              "created": 1617646638,
              "upvotes": 2,
              "replies": {
                "gthb8re": {
                  "link": "/r/CollegeMajors/comments/mkn0ig/what_is_the_best_thing_to_do_if_youre_undecided/gthb8re/",
                  "text": "Ah! Sorry about that. I don’t mean to diminish your reply at all, I just want to clarify the discrepancies between OP’s conception about architecture and my own experience with the subject. Completely agree that civil engineering would be a better fit for someone more stem-oriented.",
                  "author": "petitesoldat",
                  "created": 1617646989,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634061391
}