{"sid": "at7017", "link": "/r/CollegeMajors/comments/at7017/i_cant_decide_between_two_majors/", "title:": "I can't decide between two majors", "text": "I've been trying to decide between a history major and a plant science degree.I've been reading plant books and they kinda bore me while history books always keep me interested. I do have a love for how beautiful plants are and a love for history", "author": null, "created": 1550775882, "retrieved": 1632957994, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"egz3pg4": {"link": "/r/CollegeMajors/comments/at7017/i_cant_decide_between_two_majors/egz3pg4/", "text": "From what I’m gathering, you seem to admire plants on a visual appeal level, which is perfectly fine, but Plant Science is more based on Agriculture and Genetics. While that certainly  means you do love plants, you seem to really not be engaged with anything informative about them, which would make a Plant Science major difficult. \n\nOn the other hand, you’re very engaged with information pertaining to history, which is a great sign. History will require plenty of discussion, research, and reading at its core, and you’re already halfway there by having a genuine interest in one of those aspects. I personally think that your choice should be history.\n\nNow, the Plant Science major may have better prospects at the bachelors level, but if that’s not your thing academically, that’s perfectly okay. If you’re genuinely engaged and stimulated in history, then by all means go for that. ", "author": "The_Max_Rebo", "created": 1550777280, "upvotes": 6}, "egz365f": {"link": "/r/CollegeMajors/comments/at7017/i_cant_decide_between_two_majors/egz365f/", "text": "Have you considered trying to find an area in which those two are related? ", "author": "Is-there-chocolate", "created": 1550776923, "upvotes": 1}, "egz2b4a": {"link": "/r/CollegeMajors/comments/at7017/i_cant_decide_between_two_majors/egz2b4a/", "text": "What possible career paths are you interested in? ", "author": "puffy-jacket", "created": 1550776343, "upvotes": 1}}}