{"sid": "jefnc3", "link": "/r/CollegeMajors/comments/jefnc3/sophomore_switching_from_psych_major_any_ideas/", "title:": "Sophomore switching from psych major, any ideas for a major?", "text": "I am a sophomore in college currently and so I am running out of time to settle on a major.  I already started out with pre-nursing but the following semester I changed to a psychology major.\n\nThough I like psychology a lot, I have been unsure about actually pursuing this field because many of the better career options require a PhD.  I honestly don't really want to get a doctorate unless I'm really passionate about something and thus far I haven't been felt that way about a career.\n\nI understand that I may never necessarily feel this \"passion\" for a career, but I'm just not sure that being a therapist is for me.  But if I don't do psychology, I honestly don't know what to do.  I am good at conceptual things but also work pretty well with logic, so maybe I am just intimidated by my options but idk.  Any ideas for careers?  I do like the idea of STEM field work because I really do like maths and sciences, but I will go outside of that. Stuff like business and computer science doesn't really interest me all that much.", "author": "big_innuendo", "created": 1603157211, "retrieved": 1632847177, "over_18": false, "upvotes": 6, "upvote_ratio": 0.88, "comments": {"g9qmg8m": {"link": "/r/CollegeMajors/comments/jefnc3/sophomore_switching_from_psych_major_any_ideas/g9qmg8m/", "text": "It sounds like your main concern is figuring out how to prepare for a career you would like that doesn’t require a PhD. In that case, I’d like to put this thought out there: What you major in matters far less than what you do outside of the classroom. This was definitely true for me — I’m an English major who got a job in digital marketing after college. Most of my coworkers also did not study marketing in school — they studied psychology (like you!) or economics or art or didn’t graduate from college at all. We each got our first industry jobs because of (paid or unpaid, often 10-20 hours per week) internships, having connections we didn’t realize we had through school organizations, learning by building our own blogs, volunteering, stuff like that. If you like psychology, stick with it. You just need to think about what kinds of skills you want to use or activities you might like doing at work. Do you like writing? Researching? Analyzing? Talking to people? Helping people? Research jobs that include those skills or activities, and then put yourself out there by interning or volunteering somewhere where you can find out whether you like it or not (and also meet people who can help you get a job). Look for internship info on your school career site. You can also do informational interviews with alumni who ended up in jobs that sound interesting. You don’t even have to know them — just reach out on LinkedIn to ask how they got their jobs. Do this even if it seems scary or awkward or difficult, because this is the way people really get jobs and figure out what they want to do. A lot of people are really happy to help! Remember, they were probably in your shoes not that long ago. Ask about what they do and how they got into it. You will come out armed with meaningful information and skills that will help you make a career decision.\n\nAlso: There are some good marketing and communications career options for conceptual people. It’s NOT all sales. Look into digital marketing, communications, and PR in particular. You might enjoy content marketing or working in marketing strategy (note: strategy is something you can only get into after you get some other marketing experience). Again, if you think you might be interested in this, the best way to get your foot in the door is not necessarily to major in marketing, but rather to get a (probably unpaid, at least for a first internship) marketing internship, maybe at a local nonprofit. You get the experience you will need to get a first real job AND connections who can help you after college. Regardless, you won’t know if you like it until you try it!", "author": "Lily9879", "created": 1603439488, "upvotes": 3}, "g9f5rc6": {"link": "/r/CollegeMajors/comments/jefnc3/sophomore_switching_from_psych_major_any_ideas/g9f5rc6/", "text": "What do you like doing the most? What is your greatest interest?", "author": "Cheran_Or_Bust", "created": 1603190597, "upvotes": 1}, "g9eqs4l": {"link": "/r/CollegeMajors/comments/jefnc3/sophomore_switching_from_psych_major_any_ideas/g9eqs4l/", "text": "Take a break, don't waste more time/money flopping between choices. Come back when you have a solid idea.", "author": "Reav101", "created": 1603174348, "upvotes": 3}}}