{"sid": "pg4m2z", "link": "/r/CollegeMajors/comments/pg4m2z/what_should_i_major_in_please_help/", "title:": "what should i major in? please help!!", "text": "hi! i am a senior in high school and i've started to think about what to major in but honestly i'm completely lost. i don't know what to do. (it also doesn't help that my family full of engineering and science majors tells me i'm going to be useless if i don't go into stem)\n\nmy passion: writing, journalism, media, etc. as in... i've been writing since i was a child. won a scholastic art and writing award, a couple local awards, did my school yearbook, had internships with some solid magazines.\n\nother interests: marketing, pr, psychology, law... basically things involving interaction, communication, and how people are. i guess, social sciences?\n\nhow i feel about stem: i understand computer science, physics, most advanced maths, if i actually take time to learn it. so, i could do it, i just don't really enjoy it at all.\n\ni really want to go into a major that will be worth the money i put into it! i want all of my education to result in a job that makes MONEY!\n\nwhat major would you recommend to me? and what are some paths i could take in life, for higher education + careers?", "author": "Present_Curve_1043", "created": 1630535157, "retrieved": 1632958231, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"hba0o1z": {"link": "/r/CollegeMajors/comments/pg4m2z/what_should_i_major_in_please_help/hba0o1z/", "text": "I would not recommend going to CC (like the other poster recommends) unless you are strapped for cash or are completely lost and think you will not figure out a major in a few semesters. CC has some disadvantages, namely that you miss out on making friends/connections with other students, and it can be harder to get into the college you want as a transfer (depends on what school you are transferring to, though). You will have more opportunities at a four year college. \n\nAs for majors. If you are concerned a lot with getting a degree that will pay well (I'm assuming this based of your second to last sentence), you have some options. Engineering, business (Accounting, IT, finance are generally the best paying business majors), or computer science are all relatively decent paying degrees.", "author": "postmaloneismediocre", "created": 1630557048, "upvotes": 1}, "hb9pkf3": {"link": "/r/CollegeMajors/comments/pg4m2z/what_should_i_major_in_please_help/hb9pkf3/", "text": "My advice for you is to go to community college, and figure it out there. It's much easier to pivot majors, and you have more time to think about what schools you want to apply to. Try different classes and see what you enjoy the most. \n\nI know this isn't the answer you're looking for, but since you don't know what to major in I think this is the best option.", "author": "tha_oz", "created": 1630551042, "upvotes": 1}}}