{
  "sid": "e58xy1",
  "link": "/r/CollegeMajors/comments/e58xy1/advice_for_choosing_majors_needed/",
  "title:": "Advice for choosing majors needed",
  "text": "Hey guys, I'm currently a junior in high school and for most of my life until sophomore year, I was interested in getting stem-related jobs and wanted to be a pharmacist. However, ever since I did complete garbage in chemistry, my thoughts have changed. Every single year, freshman to junior, the classes I do worst in are math and science, which I think say a lot for what I should do in the future. Moreover, the only classes I'd say I'm decent in are history classes but I'm not that interested in things such as law or teaching. Regarding personal interests, there's nothing in particular; I just play video games and listen to music and I don't think I'm too into these things either so at this point I'm just lost and need help for deciding what to do. Thanks for reading and please reply :))",
  "author": "scarytears",
  "created": 1575334996,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "f9j3xuh": {
      "link": "/r/CollegeMajors/comments/e58xy1/advice_for_choosing_majors_needed/f9j3xuh/",
      "text": "You have time to figure it out don't stress too much",
      "author": null,
      "created": 1575355135,
      "upvotes": 1,
      "replies": {
        "f9j401s": {
          "link": "/r/CollegeMajors/comments/e58xy1/advice_for_choosing_majors_needed/f9j401s/",
          "text": "Idk man been thinking about it for a long time and don't really know my interests (I have no hobbies)",
          "author": "scarytears",
          "created": 1575355206,
          "upvotes": 1,
          "replies": {
            "f9janj6": {
              "link": "/r/CollegeMajors/comments/e58xy1/advice_for_choosing_majors_needed/f9janj6/",
              "text": "Yeah I'm in the same position I never thought abt it bc I did illegal stuff to make money than that isn't work and now I'm in college and didn't think about it bc I dropped out of CC twice first to do illegal than needed up a carpenter. Than to join the military realized I didn't believe in it. Now I'm a semester in same age as normal bc I graduated a year early. Either going to do psychology, or buisness management. \n\nI never liked the idea of either but recently have no more drive to do dangerous and \"fulfilling things\" bc everything revolves around money. I wanted to do ecology/ environmental work suck at math so that's out. There is a couple things I wouldn't mind i.e. Associates in physical therapy couple others but I'm content with whatever I'll go into tbh just accepted it. Everyone needs money so gotta do something but I used to worry about it a lot now I don't so much. Hate college so probably gonna only do an associates but excited to start working hate being poor and school so lol",
              "author": null,
              "created": 1575364236,
              "upvotes": 2,
              "replies": {
                "f9jwb24": {
                  "link": "/r/CollegeMajors/comments/e58xy1/advice_for_choosing_majors_needed/f9jwb24/",
                  "text": "Holy fuck you've been through some shit yourself. Wish you good luck we've got a lot ahead of us.",
                  "author": "scarytears",
                  "created": 1575387315,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634060807
}