{"sid": "p4a49n", "link": "/r/CollegeMajors/comments/p4a49n/what_should_i_study_in_community_college_to/", "title:": "What should I study in community college to transfer to a 4 year and major in MIS (Management Information Systems)", "text": "Title. I want to go to community college first, I’d figure it’d be more beneficial for me since I only have a GED. I could transfer to a better 4 year college afterwards. What would I need to study in CC to transfer and major in MIS at a University?", "author": "acotwo", "created": 1628955041, "retrieved": 1632958302, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"h9uof9b": {"link": "/r/CollegeMajors/comments/p4a49n/what_should_i_study_in_community_college_to/h9uof9b/", "text": "Talk the university you want to attend after 2 years. They know what courses are easily transferable from CC. Check several uniscversities that you can afford.", "author": "9alby9", "created": 1629592132, "upvotes": 1}, "h908nz2": {"link": "/r/CollegeMajors/comments/p4a49n/what_should_i_study_in_community_college_to/h908nz2/", "text": "Assist will help you if you’re in California. Usually MIS is in the Business school. You will probably be taking accounting.", "author": "tha_oz", "created": 1629012070, "upvotes": 1}, "h8xd8i2": {"link": "/r/CollegeMajors/comments/p4a49n/what_should_i_study_in_community_college_to/h8xd8i2/", "text": "Hey there! Most MIS majors, at least that I’ve seen, fall under the business department. So if you want, maybe study business administration to transfer because at university you will need some classes in your lower division that you would usually take at a CC. \n\nThere have been some schools where MIS falls under stem so it just depends what universities you are targeting to go to after CC. You should check their programs and what department they are in and maybe even see if you can speak to someone about it for more detailed questions.", "author": "twin0912", "created": 1628958616, "upvotes": 1}}}