{
  "sid": "grskry",
  "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/",
  "title:": "Having Trouble Picking A Major?",
  "text": "\nHey, so I’m trying to decide what to major in for college. I want a major that will get me a good job, and will have many different career paths. I want a degree that will get me good pay too. At least $65,000+. I know that might be hard to get, but I’m willing to do it. I know the STEM careers are in demand, but I’m not really good with STEM, except for the science field. Specifically biology. I want a degree that can pay well, but that I’ll also enjoy, and will have a good job outcome.\n\nMy future plan is to become a lawyer. I’m thinking about becoming a real estate, estates, educational, or mental health/disability/health lawyer. So, it may be useful to get a degree that ties into that. I do have a list of majors I’m considering, but I’m not sure if they’re good for what I’m seeking. I like helping people, gaining knowledge, and challenging myself. I want a major that can lead to a respected career that can be high-achieving (that’s hard to get with only a bachelor, I know). I’m really interested in crime, history, law, politics, sociology, and psychology, but those aren’t good degrees to pursue, so I’m stuck.\n\nAny recommendations would be helpful. I want a degree that I can fall back on in case becoming a lawyer doesn’t work out.",
  "author": "OkFondant0",
  "created": 1590614283,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "fvpqogm": {
      "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fvpqogm/",
      "text": "I’d suggest a social work degree as it’s a stable field (at least where I’m from) and has a decent pay while also including some of your interests. It might even give a great background for law. I know someone suggested this but economics or statistics can be pretty well paying too.\n\nI saw that you don’t like STEM except for bio so maybe something in health?",
      "author": "angelic_angelx",
      "created": 1592889210,
      "upvotes": 1,
      "replies": {}
    },
    "fs1h56s": {
      "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs1h56s/",
      "text": "careerexplorer.com it takes 30 mins- 1 hour. If you are stuck, put some serious time into this test. I recommend this to a lot of people.",
      "author": "holciamp",
      "created": 1590628136,
      "upvotes": 1,
      "replies": {
        "fs1i53v": {
          "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs1i53v/",
          "text": "I took it, and I got mostly lawyer, legislator, and forensic psychologist. Just to name a few. I don’t know good degrees for those. And the ones I do know aren’t reliable",
          "author": "OkFondant0",
          "created": 1590628703,
          "upvotes": 2,
          "replies": {
            "fs1jjs2": {
              "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs1jjs2/",
              "text": "That’s understandable. At this point, I suppose all I can suggest for advice is starting off with something reachable and realistic until you work your way up in the field and get the job you’re looking for. \nAs much as I don’t recommend law school or going into politics because they are very unforgiving and relentless, if you think you can handle those fields and help yourself along the way, then I think you could definitely pursue either. \n\nAlternatively, to better narrow your interest; What do you want to do for people? How do you want to solve their problems? What is it that you want to go into those fields to get a better grasp on? What is  something you want to change?",
              "author": "holciamp",
              "created": 1590629493,
              "upvotes": 1,
              "replies": {
                "fs1ldwm": {
                  "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs1ldwm/",
                  "text": "I’m not worried about anything to do with my law passions. I got that basically sorted out. But I know law and political science would not get me a good fallback job. I could care less about the challenges they give, I love a good challenge.\n\nWell, I love fighting for people, and helping them. I like to make sure everyone gets the justice they deserve. For instance, I don’t want to see a dad lose his kid when the mom is abusive and a terrible parent. In my opinion, that kind of case needs justice. I love fighting for my social issues. I’d LOVE to be a legislator, but I’d probably have to be elected, which I don’t know about all of that.\n\nNow personally for educational law, I want to make sure kids are getting the education they deserve. I also wish the educations system was different, but I can’t change that as a lawyer. For mental disorders/disabilities, I have a mental disorder, and that holds a place in my heart. I see a lot of people with mental disorders get misrepresented, or don’t get  fair chances, and I want to make sure they do.\n\nThen real estate law just sounds like fun, honestly. I love house hunting, and helping people start a happy new life (yes, I know, I’m making this seem better than it is). It’s also a type of law that will always be needed, and that I will probably do good in as a lawyer.\n\nBeing a lawyer is my dream, but in case things go wrong, I need to make sure my backup plan is good too",
                  "author": "OkFondant0",
                  "created": 1590630542,
                  "upvotes": 1,
                  "replies": {
                    "fs1ms6d": {
                      "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs1ms6d/",
                      "text": "Hopefully this might help or give you a better idea of what you might end up doing when you go into either field. \n\nInfo about back up jobs for a law degree\n• https://www.usnews.com/education/best-graduate-schools/top-law-schools/slideshows/10-diverse-careers-for-law-school-graduates\n\n• https://law.olemiss.edu/career-services/student-resources/what-can-you-do-with-a-law-degree/\n\nInfo on (Law) Public Policy jobs \n• https://www.bestcolleges.com/careers/law/public-policy/\n\n• https://publicpolicy.pepperdine.edu/blog/posts/what-can-i-do-with-a-master-of-public-policy-degree.htm\n\nInfo on real estate\n• https://www.kapre.com/resources/real-estate/do-i-need-a-college-degree-to-be-a-real-estate-agent/\n\n• https://bigfuture.collegeboard.org/majors/business-real-estate",
                      "author": "holciamp",
                      "created": 1590631341,
                      "upvotes": 1,
                      "replies": {
                        "fs1nwbe": {
                          "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs1nwbe/",
                          "text": "Thanks for the sources",
                          "author": "OkFondant0",
                          "created": 1590631979,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fs100e8": {
      "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs100e8/",
      "text": "Law school doesn't require a specific major. Don't major in something unviable like Poli Sci, find out you don't want to do law and are then stuck with a useless degree.\n\nAll you have stated is \"I want a high demand, well paying job\" which would entail some form of engineering, computer science, or Actuarial science. If you don't think you have what it takes for that then go into Accounting or nursing.\n\nOne thing that google searching \"I want to become a lawyer\" or  \"How much does a lawyer make\" doesn't tell you is that the big firms that give those stereotypical *large* lawyer salaries only hire from T14 law schools. It's not just about getting accepted into law school it's about getting accepted into the *right* law school. Going to a T50 or T100 law program will still cost upwards of over $100k in debt but won't qualify you for those large salaries and career growth opportunities. So, unless you can comfortably rely on getting into a top law program or somehow get a full ride at some lesser school then it can often times not be worth the amount of debt your would acquire.",
      "author": "Reav101",
      "created": 1590618794,
      "upvotes": 3,
      "replies": {
        "fs18i2v": {
          "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs18i2v/",
          "text": "Well, that’s why I’m here. I understand that law doesn’t require a specific major whatsoever. That’s why I’m trying to pick a degree that’s good to fall back on. As I said, I’m not majoring in anything like Political Science because it’s useless.\n\nHonestly, I just want a job I enjoy that’s challenging, and pays well. I know I can accomplish that because I’m a great student that’s very well-rounded. I don’t mind a challenge. I know most bachelor’s don’t give you much money without getting a graduate degree. But I’m just trying to see what I can get out of it. I don’t need to be a millionaire. I mostly just want a degree that can at least get me $70,000+ pay (middle class).\n\nAlso, I stated this in my post, I WOULDN’T be good at STEM. STEM bores me in general, the only part of STEM that I’d be good at is the science portion, specifically something like biology. When it comes to math, I can do algebra pretty well, and I can understand basic math. I was thinking about pursuing a finance/accounting degree, which works fine with law, BUT in the event I don’t become a lawyer, then I mostly likely would become an accountant or something with finance.\n\nI already know off the bat that there’s a good chance I’d find my job boring. I may be good at it, but I sure as hell would hate it. Which I don’t want.\n\nAlso, I’m aware that law schools are expensive. That’s NOT my main concern right now. I will definitely be figuring that out in the future, but my main concern right now is my major/backup plan. Also, I’m aware of the fact law “sucks” and it’s not “worth”it. Personally, I get that, but it’s not changing my mind or my passion. I’m gonna work my butt off. Save up money as best as I can. I’m a really good student. I love a challenge, and I’m gonna attempt to do this. I would never go to a terrible law school in my life. I already have a law school in my mind. Thank you for making me aware, but this is what I want, it holds a place in my heart.",
          "author": "OkFondant0",
          "created": 1590623353,
          "upvotes": 1,
          "replies": {
            "fs1hseo": {
              "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs1hseo/",
              "text": "based on your responses, I would actually recommend economics with maybe a double major in history or political science. This really depends on the prestige of your school, though, but a lot of people with Econ majors at my school ended up going into consulting or investment banking, both of which are very lucrative. Do some research into what kinds of companies recruit from your school, but I bet a lot of insurance companies and banks recruit Econ majors. It's also good because it has a lot of overlap with other fields, and a lot of people I know who majored in Econ did a joint major in Econ-political science, or studied history or sociology along with economics. The downside is that you do need to go to a school that gets recruited from (although I'm not sure about the specifics for this, since I did not hang around a lot of the Econ majors at my school), and it requires a decent amount of math, although most of this math is calculus, so nothing terribly advanced, but not easy either.\n\n&#x200B;\n\nYou may also be interested in computer science, which is a major that I'm studying, and I'm happy to answer any questions about that.",
              "author": "BetUrProcrastinating",
              "created": 1590628505,
              "upvotes": 2,
              "replies": {
                "fs1ih0u": {
                  "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs1ih0u/",
                  "text": "Computer science is a no. I would die. No way. I used that as an example because I’d hate it. I thought I even said that?\n\nI don’t know how I’d do with business or anything like finance. I may get bored, I don’t know. By the way, I’m not even in college yet. And I don’t think a double major would be wise at all for me. Not a good idea. Heard some real bad things about that. I was thinking about economics, but I don’t know if you can get any good careers with that",
                  "author": "OkFondant0",
                  "created": 1590628890,
                  "upvotes": 1,
                  "replies": {
                    "fs1jv61": {
                      "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs1jv61/",
                      "text": "sorry, your comment about not wanting to do CS was in a different comment chain, didn't see that.\n\n&#x200B;\n\nYou can 100 percent get great careers with Econ. In fact, at my school, the two most popular majors are Econ and computer science, and many of the Econ majors go on to work as analysts at JP Morgan or Goldman Sachs and earth 100k+ after a year or two of working. A lot also go into consulting, which is like giving advice to businesses about how to be more efficient and cut costs (or something like that, not many of my friends went into the field), and they can get paid similarly outrageous salaries. And I bet a bunch of other Econ majors at my school got jobs at insurance companies, project management jobs, etc.\n\n&#x200B;\n\nThe downside is that these jobs are really competitive, and you have to network a lot and get high grades to get them. You also need to go to a target school to get these really lucrative jobs at top investment banks, but I'm sure that even if you don't go to a top school you can get finance jobs at banks or jobs at insurance companies with an Econ degree. I also wouldn't write off a double major, if I were you! I know a lot of people who double majored, the Econ majors normally double majored in political science, and my room mate majored in computer science and English. Double majoring is good if you schedule well, since it gives you a break from the other classes you're taking. So if you major in Econ and double major in something like English, you won't get burnt out by just taking Econ classes. Econ isn't an easy major, however. It's not as bad as like pure math, but there is a good amount of math in the degree. Econometrics, a mandatory class for Econ majors, is pretty much a statistics class. But it still is a very diverse degree, and I know people who majored in it who specialized their courses in the history or politics surrounding economics, which actually seems very intriguing to me.\n\n&#x200B;\n\nAlso, I know you nixed it, but have you tried computer science classes at all? You might like it if you haven't! lol",
                      "author": "BetUrProcrastinating",
                      "created": 1590629671,
                      "upvotes": 2,
                      "replies": {
                        "fs1kp55": {
                          "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs1kp55/",
                          "text": "Oh, sorry, I thought I mentioned the CS comment here.  My mistake.\n\nAnother thing I’m afraid of is that yes, an economics degree is good, and In demand, but because it’s in demand, it’s gonna be competitive. Which is fine, but I don’t want to get screwed over. I’m a good student, I think I can get into a pretty good school. It doesn’t have to be an Ivy League, but I can go pretty high. I don’t want to brag, or anything. I don’t like doing that, but I believe I can do it. \n\nThe problem is, I can do basic math, and well. But is it gonna bore me? I’m probably gonna have to say yes. There were some math lessons that I liked, but after a week, I was so done with it. Imagine me doing that for the rest of my life. I’m just so stuck because I know my strengths are history, politics, sociology, psychology, crime, etc. But they just don’t have too much value. Or I can’t find a degree in that area that would be valuable, or get me a good fallback job. \n\nI’ve taken computer classes before, and it’s not for me. I’m just not about technology like that, I also hate sitting all day. Which I understand that’s most jobs, but some jobs have a mix of both standing/sitting. I’m picky, I know. Lol. But thank you for your recommendations.",
                          "author": "OkFondant0",
                          "created": 1590630147,
                          "upvotes": 1,
                          "replies": {
                            "fs1mfg2": {
                              "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs1mfg2/",
                              "text": "well the good news is that most of the people who majored in Econ at my school and went on to get jobs in finance or consulting don't do much math in their jobs. For some reason, finance jobs hire people with Econ majors even though economics has like nothing to do with what the job is (weird, I know). And yeah, sociology, psychology, politics, and history don't have the best job outlooks, and that can be disappointing to someone who finds them interesting. But this reminds me that most people actually don't get to do what they find interesting. Even the people who are interested in math and physics, and end up majoring in  engineering. Most engineers don't actually use that much math in their jobs, mainly they just focus on plugging numbers into spreadsheets and computer programs. In a way, sometimes I feel that the only people who actually get to study what they love are academics. Everyone else studies what they find interesting in college, and then they spend the rest of their lives applying a watered down version of that to whatever job they end up doing. \n\n&#x200B;\n\nbut at the same time, that kind of view can be overly pessimistic, and a lot of people end up enjoying their jobs. I think a lot of it can actually come down to outlook. You can study something maybe you didn't find to be the most interesting, and over time, you may find that the subject has grown on you a lot. in fact, that's kind of what happened to me, and I ended up majoring in a subject that I thought I never would have been interested in at the start of college, lo. IDK, sorry I can't really offer you any more advice, but these kinds of questions can be very hard. And there's always the option of actually studying those subjects you mentioned - history, politics, psychology,  sociology - it just depends on how passionate you are. Going to law school or med school or grad school isn't a bad decision if you know you want to dedicate your life to one of those subjects.",
                              "author": "BetUrProcrastinating",
                              "created": 1590631142,
                              "upvotes": 1,
                              "replies": {
                                "fs3na4m": {
                                  "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs3na4m/",
                                  "text": "Well, does economics require a lot of math in the degree? I heard that there was a BA of Economics, then a BS of Economics. I’m not sure which ones is better. I also heard you could get into government jobs with it",
                                  "author": "OkFondant0",
                                  "created": 1590681857,
                                  "upvotes": 1,
                                  "replies": {
                                    "fs5jrjf": {
                                      "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs5jrjf/",
                                      "text": "it requires some math. Not as much as an engineering or physics degree of course, but you do need to know calculus and some statistics for some of the required classes. But it's not anything ridiculous, and anyone who is at least OK at math should be able to deal with it. \n\n&#x200B;\n\nI haven't heard of anyone getting a BS in economics. BS means that you go to an engineering school, and in most colleges economics is taught in the liberal arts school. I'm sure you could get government jobs with an Econ degree, but more money is probably involved in going into banking, consulting, or insurance in most cases.",
                                      "author": "BetUrProcrastinating",
                                      "created": 1590716058,
                                      "upvotes": 1,
                                      "replies": {
                                        "fs5svpc": {
                                          "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs5svpc/",
                                          "text": "Well, do I have to take calculus and statistics in high school in order to take it? I’m okay with East math and algebra, just have trouble remembering the formulas. \n\nI’m just trying to assess what a good degree for me would be because. I’m taking pre-calc next year, then maybe calculus or statistics after that? Then I’m done with high school for good.",
                                          "author": "OkFondant0",
                                          "created": 1590721365,
                                          "upvotes": 1,
                                          "replies": {
                                            "fse0qbw": {
                                              "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fse0qbw/",
                                              "text": "you should probably take calc 1 in high school, if you want to take Econ as a major in college. you can probably catch up in stats in college, but definitely take calc as soon as you can in HS.",
                                              "author": "BetUrProcrastinating",
                                              "created": 1590897591,
                                              "upvotes": 1,
                                              "replies": {
                                                "fsexc0w": {
                                                  "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fsexc0w/",
                                                  "text": "Okay, so I looked at an economics class on YouTube for college, and I hated it lol",
                                                  "author": "OkFondant0",
                                                  "created": 1590925246,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fs0vtvb": {
      "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs0vtvb/",
      "text": "Be careful with STEM. There are false assumptions about STEM majors. STEM is in demand but it is more saturated and competitive than other fields. Depending on the STEM field. Please visit the BLS Career Outlook website to figure out which career path is most saturated.",
      "author": "DetectiveTacoX",
      "created": 1590616651,
      "upvotes": 6,
      "replies": {
        "fs0vzxr": {
          "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs0vzxr/",
          "text": "I will give a tip but you can disregard it. Don't choose a major you don't like to learn and don't choose a career JUST because of money. Money is pointless when you are depressed + debt.",
          "author": "DetectiveTacoX",
          "created": 1590616735,
          "upvotes": 2,
          "replies": {
            "fs19exb": {
              "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs19exb/",
              "text": "Of course. As I stated in my post, I UNDERSTAND that I shouldn’t be picking a major just for the\nMoney. Which I’m not doing. If I was, I’d be saying, “Oh, a computer science degree it is.” But I’m not because I wouldn’t enjoy that. That’s why I’m here, and that’s why I listed some of my interests. But the unfortunate thing is that most of the areas of interest I have don’t lead to valuable career paths. Also, I’m doing everything in my power to get a full-ride or tons of scholarships.\n\nI’m a great student, and very well-rounded. I’ll probably be a good candidate for a scholarship, and I do sports on top of that. So, there’s always a chance that I get an athletic scholarship. I’m also saving up money on top of that.\n\nI’m just lost because accounting is a good degree, and I’d be good at my job because it’s basic math, which I do very well, but I would be bored to death. I just don’t know a good major to fall back on because I LOATHE most STEM careers, unless it’s a certain science. Also, you’re right, it’s a VERY competitive field due to its demand.\n\nI’ve been doing my research, trying to see what I’m good at. I’m may be good with a certain type of business degree. But I have to be careful if I choose that. I’ll totally look at the website you suggested. It’s a shame that most of my interests don’t lead to the greatest career paths, especially since I’m a high achiever.",
              "author": "OkFondant0",
              "created": 1590623855,
              "upvotes": 1,
              "replies": {
                "fs2fxdm": {
                  "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs2fxdm/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1590652072,
                  "upvotes": 1,
                  "replies": {
                    "fs3meye": {
                      "link": "/r/CollegeMajors/comments/grskry/having_trouble_picking_a_major/fs3meye/",
                      "text": "That’s true. But I’m not even sure if I want a STEM degree, or if it’s even good for me",
                      "author": "OkFondant0",
                      "created": 1590681459,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634059770
}