{"sid": "gu4az2", "link": "/r/CollegeMajors/comments/gu4az2/im_stuck_on_what_to_do_and_dont_know_what_to/", "title:": "I’m stuck on what to do and don’t know what to choose. I’m afraid of my future from all this stress over the major I want to do for the rest of college.", "text": "I am currently a political science major and just about to start my second year of college this summer and I am not sure if I want to change it to something else. I have always been in love with technology and wanting to work with Apple or Google as my life goal. However, I am also interested in politics and government jobs and the idea of foreign service and working in an embassy as a diplomat abroad. Law enforcement has also been on my mind, however I have also just came to the conclusion of having a good job, family, and house. My first major was computer science, but I changed to political science because of the math that discouraged me. I’ve recently been looking at switching from PoliSci to computer information systems. Would this be a good move? I’ve heard it’s less math and more on hands about using technology which I love, and will it help me land a good job ? I haven’t done coding before or programming but it’s a learning process of course but I just would like to have a job to use technology. I’m so stuck...", "author": "javietorres2001", "created": 1590950183, "retrieved": 1632956748, "over_18": false, "upvotes": 11, "upvote_ratio": 1.0, "comments": {"fshdw8j": {"link": "/r/CollegeMajors/comments/gu4az2/im_stuck_on_what_to_do_and_dont_know_what_to/fshdw8j/", "text": "honestly I would recommend doing computer science. It's probably going to be harder than CIS, but the material is way more interesting and it gives you a lot more options.", "author": "BetUrProcrastinating", "created": 1590975764, "upvotes": 2}, "fshath2": {"link": "/r/CollegeMajors/comments/gu4az2/im_stuck_on_what_to_do_and_dont_know_what_to/fshath2/", "text": "Just do information system. It way easier than CS, less about coding and more about using software to do stuff, database and yeah as you say, no math class and they still pay well.", "author": "withaining", "created": 1590974011, "upvotes": 3}}}