{
  "sid": "oviuiq",
  "link": "/r/CollegeMajors/comments/oviuiq/exercise_science_nutrition_sports_science/",
  "title:": "Exercise Science, Nutrition, Sports Science, Philosophy or Logistics? Passion Vs Practicality.",
  "text": "Hey all. The title says it all. Long story short, I've worked in logistics for the past decade. I'm good at it too. I've driven eighteen wheelers, forklifts, worked as a dispatcher, driver manager, freight broker, worked in and around distribution centers, etc. \n\nI know a lot about distribution, freight and freight management. I am currently driving a truck on a dedicated account. I may move though and someday I want to move up the ladder. I also really want to have a degree, something in life I desperately want to accomplish.\n\nI've been told a lot of jobs in distribution management require very long work hours instead of more set schedules and am not sure if this is true or not. I definitely want a better quality of life, not long hard hours forever. But I feel with my knowledge of the industry the path of study would be interesting and not incredibly difficult.\n\nOn the flip side...\n\nI am BIG BIG BIG into fitness. I am a triathlete and know my ship has sailed to be any kind of professional but I absolutely love health, fitness, exercise and nutrition. I would LOVE to work coaching professional level athletes, especially within the world of cycling, but any form, sport or type of fitness I would enjoy. I like showing my knowledge on all things fitness and know I would be passionate about it, but I've been told I would never make much with a degree in exercise science, even with a master's? Not sure how true this is.\n\nI've also contemplated a degree in nutrition as I also love anything to do with diet and food, although I think I prefer the exercise side of things to it. I just love doing anything fitness and health related.\n\nOne last sort of wild card option is philosophy... I do this shit on a daily basis without trying and have studied philosophy for years but again, have heard a degree in it is very low paying and not a good major. So I haven't considered this one very heavily.\n\nI think Exercise Science is at the top with Nutrition and Logistics equally under it, but am open minded and just want any information possible.\n\nThanks, everyone!",
  "author": "AlmightyApkallu",
  "created": 1627779968,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {},
  "updated": 1634060337
}