{"sid": "mgy3m3", "link": "/r/CollegeMajors/comments/mgy3m3/data_analyticsfinance_in_2_years_or_cs_in_3/", "title:": "Data Analytics/Finance in 2 years or CS in 3?", "text": "Hello Everyone\n\nSo I am very unsure as to what I should do. Last year I was let go from my job 4 days before my first child was born. I was 30 and had never been let go. I have always been in sales but suddenly could not find even an SDR role to get a callback. With a family to support, I began applying to anything so I could begin earning and made the decision I had to get my degree so that I would not be in the position not getting even looked at for jobs I was capable of simply for not having a degree. In the summer is signed up at a few community colleges and I took 16 units, last fall I took 31 and applied for and was accepted as a transfer to my state university as a business major concentrating in data analytics as well as finance. \n\nThis semester I am taking a CS class and have gotten pretty into it. After doing a bit of research CS seems to be a better career option for the future, better work-life balance, less likely to automated, good earning potential. So I have been thinking of switching majors but this would set me back an entire year and I would have to rescind my acceptance to the university and I am just not sure that it is all worth it. \n\nI am in my early 30's, wife, young child, I work full-time in an office the business classes have been manageable and I do enjoy them a lot. But, I have also enjoyed this programming class and the udemy courses I have been taking to see if this is something I could do. \n\nIs it worth it to switch? Should I just stick it out with what I have been doing? If I did switch would I face any issues finding work seeing as I would be a new grad at 35?", "author": "NCBartender14", "created": 1617164889, "retrieved": 1632846940, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"gvcdtei": {"link": "/r/CollegeMajors/comments/mgy3m3/data_analyticsfinance_in_2_years_or_cs_in_3/gvcdtei/", "text": "Data analytics sounds good for your situation, and has that quicker turn around, but is it possible for you to learn CS on the side or get some type of certificate for it?\n\nEven if not, you seem to have a pretty solid plan given what you've already accomplished. Good luck with your degree!", "author": "neptunianso", "created": 1619024642, "upvotes": 1}}}