{"sid": "dfsfw6", "link": "/r/CollegeMajors/comments/dfsfw6/pathway_to_studying_european_history/", "title:": "Pathway to studying European history.", "text": "I am 27 and currently work in a Call centre in Brisbane, Australia. I have a passion for history, specifically 19th-20th Century European/German/Russian history. I studied history and German briefly through a BA at Flinders University, and then at the Australian National University. Due to poor health, I had to defer back in 2015 (Crohns/Colitis ). Since then I have just been working and focusing on my health, which now I am at a point where I am in histological remission and I am of health I haven’t been in since before being diagnosed 10 years ago, which is amazing.\n\nI have now come to a crossroad where I need to make some key decisions in my life, particularly in regard to what I want to achieve, which for a long time my health has been a pretty big roadblock. I would love to go back and continue my studies, even if it means having to start from scratch. The study I did do gave me a taste of what’s involved and expected if I go down such a path; so I am not going in completely blind. I have a base understanding of historiography, research process' and essay writing, that I have been able to do some personal research on the side.\n\nI am constantly reading, listening to lectures, and building a little archive of sorts of information pertaining to my interests/focus'. The main areas I'd like to focus on is that of Ideology/Age of extremes (long 19th Short 20th century), particularly the paths of Germany and Russian into modernity, and also military history/operational theory of the two. \n\nWhich brings me to the purpose of this post; what are people's suggestions/experiences/thoughts as to the best way to go about pursuing this? If I am to do this I want to do it right. I know it will be a long road that will require dedication and hard work, and I am open (expecting really) to be needing to move to Europe (Germany in particular) to effectively do the study and learn the languages. I guess I am trying to work out the best Universities/options for this. I have done a bit of a search into this but there is a slew of options that come up, which is overwhelming. In essence, I know what I would like to pursue but unsure as to what the best options for doing so are.\n\n I have a great deal of ambition for pursing history, something which I haven't had for most of my life. I want to be able to put it to use, rather than just staying in the status quo day in and out. I know there is a risk to come out of it at the end and still be stuck in a menial job, but I'd rather pursue my passion than just stay where I am out of fear of failing. I can always come back to my current job in the end.", "author": "SonsofKairos", "created": 1570679464, "retrieved": 1632957968, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"f35nzdj": {"link": "/r/CollegeMajors/comments/dfsfw6/pathway_to_studying_european_history/f35nzdj/", "text": "Firstly, a little jealous because I've always wanted to live in Germany too. I did live in UK for a couple years and whilst it's nice to be living elsewhere, you do still need to remember that you have to support yourself. \n\nI went back to studying after a while and I chose Open Unis here in Aus because it allows me to continue to work and study on a flexible schedule. Perhaps you can look at an option like that, where you could study online.\n\nThe other option is that many unis in Aus have partnerships with those abroad, you could study through one that gives you the credits of studying overseas and still gaining that cultural experience in a sense so that when you move over, you have a good base to start off on. I once had students from Scandinavia is one of my uni courses. \n\nAlternatively, a quick Google for work and study abroad agencies. They often help with trying to find you the right place to study and work so you can be set up for when you go over.", "author": "frankestofshadows", "created": 1570683475, "upvotes": 2}}}