{"sid": "d59n1q", "link": "/r/CollegeMajors/comments/d59n1q/need_help_with_switching_my_major/", "title:": "Need help with switching my major", "text": "I’m currently a freshman in college and I’m a music performance major. I play Tuba and if you are unaware, tuba performance jobs are incredibly difficult to get, and many professional tuba players can go years without having a consistent job, just a lot of stuff on the side. To be clear I’m not in this for money, I genuinely enjoy learning about computers and consider myself pretty tech savvy as I was absolutely obsessed with computers throughout middle school and most of high school. And I really enjoy playing tuba, but I’m slowly learning I do not like being a music major, I’m just always unhappy and dislike all of my classes. Originally I wanted to do something with computer science/engineering in high school but around junior year I stopped pursuing that because my high school had a very competitive and often toxic environment and constantly pressured people to choose a major (the actual high school but mostly the students were mostly responsible for this) I’m a little rusty when it comes to math as I didn’t really take much my senior year and don’t think I have a good enough background in math (and could use some classes to get started on coding again because it’s been a while since I did that) my current university doesn’t have a computer science major, but one a few blocks away does. There’s a community college in the city I live in that offers some classes that I can take to brush up on the subjects I need to improve on. Should I do that and go to the community college for a semester or two and transfer to college B next year or is there a better solution?", "author": "banana_man34", "created": 1568681829, "retrieved": 1632957511, "over_18": false, "upvotes": 5, "upvote_ratio": 1.0, "comments": {"f0n2oze": {"link": "/r/CollegeMajors/comments/d59n1q/need_help_with_switching_my_major/f0n2oze/", "text": "I second the other commenter's recommendation of an IT/IS degree if your college offers it. It doesn't require a lot of math (especially if you think you can't handle the harder math courses in CS) and it's possible to get CS jobs with an IT/IS degree.", "author": "DryAgency8", "created": 1568758981, "upvotes": 1}, "f0l1pki": {"link": "/r/CollegeMajors/comments/d59n1q/need_help_with_switching_my_major/f0l1pki/", "text": "1.\t Go to the community college that has the CS program, and speak with an advisor. Tell them you want to do CS, and ask if their credits transfer to the University. They may even have a representative from the university who can give you a degree outline. \n\n2.\tcall the university’s advising office. Tell them you’re not a student but want to be, and verify that the classes transfer (they most likely do). If you don’t have a degree outline, check their website for one, or ask them there. Also see if they will verify what classes directly transfer, so you can take them at the CC and save money. Save anything that has their writing on it, in case requirements change, so you’ll be able to raise hell and say you did exactly as the advisor said. \n\n3.\t Sign up at the CC. Stay there until you have the things that will transfer done, then transfer to the university. \n\nI love music, but I don’t think these degrees are a good idea. CS is difficult, but definitely the wiser choice. \n\nAlso, maybe check out IT (CIS/MIS), it’s a great field too and there’s a big push for Cyber Security right now. A degree helps get by HR, but it’s more cert based - you could even start studying for the Network+/Security+ cert right now and start working somewhere.", "author": "PianoConcertoNo2", "created": 1568695016, "upvotes": 1}}}