{"sid": "fxveda", "link": "/r/CollegeMajors/comments/fxveda/i_am_being_hurtled_toward_an_unknown_future_and_i/", "title:": "I am being hurtled toward an unknown future and I want to know what I should major in", "text": "Hi, I am a high school senior who is attending my State University next year. I want to study a lot of different things, mostly in the arts and humanities (namely philosophy, creative writing, and history), but I could see myself branching in a lot of directions. I still want to get a degree in 4 years, so I know it's better to choose a subject to focus on. I've enjoyed my high school film classes, and I'm considering a BFA in Film because I know there are a lot of creative jobs in that industry -- on the other hand I don't want to become a video editor or PA. I've wanted to be a writer since I was a child, but I don't know how realistically I'll make money with a BFA in Creative Writing. Ideally I'd also want a job I could do abroad. What major should I choose? Is this asking too much? Should I become a bartender?", "author": "slumpd01", "created": 1586449317, "retrieved": 1632957373, "over_18": false, "upvotes": 5, "upvote_ratio": 1.0, "comments": {"fnf9ll4": {"link": "/r/CollegeMajors/comments/fxveda/i_am_being_hurtled_toward_an_unknown_future_and_i/fnf9ll4/", "text": "My advice is don't choose a major for the best paying job. Just don't. That's how many people end up miserable. \n\nSecondly, you're not wrong in thinking you have to have a final decision made in your senior year of high school. I did too. All throughout high school, I planned on getting a major in biology to become a zookeeper or work in other animal related fields. Then, freshman year of college comes and halfway through my first semester, I realized that I hate doing science classes. They just bore me. I've always loved and been good at English and writing classes, so I started to research. I researched for months before coming to a decision. I researched jobs, majors, even required classes for majors. I finally decided to become a high school English teacher. It honestly has been the best decision I made. I am now so motivated and excited to pursue this career, despite members of my family thinking I'm crazy for wanting to be a teacher. It's what I truly love. I also am thinking about doing a nail tech program as a backup job for me since I love painting my nails. There's a cosmetology school near me that has a two year program for nail art. So, I can do this program after my English bachelors is completed. This is just in case my teaching career doesn't work out.\n\nI originally thought about just getting a creative writing degree as well, but yes, there isn't much job security in a degree like that. There are writing jobs where you do make a decent income, but they're not really creative ones. They're more like ones where someone tells you what needs to be written and you do it. Kinda defeats the purpose. I'm now getting creative writing as a minor, so I can teach creative writing classes and do freelance work on the side.\n\nSince you enjoy film classes, you could become a screenwriter. I don't know a lot about the film degrees, but maybe there's a screenwriting emphasis in your school's degree. Ask your academic advisor that question. Even if the school doesn't have a specific emphasis on just screenwriting, chances are your advisor can sign you up for more screenwriting classes rather than the other required classes. Advisors can sort of create an emphasis sometimes. Screenwriters make big money, but again dont choose a major for the money. \n\nAlso, I highly suggest you start in a community college. Complete your generals there, and then transfer to a 4 year college. It will save you so much money in the long run and it will give you a whole two years to decide what you really want to major in. That is what I'm currently doing. I am about to finish my second semester at a community college. \n\nThe biggest thing I discovered when starting college, is that college is about discovering who you are. It's not about having your life figured out already. There's lots of new experiences and opportunities you'll learn about. Things will change in your freshman year, YOU will change in your freshman year. It's what college does to people. Just don't stress about having your future planned already. Good luck and I hope I helped!\n\n(Sorry for such a long post.)", "author": "AnonymousPinkDolphin", "created": 1586903942, "upvotes": 1}, "fn5uiky": {"link": "/r/CollegeMajors/comments/fxveda/i_am_being_hurtled_toward_an_unknown_future_and_i/fn5uiky/", "text": "I'm sorry that you are going to have to wait to have your graduation ceremony, but congratulations on making it through high school! It's wonderful to read about all of your interests! And great job getting into Uni. No one should blame you for feeling overwhelmed, but only you can decide what your career path is.\r\n\n&nbsp;\n\r\nFirst and foremost, what ever you decide, don't forget: you can change your major later. And it is always for the best, just try to do it early. \r\n\n&nbsp;\n\r\nAside from that, have you considered community college? It saved me a lot of headache and money (I didn't have to worry about Gen Ed courses which rocked). If money is not an issue here and you really want to kick off this fall with uni, then I recommend a counselor when you get there to help sort some things out. Counselors really do help. They will listen to you and help you sort your thoughts. \r\n\n&nbsp;\n\r\nSince you're looking into a creative field, you could look at other majors that you might not have considered. Maybe you could be a design major? Industrial design, graphic design, architecture, art & design, and many others in this realm take some components of creative writing, photography, arts, etc. If not design, maybe another variation of film, creative writing, philosophy, etc. For example, a film locations manager or an animator. Just look around some more, you never know what you might find!\r\n\n&nbsp;\n\r\nThis is a pretty open ended answer, but there really isn't much advice I can give aside from talking to as many people as you can, research your potential majors like crazy, and don't forget that you can always change your major if you don't like it. Never think that you can't. You can, it just isn't always fun to transition.\r\n\n&nbsp;\n\r\nAnd I'm not sure if bartending is a joke or not, but I've worked in several restaurants over the years. Some bartenders would walk out with over $500 a night, so there is money there if that'swhat you want!\n\n&nbsp;\n\nLet me know if I can help with any more questions. Or if you want to learn more about a design major. Best.", "author": "baconbuddy95", "created": 1586676352, "upvotes": 1}}}