{"sid": "agrgt1", "link": "/r/CollegeMajors/comments/agrgt1/finishing_gen_ed_at_cc_and_still_no_ideas_for_a/", "title:": "Finishing gen ed at CC and still no ideas for a major", "text": "Hey collegemajors. I'm a 22 year old male turning 23 soon and finishing my time at community college.  Since junior year in high school I've been told I need to know what I want to do and I feel like I've looked high and low for several years now, and I haven't been able to pin down a single major that I feel like is a good fit for me.  I have reached out to career services at community college, taken so many inventory tests and other ways to help me lock in something.  Nothing has really worked out and I'm at the point where I feel like a decision has to be made.  I took some time off to try and see what I could do without a degree and I was fairly successful at a sales job for awhile until I just figured out I wasn't passionate about what I did and lost motivation.  My peak month I made 10k which felt like a hollow victory.  The job wasn't fulfilling and no matter the money I made it never felt like other successes I've had, and I think that was in part to what I was selling I didn't really believe in.  So I decided to finish CC and try back at step one.  I've been extremely passionate really only about fitness and I'm currently pursuing a personal training certification. I was obese at one point in my life and I feel like fitness saved my life in so many different ways.  But I don't feel secure really, because I'm unsure if personal training will even workout so I want to continue my education.\n\n\n\nThis is where I'm suffering is I'm not really passionate about any classes I'd taken during my time in community college.  I excel at a lot of different subjects as long as they don't relate to creativity (like art, theater, etc) and statistics.  But no matter how good I do in any of these classes none of them has really interested me.  A big thing for me is I need the time to follow my fitness passion so I feel like things like medical school wouldn't work out for me.  I feel stuck between a rock and a hard place my only current idea would be getting an accountant degree and hopefully use that to help begin a business of some sort in the future.  Even then I have a huge concern that I'm just going to end up in a bland office staring into a cubicle crunching numbers for the rest of my life.  Where do I even go?", "author": "zowezaally", "created": 1547682049, "retrieved": 1632957395, "over_18": false, "upvotes": 4, "upvote_ratio": 0.84, "comments": {"ee8plsg": {"link": "/r/CollegeMajors/comments/agrgt1/finishing_gen_ed_at_cc_and_still_no_ideas_for_a/ee8plsg/", "text": "Do you just want to finish CC, or eventually transfer to a University? You seem to be really invested in exercise, so have you considered exercise and lifestyle related majors? Check your university for what they offer, but they could have something like Physical Education or Exercise Science. You could also try body related majors to help you when you eventually go for Personal Training, like Anatomy and Physiology or Biological Anthropology! You already seem to have a goal and a passion, which is personal training, so go for something related to that so it can give you an edge when you try at it full time! ", "author": "The_Max_Rebo", "created": 1547688972, "upvotes": 2}}}