{"sid": "lacbld", "link": "/r/CollegeMajors/comments/lacbld/really_regretting_my_major/", "title:": "Really regretting my major", "text": "I’m a junior in college in aerospace engineering - but I’ve recently come to realize that I just… don’t give a fuck about it. \n\nI know people always say to “choose the major in which you’re passionate about” but on the other hand, is it really THAT bad to pursue a major that will pay more at the end of the day? \n\nCase in point, I’ve been jobless, still looking for internships, while my girlfriend will be returning to Microsoft and will be salaried as opposed to being paid hourly as well as receive a 5K bonus check. To me, it seems like there are way more opportunities in the tech field as opposed to AE. I just feel like I’ve wasted 3 years of my life so far in a major that I frankly do not care about. \n\nWhat do I do here? I don’t think I can just switch majors as that’ll put me through at least two more years of school (which I don’t want for financial reasons). I’m also thinking, maybe the grass isn’t all that green on the other side, either. But the money is there, in tech - and because I’m really regretting going through with my major. \n\nPlease help me out here! I’m tired of looking for jobs that don’t care about AE majors and constantly hearing about how my peers are making thousands in their tech internships.", "author": "A_KimB0", "created": 1612209183, "retrieved": 1632956867, "over_18": false, "upvotes": 7, "upvote_ratio": 0.9, "comments": {"glomuzd": {"link": "/r/CollegeMajors/comments/lacbld/really_regretting_my_major/glomuzd/", "text": "AE is a pretty good major. People typically recommend going with a more fundamental/broad degree like MechE unless you are sure you want to work in Aero, but even with AE, you should be able to get a variety of technical/engineering jobs.\n\nYou should look at your school's catalog and see what courses are required for the fields you're interested in. The STEM majors have a good amount of overlap in the first couple of years, so you may be further along some of those other majors than you think. Depending on your school and how prerequisite-heavy courses tend to be, you might be able to start jumping right in to more advanced courses.\n\nAre you able to add a minor to your degree? A technical degree (such as in AE) with a minor in CS/CpE/Math/Stats/DataSci might be enough coding exposure to be able to get into tech. People routinely jump from unrelated STEM majors into tech by working on some personal projects/masters/bootcamp/studying leetcode. A minor in one of those fields that will give you programming experience every semester until you graduate might be a good way to get your foot in the door. Even if you can't go for a minor, once you are done with school you could look into work at the intersection of AE/ME and \"tech,\" like drones, satellites, software for use in aero like embedded, electric vehicles, consumer electronics, robotics, etc.", "author": "gineton2", "created": 1612233464, "upvotes": 5}, "glocht6": {"link": "/r/CollegeMajors/comments/lacbld/really_regretting_my_major/glocht6/", "text": "Maybe this is one of those \"the grass is always greener\" problems. Yeah, tech can pay very well in top tech companies, but a lot of those jobs go to very smart, highly motivated people. Do you think that you could force yourself to be that motivated and driven for something you are so-so about? Keep in mind that what's attracting you to tech is the compensation and benefits, which is fine, but you don't even know if you like programming. You might hate it, a lot of people do, but then again some love it.\n\nI'm a CS major, and let me say, there are a lot of CS majors who are so insanely committed to programming that is very hard to compete with. CS has a lot of extracurricular stuff associated with it, also. In order to get these jobs at tech companies, I've heard stories of people taking 6 months off of work, and do nothing but study technical interview problems in order to do well in the interviews and get the job. I know friends who pour 15+ hours a week into learning new software and frameworks, in order to get practical skills. This is often a necessity, since computer science is an academic discipline where the course material is more theoretical, and you have to learn the practical stuff on your own. This isn't to say you can't get a CS job with just a degree and not a large passion for the field, but in order to get those high salaries, you often do.\n\nI know CS majors who didn't do a lot to get internships or prep for interviews, and they aren't working at top top companies, making 6 figs. By all means try out programming, see if you like it, but there's plenty of money in aerospace, and CS isn't always as lucrative as it is portrayed.", "author": "BetUrProcrastinating", "created": 1612228516, "upvotes": 1}, "glnp9ud": {"link": "/r/CollegeMajors/comments/lacbld/really_regretting_my_major/glnp9ud/", "text": "If you’re taken many CS or CE classes, and you want to work in tech, I’d recommend switching major to either of those two, and grind during senior year. You’ll still probably have to do an extra fifth year though.", "author": "TheBrookAndTheBluff", "created": 1612218079, "upvotes": 1}, "gln3soc": {"link": "/r/CollegeMajors/comments/lacbld/really_regretting_my_major/gln3soc/", "text": "Double major if you can handle it. Seriously. You’ve worked so hard to get here. If you can handle it add CS or Data Science or Mathematics. It will let you transition into tech if you feel like it. I wouldn’t give up on AE though if you can help it.", "author": "biggerarmsthanyou", "created": 1612209610, "upvotes": 2}, "gln32e9": {"link": "/r/CollegeMajors/comments/lacbld/really_regretting_my_major/gln32e9/", "text": "maybe shift to ME?", "author": "almostdedxd", "created": 1612209323, "upvotes": 3}}}