{
  "sid": "q6yblp",
  "link": "/r/CollegeMajors/comments/q6yblp/should_i_major_in_chemistry_physics_or_a/",
  "title:": "Should I Major in Chemistry, Physics, or a Different Field?",
  "text": "Hello! So currently I’m on a gap year to be sure what I want to study before I go and apply for apprenticeships for a specific field in Europe for school. My biggest problem is I’m not completely sure what field would suit me best. I’m considering majoring in physics or chemistry since I’m pretty proficient in math and maybe being a chemist or chemical engineer with a chemistry major, or a physicist with physics. I usually can handle stress well unless it’s degrading criticism, and I’m willing to work hard towards goals and such as long as it has a purpose and isn’t meant to simply kill time. I’m willing to study hard and put in time, but I also don’t want my career to take all my time and life. I can focus well on a task and put in all the time and effort for it. I enjoy discovering new things or performing research to prove theories or learn about how things function in specific manners. I’m willing to work for years on something in particular with an end goal in mind. So in short, what I’m trying to ask is does is sound like chemistry or physics would be a good fit for me, or if not, what field should I look into studying for a major? Feel free to use the comments to reply and explain as much or as little as you need!",
  "author": "DarkwingWolf8",
  "created": 1634080999,
  "updated": 1634594684,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "hgfy5so": {
      "link": "/r/CollegeMajors/comments/q6yblp/should_i_major_in_chemistry_physics_or_a/hgfy5so/",
      "text": "Are you from the US? If so, if you want to be a chemical engineer I suggest you look at chemical engineering degrees instead of chemistry degrees. The two sound similar but are pretty different and I'm not sure that you can go into chemical engineering with a chemistry degree in the US.",
      "author": "anonymoususer666666",
      "created": 1634096784,
      "upvotes": 1,
      "replies": {}
    }
  }
}