{"sid": "l11uqp", "link": "/r/CollegeMajors/comments/l11uqp/psych_or_compsci/", "title:": "psych or compsci", "text": "i’m having trouble choosing a major? i love psychology my original plan was to get a masters in it but i don’t know what i would be able to do with it & if i could make a living out of it. my other option is computer science but i suck at math 💀 idk what to do", "author": "exorduim", "created": 1611117541, "retrieved": 1632956871, "over_18": false, "upvotes": 8, "upvote_ratio": 1.0, "comments": {"gjy5qbp": {"link": "/r/CollegeMajors/comments/l11uqp/psych_or_compsci/gjy5qbp/", "text": "Honestly Phycology is statistically like a top 5 worst majors. Unless your going to a top school it would probably be pointless. I’m not trying to be rude but I’m trying to save you from sting 4 years and 50,000$. Look into other things then Cs to. If you like the idea of coding but with less math think about MIS. It’s basically business and CS.", "author": "ChurninPark", "created": 1611154152, "upvotes": 1}, "gjxzyyf": {"link": "/r/CollegeMajors/comments/l11uqp/psych_or_compsci/gjxzyyf/", "text": "I think you should go for comp sci even if you \"suck at math.\" I'll try to explain how math will help you in a way. So math is all the same. You just have to be consistent and do all the homework's and practice problems. Gradually working on it day by day and then it becomes really easy. Most people hate math because they don't want to do the homeworks/practice problems consistently, but if you do it then it become really easy. The best part is here now. Once you figure out how to do well in math once, then all the other maths will also become easy. You will have learned the studying pattern or how much effort needed to put in to pass and what ultimately works for you. Also, you don't have to be \"good at math\" to pass or take comp science. You can just be good enough to pass even. You can be bad at math but do well in your CS classes and be just fine. Nevertheless good luck on your decision!", "author": "VIllainLife", "created": 1611151028, "upvotes": 2}, "gjxd7py": {"link": "/r/CollegeMajors/comments/l11uqp/psych_or_compsci/gjxd7py/", "text": "why are you considering computer science? CS is always a nice field to pair with other majors because it is super applicable. In psychology there's a lot of cool AI and cognitive science questions that are tackled by computer science.", "author": "BetUrProcrastinating", "created": 1611131779, "upvotes": 3}, "gjww0o8": {"link": "/r/CollegeMajors/comments/l11uqp/psych_or_compsci/gjww0o8/", "text": "I’m majoring in psych.  Aside from the obvious there are careers in Human Resources, marketing, social work , all that can be pursued with a psych degree.", "author": "YYR123", "created": 1611118054, "upvotes": 4}}}