{"sid": "ofdp3m", "link": "/r/CollegeMajors/comments/ofdp3m/double_major_or_study_abroad/", "title:": "Double Major or Study Abroad?", "text": "Hi all! I'm a rising sophomore who's interested in sorting out my next four years at undergrad. I'm planning on majoring in sociology, with a potential double major in Rhetoric, Writing, and Public Discourse (that's all one major, aka RWPD). I also have always been interested in studying abroad! However, double majoring and studying abroad are two things that kind of strain your schedule, and doing both would be rough. So, I can either...\n\n1. Double major *and* study abroad: best of both worlds, but a kind of rough schedule that would have some semesters with only major courses and then one with just distribution reqs.\n2. Double major, not study abroad: allows me to graduate with a double major and spread out major reqs more, so my courseload is more varied and fun! However, this means no study abroad.\n3. Major+minor or just a major, and study abroad: allows me to have flexibility in courses and take things outside of major/distribution. I also wouldn't have to be so picky in study abroad options since credits don't all have to go towards specific things. However, this choice would keep me from a potential career involving writing (can't do that with just sociology).\n\nI'd be happy to hear any input or answer any questions about the situation! Really, it just comes to comparing the usefulness/enjoyability of double majoring vs. the study abroad experience.", "author": "CorgiCow", "created": 1625640978, "retrieved": 1632958474, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"h4bzyzh": {"link": "/r/CollegeMajors/comments/ofdp3m/double_major_or_study_abroad/h4bzyzh/", "text": "I’m not sure if I agree with your assessment that option 3 would prevent you from having a career in writing. What is making you say that? I think it’s probably the best option of the three, frankly. You still get upper-level courses in writing and I don’t see how having the major as opposed to the minor would be noteworthy enough to miss out on study abroad opportunities. You’ll get writing experience in your gen eds and many of your sociology classes and if you attend writing workshops, write a thesis, get involved in your writing center, you could make up for gaps in your education on writing.", "author": "slouchingbethlehem", "created": 1625645385, "upvotes": 1}}}