{
  "sid": "r4ke01",
  "link": "/r/CollegeMajors/comments/r4ke01/compsci_and_physics/",
  "title:": "Compsci and Physics?",
  "text": "Hello I am a senior in HS right now and have been deeply thinking about my choice for majors. I definitely want to have computer science as part of my education but I'm also thinking I might want more. For example economics because I could apply my CS skills to be a financial analyst or whatever. But I've also been thinking about CS and Physics. Because if I were to do physics I would very likely want to do a PhD (yes I know it's a LOT of work and time and money especially) but physics has always interested me. I love explaining how things work. And even if I decide not to get a physics PhD (which since that's a solid 5 years away I can't ever garuntee I will) id still have C.S to fall back on (which I'd be very happy with anyways) or if I do end up going the PhD route I'd be able to use my c.s skills to model physics phenomenon and or use it as a source of income while getting my PhD.\n\nI know I still have plenty of time to figure it out and that the world is a lot tougher then my rose tinted glasses show. But right now these are my hopes/plans/mostly ideas for what I could do in the future. And I just wanted some feedback.",
  "author": "Background_Hotel_875",
  "created": 1638150757,
  "updated": 1638207467,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmhi16t": {
      "link": "/r/CollegeMajors/comments/r4ke01/compsci_and_physics/hmhi16t/",
      "text": "Sounds like a good plan, at least for now!\n\nBoth of those majors tend to require more courses than the average major, so you might not be able to fit in both in four years. But by the time you have to choose which one to continue with, or whether to take a little extra time to finish both, you’ll probably know more about whether you really want a PhD.\n\nAlso, you might still be able to get a CS job with a physics degree and some extra CS courses, or get into a physics PhD program with a CS degree and some extra physics courses. Talk to your advisor, check the requirements to apply to different PhD programs, and see if you can find any physics alumni from your school who ended up in CS careers.",
      "author": "Lily9879",
      "created": 1638155370,
      "upvotes": 1,
      "replies": {
        "hmhrtzj": {
          "link": "/r/CollegeMajors/comments/r4ke01/compsci_and_physics/hmhrtzj/",
          "text": "I'm hoping I'll be ahead by taking a couple english courses with a semi-dual enrollment thing (one is an ece class meaning I get HS and college credit) and hopefully next semester I can take another at a community College. And praying I pass my ap csa and ap Calc ab exams. Those would boost me pretty well ahead in major reqs and gen-eds and would make it much easier for me.",
          "author": "Background_Hotel_875",
          "created": 1638160024,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}