{
  "sid": "l6dn5t",
  "link": "/r/CollegeMajors/comments/l6dn5t/business_or_chemical_engineering/",
  "title:": "Business or Chemical Engineering",
  "text": "I am currently a freshman going to a state university, and during the first semester (fall 2020) I was a business major, but I wanted to try chemE because I’ve always had an interest in the pharmaceutical industry and had planned to go to college to major in stem but things changed and I ended up switching to business before the semester started. Now (spring 2021) I’m taking the pre-reqs for chemE like physics calc II and chem. I feel a bit discouraged and I haven’t felt this stressed in years. I know I shouldn’t just quit because I feel discouraged but it’s only been two days since the semester started and I’ve been so stressed out from the minute I wake up to when I fall asleep. I know I just need to get the hang of things but it’s just frustrating because my gal semester was so easy so I guess I’m not used to the rigor that comes with stem, and I feel so dumb because some of the content we’re learning now I’m struggling with even though I know that I knew how to do this in highschool. It’s just that since it’s been so long I forgot so much. I also want to transfer schools to my dream school which is Northeastern University, so should I try to switch back to business or keep on doing chemE?",
  "author": "LeftAd1747",
  "created": 1611779357,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.67,
  "comments": {
    "gl10xqz": {
      "link": "/r/CollegeMajors/comments/l6dn5t/business_or_chemical_engineering/gl10xqz/",
      "text": "When you started as a business major, what kinds of jobs were you considering for the future?",
      "author": "BetUrProcrastinating",
      "created": 1611795778,
      "upvotes": 1,
      "replies": {
        "gl1238y": {
          "link": "/r/CollegeMajors/comments/l6dn5t/business_or_chemical_engineering/gl1238y/",
          "text": "I honestly didn’t know what I wanted to do, I thought about biomedical engineering for a bit because I was interested in prosthetics and biomechanics also research and development but chickened out because math isn’t my thing ( I took ap calc and bio also honors physics my senior year of hs), so before my freshman year of college started I switched to business, and the classes were easy ( I was interested in marketing and management information systems) but I didn’t really find a purpose so I decided to try out chemE this semester because of my interest in the pharmaceutical industry",
          "author": "LeftAd1747",
          "created": 1611796243,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gl0j2dm": {
      "link": "/r/CollegeMajors/comments/l6dn5t/business_or_chemical_engineering/gl0j2dm/",
      "text": "Honestly depends on you. I'm majoring in Business rn but trying to take some Engineering classes. I find that business is just so incredibly easy if you actually try and pay attention. The problem is I don't really find it rewarding. I've only taken a few Engineering classes and I can agree with you that it's harder (makes you actually have to use your brain) but it just feels worth it to me to solve a problem.\n\nIt depends on your future career, whether you think you can actually handle engineering, and what you find rewarding. It isn't really crazy for you to feel like this. I'm a Junior that has taken a lot of upper division business classes and I have a 4.00. Rn I'm taking a Physics 1 class and while it's manageable, I think it requires a more outside-the-box approach just like my Calc 2 class did last semester. If you're like me then your freshman business classes probably made you do these easy projects or required rote memorization or at most gave you just some simple formulas to memorize. You shouldn't be discouraged at taking STEM classes. Just remember to practice and try to understand the topics. Sure it's harder than an Intro to Accounting class but I'd be willing to bet once you finish it this semester you'll find it a rewarding experience.",
      "author": "thekidboy",
      "created": 1611788996,
      "upvotes": 3,
      "replies": {
        "gl0jqbm": {
          "link": "/r/CollegeMajors/comments/l6dn5t/business_or_chemical_engineering/gl0jqbm/",
          "text": "Ok thank you so much for this insight, after I did my first semester with business classes, I realized that business was boring but I could definitely tolerate it and put myself through it, I ended with a really good gpa, but throughout the first semester I kept on thinking about engineering and it just kept on reoccurring in my head which is why I decided to try to make the switch.",
          "author": "LeftAd1747",
          "created": 1611789281,
          "upvotes": 1,
          "replies": {
            "gl0n1p5": {
              "link": "/r/CollegeMajors/comments/l6dn5t/business_or_chemical_engineering/gl0n1p5/",
              "text": "Idk how hard your business classes are this semester but in my experience they will likely be pretty easy. I think now is a good time to branch out and take some engineering classes just to see if it will interest you and if its a good idea to switch. Again it depends on you and whether you think you can handle however many credits you have this semester. You might have a hard semester but at least you will have the peace of mind if you decide not to switch that you tried and it wasn't for you.",
              "author": "thekidboy",
              "created": 1611790695,
              "upvotes": 1,
              "replies": {
                "gl12ckd": {
                  "link": "/r/CollegeMajors/comments/l6dn5t/business_or_chemical_engineering/gl12ckd/",
                  "text": "Yea I think that because I had my first semester easy, I’m struggling to adjust this semester and the rigor is just so much more harder obviously. I’m just really worried about my gpa because I do want to transfer to my dream college and ik that gpa is an important factor",
                  "author": "LeftAd1747",
                  "created": 1611796351,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634059778
}