{
  "sid": "rcjbjv",
  "link": "/r/GradSchool/comments/rcjbjv/am_i_the_only_one_who_feels_overwhelmed_by_the/",
  "title:": "Am I the only one who feels overwhelmed by the amount of choices, selection criteria, rankings, and outcomes that need to be sifted through in order to select the right fit?",
  "text": "I've spent the better of two years evaluating online graduate programs ranging from CS, statistics, business, information systems, applied mathematics, analytics, economics, and operations research in order to find the right program that fits with my ever fluctuating corporate career. And I am exhausted by the amount of criteria required to sift through in order to arrive at a sound decision. It's worse than buying a car or a house. \n\nMy undergraduate is in accounting, which I earned in 2010, and set off to be a CPA. Years later I found a better fit in business intelligence, corporate FP&A, reporting, and analytics (circa 2013). Since 2020, I've been evaluating online graduate programs to see if they fit and hardly any of them really do, as far as the curriculum is concerned. Very few feel relevant enough to benefit my daily activities.\n\nDoes anyone else experience this when trying to reconcile their day job and life to what colleges are offering?",
  "author": "Tender_Figs",
  "created": 1639061677,
  "updated": 1639518553,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.87,
  "comments": {
    "hnxltzm": {
      "link": "/r/GradSchool/comments/rcjbjv/am_i_the_only_one_who_feels_overwhelmed_by_the/hnxltzm/",
      "text": "Sounds like you have discovered that graduate school is not the vehicle for your career advancement.",
      "author": "IkeRoberts",
      "created": 1639102157,
      "upvotes": 3,
      "replies": {}
    },
    "ho5tulj": {
      "link": "/r/GradSchool/comments/rcjbjv/am_i_the_only_one_who_feels_overwhelmed_by_the/ho5tulj/",
      "text": "I would also add that the last 2 yrs have been trying, at best. Now that there’s light on the horizon, take another look at your options through the lens of which is most exciting to you AND which school has the best network ls to the business world.\n\nIf it’s 3 or more, just pick the one you feel most drawn to.",
      "author": "22azurite",
      "created": 1639254241,
      "upvotes": 2,
      "replies": {}
    },
    "hnvlmpx": {
      "link": "/r/GradSchool/comments/rcjbjv/am_i_the_only_one_who_feels_overwhelmed_by_the/hnvlmpx/",
      "text": ">And I am exhausted by the amount of criteria required to sift through in order to arrive at a sound decision. It's worse than buying a car or a house. \n\nHonestly, maybe you're at the point where you need to stop and make your best guess? \n\nSometimes it's easy to over research a thing and keep collecting data, when additional data won't provide a more reliable answer. \n\n>I've spent the better of two years evaluating online graduate programs ranging from CS, statistics, business, information systems, applied mathematics, analytics, economics, and operations research in order to find the right program that fits with my ever fluctuating corporate career.\n\nSo maybe you just might choose the one that intrigues you the most, since you're having trouble figuring out which one seems to fit better with your career plans.\n\n>Since 2020, I've been evaluating online graduate programs to see if they fit and hardly any of them really do, as far as the curriculum is concerned. Very few feel relevant enough to benefit my daily activities.\n\nMaybe that's the wrong way to think of it. Rather than how there's a direct relevance to your daily activities, which one will shape the way you think about things in general.",
      "author": "raistlin65",
      "created": 1639072001,
      "upvotes": 1,
      "replies": {}
    },
    "hnvoc9u": {
      "link": "/r/GradSchool/comments/rcjbjv/am_i_the_only_one_who_feels_overwhelmed_by_the/hnvoc9u/",
      "text": "Sounds like you might not need to go to grad school? Until you reach a point where somebody says \"we won't promote you any higher until you have a master's\", at which point they could tell you exactly which kind of program is acceptable, it sounds like you could just keep doing what you're doing.",
      "author": "acid_zaddy",
      "created": 1639073044,
      "upvotes": 1,
      "replies": {}
    }
  }
}