{
  "sid": "psbqpo",
  "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/",
  "title:": "Had a meeting with adviser today, shared my screen showing a preview of an inappropriate photo and I think He might have seen it? I want to disappear",
  "text": "I WANNA BE EATEN WHOLE BY THE UNIVERSE. I had my first ever meeting with my supervisor today and my computer was lagging BIG-TIME.\n\nI tried sharing my screen, and the screen lagged on that part showing the \"Quick Access\" of my files.\n\nI regularly take photos of my back topless to CHECK MY SCOLIOSIS, AND I THINK HE SAW A THUMBNAIL OF IT. (just upper half of body)\n\nI WANNA die :<<<\n\nSorry if this is not academic-related. The meeting went really well, but I just noticed this now.\n\nPlease tell me it's going to be okay HUHU. I am an embarrassing human being.\n\nI flaired this under \"FUN\" BUT THIS IS NOT FUN AT ALL.\n\nI want to disappear",
  "author": "Traditional-Yogurt74",
  "created": 1632199773,
  "over_18": false,
  "upvotes": 31,
  "upvote_ratio": 0.93,
  "comments": {
    "hdrph8w": {
      "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/hdrph8w/",
      "text": " It's just your back, and it's a medical picture. It's no biggie. Porn has a very different vibe. I once walked up on a student, in the office, looking at big anime boobs. That was uncomfortable. But still, he just x-ed out of the window immediately and we never spoke of it. When this kind of thing can become really serious is when you're the one in a position of power, or you're working with relatively young students. There was a prof a while back whose \"busty college girl gets f...\" bookmark showed up on a screenshare and he got let go, but that was at least in part because it made the college kids he was teaching feel potentially fetishized.",
      "author": "myristicae",
      "created": 1632260157,
      "upvotes": 3,
      "replies": {}
    },
    "hdq854y": {
      "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/hdq854y/",
      "text": "I once took a flash drive from my friend to get some research papers from my UG advisor. When he opened the flash drive, there was PORN in it. All kinds of porn that you can imagine. He laughed it off but my soul had left my body when I saw that. The next 20 minutes were awkward as hell.",
      "author": "coronnial",
      "created": 1632238117,
      "upvotes": 3,
      "replies": {}
    },
    "hdq1snh": {
      "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/hdq1snh/",
      "text": "Try to forget about and be more careful next time if you can. Share only the application that you’re referring to.",
      "author": "herpslurp",
      "created": 1632235457,
      "upvotes": 2,
      "replies": {}
    },
    "hdq1nvy": {
      "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/hdq1nvy/",
      "text": "His blog is no longer up, but there was a funny story a prof posted a few years ago. While teaching organic chem very early in his faculty career, he'd forgotten to mute messages one day. He got a message from his wife with an inappropriate joke (something along the lines of \"does no meat Fridays mean I can't get the D\") and it popped up in front of the entire class.\n\nAll that to say, it happens to profs too. Don't worry! Assuming he noticed at all, he probably doesn't think anything of it, or is thinking of close calls he himself has had.",
      "author": "sophia_s",
      "created": 1632235402,
      "upvotes": 5,
      "replies": {}
    },
    "hdpywy1": {
      "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/hdpywy1/",
      "text": "Just to clarify - it was just your back pictured? I don't think that's really inappropriate or an issue but if you're concerned about it, that's definitely something worth sharing. Just a \"hey, I think you probably saw a photo of my back on my screen - if you've been curious about why I would have that, it's to check on my scoliosis progression (prognosis? Other word entirely?). Things are going well!\"\n\nOr, if scoliosis might ever be a problem that would require accommodations of any sort, you could head that off now. \"I just want to let you know that I have scoliosis. So far, I've been doing well with my PT for it - in fact, that's why I had a photo of my back on screen briefly at our last meeting, if you happen to remember that - and at this point I don't expect it to be an issue, but I did want to go ahead and let you know now in case I have a flare up (or whatever) later. Cheers!\"\n\nI prefer the second one because it addresses the issue without being totally *about* it but certainly you do you! And again, you don't have to address this if you don't want to! I don't think it's as big a deal as you're concerned about.",
      "author": "Lucky-Reporter-6460",
      "created": 1632234227,
      "upvotes": 4,
      "replies": {}
    },
    "hdpujmn": {
      "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/hdpujmn/",
      "text": "Professors are used to seeing and hearing unusual and quirky things when it comes to students. I wouldn't worry about it.",
      "author": "raistlin65",
      "created": 1632232281,
      "upvotes": 3,
      "replies": {}
    },
    "hdpkxgv": {
      "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/hdpkxgv/",
      "text": "Lmao I thought this was going to be about porn... it'll be fine. If he says anything, you can just say it's a medical thing, which it is. But there's also a chance he didn't notice or think anything of it.",
      "author": "KiwiTheKitty",
      "created": 1632227443,
      "upvotes": 25,
      "replies": {}
    },
    "hdpgfw0": {
      "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/hdpgfw0/",
      "text": "I have scoliosis and I work out regularly so I always have photos like these around. I also get embarrassed when people see them but at least I am putting in the work to care for myself. Usually there is nothing sexy or inappropriate about them given the context. Reorganize your files so they are hidden better and move on. Most people have illegal porn on their PCs. Some people have no shame and have hentai backgrounds on their desktop. Your’s is self medical monitoring. Hardly an issue. They didn’t care and I am sure the lag was on your end.",
      "author": "lazerlass",
      "created": 1632224739,
      "upvotes": 9,
      "replies": {}
    },
    "hdp9yhu": {
      "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/hdp9yhu/",
      "text": "Also if it was small and just part of your back they probably wouldn’t be able to tell what it was a picture of with a quick glimpse (just some skin tone blob).\n\nAt least you were not Toobin ;)",
      "author": "UleeBunny",
      "created": 1632219980,
      "upvotes": 6,
      "replies": {}
    },
    "hdor6y9": {
      "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/hdor6y9/",
      "text": "Don’t worry about it. Honestly, he probably didn’t even see it.  He’s also a human being and probably has some weird dick pick selfies on his laptop. We’re all just simple creatures.",
      "author": "RWMorse",
      "created": 1632203235,
      "upvotes": 31,
      "replies": {
        "hdov0mw": {
          "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/hdov0mw/",
          "text": "T\\_\\_T Thank you! this made me feel better \\*cries\\*",
          "author": "Traditional-Yogurt74",
          "created": 1632206178,
          "upvotes": 6,
          "replies": {}
        },
        "hds0ie0": {
          "link": "/r/GradSchool/comments/psbqpo/had_a_meeting_with_adviser_today_shared_my_screen/hds0ie0/",
          "text": "Definitely. Even if he saw it, I can guarantee he didn't care. And even if it had been even more inappropriate, he probably would want to pretend he didn't see it as to not make you feel mortified.",
          "author": "odesauria",
          "created": 1632265213,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634067143
}