{
  "sid": "q2sx70",
  "link": "/r/GradSchool/comments/q2sx70/im_finally_going_to_the_office_on_friday_its_my/",
  "title:": "I'm finally going to the office on Friday! It's my first proper day",
  "text": "Friday is the day I finally get to go back to campus and I'm really nervous to see how it goes.\n\nI've never met any of my office mates and I'm worried about introducing myself etc. \n\nHas anyone else had this?",
  "author": "Erwin_Schr0dinger",
  "created": 1633552519,
  "updated": 1634099861,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.93,
  "comments": {
    "hfnd23e": {
      "link": "/r/GradSchool/comments/q2sx70/im_finally_going_to_the_office_on_friday_its_my/hfnd23e/",
      "text": "There's nothing like the feeling of going back to campus and being a student again. My first day as a graduate student after being in the work world for a while was so thrilling and wonderful. I had been so beaten down, and I felt finally like I was in the right place.\n\nI hope everything goes well for you.",
      "author": "Ophelia550",
      "created": 1633552849,
      "upvotes": 3,
      "replies": {}
    },
    "hfntxoq": {
      "link": "/r/GradSchool/comments/q2sx70/im_finally_going_to_the_office_on_friday_its_my/hfntxoq/",
      "text": "I'm sure it will go fine! If you want to prepare, what I try to do before meeting anyone new, is prepare a few questions to ask if there's an awkward silence, and prepare some answers to some expected questions. \n\nSome simple ice breakers would be asking where you're from, maybe what your undergrad was like, what hobbies you do in your free time, favorite tv shows/movies/books, any pets, any siblings, what made you pick this school, what made you pick this field, what classes are you taking and do you like them, are you teaching this semester and do you like it, favorite restaurant in the area, etc\n\nAlso expect them to ask about your specific research interests and research progress if that'a applicable, or you can ask them.\n\nGood luck! I'm sure it'll go great.",
      "author": "pastapastas",
      "created": 1633560398,
      "upvotes": 1,
      "replies": {}
    }
  }
}