{
  "sid": "r4odo0",
  "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/",
  "title:": "Not sure if I'm just a burnt out Phd Student or going the wrong direction",
  "text": "Hi everyone, \n\nFor context. I am currently in my 3rd year of my neuroscience PhD. I love neuroscience, but I have recently realized I do not want to do bench research or be a professor as a career. It feels like if I got a job offer doing something else, I'd take it, even though there are days when I like research. \n\nI do have my masters in the same subject from another school, so I think (hope) I could find a decent job. What's mostly stopping me if knowing how angry my parents would be at me and disappointing my PI and lab (who are amazing). Additionally, I finished my coursework, in the midst of my comps - it seems like a bad idea to quit now, but also the idea of pushing through my thesis for another 2.5-3 years sounds like torture. \n\nNot sure if this is just burnout or whatever - any else feeling/has felt the same?",
  "author": "pathojenesis",
  "created": 1638163388,
  "updated": 1639883312,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hmhyyyp": {
      "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmhyyyp/",
      "text": "Anyone telling you the only path from a PhD is a professor or bench researcher is doing you a massive disservice.\n\nA PhD is not just a degree in <SUBJECT>.  It's a degree showing that you can learn something new that nobody else has learned.  I know chemistry PhDs who now write the code for self-driving cars. So if you want the PhD, get it.  A STEM PhD will open doors for you.",
      "author": "hixchem",
      "created": 1638163911,
      "upvotes": 6,
      "replies": {
        "hmi05rr": {
          "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmi05rr/",
          "text": "That's true. I'm not entirely sure what career I'd like, so definitely a pro to finishing is having more doors opened possibly. \nBut part of me wonders if I could find whatever job I would like without a Phd, would I still want to finish? Currently, I think that answer is no, but definitely more to think about. I appreciate your reply, thank you.",
          "author": "pathojenesis",
          "created": 1638164628,
          "upvotes": 1,
          "replies": {}
        },
        "hml0t2s": {
          "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hml0t2s/",
          "text": "Great response. OP, Im in a similar boat as you, except replace year 3 with year 5 😅 I definitely feel your pain, but if you have it in you you should push through. Of course I’m a stranger with no insight into your life so take this with a massive grain of salt. But a STEM PhD will open doors lifelong for you and in my opinion that’s worth a couple more years of grinding it out. Especially when you have a supportive PI and enjoyable lab.",
          "author": "princessbuttlicker",
          "created": 1638222664,
          "upvotes": 1,
          "replies": {
            "hmlw6xb": {
              "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmlw6xb/",
              "text": "Thank you for your reply! Yeah my PI and lab are definitely making it hard for me to actually consider leaving, but I know I have to do what's best for me - whatever that is haha. I'm ok with either decision, I just want to make sure I'm doing it for the right reason - not for fear of failure or disappointing my parents/PI. Who knows haha. I hope your journey goes well for you too!",
              "author": "pathojenesis",
              "created": 1638236534,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmj9v34": {
      "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmj9v34/",
      "text": "I feel similar sometimes and am in the same boat. Not sure if it is just the burnout talking or just the time of the year. I try to ignore those doubts in my head most of the time, or let them have their space and then leave. Take some time if you can to refresh and re-evaluate yourself. Maybe step away for a day or two. I don't love what I'm doing all the time and I definitely have slumps where I am overwhelmed and/or don't want to do any of it. Just take a breath before you make any big decisions, unless it is causing you serious mental health issues and inescapable feelings of despair and dread. Then I'd talk to my advisor/ a friend to get their opinion. Talking to a good friend who gets it or a mental health professional can help. It's ok to be burned out. You're doing ok. You don't have to love it all the time (almost no job is like that). Good luck!",
      "author": "seaside1508",
      "created": 1638196815,
      "upvotes": 1,
      "replies": {
        "hmlvjfy": {
          "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmlvjfy/",
          "text": "Thank you for your reply! \nYeah, I know a lottttt of people are experiencing burnout (understandably so) no matter what field they're in so I'm definitely trying to figure out if it's general burnout or specific to what I'm doing. I'm leaning closer to maybe doing a leave of absence rather than straight up dropping out - sort of a happy medium. I can take a step back, reevaluate my career goals, and if i decide I really want this PhD, I can come back renewed.",
          "author": "pathojenesis",
          "created": 1638236238,
          "upvotes": 2,
          "replies": {
            "hmm8vm0": {
              "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmm8vm0/",
              "text": "I think the burnout is everywhere personally. I'm in a stem/healthcare field so I feel it here but friends in the liberal arts I know are also struggling.\n\nThat sounds like a good idea and healthy decision! I know people who've done that and I think it helped them. You do you and make sure to take care of yourself! There's only one you out there.",
              "author": "seaside1508",
              "created": 1638242244,
              "upvotes": 2,
              "replies": {
                "hmmi080": {
                  "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmmi080/",
                  "text": "Thank you, I appreciate that!",
                  "author": "pathojenesis",
                  "created": 1638246540,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmjqnaj": {
      "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmjqnaj/",
      "text": ">Additionally, I finished my coursework, in the midst of my comps - it seems like a bad idea to quit now,\n\nIf you have the motivation, I would say push through the comps, then think about if you want to go further. \n\nIf you finish comps, you can list ABD on your resume for your current educational experience. Could be worth it to get that little bit of certification, even if you don't want to do the dissertation.",
      "author": "raistlin65",
      "created": 1638204167,
      "upvotes": 1,
      "replies": {
        "hmlwbm4": {
          "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmlwbm4/",
          "text": "I have never heard of ABD so thanks for bringing this up! Definitely an option to consider as I weigh pros/cons.",
          "author": "pathojenesis",
          "created": 1638236591,
          "upvotes": 1,
          "replies": {
            "hmmnfvp": {
              "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmmnfvp/",
              "text": "ABD=all but dissertation",
              "author": "raistlin65",
              "created": 1638249502,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmktgf3": {
      "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmktgf3/",
      "text": "Hi! I also felt similar in one PhD program. But not because of the long-goal project, but the atmosphere. It was toxic and hostile. Also, the former PI wanted to make us work 12 hours per day. At some point, I got burnout and decided to quit this lab and join another one. Now, even being super busy I still feel that I enjoy every time I am there. However, I believe it is absolutely normal to have burnout (due to different factors) during PhD and it is also absolutely normal to quit if you feel so. You need to take a vacation and deeply think/ask yourself: why are you feeling so and is it really bc you are not into science anymore. If the answer is clear, drop PhD. Parents are the ones who love you, they cannot understand you, but they will accept it with time. PI will be sad as well, but s/he also will get it, if you will explain it and be honest with them...Good luck!",
      "author": "cozy-scholar",
      "created": 1638219721,
      "upvotes": 1,
      "replies": {
        "hmlwo0b": {
          "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmlwo0b/",
          "text": "Thank you for your reply! Yeah, the fact that I have just such a great environment makes it harder and I feel slightly guilty for even considering leaving. I said this in another reply, but i am considering a leave of absence rather than just dropping out. This way I can take the time to reevaluate what my goals are without completely stepping away in case I decide the Phd route is what i want to do.",
          "author": "pathojenesis",
          "created": 1638236751,
          "upvotes": 2,
          "replies": {
            "hmmxq4j": {
              "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmmxq4j/",
              "text": "Good decision, wish you all the best:)",
              "author": "cozy-scholar",
              "created": 1638256184,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmlo31c": {
      "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmlo31c/",
      "text": "Same story here! I am done with coursework and defense is on Dec 15th. I can't help but feel like a huge failure and not belonging here. I debating for the past 6 months if it is even worth finishing it. Graduate school has put a huge tool in my mental health as nothing else has ever. I wish us luck.",
      "author": "jefgab",
      "created": 1638232840,
      "upvotes": 1,
      "replies": {
        "hmlwg1i": {
          "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmlwg1i/",
          "text": "Congrats on your upcoming defense! I think that's amazing you've reached that point and seems to me like you're not a failure. But of course, mental health comes first so please do what's best for you. I wish you luck, too - thanks!",
          "author": "pathojenesis",
          "created": 1638236647,
          "upvotes": 2,
          "replies": {
            "hmlz59f": {
              "link": "/r/GradSchool/comments/r4odo0/not_sure_if_im_just_a_burnt_out_phd_student_or/hmlz59f/",
              "text": "We got this.",
              "author": "jefgab",
              "created": 1638237898,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}