{
  "sid": "req2ul",
  "link": "/r/GradSchool/comments/req2ul/help_how_to_pick_a_focus_english_grad_school/",
  "title:": "Help! How to pick a focus? (English Grad School)",
  "text": "I took a few years off after my undergrad. I finally feel ready to look for Masters/PhD programs. \n\nHowever, I feel overwhelmed when I think about picking a focus. I loved so much about my undergraduate classes - Victorian, modernism, postcolonial, postmodernism, medieval, Old English language classes....how do I pick just one? Do I need to pick by the time I apply for my  Masters? And which focuses are oversaturated?",
  "author": "Junebug-Jams",
  "created": 1639319263,
  "updated": 1639518499,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.29,
  "comments": {
    "ho96fdr": {
      "link": "/r/GradSchool/comments/req2ul/help_how_to_pick_a_focus_english_grad_school/ho96fdr/",
      "text": "In a lot of programs, it would be enough as an entering student into grad school to specify whether you're interested in British lit, American lit, or medieval studies (Old English is part of medieval studies).\n\n>And which focuses are oversaturated?\n\nFrom what perspective? Eventually getting a job in academia? All of it.",
      "author": "raistlin65",
      "created": 1639322293,
      "upvotes": 8,
      "replies": {}
    },
    "ho9dhg7": {
      "link": "/r/GradSchool/comments/req2ul/help_how_to_pick_a_focus_english_grad_school/ho9dhg7/",
      "text": "I hate to tell you this, but English as a discipline is entirely oversaturated. What are your goals?",
      "author": "jtg_95",
      "created": 1639325237,
      "upvotes": 2,
      "replies": {}
    },
    "ho9firu": {
      "link": "/r/GradSchool/comments/req2ul/help_how_to_pick_a_focus_english_grad_school/ho9firu/",
      "text": "For an MA, you don’t really need a focus, but you should look at how the field is typically divided—region and time period. I came into my PhD as a 20C Americanist, and I’m going out of it a Contemporary Poetry and Queer Studies scholar, and I LOVE Virginia Woolf. \n\nEchoing the other poster here to say that professionally, after grad school, all of them are over saturated. But also different programs have different strengths based on the faculty’s area of expertise, and therefore might bring in more medievalists than most, for example. \n\nLook back at what you chose to write your papers about in undergrad, it’ll give you a good sense of what topics you gravitated toward in those classes, and what topics you would likely be interested in studying more.\n\nThe work you do in an MA should push you more toward defining the disciplinary orientations that work best for you. When you apply for the MA, you just need to know what purpose it serves for you and articulate what you hope to learn from specific faculty while you’re there. Academia is really just a lot of ego stroking to get people to pick you.",
      "author": "ResponsibilityOk617",
      "created": 1639326089,
      "upvotes": 1,
      "replies": {}
    }
  }
}