{
  "sid": "r4sz10",
  "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/",
  "title:": "To quit or not to quit?",
  "text": "First, I just want to preemptively say I appreciate all help and suggestions, so thank you for taking the time to read and reply to this. \n\nTLDR; I am not sure whether I should quit the masters that I hate. I’m also currently employed full time in my ideal career. \n\nI graduated with a psychology bachelors and battled with the uncertainty of what to do next. I’m not a strong researcher so becoming a psychologist was out of the question for me as I knew it would need a ton more school.\n\nI ended up working for several years (event management, temp work) and then did my HR certification. I had an idea that to be an HR executive I would need a masters so without taking a break and knowing research isn’t my strength I enrolled in a Masters of Management Science that was fully paid for and at a fairly average-nothing-to-brag-about school. \n\nWhile there, I ended up meeting my current boss and getting a great, yet demanding full time job. It’s in AI but I’m in the people management part of my firm and got promoted fairly quickly during my 2 years there. \n\nI’ve finished my courses and now all that’s left is my thesis. I work 10-12 hour days at my job and then when I have time (weekend or evenings) I work on my thesis.\n\nProblem is that I’m dragging it on - I hate my thesis topic, I’m struggling to fully grasp the concepts, and this program feels like it’s killing me. My mental health has taken a huge nose dive and I wake up everyday not understanding why I’m in this program.\n\nI feel like the only reason I’m staying is because of outside judgment and expectations. My job doesn’t rely on me getting this masters. I know I won’t finish my thesis this semester and in January I’d have to fork over 3K to keep going as my grants have run out. \n\nI guess I’m on here looking for guidance, has anyone been in my shoes and quit? How did that turn out for you? \n\nAll advice is very welcome as I’m very lost right now.",
  "author": "ilikesandwiches1993",
  "created": 1638181619,
  "updated": 1639882590,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hmj1ior": {
      "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hmj1ior/",
      "text": "Seeing as you're only left with your thesis, then I'd say just keep going. If you've made peace with the fact that you won't be finishing this semester, then you can take things slower and reduce the mental strain on yourself. When people say they hate their topic, the root cause is usually the stress and anxiety caused by a perceived lack of progress relative to some looming deadline. So take a deep breath. Calm down. See that when you finish is not that big of a deal in the grand scheme. Realistically determine how much you have left to do on the thesis, then just start. You'd be surprised at how much you can get done with even 30 mins of reading and shit writing a day.",
      "author": "afMunso",
      "created": 1638192467,
      "upvotes": 2,
      "replies": {
        "hmk9rg0": {
          "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hmk9rg0/",
          "text": "That’s the mentality that’s kept pushing me, but the thesis has been the hardest part for me. This comment does make me want to consider still persevering though, so thank you for replying and taking the time to give me some advice.",
          "author": "ilikesandwiches1993",
          "created": 1638211829,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmjkm4v": {
      "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hmjkm4v/",
      "text": "I’m not sure about the other comment. The thesis is the hardest part. What is also extremely troubling is the fact you hate your topic. I loved my topic, it was my brainchild and i’m passionate about it, and I still struggled immensely because writing clearly using academic concepts is a fucking pain. Imo, I would take you dream job and drop the masters if you feel like it’s a mental drain. I had nothing but my thesis, so I kept on. You seem like you’re better off in that regard.",
      "author": "ThePoliteCanadian",
      "created": 1638201649,
      "upvotes": 1,
      "replies": {
        "hmk99mo": {
          "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hmk99mo/",
          "text": "Thank you - much appreciated advice. I ended up getting a little bit influenced by my advisor (who is wonderful so it was more me being a push over than her steam rolling me) to do a topic that was more in her research wheel house rather than in mine. Congratulations on the completion of your thesis!! Now that I’ve experienced it, I understand the monstrous accomplishment that it is.",
          "author": "ilikesandwiches1993",
          "created": 1638211632,
          "upvotes": 1,
          "replies": {
            "hmkaaj3": {
              "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hmkaaj3/",
              "text": "Oh thank you! I actually have my defence tomorrow. I’m confident but nervous! Good luck to you too on this journey 😅",
              "author": "ThePoliteCanadian",
              "created": 1638212040,
              "upvotes": 1,
              "replies": {
                "hml9wrk": {
                  "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hml9wrk/",
                  "text": "Good luck!! Wishing you the absolute best 🙂",
                  "author": "ilikesandwiches1993",
                  "created": 1638226469,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmjpzs8": {
      "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hmjpzs8/",
      "text": ">I know I won’t finish my thesis this semester and in January I’d have to fork over 3K to keep going as my grants have run out. \n\nSee if you can take the spring semester off for mental health reasons? Then once May and June hit if you're feeling better, then think about whether or not you want to work on your thesis in the fall. \n\nIn other words, no sense in making a final decision now if you don't have to. Could be a six or seven month break is all you need.",
      "author": "raistlin65",
      "created": 1638203901,
      "upvotes": 1,
      "replies": {
        "hmk9jcw": {
          "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hmk9jcw/",
          "text": "I didn’t mention this in my post but I already took this summer off for mental health reasons - and looks like I’m back at square one. Thank you for replying to this! I might have a chat with my advisor based on all this. Really appreciate you taking the time to read and reply to this!",
          "author": "ilikesandwiches1993",
          "created": 1638211739,
          "upvotes": 1,
          "replies": {
            "hmkc5bw": {
              "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hmkc5bw/",
              "text": "Definitely talk this out with your advisor. Working full-time and in a salary position where you're doing more than 40 hours a week and trying to do graduate school, is hard on anyone.",
              "author": "raistlin65",
              "created": 1638212788,
              "upvotes": 1,
              "replies": {
                "hmla37m": {
                  "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hmla37m/",
                  "text": "Thank you, it definitely has taken its toll. She’s an incredibly supportive advisor, which is probably why I stuck it out for as long as I did (slash will).",
                  "author": "ilikesandwiches1993",
                  "created": 1638226546,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmku2ya": {
      "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hmku2ya/",
      "text": "I worked full time while I wrote my thesis (I had completed the research, but had not written one word) after a monstrous grad school experience. I moved for the job and hated where I lived, the culture where I lived, my thesis topic, and the fact that I was still tied to a toxic graduate experience. I can imagine your situation very well and I sympathize with you totally. If your degree will open more doors than are open to you now, and if there’s even a chance those doors might open to somewhere you want to go, I think it is worth it to find that $3,000 and get the piece of paper (degree). That piece of paper, although the pursuit of it is enslaving, could be the key to your professional freedom and mobility for the rest of your life. I drug my miserable carcass through the semester of thesis writing to get to that finish line because I couldn’t stand to invest so much of my time, energy, and lifeblood into an effort just to see it diminish into a meaningless gray cloud buried in my memory. My degree is a symbol of my perseverance in the face of financial hardship, emotional hardship, physical hardship, and duress under the tyranny of a warped and broken academic ego manufacturing plant. It can be the same for you. $3,000 is a lot of money, but how much are all those doors the degree might open worth to you?",
      "author": "Megasoulflower",
      "created": 1638219968,
      "upvotes": 1,
      "replies": {
        "hmladqz": {
          "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hmladqz/",
          "text": "I relate to this immensely and it’s wonderful to see that someone made it through this period of time and got that degree. I think a part of my was looking for people to confirm what I want to do (leave) but you’re making me consider that I have put a lot into this and if it even gives me some sort of opportunity in the future, I maybe shouldn’t throw it away. Congratulations on getting through this time and getting that paper!!",
          "author": "ilikesandwiches1993",
          "created": 1638226673,
          "upvotes": 3,
          "replies": {
            "hmmjsyg": {
              "link": "/r/GradSchool/comments/r4sz10/to_quit_or_not_to_quit/hmmjsyg/",
              "text": "Thank you! (:",
              "author": "Megasoulflower",
              "created": 1638247483,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}