{
  "sid": "rc2hkp",
  "link": "/r/GradSchool/comments/rc2hkp/feeling_super_discouragedcould_use_some_direction/",
  "title:": "Feeling super discouraged—could use some direction and advice.",
  "text": "Hey all,\n\nHope everybody's surviving as the semester rolls to a close :)\n\nI'm a current junior at a solid (but definitely non-elite) institution studying literature and rhetoric, and to make a long story short, I've had about four or five of my professors unpromptedly recommend that I seriously consider pursuing graduate school when I'm finished with undergrad. \n\nThe reason I feel discouraged is that... well, I've always been somewhat of an underachiever—I got into my school as a result of test scores but have always had a comparably mediocre GPA, and that trend has persisted into my undergraduate studies. I'm currently sitting at a 3.55, and unless God is *reeeeeal* gracious to me, I don't foresee a substantial increase out of this semester in particular, and it may even *decrease*, which I've heard is fairly dangerous as an upperclassman in particular. *This* was supposed to be the semester that I finally snagged that coveted 4.0, but with work and supplementary organizations and my recent diagnosis of ADHD/other health hiccups, I simply didn't have the time to fully commit to my extensive workload. \n\nMy professors continually praise the work that I do manage to complete, but I've accumulated substantial absences and late assignments—not to the point of failing any courses, but enough to *probably* bar me from securing a solid A in some important classes. \n\nI have really, really outstanding relationships with my professors, and know that they'd all likely write me glowing letters of recommendation, but I'm still pretty discouraged by the situation which I've once again landed myself in. I hate abusing the grace of my professors time and time again—however unintentional it might be, that's definitely what my actions amount to, and that's simply not acceptable. I never even considered myself smart until my professors began to encourage me and single me out, and they have *so* much faith in me... it's ridiculously humbling, and I hate letting them (and myself) down time and time again. Not to mention that they've helped me to realize that—in all humility— I do have some degree of academic capability and ambition, though I never would have told myself that in high school.\n\nI'm just so worried that I've essentially shot myself in the foot with my grades being as they are. Beyond mere consolation, I'd seriously appreciate it if you guys could give me some tangible advice on how to prevent these situations from happening in the future, particularly regarding time management and ways I could supplement my relatively lackluster grades to make myself more marketable to graduate programs.\n\nIf you've taken the time to read all of this, sincerely, thank you. Much love.",
  "author": "mitchellsm2",
  "created": 1639001847,
  "updated": 1639518579,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hns37dt": {
      "link": "/r/GradSchool/comments/rc2hkp/feeling_super_discouragedcould_use_some_direction/hns37dt/",
      "text": "Omg your writing is amazing!\nYou are young. Trust what your professors see in you. Grades aren't everything. I know outstanding scholars who had mediocre grades, and full professors who I sometimes think have never thought an original thought in their life, they are just hard workers and have been \"good students\" forever.\n\nI'm sure there's a way. Can you talk to these professor or an advisor at your university for practical advice? Can you repeat courses?\nGood luck anyway!",
      "author": "Naivemlyn",
      "created": 1639004054,
      "upvotes": 2,
      "replies": {
        "hns66h4": {
          "link": "/r/GradSchool/comments/rc2hkp/feeling_super_discouragedcould_use_some_direction/hns66h4/",
          "text": "Thanks a lot :) I really appreciate the encouragement. My university has a success center that I just haven't taken advantage of for whatever reason, so I think I'll pop in before next semester begins",
          "author": "mitchellsm2",
          "created": 1639005318,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnukf39": {
      "link": "/r/GradSchool/comments/rc2hkp/feeling_super_discouragedcould_use_some_direction/hnukf39/",
      "text": "Fellow ADHDer here and I went to a state school for undergrad. Due to reasons beyond my control, I ended up homeless in college which led to my dip in grades and mental + emotional wellbeing. That said, I graduated with a 2.7 GPA. Like everyone else, I thought I quantified as a failure. I mean, who's going to hire a 2.7 grad from a state school?\n\n5 years later, it turns out Yale would. And, eventually Harvard would accept me into their Master's program. I actually just wrapped up my second to last semester. \n\nIn my experience, working has really helped me show grad schools that I'm more than my undergrad GPA. I've matured since, and have a lot more focus towards the subject I'm going in for (was a STEM major in undergrad, currently in the Ed school). Grades aren't everything. Work ethic and character plays a huge role in your apps as well and that shines through from your personal statement and LoRs.\n\nI also serve as an application reader for one of the programs we offer at Yale. I come across 4.0's and perfect test scores everyday during app. reading season. But that doesn't mean anything if they aren't a good fit, haven't done their research on our program, or if they come off as extremely shallow, critical, and put their peers down in their essays. You'd be surprised at how many students do one or all of the above.\n\nI wish you the best of luck and I hope you're taking extra care of yourself. Burnout is real especially for students who are going to school during a pandemic.",
      "author": "Cheari0",
      "created": 1639056224,
      "upvotes": 2,
      "replies": {
        "hnvc4ik": {
          "link": "/r/GradSchool/comments/rc2hkp/feeling_super_discouragedcould_use_some_direction/hnvc4ik/",
          "text": "Dude, this is such an encouraging story—can't thank you enough for sharing. Genuinely proud of you for fighting through something as insane as homelessness and still even managing to *graduate*. My problems are so small in comparison! Would you mind sharing a little bit more about the kind of work you were doing and how you were able to tangibly display your character/work ethic to graduate programs?\n\nAlso, I didn't touch on it much in the post, but yes—undergrad with ADHD is something else. Proud of you for getting through it, not blaming your ADHD, and maturing in spite of the obstacle it continually poses. I hope I can follow your example and do the same.",
          "author": "mitchellsm2",
          "created": 1639068346,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}