{
  "sid": "pyxz08",
  "link": "/r/GradSchool/comments/pyxz08/imposter_syndrome/",
  "title:": "Imposter Syndrome?",
  "text": "I’m feeling incredibly anxious. It might be my exam tomorrow or something but I just feel like I was accepted here by mistake sometimes. \n\nWhen I’m teaching, I feel like I’m over the moon, like it’s what I’ve been put on earth to do. I feel so confident and happy, like I’m helping the community. But, when I’m in my own classes, that feeling just immediately gets taken from me and is replaced with me feeling like I’m the worst out of all my classmates and I won’t amount to anything in life.\n\nDoes anyone feel something similar or is it just me? Maybe just some of the PhD blues?",
  "author": "lesbianpearls",
  "created": 1633052973,
  "updated": 1634100072,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hexgavj": {
      "link": "/r/GradSchool/comments/pyxz08/imposter_syndrome/hexgavj/",
      "text": "Maybe you are seeing through the BS of higher ed... sorry to be blunt. But all of that theoretical stuff isn't gonna matter as much as the profs and the ace students make it seem. Could be some cognitive dissonance going on because you know that the textbook stuff doesn't matter as much as they want to make you believe it does and yet you want to study it and \"do well\" in school like your peers are. Look, a degree is a degree. Let go of perfectionism. You're probably more of a do-er than a studier, especially when it's not really applicable stuff... IMHO just show me how to do the job and we are good. Universities just want to make money on endless fluff classes...",
      "author": "Kitty_fluffybutt_23",
      "created": 1633055165,
      "upvotes": 2,
      "replies": {
        "hexjnq1": {
          "link": "/r/GradSchool/comments/pyxz08/imposter_syndrome/hexjnq1/",
          "text": "I mean, I really enjoy the classes and I find it super interesting. I absolutely love proofs and all that, actually. It’s just that I feel like I’m somehow behind everyone else. It might just be my own perception though. I’m not sure.",
          "author": "lesbianpearls",
          "created": 1633056837,
          "upvotes": 2,
          "replies": {
            "heyxqp3": {
              "link": "/r/GradSchool/comments/pyxz08/imposter_syndrome/heyxqp3/",
              "text": "Probably is your own perception getting in the way. And also, even if you were \"behind\" your peers... so what? They may struggle more when it comes to actually jumping in and doing the job and you're doing great! That's the really important thing. Don't be hard on yourself. Show compassion to yourself!",
              "author": "Kitty_fluffybutt_23",
              "created": 1633093116,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}