{
  "sid": "qpmpkc",
  "link": "/r/GradSchool/comments/qpmpkc/does_your_department_have_qliques/",
  "title:": "Does your department have \"qliques\"?",
  "text": "I ask because the time I've spent in the office the last few weeks has made me realise I'm kind of the odd one out since almost all of them are doing physics PhDs and mine is in pure mathematics. \n\nThey all seem to go off in their own research group and almost always socialise inside their own circle. I've tried my best to be pleasant but they keep on acting as if I'm not even there...",
  "author": "Erwin_Schr0dinger",
  "created": 1636404187,
  "updated": 1636656567,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hjuo3m4": {
      "link": "/r/GradSchool/comments/qpmpkc/does_your_department_have_qliques/hjuo3m4/",
      "text": "Yeah, definitely. But pretty much every situation where more than a handful of human beings are going to interact with each other on a daily basis for more than a couple of days will lead to the formation of cliques. It's just about unavoidable.",
      "author": "InfanticideAquifer",
      "created": 1636405519,
      "upvotes": 13,
      "replies": {}
    },
    "hjv7p1x": {
      "link": "/r/GradSchool/comments/qpmpkc/does_your_department_have_qliques/hjv7p1x/",
      "text": ">I'm kind of the odd one out since almost all of them are doing physics PhDs and mine is in pure mathematics. \n\nThat can definitely happen, as talking shop about your research area is one way people get to know each other. So it's natural that people who have more common interests get to know each other a little quicker.\n\nGive it some time. You'll eventually get to know some people.",
      "author": "raistlin65",
      "created": 1636413572,
      "upvotes": 6,
      "replies": {}
    },
    "hjwv4h4": {
      "link": "/r/GradSchool/comments/qpmpkc/does_your_department_have_qliques/hjwv4h4/",
      "text": "My advisor doesn't get along with the other professors in our department (as in - openly wanted to deny tenure to the professor who is most popular with students and gets the most international recognition for his research), so we (her advisees) are quite isolated from the other PhD students. Such is life.",
      "author": "No-Heart-1454",
      "created": 1636444523,
      "upvotes": 4,
      "replies": {}
    }
  }
}