{
  "sid": "qykfc5",
  "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/",
  "title:": "Do I actually have a chance at making close friends in grad school, or should I just not expect that",
  "text": "I have two close girlfriends, one I genuinely consider my best friend. I see her a decent amount; we have lulls where we don't see each other for two weeks, but that's it. The other girl I am close to was my best friend. She excludes me from hangouts in her main friend group, and honestly, it hurts. I am in a post-bachelors, but after I plan on applying to grad school, I will probably go for a Ph.D. I would love to make more friends in my Ph.D. I'm interested in physics, so I know there aren't as many girls, but they are there. Just wondering if meeting best friends in grad school happen to some people or is completely unrealistic.",
  "author": "AnybodyPresent6461",
  "created": 1637460012,
  "updated": 1639880216,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.93,
  "comments": {
    "hlgkfwp": {
      "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hlgkfwp/",
      "text": "I'd say you get out of it what you put in to it. I have made very few friendships that go past work colleagues so far, but I'm also very bad at making friends or going out of my way to be social. My girlfriend has made several friends so far, some of which she considers some of her closest currently. You will have plenty of opportunities to mingle, if you put in more effort than me I think it's reasonably possible to make good friends.",
      "author": "atomz27",
      "created": 1637460571,
      "upvotes": 6,
      "replies": {
        "hlgla33": {
          "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hlgla33/",
          "text": "I'm bad at making friends too but that's mostly because of fear of rejection. It doesn't help that I am going into a field that doesn't have a huge amount of women. Its good to hear your gf made friends!",
          "author": "AnybodyPresent6461",
          "created": 1637460994,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlglcgr": {
      "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hlglcgr/",
      "text": "I met two of my closest friends through people in grad school. I didn’t know anyone in the city so I hung out with a guy that was from here and knew people. So I met a lot of people through him and ended up making two great friends. But making new friends is a lot tougher once you’re not in college, and even more so if you’re in a new city.",
      "author": "ImJustAverage",
      "created": 1637461027,
      "upvotes": 2,
      "replies": {
        "hlglpy5": {
          "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hlglpy5/",
          "text": "At least for girls, we have bumble BFF and stuff for new cities and stuff, lol. I also think it may be harder to make friends in a relationship? Other than my best friend, most of my single friends prefer other singles, understandably.",
          "author": "AnybodyPresent6461",
          "created": 1637461216,
          "upvotes": 2,
          "replies": {
            "hlh9ux8": {
              "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hlh9ux8/",
              "text": "I found it easier for myself to make friends when I was single lol. But my gf was long distance since I moved away for grad school",
              "author": "ImJustAverage",
              "created": 1637475002,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlh14fd": {
      "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hlh14fd/",
      "text": "I met a girl at orientation who ended up in several of my classes and we glommed onto each other because we didn't know anyone else. She introduced me to another girl in our classes and we quickly became a very close little trio. We don't have classes together anymore but we're all still very close and I'm confident they're going to be lifelong friends. Other than them, my whole cohort is full of wonderful people and we all help each other.\n\nHanging out at school between classes, especially if your school has a graduate lounge, is excellent for getting to know people. Group chats are also great but you have to be careful bc they can sometimes turn toxic.\n\nYou'll find friends :) I am NOT one to start conversations but I still found my people!",
      "author": "signedizzlie",
      "created": 1637469519,
      "upvotes": 2,
      "replies": {}
    },
    "hlj34ek": {
      "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hlj34ek/",
      "text": "It can be harder because the nature of grad school doesn’t lend itself very well for making easy friendships, but it’s certainly possible. It will require more effort and it’s harder these days living in the new pandemic era but it’s doable. \n\nYou will need to put effort. Ive made a ton of friends during my PhD and have 6 friendships that I believe will be long lasting. I made sure to join a good mix of hobbies and of those 6 grad school friends I mentioned, 3 aren’t in my department and 2 of them while grad students, aren’t even in STEM like myself.  \n\nWhat I did was go to university hosted grad events.. both campus wide and department. Made efforts to reach out to and get numbers of those who we hit it off well.. and within one week of that I’d text to hang out. Often grabbing lunch together on campus and then going from there.",
      "author": "random-thots-daily",
      "created": 1637514746,
      "upvotes": 2,
      "replies": {}
    },
    "hljsui5": {
      "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hljsui5/",
      "text": "I joined a lab with another female grad student that I vibed well with. With all the hours spent together in lab and the need to rely on each other through all the challenges of grad school, we became really great friends. She’s now one of my bridesmaids. I’d say in general it depends on how social you are, how much work you put into it and if you happen to find  people you have stuff in common with. I made plenty of other friends in grad school but none became particularly close (especially enough to survive past grad school) except for this one but I’m not very good at making friends in general since I don’t like to go out much and grad school made balancing a social life with my romantic relationship and my family hard enough without having to add in the complexity of friends. With her and I in the same lab however that allowed for a lot more time together than I would’ve been able to handle if it needed to be in “off” hours.",
      "author": "Nothing_Relevant88",
      "created": 1637524943,
      "upvotes": 2,
      "replies": {}
    },
    "hlkrbsv": {
      "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hlkrbsv/",
      "text": "I think it really depends on your department's culture. I haven't had much luck making good friends within my department, but people I know in other departments are close to their whole cohort.",
      "author": "TamaraLNF",
      "created": 1637539591,
      "upvotes": 1,
      "replies": {
        "hll9pmf": {
          "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hll9pmf/",
          "text": "Sorry that you haven't had much luck (if that is something you care about). That's what I'm a tad bit worried about. Although things can change because I have more core classes to take, I can see myself in a theoretical field such as theoretical physics or computer science. In some theoretical programs, you still do modeling/programming in a lab, but I heard that it can be a lot of independent work doing math all day in others. I love it, but if everyone is isolated doing math all day, it may be hard to make friends.\n\nedit: it was supposed to say I'm sorry that you haven't had much luck! damn Grammarly lol",
          "author": "AnybodyPresent6461",
          "created": 1637548189,
          "upvotes": 1,
          "replies": {
            "hln2oyy": {
              "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hln2oyy/",
              "text": "It is something I very much care about – but I don't think it's actually a side effect of the work. I came to my current institution from a Computer Science department that was very social. The department where I am now is cliquey, and students rarely interact with those outside of their research group/area. As the only CS student in my research group, and as someone in a niche area, those circles basically never include me.",
              "author": "TamaraLNF",
              "created": 1637590915,
              "upvotes": 1,
              "replies": {
                "hlnocq9": {
                  "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hlnocq9/",
                  "text": "I find that strange; they sound close-minded. I'm more than happy to make friends with anyone in the realm of math/physics/CS if they're hard workers. I'd probably make friends with people outside those areas, too, but they spend a lot of time with their groups, so it's not as likely. Maybe you'll meet someone along the way; I wish you luck :)",
                  "author": "AnybodyPresent6461",
                  "created": 1637600209,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlmr7en": {
      "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hlmr7en/",
      "text": "Yes.",
      "author": "Weekly-Ad353",
      "created": 1637584487,
      "upvotes": 1,
      "replies": {}
    },
    "hlxsez7": {
      "link": "/r/GradSchool/comments/qykfc5/do_i_actually_have_a_chance_at_making_close/hlxsez7/",
      "text": "well, i don't make friends easily as well and for 2 years of my PhD studies i had made 0 new friends and thought it will be like that from now on. Until I met my now fiance who was the newest PhD student in our lab at my last year of PhD. \n\nso, I'd say it's possible to make friends in grad school, but also really depends on the environment and group/uni/grad school dynamics. \n\nsome people from my grad school have found many great friends, while I'm not friends with any of them.",
      "author": "Ketkin",
      "created": 1637782134,
      "upvotes": 1,
      "replies": {}
    }
  }
}