{
  "sid": "rirjgt",
  "link": "/r/GradSchool/comments/rirjgt/in_grad_school_do_you_or_did_you_work_full_time/",
  "title:": "In grad school do you (or did you) work full time or part time?",
  "text": "\n\n[View Poll](https://www.reddit.com/poll/rirjgt)",
  "author": "Help_Me_Reddit01",
  "created": 1639777100,
  "updated": 1639882734,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hoza37n": {
      "link": "/r/GradSchool/comments/rirjgt/in_grad_school_do_you_or_did_you_work_full_time/hoza37n/",
      "text": "Where I am, holding any sort of job outside of very occasional tutoring is not allowed and is grounds for expulsion…",
      "author": "officially_anxious",
      "created": 1639781395,
      "upvotes": 4,
      "replies": {
        "hozk4hx": {
          "link": "/r/GradSchool/comments/rirjgt/in_grad_school_do_you_or_did_you_work_full_time/hozk4hx/",
          "text": "Where I am, holding any other job within the university is against our contract. If you want to go wash dishes (what I've occasionally done) as long as it isn't within the university its fine.",
          "author": "Professional_Angle87",
          "created": 1639785810,
          "upvotes": 1,
          "replies": {
            "hozko0h": {
              "link": "/r/GradSchool/comments/rirjgt/in_grad_school_do_you_or_did_you_work_full_time/hozko0h/",
              "text": "Ah, ours is pretty much the opposite!\n\nWe're allowed to tutor (called \"supervising\" here) or maybe help with undergrad labs, if we have permission from our PI and it doesn't go over 10 hours a week maximum.\n\nBut we cannot hold any job outside of the university/department (ever) and we can't hold any job *inside* the university without our PIs permission. If they discover you've broken the rules, they can withhold all assistance. If you ever ask for help or an extension or anything like that, they'll refuse because it's your fault for holding a job. They don't usually go nuclear and expel people, but they'll definitely make your life hell. And it's a university town and you're not allowed to live more than 10 miles from the centre, so the chances of holding a separate job and not being caught are pretty low.",
              "author": "officially_anxious",
              "created": 1639786049,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hozdqot": {
      "link": "/r/GradSchool/comments/rirjgt/in_grad_school_do_you_or_did_you_work_full_time/hozdqot/",
      "text": "Summer internships count as part time, I’m assuming?",
      "author": "Psychological-Ear-32",
      "created": 1639782940,
      "upvotes": 1,
      "replies": {}
    },
    "hp1myue": {
      "link": "/r/GradSchool/comments/rirjgt/in_grad_school_do_you_or_did_you_work_full_time/hp1myue/",
      "text": "Are you asking about work outside TA/RA appointments? In my physics program everyone has either a TA or an RA appointment that covers tuition & classes and provides health care and a livable stipend (we basically get paid to learn) and we need special permission to take on another job (and idk anyone that's gotten another job; between research and classes/studying there's not really time to take on more responsibility).",
      "author": "the_physik",
      "created": 1639833805,
      "upvotes": 3,
      "replies": {}
    },
    "hp2hhum": {
      "link": "/r/GradSchool/comments/rirjgt/in_grad_school_do_you_or_did_you_work_full_time/hp2hhum/",
      "text": "I sort of fall in the middle. During the school year my assistantship has me working part-time, but during the summer I'm switched to full-time.",
      "author": "RunningDrummer",
      "created": 1639848754,
      "upvotes": 2,
      "replies": {}
    }
  }
}