{
  "sid": "qbbary",
  "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/",
  "title:": "Have you all felt that you've learned nothing thus far?",
  "text": "I am currently in my second year of a US Masters program in counseling psychology. I, and other classmates, feel that we have learned nothing. Especially those who started in the fall of 2020 (when things were still shut down a bit). We're all supposed to be taking comprehensive exams soon and feel that we haven't learned much and I was wondering if anyone else felt the same way lately. \n\nI thought about reading books on the subject I'm interested in and the theories I like, but will that only do so much...\n\nI am supposed to graduate in the next year or so, and I'm feeling very defeated and just absent minded about my studies. Anyone else in the same 🛶?",
  "author": "rainbowgirl6",
  "created": 1634649308,
  "updated": 1636200353,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hh8ison": {
      "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hh8ison/",
      "text": "Same same same. I'm in for aerospace engineering and like holy hell I feel so blank. I know I've learned like _some_ stuff obviously, but it all feels fragmented. Its like being given a puzzle to solve and you know all the pieces fit together, but you cant remember what one piece looked like after looking at the next piece. Idk if that even makes sense lol. \n\n\nIts also kinda terrifying for like our futures yknow? Like counseling and engineering are serious things that can have major consequences, good or bad. I'm scared to be thrown in the deep end next year.",
      "author": "hufflepuffhorcrux",
      "created": 1634653807,
      "upvotes": 1,
      "replies": {
        "hh8ut8a": {
          "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hh8ut8a/",
          "text": "Exactly. I feel that they're already throwing us in the deep end. Especially that we all have internship coming up where we'll be actually counseling people VERY soon... like someone's life is literally in my hands now 😭 I hope that things get better for us. It makes me wonder if it was always like this....",
          "author": "rainbowgirl6",
          "created": 1634658873,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hh8v911": {
      "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hh8v911/",
      "text": "I feel like everything I’m learning thus far is conceptual/theoretical but doesn’t translate into utilizable skills. (Public admin)",
      "author": "Flowtivation",
      "created": 1634659057,
      "upvotes": 10,
      "replies": {
        "hh967tj": {
          "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hh967tj/",
          "text": "Yes exactly! Like enough to pass tests and hypothetical scenarios but nothing to actually prepare me for real life!",
          "author": "rainbowgirl6",
          "created": 1634663533,
          "upvotes": 5,
          "replies": {
            "hh9q521": {
              "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hh9q521/",
              "text": "In an MPP program. 100% has zero to do with an actual job.",
              "author": "aloepant",
              "created": 1634671380,
              "upvotes": 2,
              "replies": {
                "hh9y78j": {
                  "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hh9y78j/",
                  "text": "I’m starting to wonder if I would have been better off getting some technical certifications. Academia feels so disconnected from everything else.",
                  "author": "Flowtivation",
                  "created": 1634674526,
                  "upvotes": 3,
                  "replies": {
                    "hh9yzsv": {
                      "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hh9yzsv/",
                      "text": "I’m working while in school. Honestly the degree is a piece of paper I need to advance. A very expensive one.  Work experience will always be more important than degrees in advancing.",
                      "author": "aloepant",
                      "created": 1634674842,
                      "upvotes": 6,
                      "replies": {
                        "hha0jtx": {
                          "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hha0jtx/",
                          "text": "I’ve really had a hard time advancing at all in the workplace and was hoping a degree could help prepare me to switch into the type of jobs that feel unattainable to me now. It’s not that I don’t think what we are learning is important but i don’t understand why more graduate programs can’t involve getting certifications and learning job related skills along the way.",
                          "author": "Flowtivation",
                          "created": 1634675473,
                          "upvotes": 2,
                          "replies": {
                            "hha1d58": {
                              "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hha1d58/",
                              "text": "100%. For example, getting a PMP certification alongside the degree.",
                              "author": "aloepant",
                              "created": 1634675801,
                              "upvotes": 3,
                              "replies": {
                                "hhdh9mk": {
                                  "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hhdh9mk/",
                                  "text": "To me, anything with “admin” in the title should be teaching us skillsets (ie advanced proficiency in Microsoft office suite) applicable to “admin” jobs.",
                                  "author": "Flowtivation",
                                  "created": 1634744942,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hh9kwv6": {
      "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hh9kwv6/",
      "text": "Maybe It depends on the field. For computer science I feel like I'm learning what would have taken decades if I wasn't in grad school.",
      "author": "nbgblue24",
      "created": 1634669324,
      "upvotes": 11,
      "replies": {
        "hh9qrmf": {
          "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hh9qrmf/",
          "text": "same, environmental sciences.",
          "author": "rox_et_al",
          "created": 1634671621,
          "upvotes": 7,
          "replies": {}
        },
        "hhafrqr": {
          "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hhafrqr/",
          "text": "what sorts of things are you learning? I study cs too, and am curious",
          "author": "sakuraseven",
          "created": 1634681893,
          "upvotes": 2,
          "replies": {
            "hhbn7ur": {
              "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hhbn7ur/",
              "text": "Building pc from ground up, LaTex, shell scripting, experimental design, lots and lots of math, hundreds of papers, how to review papers.The math is the most interesting... Things that looked insane just a couple of years ago are finally something i understand now... Like compression algorithms or adversarial neural networks, low rank approximations.",
              "author": "nbgblue24",
              "created": 1634702858,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hh9vp2a": {
      "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hh9vp2a/",
      "text": "I'm feeling like a majority of my program was a waste of time. I'm working on a Masters of Arts for education. Some classes have taught me things but this semester feels like a repeat of last year. I just rather be completing the internship since I've heard no program prepares you for the actual job. I can't even remember what I've learned.",
      "author": "Dinosaurs_have_feet2",
      "created": 1634673537,
      "upvotes": 5,
      "replies": {}
    },
    "hh9qo9c": {
      "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hh9qo9c/",
      "text": "I feel the same way. I'm in school psych program and I started in 2020 too! It was a strange year and I felt like I was missing out on a lot regarding my education. This year I'm doing my practicum in schools, but I feel so lost lol. Things we have learned in school does not translate well in the real world and it's throwing me off. I'm terrified for my internship year.",
      "author": "ananjaan",
      "created": 1634671586,
      "upvotes": 5,
      "replies": {}
    },
    "hhb56nj": {
      "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hhb56nj/",
      "text": "The first year of my program is basically a rehash of my undergrad and some 101 level material from other majors but based on what I've heard from other students the second year will be completely hands-off research and a batshit amount of work. So I have that to look forward to, I guess?",
      "author": null,
      "created": 1634693706,
      "upvotes": 5,
      "replies": {}
    },
    "hhapx64": {
      "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hhapx64/",
      "text": "I also started in Sept 2020 for Experimental Psych. Ive learned jack shit. I spend most of my days either crying or super tired/over it. I was so excited to start school, but instead it’s been a waste of money.",
      "author": "imasinger",
      "created": 1634686564,
      "upvotes": 3,
      "replies": {}
    },
    "hhcxd85": {
      "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hhcxd85/",
      "text": "In my 1st semester in a mechanical engineering Master’s program. I’d say I’m learning some from some classes and not much from others. My drive for a master’s in engineering was to APPLY all this coursework to real life stuff but it’s still so theoretical & full of lengthy derivations. I understand *why* we need the theoreticals but applying it allows students to visualize it all. Idk.\n\nResearch seems to be teaching me the most about topics I’ve never seen before.",
      "author": "Antoniojosh123",
      "created": 1634736368,
      "upvotes": 2,
      "replies": {
        "hhdk875": {
          "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hhdk875/",
          "text": "I'm just scared I'm going to go into practicum and internship not knowing anything. It seems a little too common for that to happen. Hypotheticals only do so much😭\n\nSide note: I'm digging the profile picture and your car! Super cool:)",
          "author": "rainbowgirl6",
          "created": 1634746127,
          "upvotes": 2,
          "replies": {
            "hhhc8bt": {
              "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hhhc8bt/",
              "text": "It may seem like that but I’m sure you’ll be blown away by how much you retained in the end!! Just keep chipping away & attack that practicum head on.\n\nAnd thank you! :)) gotta look fresh 😎",
              "author": "Antoniojosh123",
              "created": 1634817905,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hh9au7g": {
      "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hh9au7g/",
      "text": "...learn?",
      "author": "ning7",
      "created": 1634665371,
      "upvotes": 5,
      "replies": {}
    },
    "hhcf663": {
      "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hhcf663/",
      "text": "I’ve learned a lot from my course - MSc by Research in the U.K. \n\nI’ve mainly learned research skills, statistics, R programming.",
      "author": "beautyonthebiside",
      "created": 1634725062,
      "upvotes": 1,
      "replies": {}
    },
    "hhewzpu": {
      "link": "/r/GradSchool/comments/qbbary/have_you_all_felt_that_youve_learned_nothing_thus/hhewzpu/",
      "text": "I don't know how it is in a M.S. program but in a Ph.D. sure you learn stuff but just like in a undergrad class you have to know the knowledge exists and how to get it and how to apply it. You aren't supposed to know everything, I mean an MD has to memorize a lot of stuff so they are, a PhD teaches you really the right questions to ask and how to find the answers.",
      "author": "rthomas10",
      "created": 1634765486,
      "upvotes": 1,
      "replies": {}
    }
  }
}