{
  "sid": "qhe8b5",
  "link": "/r/GradSchool/comments/qhe8b5/a_difficult_decision_could_use_some_perspective/",
  "title:": "A difficult decision; could use some perspective",
  "text": "Sorry about formatting, on mobile.\n\nSo I'm a fifth year phd student (physics) and switched groups earlier this year. I still haven't done my prelims (part of why I switched groups), and am in a VA vocational rehabilitation program that supports me partwise.\n\nWell, they (the VA) have started pinging me a bit about when am i going to graduate, status of dissertation, etc. Even asked if i was going to graduate this semester.\n\nThis has got me thinking, and after a chat with my PI, it seems I can get a Master's by the end of next semester likely  or spend another 2-3 years to finish my PhD. I'm trying to decide which is the better option for me, given some of the following:\n\n- I intend to work in industry, possibly data science, instead of research/academia\n\n- the VA will assist with job seeking/resume building as part of the program, but I don't know if they'll extend me the time to finish the PhD \n\n- I have middling interest in my research, and research in general\n\n- I'm kind of terrified of trying to job seek currently as I really don't have a grasp of what my marketable skills are (like, I can do Python coding, but would I be considered proficient? I'm not sure where the bar is)\n\nSo, I don't know. I was aiming as high as I could since I'm the first in my immediate family to graduate high school, but I'm also feeling super burned out and missing just having a job. I like being in grad school (weirdly enough), but also have fallen out of love with physics. I can do research, but I don't love it or find it exciting. I have a great PI and colleagues/lab, but I'm definitely the weakest link (since I'm newest).\n\nDoes it make sense to go for the masters to make sure I have all my VA benefits to enter the workforce? Or would the extra 2-3 years to get the PhD carry sufficient value to risk my VA program support?\n\nThanks for all the opinions and perspectives in advance!",
  "author": "Deacon_Black",
  "created": 1635392884,
  "updated": 1635457644,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hicensm": {
      "link": "/r/GradSchool/comments/qhe8b5/a_difficult_decision_could_use_some_perspective/hicensm/",
      "text": "Wow, another vet in physics? Loving it. Ex-submariner, US Navy, now doing experimental physics over here (cheers).\n\nMy opinion is take the Masters degree and go find work. You're not digging research, so the next couple years are going to be a slog. If you're tired of physics now, just imagine how burned out you'll be in a few years. I get why the family situation means you want to aim as high as possible (I'm the first in my family to make it into college), but life is short, friend. It's hard to put a price on happiness. Plus, you can always go back to school later. There was an retired Navy guy in my program just a couple years ago (he just wanted to finish the degree he started when he was a pup and he did it).\n\nNow, that said, I'd start putting feelers out into industry to see what your options are. Ever done a reverse interview? I sat down with a bunch of lawyers before I applied to grad school and it definitely talked me out of going into law school. If you're interested, I would recommend contacting folks in positions that are similar to what you want. Cold calling sucks, but there might be people from your PhD program who have moved on to industry and the sort of work you'd like to do. You might be able to reach out to them and see if they've got 10 minutes or so to chat about their job. Chat up a couple professors about it, folks you're already comfy with, and see if they've got some folks to contact. That would also give you a feel for whether or not your qualifications are enough.\n\nAs for proficiency in a coding language, you're fine. You're proficient, friend. Once you've got the basics of any programming language, it's all just googling how to write something you already know about in a new language. If you've ever done a basic coding class, you're already light years ahead of a lot of people. And if you haven't, there's some free ones online!\n\nThere's probably a starting pay difference in a PhD versus a Masters if you're going into the same work, but you really have to ask yourself whether or not you think you can make it through the next couple years. If I hated my job, I don't think I could make it through another 3 years. When I was an undergrad, I knew quite a few grad students who took their masters and moved out to the workforce. They are loads happier than the people who decided to stick them out even though they hated it.\n\nHope some of this helps. It's a tough decision, for sure. Ultimately, I hope whatever you do, whatever you choose, you end up in the best possible position for you. Cheers!",
      "author": "DecoherentDoc",
      "created": 1635396447,
      "upvotes": 2,
      "replies": {
        "hicndpk": {
          "link": "/r/GradSchool/comments/qhe8b5/a_difficult_decision_could_use_some_perspective/hicndpk/",
          "text": "Hey hey! Ex-submariner here too!\n\nYou make some great points, and I think you're right. The pay difference won't be a big thing for me, as long as I can make a living wage and not lose my mind I'm generally happy haha.\n\nI think I'll spend a couple nights doing a deep dive on sites like Indeed and tool around LinkedIn to get a better idea of work goals/proficiencies. Luckily my PI is supportive of whichever route I take, and already told me I have a pretty solid basis for a master's thesis if I head that way.\n\nIt'll be a push, but if I can handle an unisolable steam leak on my watch station I can probably gear up for the workforce haha.\n\nLooking back, it seems I should have done computer science instead of physics, and kept physics as a neat side hobby. But, you live and learn, right?\n\n:-D",
          "author": "Deacon_Black",
          "created": 1635402573,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}