{
  "sid": "gm0r0k",
  "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/",
  "title:": "My dad doesn't believe me when I say I'm expected to be on-campus for research in the Fall even if classes are online (I'm starting a PhD at Texas A&M).",
  "text": "He's supporting me a little bit financially but he doesn't want me \"to be the only one on campus\" even if it's for doing research for my assistantship so that I can get paid. His reasoning has to do with paying for an apartment (he's helping me out just a little bit to help lessen the burden of getting a very secure apartment so he doesn't have to worry). My dad doesn't believe me to the point where he says he's going to call the Office of Research to see what's up (I don't know if FERPA comes into play with that because research is different from person to person).\n\nI already know I have to show up in person to start the onboarding process (which I have told him multiple times), and I asked my graduate advisor (not faculty advisor) about it and am waiting for her response. I just don't know what to do about this. My research isn't considered essential and doesn't have to do with living organisms. Could someone please give advice or input on this?\n\nUPDATE: He apparently told my sister and not me (she's way older if that gives insight) that he's not actually going to call them. Yay for scare tactics. He has a past of being controlling like this.\n\nUPDATE 2: He got mad at me for making a smart Alec comment, which I admit was wrong. It escalated to where I told him how messed up it is he would threaten something like calling my school. It hit the point where he said, “I won’t lose sleep if you never talk to me again” after I told him he was at risk of losing me as his daughter. I might end up posting this to another reddit because I honestly don’t know what to do now.",
  "author": "LayeredPotato",
  "created": 1589805805,
  "over_18": false,
  "upvotes": 300,
  "upvote_ratio": 0.97,
  "comments": {
    "fr53v2w": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr53v2w/",
      "text": "First of all, congrats! As for the housing situation (like everyone has already said, and if you have a car) definitely look into renting someplace in Bryan. Generally much cheaper housing and utilities. Even so (and depending on your stipend), it is 100% possible to live independently in in CSTAT. That way your father wont have much of an influence on your life.",
      "author": "MrTuddles",
      "created": 1589902031,
      "upvotes": 1,
      "replies": {}
    },
    "fr4c4jq": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr4c4jq/",
      "text": "You’re an adult. \n\nHe's using his money to buy your loyalty and keep you in a child-like mentality. \n\nDo everything you can to gain your freedom and independence. It’s likely that he will escalate when he sees you becoming independent. Nevertheless, this is important for you to do. You can then direct the energy that would have gone to this senseless family drama into working on your phd and building a healthy life for yourself.",
      "author": "aqjo",
      "created": 1589883344,
      "upvotes": 1,
      "replies": {}
    },
    "fr3dzra": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr3dzra/",
      "text": "I’m a grad student (essential research, actually) at Texas A&M, they’re allowing non-essential research work like starting up/recalibrating equipment and ordering/restocking supplies as of today. Current plans are to start rolling back restrictions on research on June 1. Quoting the last email from the Vice President of Research... \n\n>***The target date for expanding research activities beyond current “essential” levels is June 1, 2020. Preparatory activities such as lab cleaning, instrument activation/calibration, supply ordering, etc., may commence on May 18, 2020. However, all conditions applying to research activities after June 1 also apply to preparatory activities.  No new research should be initiated before June 1.***  \n>  \n>Access to and protocols for use of shared resources such as libraries, computing facilities, core facilities, etc. will be determined by the management of each facility.",
      "author": "mhm646",
      "created": 1589855365,
      "upvotes": 1,
      "replies": {
        "fr3fa8d": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr3fa8d/",
          "text": "And as a side note, pretty much everywhere in College Station is cheap and safe. Pick somewhere, sign a lease, move on. With the size of grad classes being small, they'll likely have many in-person come fall. There is and will be research ongoing. Texas is pretty much opening state-wide and we will be working out here. I never stopped going into lab and have been working 10-12 hour days on campus since returning from spring break. Your assistantship is a job, if you were entering the workforce instead of grad school you'd pack up and move to start your work and adult life. This isn't different.",
          "author": "mhm646",
          "created": 1589856165,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fr3bs0q": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr3bs0q/",
      "text": "My department has not even fully stopped research. They have made a \"recommendation\" to do as much from home as possible. That does not work for me based on my year and the deadlines for support (which they won't extend). I was informed in late March that I will only have 2 long semesters left of support and outside of my advisor supporting me (no funding there), I will have no support.\n\nI need to get my data or else. If I am not close to \"All but Discussion\" by the end of summer for the entirety of my dissertation then I will have problems with my committee and department, and no excuses of the pandemic will satiate that, despite truth of delays from it. Assuming what I have been working on for the past month, if it does go well this will be no problem. I just kind of wish for some sort of safety net if things really go bad.",
      "author": "Pagi101",
      "created": 1589854019,
      "upvotes": 1,
      "replies": {}
    },
    "fr358i0": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr358i0/",
      "text": "I imagine it's very school-, state-, and discipline-specific. I'm cognition and neuroscience at Temple and we're fully preparing for the possibility that first-years will not actually report to campus for class or work. It's not definitive one way or another, but they've already been warned that they may not be asked to report until Spring semester 2021. Hell, I can't even continue MRI research until September at the earliest.   \n\n\nI may be misunderstanding something, but I don't see the issue with him calling your school and getting details, especially if he's going to be contributing financially. If I were in his shoes, I'd probably also want more answers before committing to something as long term as a lease payment.",
      "author": "DonHedger",
      "created": 1589850202,
      "upvotes": 2,
      "replies": {}
    },
    "fr32sy8": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr32sy8/",
      "text": "FWIW Vandy allowed all students to return starting today. In bio sciences.",
      "author": "throwaway__official",
      "created": 1589848799,
      "upvotes": 1,
      "replies": {}
    },
    "fr305o0": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr305o0/",
      "text": "This is a unique situation given the pandemic and I think you’ve gotten some solid advice here. I agree that if possible, it’s best to create some distance from your dad if possible especially financially. I will say that I remember my parents being highly skeptical of the grad student model where you get paid to be a GA and free tuition on top of it. My dad had a four year degree from a smaller school and wasn’t particularly great at it, and my mom earned an associates, so it was simply something they didn’t know or understand. It became more real for them once I did get my first offer, and even though our relationship had become fairly strained, the space helped us a lot. After four years, they still don’t fully “get it” but they have a much better idea of how academia works than they did. \n\nWith that said, if you are required to report, make sure you do. Like others have said, get an apartment. Make sure you think about expenses like parking assuming the university will require you to pay, and how you’ll cover transportation otherwise if you don’t drive. You can always take out student loans if you need them, even if you don’t accept all the money they offer. You may want to check to see if you’ll have to pay fees as well; I was unpleasantly surprised with a $1200 bill due in October my first semester. A lot of universities are making announcements right now to try to reassure students about what their future in the fall might look like, but the reality is that we won’t entirely know until we get closer because things are somewhat unpredictable. So, plan to move into your apartment and begin graduate studies as if it were normal basically and play the cards your dealt as they come. Best of luck!",
      "author": "AppleGeniusBar",
      "created": 1589847295,
      "upvotes": 1,
      "replies": {}
    },
    "fr2w01i": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr2w01i/",
      "text": "Texas A&M, why do you need financial help? I was wait listed and when they accepted me three days before the April 15 deadline, they offered me more than enough to live on in College Station. And if all else fails, your assistantship counts as a job, not as financial aid, so you can seek additional aid including federal student loans.",
      "author": "the-anarch",
      "created": 1589844976,
      "upvotes": 2,
      "replies": {}
    },
    "fr2uaq5": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr2uaq5/",
      "text": "Try r/raisedbynarcissists",
      "author": null,
      "created": 1589844028,
      "upvotes": 1,
      "replies": {}
    },
    "fr2loon": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr2loon/",
      "text": "Oof this is way too relatable OP. \nI ended up lured home last week by my mom because she made it seem my dad (who’s been on hospice since January) was going to pass that day. He’s still here. I’m quarantined and working. I suspect she did this after I was firm about finishing urgent work and that I still have to work if I came home to visit and help caregive. Am I glad I’m home? Yes, especially since dad was asking for me. Am I glad that I have to fight my mom about my job currently? Definitely not. \nMy suggestion is to try to relate your assistantship to working a job as much as possible to see if that helps things and see the magnitude of your situation/responsibilities. That seems to help non academics get it a little better than referring to yourself as a student. \nAnd the other is to get into therapy as soon as you enroll!",
      "author": "PenguinFeather4",
      "created": 1589839491,
      "upvotes": 1,
      "replies": {}
    },
    "fr2kd3d": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr2kd3d/",
      "text": "I am expected to be on campus for research now, since my research is considered essential, at another Texas university. \n\nLet him know that different types of research have different priorities and thst classes and research have little corrolation.",
      "author": "Lord_Blackthorn",
      "created": 1589838819,
      "upvotes": 1,
      "replies": {}
    },
    "fr2kbtr": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr2kbtr/",
      "text": "Honestly, consider how much help he would really be. It may suck to live in a shitty apartment, but you'd be free of him being so controlling.",
      "author": "era626",
      "created": 1589838802,
      "upvotes": 1,
      "replies": {}
    },
    "fr2giko": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr2giko/",
      "text": "Are you able to financially support yourself so you don’t have to rely on you parents? Otherwise, they will keep saying “my money, my rules”",
      "author": "aperez1561",
      "created": 1589836889,
      "upvotes": 2,
      "replies": {}
    },
    "fr2apxy": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr2apxy/",
      "text": "He sounds like a POS. Sorry :(   \n\n\nRent away from campus, in the city or near something fun. Or a smaller village / town nearn the uni. There will be more stuff to do and it will me more fun because it's not on campus and you can meet people who aren't uni students. That's all a good thing. And it will be cheaper.   \n\n\nEven if he doesn't believe you, you know what's right. Just do what you have to do as an adult and if he doesn't like it then I guess that's his problem. Financial support is great but don't let him control you. You will be much happier leaving behind toxic money with strings even if it means you eat more ramen.",
      "author": "TuckerD",
      "created": 1589834052,
      "upvotes": 1,
      "replies": {}
    },
    "fr27uod": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr27uod/",
      "text": "you're starting your PhD, look for a grant or search for some other way you can be economic independent, specially if your father is an asshole",
      "author": "andres57",
      "created": 1589832648,
      "upvotes": 1,
      "replies": {}
    },
    "fr1zzd0": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1zzd0/",
      "text": "You can also tell your pop that there WILL be security there. My partner is a PhD student in physics and goes to lab with an 'essential card' (shorthand for permission to get on campus). All other students are barred. \n\nWe have Denton PD and campus police patrolling buildings and such all the time now, if that makes him feel better.",
      "author": "Antikythera22",
      "created": 1589828815,
      "upvotes": 1,
      "replies": {}
    },
    "fr1xgdp": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1xgdp/",
      "text": "I was in an extremely similar situation with my mother when I started grad school. She was adamant that she paid part of my rent to put me in a place she deemed “safe”. My best advice to you is follow what you want, don’t accept his help, and begin to separate until your father can react appropriately. You’re not in high school anymore. He shouldn’t be calling your school. I got a lot of advice on living situations from people in the area which helped me find a roommate and apartment I could afford apart from my mom. Go to the a&m sub and ask about housing options. Do what you can to be independent. And DM me if you need any advice.  Good luck!",
      "author": "dawg9715",
      "created": 1589827574,
      "upvotes": 1,
      "replies": {}
    },
    "fr1xa7p": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1xa7p/",
      "text": "Hey, you should cross post this to r/raisedbynarcissists , there are plenty of people there who can talk to you about similar experiences they have had and how to deal with it. \n\nAlso as a former TA, no they will not answer anything without your permission.",
      "author": "AlexaTesla",
      "created": 1589827491,
      "upvotes": 5,
      "replies": {}
    },
    "fr1wvq7": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1wvq7/",
      "text": "As someone at texas a&m i can confirm that research labs open up starting june 1st. If fact at a&m there are discussions about classes being in person come fall.",
      "author": "blackygreen",
      "created": 1589827293,
      "upvotes": 2,
      "replies": {
        "fr1xp7t": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1xp7t/",
          "text": "Also what dept are you in? Im in Chemistry. If you post in the r/aggies subreddit you might be able to get in touch with a grad student in your dept! Or someone who can put you in contact with one.",
          "author": "blackygreen",
          "created": 1589827693,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fr1un44": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1un44/",
      "text": "Yep. There was a few weeks that only essential grad students were allowed in the lab at my university but more are back now but with social distancing precautions in place. There is only so much that can be done on a computer. And people who are outside of higher ed don’t quite get it.",
      "author": "Psyche81",
      "created": 1589826235,
      "upvotes": 1,
      "replies": {}
    },
    "fr1tl5a": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1tl5a/",
      "text": "As someone who is about to defend their PhD at A&M, apply for fellowships and various grants if you can. They’re competitive to get, but absolutely worth the time and effort. You’ll be financially secure/independent for a predetermined number of years regardless of what is happening with the university or department. I’ve been on two back-to-back fellowships and it’s made my life incredibly stress free compared to some of my friends/colleagues.",
      "author": null,
      "created": 1589825721,
      "upvotes": 5,
      "replies": {}
    },
    "fr1ob15": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1ob15/",
      "text": "Hi! Current PhD student at a branch of the same University on an RA. Graduate students on my campus were given special permission to be on campus if their research was considered essential. The university is trying it's best to keep students on track with their degree plan. My advisor and I have tried to keep me working at home as much as possible but I have had to go into the lab a few times. \n\n I would try to work it out with your advisor. Since you are just starting there may be things you can do at home that your advisor would count as part as your RA. For example doing literature reviews, working on a prospectus, etc. If your work doesn't involve dangerous chemicals you may also be able to do it at home. For example my lab (and others) have allowed students to take home microscopes to continue work from home. That will vary on a lab/PI/ type of research basis though. \n\nIn terms of campus conditions though at my branch since labs are shared we are supposed to report when we enter the building and what rooms we were in/ using so the room can be cleaned after we leave. On top of that most lab PI's have their own cleaning protocols and the university is requiring basic ppe, masks, and social distancing while you're on campus. This is expected to continue during the fall.",
      "author": "blueburrytreat",
      "created": 1589823170,
      "upvotes": 6,
      "replies": {}
    },
    "fr1ndmj": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1ndmj/",
      "text": "Sounds like he doesn't respect you",
      "author": "Mettelor",
      "created": 1589822718,
      "upvotes": 3,
      "replies": {}
    },
    "fr1k3ab": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1k3ab/",
      "text": "On the school front, you should politely contact your university and double check what’s happening. I’d also let your father know that a PhD program is employment and it would be, at best, embarrassing for your parents to call your employer. Just a tip - I began referring to my research as ‘my work’ and ‘going into the office’ in order for non-academics in my life to stop treating it like I was extending undergrad.\n\nOn the life front, if you don’t want your dad trying to control your decisions, you need to stop accepting money from him. I know far too many grad students who’s parents supplement their life but continue complaining about rules and expectations their parents have for them based on them receiving money. Often PhD stipends can be lived on if you budget and are smart about your decisions.",
      "author": "growol",
      "created": 1589821095,
      "upvotes": 19,
      "replies": {
        "fr36db1": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr36db1/",
          "text": "I had to do the same thing to for my girlfriend, friends, and family (i.e., \"office\", \"work\", etc.). They assumed I had all of the time in the world since I was going back to school. It's really hard to conceptualize how little \"school\" there is in grad school, for PhDs at least, until you're doing it. I still have trouble explaining how my days are spent.\n\nEDIT: I also want to second the stipend thing. I know they vary dramatically, the cities in which you spend them in vary, and people's definition of what's livable varies, but I went from a job earning about $50k to my current stipend of $27k and found it a very easy adjustment, given that a lot of my old paycheck was going to student loans, which are currently on hold (which I also understand is not a luxury many get if their loans aren't subsidized). That being said, I live in a great neighborhood in Philly. My rent is about 1/3 of my monthly stipend. I eat out semi-regularly and I don't generally worry about making ends meet. Frankly, I've never had much of a financial safety net (only person to attend college in the family and all that), but I'd argue, from my experience, stipends are very liveable if you have reasonable expectations, and the frugality is a small price to pay for the independence to do what you love for a living.",
          "author": "DonHedger",
          "created": 1589850853,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fr1e0nz": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1e0nz/",
      "text": "Tell your father that, although you are getting a degree, a PhD is employment and not school. He wouldn’t call your employer if you had a normal job, so he shouldn’t be calling them now. Even if he did call, they would probably refuse to help him.",
      "author": "fserv11",
      "created": 1589818068,
      "upvotes": 21,
      "replies": {}
    },
    "fr1dc30": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1dc30/",
      "text": "Are you sure? A lot of labs aren't doing in person research right now and a lot of schools aren't allowing grad students on campus (my building is completely locked up & if we need something, we have to go to the department chair). Several of us are considering moving home for a few months once our leases expire, depending what the situation is in the fall (at the school/our department/our city).\n\nTalk to the grad advisor and to any current grad students first to see if it does make sense to rent an apartment.",
      "author": "mediocre-spice",
      "created": 1589817721,
      "upvotes": -1,
      "replies": {}
    },
    "fr1at4q": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1at4q/",
      "text": "I don't have a lot of advice but hey I'll be a first year PhD student at A&M as well! What my department has told me is that right now everything is planned to be as usual, not online. They're also trying to figure out a way to do it semi-presencial. But if your program is designed anything similar to mine, you're gonna want to be in BCS for lab rotations.",
      "author": "rhapsody7099",
      "created": 1589816445,
      "upvotes": 6,
      "replies": {}
    },
    "fr1aglj": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1aglj/",
      "text": "Current grad student at A&M. We are all performing research (while abiding by social distancing guidelines) and the university is working really hard to make sure grad work is disrupted as little as possible!  The university’s position is that all research is considered “essential” and though at-home work is encouraged as much as possible, in-person work is allowed and people are still running experiments and going to work in person.",
      "author": "starmagnolia",
      "created": 1589816264,
      "upvotes": 24,
      "replies": {
        "fr1bhxe": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1bhxe/",
          "text": "Wow really? Here at UT we're still weeks away from opening.",
          "author": "birne412",
          "created": 1589816798,
          "upvotes": 12,
          "replies": {
            "fr1cmq8": {
              "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1cmq8/",
              "text": "Yes, though it differs between departments for sure. I’m in the school of agriculture and a lot of the work is time-sensitive in terms of sampling tissue at the right developmental stages, etc. But a good amount of precautions are taken, at least in my lab...we have designated 2 people to take care of everybody’s greenhouse plants so that minimal people are at the greenhouse. We also have to sign up for time slots to run ongoing experiments at the lab(not allowed to start new experiments at this time) but we can only have 1 person in a room at a time. So today I’m going to go to lab to finish an experiment for a couple hours, then will be disinfecting all of my surfaces, and leaving for the rest of the day so that someone else can use the room after me. Masks, gloves, lab coats are mandatory.",
              "author": "starmagnolia",
              "created": 1589817371,
              "upvotes": 2,
              "replies": {}
            },
            "fr1urr7": {
              "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1urr7/",
              "text": "It’s the same at the less prestigious UNT as well, at least in the sciences.",
              "author": "Psyche81",
              "created": 1589826299,
              "upvotes": 2,
              "replies": {
                "fr2062p": {
                  "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr2062p/",
                  "text": "And less expensive*",
                  "author": "Antikythera22",
                  "created": 1589828907,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "fr361ut": {
              "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr361ut/",
              "text": "Temple is potentially months away from reopening, since half of Philly can't be bothered to even wear a damn mask, let alone stay home.",
              "author": "DonHedger",
              "created": 1589850673,
              "upvotes": 2,
              "replies": {}
            },
            "fr3605s": {
              "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr3605s/",
              "text": "Technically A&M is starting to reopen June 1 as well, but essential personnel (including some grad students) have been allowed to work throughout the whole process as long as new guidelines are followed.",
              "author": "frito88",
              "created": 1589850645,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fr36nqe": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr36nqe/",
          "text": "Correct, my wife got her “essential worker” letter so that she keep doing research. Luckily she can remote in to the databases.",
          "author": "Ceshomru",
          "created": 1589851019,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fr1af4f": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1af4f/",
      "text": "[deleted]",
      "author": null,
      "created": 1589816242,
      "upvotes": -2,
      "replies": {
        "fr1dc7i": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1dc7i/",
          "text": "TL:DR \"grow up\" would have been just as helpful and saved you a lot of time....",
          "author": "Shoot-to-hit",
          "created": 1589817722,
          "upvotes": 6,
          "replies": {}
        },
        "fr1kj80": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1kj80/",
          "text": "I have grown up without his help. It was my idea to get a PhD instead of what he originally wanted, which was for me to go to med school. I have to listen to him now because I don’t want him to disown me. \n\nIn undergrad, I was able to avoid him supporting me a great amount financially because he got me a prepaid college plan in my name and also scholarships. I grew up on my own there and even before that. \n\nI need to work with him on this because I don’t want to cut him out of my life, especially since he has cancer and anything traumatic could potentially kill him. \n\nI’m not hurt by what you said, but please have more empathy for others tho.",
          "author": "LayeredPotato",
          "created": 1589821314,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fr1aayf": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1aayf/",
      "text": "Your dad can call the university, but they cannot legally release personal infomation about you. They can tell him general guidelines for graduate students, but you are an adult and he cannot get your info.\n\nNow, as far as boundaries go, you need to find a suitable living arrangement that you can afford on your own. Your father paying for your apartment is what is known as golden handcuffs. His gift comes with a price of your freedom. This is not ok from a respect and healthy boundary point of view. \n\nHim calling the university is only the beginning. What are you willing to tolerate and for how long? When will it turn into emotional manipulation or abuse? These are things you must consider.",
      "author": "useless83",
      "created": 1589816182,
      "upvotes": 4,
      "replies": {}
    },
    "fr19u23": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr19u23/",
      "text": "Former Ag here, 1) congrats...it’s incredibly difficult to get into any of A&M’s PhD programs). 2) As bad as this sounds, I read your comment about him being “controlling like this” and honestly you might want to consider finding a nice way to spend less time around that. This program will take everything you have and more to do successfully and it doesn’t sound like his attitude and behavior is conducive to supporting that. Again, who knows he could be wonderful, but just going off of your post. There are some inexpensive apartments in Bryan, and might be worth looking into.  Best of luck and Gig Em!\n\n\n\n\nEdit: My opinion has changed with the new info. \n\nListen, normally I advocate for people to work things through and talk stuff out but your dad sounds like he’s irrational and disrespectful. \n\nYou got yourself into an R1 school PhD program. You did that, not him. Take a minute and realize how difficult that task was, and how you succeeded.  Next, tell your dad he can stick his lack of support and rude/unfathomable comments where the sun doesn’t shine.  Then, go post on Craigslist or Facebook or whatever “looking for a grad student roommate”. Start looking up inexpensive apartments in BCS. Then you pull yourself up and move on. \n\nYOU got yourself into this program, YOU will get yourself through it. Do NOT let anyone take this opportunity from you.  Either he’ll see what a farking ass he’s been, or he won’t and you’ll go on living your life with your goddamn PhD in your hands and you’ll be called Dr. the rest of your life. \n\nYou are stronger than this, and you can do this without him. \n\nIf you want help or advice for the area, feel free to message me. \n\n“Aggies do not lie, cheat, or steal, or tolerate those who do.”  You’re an Ag now, and your father is trying to steal this opportunity from you.  \n\nIt is probably really heartbreaking what you’re going through, but the end result is worth the hardship.",
      "author": null,
      "created": 1589815940,
      "upvotes": 13,
      "replies": {}
    },
    "fr19cqx": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr19cqx/",
      "text": "As someone who has a controlling and quite possibly a narcissistic father, imma tell you right now he’s acting this way to control you and he does not take your responsibilities seriously. Do what you want and step your foot down. I know this trope all too well.",
      "author": null,
      "created": 1589815689,
      "upvotes": 72,
      "replies": {
        "fr2f9tz": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr2f9tz/",
          "text": "This is exactly what it is",
          "author": "yupitsme987",
          "created": 1589836268,
          "upvotes": 9,
          "replies": {}
        },
        "fr35xch": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr35xch/",
          "text": "But also, he's potentially committing to at least a one-year lease payment for his daughter, and there's at least the possibility that she might be wrong, especially given she hasn't heard back from her advisor yet. That's not a small chunk of change. I'd want definitive confirmation, too.  \n\n\nTo be clear, controlling and narcissistic parents do exist and if this is the case of one of those, by all means, assert yourself. However, given the information, it could also just be a dad who wants to make sure his money is well-spent.   \n\n\nI don't begrudge anyone taking money from their parents. You do you, but I'm gonna argue it's not totally unreasonable that that assistance comes at the price of a little bit of autonomy. They should get to reasonably decide the conditions by which they assist you.",
          "author": "DonHedger",
          "created": 1589850600,
          "upvotes": -1,
          "replies": {}
        }
      }
    },
    "fr171d3": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr171d3/",
      "text": "lol he doesn't believe you? I'm a grad bio student, even though my campus' classes switched to online, I still come in to work in the lab, though I was told that I didn't have to if I have safety concerns. Most of the time I see maaaybe 1 or 2 people on campus while I'm there. Your dad shouldn't be told anything because of ferpa once you are 18. Good luck with your research!",
      "author": "lameduckfolio",
      "created": 1589814465,
      "upvotes": 38,
      "replies": {}
    },
    "fr0ylze": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr0ylze/",
      "text": "From a fourth year PhD already heavily involved in research, my program is doing everything possible to get us back in the lab. I don’t see why it would be any different with your department. Your dad will call them to find that they are indeed allowing students on campus. I’m not sure why he won’t take your word for it. They might not make a more concrete decision until summer though (which is what my department is doing).",
      "author": "productivehippie",
      "created": 1589809699,
      "upvotes": 74,
      "replies": {}
    },
    "fr0vto8": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr0vto8/",
      "text": "If you only have to be on campus a portion of the week for research, you likely can rent an apartment farther away from campus and save a lot of money.",
      "author": "King_Freedom",
      "created": 1589807921,
      "upvotes": 148,
      "replies": {
        "fr1kmoz": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1kmoz/",
          "text": "This is true. Go into Bryan. 5mi will save you hundreds a month.\n\nAlso, which dept?",
          "author": "japooki",
          "created": 1589821363,
          "upvotes": 38,
          "replies": {
            "fr3fbl4": {
              "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr3fbl4/",
              "text": "Yeah I can definitely agree not to lease too close to campus but housing was already pretty cheap when I lived in BCS two years ago and I'm sure landlords will be desperate to lease at this point.",
              "author": "AvisNoct",
              "created": 1589856187,
              "upvotes": 5,
              "replies": {
                "fr3rh9m": {
                  "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr3rh9m/",
                  "text": "The latter is true, hadn't thought of that. I paid 650 at Callaway villas on a 1 semester lease",
                  "author": "japooki",
                  "created": 1589864273,
                  "upvotes": 1,
                  "replies": {
                    "fr3s52i": {
                      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr3s52i/",
                      "text": "Yeah I did a year long lease within walking distance of campus and it was 550 a month. I'm in upstate New York and my rent is 1275 a month. Cost of living in BCS is much better",
                      "author": "AvisNoct",
                      "created": 1589864779,
                      "upvotes": 1,
                      "replies": {
                        "fr3sg2q": {
                          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr3sg2q/",
                          "text": "Im in the bay area. 1300 for a room in a craigslist house, I feel you dog.",
                          "author": "japooki",
                          "created": 1589865013,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fr3lu5u": {
              "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr3lu5u/",
              "text": "Good suggestions. Their commute with be non existent without the usual traffic on College, University, and Wellbourne.",
              "author": "webbed_feets",
              "created": 1589860269,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fr0uyjj": {
      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr0uyjj/",
      "text": "Rent an apartment that you can afford and let your controlling, abusive father get over himself.",
      "author": "inkylinguist",
      "created": 1589807356,
      "upvotes": 108,
      "replies": {
        "fr11crr": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr11crr/",
          "text": "Yeah, normally its best to avoid debt if you have an assistantship but a loan with clearly defined terms is MUCH better than accepting money from a parent and having to meet their demands on a whim. Also if your dad calls the Office of Research on your behalf expect your reputation to go into the toilet. Find some of the worst interview r/AskReddit threads if you want to see how a parent interfering in their adult child’s job reflects really badly.",
          "author": "BadassQuetzalcoatlus",
          "created": 1589811323,
          "upvotes": 41,
          "replies": {}
        },
        "fr10awk": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr10awk/",
          "text": "Yup, second this. Let go of the financial strings and do your own thing, on your own terms. This is your PhD program and yours only.",
          "author": "Neondiode45",
          "created": 1589810709,
          "upvotes": 19,
          "replies": {}
        },
        "fr12o1g": {
          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr12o1g/",
          "text": "Woah, relax. Abusive?! I’m not sure we’re qualified to call their dad that when he could be doing nothing more than being a regular annoying dad... Yes, parents can be difficult. Very difficult. But abuse is something entirely different. Let’s draw some lines.",
          "author": "seeker_313",
          "created": 1589812070,
          "upvotes": 67,
          "replies": {
            "fr1fm7q": {
              "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1fm7q/",
              "text": "[deleted]",
              "author": null,
              "created": 1589818879,
              "upvotes": 21,
              "replies": {
                "fr3782r": {
                  "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr3782r/",
                  "text": "Well, is OP manipulative for initializing the threat when she said he would lose her as his daughter? I'm not really on either of their sides here.",
                  "author": "DonHedger",
                  "created": 1589851346,
                  "upvotes": -3,
                  "replies": {
                    "fr392ox": {
                      "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr392ox/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1589852426,
                      "upvotes": 3,
                      "replies": {
                        "fr39rzc": {
                          "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr39rzc/",
                          "text": "Totally agree.",
                          "author": "DonHedger",
                          "created": 1589852835,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fr16wfr": {
              "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr16wfr/",
              "text": "Yeah. I feel like that escalated quickly. This seems more like a mild case of boundary issues that is best dealt with by financially disconnecting. This became r/relationships real fast:\n\nQuit Facebook. Hit the gym. Lawyer up. Disown your parents. \n\nBut seriously, I would do whatever I could to keep a parent from contacting a graduate program on my behalf. \n\nMy wife teaches undergrad and had a student whose mom injected herself in a grade appeal process. Definitely hurt that kids reputation. And did nothing for the grade.",
              "author": "AlbanySteamedHams",
              "created": 1589814391,
              "upvotes": 34,
              "replies": {}
            },
            "fr1xiku": {
              "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1xiku/",
              "text": "See updates. He’s actually abusive",
              "author": "xueye",
              "created": 1589827604,
              "upvotes": 13,
              "replies": {}
            },
            "fr1leyu": {
              "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1leyu/",
              "text": "I agree. In my experience, lots of parents have trouble realizing their kids have grown-up. I suspect this is even harder when their kids continue to live off them in some way. We likely wouldn’t call a dad of a 16-year old abusive for saying that he won’t let his son or daughter work during coronavirus. We’d call that a scared dad who may or may not be overreacting. For the parent, there’s probably very little difference when their 22-year old who they’re still paying for wants to go to work. Is the dad right? I don’t think so. But abusive is also entirely the wrong description (based off of what we’ve been told so far).",
              "author": "growol",
              "created": 1589821760,
              "upvotes": 7,
              "replies": {
                "fr1wplp": {
                  "link": "/r/GradSchool/comments/gm0r0k/my_dad_doesnt_believe_me_when_i_say_im_expected/fr1wplp/",
                  "text": "With the second edit the father sounds verbally abusive to me. “I won’t lose sleep if I never hear from you again” is not an appropriate response. That’s emotional manipulation",
                  "author": "dawg9715",
                  "created": 1589827210,
                  "upvotes": 15,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634064954
}