{
  "sid": "r89a9v",
  "link": "/r/GradSchool/comments/r89a9v/feeling_upset_about_publishing/",
  "title:": "Feeling upset about publishing",
  "text": "I kind of hate it - the manuscript I mean - especially now it's at the editing stage before sending off. I've never published anything before, don't completely trust half of what I've written or half of the techniques I've used. It 'looks' great, but I feel like there's so much wrong under the surface that I just can't see, yet peer reviewers will. Especially in a high ranked journal, I'm worried my work will be ripped to shreds. Doesn't really help that my supervisors - while excellent researchers - are about as empathetic as a loan shark. No real help there.",
  "author": "ExpensiveTwist4432",
  "created": 1638565942,
  "updated": 1639518999,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.94,
  "comments": {
    "hn4832f": {
      "link": "/r/GradSchool/comments/r89a9v/feeling_upset_about_publishing/hn4832f/",
      "text": "If it gets ripped to shreds that's great! The peer reviewers will help you clarify all the things that are unclear under the surface. Besides, we all feel that way about manuscripts when we submit them.",
      "author": "Forward-Philosophy46",
      "created": 1638566295,
      "upvotes": 18,
      "replies": {
        "hn4ljvo": {
          "link": "/r/GradSchool/comments/r89a9v/feeling_upset_about_publishing/hn4ljvo/",
          "text": "I'm really glad to hear this isn't uncommon. At the end stages of my first manuscript and feel worried I missed one thing, misplaced a decimal place in setting the scale on an image or misinterpret key data, etc and someone will point it out and everything comes crashing down.",
          "author": "Sir_Chilliam",
          "created": 1638572704,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hn5ety0": {
      "link": "/r/GradSchool/comments/r89a9v/feeling_upset_about_publishing/hn5ety0/",
      "text": "This is how I’ve felt about every paper I’ve submitted. For what it’s worth: I think almost everyone uses techniques that are flawed, makes human errors, and questions their own research. Publishing something is about reporting honestly: “this is what I did, this is what I saw.” It doesn’t have to be 100% indisputable.",
      "author": "gradthrow59",
      "created": 1638586748,
      "upvotes": 6,
      "replies": {}
    },
    "hn65tdp": {
      "link": "/r/GradSchool/comments/r89a9v/feeling_upset_about_publishing/hn65tdp/",
      "text": "TBH I think the number one lesson I have learned about publishing thus far in my PhD program is \"It's totally, 100% fine to submit something that isn't perfect-- it will never be perfect-- and just getting your work out there is valuable.\"",
      "author": "intangiblemango",
      "created": 1638602194,
      "upvotes": 2,
      "replies": {}
    },
    "hn5nvg5": {
      "link": "/r/GradSchool/comments/r89a9v/feeling_upset_about_publishing/hn5nvg5/",
      "text": "You can submit it to the [Journal of Universal Rejection](https://www.universalrejection.org/), have a laugh, and then submit it to the other journal. Not that will help your situation, but maybe will make you smile for a moment.",
      "author": "camilaaab",
      "created": 1638591290,
      "upvotes": 2,
      "replies": {}
    }
  }
}