{
  "sid": "pzohli",
  "link": "/r/GradSchool/comments/pzohli/do_you_think_receiving_an_offer_into_a_phd/",
  "title:": "Do you think receiving an offer into a PhD program is in itself prestigious?",
  "text": "After I accepted my offer to my current PhD program, my professor told the public during one of my undergrad presentations that I earned a prestigious PhD position at my university.\n\nI do not think of my acceptance into a PhD program as prestigious, but I was wondering, do you believe that they are prestigious in itself?",
  "author": "EpicGusher",
  "created": 1633149588,
  "updated": 1634099987,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.7,
  "comments": {
    "hf2apxw": {
      "link": "/r/GradSchool/comments/pzohli/do_you_think_receiving_an_offer_into_a_phd/hf2apxw/",
      "text": "Getting offered a spot in a phd program, even unfunded, takes a lot of qualifications. You should feel proud of yourself.",
      "author": "Unofficial_Overlord",
      "created": 1633151330,
      "upvotes": 28,
      "replies": {}
    },
    "hf29ti1": {
      "link": "/r/GradSchool/comments/pzohli/do_you_think_receiving_an_offer_into_a_phd/hf29ti1/",
      "text": "Of course!",
      "author": "firesnail214",
      "created": 1633150686,
      "upvotes": 10,
      "replies": {}
    },
    "hf2a4oc": {
      "link": "/r/GradSchool/comments/pzohli/do_you_think_receiving_an_offer_into_a_phd/hf2a4oc/",
      "text": "It's not really *provable*. Like, you couldn't list an acceptance on your CV. Prestige isn't about how you *truly are* it's about how people think of you. The fact that you were offered a spot means that the faculty at the other program thought that you were a good candidate, which is evidence in favor of your abilities. It would give you prestige if it were generally known to people that this happened. But it won't be and there's really no way to try to change that that wouldn't seem incredibly odd and wind up being counterproductive.",
      "author": "InfanticideAquifer",
      "created": 1633150908,
      "upvotes": 8,
      "replies": {
        "hf2g9rn": {
          "link": "/r/GradSchool/comments/pzohli/do_you_think_receiving_an_offer_into_a_phd/hf2g9rn/",
          "text": ">you couldn't list an acceptance on your CV.\n\nI once saw an academic CV that had acceptances (with funding) listed and then \"declined\" written after them. E.g. it said something like: University of [Name], $[funding amount] -- Declined. The person had it listed under their awards. I already have too many awards on my CV but I can see why someone who doesn't can use it to boost their CV",
          "author": "phdreaming234",
          "created": 1633155313,
          "upvotes": 2,
          "replies": {
            "hf2msv3": {
              "link": "/r/GradSchool/comments/pzohli/do_you_think_receiving_an_offer_into_a_phd/hf2msv3/",
              "text": "I have reviewed at this point over a thousand academic CVs, and never seen declined offers for graduate programs listed. \n\nI have occasionally seen research grants which were selected for funding but then declined due to overlap with a larger grant - those are meaningful.\n\nAcceptance to a PhD program is not considered prestigious by anyone who has a PhD.  It is an acknowledgement of \\*potential\\* and not really of \\*accomplishment\\*.\n\nYour prof is understandably proud of you, and you should be proud of yourself.  But keep in mind that by praising you they are also indirectly praising themself and their program.  All programs do this.  High schools brag about their students' college acceptances.  Undergraduate programs brag about their students' grad school acceptances.",
              "author": "dazedandbemused1",
              "created": 1633160308,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "hf2dr92": {
      "link": "/r/GradSchool/comments/pzohli/do_you_think_receiving_an_offer_into_a_phd/hf2dr92/",
      "text": "The acceptance itself is not, but the position of being a PhD student does hold quite a bit of academic prestige, because you had to earn and actively maintain that position through high-level work.",
      "author": "Weaselpanties",
      "created": 1633153457,
      "upvotes": 3,
      "replies": {}
    },
    "hf2u5um": {
      "link": "/r/GradSchool/comments/pzohli/do_you_think_receiving_an_offer_into_a_phd/hf2u5um/",
      "text": "I hate the word prestige, but then again I hate the elitism that is embedded into academic institutions, anyway I DO think being accepted into a PhD program is a great accomplishment. PhD’s are difficult to be get into and just as (or even more so if you take the emotional and economic toll) difficult to complete. You should be very proud of yourself!",
      "author": "Alean92",
      "created": 1633166332,
      "upvotes": 2,
      "replies": {}
    }
  }
}