{
  "sid": "pu9egu",
  "link": "/r/GradSchool/comments/pu9egu/help_w_grfp_eligibility_question/",
  "title:": "Help w/ GRFP Eligibility Question",
  "text": "I am currently in the first semester of my MA, and will be pursuing a PhD directly after. I previously applied once for the GRFP in undergrad and did well—but not well enough to actually get it.\n\nTherefore, I planned on applying again in the start of my second year of the MA next year. However, looking at the instructions it says your ineligible if you’ve completed over a year of grad school. \n\nDoes this mean, if I’ve completed a Fall + Spring Semester (18 credits total), and then started a Fall Semester of classes in August that I wouldn’t be eligible? And therefore would need to apply this year?\n\nThanks in advance\n\nEdit: I’m doubly confused because one member of my MA committee said I am eligible next year, one said I’m not…",
  "author": "PHXNights",
  "created": 1632446795,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "he1k4ip": {
      "link": "/r/GradSchool/comments/pu9egu/help_w_grfp_eligibility_question/he1k4ip/",
      "text": "They did not change the guidelines from last year (at least I remember the same wording) when I applied during the beginning of my second year as a PhD student (I did a fall and spring semester and applied at the beginning of the following fall semester). The wording is super confusing, but you should be eligible to apply. You will have to talk about your plans for a PhD rather than masters.",
      "author": "Comprehensive-Pea952",
      "created": 1632450219,
      "upvotes": 5,
      "replies": {
        "he1kn0f": {
          "link": "/r/GradSchool/comments/pu9egu/help_w_grfp_eligibility_question/he1kn0f/",
          "text": "I am VERY glad to hear that. Thank you.",
          "author": "PHXNights",
          "created": 1632450470,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "he1eoxo": {
      "link": "/r/GradSchool/comments/pu9egu/help_w_grfp_eligibility_question/he1eoxo/",
      "text": "From NSF website “Have never earned a master’s or professional degree in any field, or completed more than one academic year in a graduate degree-granting program, unless (i) returning to graduate study after an interruption of two or more consecutive years immediately preceding the application deadline, and; (ii) not enrolled in a graduate degree program at the application deadline”\n\nSeems like Fall + Spring = 2 semesters = 1 academic year. I don’t believe you are eligible.",
      "author": "SnooTomatoes3816",
      "created": 1632447615,
      "upvotes": 0,
      "replies": {
        "he1f2nd": {
          "link": "/r/GradSchool/comments/pu9egu/help_w_grfp_eligibility_question/he1f2nd/",
          "text": "It’s the “more than” that’s confusing. Does being in classes for the second year count as “completing” more than 1? Or am I exactly at 1 year completed at that point?",
          "author": "PHXNights",
          "created": 1632447797,
          "upvotes": 2,
          "replies": {}
        },
        "he1exlx": {
          "link": "/r/GradSchool/comments/pu9egu/help_w_grfp_eligibility_question/he1exlx/",
          "text": "See that’s how I read it too, but then there’s an application track for 2nd year graduate students. And I’ve seen posts from people in my searches that imply they applied in 2nd year of MA/MS. And then posts that are sad about not being eligible. Idk 🤷🏼‍♂️",
          "author": "PHXNights",
          "created": 1632447730,
          "upvotes": 1,
          "replies": {
            "he1f4pz": {
              "link": "/r/GradSchool/comments/pu9egu/help_w_grfp_eligibility_question/he1f4pz/",
              "text": "It seems you are only eligible to apply either as a senior in undergrad or in the first year of a doctoral program. There used to be a 2nd year application track, but it was removed this year.\n\nThe MS eligibility is contingent on joint BS/MS degree programs",
              "author": "SnooTomatoes3816",
              "created": 1632447824,
              "upvotes": 2,
              "replies": {
                "he1ftpi": {
                  "link": "/r/GradSchool/comments/pu9egu/help_w_grfp_eligibility_question/he1ftpi/",
                  "text": "Hmm. But I also see this on their eligibility page: “Graduate students are limited to only one application to the GRFP, submitted either in the first year or in the *second year of graduate school*.” I guess I just need to call the NSF tomorrow and ask.",
                  "author": "PHXNights",
                  "created": 1632448155,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "he2ta1c": {
          "link": "/r/GradSchool/comments/pu9egu/help_w_grfp_eligibility_question/he2ta1c/",
          "text": "Second year students should be eligible as they have not yet *completed* more than one year of graduate study. They also explicitly state elsewhere that first year or beginning of second year students can apply",
          "author": "spoopyskelly",
          "created": 1632482194,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634067454
}