{
  "sid": "qbnayk",
  "link": "/r/GradSchool/comments/qbnayk/should_i_do_my_master_at_the_same_university_that/",
  "title:": "Should I do my master at the same university that I did my bachelor?",
  "text": "I get my bachelor's at a recognized public university. Applied for a job at the same university and got it. Now, I am looking at getting a master's in my field and the program at the university is one of the best ones, however, many of the classes from the master's overlap with the bachelor's and are usually taught as one class by the same professor. On the other hand, the master's will be paid by the university and I don’t have to be in debt. I am planning to, later on, get a PhD but one step at a time.",
  "author": "CalmInvite5",
  "created": 1634684518,
  "updated": 1636201665,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhao2ve": {
      "link": "/r/GradSchool/comments/qbnayk/should_i_do_my_master_at_the_same_university_that/hhao2ve/",
      "text": "Being debt free is nice! You also may have already taken those same professors in undergrad so you already know they’re teaching style and expectations (although grad school will be more difficult) and they may remember you!!",
      "author": "aml1130",
      "created": 1634685714,
      "upvotes": 1,
      "replies": {}
    },
    "hhb8ct5": {
      "link": "/r/GradSchool/comments/qbnayk/should_i_do_my_master_at_the_same_university_that/hhb8ct5/",
      "text": "Follow the money. I do have the sense people are suspicious of multiple degrees from the same institution, but your work can and will speak for itself.",
      "author": "trunkNotNose",
      "created": 1634695180,
      "upvotes": 1,
      "replies": {}
    },
    "hhegxdb": {
      "link": "/r/GradSchool/comments/qbnayk/should_i_do_my_master_at_the_same_university_that/hhegxdb/",
      "text": "I think this allows you to take additional coursework elsewhere if you've already taken them at a lower level. No one will look down on you for having two degrees from the same university, and I honestly feel like its more common than not.  It sounds like a great deal, assuming you want to be in that field and the work interests you!",
      "author": "idk_witty_username",
      "created": 1634759078,
      "upvotes": 2,
      "replies": {}
    },
    "hheyyhr": {
      "link": "/r/GradSchool/comments/qbnayk/should_i_do_my_master_at_the_same_university_that/hheyyhr/",
      "text": "simple answer? it is frowned upon to do this and are encouraged to go somewhere else to do grad work and learn how to do things differently than undergrad institution. That being said I've seen this a lot recently. Back in my day (said with the old geezer voice....lol) this wouldn't have been encouraged.",
      "author": "rthomas10",
      "created": 1634766320,
      "upvotes": 2,
      "replies": {}
    }
  }
}