{
  "sid": "rhmjy3",
  "link": "/r/GradSchool/comments/rhmjy3/help_im_an_undergraduate_looking_to_go_into/",
  "title:": "Help! I'm an undergraduate looking to go into graduate school for clinical psych or counseling psych, but I don't know where to start",
  "text": "Hello! I plan on graduating in Spring of 2022 from the University of Texas At Arlington with a B.S in Psychology (Minors in Neuroscience and Clinical Psychology). I plan on becoming a cognitive behavioral therapist or a rehabilitation counselor (In general, I want to go into the therapy/counseling field of psychology),  but my current university doesn't offer these programs, and I feel just as lost as I felt 4 years ago when I was applying for undergraduate studies.\n\nI would like to stay in Texas, especially North Texas, if possible, so I've looked into schools such as the University of North Texas, Dallas Baptist University, University of Texas At Austin. I've been trying to look at Masters programs, but a lot of the titles for these plans are similar yet different, and the descriptions for each of them promise different offerings.\n\nWhat I'm asking is what should I pursue to get the end goal of becoming a cognitive behavior therapist or a rehabilitation counselor?\n\nI've tried going to r/unt for the university of north texas, but a commentor pointed me over here to get more general guidance from a bigger community. Thanks so much for your guys' help and I hope all of you are doing well as you head off to grad school or continue in your endeavors with other things!",
  "author": "x3Fast5u",
  "created": 1639644066,
  "updated": 1639788524,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hosbyp6": {
      "link": "/r/GradSchool/comments/rhmjy3/help_im_an_undergraduate_looking_to_go_into/hosbyp6/",
      "text": ">What I'm asking is what should I pursue to get the end goal of becoming a cognitive behavior therapist or a rehabilitation counselor?\n\nI am not in psychology, so I don't know the answer to your question.\n\nBut your academic advisor in your major would. And sitting down to talk with them would likely give you more information than you'll get here. As they might also be able to help you to better choose your coursework to reach those goals.",
      "author": "raistlin65",
      "created": 1639666776,
      "upvotes": 2,
      "replies": {
        "hot94w4": {
          "link": "/r/GradSchool/comments/rhmjy3/help_im_an_undergraduate_looking_to_go_into/hot94w4/",
          "text": "That's the rough part. My academic advisor just left and we have a new internim advisor, but I will talk with my professors about this.",
          "author": "x3Fast5u",
          "created": 1639679818,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoshmpd": {
      "link": "/r/GradSchool/comments/rhmjy3/help_im_an_undergraduate_looking_to_go_into/hoshmpd/",
      "text": "Talk to your psych professors. Let them know that you are considering graduate school but don't know where to start. They can help you (and they are connected to faculty at other universities). Do you have any professors you've conducted research with or consider a mentor or just loved their class/topic they research?",
      "author": "Rose_gold_starz",
      "created": 1639669120,
      "upvotes": 2,
      "replies": {
        "hot9jxq": {
          "link": "/r/GradSchool/comments/rhmjy3/help_im_an_undergraduate_looking_to_go_into/hot9jxq/",
          "text": "My research design professors and my behavior and motivation professors stick out a lot as people I've enjoyed coursework for. The huge problem with my relationship with professors has been COVID. I started taking psych course work back in Spring of 2020 and I haven't been able to build proper relations with a majority of my professors. I will ask around though!",
          "author": "x3Fast5u",
          "created": 1639679982,
          "upvotes": 1,
          "replies": {
            "houtc6e": {
              "link": "/r/GradSchool/comments/rhmjy3/help_im_an_undergraduate_looking_to_go_into/houtc6e/",
              "text": "Covid definitely threw off the relationship building process with faculty but it's not too late. Best of luck!",
              "author": "Rose_gold_starz",
              "created": 1639702963,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hosdecs": {
      "link": "/r/GradSchool/comments/rhmjy3/help_im_an_undergraduate_looking_to_go_into/hosdecs/",
      "text": "I just finished my MA in Rehabilitation and Mental Health Counseling. I would look into mental health counseling programs and then see if they have a rehab certificate program or if you can fill electives with the classes you’d need to take the CRC. I opted to not even take the CRC as voc rehab isn’t for me.",
      "author": "Danibelle903",
      "created": 1639667382,
      "upvotes": 1,
      "replies": {}
    }
  }
}