{
  "sid": "rasmvb",
  "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/",
  "title:": "Transitioning from an undergraduate student to a graduate student",
  "text": "What had been the biggest change that you noticed as transitioning from an undergraduate student to a graduate student? Life, academics, work, etc.?",
  "author": "hilltailor",
  "created": 1638858392,
  "updated": 1639518885,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hnldo1f": {
      "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnldo1f/",
      "text": "Having to motivate yourself through longer goals and work. Typically, as an undergraduate, you get used to having shorter deadlines and immediate gratification from grades and such. Graduate school is much different, there isn’t anyone who tells you what to do and in a sense, you’re more on your own. It’s best to learn pretty early on how to make deadlines for yourself so that you get the work done. The exciting part is the ability to have more intellectual freedom than undergraduate work lends!",
      "author": "SuspiciousWhiskers",
      "created": 1638885582,
      "upvotes": 13,
      "replies": {}
    },
    "hnlhns2": {
      "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnlhns2/",
      "text": "Typically what you see everyone complaining of on here. Your work is your work, you are responsible for getting it done....or not. You are also responsible for searching, learning skills you need to get the work done. Your adviser isn't going to teach you from the ground up you have to go out and realize what you need to learn and learn it on your own. If you are efficient you spend less time at school, if you are inefficient ....well, better get used to eating at your desk and sleeping under it. It's a commitment and no matter how depressed, mentally out of it, tired, hungry, sleepy, broke, pregnant, lonely....etc you are no one gives a shit. It's your responsibility........................or not and go away.\n\n&#x200B;\n\nWhen we taught undergrads we were often times too hard on them, because departments are hard on grad students. Departments favor the undergrads and babysit them because they pay the bills and if you are hard on them they go away.",
      "author": "rthomas10",
      "created": 1638887494,
      "upvotes": 4,
      "replies": {
        "hnnonjo": {
          "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnnonjo/",
          "text": "The pregnant part made me chuckle.",
          "author": "soundstragic",
          "created": 1638922036,
          "upvotes": 1,
          "replies": {
            "hnnrjwg": {
              "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnnrjwg/",
              "text": "Just seen a lot of those reasons given for grad school failure lately...",
              "author": "rthomas10",
              "created": 1638923428,
              "upvotes": 1,
              "replies": {
                "hnqfhkq": {
                  "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnqfhkq/",
                  "text": "Yes how dare people give excuses for falling behind such as *checks notes*\n\nBeing pregnant or clinical depression. \n\nStudents must LOVE having you as a professor.",
                  "author": "BananaPerfect8866",
                  "created": 1638981048,
                  "upvotes": 2,
                  "replies": {
                    "hnqgzxc": {
                      "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnqgzxc/",
                      "text": "Have to weed out somehow. Not everyone should go to grad school, it actually takes work and commitment. Just like not everyone should go to college.\n\nThere is birth control and one would assume a PhD candidate has learned how to prioritize.",
                      "author": "rthomas10",
                      "created": 1638981638,
                      "upvotes": -1,
                      "replies": {
                        "hnqhhk4": {
                          "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnqhhk4/",
                          "text": "Yeah cuz birth control works 100% of the time\n\nHow on earth do you have a Ph.D in Chemistry? A High School dropout could tell you that. \n\nSo basically if I join your program If I even remotely think about doing anything other than schoolwork, I might as well just drop out. \n\nI would love to read some end of the year assessments from your students. The ones that are left anyway.",
                          "author": "BananaPerfect8866",
                          "created": 1638981827,
                          "upvotes": 1,
                          "replies": {
                            "hnqhzm1": {
                              "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnqhzm1/",
                              "text": "There are alternatives and solutions. That's the problem, coddling students on every level. That's how you end up with college grads who can't write, or do basic math. If you can't plan with your very own body then perhaps you shouldn't be trusted with a child.",
                              "author": "rthomas10",
                              "created": 1638982020,
                              "upvotes": 0,
                              "replies": {
                                "hnsdxqt": {
                                  "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnsdxqt/",
                                  "text": "Man I thought getting my Ph.D was gonna be rough but if you have one they’ll clearly give anybody one so I’ve got nothing to worry. \n\nSo just so I understand this clearly, you believe helping out students who suffer from mental illness, a chemical imbalance in their brain, something for which you have a LITERAL PHD IN CHEMISTRY, is coddling and babying them. \n\nAnd again, as I mentioned before, birth control, condoms, etc. are not 100% effective. And for that matter, what does it matter about the sexual escapades of your students? That’s none of your business.",
                                  "author": "BananaPerfect8866",
                                  "created": 1639008767,
                                  "upvotes": 0,
                                  "replies": {
                                    "hnshtx6": {
                                      "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnshtx6/",
                                      "text": "The point is it's not an advisers role to guide anyone through chemical imbalance,  or pregnancy, or anything else. An adviser is there to advise in the PhD process period. Any grad that has such problems needs to manage their personal life so that they meet the requirements of the program. You will never ever get a job that gives a shit if you are chemically imbalanced and the help for pregnancy is prescribed by law. After that if they can't perform their jobs they get let go. If your chemical imbalance affects your job performance you would be let go as well, why should ot be any different in a grad program? You are costing the adviser money with no return....hence you are kicked out. ...it has nothing to do with a degree in chemistry it has everything to do with responsibility.",
                                      "author": "rthomas10",
                                      "created": 1639010510,
                                      "upvotes": 1,
                                      "replies": {
                                        "hnssz2g": {
                                          "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnssz2g/",
                                          "text": "Nah man it sounds like you’re a little discriminatory and I’m pretty sure that’s illegal at most colleges when it comes to selecting candidates. \n\nSo I checked out your profile, and I should’ve done it sooner. You just post in conservative subreddits and “gotcha!” Headlines in /r/politics and get dunked on in every conversation you are apart of. \n\nI should have realized something when I needed to explain how birth control worked to a literal chemist. \n\nMaybe you should start seeing students as actual people who have flaws, or lives outside of school.",
                                          "author": "BananaPerfect8866",
                                          "created": 1639015472,
                                          "upvotes": 1,
                                          "replies": {
                                            "hnsu69w": {
                                              "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnsu69w/",
                                              "text": "Kinda creepy man. And you didn't explain how bc worked....you are just refusing to see how some grads need to take responsibility.",
                                              "author": "rthomas10",
                                              "created": 1639015997,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hnod066": {
      "link": "/r/GradSchool/comments/rasmvb/transitioning_from_an_undergraduate_student_to_a/hnod066/",
      "text": "You must motivate yourself to work.\n\nThere are two types of thesis advisors. Hands-on and hands-off. Each come with their pros and cons. The pros of a hands-on guy/gal is that they'll be constantly reminding you of deadlines or imposing their own in an effort to get you to work. The cons are that you may not meet all of those deadlines and it can sometimes be annoying to have someone up your ass all the time when you're focused on projects for other classes or you want to take a breathing day. \n\nThe hand-off professor is nice because they let you work at your own pace, they're there when you need them, they are content with letting you figure things out on your own (which can be good and bad, and they're hand-offness might help you learn a bit of independence and initiative. The con is if they're passiveness can result in major procrastination, a failure to move forward or having to scramble to meet deadlines.\n\nMy thesis director is pretty hands-off. I'm graduating a semester \"late\" (5 vs. 4 for grad school) because of it. Not because of him per se but because I do better with someone demanding specific deadlines from me rather than \"Get it to me in a week or two\". In fact, I barely made the cut this semester to submit my thesis for defense and graduation. My thesis director figured out by my third semester that I was chronically unable to make soft deadlines and began giving me hard ones. I started doing a lot better then. It's a weird psychological thing for me but it worked. \n\nLearn whether you benefit from hands-on or hands-off and make sure your thesis director knows it too. Most are willing to either back off a bit or be more intrusive if you tell them.",
      "author": "AngriestManinWestTX",
      "created": 1638934201,
      "upvotes": 2,
      "replies": {}
    }
  }
}