{
  "sid": "qs3f9b",
  "link": "/r/GradSchool/comments/qs3f9b/thesis_writing_management/",
  "title:": "Thesis writing management",
  "text": "How do you manage thesis writing? I kept them in large chunk, single file (Google docs) make me lost or in friction to start writing each time or know what's my last writing is about every time  I open them. Do you split the files by chapter? Or by progress? And combine them later on?",
  "author": "iloveapi",
  "created": 1636691643,
  "updated": 1637416693,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hkbqnpg": {
      "link": "/r/GradSchool/comments/qs3f9b/thesis_writing_management/hkbqnpg/",
      "text": "TeX files, separated into files by chapter and section, with git for version control.",
      "author": "PityUpvote",
      "created": 1636720802,
      "upvotes": 1,
      "replies": {}
    },
    "hkdeppo": {
      "link": "/r/GradSchool/comments/qs3f9b/thesis_writing_management/hkdeppo/",
      "text": "When I wrote my thesis I just wrote it a chapter at a time. Mine ended up being around 110 pages with an intro, Ch. 1, Ch. 2, and Conclusion. In each chapter, however, there were subheadings. I find it's best to focus on one at a time rather than thinking about it all once which can be overwhelming. I still think it's good to keep it all in one document, though. \n\nWhat subject? I was a history student, but I know responses will vary based on what you're writing about.",
      "author": "Topper2676",
      "created": 1636747061,
      "upvotes": 1,
      "replies": {
        "hke17dj": {
          "link": "/r/GradSchool/comments/qs3f9b/thesis_writing_management/hke17dj/",
          "text": "I'm on computer science. I'm doing this part time and having difficulties to get back where I left, usually in the evening or when I have some free time during the day",
          "author": "iloveapi",
          "created": 1636756871,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}