{
  "sid": "qorwf2",
  "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/",
  "title:": "Performance Enhancement Drugs",
  "text": "Hello,\nJust to start off, I would like to say that I haven't touched that stuff. I have completed my Bachelors and Masters without any drugs. But now I am in my PhD program and I can't help but notice that it is common for PhD/MD to use Adderall or some other substances. Most of them don't even show real signs of attention deficiency, they are just prescribed these things freely.\n\nIs that also common in your fields?",
  "author": "MakingPie",
  "created": 1636302240,
  "updated": 1636656587,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.87,
  "comments": {
    "hjoyway": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjoyway/",
      "text": "I’ve seen a ton in biomedical PhDs. It seems to be super common.",
      "author": "UpYour_ButtHole",
      "created": 1636304226,
      "upvotes": 23,
      "replies": {}
    },
    "hjpgev9": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjpgev9/",
      "text": "I didn't know of anyone in my biomedical sciences PhD cohort that took Adderall. There was definitely a bit of alcohol abuse. A lot of caffeine use.",
      "author": "kirby726",
      "created": 1636311131,
      "upvotes": 11,
      "replies": {}
    },
    "hjqp4n8": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjqp4n8/",
      "text": "I don't know if it's common in my department, but I have ADHD and Adderall has been a lifesaver for me personally. I still struggle, but it's better than not taking any at all.  I think it really depends on the doctor who's prescribing. When I was prescribed, I had to show documentation, and I have to talk to my doctor/make an appointment each time I need a refill. I was diagnosed when I was a kid though, so that might be why getting prescribed initially was harder. I also wouldn't be surprised if a lot of people you know either aren't diagnosed or show different symptoms than you might expect. I don't really have hyperactivity, but my executive function and time management skills are really bad.",
      "author": "tcost1066",
      "created": 1636329346,
      "upvotes": 10,
      "replies": {
        "hjrjc28": {
          "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjrjc28/",
          "text": "And it is worth noting that ADHD is prevalent in the academy. The reward for hyperfocus and some tolerance for distraction tends to attract, I suspect. Not all the older faculty are properly diagnosed (absent minded profs) but newer faculty often are.",
          "author": "halavais",
          "created": 1636343754,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hjp0ykd": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjp0ykd/",
      "text": "Hm, I would be careful with labelling people as not showing \"real\" signs of attention deficiency. See [here](https://www.verywellmind.com/what-is-adhd-correcting-myths-about-adhd-20456) for example. Contrary to expectation, it is quite hard to get diagnosed with ADHD and get stimulant treatment (see [here](https://www.independent.co.uk/health_and_wellbeing/adhd-adult-symptoms-diagnosis-doctor-b1871966.html)). Therefore, I think it is unlikely that your colleagues are getting Adderall even though they don't need it. \n\nApart from this, there are of course people that abuse substances like Adderall, and people in the medical profession might have easier access to it. I know of someone who tried it once, but did not find it useful.",
      "author": "NoNopeMelon",
      "created": 1636305054,
      "upvotes": 36,
      "replies": {
        "hjpe3dr": {
          "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjpe3dr/",
          "text": "What i meant by that is that some of them actually told me that the process was as easy as telling their doctor that they couldn't focus.",
          "author": "MakingPie",
          "created": 1636310229,
          "upvotes": 4,
          "replies": {
            "hjqnkdh": {
              "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjqnkdh/",
              "text": "Welcome to dystopian big pharma 2021. Please take a number and wait in the opioid addiction line to your left.",
              "author": "gentleboys",
              "created": 1636328658,
              "upvotes": -6,
              "replies": {
                "hjrb7dt": {
                  "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjrb7dt/",
                  "text": "Adderall is not an opioid.",
                  "author": "nikefudge23",
                  "created": 1636339660,
                  "upvotes": 1,
                  "replies": {
                    "hjrchoz": {
                      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjrchoz/",
                      "text": "Was more a commentary on how the pharma industry gets people addicted to pain killers. It is an amphetamine.",
                      "author": "gentleboys",
                      "created": 1636340300,
                      "upvotes": 4,
                      "replies": {
                        "hjt24ch": {
                          "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjt24ch/",
                          "text": "I'd still prefer it to the situation in my country, where my grandfather dying of cancer couldn't get proper pain relief because doctors are too afraid to prescribe opioids.",
                          "author": "dwarfedbylazyness",
                          "created": 1636381874,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hjte2yd": {
              "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjte2yd/",
              "text": "That sounds concerning indeed.",
              "author": "NoNopeMelon",
              "created": 1636387057,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjqncav": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjqncav/",
      "text": "Definitely not common in my PhD department. Maybe it’s common in bio because it’s adjacent to the subject matter? That or just the type of person that goes into that field? I also don’t know why you’d need it. It’s not like you’re testing or cramming or doing any of the things classically demanding adderall. Running experiments and analyzing results is pretty chill lol.",
      "author": "gentleboys",
      "created": 1636328561,
      "upvotes": 4,
      "replies": {
        "hjrg5jf": {
          "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjrg5jf/",
          "text": "I do ritalin every day..(50mg a day). I have ADHD and starting a math phd soon. It's useful for getting things done, just as coffee is. I study around 6-10hrs a day and keep myself high on ritalin during that time. So i mean I don't really get why people would use it for last minute study when they can use it to study every day and get more ahead.\n\n Yeah...i've never used it for cramming since my dose is the exact same every day. I have quite a high tolerance and I'd say it only makes me mildly more productive now that I've been doing it for a year.",
          "author": "Important_Leave_9546",
          "created": 1636342115,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjqwqzn": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjqwqzn/",
      "text": "Clinical psychology here.  I don't know anyone in my program using adderal or other stimulants.  I think the most common drug people are using is cannabis, but 1) it's legal in my state, 2) it's mainly being used to cope with the stress of grad school, and 3) I doubt it's performance enhancing besides allowing people to get some sleep.",
      "author": "psychtyke",
      "created": 1636332817,
      "upvotes": 3,
      "replies": {
        "hjtynla": {
          "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjtynla/",
          "text": "Yeah same, the only people I know who take it have ADHD. I knew some lawyers though were stimulants and other drug use was much more common. I was surprised honestly!",
          "author": "QuickyQuiche",
          "created": 1636395301,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjp0nwp": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjp0nwp/",
      "text": "Not in my program that I know of. I also wanted to say that in people who don’t have adhd/add adderall doesn’t improve *performance* any more than placebo",
      "author": "33ducks",
      "created": 1636304936,
      "upvotes": 6,
      "replies": {
        "hjpa12m": {
          "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjpa12m/",
          "text": "It doesn’t? Is that at all or after tolerance sets in and the effect attenuates? I don’t use and cognitive PEDs outside caffeine and creatine (given vegetarian diet) but do browse /r/nootropics occasionally and that’s perhaps obviously not the impression I’d gleaned haha. Would be curious for sources if you’ve got ‘em!",
          "author": "--MCMC--",
          "created": 1636308661,
          "upvotes": 2,
          "replies": {
            "hjpa2cj": {
              "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjpa2cj/",
              "text": "Here's a sneak peek of /r/Nootropics using the [top posts](https://np.reddit.com/r/Nootropics/top/?sort=top&t=year) of the year!\n\n\\#1: [Probiotics that make neurotransmitters.](https://i.redd.it/c4bc14rpl3d61.png) | [140 comments](https://np.reddit.com/r/Nootropics/comments/l3dr11/probiotics_that_make_neurotransmitters/)  \n\\#2: [The oral bioavailability of EVERY nootropic (84+)](https://np.reddit.com/r/Nootropics/comments/n8iqey/the_oral_bioavailability_of_every_nootropic_84/)  \n\\#3: [Have you guys ever tried just taking… nothing?](https://np.reddit.com/r/Nootropics/comments/opjp50/have_you_guys_ever_tried_just_taking_nothing/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/)",
              "author": "sneakpeekbot",
              "created": 1636308674,
              "upvotes": 2,
              "replies": {}
            },
            "hjpgjct": {
              "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjpgjct/",
              "text": "in all honesty it’s not really my field, I’m only doing light reading because I’m trying to determine if it’s worth getting assessed. and whether or not I’d even want to go through the whole process of feeling like crap while the right medication and dosage is found if I do have it. \n\nAnyway, [this study](https://www.frontiersin.org/articles/10.3389/fnins.2013.00198/full) has a couple papers listed in their introduction which call into question the effectiveness of the meds in people without adhd. the study itself is trying to examine why there’s a perceived increase in productivity if there isn’t an actual increase in productivity.",
              "author": "33ducks",
              "created": 1636311181,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hjqsvcy": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjqsvcy/",
      "text": "Plenty in my biomed program. A healthy quantity with ADHD. A healthy quantity with prescription drugs with no cause. Student health offered it to me once without cause. Caffeine is plenty for me.",
      "author": "throwaway__official",
      "created": 1636331024,
      "upvotes": 2,
      "replies": {}
    },
    "hjr2rm8": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjr2rm8/",
      "text": "I knew more people abusing it (and publicly bragging about abusing it) in undergrad than grad. Seems popular in med and law too. PhDs are a marathon, not a sprint. I'm not sure it'd be as helpful. Caffeine and alcohol is super popular.",
      "author": "mediocre-spice",
      "created": 1636335671,
      "upvotes": 2,
      "replies": {}
    },
    "hjst819": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjst819/",
      "text": "Drug abuse was really common in my school and had a lot of people who were either currently abusing (by their own admission--not my assumption) or did in high school. I had a few writing courses where people actually wrote about their experiences abusing it to perform better in school and how they kind of did it with a lot of assumptions they heard about Adderall in particular but found it didn't actually help much.\n\nThat said, I would be really careful in how you're saying people \"don't even show real signs.\" You can't look at or diagnose people like that to say if they \"really\" need it or not. I only knew about the people specifically abusing it because they flat out admitted they did, but plenty of people actually do need those things and won't have some kind of signifier that's immediately obvious to outsiders.",
      "author": "BSWolf777",
      "created": 1636377451,
      "upvotes": 2,
      "replies": {}
    },
    "hjsur85": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjsur85/",
      "text": "I don't know of anyone in my program who does that, but I've been taking a stimulant medication since I was diagnosed with ADHD at age 19. I sure hope nobody thinks of my situation in the way you're describing... Those meds have been such a life saver, and I mean that quite literally.",
      "author": "frumpusmcdoodlepants",
      "created": 1636378266,
      "upvotes": 2,
      "replies": {}
    },
    "hjtgywk": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjtgywk/",
      "text": "Wow, this is my first time hearing of this. I'm from social sciences. Our stress coping mechanism is going to new cafes and also crying alone at 11pm.",
      "author": "givemeyourdonut",
      "created": 1636388238,
      "upvotes": 2,
      "replies": {
        "hjwlwef": {
          "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjwlwef/",
          "text": "Holy shit I felt this in my soul.",
          "author": "Professional_Angle87",
          "created": 1636437655,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjt9vva": {
      "link": "/r/GradSchool/comments/qorwf2/performance_enhancement_drugs/hjt9vva/",
      "text": "Not much Adderall, but plenty of us on anti-depressants and anti-anxiety meds, lol.",
      "author": "racinreaver",
      "created": 1636385316,
      "upvotes": 1,
      "replies": {}
    }
  }
}