{
  "sid": "qswemo",
  "link": "/r/GradSchool/comments/qswemo/student_accommodation_offcampus/",
  "title:": "Student accommodation off-campus?",
  "text": "Hello, I apologize beforehand in case this is an off-topic post, but I was wondering how to search for accommodation in the US? I am going to start my PhD at the University of Texas Arlington from the Spring 22 semester and I wanted to look for places to stay. Any suggestions for where I could search? \n\nThanks!",
  "author": "Aziz2495",
  "created": 1636789977,
  "updated": 1637182749,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hkfye84": {
      "link": "/r/GradSchool/comments/qswemo/student_accommodation_offcampus/hkfye84/",
      "text": "You can use all sorts of websites. Your university may have a Facebook group for students looking for places to rent. Mine does, and lots of people find rentals/sublets there. Craigslist could also be an option, as are other sites like Zillow. \n\nI don't know if UT Arlington has any on-campus housing, but if they do, you may even consider visiting there and ask if they know of any complexes or neighborhoods students who can't get university housing tend to settle in. \n\nI'd pay close attention to the apartment complexes or rental units, because housing that tends to be disproportionately populated by students also tends to attract a disproportionate amount of slumlords and shitty rental companies. If you go visit a unit, try to make sure that is the actual unit you will be moving into, rather than a \"show unit\". I've had apartments show me \"show units\" before that were *substantially* different from the actual unit I would be living in. The faucets and drains will all be working, of course, in show units but maybe not in the one you'd be living in. \n\nIf you can, also maybe consider driving through the neighborhood at night to check it out. Sometimes apartment complexes can seem peaceful and quiet during the day (when people are working), but at night time, all the loud parties, random loiterers, drug dealers, or general ruckus causers come out. That's happened to me before too. If all the apartments you can afford/can afford to travel to happen to be in less then desirable areas, try to get an apartment that isn't on the ground floor.",
      "author": "False-Guess",
      "created": 1636798330,
      "upvotes": 3,
      "replies": {
        "hkh9m4p": {
          "link": "/r/GradSchool/comments/qswemo/student_accommodation_offcampus/hkh9m4p/",
          "text": "Thanks so much for the detailed response! Some of the things you mentioned will be difficult for me since I’m an international student and I am not in the US yet! But thanks nonetheless! And I’ll definitely look into your online suggestions!",
          "author": "Aziz2495",
          "created": 1636825255,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkfp3j5": {
      "link": "/r/GradSchool/comments/qswemo/student_accommodation_offcampus/hkfp3j5/",
      "text": "Zillow.com/other similar websites, Facebook\nMarketplace and your universities off campus housing department are all resources you can utilize.",
      "author": "FlyAnHourOrWalkAWeek",
      "created": 1636790099,
      "upvotes": 3,
      "replies": {
        "hkfvx9q": {
          "link": "/r/GradSchool/comments/qswemo/student_accommodation_offcampus/hkfvx9q/",
          "text": "Okay thanks! I will look into those. I wanted to know some reliable websites to reduce my chances of getting scammed",
          "author": "Aziz2495",
          "created": 1636796081,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkg6wq2": {
      "link": "/r/GradSchool/comments/qswemo/student_accommodation_offcampus/hkg6wq2/",
      "text": "If you are looking for roommates, Facebook groups are pretty good. They have some made specifically for you school most likely (was the case at both my universities). You can search something along the lines of [whatever your universities name is] along with something like housing, off campus housing, for rent, or apartments",
      "author": "chemdisco",
      "created": 1636805510,
      "upvotes": 2,
      "replies": {
        "hkh9otb": {
          "link": "/r/GradSchool/comments/qswemo/student_accommodation_offcampus/hkh9otb/",
          "text": "Thanksss!",
          "author": "Aziz2495",
          "created": 1636825287,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}