{
  "sid": "r7gex5",
  "link": "/r/GradSchool/comments/r7gex5/do_i_continue_hoping_or_start_anew/",
  "title:": "Do I continue hoping or start anew?",
  "text": "Dear all,\n\nI was offered admission in a Cognitive Neuroscience masters program in Italy this May. After a tedious long loan process, I submitted my visa application in August. I had ticked every box, crossed all ts and dotted all is. Or so I thought. I received a rejection in September. By then, my classes had started and I was halfway packed to leave for Italy. Thinking it as some fluke or small mistake, I reapplied for the visa. That was long back. I still haven't heard back. I see a lot of students getting rejected, especially reapplicants. \n\nI started the course and continued completing it online. My semester is almost done. I have submitted all assignments and kept up with everything, as well as I could. I spend 3 years learning the basics, interning part-time in a lab, and as a freelancer, on top of my regular job, to reach here. In September, I also quit my job to study full-time.  And it is incredibly disheartening to think I would have to give up everything now. \n\nI don't know if the visa will get accepted. What I do know is I don't want to go back to my job nor will I be happy being an administrative worker anymore. I find joy in Neuroscience and I want to continue doing that. \n\nI need your help with these:\n\n1. There is an application deadline for the next academic year rolling in the next two weeks. How do I approach my referees? Is it okay to submit the same references, since I have not done anything differently? (The classes I have been doing in Italy are recorded lectures. The professors don't know me personally and hence wouldn't be able to vouch for me)\n\n\n2. How do I explain this situation in a motivation letter? I did do a semester of Cognitive Neuroscience. As someone from a literature background, it will enormously help my candidature. However, I'm not sure how to bring this as part of my letter without throwing doubts in their mind about me as a student/visa rejected person.\n\nSorry for the very long post. Thank you, if you read so far. This is a very difficult time, where I keep desperately hoping things will work out but shit scared they won't and I will have to come up with contingencies. That's practical. But who wants to give up on their dreams when all but one step was done? How do I go back to being okay with another year of applications and waiting?",
  "author": "Klutzy_dreams",
  "created": 1638476660,
  "updated": 1638481099,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}