{
  "sid": "qyuf8e",
  "link": "/r/GradSchool/comments/qyuf8e/question_about_major_choice/",
  "title:": "Question about major choice?",
  "text": "Hey, so I’m just gonna make this quick.\n\nI’m a high school student very much interested in pursuing a career in neuroscience later on down the road. For a couple of reasons, I’m planning on studying physics @ the University of Arizona — the physics major because I’ve heard that it’s better to major in something computational rather than straight neuroscience (which can be picked up faster later), and the UofA because their astronomy program is top tier (and that should translate to the physics program, right?)\n\nSo here’s the thing: I was looking over graduation requirements and the astro and physics majors are very similar (I think a 4-class difference) in course requirements, and since the astro dept. has considerably more/better research ops, I was wondering if it would be a good idea to switch to an astro major. But I feel like that might harm me in grad school admissions if I’m going for neuroscience (something that seems to be more far removed from astro, as opposed to physics). I’d like to make these four years as fun as possible, given that high school sucked for me, but I’m absolutely lost as to the viability of this route. I’d love to do astro.\n\nOh, and as for undergrad research in neuroscience, that’s no biggie. I have that pretty well-taken care of.",
  "author": "Voyage_1970",
  "created": 1637499406,
  "updated": 1637689882,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.6,
  "comments": {
    "hliul3l": {
      "link": "/r/GradSchool/comments/qyuf8e/question_about_major_choice/hliul3l/",
      "text": "I'd recommend in addition to the undergraduate research in neuroscience that you get at least a minor in biology to be competitive in neuroscience admissions, speaking from personal experience.",
      "author": "ConsortiumBetrayal",
      "created": 1637511233,
      "upvotes": 10,
      "replies": {
        "hliv7yn": {
          "link": "/r/GradSchool/comments/qyuf8e/question_about_major_choice/hliv7yn/",
          "text": "So majoring in astro wouldn’t be a bad idea?",
          "author": "Voyage_1970",
          "created": 1637511499,
          "upvotes": 0,
          "replies": {
            "hlizmbs": {
              "link": "/r/GradSchool/comments/qyuf8e/question_about_major_choice/hlizmbs/",
              "text": "Major in whatever you're passionate about because your grades will reflect it. The only reason a physics major is appealing in neuroscience admissions is because you will have much more quantitive skills than your average biology major, but you can get that training through an astronomy major too, depending on the school. Someone from my undergraduate got into a top 10 neuroscience program, and she had an engineering-physics major, which is pretty different from physics at my school. She also had a neuroscience minor, which I strongly believe played a major role in her acceptance.",
              "author": "ConsortiumBetrayal",
              "created": 1637513310,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hlixtar": {
      "link": "/r/GradSchool/comments/qyuf8e/question_about_major_choice/hlixtar/",
      "text": ">I’m a high school student very much interested in pursuing a career in neuroscience later on down the road.\n\nJust so you know, a majority of students tend to switch their major once they're in college.\n\nAnd right now, you haven't had any exposure to the more in-depth knowledge of the introductory college courses you will take. Your perspectives could certainly change once you've been in college and completed some courses.\n\nSo since you're kind of all over the place, my advice would be to don't worry about this now. Take physics, astronomy, and biology courses your first year. You could even enter college undecided as to your major.\n\nThen, in spring of your first year, meet and talk this over with a college advisor.",
      "author": "raistlin65",
      "created": 1637512564,
      "upvotes": 7,
      "replies": {
        "hlj3rki": {
          "link": "/r/GradSchool/comments/qyuf8e/question_about_major_choice/hlj3rki/",
          "text": "Just for the record, I've done some comp neuro-adjacent research already (and even got published, first author!) and I'm very much sure that I'd like to pursue that as a career. I'm building my plans off of that.  \n\n\nI do agree though that I'm being a bit too rash in my judgement now. I'll give this some time before I decide.",
          "author": "Voyage_1970",
          "created": 1637515015,
          "upvotes": 1,
          "replies": {
            "hljg2jp": {
              "link": "/r/GradSchool/comments/qyuf8e/question_about_major_choice/hljg2jp/",
              "text": "Right. You don't need to figure it out yet. Should typically be possible to set up your first year such that you would be making good progress towards majoring and minoring in some combination of any of them. And then you'll be able to make a more informed decision.\n\nJust be sure to review the major and minor course requirements for each of those disciplines before it's time to sign up for courses at orientation. And the general education requirements the university has, as you'll likely want to satisfy some of those requirements your first year.",
              "author": "raistlin65",
              "created": 1637519956,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hli98vl": {
      "link": "/r/GradSchool/comments/qyuf8e/question_about_major_choice/hli98vl/",
      "text": "So I’d agree with you that majoring in physics might “look better” on an application in terms of if you’re plan is to go towards neuroscience. However, astronomy does have quite a bit of computational components so in that regard you aren’t missing it entirely by majoring in astronomy. You could always major in physics and take astro classes to fulfill other requirements or just because you find the course interesting. I did a double major in physics and astronomy so if you have any other questions feel free to pm me!",
      "author": "physics_masochist",
      "created": 1637501124,
      "upvotes": 1,
      "replies": {
        "hlj06yz": {
          "link": "/r/GradSchool/comments/qyuf8e/question_about_major_choice/hlj06yz/",
          "text": "Since you're Physics-focused, do you think it would be better to try to find a program in Applied Physics than Astronomy? I'm in an Astronomy program, but I'd be worried about skills outside of the observatory, and in my Uni's Applied Physics program, they have medical physics and computational physics where I wouldn't be at all concerned about that for someone wanting to go into neuroscience.",
          "author": "Planetary_Piggy",
          "created": 1637513541,
          "upvotes": 1,
          "replies": {
            "hlj0zl6": {
              "link": "/r/GradSchool/comments/qyuf8e/question_about_major_choice/hlj0zl6/",
              "text": "I would say that the you should apply to the program that has the most resources for your interests and future endeavors. At least where I did my undergrad, the physics and astronomy programs didn’t differ all that much with the exception of a few higher level courses that were astro-specific (cosmology, stars and radiation, galaxies, etc.). When it comes to graduate programs, I don’t think there would only be a difference if someone just quickly looked at your application and if they saw astronomy in a neuroscience application they may be slightly confused, but maybe with applied physics they’d be less confused as to the switch in direction. However for someone that went through the actual coursework and is looking at your application then there really isn’t too much of a difference in knowledge basis. It’s a bit tricky with disciplines that are so closely related and you honestly can never really tell which will “look better” on an application that you’ll be filling out four years from now. Regardless I hope this was helpful!",
              "author": "physics_masochist",
              "created": 1637513870,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hllxycn": {
      "link": "/r/GradSchool/comments/qyuf8e/question_about_major_choice/hllxycn/",
      "text": "I’m just curious why you are thinking of doing physics as “something computational” as opposed to stats or data analysis?",
      "author": "cereal_no_milk",
      "created": 1637561177,
      "upvotes": 1,
      "replies": {}
    }
  }
}