{
  "sid": "pibzaz",
  "link": "/r/GradSchool/comments/pibzaz/ubuntu_in_pc_or_mac/",
  "title:": "Ubuntu in PC or Mac?",
  "text": "I want to use Python, Spyder, Anaconda, R, RStudio and software packages for writing code and doing stats by running on large datasets.\nWorkplace offers a choice between Mac or PC  or I get my own machine.\n\nI'm really comfortable with Ubuntu, so what are the ways I can have command line based user experience for above mentioned tasks using Mac or PC? What's the most sensible thing to do here?  I'm open to all suggestions including Virtual Machine, etc.",
  "author": "polkapokemon",
  "created": 1630843869,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hbs0wqa": {
      "link": "/r/GradSchool/comments/pibzaz/ubuntu_in_pc_or_mac/hbs0wqa/",
      "text": "Stick with Ubuntu. \n\nWhen you buy certain brands of PC's, the bios might give you problems trying to install another OS. If you buy Dell, they sell developer editions that come with Ubuntu preinstalled. System76 also gives the option to ship with Ubuntu. Stick with similar options to that. Windows has serious problems with rjava, and wsl doesn't resolve all of them",
      "author": "c2u8n4t8",
      "created": 1630907304,
      "upvotes": 1,
      "replies": {}
    },
    "hbqbvdn": {
      "link": "/r/GradSchool/comments/pibzaz/ubuntu_in_pc_or_mac/hbqbvdn/",
      "text": "WSL2 if you aren't allowed to use ubuntu.",
      "author": "CTR0",
      "created": 1630875750,
      "upvotes": 2,
      "replies": {}
    },
    "hbpi8c0": {
      "link": "/r/GradSchool/comments/pibzaz/ubuntu_in_pc_or_mac/hbpi8c0/",
      "text": "Assuming they both have capable enough hardware to run what you want, I’d go with the windows pc and dual-boot.",
      "author": "ThrowawayHistory20",
      "created": 1630862526,
      "upvotes": 1,
      "replies": {}
    },
    "hboouqp": {
      "link": "/r/GradSchool/comments/pibzaz/ubuntu_in_pc_or_mac/hboouqp/",
      "text": "The right answer is going to depend just as much on ***how*** you want to run Ubuntu as which type of system is better suited for it.\n\nPC's with windows 10 or 11 have the windows subsystem for Linux built-in that will allow you to run Ubuntu in a fashion similar to any other program on the PC. While this works, I found in my experimentation that it introduces extra, unnecessary steps compared to running native Ubuntu (ex. I had to run a set of commands each time I accessed WSL/Ubuntu to make sure that x-windows was working properly for that session to ensure I could display the plots I was making) either via dual-boot or simply wiping windows and converting the PC to a Linux machine.\n\nWith a Mac, you have direct access to the terminal, and by enabling of a few \"developer options\" basically treat the system as a Linux machine. However, because of the recent switch to the M1 chip, you may run into some smaller or unmaintained programs/code that don't run natively on the system yet, in addition to the extra complication that comes from macOS being an implementation of BSD, not Linux. However, these issues are rapidly being solved given the large user-base within the academic and developer communities.\n\nUltimately based on how you've described your familiarity with Linux, I would dual-boot a PC if I were in your position; but I don't think you can really go wrong with whatever choice you make. It's just a matter of choosing which set of inconveniences won't bother you as much as the others.",
      "author": "monoDK13",
      "created": 1630849254,
      "upvotes": 4,
      "replies": {}
    },
    "hbokjsi": {
      "link": "/r/GradSchool/comments/pibzaz/ubuntu_in_pc_or_mac/hbokjsi/",
      "text": "All OSes have decent enough data science support. If you hit a limitation it will more than likely be to do with the class of the hardware and not the OS. I.e. Time to use a cluster.\n\nYou can install Linux on the pc natively, not the case for the m1 mac (a dev branch is aiming to get it working but its early stage). \n\nThe M1 mac is in itself a Unix like system and has good support for data science workloads, mostly. Seek some reviews of the m1 in a data science context.\n\nTo complicate things, windows supports Linux as a core feature using its subsystem for Linux. You can install Ubuntu from the Windows store and use as if native. The major caveat being gpu acceleration for ds workloads is coming out in the next few months.\n\nAs for natively installing Linux on the PC. Go with pop os, it's Ubuntu based and has a ds install mode. You're used to Ubuntu, stick to the debian/Ubuntu family.",
      "author": "Ophidian69",
      "created": 1630846875,
      "upvotes": 4,
      "replies": {}
    },
    "hbohbid": {
      "link": "/r/GradSchool/comments/pibzaz/ubuntu_in_pc_or_mac/hbohbid/",
      "text": "Ubuntu on pc. Easy choice. Or even better, Arch on PC.\n\nMac is ok, but Apple’s idea of a walled garden sucks. You will have to use all of their products.",
      "author": "diamondduck112",
      "created": 1630844879,
      "upvotes": 3,
      "replies": {
        "hbpi272": {
          "link": "/r/GradSchool/comments/pibzaz/ubuntu_in_pc_or_mac/hbpi272/",
          "text": "I’m a very casual Linux user. I’ve used Arch before, but I never really got it, what makes it so much better than other distros? Never understood the hype.\n\nAs for Apple’s walled garden, I agree it’s a bad concept, but I use a mixture of i devices, and windows and Ubuntu on desktop and never really have a problem, its not hard to use a mixture of devices.",
          "author": "ThrowawayHistory20",
          "created": 1630862451,
          "upvotes": 2,
          "replies": {
            "hbpssma": {
              "link": "/r/GradSchool/comments/pibzaz/ubuntu_in_pc_or_mac/hbpssma/",
              "text": "Arch is good if you like to be able to tweak every detail in your OS. It has few preconfigured options and you get to choose everything else. Besides easier access to advanced configuration, it encourages (requires, TBH) learning how computers operate that can be fun and will probably pay off if you are going to make career in IT.\n\nFor me, it just has way less clutter than more ‘user-friendly’ distros. I wouldn’t recommend it to a stranger, though, and I won’t recommend bare Arch to anyone, because installation without GUI sucks, IMO. I use EndeavourOS that is a nice fork of Arch.",
              "author": "s-walrus",
              "created": 1630867208,
              "upvotes": 3,
              "replies": {
                "hbpuftp": {
                  "link": "/r/GradSchool/comments/pibzaz/ubuntu_in_pc_or_mac/hbpuftp/",
                  "text": "That’s fair I suppose. I did a non-GUI install of arch two or three times just to do it, but ya, it sucked ha.  For me at least, I don’t feel like I really need to know all the ins and outs of how my computer runs. Installing a new OS is plenty enough knowledge for me.",
                  "author": "ThrowawayHistory20",
                  "created": 1630867960,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634067464
}