{
  "sid": "r6iruu",
  "link": "/r/GradSchool/comments/r6iruu/reference_letter_advice/",
  "title:": "Reference Letter Advice",
  "text": "I’m currently applying for a PhD at the university where I finished my MA last year. The application only allows 2 references and I’m torn: I have one reference from my graduate program who is going to write me a great personalized reference, but I can’t decide whether to use my second graduate prof (who doesn’t know me that well), or my undergrad prof who knows me extremely well. The second grad prof is highly regarded, and of course teaches at the school, but I know my undergrad prof has a much better idea of who I am and can speak to my work in better detail.\n\nWhat would you do if in the same position?",
  "author": "squid1520",
  "created": 1638376269,
  "updated": 1638481137,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmwej9w": {
      "link": "/r/GradSchool/comments/r6iruu/reference_letter_advice/hmwej9w/",
      "text": "Tough (but good) question. I'm assuming that the second grad prof is at least are familiar with your research and some of the work you'd like to do in the future (and that this overlaps with their work in some way). If not, I'd go with your undergrad prof. \n\n Is this 2nd grad professor in the same dept as the degree program you're applying for? It would be worth having a conversation with them about the program and the application process if you haven't already. If they're in that same dept that you're applying to, they might be on the selection committee (and thus might feel weird about writing a letter for you if they're also involved in doing the first round of reviews on applications). If they're not, and they're well respected in the field and can speak to your readiness for the intensity of a PhD program, it might be worth asking them.  A lot of professors will ask for a CV and list of points that you'd like them to mention before they start writing a letter of rec anyways, so them not being as familiar with you may not be as big of a deal. \n\nOn the flip side, even if they don't write you a letter they can definitely still speak up for you during those reviews, which can be a huge help. In both my MA and PhD programs, the professors in the room during application reviews had the most sway in pushing for individual students to be accepted, and the letters/CV/GRE scores were more for ensuring that you met minimum qualifications or as supplementary materials for university-wide fellowship applications (although this was in fairly small depts, larger ones may have a different vibe). If you envision yourself working with that second prof more in your next program, I would spend some time now trying to connect with them more and chat about your future research goals, etc. \n\nIf your undergrad advisor knows your research well, knows the future trajectory of the work you want to do (and can speak towards your preparedness for that task), and has a decent track record of publications/mentoring grad students in your field, then that might be a reason to select them instead.",
      "author": "Geocycling",
      "created": 1638424205,
      "upvotes": 2,
      "replies": {
        "hmy0vev": {
          "link": "/r/GradSchool/comments/r6iruu/reference_letter_advice/hmy0vev/",
          "text": "Thank you for the insight, I really appreciate it! The graduate prof is in the same department, and knows my work from a seminar I took with them last semester. However, the more I think about it, my undergrad prof taught me courses from my first year up to my last, and I know will write me a great, personalized reference. I think I was getting caught up on how the grad prof has a much higher global prestige in the field, but I’m thinking that the quality and personalization of the letter is ultimately more significant, right?",
          "author": "squid1520",
          "created": 1638460922,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}