{
  "sid": "r9l5vq",
  "link": "/r/GradSchool/comments/r9l5vq/professor_screwed_me_over_by_telling_my_advisor/",
  "title:": "Professor screwed me over by telling my advisor first that I didn’t want to do his funded project",
  "text": "TLDR: Started crying in class about not liking my PhD project and the professor told my advisor before I could tell them about it.\n\nI graduated in May of this year and was looking for graduate programs with funding anywhere. It was rough cuz of COVID. I found a professor with funding and a project but it was 1) for a PhD, which I didn’t want and 2) for a project that I would only learn later was vastly different than what I wanted. I wanted to do a Masters and I wanted to work with invasive species, one of his research interests but the project was on vermicompost tea.\n\nSo I figured I could do it, that it would be ok to do something different but in doing the coursework, seeing everyone so passionate about their projects during seminar, I just broke down. That dam i kept up during the semester broke. The loneliness, the difficulty in being able to connect with my advisor, the imposter syndrome, it all came out.\n\nMy classmates comforted me, sympathized and understood me; they said that there were solutions I could find. The seminar professor came up to see what was happening and I told her. She said I could make an appointment for next week to talk with her; she seemed nice and knowledgeable! So I said yes and thank you. I went home, told my folks, and they were sympathetic too!\n\nThen my advisor emailed me, asking for an urgent zoom meeting in the morning.\n\nI was stunned. The professor told him. I texted her (since I had it from a field trip) and she said we had to talk it out, and that we could talk about it later.\n\nI think that zoom meeting was one of worst moments of my life up to this point. Easily top five. I was mortified. Caught in 4K. My bpm was 110+ before, during and after the meeting. He basically said I had the week before finals to come up with a MS thesis project/idea. Which is doable but nerve wracking. I know I can do it, and I’m glad the project is different but holy shit do I feel humiliated. I was hoping to at least have the weekend to talk with the professor and the students in my lab who’ve known my advisor for longer. But holy shit.\n\nSo, yeah. If anyone knows how to come up with a MS project in less than a week hit me up? Especially if it had to do with invasive plant species in the Florida Everglades?",
  "author": "danifreedude",
  "created": 1638727013,
  "updated": 1639518975,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hndi63q": {
      "link": "/r/GradSchool/comments/r9l5vq/professor_screwed_me_over_by_telling_my_advisor/hndi63q/",
      "text": "I mean... I can understand being blindsided, but isn’t the result of this that your seminar professor advocated on your behalf to get what you wanted (a masters in an area that you can choose the topic of)?\n\nThis sounds like a case of your seminar professor looking out for you and your PI caring that you get what you want out of grad school, unless I’m misunderstanding things, so I’m having a hard time seeing how “screwed you over” is accurate.",
      "author": "Eigengrad",
      "created": 1638739299,
      "upvotes": 18,
      "replies": {}
    },
    "hncktq5": {
      "link": "/r/GradSchool/comments/r9l5vq/professor_screwed_me_over_by_telling_my_advisor/hncktq5/",
      "text": "Gosh. I know nothing about your discipline, but I'd say that shows some lack of discretion on behalf of your professor.\nShe probably meant well, but ouch.",
      "author": "Naivemlyn",
      "created": 1638727358,
      "upvotes": 8,
      "replies": {
        "hndwmpg": {
          "link": "/r/GradSchool/comments/r9l5vq/professor_screwed_me_over_by_telling_my_advisor/hndwmpg/",
          "text": "There is no obligation of discretion in this instance. Professors commonly share with each other what students say in the interest of what they think is the best for the student and/or the program. Especially if it is said during class, because then it's been made public.\n\nNow if you share with a professor something very personal in a one-on-one meeting that is not related to the school or the program, and ask them not to share it, that would be different.\n\nBut if you have something to say about your educational experience at the institution, don't share it with a professor if you don't want it shared with other faculty or the administration. They may feel they have a professional obligation to share it.",
          "author": "raistlin65",
          "created": 1638744921,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hndbsd4": {
      "link": "/r/GradSchool/comments/r9l5vq/professor_screwed_me_over_by_telling_my_advisor/hndbsd4/",
      "text": "Professors are not always models of discretion. \n\nA similar thing just happened to one of my undergrads, but either the professor wasn't paying attention and jumped to conclusions or the undergrad expressed themselves very very poorly, because within a day my PI and the chair got an email and I was called in to meet the chair. I had no idea what the meeting would be about, and it turns out, the issue had nothing to do with me or our lab, but instead the emotional difficulty of our research topic. I'm still kinda pissed. Made for a very anxious 24 hours.",
      "author": "Pr0gr3s",
      "created": 1638736967,
      "upvotes": 2,
      "replies": {}
    },
    "hnfks52": {
      "link": "/r/GradSchool/comments/r9l5vq/professor_screwed_me_over_by_telling_my_advisor/hnfks52/",
      "text": "Ahh I’m so sorry this has happened to you 😭😭😭😭😭😭 Have you tried looking into adaptive management to decrease the level of invasive plant species?",
      "author": "Zestyclose-Amoeba-27",
      "created": 1638773964,
      "upvotes": 2,
      "replies": {}
    }
  }
}