{
  "sid": "rba0b7",
  "link": "/r/GradSchool/comments/rba0b7/for_those_going_back_do_you_just_quit_your_job/",
  "title:": "For those going back, do you just quit your job?",
  "text": "I’m a May 2021 epi/biostat masters grad with a remote salaried position that I like a lot. However, I really do think I want to get a PhD, probably sooner than later. I know working really isn’t feasible if I want to dedicate myself to a good PhD experience, so I would like to hear your experiences with going back to academics once you were settled in a position. Did your employer offer for you to return to a higher position when you were done? Do they treat it like you’re basically getting a new job? Were you worried about giving up that security of the position you were in? How did you weigh the potential progression in your current position with the potential after a PhD?",
  "author": "BelieveIt-ItsRipley",
  "created": 1638912519,
  "updated": 1639518596,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hnntix5": {
      "link": "/r/GradSchool/comments/rba0b7/for_those_going_back_do_you_just_quit_your_job/hnntix5/",
      "text": "\"Did your employer offer for you to return to a higher position when you were done?\"\n\nNope. they didn't offer it when I left and I'm sure they have no idea I'm done now. I also did a PhD in something completely unrelated to my job.\n\n\"Do they treat it like you’re basically getting a new job?\" \n\nPretty much but my boss was probably a little happier I wasn't leaving just to get away from him like everyone else that leaves that position. \n\n\"Were you worried about giving up that security of the position you were in? \"  \n\n\nNope. But I hated working for my boss and I was only a contract employee so I was probably not going to be there for multiple years anyway unless someone who had a \"real\" non-contract job left.\n\n\"How did you weigh the potential progression in your current position with the potential after a PhD?\"\n\nI was probably going to be a lab tech for the rest of my life if I stayed in that position. Nothing wrong with that if I had gotten a non-contract position since that company took care of their techs well. At the time I wanted to make more money and be in charge. I kind of miss being told what to do some days now that I have a PhD though. I also wanted a job that had a more meaningful purpose behind its goals but I no longer really care about that. I just want a job I'm decent at.",
      "author": "Ru-tris-bpy",
      "created": 1638924367,
      "upvotes": 5,
      "replies": {}
    },
    "hnne2r5": {
      "link": "/r/GradSchool/comments/rba0b7/for_those_going_back_do_you_just_quit_your_job/hnne2r5/",
      "text": ">Did your employer offer for you to return to a higher position when you were done?\n\nNo, although they re-hired me temporarily when the uni shut down for COVID. I didn't work at a place that would employ PhDs, though.\n\n>Do they treat it like you’re basically getting a new job?\n\nLike when I put in my notice? Yeah, I guess so. Except they were definitely happier for me than  they would have been if I was just leaving for a new job.\n\n>Were you worried about giving up that security of the position you were in?\n\nOf course. I liked buying frivolous things and heating my house and going out to eat and traveling (still do!), and cutting back on all of that was definitely a con.\n\n>How did you weigh the potential progression in your current position with the potential after a PhD?\n\nAfter looking at job postings, I just couldn't do what I wanted to be doing without going back to school, unfortunately. Never cared to do drug safety, sales or education/training. I couldn't imagine being stuck for the next 30+ years being miserable at my job and I never ever wanted my boss' job. I decided I would rather take the pay cut (even post-PhD) than to keep doing what I was doing. Also decided I was young-ish, no kids, my parents are healthy... better to get it over with now.",
      "author": "designedforxp",
      "created": 1638917143,
      "upvotes": 5,
      "replies": {
        "hnntsb3": {
          "link": "/r/GradSchool/comments/rba0b7/for_those_going_back_do_you_just_quit_your_job/hnntsb3/",
          "text": "Thank you! I like doing all of those frivolous things too and am also worried that my pay potential later may not be that much more than my pay potential now",
          "author": "BelieveIt-ItsRipley",
          "created": 1638924493,
          "upvotes": 1,
          "replies": {
            "hnpqsr9": {
              "link": "/r/GradSchool/comments/rba0b7/for_those_going_back_do_you_just_quit_your_job/hnpqsr9/",
              "text": "I guess you have to weigh out how much the time investment vs pay vs career satisfaction matter to you. Unfortunately, more education doesn’t always translate to more money 😅 which definitely sucks.",
              "author": "designedforxp",
              "created": 1638970133,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}