{
  "sid": "qpihix",
  "link": "/r/GradSchool/comments/qpihix/i_think_i_screwed_my_future_as_an_international/",
  "title:": "I think I screwed my future as an international student",
  "text": "A little backstory: I came to the US to study Computer Engineering as an undergrad back in 2017. Internships were required as part of my program, but I only managed to get 2 out of the 4 blocks I was supposed to do, and those two internships barely had anything to do with my major (it was really basic IT stuff). The other 2 blocks were waived due to COVID.\n\nI started my grad program back in Fall 2020 in Software Engineering entirely online. I later did my Spring 2021 semester in another country because my parents insisted to come over. Probably the worst decision of my life as without getting into details, I did not enjoy living in their household, I failed one of my classes and I wasn't able to leave until late summer essentially.\n\nFast-forward to now where I am trying to get out of academic probation and need to decide whether I need to do a capstone and graduate early or an internship next semester and extend my program. I did not want to do a thesis because I suck at research and my advisor advised against it. My goal is to make a life of my own independent (through career opportunities in the US) from my parents so I don't end up being stuck with them again.\n\nI am unsure what to do considering my visa is expiring on summer 2022. After speaking with my international services department, they basically said as long as I am a student in the institution with no travel plans outside the US, I can still stay and even apply for OPT later on. I haven't told my parents about this yet because I don't want them to know that I won't be able to travel out of the US after next semester if I choose to stay longer (this is kinda relevant since I financially depend on them for my college program).\n\nTo make matters worse, I have basically fucked up my job search for next semester. I think I only applied to 20ish jobs and I only got 1 interview and 2 coding tests. No offers. I have been dealing with motivational issues as well and am still playing catch-up with academic stuff. I am also going to be speaking with a faculty member about my capstone, and I just told her about my internship plans but she hasn't responded and I don't know if she is okay with it.\n\nIf I do end up only being able to get a job through OPT, what if I end up going in a shitty internship with no opportunities for sponsorship? What happens if my internships and OPT ends? Where do I go? Some people tell me to enjoy life by living in the moment, but I can't do that when my future can be potentially chaos. How do I not fuck up my career opportunities, provided I haven't already screwed them up?",
  "author": "mmkthecoolest",
  "created": 1636392564,
  "updated": 1636656569,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hjuh6be": {
      "link": "/r/GradSchool/comments/qpihix/i_think_i_screwed_my_future_as_an_international/hjuh6be/",
      "text": "Just chill, you only need 1 years of work experience to apply for Canadian PR (1st step to citizenship). Sounds like you're young, fluent in English, and have a graduate degree in an in-demand field so you're good. As long as you get a job in your field and can stay for 1 year, you can start applying for your Canadian citizenship",
      "author": "phdreaming234",
      "created": 1636402752,
      "upvotes": 4,
      "replies": {}
    }
  }
}