{
  "sid": "f52utf",
  "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/",
  "title:": "After 9 year finally got my PhD. Biggest takeaway was how not to be a mediocre PI",
  "text": "After 9 years of self-esteem issues and drawn away from my family I finally finished my PhD. The smile on my mothers face made all the sour times worth it.",
  "author": "dreganxix",
  "created": 1581912281,
  "over_18": false,
  "upvotes": 341,
  "upvote_ratio": 0.99,
  "comments": {
    "fhyzl7r": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhyzl7r/",
      "text": "How is it possible to get funding for such a long time? I don't know if people in your field take longer and you've just taken longer than average, but nine years is incredibly long. I don't know how you can justify that in a job interview. Anyway, congratulations!",
      "author": "ThatFriendlyPerson",
      "created": 1581987451,
      "upvotes": -1,
      "replies": {
        "fhz7ocn": {
          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhz7ocn/",
          "text": " It’s a looooong time you are correct.\n\nThat was one of the problems, there was no funding in our lab. The PI simply did not bother to get funding. Luckily, I had funding from a SLOAN scholarship, but it wasn’t enough, so I had to work as a lab instructor. After that ran out, I got a gig performing STEM outreach shows at public schools to get some money, and finally ended up getting a personal loan. \n\nSide jobs take a lot of time away from thesis work. On top of that Hurricane Maria ravaged our lab, we lost everything.\n\nI got offered a position as a temp professor which is good! But I am looking for something more permanent. I can only hope interviewers look at my CV and realize I am resilient and dedicated.",
          "author": "dreganxix",
          "created": 1581992754,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "fhy3cnz": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhy3cnz/",
      "text": "Congratulations! I am so happy for you and proud of you!!! I'm in my 5th year and it's really hard. Really, really hard. But I hope to get out one day, too.",
      "author": "FewActinomycetaceae9",
      "created": 1581967703,
      "upvotes": 1,
      "replies": {}
    },
    "fhxqm2o": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhxqm2o/",
      "text": "Imagine starting at 21 and finishing at 30. It's amazing even to just consider the psychological changes alone in that time frame.",
      "author": "Reductate",
      "created": 1581960202,
      "upvotes": 2,
      "replies": {
        "fhz3isz": {
          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhz3isz/",
          "text": "Seeing your friends from other labs graduating as you are stagnant is hard to say the least, a mixture of emotions. You are happy for them but somehow its also painful and unbearable.",
          "author": "dreganxix",
          "created": 1581990031,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fhxp5vs": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhxp5vs/",
      "text": "Congrats!  Another takeaway:  You finished and decided it was worth it.  Hang on to that :)",
      "author": "jell1fish",
      "created": 1581959316,
      "upvotes": 1,
      "replies": {}
    },
    "fhxmyg3": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhxmyg3/",
      "text": "Congratulations! \n\nI can empathize. I've been working on mine for too many years with an advisor who is absent at the best of times and very malicious at the worst. Now it's me trying to train myself while working full time+ (at a related job but not contributing to the PhD completion) and suffering from depression. Any advice?",
      "author": "Quincy1785",
      "created": 1581957953,
      "upvotes": 3,
      "replies": {
        "fhz5ccq": {
          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhz5ccq/",
          "text": " Don’t give up! I thought about quitting many many times, just don’t!\n\nI constantly doubted my abilities and feedback from my PI wasn’t constructive ever, which didn’t help. It’s an awful internal struggle, but you must realize that you made it to this point by yourself, and if you can get here then you can finish it. \n\nTaking things one day at a time worked wonders for me. At the end you realize that you are a self-made PhD and that you can tackle any problem that is tossed in your direction. I don’t know you personally, but the fact that you are looking for advice, looking for ways to get it done shows me that you will find a way to accomplish your goal.",
          "author": "dreganxix",
          "created": 1581991227,
          "upvotes": 2,
          "replies": {
            "fhz8tpr": {
              "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhz8tpr/",
              "text": "Thanks, e-friend! I'm still aiming to finish, but I also work full time, and it's wearing me down a bit. The dean has also decided not to renew anyone past 8 years (even though new students get double the funded writing time, and we're not grandfathered into that but expected to hold to the same timeline), so I'm unsure if I'll even have the option. It's a bit of a demoralizing situation to work under, and I'm sorry that I'm word vomiting all of that onto your happy post!",
              "author": "Quincy1785",
              "created": 1581993506,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fhxkkn1": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhxkkn1/",
      "text": "Why did it take so long? Was it worth it? Did you find anything conclusive?",
      "author": "TheStockyScholar",
      "created": 1581956477,
      "upvotes": 2,
      "replies": {
        "fhz34kg": {
          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhz34kg/",
          "text": "Well a combination of factors. I worked on heme protein spectroscopy, biological samples are generally difficult to work with. A year after starting my project my professor became a Dean at the university, so he had no time for his grad students (13). Basically, we had no mentor for that period of time and sort of had to wing it, this of course led to erroneous results in my methods and the data was not worth publishing. \n\nAfter that my PI suffered kidney problems for which he took leave (more than justified).\n\nLastly Hurricane Maria devastated our lab, we lost all our instruments. I had to switch my background from wetlab biophysics to computational which I knew nothing about. I was lucky enough to be able to use my wetlab data in conjunction with the computational. Thankfully the good people of Ann Arbor Michigan gave me some help with this! Plus, I discovered and fell in love with Linux and opensource programs…Thank you ORCA!",
          "author": "dreganxix",
          "created": 1581989772,
          "upvotes": 2,
          "replies": {
            "fhz3r1c": {
              "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhz3r1c/",
              "text": "Wow. That’s quite the journey!\n\nYou still got through it despite everything!!!! I’m so proud and honored to speak to you!\n\nI feel like I can do this too!",
              "author": "TheStockyScholar",
              "created": 1581990182,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fhxjmj4": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhxjmj4/",
      "text": "So how do you even economically survive for 9 years as a PhD student?",
      "author": "marqini",
      "created": 1581955871,
      "upvotes": 14,
      "replies": {
        "fhy5des": {
          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhy5des/",
          "text": "The same way as we survive for 5 or 6 years, just... longer?\n\nThe shitty stipend is fine as long as we don't have fancy tastes, don't like nice, new things, and don't have kids.",
          "author": "RagePoop",
          "created": 1581968924,
          "upvotes": 5,
          "replies": {}
        },
        "fhz1nip": {
          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhz1nip/",
          "text": "The first 5 year I had funds from the SLOAN program and assistant stipend as a lab instructor. After that I worked as a science communicator for the university performing STEM shows and outreach at public school, very time consuming but it got me paid. An lastly I took a massive load to get through the final 2 years.",
          "author": "dreganxix",
          "created": 1581988810,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fhxanr3": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhxanr3/",
      "text": "Congratulations!!",
      "author": "memsies",
      "created": 1581949649,
      "upvotes": 3,
      "replies": {}
    },
    "fhx4ruo": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhx4ruo/",
      "text": "Congratulations mate)",
      "author": "RandomEloquentNerd",
      "created": 1581944553,
      "upvotes": 3,
      "replies": {}
    },
    "fhwsr32": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwsr32/",
      "text": "Congrats!",
      "author": "ZeroHealth",
      "created": 1581928411,
      "upvotes": 3,
      "replies": {}
    },
    "fhwrm20": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwrm20/",
      "text": "Congratulations!",
      "author": "congtrunhanchia",
      "created": 1581926867,
      "upvotes": 4,
      "replies": {}
    },
    "fhwph83": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwph83/",
      "text": "Yay. Im your 100th like and 10th comment. Oh alsO, CONGRATULATIONS !!",
      "author": "544delta",
      "created": 1581924171,
      "upvotes": 3,
      "replies": {}
    },
    "fhwowyj": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwowyj/",
      "text": "Same. It took me 4 years and so much mental anguish to get my masters. All my PI's masters students take 3 to 4 years graduating with just one chapter and he's like \"my students always take so long? And none of them ever follow through with more than one chapter!!!!!\" as if he is confused as to why. But HE IS THE COMMON DENOMINATOR.",
      "author": "BlueManatee21",
      "created": 1581923504,
      "upvotes": 40,
      "replies": {}
    },
    "fhwovfa": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwovfa/",
      "text": "Congrats!",
      "author": "Alector87",
      "created": 1581923453,
      "upvotes": 3,
      "replies": {}
    },
    "fhwn9vy": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwn9vy/",
      "text": "I feel like at this point theres an entire book to write just from this sub on how to be a better PI. A group of post-grads need to write it. Pass it out to PI's everywhere for free as long as they read it... and give a 15 page review.",
      "author": "Snowpossum",
      "created": 1581921653,
      "upvotes": 44,
      "replies": {}
    },
    "fhwmxu8": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwmxu8/",
      "text": "Congratulations",
      "author": "hakushuku1",
      "created": 1581921285,
      "upvotes": 4,
      "replies": {}
    },
    "fhwmvku": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwmvku/",
      "text": "Congrats!",
      "author": "Sukkor",
      "created": 1581921214,
      "upvotes": 5,
      "replies": {}
    },
    "fhwlauv": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwlauv/",
      "text": "[deleted]",
      "author": null,
      "created": 1581919567,
      "upvotes": -11,
      "replies": {
        "fhwrb6x": {
          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwrb6x/",
          "text": "In some countries, depending on your topic, you could probably squeeze them all into 9 years. \n\nIn North America, undergrad is 4-5 years,(2-3 years in most other places), masters is usually about 2 years (1-2 in other places) and phds everywhere can take any amount of time.",
          "author": "metashmeta",
          "created": 1581926470,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fhwg3oc": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwg3oc/",
      "text": "Jealous but congrats! I was so naive when I started and brushed off stories that I heard about the anxiety and self doubt of going through a PhD program. I just assumed it’s like a second MA/MS but a bit more rigorous. But it’s not the same and that’s a major accomplishment on your part. \n\nSo congrats again!",
      "author": "New_Hawaialawan",
      "created": 1581914806,
      "upvotes": 60,
      "replies": {
        "fhx6lz5": {
          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhx6lz5/",
          "text": "If you don’t mind me asking, what is so different about it?",
          "author": "tbh-im-a-loser",
          "created": 1581946292,
          "upvotes": 9,
          "replies": {
            "fhx8lac": {
              "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhx8lac/",
              "text": "Not OP, but in my personal experience the difference has been a lot like the difference between a MS and BS, but to a greater degree. So much more expected independence, more responsibility, more demand to think for yourself, solve your own problems, initiate your own research/writing/funding, and much more leadership and training in the lab.",
              "author": "jethvader",
              "created": 1581947987,
              "upvotes": 26,
              "replies": {
                "fhxau5w": {
                  "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhxau5w/",
                  "text": "Thanks for the reply and insight!",
                  "author": "tbh-im-a-loser",
                  "created": 1581949784,
                  "upvotes": 2,
                  "replies": {
                    "fhxy94j": {
                      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhxy94j/",
                      "text": "Yes all of what that person said is true and the entire process seemed much less structured and clear than an MA/MS program. It can be disorienting especially for first generation university students. Consequently, the imposter syndrome is also more common in a PhD program. There seems to be more uncertainty as well, particularly after you become ABD and finish fieldwork or research and begin nearing the end of the program.\n\nPersonally, I don’t regret it and I do enjoy it overall. But I’ve been dealing with anxiety the past few months and I am typically not an anxious person. \n\nOh yea, one important thing. It is more difficult to have relationships, SO and start a family (if that’s something you wanted to do). Honestly, I have only seen my parents and sister 3 times since 2013 let alone settle down with someone. I am in a relationship now and we imagine a future together but logistically it is super challenging because I have no idea where I’ll end up after I graduate.   \n\nActually writing this just now made me realize much of my anxiety has to do with the impact the program has on my personal life. Although there is still a bit of imposter syndrome. I hope I don’t come across too negative because there are some amazing aspects to this whole process too.",
                      "author": "New_Hawaialawan",
                      "created": 1581964781,
                      "upvotes": 6,
                      "replies": {
                        "fhykw0r": {
                          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhykw0r/",
                          "text": "What field is your program in? I found that during my MS, I had lots of freedom but also found that my program handbook provided me with some structure so that I could formulate my own timeline to finish.\n\nThis has worked for me and I am hoping to have my thesis finished early. However, I don’t deny that I was extremely lucky to have great advisors. As a first generation student I definitely felt the imposter syndrome and still do. \n\nWhen I look at PhD handbooks, the structure seems very similar to what I experienced during my MS. I did jump onto every opportunity to teach, get involved in research, and audit courses though. I’m not sure if this is field, school, or program specific. I am in STEM for reference.",
                          "author": "tbh-im-a-loser",
                          "created": 1581978017,
                          "upvotes": 3,
                          "replies": {
                            "fhzh4eq": {
                              "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhzh4eq/",
                              "text": "I year you about imposter syndrome as a first generation student. Some people might scoff about the affect it has on a student but it can be real (simply not having point of references in your own family on what to do). I started my MA in 2013 and finished by 2015. So that wasn’t the problem. There was structure and I also had and still have an amazing advisor. \n\nMy field is in social sciences (human geography). In social sciences and especially human geography it is very common to conduct fieldwork which is often abroad on your own gathering data. The methodology varies but usually includes some sort of interviews etc. My fieldwork is in Southeast Asia and East Asia and my research plan was to stay for 1 year. I sort of made a life here and decided to stay longer while I begin writing. I haven’t been back to my country (USA) since November 2017. Maybe that’s part of the problem for me.\n\nSo you are probably right about your PhD program being structured and mine also was fairly structured up until the point I became ABD. Complete course requirements, create a committee (slightly uncomfortable for someone without a professional background but still not bad), pass comprehensive exams, proposal, proposal defense then go to the field. \n\nEverything was very smooth for me until I hit the field and I became very uncertain of what I was doing which I think is common. Also, my background was in history so this was a different methodology for me. I think I finally realized I was on the right path collecting data. Now I’m just overwhelmed about dissertation. I think I’m a fairly decent writer and I already have several publications. But for some reason I am falling behind schedule for the first time.\n\nAnyway, sorry for the rant hopefully this is hopeful. Long story short I am social science background and my PhD program was fairly structured up until the fieldwork phase or maybe even the comprehensive exam phase.",
                              "author": "New_Hawaialawan",
                              "created": 1581999386,
                              "upvotes": 2,
                              "replies": {
                                "fi12sbh": {
                                  "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fi12sbh/",
                                  "text": "I completely agree. I’m wondering if it could be that in the social sciences or humanities where it may feel a bit less structured than in the sciences. In the sciences, a lot of the methodological groundwork has been laid out (unless you are going to be a methods specialist) and there are lots of step by step references that you can use to get to where you need to be. \n\nI am in a field where it is not even required to collect your own data for your dissertation so that definitely speeds up the process and provides even more structure (you only have so many ways to analyze certain types of data). I know the humanities and social sciences get a lot of flak but I honestly commend you all because it seems increasingly difficult to navigate a CRAZY amount of dense literature to even begin to focus in on your topic of interest. Even once you identify a dissertation topic, having to go out and collect data on your own seems even more difficult. I can see how this can get confusing very fast - even with supportive advisors. But you’ll get through it! You wouldn’t be in the program if you didn’t have that potential!",
                                  "author": "tbh-im-a-loser",
                                  "created": 1582049482,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fhy4khj": {
                  "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhy4khj/",
                  "text": "Sounds like what I am doing in my masters -my PI isnt doing anything actually to my research methods",
                  "author": "articlesarestupid",
                  "created": 1581968442,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fhwfy5u": {
      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwfy5u/",
      "text": "[deleted]",
      "author": null,
      "created": 1581914684,
      "upvotes": 118,
      "replies": {
        "fhwlagt": {
          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwlagt/",
          "text": "Don't let your students take 9 years to finish.",
          "author": "iamiamwhoami",
          "created": 1581919556,
          "upvotes": 271,
          "replies": {
            "fhwsp40": {
              "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwsp40/",
              "text": "[deleted]",
              "author": null,
              "created": 1581928337,
              "upvotes": 24,
              "replies": {
                "fhwszbm": {
                  "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhwszbm/",
                  "text": "^ How to be a bad PI",
                  "author": "ZeroHealth",
                  "created": 1581928720,
                  "upvotes": 68,
                  "replies": {
                    "fhx4akd": {
                      "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhx4akd/",
                      "text": "Technically correct - still not a mediocre PI",
                      "author": "Lightning1798",
                      "created": 1581944070,
                      "upvotes": 37,
                      "replies": {
                        "fhx8ibl": {
                          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhx8ibl/",
                          "text": "Touché",
                          "author": "ZeroHealth",
                          "created": 1581947918,
                          "upvotes": 8,
                          "replies": {}
                        },
                        "fhy2i0d": {
                          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhy2i0d/",
                          "text": "\"Technically correct; the best kind of correct.\"",
                          "author": "well---actually",
                          "created": 1581967189,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fhynb8m": {
                  "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhynb8m/",
                  "text": "I know you're making a joke, but part of being a good PI is to let students go if they can't hack it. Not saying that's the case with OP, or that it would come out of the blue, but not everyone is able to succeed at everything.",
                  "author": "DenseSkin",
                  "created": 1581979499,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "fhz9hex": {
          "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fhz9hex/",
          "text": "Some of my takeaway:\n\n1.  You are responsible for keeping your lab funded, not your students.\n2. When lab instruments malfunction hire a technician, don’t expect your students to magically fix it.\n3. Realize your limitations, only take in so many grad students.\n4. Dedicate time to guide your students, it is your job.\n5. Provide constructive criticism. If you don’t like something about your students work, tell them alternatives on how to make it better. Don’t expect them to magically figure it out.\n6. Don't get involved in politics while having grad students.\n\nOnly the most important from my experience.",
          "author": "dreganxix",
          "created": 1581993949,
          "upvotes": 5,
          "replies": {
            "fi143ph": {
              "link": "/r/GradSchool/comments/f52utf/after_9_year_finally_got_my_phd_biggest_takeaway/fi143ph/",
              "text": "I'd ask you if you were in my lab but we haven't graduated anyone yet.",
              "author": "DanioMasher",
              "created": 1582050220,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634066273
}