{
  "sid": "q30n0o",
  "link": "/r/GradSchool/comments/q30n0o/looking_for_guidance_in_my_search_for_a_masters/",
  "title:": "Looking for guidance in my search for a master's degree.",
  "text": "Hey Everyone, \n\nI'm in my 4th year of my Undergrad (Biomedical Sciences) at the University of Ottawa and am currently looking to apply to graduate programs ideally a M.Sc. My final goal is more on the industry side of Science, potentially becoming a Research Scientist of sorts. Given this, I wanted to choose a master's program that would be able to prepare me for a job in the industry whilst being more research-based as opposed to course-heavy. From this, I have looked into potentially pursuing a master's of science with a specialization in biotechnology or bioinformatics as this would allow me to pursue research in molecular and cellular science whilst also preparing me for industry jobs. from here I have some programs that interest me such as the following;\n\nMASTER OF SCIENCE IN GENOME SCIENCE AND TECHNOLOGY (UBC)\n\n[https://www.grad.ubc.ca/prospective-students/graduate-degree-programs/master-of-science-genome-science-technology](https://www.grad.ubc.ca/prospective-students/graduate-degree-programs/master-of-science-genome-science-technology)\n\n**Master of Biotechnology(Guelph)**\n\n[http://www.uoguelph.ca/mbiotech/program](http://www.uoguelph.ca/mbiotech/program)\n\nMaster of Science Cellular and Molecular Medicine Specialization in Bioinformatics (University of Ottawa)\n\n[https://catalogue.uottawa.ca/en/graduate/master-science-cellular-molecular-medicine-specialization-bioinformatics/](https://catalogue.uottawa.ca/en/graduate/master-science-cellular-molecular-medicine-specialization-bioinformatics/)\n\nThe main question I have here is I was wondering if this kind of thinking is sound, mostly with respect using this [M.Sc](https://M.Sc) in my attempt to acquire a job in industry as a scientist. I was also wondering if people have gone through something similar as I and potentially has suggestions regarding program choice or maybe introduce me to other programs that may fulfill my needs and desires to a greater degree. I feel this lingering fear that what I choose will not be the best option for my goals and I understand that this is probably a sentiment shared by everyone pursuing a graduate study, nonetheless, any assistance I will gladly take and if there is any clarification needed I will gladly provide.",
  "author": "Nikovol",
  "created": 1633578582,
  "updated": 1634099863,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hfp6vdx": {
      "link": "/r/GradSchool/comments/q30n0o/looking_for_guidance_in_my_search_for_a_masters/hfp6vdx/",
      "text": "What's the most enjoyable course you've had in your undergrad? was it more of a wetlab or a dry one? I'd start from there. Also,based solely on my opinion, having a good PI/professor/advisor is much more important than the university/program rank, assuming that you're doing master's thesis. If it's a course-based master's, Look into their list of courses and see which one interest you the most.    As for your goal to work in an industry, I wouldn't stressed too much about it. I graduated with a master in entomology and ended up in a pharmaceutical company researching vaccines, lol. As long as you are able to showcase the skills you will get during your master's to potential employers, I think you'll do just fine. Good luck!",
      "author": "ashpokechu",
      "created": 1633586916,
      "upvotes": 1,
      "replies": {
        "hfprshu": {
          "link": "/r/GradSchool/comments/q30n0o/looking_for_guidance_in_my_search_for_a_masters/hfprshu/",
          "text": "Thanks so much for the reply, so I have a preference for wet lab work, how would I use this to narrow down my search, the websites for these masters don’t seem to decipher the work itself or would this a factor when I am looking into labs I want to pursue the masters in?",
          "author": "Nikovol",
          "created": 1633605407,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}