{
  "sid": "pw74cv",
  "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/",
  "title:": "What to wear at a conference (first in-person one)",
  "text": "Hi all, I’m attending a biotech conference and presenting my work there too, and idk what to wear. I don’t have dress shoes so I’m gonna wear my Doc Martens (they’re plain black with white soles), with wide black dress pants to cover them, and idk what for the top. Do I need a blazer? Am I fine with just a simple button-up? What bag do I carry (I only have a tote bag with my PhD program logo on it)?",
  "author": "nietzschesoptimism",
  "created": 1632707015,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.92,
  "comments": {
    "hehks00": {
      "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/hehks00/",
      "text": "My advisor told me that if I was just chilling in the audience I would be ok with jeans and school/program related shirts or a polo level. When I presented I wore dress everything - minus a jacket. \n\nJust make sure you look nice in whatever you’re wearing and you should be good. Enjoy!",
      "author": "Pikalover10",
      "created": 1632759956,
      "upvotes": 3,
      "replies": {
        "hehyy44": {
          "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/hehyy44/",
          "text": "im presenting so imma just wear a button-up nice shirt, with dress pants and my Docs. i'm only there for like one day (presenting, going to exhibition halls, then flying back home lol). if i were just an attendee i'd wear khakis and a polo, or a program-related formal shirt (of which i have none... we're getting ours in the spring lmao)",
          "author": "nietzschesoptimism",
          "created": 1632766519,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hegx195": {
      "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/hegx195/",
      "text": "Wow, you are presenting, a podium presentation? If so I would say a suit and tie. Look you are interacting with peers and your seniors who will eventually be hiring you. Science, biotech is pretty big on formality during presentations....Want to work for a big pharma? small pharma...you want to look professional. Doc Martins? I look at shoes when meet someone...that's not gonna go over well. Dressing up shows you care about your work and respect the people you are meeting.\n\nIf it's just a poster you can get away with business casual but most dress it up a bit with a sport coat at least.\n\nWow, I've read some of the posts on here. .....simply wow. I'd be willing to PM with you. Wow....I'm simply stunned. \n\nRemember, you are meeting people who are gonna hire you eventually. Executives and group leaders are older. Your name is going out there someday on a resume....remember that.\n\nDoc martins? you can get some dress shoes at Khols for 35 bucks dude.",
      "author": "rthomas10",
      "created": 1632749611,
      "upvotes": -3,
      "replies": {
        "hehzgq4": {
          "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/hehzgq4/",
          "text": "i am a 21 year old first year phd student who doesn't know wtf she's doing with her life... but i go to a T3 so... also im not looking for jobs or anything yet till i know wtf i'm choosing for my dissertation topic, and even then teaching sounds more fun than industry tbh :)\n\n&#x200B;\n\nalso re: docs, tell that to like five professors from my ugrad who are top scientists in their fields and show up to conferences and class in straight-up hiking boots and docs lmao (even more so here at Cal)",
          "author": "nietzschesoptimism",
          "created": 1632766755,
          "upvotes": 2,
          "replies": {
            "hei6lcj": {
              "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/hei6lcj/",
              "text": "Berkeley? That explains a lot. Any other UC and we would be a bit more formal. You never ever get a second chance to make a good first impression. Trust me. But, you asked for advice. If you take it or not is your prerogative. Profs don't have to make a first impression if they already have tenure. You don't, and you do. Perhaps ask you doc wearing profs for advice?",
              "author": "rthomas10",
              "created": 1632769986,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "hegdok2": {
      "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/hegdok2/",
      "text": "I second looking at pictures online. I usually check Facebook, LinkedIn, or the conference’s website for what people wore previously and then match that in my own style. A nice blazer can take an outfit up a notch if you feel too casual but can also be stashed in one of those free tote bags if you feel overdressed.",
      "author": "bitch-et-al",
      "created": 1632737281,
      "upvotes": 1,
      "replies": {}
    },
    "hefs5tq": {
      "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/hefs5tq/",
      "text": "I usually wear shorts and sneakers, if I was giving a talk maybe dress up and throw on a collard shirt, otherwise plain/no text tshirt. I was/am on the underdress extreme side though. In the end no one cares, it just comes down to the research you're presenting.\n\nHonestly even if you want to be fancy, a blazer is overkill (unless maybe you're giving a keynote). Would be pretty bad ass mix with the Doc Martins though.",
      "author": "HappyHrHero",
      "created": 1632718405,
      "upvotes": 1,
      "replies": {}
    },
    "hefpgxq": {
      "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/hefpgxq/",
      "text": "Do you know anyone who has attended the same conference before who could weigh in? If not, my advice is always to bring stuff that can be mixed and matched to fit the overall vibe of the other attendees once you get there. \n\nSo, if I'm guessing correctly that you present female (my apologies if not; just let me know!), you can use a dress shirt and those dress pants as your \"base\" outfit, and pack things like a blazer, cardigan, or scarf to switch things up as needed. That said, I think a blazer is overkill unless you are an invited speaker in one of the major sessions. I personally like to pack two different pairs of slacks, one black and one grey or khaki, because slacks are easy to pack (esp. compared to most tops) and switching in or out black slacks seems to be a really easy way to dress up or down an outfit. \n\nFor bags, a generic school backpack is pretty common at conferences, even with people wearing full suits. Depending on the hotel situation, you might expect to be lugging around your laptop and/or a tablet all day and be picking up random swag, so anything one-shoulder can get really annoying and tiring. A laptop bag that can be carried cross-body is another decent option.",
      "author": "aggressive-teaspoon",
      "created": 1632716614,
      "upvotes": 2,
      "replies": {}
    },
    "hefo2k1": {
      "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/hefo2k1/",
      "text": "Depends on your field. You should ask your advisor. My field is intentionally hyper casual. The more casual the better. Not something I would have guessed unless my advisor told me.",
      "author": "spacefurl",
      "created": 1632715732,
      "upvotes": 9,
      "replies": {
        "hefu9dn": {
          "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/hefu9dn/",
          "text": "Good point, in bioengineering being dressed is the norm except for like Industry ppl. I guess imma just wear a simple button up and that’s it",
          "author": "nietzschesoptimism",
          "created": 1632719879,
          "upvotes": 2,
          "replies": {
            "heg3yy8": {
              "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/heg3yy8/",
              "text": "What I did to figure out what to wear was look at past photos from previous conferences posted online. I am so glad I did because I was envisioning a very formal outfit to wear... and then I looked at past photos and saw people in khaki shorts and flip flops....",
              "author": "Possible_Emphasis_67",
              "created": 1632727235,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "hefh9yw": {
      "link": "/r/GradSchool/comments/pw74cv/what_to_wear_at_a_conference_first_inperson_one/hefh9yw/",
      "text": "Doc martins are hot",
      "author": "helloitsme1011",
      "created": 1632711954,
      "upvotes": -4,
      "replies": {}
    }
  },
  "updated": 1634065716
}