{
  "sid": "8x8hmu",
  "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/",
  "title:": "Here's a list of stuff that's worked for me in grad school. What's kept you sane?",
  "text": "I was making a guide for a friend starting grad school, and I thought some of my advice might be useful. I'm going into my fourth year, so I was thinking it might help some people going into their first years now. I'm sure more of it is specific to me and my field than I realize (I lean qual and I don't have a lab). However, I'd love for people to add on and help each other out. A lot of times, grad school is one of those experiences without a handbook, so maybe this will improve someone's well being while here.\n\nGeneral Philosophy:\n\n1. **Trust your capabilities, not your knowledge.** You are a capable person who will get through grad school and do what you need to do. You do not, however, know everything. There is an overwhelming amount of things you will never know. Don’t fret about it. Especially in the beginning of grad school, it is far better to admit what you don’t know than pretend to know it. It’s okay to be wrong, too. Expertise will come naturally. You will suddenly have a huge amount of knowledge on an esoteric topic because you’ve worked to do so. You’ve got this, and will continue to have it. I think this mindset is one of the reasons I’ve avoided the dreaded imposter syndrome (it also really helps that I have good advisors, I don’t care what people think about me, and I’ve faced all lot of adversity). Just because you don’t know how to do something or don’t know something yet doesn’t mean you can’t handle it.\n2. **Do not compete.** Everyone comes to grad school with vastly different academic backgrounds, levels of maturity, levels of financial support, and skills. Each person will specialize enough (hopefully?) that you do not have to compete with people in your program. Be genuinely happy for their successes. Share tips on how you got yours. You are not in grad school to win it. (Full disclosure: everyone in my department is fully funded. This may not be the case in places where people compete for funding).\n3. **A healthy amount of caring is good.** Your mental health is more important than a course assignment. Your article will never be perfect. Not everyone will like you. If you don’t have a good amount of distance from grad school, you won’t be able to grow. You should work hard and believe in your work, but not be so attached you can’t take criticism, for example. I feel like I don’t care about 15% and this works for me.\n4. **Be deliberate.** Each choice in grad school is a strategic one to get a career later. In my case, I go to a ton of professionalization seminars, try to hit two conferences a year, and got a certificate in a related field to try to be open to jobs. Your choices should help you further your career because grad school is a job. It’s okay to mess up, but this mentality will help you later.\n5. **Be nice.** Be nice to everyone. You never know who talks to whom. Office staff usually have a lot of intel about grad students. A faculty member you don’t work with might put in a good word. It’s very possible there will be a couple of individuals you don’t like and cannot interact well with (I have two). My advice is to avoid them, and engage politely when need be. When I came to grad school, I had no money and couldn’t afford new clothes until about 6 months in. There were a few people who made rude comments about it. It was entirely unnecessary, and brought me way more stress than I needed. Don’t be that guy.\n6. **Create boundaries.** Some people are very strict with this, like only working 9-5 or not checking emails on the weekend. I do this more on the fly by prioritizing stuff I need to do outside of work. This is much easier to do once you’re no longer taking courses, and depends on your boss.\n7. **Remember why you’re here.** I think everyone has at least one moment where they wonder if should drop out. My most significant one was my first year. I have dyslexia, and when I had a typo on a draft, a senior faculty told me to drop out because I would never learn how to spell. My mentors talked me out of it. I am here because I like the aspects of what I want to do and think my work is important. \n8. **It’s okay if stuff changes.** It’s totally fine if your interests change. You may not do a dissertation on what you came in to do. It’s okay if your priorities shift. I actually gained a fair amount of weight my first two years of grad school because I was food secure and I sat a lot. I wasn’t worried; a lot of the conditions of graduate school are not permanent.\n9. **Be able to explain what you do and why it’s important.** Elevator pitches are really emphasized in my department. One instance on the way back from a conference a border patrol official asked me what I studied, and I was able to answer in one sentence. People want to be interested in your work without hearing everything you’ve ever done. You’ll also be married to a topic for a while at a certain point, so make sure you like it, and make sure you know why other people should care.\n10. **If you feel like complaining, channel it.** I don’t like a bunch of the policies at my institution. I also don’t think grad students are treated particularly well. I joined the grad student government and helped advocate directly to officials so I would feel so powerless. That might be an approach that’s specific to me, though. Activism, mentorship, and other avenues might be more appropriate.\n\nMentorship:\n\n1. **Always ask.** Always ask about opportunities. This can be anything from fellowships to working with faculty to co-authorship to reading a draft. The worst someone can do is say no. This is not a good job for someone who cannot handle rejection.\n2. **Have more than one mentor.** Your advisor should be the captain of the ship, but it’s good to have other people to lean on and learn from. You will have to build a committee after all. Plus, advisors are not infallible.\n3. **Find mentors that care about you as a person.** This is a best case scenario. You want a mentor that will go to bat for you. You want one who looks out for you and asks how you're doing. My mentors have invited me to holidays and got my mom a doctor. I always came from a low income background, so having mentors help me navigate that was crucial.\n4. **Find more advanced students.** Some of them will have very good, specific advice. A lot of them want to pass on their wisdom. Take this with a grain of salt, however. For example, I had a scandal in my department, so everyone who started the program before it had a very different experience than I did.\n\nTime management:\n\n1. **The matrix.** I got this from my advisor, who is good at time management. Sort your tasks into four quadrants like so:\n\nImportant and Urgent | Important But Not Urgent\n---|---\nUrgent But Not Important| Neither Important Nor Urgent\n\nDo box 1 first, and do box 4 last. 2 and 3 are more judgment calls. This stops me from checking my email 400 times instead of actually making a deadline.\n\n2. (not sure why this is showing up as 1, it should be 2). **Use a to-do list.** I use an app called Habitica because I like that it gives me daily and long term goals (also I earn cute digital animals, which is an incentive for me). Some people write them. Mapping out what you actually need to do ensures you know it, even if you don’t want to do it.\n3. **Allow yourself to do other things.** Studies show that people who intend to work for hours uninterrupted do not do as well as those who schedule breaks. Have lunch with other grad students. Go to that job talk. The ability to show up is provided you can spare the time, but generally you have more time than you think you do, unless you’re hitting a deadline.\n\nReading:\n\n1. **Reading is easier than not.** It is easier to have read and know things in a course, for example, than to pretend you know things. If you’re meeting an academic, it’s easier to have read some of their articles than to vaguely know what they’ve done. Reading is a part of your job at this point. That being said...\n2. **Don’t read everything closely.** Not everything will be of use to you. Focus on works in your subjects. If you need to skim, read the introductions and conclusions. Read the first and last sentences. Read enough to comprehend.\n3. **Sometimes you only have time for an abstract.** As I’ve mentioned before, sometimes there’s just too much knowledge to know. Sometimes you don’t have access to the full article. Sometimes you don’t need to know the methods, just the conclusions.\n4. **Pomodoro.** I use the Pomodoro method, which is 25 minutes on and 5 minutes off. This helps me quantify work I’ve done and makes me feel more accomplished. It also ensures I don’t rush the end of pieces. I was messing up my back from sitting for long periods of time, so this forces me to get up periodically.\n\nWriting:\n\n1. **Actually write everything down.** Do you know how many times I’ve had a good idea while I’m in the shower and I think I’ll remember it and then I really don’t? It’s an embarrassing amount of times. You won’t always remember. I remedy this by having a word vomit document for each project.\n2. **Write 30 minutes a day.** Some days you won’t make it, and that’s okay. However, most days you can fit that much, and you’ll feel better about days you can fit more.\n3. **Track your writing.** It will show you how much your actually working and what work you’ve done that day. It was cool to know my master thesis took 65 hours of dedicated writing (not including data collection and analysis).\n4. **Start writing term papers over breaks.** This one is a no-brainer. Breaks are not for relaxing in grad school, or at least not fully. Getting ahead is easier than trying to crank out 15-25 pages (about the normal length in my field) for three classes while grading finals.\n5. **Use resources.** There’s no shame in wanting to improve your writing; in fact, it’s part of your job. Looking for help is not a problem. Start a writing group with some friends. Go to the writing center. Read books on style. Get a software like Grammarly. Don’t be embarrassed for trying to grow.\n\nEdit: I'm so glad this blew up! So much good advice in the comments. I feel like helping each other is really what this community's about.\n",
  "author": "hillary511",
  "created": 1531113416,
  "over_18": false,
  "upvotes": 478,
  "upvote_ratio": 0.99,
  "comments": {
    "ebwqffo": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/ebwqffo/",
      "text": "Regarding the Grammarly suggestion, [here](https://www.quora.com/Are-there-any-free-alternatives-to-Grammarly-software/answer/Foad-S-Farimani?ch=2&srid=iETG) I have listed Free and Open Source alternatives. ",
      "author": "foadsf",
      "created": 1544968337,
      "upvotes": 2,
      "replies": {
        "ebx62g9": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/ebx62g9/",
          "text": "This is really helpful, thanks! Do you know any way to run Quoll Writer on a mac?",
          "author": "hillary511",
          "created": 1544982792,
          "upvotes": 2,
          "replies": {
            "ebx6d9o": {
              "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/ebx6d9o/",
              "text": "no unfortunately. for the moment only windows",
              "author": "foadsf",
              "created": 1544982994,
              "upvotes": 2,
              "replies": {
                "ebx6fg5": {
                  "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/ebx6fg5/",
                  "text": "Bummer, it looked like a really good fit for me. I might try manusskript in the meantime.",
                  "author": "hillary511",
                  "created": 1544983035,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e32k22u": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e32k22u/",
      "text": "This is so incredible. I am helping coordinate a graduate school bridge-program at my university in 2 weeks and I plan to print this out and give it to every single student. Seriously, thank you. ",
      "author": "Brady4524",
      "created": 1532615884,
      "upvotes": 2,
      "replies": {
        "e32tglr": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e32tglr/",
          "text": "I'm glad I could help!",
          "author": "hillary511",
          "created": 1532623725,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e2l3lvq": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e2l3lvq/",
      "text": "Thank youuuuuuu. This is legit ",
      "author": "frickenfire",
      "created": 1531888249,
      "upvotes": 2,
      "replies": {}
    },
    "e2j5vod": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e2j5vod/",
      "text": "THANK YOU SO MUCH!!! This stuff doesn’t just apply to grad students but basically to any aspect of life. I will save this post and actually copy and put this into a word document and get the essentials out too. I’m going to purchase a whiteboard so that I can’t make the four sector table. I really do appreciate this detailed post and I hope you have a wonderful day :) be sure to keep in touch with us all ",
      "author": "mrdtek",
      "created": 1531817920,
      "upvotes": 3,
      "replies": {
        "e2jxn7n": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e2jxn7n/",
          "text": "I'm so glad it helped you!",
          "author": "hillary511",
          "created": 1531849230,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e259578": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e259578/",
      "text": "I have one to add that has been key in my 6 years of PhD work. \n\nMake friends with other grad students outside of your department. I was part of grad student unionization efforts on my campus, which had me running around every department talking to an array of people. From this, I found that we all feel less than our position, but love what we do. Seeing passion in something totally unrelated from your field is wildly inspiring. \n\nAlso, they make amazing drinking buddies on a weekday night. ",
      "author": "phosphodiesters666",
      "created": 1531250315,
      "upvotes": 2,
      "replies": {
        "e2595g6": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e2595g6/",
          "text": "Is this a... what day is this?",
          "author": "BigLebowskiBot",
          "created": 1531250321,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e250tn7": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e250tn7/",
      "text": "Thank you! This is really helpful. I'm starting a program this fall and this is helping me to feel a little less overwhelmed. 😊",
      "author": "samanthasharxn",
      "created": 1531243882,
      "upvotes": 2,
      "replies": {}
    },
    "e24cb6w": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e24cb6w/",
      "text": "This is really great. Thank you for taking time to write it. :)",
      "author": "timemachinedreams",
      "created": 1531220797,
      "upvotes": 2,
      "replies": {}
    },
    "e241iv7": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e241iv7/",
      "text": "Great advice, but I actually disagree with this one to some degree:\n\n>4. Breaks are not for relaxing in grad school, or at least not fully.\n\nA real solid break where you spend at least a week not working on any grad school is very important to do once or twice a year for avoiding burnout. It will hopefully re-energize and reinvigorate you so that you come back optimistic and determined. That break may not be spring break or winter break, but very few truly don't have at least a week to spare at the beginning or end of the summer. If that is the case you probably need better time management. \n\nA week chilling at home is great if you're low on funds, but consider getting away if you can. Booking a train, plane or bus ride or somehow making difficult to break plans helps ensure you don't keep pushing your break off indefinitely. \n",
      "author": "WhoThrewPoo",
      "created": 1531201785,
      "upvotes": 2,
      "replies": {
        "e24vqtj": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e24vqtj/",
          "text": "I don't think I disagree with you because I should have specified spring and fall breaks. I totally agree that I avoid burn out by not doing anything about 2 weeks out of the year.",
          "author": "hillary511",
          "created": 1531240002,
          "upvotes": 3,
          "replies": {
            "e2510tw": {
              "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e2510tw/",
              "text": "Thanks for clarifying! A clarification of my own: \"You probably need better time management\" wasn't directed at you, just the generic reader. I realized it could be construed as passing judgement on hillary511 specifically, which wasn't the intent.",
              "author": "WhoThrewPoo",
              "created": 1531244035,
              "upvotes": 1,
              "replies": {
                "e254grj": {
                  "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e254grj/",
                  "text": "No worries, I don't usually take stuff personally. Part of staying sane in grad school.",
                  "author": "hillary511",
                  "created": 1531246716,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e23yowd": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e23yowd/",
      "text": "excellent!",
      "author": "tah_infity_n_beyarnd",
      "created": 1531198186,
      "upvotes": 2,
      "replies": {}
    },
    "e22ywls": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22ywls/",
      "text": "My drinking didn't increase though... it was just displaced to other areas :) In our group of 8, two didn't drink. The point was just creating a space to connect, which is helped by creating a new tradition of \"lets hang out after this class that requires to read one book and 4 articles every week\". Squash is good too, but we became friends over pints first. Doesn't detract from your excellent and wise post.",
      "author": "real_legit_unicorn",
      "created": 1531169110,
      "upvotes": 2,
      "replies": {}
    },
    "e22xc1g": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22xc1g/",
      "text": "For professional programs in particular (just finished my MSLIS): don’t tie yourself down to what you think you want to do in the field. Be open to your interests and passion changing as you get more familiar with the discipline. ",
      "author": "dikunanna",
      "created": 1531167871,
      "upvotes": 4,
      "replies": {
        "e233sb5": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e233sb5/",
          "text": "Yes! For us, they caution us not to marry a method too early on.",
          "author": "hillary511",
          "created": 1531173127,
          "upvotes": 2,
          "replies": {}
        },
        "e2fyggg": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e2fyggg/",
          "text": "I'm starting my MSLIS this fall!!! Any advice or something you wish you knew/did? I'm going to IU btw",
          "author": "i-mad-eye",
          "created": 1531683619,
          "upvotes": 1,
          "replies": {
            "e2g69cr": {
              "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e2g69cr/",
              "text": "Congrats!!! I don’t know about IU but my school had a ton of practicums (practica?) and I wish I’d had time to do one. I was lucky enough to get a scholarship and work full time in a library though so I did get some experience—that’s for sure the most important thing! A bunch of people get their MSLIS without ever working in a library/archive/museum. Definitely do volunteer work or something to fill out your resume while you’re in school. And good luck!!!!",
              "author": "dikunanna",
              "created": 1531691392,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "e22rfpg": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22rfpg/",
      "text": "Thank you so much for helping and writing this. I'm just leaving to my program in two weeks and i am so terrified.",
      "author": "momoandi",
      "created": 1531163253,
      "upvotes": 2,
      "replies": {}
    },
    "e22qv4m": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22qv4m/",
      "text": "When you’re exhausted and frustrated, do simple self-care type things as a break from work. Take a walk around the block, eat an apple, play with your pet, text a friend or family member. Not only will these things help you come back to your work in a better state of mind, it will also keep you healthier in the long run.\n\nDon’t worry about people who claim to work insane 60-70 hour weeks after year one. They’re either lying, inefficient, or unhealthy. Don’t compare yourself to them.\n\nBe social with your cohort early. You’ll need each other’s support and it’s easier to give and receive if you know each other outside of the classroom/lab.\n\nRelevant to a point made in the original post: Make sure at least someone on your committee cares about you as a person. You will have a miserable thesis/dissertation time if your entire committee treats you as a research machine.",
      "author": "0712mb",
      "created": 1531162799,
      "upvotes": 6,
      "replies": {}
    },
    "e22plqp": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22plqp/",
      "text": ">Actually write everything down. Do you know how many times I’ve had a good idea while I’m in the shower and I think I’ll remember it and then I really don’t?\n\nI would add to this, use your voice recorder on your phone. Talk your ideas into your phone to save them. \n\nIf you use Google Docs, you can even write paragraphs of your ideas into Google Docs on your phone as speech-to-text.",
      "author": null,
      "created": 1531161805,
      "upvotes": 3,
      "replies": {}
    },
    "e22mm8s": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22mm8s/",
      "text": "1. BOUNDARIES.  Stop trying to be so damn helpful to everyone and instead start saying no to everything that isn't providing you direct, measurable value.\n2. Try to befriend your mentors, even if you don't like them very much.  This makes negotiation a lot easier.\n3. Do multiple hobbies.\n4. Get a side job for extra money and real experience, even if that slows down the graduate work.  Do it in something relevant to your next real job but is different from your grad school focus.  **This is more important than your grad school work.**  Your competition for jobs will all be fellow scientists/historians/whatever you went to school for, so doubling-down in the lab isn't going to differentiate you.  However, very few will be able to compete with your **actual, real world** job experience because they're too busy working on yet another lab project.  This doesn't apply if you're going for a post-doc, since post-doc positions are dime-a-dozen and not particularly competitive (sorry).",
      "author": null,
      "created": 1531159452,
      "upvotes": 3,
      "replies": {}
    },
    "e22i0a8": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22i0a8/",
      "text": "The \"healthy amount of caring\" point was my lifesaver during my Masters program. I was working full-time and going to school full-time. I actually learned about \"good enough\" through work. Many times, good enough and hitting your deadline is much better than perfection and extending your deadline. I extended this rule to school, and the amount of stress that lifted was amazing. Did I get an A on every assignment? No. Did I do good enough for my liking? More than enough.",
      "author": "scthoma4",
      "created": 1531155863,
      "upvotes": 3,
      "replies": {}
    },
    "e22hsos": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22hsos/",
      "text": "Wow! Great!",
      "author": "kudles",
      "created": 1531155698,
      "upvotes": 2,
      "replies": {}
    },
    "e22h33x": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22h33x/",
      "text": "I would add: be friends with your labmates. It is a lot easier to go to work when you look forward to seeing the people there.\n\nThey are often the only ones who can truly understand your struggles as they probably have the same ones. Invite them over, hang out, bring souvenirs (like candy) when you travel, ask if they're ok when they look stressed out, defend them in the seminars, actually look up their research and try to have a question or two when they present it. Be a rock, and you will have rocks when you need it. You're in this together.",
      "author": "zgarbas",
      "created": 1531155144,
      "upvotes": 9,
      "replies": {}
    },
    "e22gzyz": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22gzyz/",
      "text": "Thanks for this! Both OP and commenters",
      "author": "djhin2",
      "created": 1531155075,
      "upvotes": 3,
      "replies": {}
    },
    "e22d5vd": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22d5vd/",
      "text": "This is great! What do you use to track your writing? ",
      "author": "fucksubtlety",
      "created": 1531152015,
      "upvotes": 2,
      "replies": {
        "e22fuf1": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22fuf1/",
          "text": "I have a spreadsheet on my university's google doc where I put the date, amount of time spent, and what I actually did. I also use this to plan the next week ahead. I've found it's flexible enough for me.",
          "author": "hillary511",
          "created": 1531154167,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e228fdo": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e228fdo/",
      "text": "Great advice! As a senior student, I couldn't have said it better myself. \n\nI also got some good tips to implement into my own routine, thank you!",
      "author": "sogden24",
      "created": 1531148101,
      "upvotes": 2,
      "replies": {}
    },
    "e227ti9": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e227ti9/",
      "text": "> when I had a typo on a draft, a senior faculty told me to drop out because I would never learn how to spell.\n\nYour senior faculty is the one who should've resigned.",
      "author": null,
      "created": 1531147600,
      "upvotes": 24,
      "replies": {
        "e22fs04": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22fs04/",
          "text": "I regret not reporting her. It was my first semester, and she was one of the most famous people in the department. She retired shortly after. I now use it as an example of the type of thing that shouldn't happen.",
          "author": "hillary511",
          "created": 1531154114,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "e222n2e": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e222n2e/",
      "text": "All I've done is keep a hobby that gives visible results that I can look forward to doing; woodworking, hiking, musical instruments or something along those (low cost, ahem *stipend*) lines. \n\nMaintaining my creativity helps me see potential in my projects as a burgeoning scientist. Seeing the results of a hobby reminds me that I have the capability to realize that potential.",
      "author": null,
      "created": 1531142620,
      "upvotes": 8,
      "replies": {}
    },
    "e221q5a": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e221q5a/",
      "text": "Fantastic! Lots of good stuff in here. I'll add:\n\n**Your brain is part of your body, so exercise consistently.**\n\nNot only do I feel better physically when I exercise on a regular basis, I also think better. It's all intertwined. Plus, exercise is a truly effective way of dealing with moderate levels of depression/anxiety. ",
      "author": "CJP_UX",
      "created": 1531141596,
      "upvotes": 15,
      "replies": {}
    },
    "e220ofz": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e220ofz/",
      "text": "This is a great article, thank you. ",
      "author": "Bob_Ross_was_an_OG",
      "created": 1531140358,
      "upvotes": 2,
      "replies": {}
    },
    "e220llh": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e220llh/",
      "text": "Excellent advice, OP!\n\nI think the best realization I ever came to -- and this is as a former \"g&t\" kid who has always treated school as though it's the only thing in the world, and measured my happiness/self-worth by how well I did (not healthy) -- is that a PhD is **fundamentally different from school**.\n\nYes, it is *technically* school; however, that's surface-level. What a PhD is in spirit is training for a career. It is intense practice and education for how to be a competent, ethical, and independent conductor of research in a given field. Hopefully a successful one too, but YMMV. \n\nOnce you recognize this, life in the PhD gets much, much better:\n\n* Worrying over the difference between an A and an A- in a field seminar is so much less important than mastering the regression techniques and/or process tracing method you need to take your project from nascent idea to proven results. \n* Worrying that you're \"not working hard enough\" isn't a problem if you treat your PhD like a job and hold yourself accountable to regular, set hours. Exceptions of course come up, but if you get into that habit of working when you are yourself most productive, and then \"turning your brain off\" at other times to engage in partnership/a hobby/friends, you'll be so much happier. \n\nIn short, if you treat this like the professional experience it truly is, you'll come out the other side a professional. Or so they tell me. Fuck, I should be studying for comps. Don't listen to me, I'm just a dumb almost-ABD.",
      "author": "Jack-ums",
      "created": 1531140263,
      "upvotes": 13,
      "replies": {
        "e22fqlr": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22fqlr/",
          "text": "I totally agree. I think that thinking of this as a job and training is a much easier mindset to live under than a continuation of school.",
          "author": "hillary511",
          "created": 1531154081,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e21ytgi": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e21ytgi/",
      "text": "> The matrix. I got this from my advisor, who is good at time management. Sort your tasks into four quadrants like so:\n\naka [Eisenhower Matrix](https://en.wikipedia.org/wiki/Time_management#The_Eisenhower_Method) ",
      "author": "moombai",
      "created": 1531137934,
      "upvotes": 2,
      "replies": {
        "e22fsv5": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22fsv5/",
          "text": "You're right. I should've googled. My b.",
          "author": "hillary511",
          "created": 1531154133,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e21xmj1": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e21xmj1/",
      "text": "I may get criticized for this, but I'd add \"having a pint\". Yes, alcohol. With your colleagues. Not two pints, not three, not \"getting drunk\". Just set once a week and *hang out* with them, especially if you’re first year. They are going through the same thing as you, and you can't imagine how much of a stress reliever doing this can be. During our first year in my PhD program, a group of us started doing it. At the end of the same class, every week, we would head out to a nearby pub. To this day, we still have a pint once in a while (we are all fourth-year now). Lasting friendships were created this way and we continue to be each other's support system. This is actually what it’s all about. It’s a way to socialize, to support each other in our various experiences. It’s a place to talk about how this prof is a jerk or that prof is a really good resource for this or that. For us, in our second, third, fourth year, it became a place to talk about our sometimes difficult relationship with our supervisor, our thesis that is driving us crazy, our ideas about dropping out. And how do you make this happen? You don’t really know anyone in your class, you say? You take the lead and suggest it. None of you know each other yet; someone takes their courage and suggests it. Everybody will be like OMG YES I NEEDED THIS. Of course, some people don’t drink. This is what non-alcohol drinks were made for. Trust me, it works. It breaks the isolation. Everyone needs that, especially in that first make-it-or-break-it year.",
      "author": "real_legit_unicorn",
      "created": 1531136154,
      "upvotes": 40,
      "replies": {
        "e21zj3x": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e21zj3x/",
          "text": "This sounds lovely. I'll be starting my PhD this fall and I think something like this will be enormously helpful. Thank you! ",
          "author": "closet_activist",
          "created": 1531138904,
          "upvotes": 7,
          "replies": {}
        },
        "e22fnvq": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22fnvq/",
          "text": "So I didn't say anything about alcohol because I feel like in my department people either go one way or the other. Specifically, they either drink way more than before or way less. I'm in the less category in that I don't drink in grad school.\n\nThat being said, I'm pretty social with my cohort mates and other grad students, and I don't mind anyone drinking. I think the social aspects you're describing are integral to feeling a sense of belonging.",
          "author": "hillary511",
          "created": 1531154021,
          "upvotes": 5,
          "replies": {}
        },
        "e234vvj": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e234vvj/",
          "text": "Mental and social health are important! An advanced degree doesn't do much for you if you're a nutcase by the end of it.",
          "author": "soccerandpingpong",
          "created": 1531174064,
          "upvotes": 2,
          "replies": {}
        },
        "e32k9ae": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e32k9ae/",
          "text": "Yes! And don't be afraid to socialize with grad students **outside of your program**. I have made some of the best friends of my life by initiating drinks with fellow grads. Grad school is such a strange world. I struggle describing it to friends outside of academia Having people who understand the uniqueness of this world goes such a long way. ",
          "author": "Brady4524",
          "created": 1532616064,
          "upvotes": 2,
          "replies": {
            "e4bz5y5": {
              "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e4bz5y5/",
              "text": "But how do you meet grad students outside of your program?",
              "author": "macthepenn",
              "created": 1534474312,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "e21v8ae": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e21v8ae/",
      "text": "As someone about to begin their PhD journey this fall, I really appreciate this post. Thank you!",
      "author": "Bon_Iverstead",
      "created": 1531131931,
      "upvotes": 6,
      "replies": {}
    },
    "e21u1il": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e21u1il/",
      "text": "Great post! Especially working ahead, that has been a life saver for me since I started. Life happens, and there have been a few times life has happened and stopped me from doing any work but since I generally work ahead I either only fall a little behind or not at all.   \n\n\nSomething that has helped me keep my sanity, probably the biggest thing, is my cohort members. Well, most of them lol. I have made a group of friends in my cohort and it is so amazing to have people I get along with so well who also know exactly what I am going through. We study together, read each other's papers, I can always trust them in group projects, we do google docs for study guides, someone is always there to answer a question or listen to rants or bring an extra snack if you forget (which with classes from 5-8:30 is very helpful). I love these people and grad school would be 100&#37; harder without them. ",
      "author": "SurroundedByCrazy789",
      "created": 1531129562,
      "upvotes": 7,
      "replies": {
        "e22gb75": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22gb75/",
          "text": "100%. I lucked out and have a really great cohort, but I also worry that the advice might make people feel like they're doing something wrong if their cohort is not helpful. However, you can always build your own support system, I think.",
          "author": "hillary511",
          "created": 1531154531,
          "upvotes": 2,
          "replies": {
            "e22m97q": {
              "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22m97q/",
              "text": "True, and that is certainly not my intention. About half my cohort sucks, including one girl who likes to sabotage people. That was a new experience, I was use to people maybe not caring or not doing their work but outright sabotage was special. I agree that you can always build your support system!",
              "author": "SurroundedByCrazy789",
              "created": 1531159166,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "e21qxli": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e21qxli/",
      "text": "Very nice read. However, there's one small thing that jumped at me.\n\n> Especially in the beginning of grad school, it is far better to admit what you don’t know than pretend to know it.\n\nThis should not even be a comparison. Pretending to know something you do not know is something an academic should never do. Being caught doing this -- which is the most common result -- can very severely damage your reputation and the amount of trust put in you. It is indefensible, and virtually always a terrible idea.\n\nPlainly saying that you don't know something, or are not sure, or do not remember, are usually met with understanding and good-natured humor.  \n\nWhen I started my MSc, I used to think having to tell your advisor \"I don't know\" was some sort of a worst-case scenario. It really isn't.",
      "author": "falafel_eater",
      "created": 1531123308,
      "upvotes": 49,
      "replies": {
        "e21zarb": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e21zarb/",
          "text": "True; from my experiences as a soon-ish to grad PhD, it seems that new students (in molecular biology at least) tend to over-estimate their knowledge and competency.  I did it, almost every other student I mentored has done it.  It just seems natural that as you gain some knowledge of the field.  It takes hitting that first wall before you understand just how difficult this stuff is.  That wall is the first real level of knowledge.  And this is where the qualities of a good student really begin to stand out; once you realize what you don't know and don't understand, either about your field or the methodologies used to study it, you can begin to build a game plan for learning that information.  Don't know why you use this reagent instead of that? Time to go read.  The ones who are willing enough to take a step back and realize that they know very little are the ones who have jumped forward!",
          "author": "I_just_made",
          "created": 1531138599,
          "upvotes": 10,
          "replies": {}
        },
        "e22t19m": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22t19m/",
          "text": ">When I started my MSc, I used to think having to tell your advisor \"I don't know\" was some sort of a worst-case scenario. It really isn't.\n\nUnfortunately this is going to be advisor-specific. Most of the time I tell my advisor 'I don't know', they get annoyed and frustrated. ",
          "author": "dataispower",
          "created": 1531164507,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "e21q6gh": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e21q6gh/",
      "text": "This is actually very good, thank you for the writeup!",
      "author": "apolotary",
      "created": 1531121931,
      "upvotes": 2,
      "replies": {}
    },
    "e21mhns": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e21mhns/",
      "text": "I would add “have a hobby outside of your field”. I have a small garden, I play my bass and keyboard and I recently started exercising. Force yourself to step away from everything for a short while. (I skimmed through this, so if I missed it, my apologies.)",
      "author": "Rushderp",
      "created": 1531116083,
      "upvotes": 133,
      "replies": {
        "e21qnbh": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e21qnbh/",
          "text": "I'm gonna second this one..\"Put the glass down.\" The longer you hold it the heavier it gets. Allow yourself a break once in a while ",
          "author": "duckyduh",
          "created": 1531122774,
          "upvotes": 34,
          "replies": {
            "e22769w": {
              "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22769w/",
              "text": "That is both figuratively and literally true. Try not to drink too much in grad school. It's a crutch a lot of people end up relying on.",
              "author": "glr123",
              "created": 1531147035,
              "upvotes": 26,
              "replies": {
                "e23b6a6": {
                  "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e23b6a6/",
                  "text": "This is smart. One of the best things I did was quit drinking entirely before grad school (4 years before actually). I know teetotalism isn’t for everyone, but for me it improved every aspect of my life. My advice is, simply, don’t drink too much! ",
                  "author": "SSVicious",
                  "created": 1531179232,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        },
        "e22e6si": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22e6si/",
          "text": "I third this. For me, it also has to be a hobby I can schedule and do outside of the house (for maximum relaxation for myself). So I've taken a variety of creative and active classes while in grad school. The hobbies were great and they were on the calendar, so they got done.",
          "author": "icecoldmeese",
          "created": 1531152849,
          "upvotes": 5,
          "replies": {}
        },
        "e22fid9": {
          "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e22fid9/",
          "text": "Yes! This is definitely a way to keep feeling like a person during grad school. I don't do this currently because I have foster kids, which is why I forgot about it.",
          "author": "hillary511",
          "created": 1531153899,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e21lzpc": {
      "link": "/r/GradSchool/comments/8x8hmu/heres_a_list_of_stuff_thats_worked_for_me_in_grad/e21lzpc/",
      "text": "Great write-up! This could be an article!",
      "author": "ajd341",
      "created": 1531115377,
      "upvotes": 25,
      "replies": {}
    }
  },
  "updated": 1634064926
}