{
  "sid": "rde412",
  "link": "/r/GradSchool/comments/rde412/note_taking_and_reference_manager_recommendations/",
  "title:": "Note taking and reference manager recommendations?",
  "text": "Hi all! I’m starting my MA in a social science program in January. In the past I’ve taken all notes and annotated all readings by hand. I’m trying to switch to a digital note taking format to reduce the amount of paper and have all of my notes searchable. \n\nI have a laptop with a stylus so I can hand write my notes digitally, and I would like a note taking app that I can annotate readings on and take notes. \n\nDo you all find it helpful to have a note taking app AND a reference manager, or do you import all readings into a note taking app to annotate?",
  "author": "HighlyPolitical16",
  "created": 1639158246,
  "updated": 1639518539,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "ho0pssl": {
      "link": "/r/GradSchool/comments/rde412/note_taking_and_reference_manager_recommendations/ho0pssl/",
      "text": "Pre-pandemic, I used OneNote to hand-write and organize class notes, as well as annotate articles by converting them to images and importing them into the app (using a surface book 2 with stylus). Clunky and awkward, but my best option at the time since Adobe reader doesn’t allow for hand-writing annotations. I’m interested to see other suggestions and how the options have advanced since ca. 2018/2019.\n\nI use Zotero as a reference management software and can highly recommend it when writing papers in Word, although eventually you will have to start paying for storage (it took me 3 years to get to that point, but I did get there). I believe that Mendeley is a similar option that doesn’t ask for payment at any point, but I’m not sure. There’s an option to keep external notes and tags for each pdf in the Zotero system, but nothing that allows you to hand-write/annotate the pdf, to my knowledge.\n\nAll this being said, since the start of the pandemic, all methods and common practices have flown out the window for me, so I don’t really do this anymore. (Edit: by “this”, I mean keep digital notes/annotations/organized records. I still use Zotero!) I’ve kinda just been flying by the seat of my pants since March 11th, 2020.",
      "author": "alenigo",
      "created": 1639162157,
      "upvotes": 2,
      "replies": {}
    },
    "ho19qgl": {
      "link": "/r/GradSchool/comments/rde412/note_taking_and_reference_manager_recommendations/ho19qgl/",
      "text": "OneNote for notes\n\nNotion for spreadsheets and other organization\n\nZotero for ref management\n\n\nThe holy Trinity",
      "author": "Pr0gr3s",
      "created": 1639170061,
      "upvotes": 2,
      "replies": {}
    },
    "ho0pu1u": {
      "link": "/r/GradSchool/comments/rde412/note_taking_and_reference_manager_recommendations/ho0pu1u/",
      "text": "I don't know if it's available as an app but I love Mendeley.  You can organize your papers, it will generate citations for you, and you can highlight/annotate right on the page",
      "author": "devonha",
      "created": 1639162171,
      "upvotes": 1,
      "replies": {}
    }
  }
}