{
  "sid": "q8zqij",
  "link": "/r/GradSchool/comments/q8zqij/grad_school/",
  "title:": "Grad School",
  "text": "I am a senior in Psychology, hoping to go to grad school. I was only in one research lab during undergrad and it lasted less than 5 months. I have virtually no relationship with a professor. So, as of right now I have no options for letters of recommendation, am I screwed? What are my options, if any?",
  "author": "lucas_with_an_L",
  "created": 1634339234,
  "updated": 1634424353,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hgsslex": {
      "link": "/r/GradSchool/comments/q8zqij/grad_school/hgsslex/",
      "text": "What happened in that lab, and why can’t you reach out to anyone there? How’s your GPA? However, if you’re a senior, there’s still time to build relationships. Go to office hours. Ask questions. Check out some of your professors’ research and read a few of their published papers. Engage with them, but try not to come across as sycophantic. Tell them you’re hoping to go to grad school and ask them for advice. You have time, but get started this weekend.",
      "author": "KaFaraqGatri07",
      "created": 1634340109,
      "upvotes": 2,
      "replies": {
        "hgsvfv1": {
          "link": "/r/GradSchool/comments/q8zqij/grad_school/hgsvfv1/",
          "text": "The lab was a virtual one (covid) so I never even met the professor in charge of the project, as it was a grad students research. So, I know the grad student, but not the professors. I’m just finding it hard to believe that I can build a relationship and get a letter of recommendation in a month. Like it seems even rude of me to ask.",
          "author": "lucas_with_an_L",
          "created": 1634341536,
          "upvotes": 1,
          "replies": {
            "hgt34ic": {
              "link": "/r/GradSchool/comments/q8zqij/grad_school/hgt34ic/",
              "text": "See if you can get the grad student to write the letter of rec and the professor to co-sign.\n\nIt’ll end up being a better letter.",
              "author": "Weekly-Ad353",
              "created": 1634345500,
              "upvotes": 2,
              "replies": {
                "hgtlhtg": {
                  "link": "/r/GradSchool/comments/q8zqij/grad_school/hgtlhtg/",
                  "text": "That’s a great idea, too. I hasn’t thought about that.",
                  "author": "KaFaraqGatri07",
                  "created": 1634355663,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hgtlgoz": {
              "link": "/r/GradSchool/comments/q8zqij/grad_school/hgtlgoz/",
              "text": "I understand. Use COVID as an excuse as to why you’re only now getting this started. I hate to say it, but it really does help sometimes to blame the pandemic. Which reminds me. If you do go to office hours, wear your damn mask. I don’t understand undergrads and not wearing masks, but that simple gesture goes a long way. It makes you look mature, responsible, and thoughtful.\n\nAnother option would be to plan on starting in the Fall 2023 semester. That gives you a whole to work on relationship building. It’s not ideal if you were hoping to start next year. You should start contacting your old professors in February, and ask them about their research, advice for grad school, and if it feels right, ask for a STRONG letter of recommendation.",
              "author": "KaFaraqGatri07",
              "created": 1634355644,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}