{
  "sid": "ati3ci",
  "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/",
  "title:": "Every PhD's worst nightmare just became true",
  "text": "So I'm a PhD candidate and submitted my thesis for examination in Sep/Oct last year. Thesis was then sent to 2 external reviewers, one of whom completed the review within the given timeframe and the second one ended up pulling out at the last minute so a replacement had to be found. I recently got both final reports back and learned the following:\n\n- Reviewer #1 submitted the report in early December. He/she thought my thesis was excellent and recommended a pass with no amendments required and showing significant contributions. \n\n- Reviewer #2 pulled out mid Dec, but my university only learned about it in Jan because of the 3-4 weeks summer break. \n\n- Also mid Dec a paper was published which literally destroys another paper that was published 2 years earlier, which I used as reference and would ultimately lead to my most interesting findings (you see where I'm going...)\n\n- Mid-late Jan my university finds a replacement reviewer #2, who submitted the final report this week. He/she thought that my thesis would have been excellent, if it wasn't because the most significant bits of my analysis are garbage as I apparently don't even really understand what I'm writing about. Recommended major revise and re-submit. \n\n- I've now been left to fully reanalyse 1/3 of the experimental results presented and then rewrite ~1/4 of the bloody thesis, which they somehow expect me to re-submit within 8 weeks. All while I'm also working full time because *of course this should be an easy pass with only minor corrections if even*, at least according to my supervisor. \n\nThis has to be every PhD's worst nightmare. I *know* that it always was mine... \n\nI'm not even staying in Academia, just let me graduate and I promise that chapter will never see the light of day again... I'm so fucking done with grad school!!",
  "author": "CaptCookieMonster",
  "created": 1550844987,
  "over_18": false,
  "upvotes": 353,
  "upvote_ratio": 0.98,
  "comments": {
    "eh3gz2r": {
      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh3gz2r/",
      "text": "So not the old \"turning up to thesis defense naked\" dream then?",
      "author": null,
      "created": 1550919882,
      "upvotes": 1,
      "replies": {}
    },
    "eh2wsq7": {
      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh2wsq7/",
      "text": "So wait, this bitch did research to counter your own research and did so with a paper that didn’t even exist when you submitted your thesis? Fuck that, man!",
      "author": "dred1367",
      "created": 1550893619,
      "upvotes": 3,
      "replies": {}
    },
    "eh25d44": {
      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh25d44/",
      "text": "Honestly, papers that were published AFTER you submitted shouldn't even be taken into account for reviewing a thesis. With the possible exception of something you really should have realised yourself. I mean, for a publication in a journal, sure, do include new insights in the field if they pop up during the review process. But a thesis? Come on, that's just BS.",
      "author": "MaybeTheresa",
      "created": 1550871476,
      "upvotes": 20,
      "replies": {}
    },
    "eh1uwxk": {
      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1uwxk/",
      "text": "This is completely unrelated to your post and I am sorry but my mom is a geology engineer and I never met anyone except for her before and I just wanted to say I think your work is fascinating and really important. I know it sucks right now but don't give up! ",
      "author": "CheesePuffGirl",
      "created": 1550864257,
      "upvotes": 5,
      "replies": {}
    },
    "eh1s7ym": {
      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1s7ym/",
      "text": "Keep in mind you're still an expert at your subject and you probably understand what's going on at a deep level. Just add a sub-chapter where you explain the brand new results disproving the old stuff and do both analysis's, one from your old perspective and one from the perspective that the new work is definitive. The work will be stronger for it and you don't necessarily need to re-write much, just shift what you have around and add some discussion",
      "author": "TheNarwhaaaaal",
      "created": 1550862447,
      "upvotes": 16,
      "replies": {}
    },
    "eh1jm7s": {
      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1jm7s/",
      "text": "I'd be really confused in this situation, and maybe see who I could ask for clarification because it's strange that one reviewer said it was great and nothing serious needs to be done, yet another said it needed major revisions. Couldn't that lead to a situation where you make reviewer 2's  revisions, which now reviewer 1 thinks detract from your paper?\n\nIt seems like committees need to do a better job in delivering a general consensus and having a single voice in the direction the student should take. ",
      "author": "iputthehoinhomo",
      "created": 1550856590,
      "upvotes": 27,
      "replies": {
        "eh1kop5": {
          "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1kop5/",
          "text": "Uhm good point. TBH my committee just sent me the reports and asked to make all necessary corrections addressing reviewer's comments and resubmit within 8 weeks. I should probably send an email on Monday asking for clarification on which specific direction they want me to take, especially considering I don't have a lot of time... Thanks!",
          "author": "CaptCookieMonster",
          "created": 1550857312,
          "upvotes": 17,
          "replies": {
            "eh1u653": {
              "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1u653/",
              "text": "Have you written papers before? I don't have a ton of experience responding to paper criticism, but I know more than once my advisor and I looked at a comment and said, \"Nah... beyond the scope.\" Then we crafted a response saying it was a good comment, but not necessary for the goal of the study, which is limited for whatever reason. Oh, and we added a line to the limitations to bring it up (rather than re-do everything). Or sometimes the reviewers have a preferred analysis method that you just didn't use and that's just the way it is.\n\nSo, yeah, I would first itemize the recommendations with an estimate of how much it would change things to do that and how much time it would take, and then talk to your advisor and committee and see what needs to actually be done to address each comment, one by one.",
              "author": "rzr101",
              "created": 1550863753,
              "upvotes": 14,
              "replies": {}
            }
          }
        }
      }
    },
    "eh1iryl": {
      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1iryl/",
      "text": "Don't worry, in another month a new paper will come out destroying the paper that destroyed your reference. Or at very least more papers will come out as if the takedown paper doesn't exist. ",
      "author": "Pompousasfuck",
      "created": 1550856028,
      "upvotes": 44,
      "replies": {
        "eh1jolh": {
          "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1jolh/",
          "text": "That's what I said! Why can't we pretend that the damn paper never existed? It certainly didn't when I wrote the thesis...",
          "author": "CaptCookieMonster",
          "created": 1550856634,
          "upvotes": 34,
          "replies": {}
        }
      }
    },
    "eh1i0lz": {
      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1i0lz/",
      "text": "Wow, that really sucks. I guess the good thing about the 8 week deadline is you *will* be done in 8 weeks. Good luck OP!",
      "author": "riricide",
      "created": 1550855517,
      "upvotes": 7,
      "replies": {}
    },
    "eh1hukt": {
      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1hukt/",
      "text": "Regardless of the need to revise and resubmit, it is ALMOST OVER. Hang on! ",
      "author": "rhetrograde",
      "created": 1550855401,
      "upvotes": 6,
      "replies": {}
    },
    "eh1g427": {
      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1g427/",
      "text": "What's your field?",
      "author": "renerthr",
      "created": 1550854209,
      "upvotes": 5,
      "replies": {
        "eh1jaty": {
          "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1jaty/",
          "text": "Geo engineering ",
          "author": "CaptCookieMonster",
          "created": 1550856379,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "eh1bgvy": {
      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1bgvy/",
      "text": "[deleted]",
      "author": null,
      "created": 1550850921,
      "upvotes": 49,
      "replies": {
        "eh1pl6h": {
          "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1pl6h/",
          "text": "Off-topic, but: with public interest in religion seemingly on the decline, how do you think your field is faring? I love studying religion in my free time, but I wonder how active it still is in teaching and research! (I'm not aware of many 'healthy' religious studies departments, among the universities I know.)",
          "author": "spiritedprincess",
          "created": 1550860666,
          "upvotes": 7,
          "replies": {
            "eh1txai": {
              "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1txai/",
              "text": "[deleted]",
              "author": null,
              "created": 1550863588,
              "upvotes": 19,
              "replies": {
                "eh1u7ei": {
                  "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1u7ei/",
                  "text": "Makes sense. Thanks for your answer! Have you found any interesting insights about why people are anti-religion right now?",
                  "author": "spiritedprincess",
                  "created": 1550863777,
                  "upvotes": 6,
                  "replies": {
                    "eh1vfq2": {
                      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1vfq2/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1550864611,
                      "upvotes": 9,
                      "replies": {
                        "eh21mx9": {
                          "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh21mx9/",
                          "text": "What sort of beliefs comprise \"New\" Atheism?",
                          "author": "mollymayhem08",
                          "created": 1550868868,
                          "upvotes": 3,
                          "replies": {
                            "eh292rf": {
                              "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh292rf/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1550874056,
                              "upvotes": 8,
                              "replies": {
                                "eh7qikp": {
                                  "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh7qikp/",
                                  "text": "I'm interested in how you got to the point of quantifying (as I assume you have done) \"racism, sexism and meanness\" with respect to people who are atheists. One of my special interests is religion, both modern and ancient, and there were people even in classical Rome who believed that religion was harmful- with the primary example of Lucretius (not that he was an atheist per se, he just believed the gods lived far off and didn't care about humans). I take your point at atheism not being a \"belief\" in the typical sense, but I am not sure I understand how you look at their arguments as if they were actions. I'd love to read any sort of peer reviewed papers you have about this as well. Feel free to PM me.",
                                  "author": "mollymayhem08",
                                  "created": 1551057631,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "eh16kdl": {
      "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh16kdl/",
      "text": "Sorry to hear that OP. Just remember all the years you toiled away on your thesis, and how 8 weeks is nothing compared to that. The nest 8 weeks will certainly suck, but at the end, you should be DONE. Not \"done,\" but DONE. Forever. After you finish, plan a summer holiday as your reward.",
      "author": "BrokenMirror",
      "created": 1550847286,
      "upvotes": 182,
      "replies": {
        "eh1i41m": {
          "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1i41m/",
          "text": "Unfortunately I took that holiday before I started my current job :( Will try to remind myself that it's the final effort, this time for real. \n\nNot going to lie though, I feel like shit and plan on spending the whole weekend ahead with wine and Nerflix, while I muster up courage...",
          "author": "CaptCookieMonster",
          "created": 1550855582,
          "upvotes": 51,
          "replies": {
            "eh1mipj": {
              "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1mipj/",
              "text": "Agreed with top comment. It won’t be easy but you can do it. Not poking fun at the typo just appreciative of hearing “Nerflix” in my mind as I read that, it was a delightful chuckle I needed. Anyway, I found writing literally anything that comes to my mind about my data as I stare at it super helpful in framing out the results and discussion points. Best of luck to you and I promise you- you will be a Dr. and done with it!",
              "author": "coffeejaunt",
              "created": 1550858572,
              "upvotes": 17,
              "replies": {}
            }
          }
        },
        "eh1fx0y": {
          "link": "/r/GradSchool/comments/ati3ci/every_phds_worst_nightmare_just_became_true/eh1fx0y/",
          "text": "This is a great mindset! ",
          "author": "Jack-ums",
          "created": 1550854072,
          "upvotes": 5,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634066908
}