{
  "sid": "qwbc5u",
  "link": "/r/GradSchool/comments/qwbc5u/how_is_the_workload_for_an_applied_math_masters/",
  "title:": "How is the workload for an applied math masters vs engineering masters?",
  "text": "I understand workload will vary with a lot of factors from the professor to the program to the school, etc., but let me tell you about my experience and see how it compares to yours.\n\nI recently did a semester of an aerospace engineering masters program. I took 3 classes. It was a tremendous amount of work. I had to spend nights and weekends on it, and it was just overwhelming. I had to stop exercising so that I would have time to do the work and you can imagine that didn't improve things much.\n\nAt the end of it all, I was like \"I really didn't learn that much.\" The classes had been heavily geared towards teaching us how to do the homework for the class. They didn't give a shit if you actually learned that material or not. In one office hours, I was asking the TA about a homework problem and he said \"you don't need to know that level of depth to get the homework done, there are other people waiting to ask questions about the homework so please get in the back of the line and I'll get to your question if there's time [it was obvious there wouldn't be time]\"\n\nThe whole experience has put me off of aero. I had a similar experience with aero undergrad at a different school and I thought maybe grad school would be different but apparently not.\n\nWhat I don't know is how much my experience is specific to aero and how much is generally about grad school. I did both aero and math in undergrad and it seemed like the math classes were more concerned with the material.\n\nFor people that are in or have done a math graduate degree, how has the workload been? high? low? If it was a high workload, did you feel that it was worthwhile? To be clear, I don't mind the high workload as much, I can find a way around that (taking 2 classes instead of 3), but I do mind when it's just lots of busywork like dotting i's and crossing t's and leaves me without time to actually study the material.",
  "author": "actinium226",
  "created": 1637190056,
  "updated": 1637354750,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hl1z511": {
      "link": "/r/GradSchool/comments/qwbc5u/how_is_the_workload_for_an_applied_math_masters/hl1z511/",
      "text": "My experience has been pretty erratic, some semesters have low workload while the next semester has an insane workload, to say the least. But it comes with my program. \n\nFirst and foremost, I really like math. I love the pure aspects as much as, if not more than my applied option. During my more applied semesters, such as taking 3 major stats classes, I've worked from 7am-2am every night of the week, with classes. When I took 3 pure classes, my time spans 9am-11pm only on weekdays, with classes, and there's more than enough time to have time for myself. I also do research and that takes some part of my down time between doing work for classes, teaching, and other work and projects.\n\nApplied classes in my experience have some coding aspect to them, so most your time will be dedicated learning, if not getting to know more, the language used in your applied classes. Whether it was MatLab, R, or Python, even packages and scouting for data. So studying and putting time into projects per class as well as homework and studying take up most of your time. With pure classes, which some programs you need to take some form of analysis and/or algebra, you don't have to learn anything besides the definitions and theorems they talk about in class. Reading is essential, so having to spend maybe a couple hours reading thru secondary material or other textbooks to get the jist of the topic and then solving problems/proving statements based on those definitions and theorems. \n\nWhat made me want to do math on the graduate level is that everything is somewhat connected. In some classes there are connections with other classes, like some parts of real analysis are seen in statistics and linear algebra in regression analysis. There is a building of knowledge and maybe using a method you saw in another class could be useful in the next. \n\nLet me know if you have any other questions, I'm always open to messages.",
      "author": "datdestructor",
      "created": 1637193113,
      "upvotes": 1,
      "replies": {}
    },
    "hl24uab": {
      "link": "/r/GradSchool/comments/qwbc5u/how_is_the_workload_for_an_applied_math_masters/hl24uab/",
      "text": "I honestly can't see any advantage to math masters over aero....",
      "author": "Glarkin42",
      "created": 1637195738,
      "upvotes": 1,
      "replies": {}
    }
  }
}