{
  "sid": "rfrult",
  "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/",
  "title:": "Am I doing grad school wrong? Someone please tell me what grad school is all about.",
  "text": "When I was about to start grad school, I knew school was more than just studying. It's an opportunity to network, join clubs, competitions, make friends, etc. But it all seems to be out of reach now that the reality is all I do is school work and study, even on Sundays and the holidays. \n\nWhy am I doing this? I'm not doing this so that I graduate with great grades. I just want to graduate. However, I do want to actually learn something and take some skills with me. And that goal, along with the workload, require me to do \"overtime\". It's like I have to do school anytime I can, otherwise it won't cut it.\n\nI'm too busy, too worried sometime, to even enjoy grad school. I live and study in a very beautiful place but I'm like, \"Traveling? Huh, no time...\" \n\nBut I know, absurd as this experience might be, we won't get it anymore after we graduate. So can someone please tell me how should I do grad school more healthily? What should I focus on instead? And how can I be more effective with my study so it doesn't take up so much of my time?",
  "author": "hush_shush",
  "created": 1639434045,
  "updated": 1639880646,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.9,
  "comments": {
    "hog5bgl": {
      "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hog5bgl/",
      "text": "I felt similarly a while ago. The workload and the academic culture make it seem like working longer hours and weekends is the only way to go. \n\nHowever, I noticed that I am just not productive (and even less motivated) if I work long hours continuously. I need breaks to function well and to do meaningful work. So, I tried to be more mindful of when I needed a break and set a time at which I would stop working in the evening (inspired by the [Deep Work](https://www.calnewport.com/books/deep-work/) book from Newport). This worked quite well for my productivity, motivation and work-life balance. Of course, I still have many unproductive days, but I felt it was a substantial improvement. Maybe something like this could be useful for you too?\n\nI also talked to some more senior people about this. Some live for work and some do not and have a life outside of academia. This means that it is possible to have a better work-life balance, but academia might not be an easy environment to manage that. \n\nMaybe, it could also help to determine, where the pressure to work overtime is coming from. Is it coming from your supervisor, your comittee, someone (or something) else, or yourself? In my case, I was mostly pressuring myself to do things. As an example: I had one semester during which I just could not manage everything (because too much coincided) and I had to half-ass some things. It was stressful and the quality of my work suffered a bit, but in the end it was really not that big of a deal. This brought me to the conclusion that it is okay to half-ass some (ideally the less important) things. Maybe you could try to work out which aspects of your work you (and your professor) place value on, and which not, and then focus on the important ones.\n\nHope you find a way to be happy during grad school!",
      "author": "NoNopeMelon",
      "created": 1639441694,
      "upvotes": 12,
      "replies": {
        "hojnfk5": {
          "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hojnfk5/",
          "text": "Yeah, I was thinking I should treat it like work from now. 9-6, Monday-Friday, so I have free time on weekends.\r  \n\r  \nThe pressure is coming from myself haha. I mean, I want to actually learn something and have some skills, otherwise why invest in school...\r  \n\r  \nThank you, I'm also thinking about compromise for some aspects.",
          "author": "hush_shush",
          "created": 1639508601,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hogaonn": {
      "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hogaonn/",
      "text": "Uhh... I'm not sure what gave you the idea that grad school was going to be well-rounded. Working 7 days a week is the tradework graduate experience.",
      "author": "ProprioCode",
      "created": 1639444181,
      "upvotes": 26,
      "replies": {
        "hojnhnn": {
          "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hojnhnn/",
          "text": "Haha I guess I underestimated how much work will fall on my lap. What you described is what I imagined PhD program would be, but not master xD",
          "author": "hush_shush",
          "created": 1639508624,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hog5x7a": {
      "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hog5x7a/",
      "text": ">It's an opportunity to network, join clubs, competitions, make friends, etc.\n\nThat was undergrad.\n\n>But it all seems to be out of reach now that the reality is all I do is school work and study, even on Sundays and the holidays. \n\nWelcome to grad school. That's a common experience for a lot of people.",
      "author": "raistlin65",
      "created": 1639441980,
      "upvotes": 36,
      "replies": {
        "hoi61tq": {
          "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hoi61tq/",
          "text": "Counterpoint: clubs and competitions were undergrad. Networking and making friends (both professional and personal) on your same career trajectory/field/adjacent fields will pay outsized dividends throughout a career and are a necessary part of any professional activity at all career levels.",
          "author": "TheLogicalConclusion",
          "created": 1639485613,
          "upvotes": 4,
          "replies": {
            "hojocq3": {
              "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hojocq3/",
              "text": "I think you're the only one so far that tells me to even consider networking and making friends? Hahaha.\r  \n\r  \nBut to be fair though, competition is still a thing even for PhD (I'm in master btw).",
              "author": "hush_shush",
              "created": 1639508961,
              "upvotes": 1,
              "replies": {
                "hojsikw": {
                  "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hojsikw/",
                  "text": "Yeah I don’t know what to say. Other than I personally do think most advice in this subreddit is trash. Not purposefully but sort of like…a bunch of early 20 year olds who spent their life in school don’t truly have a good grasp on things (and I say this as someone who was that way and had to learn many lessons the hardest way possible). I am like 30 right now and I wish I had made more friends and networked more in college. Those connections, even with minimal maintenance, can last a lifetime even if just casually. \n\nI was in industry first and then came to a phd. The one think I got (reinforced by watching my father work in academia) is that collaborations, funding, jobs, introductions, etc will all come from connections. Anyone who tells you not to network should have all of their advice taken with a grain of salt.",
                  "author": "TheLogicalConclusion",
                  "created": 1639510588,
                  "upvotes": 1,
                  "replies": {
                    "honultv": {
                      "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/honultv/",
                      "text": "I'm like 32 right now, so yeah, could be an age thing that we want to network hahaha",
                      "author": "hush_shush",
                      "created": 1639586416,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hojqyep": {
          "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hojqyep/",
          "text": "Haha it's nice to know I'm not alone in this struggle.",
          "author": "hush_shush",
          "created": 1639509980,
          "upvotes": 1,
          "replies": {
            "hok6ufa": {
              "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hok6ufa/",
              "text": "Well, for a lot of people it's not a struggle. You have a lot of people obsessed with their academic discipline and/or are workaholics in grad school.",
              "author": "raistlin65",
              "created": 1639516279,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hogx593": {
      "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hogx593/",
      "text": "Well do you take joy from what you are studying?  You are learning to be a world expert in a narrow field, and in that process you will find questions that remain to be answered - some of those will hopefully excite you to want to solve them.  \n\nYou need to find the joy/intellectual excitement in your studies, a personal thing.  Also, don’t work past the point of diminishing returns, work hard but smartly.  Do fun things that “fill your cup”, and find those if you don’t already have them - exercise, music, photography, painting, etc.  \n\nThese are what got me through!  Best of\nLuck to you",
      "author": "Heady_Goodness",
      "created": 1639454449,
      "upvotes": 6,
      "replies": {
        "hojqc7a": {
          "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hojqc7a/",
          "text": "Do I take joy? I do, that is exactly one of the reasons I'm in this situation xD If I didn't enjoy it or get excited intellectually, I'd be like whatever just pass the course. But yes, I'm trying to find a smarter way to work, as I suspect I'm not quite efficient on that front. Thank you for the wishes.",
          "author": "hush_shush",
          "created": 1639509742,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hoh6mxp": {
      "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hoh6mxp/",
      "text": "Jesus you’re all masochists in this thread, take a day off and touch some fucking grass",
      "author": "gis_enjoyer",
      "created": 1639459416,
      "upvotes": 30,
      "replies": {
        "hoivh2j": {
          "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hoivh2j/",
          "text": "**Thank** you!",
          "author": "ErwinHeisenberg",
          "created": 1639497688,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hoggudt": {
      "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hoggudt/",
      "text": "Sounds like you didn't know what you were signing up for by going to grad school lmao.",
      "author": "Stereoisomer",
      "created": 1639446998,
      "upvotes": 9,
      "replies": {
        "hojr3ew": {
          "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hojr3ew/",
          "text": "Hahaha inaccurate expectations maybe, yeah...",
          "author": "hush_shush",
          "created": 1639510033,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoio76d": {
      "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hoio76d/",
      "text": "Something my supervisor told me earlier this semester, which has led to much healthier work balance: you will *never* hit a point where there isn't another book you could read, more research you could do, more work, all of that. Things will take as much time as they are given, so make sure you set aside time specifically to not work. \n\n\nThat can be hard, since grad school is an environment where being overworked is normalized, but you've got to set those habits, particularly if you want to stay in academia. I've started treating it like a job; there are hours and days when I just *will not* work. Setting those boundaries is going to give you more energy, for your work and for your personal life, in the long run.\n\n\nI find it's also helpful to be accountable to someone on this if you won't easily do it on your own. At my house we try to do movies, and sometimes I've gone to do coffee or food with cohort members if everyone is collectively freaking out.\n\n\n\nLastly, I think it's really beneficial to be in therapy during grad school so you can learn skills for stress management and work-life balance. It can be so helpful to have this objective party who can pinpoint ways for you to improve while acknowledging the inherent workload that comes with being a grad student. Definitely recommend it to anyone, not just those of us who already had mental health stuff to work through.",
      "author": "torgoboi",
      "created": 1639494706,
      "upvotes": 2,
      "replies": {
        "hojq5o2": {
          "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hojq5o2/",
          "text": "I agree. I even remind myself that even athlete has a day off in a week, so I should do that too, but sometimes when you're freaking out you forget lol.\r  \n\r  \nYup, I've already started taking advantage of the facility in campus for this kinda thing, and it does make me feel better.",
          "author": "hush_shush",
          "created": 1639509670,
          "upvotes": 1,
          "replies": {
            "hoky91x": {
              "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hoky91x/",
              "text": "I feel you there! It's definitely easier said than done. Someone in my program mentioned she never works weekends, and I still have no idea how she manages that haha. But it seems worth it since it means better brain health in the long run.",
              "author": "torgoboi",
              "created": 1639528055,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hohahz1": {
      "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hohahz1/",
      "text": "I’m very bad at grad school, so I give great advice. \n\nIt depends on the discipline and the country, for sure. BUT. The best advice I ever got was “Stop trying to be perfect.” \n\nAlso, finding people who aren’t in grad school can be helpful. There’s apps like MeetUp. \n\nRemember that it will all get done because it always gets done. (I legit graded 60 papers today.)\n\nI graded all those papers today because I had socializing to do over the weekend. Friend’s wedding. Partner’s friend’s birthday. And I have a whole mess of laundry to do. But it will all get done because it always gets done.",
      "author": "ResponsibilityOk617",
      "created": 1639461782,
      "upvotes": 1,
      "replies": {
        "hojorkh": {
          "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hojorkh/",
          "text": "Indeed, I'm using MeetUp and enjoy very much the experience there, esp since it's hard to make friends when I'm a foreigner and most of my peers are way younger than me.\r  \n\r  \nRight, so I guess if we prioritize socializing and life as well, the school stuff will have to respect it as a consequence xD",
          "author": "hush_shush",
          "created": 1639509122,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hohspi2": {
      "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hohspi2/",
      "text": "What you describe is pretty accurate. Grad school isn't really about courses and structured learning as it was in undergrad. It is essentially an apprenticeship to be a scientist. And we all know apprentices get the shitty jobs.\n\nI think you had a wildly inaccurate view of what grad school would be.\n\nThat said, if you literally don't have time for anything else, you're definitely doing something wrong. Grad school *is* unreasonably busy, but it should not be all-encompassing busy. Without knowing your exact situation, I'm guessing you simply have to say 'no' more to certain things.",
      "author": "cephalord",
      "created": 1639475692,
      "upvotes": 1,
      "replies": {
        "hojozw2": {
          "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hojozw2/",
          "text": "Indeed, I suspect there might be something wrong with how I approach learning or coursework. For example, when I read, I read every word and want to understand every sentence the author wrote. But I just find out that people skim read. Hahaha. So there's that.",
          "author": "hush_shush",
          "created": 1639509213,
          "upvotes": 1,
          "replies": {
            "hokf2pv": {
              "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hokf2pv/",
              "text": ">when I read, I read every word and want to understand every sentence the author wrote. \n\nI've barely read my own papers. Who has time to read others'? But seriously, there is not a single paper in my whole career that I've read front-to-back, every word.",
              "author": "cephalord",
              "created": 1639519641,
              "upvotes": 2,
              "replies": {
                "honvssj": {
                  "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/honvssj/",
                  "text": "Hahaha so I did it wrong 'cause I just like read 3 articles, front to back every word. With the need to understand everything, that took 2 days xD \n\nBut then again I've been away from school too long (> a decade) so I have to familirize myself with academic writing. Now I'm quite familiar with scientific articles I can skim read :D",
                  "author": "hush_shush",
                  "created": 1639586888,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hojscsf": {
      "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hojscsf/",
      "text": "Thanks everyone for the replies. I felt heard and it's nice to know that a lot of people feel that way too.\r  \n\r  \nSo basically what I've been doing is not that wrong: study and coursework are what's in store for me xD Perhaps sprinkle it with some networking, socializing, friends making... and some strict time management, then hopefully I could enjoy it more.",
      "author": "hush_shush",
      "created": 1639510525,
      "upvotes": 1,
      "replies": {}
    },
    "hohjnbl": {
      "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hohjnbl/",
      "text": "This is the type of people getting into grad school and here I am busting my ass trying to get in. WTF is happenning.",
      "author": "damageinc355",
      "created": 1639468213,
      "upvotes": -3,
      "replies": {
        "hojq23z": {
          "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hojq23z/",
          "text": "You make it sound like we didn’t bust our asses to get in and get through. WTF do you think we did? Why do you think we want more in our lives than *just* research? Why do you think grads are unionizing all around the world? We are burnt out and this shit isn’t sustainable. It’s not a fucking fairytale. Grad school is mentally, emotionally, and physically exhausting. And Higher Ed is a shit show.  Take your righteousness and entitlement somewhere else, my guy.",
          "author": "ResponsibilityOk617",
          "created": 1639509630,
          "upvotes": 1,
          "replies": {
            "hokdps2": {
              "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hokdps2/",
              "text": "If you wanted a smooth experience, with socializing, clubs you should have done that in your undergrad. Grad school IS research, at least for most programs. Life isn't a fucking fairytale.",
              "author": "damageinc355",
              "created": 1639519078,
              "upvotes": 1,
              "replies": {
                "hokdzvl": {
                  "link": "/r/GradSchool/comments/rfrult/am_i_doing_grad_school_wrong_someone_please_tell/hokdzvl/",
                  "text": "Grad school is research. And teaching. And service work. There’s nothing wrong with wanting a balance in that.",
                  "author": "ResponsibilityOk617",
                  "created": 1639519194,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}