{
  "sid": "rfgvx4",
  "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/",
  "title:": "Extra Income Advice",
  "text": "I'm (25F) currently an engineer, and I plan to go to grad school next year for a PhD. I'm very excited to pursue my dream but not so excited about the dramatic income difference. I also pay for half of my mom's mortgage as she is very poor (only about $500 but is still substantial for a $25-30k stipend). I currently have a good chunk of savings and will have about $75k saved up by the time I start school. I'm wondering what you do for extra income. \n\n&#x200B;\n\nSome ideas I was thinking:\n\n\\- Buy a home and rent out the rooms\n\n\\- Donate plasma weekly\n\n\\- Create an app for something\n\n\\- Donate my eggs",
  "author": "thedazycatlady",
  "created": 1639405549,
  "updated": 1639518440,
  "over_18": false,
  "upvotes": 94,
  "upvote_ratio": 0.92,
  "comments": {
    "hoe00yl": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe00yl/",
      "text": "Be careful seeking additional sources of income, especially depending on what kind of stipend you’re on. My fellowship dictates that I can’t seek outside work and I’ve heard that’s common for students in my field (biological sciences). It might depend on the source of funding and your field, but I just wanted to chime in with my experience!",
      "author": "queerorpheus",
      "created": 1639409535,
      "upvotes": 185,
      "replies": {
        "hoeatu6": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoeatu6/",
          "text": "Yes this! I was in a similar situation to OP, engineer, working full time with a high paying job, they offered to let me go to part time when I started the PhD (biomedical engineering) but the program wouldn’t allow me to work or have a second job. Passive forms of income are fine, but jobs are likely not going to be allowed",
          "author": "enginerd826",
          "created": 1639413915,
          "upvotes": 46,
          "replies": {}
        },
        "hoep1qt": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoep1qt/",
          "text": "a lot of programs don't allow outside jobs, but you might be able to teach or do something related to a PhD/academia for a little extra money. Reasonable programs are more likely to approve things that will be related to your professional growth (thought it's not guaranteed of course)",
          "author": "gildedbee",
          "created": 1639419525,
          "upvotes": 14,
          "replies": {}
        },
        "hoei1jv": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoei1jv/",
          "text": "Oh wow. I haven’t heard of that before. I hope your stipend was enough to cover your expenses.",
          "author": "thedazycatlady",
          "created": 1639416761,
          "upvotes": 13,
          "replies": {
            "hof4y9q": {
              "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hof4y9q/",
              "text": "Thankfully I’m in a pretty low COL city and my program provides a pretty livable stipend, but I also don’t have any of the worries that you do and I came straight from undergrad so I didn’t have to drastically shift my budget. \n\nI think in some situations things like tutoring could be doable, like other people have mentioned. I will say my program was very helpful and transparent in discussing finances with me, so don’t be afraid to have those conversations too. Best of luck in grad school!",
              "author": "queerorpheus",
              "created": 1639425878,
              "upvotes": 6,
              "replies": {}
            },
            "hohsfw4": {
              "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hohsfw4/",
              "text": "It really depends on your department. My whole department knows I’m working a second job even though I’m not supposed to on paper and nobody cares because it doesn’t stop me from progressing on time with my work/impede my assistantship responsibilities.",
              "author": "Thunderstarter",
              "created": 1639475459,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hods3bd": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hods3bd/",
      "text": "Once I started working on my research, I ended up meeting organizations who needed help doing similar research but couldnt afford (or didnt need) to hire fulltime staff to do it so we worked out contracts. I probably ended up making as much from consulting on the side as I did from my stipend and only worked an extra 5-10 hours a week on those projects. There are probably similar freelance opportunities in your field!",
      "author": "Two-HeadedBolognaGod",
      "created": 1639406035,
      "upvotes": 69,
      "replies": {
        "hof60qa": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hof60qa/",
          "text": "What’s your field, if you don’t mind me asking",
          "author": "ayaPapaya",
          "created": 1639426307,
          "upvotes": 7,
          "replies": {}
        },
        "hodvhih": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hodvhih/",
          "text": "Oh interesting! Thanks!",
          "author": "thedazycatlady",
          "created": 1639407566,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hoe25a3": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe25a3/",
      "text": "Awesome that you're planning ahead :)\n\nI'm chiming in because I'd be concerned about what I see as major risks for two of those options.\n\n1. Buying a house and renting rooms in it isn't a sure thing. You'll have to interview candidates, which takes time. Even if they pay for their own background checks, you'll have the added burden of being a landlord. \n\nI'm guessing that you may even be living with them, while working on your PhD? \n\nTo me, having strangers/housemates walking around, inviting over significant others, talking on the phone, watching t.v., cooking, and doing what people do would be super distracting. \n\nWhen roommates move out, you'll need someone else to fill in the spot. You may need to schedule showings, deal with movers, handle complaints, and find yourself in a parental role (if they don't pay on time).\n\nOnce you buy a home on the condition that you'll be renting out the rooms out of financial need, you're putting yourself at risk of making decisions that may compromise your limited time and energy.\n\n2. Donating eggs means taking preparation hormones for a certain number of months. I'd be concerned about potential side effects, even if they are relatively \"minor,\" such as fatigue. \n\n...\n\nI like the side hustle ideas where you'll have boundaries, and a way out if need be. It's way easier to quit a job or reduce hours, than reverse course on a house or once you've bought a house or committed to egg donation (and even if you can back out of that, you may feel pressured for not going through with the donation).\n\n[The egg donation point is typed as, \"2\", on my end. Guess Reddit's auto formatting took charge here..oh well.]",
      "author": "Keepers12345",
      "created": 1639410422,
      "upvotes": 39,
      "replies": {}
    },
    "hoe46xd": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe46xd/",
      "text": "Sorry, not a grad student anymore (on the other side) but depending on where you are - tutoring. Back in 2014 I was tutoring students from a local (private) high school for 70$ an hour in math/physics. I would only do it 2-4 hours a week, but it's an extra \\~200 a week during the academic year. \n\nThe amount may be atypically high (private school students, rich part of the country), but even the local public schools had students looking for tutors @ 25-50 an hour. \n\nAlso, my department would connect grad students to local parents looking for tutors. Maybe your department has something similar?",
      "author": "magneticanisotropy",
      "created": 1639411262,
      "upvotes": 34,
      "replies": {
        "hoe4wpi": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe4wpi/",
          "text": "Add onto that, if you are an engineer and know computer languages look into doing that. I tutor in R and lowball everyone at $40/hour. Competitive would be in the 80-100/hour for competent tutors.",
          "author": "jasperjones22",
          "created": 1639411554,
          "upvotes": 17,
          "replies": {
            "hoe91fs": {
              "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe91fs/",
              "text": "Damn why have I not been tutoring this whole time? That's awesome.",
              "author": "bandrus5",
              "created": 1639413211,
              "upvotes": 6,
              "replies": {
                "hoe9rei": {
                  "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe9rei/",
                  "text": "I do offer a grad school rate for my college of a fifth for a session because I'm usually too busy to go to the liquor store and grad students are poor.",
                  "author": "jasperjones22",
                  "created": 1639413497,
                  "upvotes": 13,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hodufu5": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hodufu5/",
      "text": "Paid research internships exist in computer science at major companies — not sure what field you’re going into.",
      "author": "Kylaran",
      "created": 1639407100,
      "upvotes": 23,
      "replies": {}
    },
    "hoea0fj": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoea0fj/",
      "text": "Tutoring and house/pet sitting are pretty solid. Tutoring pays well, house sitting is often a lot of money for not doing much, and pet sitting is getting paid to chill with pets. Winning!",
      "author": "ADPhD-hi",
      "created": 1639413596,
      "upvotes": 18,
      "replies": {}
    },
    "hoetvao": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoetvao/",
      "text": "Hi, I wouldn't donate eggs because it's a risky and invasive procedure, fast money and the altruistic idea sound nice but no one wants to talk about the trauma or disadvantages. Please girl, don't put yourself at a risk for school. It's not worth it. \n\nInstead you can use your hobbies to make money, do you love potting, sewing etc. Sell your process of your products on insta/tiktok and then the product itself. (To all my friends here, the process can be very valuable)",
      "author": "aestheticbrat",
      "created": 1639421440,
      "upvotes": 17,
      "replies": {
        "hog3wh1": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hog3wh1/",
          "text": "I also wanna add about egg donation that if you have anything medically wrong with you most places will deny your donation. I tried to do it and I had to go in for a physical. When they saw I had a scar on my face (not a birth defect but from a childhood accident) they told me my evaluation was not needed and accused me of lying on my application about not having birth defects. I explained to them it wasn't a defect and even explained what type of accident caused the scar but they just wouldn't believe me.",
          "author": "Perses_Garden",
          "created": 1639440956,
          "upvotes": 6,
          "replies": {
            "hogend9": {
              "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hogend9/",
              "text": "Thank you for sharing! I \nhad a seminar where we had to conduct (participant) observation in the IVF field; a few classmates infiltrated online forums to gain more insight on the agencies and the international market for eggs and sperm. Thats a somehow intransparent and super creepy field. \n\ni recommend reading :  \nKnecht, Michi, Maren Klotz, Stefan Beck: Reproductive Technologies as Global Form. Ethnographies of Knowledge, Practices, and Transnational Encounters, campus, 2012.",
              "author": "aestheticbrat",
              "created": 1639445994,
              "upvotes": 6,
              "replies": {
                "hogeuaq": {
                  "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hogeuaq/",
                  "text": "I'll have to give it a read. Thanks for recommending it!\n\nAlso, sounds like a very interesting seminar.",
                  "author": "Perses_Garden",
                  "created": 1639446082,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hoi579a": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoi579a/",
          "text": "Someone in my program did this for extra money, apparently it made her temporarily crazy. Those hormones are no joke.",
          "author": "heebersbajeebers",
          "created": 1639485102,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hoejxd3": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoejxd3/",
      "text": "There can be a trade off between working side jobs and finishing on time. If working side jobs at a low wage forces you to stay an extra year then it might be better to just take out a loan and repay it after you graduate with a higher salary.  If you really need the money, consider doing contract work or consulting related to your field during the summers or random semesters. You can also consider teaching math or statistics at a community college or regional school once you have a masters.  \n\nOverall, it might be easier to lower living costs instead of raising your income. Consider living with a roommate, using student discounts, using school resources (gym, therapy, tax preparation assistance),   and taking advantage of weekday discounts at restaurants.",
      "author": "local_man_says",
      "created": 1639417501,
      "upvotes": 12,
      "replies": {}
    },
    "hoe10c6": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe10c6/",
      "text": "some universities have options for graduate students to live in on-campus housing management roles (i.e. college house directors, resident assistants, etc.). this usually comes with free housing/food that can offset some of your annual costs",
      "author": "someoneinsignificant",
      "created": 1639409949,
      "upvotes": 10,
      "replies": {}
    },
    "hoduldp": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoduldp/",
      "text": "I work at a gym that I used to have a membership for. I now save 150/monthly, get to workout for free, and get paid to work.",
      "author": "mrt1416",
      "created": 1639407170,
      "upvotes": 20,
      "replies": {}
    },
    "hoe8qvx": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe8qvx/",
      "text": "Editing services pay a lot, but they're a bit on the fine line of morality.",
      "author": "valryuu",
      "created": 1639413093,
      "upvotes": 8,
      "replies": {}
    },
    "hoezhpi": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoezhpi/",
      "text": "PhD student here. You aren't going to make money buying a home in grad school (terrible idea, no offense), or a sustainable amount of income donating eggs and plasma. Honestly the best extra income in grad school is things like tutoring off the books, doing freelance writing, etc. Also apply for fellowships, grants, and summer funding.\n\nWhile it is very kind that you are helping your mom out, $500/month during a PhD is not sustainable. It just isn't.",
      "author": "melodramaticnarwhal",
      "created": 1639423692,
      "upvotes": 8,
      "replies": {
        "hog9y3x": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hog9y3x/",
          "text": "To be fair, the housing market is booming. We bought a house during my husband's PhD and the value almost doubled in 4 years when we sold. Buying a house could be a great idea in the right place.",
          "author": "make_cake_",
          "created": 1639443839,
          "upvotes": 2,
          "replies": {
            "hoizs2p": {
              "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoizs2p/",
              "text": "Equity might give you a big payoff in the end, but in the meantime, you'll be in a super risky position. Houses occasionally have huge maintenance expenses that would a huge hardship on a $25k salary.\n\nAnyway, the housing market is at an unprecedented high right now anyway, so who knows what kind of equity payoff there will be (or if there will be one even) in 4 years. :/",
              "author": "pb-pretzels",
              "created": 1639499382,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hoeqq8c": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoeqq8c/",
      "text": "You would be hard pressed to find a grad student who is able to buy a house and rent out rooms. If you can, good for you, but you shouldn’t look at being a landlord as passive income. \n\nI sell stuff I find on the side of the road. It’s by no means stable, but one month my partner and I pulled $700 from selling a couple of nice office chairs we found and fixed. \n\nI’ve also done pet sitting but that gets old after a couple of shit pets. I did it through rover and I wouldn’t recommend it, because they essentially only protect pets and pet owners (so if you’re pet sitting in your own home and a dog shits on your carpet, that’s on you). \n\nI’ve tried selling art and crafts (water color, stained glass) but I like the stuff I make too much. I still give them as gifts. \n\nI value my free time more than extra money, so at this point I’ve just cut down on my expenses through unconventional means (i.e. living on a sailboat, meal prepping, etc). The best plan is to minimize time in grad school so you can make up for lost earnings once you get your post grad school position.",
      "author": "kaptainkrk",
      "created": 1639420198,
      "upvotes": 7,
      "replies": {}
    },
    "hoe0frz": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe0frz/",
      "text": "How much money do you plan on making a year out of grad school? I imagine engineers make really good money.\n\n&#x200B;\n\nIf that is the case, you should take out some federal student loans. They have low interest rates and you don't have to start paying them back until a little while after you graduate. Use those to supplement your income. I think taking a part time job would be an insanely bad decision. I think a lot of people don't consumption smooth nearly well enough.   \n\n\nThink about doctors. They all make tons of money. But if you ask them what it was like in med school, they'll tell you they were broke. Its completely insane. If you know you are only temporarily poor, and will make a ton of money in the future, you should feel comfortable taking out loans to subsidize your consumption.",
      "author": "comedybingbong123",
      "created": 1639409710,
      "upvotes": 12,
      "replies": {
        "hofh3el": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hofh3el/",
          "text": "I've been considering taking out a federal student loan - just to help supplement my stipend (I'm also making decent money right. now but anticipate getting in to programs for next fall). I also have been super fortunate to have worked at a startup where I exercised my options and they just IPO'd this year. It's a relatively decent amount right now but once they start selling their product, I think the price should go up. I'm not sure if investing in a certain way would help at least build some interest or something so I can only take bits out at a time or whatever during grad. Ugh... Anyway, I'm in a similar boat as OP and I hope we figure this out!!",
          "author": "sr41489",
          "created": 1639430916,
          "upvotes": 3,
          "replies": {
            "hog0amn": {
              "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hog0amn/",
              "text": "Yea I don't think its a \"popular\" move but I don't know why",
              "author": "comedybingbong123",
              "created": 1639439014,
              "upvotes": 2,
              "replies": {
                "hog18rd": {
                  "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hog18rd/",
                  "text": "I know, I just looked into it and the rates are not bad at all. Plus, most STEM PhD programs cover tuition costs so I’d only need to take enough to cover my life expenses which are not that bad since I basically just study, sleep, and eat lol.",
                  "author": "sr41489",
                  "created": 1639439431,
                  "upvotes": 2,
                  "replies": {
                    "hogkz7y": {
                      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hogkz7y/",
                      "text": "Yea if tuition is covered plus you get a stipend. I think it’s a good idea to subsidize your consumption by a few hundred dollars - 1K a month. Especially if you know you are making at least 100,000 a year after you graduate",
                      "author": "comedybingbong123",
                      "created": 1639448853,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hoe4mkr": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe4mkr/",
      "text": "It's not much, but in a lot of university settings you can pick up work as a grader. I know where I am, it's about \\~$40/ a student, and if you can hop on whatever version of 'mini' courses your uni has, you can get paid twice a semester.",
      "author": "countingmammals",
      "created": 1639411439,
      "upvotes": 4,
      "replies": {
        "hoelwbp": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoelwbp/",
          "text": "How would you find out about these opportunities?",
          "author": "Difficult-Pause7583",
          "created": 1639418272,
          "upvotes": 2,
          "replies": {
            "hoepgxb": {
              "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoepgxb/",
              "text": "Make sure you're signed up for as many relevant listserves, a lot of times calls go out via those email mailing lists and getting on them is as easy as reaching out to admin.",
              "author": "countingmammals",
              "created": 1639419693,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hoecmr6": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoecmr6/",
      "text": "As others have said, make sure to double check what you're allowed to do for work, but many of my peers have little side jobs on campus, like doing extra research for professors outside our dept, working in certain research centers on campus, doing a part-time admin job for offices, working at the writing center, etc. On our campus, these jobs pay decently if you're a PhD student, around $17-$20 an hour. I work on social media for an office on my campus, it is only 5 hours a week so the work load is super light and I get paid $20 an hour so that's an extra \\~$100 a week (for very nonstressful, easy work) which adds up! \n\nI know some grad students in my dept also adjunct for community colleges in the area. They typically teach an intro level class and make a few extra thousand over the course of a semester.",
      "author": "junemoon21",
      "created": 1639414617,
      "upvotes": 3,
      "replies": {}
    },
    "hoei8gw": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoei8gw/",
      "text": "I did the following:\n\n\\- English teacher  \n\\- Waiter  \n\\- Private tutor\n\nI don't know about the rules where you live, but here in Brazil the rule was that I couldn't have a full time job or any job that affected the development of my PhD, but this was for my up for my advisor to decide. Jobs related to the field of research were fine, Education made the cut, as long it didn't affect my research.",
      "author": "SamuelFontFerreira",
      "created": 1639416837,
      "upvotes": 3,
      "replies": {}
    },
    "hoekpbm": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoekpbm/",
      "text": "you could tutor people in STEM stuff, or even try to consult people applying to engineering programs. But whatever you do check the terms of all funding you are getting before.",
      "author": "TJHistory",
      "created": 1639417807,
      "upvotes": 3,
      "replies": {}
    },
    "hoelkjo": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoelkjo/",
      "text": "I did airbnb renting out my guest bedroom for awhile when I was in a tight spot. Because I was working a lot, I almost never met my renters; they would come in when I was at work in the evening, and I would leave for work the next morning before they were awake. It was much easier and more pleasant than I had imagined, and even if I happened to be home when someone was in, they generally wanted their privacy and we never spoke. \nWith airbnb, you get the option of vetting people before you just let them in your house, so I only agreed to host people who's reviews I was comfortable with.\nI would just make sure you can offer enough to make it viable; multiple night stays are in your better interest bc you don't have to do as much laundry. \n \nIt's good if they can have a private bath, tv, internet, access to you kitchen and washing machines. \n\nI have a pet, and that actually meant that I had to charge less.\n\nI think airbnb may be viable using a differential property than the one you live in if you have the time and money to manage it properly.",
      "author": "Difficult-Pause7583",
      "created": 1639418145,
      "upvotes": 3,
      "replies": {}
    },
    "hoem62s": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoem62s/",
      "text": "Many engineering PhD students will be able to try internships for at least their first summer. That could help.",
      "author": "Reverie_39",
      "created": 1639418380,
      "upvotes": 3,
      "replies": {}
    },
    "hof1vw2": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hof1vw2/",
      "text": "Same position (currently in grad school now). WHen you're applying/interviewing with professors, ask them whether they're open to you working summer internships. That would add 10-20k to your annual salary",
      "author": "International_Pop524",
      "created": 1639424653,
      "upvotes": 3,
      "replies": {}
    },
    "hofl2p8": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hofl2p8/",
      "text": "Just to offer a different path, but it's ok to be in the red as far as income goes for a few years with that kind of savings. I came into grad school with about 7k savings and even just having a cushion for months where I go slightly over budget or need to make a purchase all at once has helped tremendously. Let me frame it a different way, you're worried about short term income while you work on your PhD right? Do you expect that house to make you 75k over 5 years? Probably not, and you would be trading your savings for a less stable position because rooms aren't always full and houses require upkeep. That $500 a month comes out to 6k a year, and 8% annual gains on 75k invested in the stock market gives you that amount. Not saying you should invest it all, just want to make the point that while yes, putting income on pause for 5 years sucks, you aren't in a position where you need to consider medical sales or put yourself under pressure to manage a side gig. Grad school is plenty stressful as is, using that money to let you focus on school completely is a good investment. You should figure out how much money a year you think you need to get by at the quality of life you want to live at, and work backwards. The school location is going to be the biggest factor, if you're in a major city and especially places like NYC or SF you may want the extra income just for necessities like rent. But if it's somewhere in the middle of nowhere, do your expenses even warrant additional income? You might also consider crossposting this to r/personalfinance.",
      "author": "rylandf",
      "created": 1639432555,
      "upvotes": 3,
      "replies": {}
    },
    "hoea6wv": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoea6wv/",
      "text": "I had a professor tell me this, but literally go dumpster diving for titanium. A lot of the physics/engineering buildings will throw out extra titanium that you can salvage and sell. The professor actually ended up making quite a lot doing that during his PhD.\n\nI also don't think there should be legal issues because they throw it out.",
      "author": "Astsai",
      "created": 1639413666,
      "upvotes": 4,
      "replies": {
        "hoetpsu": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoetpsu/",
          "text": "Dumpster diving is illegal in some jurisdictions in the US. OP should check their local laws first.",
          "author": "Icarus_skies",
          "created": 1639421380,
          "upvotes": 11,
          "replies": {
            "hogo0o1": {
              "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hogo0o1/",
              "text": "Yeah that's true. Yeah OP double check your laws and make sure it's fine to do it.",
              "author": "Astsai",
              "created": 1639450208,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hoem02m": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoem02m/",
      "text": "I’ve been doing research studies on campus, averaging $100 a month. Some of them offer free medical treatment, cancer screening or therapy. They give our gift cards so it’s not taxed or counted as income",
      "author": "0ceansick",
      "created": 1639418313,
      "upvotes": 2,
      "replies": {}
    },
    "hof4k49": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hof4k49/",
      "text": "If you’re in a city then babysitting can rack up some good money! I babysit every Tuesday afternoon-dinner time and take home about $150 each time",
      "author": "plz-wash-your-hands",
      "created": 1639425721,
      "upvotes": 2,
      "replies": {}
    },
    "hofewa0": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hofewa0/",
      "text": "Honestly I'd try to freelance on the side if you can--it looks like you have some coding experience? I'm sure you could market that.\n\n\nI have donated my eggs multiple times. Look into it now if you're serious about it because there's a lot of paperwork and potential recipients will need to get on a course of hormones too if it's a fresh transfer. The donation process actually doesn't take that long--I think every course was a few weeks of hormone injections and then an outpatient procedure to retrieve the eggs. The hormones didn't make me fatigued, I just couldn't run (risk of twisting huge ovaries...ew) and I had to get my blood drawn almost every day which is a drag. \n\n\nIf you're looking for reliable side work that can easily be under the table, babysitting/PT nannying is in huge demand right now.",
      "author": "handy_solo",
      "created": 1639430014,
      "upvotes": 2,
      "replies": {}
    },
    "hofh182": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hofh182/",
      "text": "I pet sit/house sit and walk dogs for extra money! You can register as a professional pet sitter on Rover and make your own schedule based on what days/weeks you’re available. The upside is that when you’re at their houses taking care of their pets you can also get coursework done, and most people are willing to pay pretty good money to have their pets taken care of. I typically make $100-$150 for a 4 day pet sitting stint. Plus, who doesn’t love getting to play with adorable animals??",
      "author": "nykki_ross",
      "created": 1639430891,
      "upvotes": 2,
      "replies": {}
    },
    "hodwqpj": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hodwqpj/",
      "text": "Restaurant work is quick and easy money.  pull a  Friday and Saturday and you’re good to go",
      "author": "Furthur",
      "created": 1639408124,
      "upvotes": 2,
      "replies": {
        "hoe0eh4": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe0eh4/",
          "text": "Well, but most restaurants and bars don't hire people just to work Friday and Saturday unless you're really experienced. In which case the OP wouldn't be asking for advice lol\n\nThat being said, I worked in restaurants and bars for about 30 hours a week during my masters. It was a good complement, because it has you up on your feet moving and is very social.",
          "author": "raistlin65",
          "created": 1639409695,
          "upvotes": 9,
          "replies": {
            "hoe2c1c": {
              "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe2c1c/",
              "text": "As a hiring manager at a restaurant and bar I disagree! that’s when we need people the most I’m willing to train anyone with a personality",
              "author": "Furthur",
              "created": 1639410501,
              "upvotes": 3,
              "replies": {
                "hoe2sdm": {
                  "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe2sdm/",
                  "text": "Maybe you guys are desperate right now. But that's not how the restaurant and bar industry used to work when I was in it, and also a manager.",
                  "author": "raistlin65",
                  "created": 1639410688,
                  "upvotes": 3,
                  "replies": {
                    "hoe35f3": {
                      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe35f3/",
                      "text": "I mean my spot is not but in lieu of spending hours “donating” plasma all the time or taking a course of hormones and swearing off sex for six months to donate eggs… I figure an engineer could learn how to make drinks or serve tables 😉",
                      "author": "Furthur",
                      "created": 1639410837,
                      "upvotes": 1,
                      "replies": {
                        "hoe9pwe": {
                          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe9pwe/",
                          "text": "Sure. My whole point was that they shouldn't expect just to be able to work the best shifts. Unless they're very experienced. In which case, they would have never created this post to begin with.",
                          "author": "raistlin65",
                          "created": 1639413481,
                          "upvotes": 2,
                          "replies": {
                            "hoeahnj": {
                              "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoeahnj/",
                              "text": "Sure, no point in going back-and-forth about our opinions on what makes a good restaurant worker. cheers!",
                              "author": "Furthur",
                              "created": 1639413784,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hoe1xo0": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoe1xo0/",
      "text": "If you can afford to buy a house and rent rooms that is a good option. As long as you maintain a safe quiet study.",
      "author": "IncredibleBulk2",
      "created": 1639410335,
      "upvotes": 0,
      "replies": {}
    },
    "hof60dl": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hof60dl/",
      "text": "I make money participating in research studies. Consumer preference, medical, nutrition, neuroscience etc.",
      "author": "MsAggieCoffee",
      "created": 1639426303,
      "upvotes": 1,
      "replies": {}
    },
    "hoffx6z": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoffx6z/",
      "text": "You have significantly more savings than almost every grad student I know, so I'm not sure how worried you need to be. But depending on how your program is set up, you can teach recitations during the semester for a bit more. That's also a good way to expose yourself to students who may want tutoring, which is another good supplement.",
      "author": "Wiggijiggijet",
      "created": 1639430435,
      "upvotes": 1,
      "replies": {}
    },
    "hofidmo": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hofidmo/",
      "text": "I am in a similar position as you, OP! I was considering selling my eggs but I'm 32 so they're basically garbage at this point ;) However, I was looking into some part time data science gigs or even trying for some Kaggle competitions using my skillset - I'm probably not that great compared to those people who literally do it for a living but it's worth a shot! I've heard that some PhD students are sought out for part time consulting jobs as subject matter experts, which seems cool because you wouldn't be doing something that requires an entirely new skillset or knowledge foundation. Anyway, good luck! I hope you find something that helps both you and your mom.",
      "author": "sr41489",
      "created": 1639431438,
      "upvotes": 1,
      "replies": {}
    },
    "hofwyqv": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hofwyqv/",
      "text": "I’m an electrical engineering PhD student. Depends lab to lab, but my advisor encourages us to take internships during the summer. most of my lab mates and I have gotten positions that pay between $30-$50/hr depending on company and location. It’s a HUGE way to supplement your stipend as well as network if you’re interested in returning to industry when you’re done. \n\nI also have an Etsy shop and sell my work at craft fairs, which gets me a couple grand a year. It’s a huge time sink and I only do it because I genuinely enjoy doing it, but if you have some sort of skill like that it might be a bit easier than selling your eggs or plasma lol\n\nIt does sound like you’re a bit nervous about taking the huge pay cut from engineering industry, which is totally understandable. If you have $75k in savings by the time you start your PhD and it takes you 5 years to finish, you’d end up with about $15k a year from savings to live off of in addition to your stipend. That’s nothing to balk at, and is definitely doable on its own as long as you’re smart about managing your budget. I’d recommend talking to a financial advisor to possibly put that savings into a short term investment account or high yield savings account so you can earn a little extra money from it existing. I’d also recommend making sure you have reliable versions of costly items like your car, laptop, phone, etc to minimize surprise expenses like that during your PhD.",
      "author": "eigencrochet",
      "created": 1639437565,
      "upvotes": 1,
      "replies": {}
    },
    "hog0noe": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hog0noe/",
      "text": "Private tutoring is an easy way to make money. It's typically $45/hr and up for most science/math tutoring. If you can get into an engineering PhD program high school math should be very doable for you. Pre pandemic I would tutor 3-4 students on weekends for a bit of extra cash.",
      "author": "acmwx3",
      "created": 1639439173,
      "upvotes": 1,
      "replies": {}
    },
    "hogbkdx": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hogbkdx/",
      "text": "Its pocket change but prolific.co pays you to do studies. I donate plasma and the experience really depends on the center and employees. Please dont contribute to the housing shortage by becoming a landlord. Have you looked into the process of donating eggs? I did only briefly and it seems intense.",
      "author": "boxdkittens",
      "created": 1639444585,
      "upvotes": 1,
      "replies": {}
    },
    "hoglfv7": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoglfv7/",
      "text": "Sorry this is off topic but is donating plasma and eggs common in the US? :s",
      "author": "advstra",
      "created": 1639449059,
      "upvotes": 1,
      "replies": {}
    },
    "hoh69b4": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoh69b4/",
      "text": "I pay dog sitters a lot of money to watch my dogs lol. I’ve suggested to my fellow grad students that they should get on Rover.com to make extra cash",
      "author": "Silky_pants",
      "created": 1639459192,
      "upvotes": 1,
      "replies": {}
    },
    "hoh9i1l": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoh9i1l/",
      "text": "I know im late to the party but please read this. Head over to r/thetagang or kamikaze cash on youtube and learn how to sell options. With 75k you could buy 400 shares of apple and sell 4 covered calls every week (or however frequently you want) at the .3 Delta for 500-600 dollars a week.",
      "author": "Glocks1nMySocks",
      "created": 1639461150,
      "upvotes": 1,
      "replies": {
        "hoh9lhi": {
          "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoh9lhi/",
          "text": "Hell if you turn on margin you could double that to $1000 a week",
          "author": "Glocks1nMySocks",
          "created": 1639461210,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoep43x": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoep43x/",
      "text": "Sell feet pics on the DL. Write papers for undergrads for a shit ton of money 💵",
      "author": "EcoRavenshaw",
      "created": 1639419552,
      "upvotes": -3,
      "replies": {}
    },
    "hoezdxy": {
      "link": "/r/GradSchool/comments/rfgvx4/extra_income_advice/hoezdxy/",
      "text": "maybe do people assignment on chegg",
      "author": "sahasrara62",
      "created": 1639423652,
      "upvotes": -1,
      "replies": {}
    }
  }
}