{
  "sid": "qsss9u",
  "link": "/r/GradSchool/comments/qsss9u/i_am_literally_consumed_by_thoughts_of_my_study/",
  "title:": "I am literally consumed by thoughts of my study. Can’t think about anything else",
  "text": "I’m a First year psychology PhD trying to get a study up and running. It has a lot of moving parts and basically it’s not perfect. I am constantly running through the study in my head and trying to come up with a better design. It doesn’t stop. It’s all consuming. I know the study still has issues but ruminating on it constantly is ruining my life.\n\nHelp. Advice. Plz. Thanks",
  "author": "millystelescope96",
  "created": 1636775911,
  "updated": 1637182752,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hkf6e8b": {
      "link": "/r/GradSchool/comments/qsss9u/i_am_literally_consumed_by_thoughts_of_my_study/hkf6e8b/",
      "text": "Yeah, no, rumination just causes me to think in circles and get little progress done. \n\nGo outside. Go for long walks/ runs/ hikes/ bikes/ drives to somewhere new. Put effort into focusing on your immediate environment. Feel the air and sunlight on your skin, the mushy soil beneath your hiking boots, the adrenaline of flying down a hill on your bike. Taste all the flavors of a food you've never tried before. Write about it all in a journal. \n\nI'm being all poetic and shit, but honestly. You gotta do it. Let the analytical parts of your brain rest. Go focus on some observation without judgement (analysis).",
      "author": "daisynets",
      "created": 1636777194,
      "upvotes": 3,
      "replies": {}
    },
    "hkf5lxz": {
      "link": "/r/GradSchool/comments/qsss9u/i_am_literally_consumed_by_thoughts_of_my_study/hkf5lxz/",
      "text": "Consider yourself lucky. Most of us just want to lay in bed and ignore the impending doom.",
      "author": "redditknees",
      "created": 1636776754,
      "upvotes": 1,
      "replies": {}
    },
    "hkfaa5a": {
      "link": "/r/GradSchool/comments/qsss9u/i_am_literally_consumed_by_thoughts_of_my_study/hkfaa5a/",
      "text": "I've never done a single perfect thing in my life, but now when I look back on some of the stuff I completed during my Ph.D., I'm always surprised by how good it turned out. Just yesterday I realized I had invented something potentially important on the way to something else that's going kinda poorly.\n\nMy point is, just do your best and don't be too hard on yourself. You're probably doing way better than you think.",
      "author": "UmiNotsuki",
      "created": 1636779483,
      "upvotes": 1,
      "replies": {}
    },
    "hkfo0h6": {
      "link": "/r/GradSchool/comments/qsss9u/i_am_literally_consumed_by_thoughts_of_my_study/hkfo0h6/",
      "text": "There is no such thing as the perfect study and there never will be. Have justifications for your research design and explanations for why you can't do it another way or add something more (even if it is simply cost or resources). That is all you need.\n\nYou're a first-year, there will be plenty of opportunities to do more experiments and hopefully fill the gaps in this study.",
      "author": "JenAnnMad",
      "created": 1636789179,
      "upvotes": 1,
      "replies": {}
    }
  }
}