{
  "sid": "qvebfk",
  "link": "/r/GradSchool/comments/qvebfk/how_to_understand_cursive_writing_research/",
  "title:": "How to understand cursive writing!? (Research problems..)",
  "text": "I wish I would have paid more attention to the cursive lessons my parents tried to make me do...sigh.\n\nDownloading old government correspondence off of microfilm from the 1920s and it's all in cursive I can barely read...anyone know an app for this? lol a transcribe app or a service online that enjoys transcribing old cursive lol",
  "author": "DakotagurlSD",
  "created": 1637086878,
  "updated": 1639881450,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hkvxav9": {
      "link": "/r/GradSchool/comments/qvebfk/how_to_understand_cursive_writing_research/hkvxav9/",
      "text": "Honestly, its just practice. Lots of practice. The 1840s has the most illegible handwriting I've seen to the point my transcriptions are often half [????]. And I had to learn and use cursive in elementary and middle school and its still my main form of handwriting. I'm fine with most of it, but there are some individuals and time periods that are harder to read than others. But really, what you need to do is just keep working at it. Eventually you learn what shapes in that persons' handwriting equate to what letters. I'm not a historian, but a historical archaeologist and so have spent a ton of time in archives and courthouses.\n\nI'd definitely find some books and start teaching yourself cursive though. This is an issue historians have been talking about for the past few years, what to do when the non-cursive literate generations start needing to do manuscript research. I've worked with high schoolers in archives before who don't know cursive and most pick it up pretty quick, so I'd just keep going with it and trying until it clicks.",
      "author": "archaeob",
      "created": 1637088649,
      "upvotes": 5,
      "replies": {
        "hkzr6ga": {
          "link": "/r/GradSchool/comments/qvebfk/how_to_understand_cursive_writing_research/hkzr6ga/",
          "text": "Yeah! And maybe ask your subject specialist (i.e. history) librarian at your university library. There may be some helpful guide books. I've seen Transkribus being developed at my university for reading historical texts with AI ([https://transkribus.eu/lite/](https://transkribus.eu/lite/)). Woot woot.",
          "author": "funkykookaburra",
          "created": 1637160609,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkvufes": {
      "link": "/r/GradSchool/comments/qvebfk/how_to_understand_cursive_writing_research/hkvufes/",
      "text": ">Downloading old government correspondence off of microfilm from the 1920s and it's all in cursive I can barely read...anyone know an app for this?\n\nYour grandma? 😄\n\nSeriously. I don't know an app. But someone in their 60s or older would be very used to cursive and most likely would be able to help you read it.",
      "author": "raistlin65",
      "created": 1637087528,
      "upvotes": 3,
      "replies": {}
    },
    "hlkrw5d": {
      "link": "/r/GradSchool/comments/qvebfk/how_to_understand_cursive_writing_research/hlkrw5d/",
      "text": "I would also suggest you start practicing writing in cursive. This will go along way to read it, and give you a great tool.",
      "author": "EcceFelix",
      "created": 1637539845,
      "upvotes": 1,
      "replies": {}
    }
  }
}