{
  "sid": "py0lbp",
  "link": "/r/GradSchool/comments/py0lbp/what_is_a_competitive_applicant_for_chemistry_phd/",
  "title:": "What is a \"competitive\" applicant for chemistry PhD programs?",
  "text": "I'm asking mostly out of the context from my own stats. I'm presently a senior undergrad biology major interested in pursuing a PhD in chemistry. The research I've been doing has been mostly in chemical properties of nucleic acids (transcription, etc). I am also open to studying molecular biology or biochemistry, but noticed most of these programs are offered through chemistry departments. I've been researching programs and labs and noticed some of the programs I am interested in are historically \"selective\" schools. \n\nMy experiences have mostly been doing research (two academic labs over the entire course of undergrad), and as a teaching assistant for an upper level undergrad / entry grad genetics course. I have also done a co-op in industry at a pharmaceutical for analytical development. \n\nI am worried about applying to programs given my GPA is \\~3.4. I did poorly one semester sophomore year (due to personal issues) and it set me back, but I have gotten on dean's list every semester since then and is on an upward trend. \n\nI've asked professors, career services, people that have been on admissions boards, and even my PI if I would be a good fit for PhD programs and it seems like they all say I would likely get in to *some* program if it is what I want to pursue, though I am not entirely sure what that means. \n\nI'm not sure which types of schools I should be applying to where I would be considered competitive for admission. I know higher tier schools like MIT and CalTech probably want closer to a 4.0 GPA, but I was wondering if a school like UC San Diego would be reasonable for me to apply with a decent shot? \n\nI know no admission is \"guaranteed\", but I am looking for some kind of security in the programs I choose to apply to, that way I can sleep at night. \n\nTIA\\~",
  "author": "hexgirll",
  "created": 1632937364,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "her1lke": {
      "link": "/r/GradSchool/comments/py0lbp/what_is_a_competitive_applicant_for_chemistry_phd/her1lke/",
      "text": "Perhaps you need to get several of the folks you've spoken with separately--esp. your PI and other profs--together in the same room and make them aware of the universities you have in mind and if your GPA and research experience are good enough for the programs to have you considered by the admissions committee. Probably also wouldn't hurt to reach out to these chemistry departments that you have an interest in and find out about what the average profile of an accepted applicants (for M.S. and Ph. D.) look like. \n\nYou should seriously consider taking the GRE (if it is optional) which may help compensate for your GPA. While showing improvement in your GPA is good, adding on additional data for their consideration will likely help you. Take a free practice GRE so you can get an idea of what your baseline scores are without doing any kind of prep work and present those results to your circle of informal advisors.",
      "author": "qwertyrdw",
      "created": 1632938747,
      "upvotes": 1,
      "replies": {}
    },
    "hesfioi": {
      "link": "/r/GradSchool/comments/py0lbp/what_is_a_competitive_applicant_for_chemistry_phd/hesfioi/",
      "text": "Have a chemistry PhD, went to a competitive school.\n\nYour biggest barrier isn’t your GPA, by a long shot.\n\nYour biggest barrier is your background.\n\nI know exactly zero people in my program that had non chemistry/chemical engineering degrees.  Doesn’t mean they didn’t exist, but they weren’t plentiful.\n\nYou’re going to have to convince a group of chemistry faculty that a biologist without any chemistry undergraduate research is capable of knowing/learning enough in grad school to understand the field, understand the edge of the field, learn how to do great research at the edge of the field, and excel at it all.\n\nCan I ask you why you want to pursue a chemistry PhD in the first place?  How do you have enough experience within chemistry research to know that you want to dedicate your life to it?  All your work appears to be in biology/biochemistry/genetics.  That’s an honest question, btw, I’m not trying to trip you up.  That might shed light on your best path.",
      "author": "Weekly-Ad353",
      "created": 1632960317,
      "upvotes": 1,
      "replies": {
        "hesgj5p": {
          "link": "/r/GradSchool/comments/py0lbp/what_is_a_competitive_applicant_for_chemistry_phd/hesgj5p/",
          "text": "[deleted]",
          "author": null,
          "created": 1632960801,
          "upvotes": 1,
          "replies": {
            "hesgurq": {
              "link": "/r/GradSchool/comments/py0lbp/what_is_a_competitive_applicant_for_chemistry_phd/hesgurq/",
              "text": "Are you interested in applying to pure chemistry programs or biochemistry?  The groups, I mean.\n\nIgnore the department they’re located in.",
              "author": "Weekly-Ad353",
              "created": 1632960960,
              "upvotes": 1,
              "replies": {
                "heskyrl": {
                  "link": "/r/GradSchool/comments/py0lbp/what_is_a_competitive_applicant_for_chemistry_phd/heskyrl/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1632962884,
                  "upvotes": 1,
                  "replies": {
                    "heslftv": {
                      "link": "/r/GradSchool/comments/py0lbp/what_is_a_competitive_applicant_for_chemistry_phd/heslftv/",
                      "text": "Seems fine.\n\nThey probably just mean your background isn’t a perfect fit for an applicant for those programs but not so far off to get denied everywhere.",
                      "author": "Weekly-Ad353",
                      "created": 1632963095,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hesnsa5": {
      "link": "/r/GradSchool/comments/py0lbp/what_is_a_competitive_applicant_for_chemistry_phd/hesnsa5/",
      "text": "One of the professors who wrote my letter of rec told me with your status, I will be lucky to get accepted to my undergrad institution.. I applied and got into several good PhD programs. \n\nJust apply and see wht happens.",
      "author": "MOUDI113",
      "created": 1632964197,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634064908
}