{
  "sid": "qh4t16",
  "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/",
  "title:": "Picking between industry or going through with grad school [Computer Science]",
  "text": "Hello,\n\nIm in a CS undergrad program. Initially I anticipated doing the whole SWE thing. Technical interviews, leetcode, DSA, etc. But I have ran into some material in my classes that make me wonder if I would enjoy grad school.\n\nI think days spent working on interesting problems in an area of my choice sounds great. What doesnt sound great is the pay. In addition to this im not in my early 20s anymore. So putting off a respectable salary for 4-6 more years sounds almost irresponsible.\n\nIn my previous career I experienced pay similar to what one would get at FAANG. (FAANG is just an acronym for the \"top\" tech companies for those unfamiliar.) The work, for a large number of reasons was uninspiring and draining.\n\nWhat is your experience with working industry? Does the work at places like FAANG keep you entertained? Or does it turn into a daily grind of coding on similar problems that you've seen before? Im trying to avoid getting into a job with high salary only to have to force myself to get out of bed 5 years from now.\n\nNow this is my assumption. A Phd would keep me entertained at the cost of higher pay. This isnt a deal breaker for me. But I would need a good reason to pull the trigger. I dont want to be a professor per se. I just want to work on interesting things that have an impact that is positive. Something my pervious career did not.\n\nWhat im asking in pretty vague after reading it back. So, I will summarize.\n\nTL;DR, Im worried that pursuing a high salary in industry right out of undergrad will leave me uninspired and bitter a few years from now. Im entertaining the idea of grad school but not sure about the outcomes for someone who currently doesnt want to be a professor. I like the idea of having the freedom to work on interesting things with smart people who are equally passionate. Is this something I can find in industry with a bachelors ? or should I seriously consider getting a Phd/MS?",
  "author": "Mooon_Dogg",
  "created": 1635363772,
  "updated": 1635457649,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hiakgfs": {
      "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hiakgfs/",
      "text": ">So putting off a respectable salary for 4-6 more years sounds almost irresponsible.\n\n\nSo do a Masters, which is a two-year commitment. And during your third semester, then you can decide if you want to go further for the PhD.\n\nBut you better decide quickly. It's getting close to too late to see letters of recommendation in time for applying for either.",
      "author": "raistlin65",
      "created": 1635366593,
      "upvotes": 2,
      "replies": {
        "hias754": {
          "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hias754/",
          "text": "I guess I didn't specify, I still have two years left in undergrad. Im asking these questions now because I want to start moving in one direction or the other. (Grad school/ industry).",
          "author": "Mooon_Dogg",
          "created": 1635369597,
          "upvotes": 2,
          "replies": {
            "hiau3p4": {
              "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hiau3p4/",
              "text": "I think you might be getting ahead of yourself.\n\nWhere you are in you're thinking now could easily be different from where you'll be when it becomes time to make a decision.\n\nSo do your best in your course work until then. That's going to pay off for you whatever direction you go.",
              "author": "raistlin65",
              "created": 1635370353,
              "upvotes": 2,
              "replies": {
                "hib2fow": {
                  "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hib2fow/",
                  "text": "yeah I probably am some.\n\nI just know that research is important for grad admissions. So if thats the way  I want to go. I was going to start looking for research opportunities. \n\n&#x200B;\n\nThanks for taking the time to add.",
                  "author": "Mooon_Dogg",
                  "created": 1635373803,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hiamb9o": {
      "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hiamb9o/",
      "text": "I worked in industry for a bit and am now in a PhD program doing computational science. For me at least, work (including research) always ends up being kind of a grind, no matter how interesting the job is on principle. Industry has certain benefits over academia (higher pay, generally better work/life balance, more structure), while academia offers somewhat more flexibility and potentially more opportunities for personal growth/development. \n\nAlso, keep in mind that as a CS grad student in the post-covid era, there's a good chance you'll be working alone (my research group has been remote since March 2020). Graduate work tends to be pretty solitary in general. So if you're more interested in working collaboratively on a problem, I'd honestly recommend industry over academia.",
      "author": "clandestine_cactus",
      "created": 1635367296,
      "upvotes": 2,
      "replies": {
        "hiarwfe": {
          "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hiarwfe/",
          "text": "Ahhh thanks for the insight,\n\nYeah like I said I would like working on a team. Or at least be in an environment where im around people working on things that they like. I generally like the college environment to include the typical college town atmosphere that comes with it. \n\n&#x200B;\n\nIm more concerned with the nature of problems I can expect in industry. Im sure there are some interesting ones. Just worried that I will encounter fewer of those.",
          "author": "Mooon_Dogg",
          "created": 1635369479,
          "upvotes": 1,
          "replies": {
            "hiauk39": {
              "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hiauk39/",
              "text": "FWIW, I was really dissatisfied with my SWE job, kind of for the reasons you mention but also because I felt like my professional development was really stagnating (although I wasn't working for a FAANG company, can't really speak to what that experience is like). I definitely don't want to dissuade you from pursing grad school. I think what the other commenter said about doing an MS is sound advice. Good luck!",
              "author": "clandestine_cactus",
              "created": 1635370535,
              "upvotes": 2,
              "replies": {
                "hib289x": {
                  "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hib289x/",
                  "text": "I appreciate your response.",
                  "author": "Mooon_Dogg",
                  "created": 1635373714,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hibbm8c": {
      "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hibbm8c/",
      "text": "I’m currently doing a master’s to test drive my research aptitude in CS before deciding on whether or not to go down the PhD route. This is coming from someone who had opportunities to pursue research in undergrad, but was too shortsighted to think realistically about what the SWE life was like. \n\nSpent 3 years as a SWE at a couple of companies, only to realize that it gets boring very quickly and that I fell for the “constantly learning and innovation”, but then again I was working at companies where no real innovation was happening (F500s copying tech trends because so and so are doing it). Problems essentially were less about engineering and more about how to idiot proof code.\n\nA lot of people seem to be more concerned about the financial opportunity cost of doing a master’s, but for me it was more about the intellectual stimulation and working on something exciting with high upside and risk. Then again, be mindful of your own financial circumstances before taking the leap because many would probably berate me for offering advice seemingly from a “privileged” perspective.",
      "author": "murdoc_dimes",
      "created": 1635377903,
      "upvotes": 2,
      "replies": {
        "hibuayk": {
          "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hibuayk/",
          "text": "Yeah im trying to avoid that. I've made good money before and I wasnt happy at work. To be fair the reasons for that were probably way different than your reasons. Since, its two completely different fields.\n\nmy financial situation is, not by much, but slightly more favorable than a typical grad student. I have a small amount of income that would probably cover rent in most places. I guess that would make it a little more bearable.\n\nI was reading up on a professor I encountered at my current school. He works in the field im interested in and most of his mentees are now working at FAANG as researchers. With a couple teaching. So I guess I will by asking him if I can help him in the lab.\n\n&#x200B;\n\nI appreciate your input. Thanks for taking the time.",
          "author": "Mooon_Dogg",
          "created": 1635386168,
          "upvotes": 2,
          "replies": {
            "hid1sp9": {
              "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hid1sp9/",
              "text": "Sure, just curious, what were your reasons for not being happy as a SWE?\n\nAlso, if you ever want to spitball ideas, feel free to DM me!",
              "author": "murdoc_dimes",
              "created": 1635414769,
              "upvotes": 2,
              "replies": {
                "hif0oqk": {
                  "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hif0oqk/",
                  "text": "Well I wasnt a SWE, I just had a salary comparable to one. I worked for the military and then a large corporation as an intelligence analyst. I could write you a book about why it sucked.\n\nTo name a few reasons, my job was to essentially, put words in grossly incompetent government workers mouths. So they could then parrot it back in meetings and briefings to someone else. The resultant decisions being made by the previously mentioned workers were wasteful, impulsive and idiotic at most points. If the facts diddnt line up with agenda there was a tendency to discard them. Or pressure to make them line up, so they could implement things they had already decided on. Then there were of course, moral implications to this work.\n\n&#x200B;\n\nI will definitely keep that in mind, Im sure I will need to bounce something around from time to time. I appreciate the offer!\n\nedited\\*\\* to say my original post was ambiguous at a couple points, my bad.",
                  "author": "Mooon_Dogg",
                  "created": 1635447837,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hibtlob": {
      "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hibtlob/",
      "text": "Personally I would go directly into industry if I got a job offer after my bachelors that seemed appealing. I'm currently getting a masters (not in CS) but would not have if I had had an exciting job lined up.... Your end goal here either way would be industry right, you're not planning on a career in academia? You can pretty much always go back and get a masters after you start working if you decide you don't love it. If you plan to pursue a PhD after that point, focus on publishing at least one paper during your masters. I would say doing one semester of research during undergrad is likely smart regardless to see how you like it. I'm not in CS but I have a sister who is and works in Google and I know she finds her tasks exciting and is enjoying the more strucutred days and collaborative environment. Most larger companies also have a lot of training oppertunities and flexibilty for moving around to other teams. I know she is considering eventually getting a PhD and her advisor from her masters mentioned that she shouldn't wait too long especially if it's important for her to go to a prestigious school or if she wants to pursue a career within academia, but at this point it may be something she ends up doing for fun when she retires.",
      "author": "Puzzled_Season_1881",
      "created": 1635385862,
      "upvotes": 2,
      "replies": {
        "hicaev8": {
          "link": "/r/GradSchool/comments/qh4t16/picking_between_industry_or_going_through_with/hicaev8/",
          "text": "Both are tempting, the end goal is just job satisfaction. You're right I don't want to do academia, not saying that couldn't change. Maybe I would really like teaching. But, I think the role a PhD would grant me in industry might be more to my liking. I've done some digging at my current institution. One professor in particular has mentored quite a few people who are now working as researchers a google in AI. Which is what I would broadly want to go into. \n\n&#x200B;\n\nThanks for your perspective.",
          "author": "Mooon_Dogg",
          "created": 1635394008,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}