{
  "sid": "qr8lbj",
  "link": "/r/GradSchool/comments/qr8lbj/is_this_academic_dishonesty/",
  "title:": "Is this academic dishonesty?",
  "text": "A few months back I finished my Independent study masters and my Ms advisor wanted me to help her get the work published in journal in our field.  Since I was starting my PhD I told her I would help as much as I could but I needed to focus getting my PhD research off the ground which she was fine with.  I get a draft of the paper today and I find out that large sections of it were copy and pasted from my independent study document. I am credited as an author on the paper but it seems strange to just blatantly copy and paste from one document to a journal article without at least acknowledging the original source. Like I said I'll be listed as author so credit isn't an issue ,but is this a normal thing that happens in research academia?",
  "author": "the_wires_dun_moved",
  "created": 1636591066,
  "updated": 1636656499,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hk5k01c": {
      "link": "/r/GradSchool/comments/qr8lbj/is_this_academic_dishonesty/hk5k01c/",
      "text": "> I am credited as an author on the paper but it seems strange to just blatantly copy and paste from one document to a journal article without at least acknowledging the original source.\n\nNo, this isn't an issue, and it's certainly not academic dishonestty. Lots of papers - especially for grad students - start off as class essays. I've never seen an article \"acknowledge\" that it came from a class paper. There's no point in doing so. No one cares. If it had been *previously published somewhere else,* then yes, you'd have an issue, but what you're describing is common practice.",
      "author": "wetbogman2",
      "created": 1636598415,
      "upvotes": 11,
      "replies": {}
    },
    "hk54d6m": {
      "link": "/r/GradSchool/comments/qr8lbj/is_this_academic_dishonesty/hk54d6m/",
      "text": "She should have asked you for permission first or at least indicate that your work would go into the paper.\n\nIt’s not academic dishonesty because what’s going on is she’s basically giving you credit as a coauthor for your work but she didn’t tell you about it explicitly. So strange",
      "author": "darknessaqua20",
      "created": 1636591432,
      "upvotes": 6,
      "replies": {}
    },
    "hk64ftv": {
      "link": "/r/GradSchool/comments/qr8lbj/is_this_academic_dishonesty/hk64ftv/",
      "text": ">Since I was starting my PhD I told her I would help as much as I could but I needed to focus getting my PhD research off the ground which she was fine with. I get a draft of the paper today and I find out that large sections of it were copy and pasted from my independent study document.\n\nThere you go. She addressed your concern that you wouldn't have much time to participate in drafting by pulling your contributions from your paper. Seems like to me that was a very good way to get a solid draft accomplished.\n\nNow that there is a draft, you can revise any of that text that you want. You don't have to leave it in the original. \n\n>I am credited as an author on the paper but it seems strange to just blatantly copy and paste from one document to a journal article without at least acknowledging the original source.\n\nThe original wasn't a published work. And as someone else already pointed out, quite often papers written for class are further developed into journal articles. Heck, dissertation chapters are often developed into journal articles.",
      "author": "raistlin65",
      "created": 1636608827,
      "upvotes": 5,
      "replies": {}
    }
  }
}