{
  "sid": "r0we6x",
  "link": "/r/GradSchool/comments/r0we6x/the_time_before_a_holiday_is_the_least_productive/",
  "title:": "The time before a holiday is the least productive time",
  "text": "Maybe it’s just me, but I feel super unproductive a couple of days before a holiday. Like right now, 2 days before thanksgiving in the US and I can’t get anything done",
  "author": "snorlaxkg",
  "created": 1637728144,
  "updated": 1638208034,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 1.0,
  "comments": {
    "hlv1qih": {
      "link": "/r/GradSchool/comments/r0we6x/the_time_before_a_holiday_is_the_least_productive/hlv1qih/",
      "text": "I was similar in grad school. I had tunnelvision for my break...But then I overworked on holiday too often. In retrospect, I wish I would have spaced it out but, that's hard!",
      "author": "chlcwelc",
      "created": 1637728308,
      "upvotes": 5,
      "replies": {}
    },
    "hlxl20h": {
      "link": "/r/GradSchool/comments/r0we6x/the_time_before_a_holiday_is_the_least_productive/hlxl20h/",
      "text": "If you can't focus, then spend less time on work and more focusing on the holidays. The worst thing you can do is feel guilty about not working before the holidays and then trying to work during the holidays. Alternatively you can use this time to take a step back, review your accomplishments and plan your future work. Personally, I would back up my data and organize my folders right before holidays when I couldn't focus well.",
      "author": "local_man_says",
      "created": 1637779267,
      "upvotes": 3,
      "replies": {}
    },
    "hlwc3kd": {
      "link": "/r/GradSchool/comments/r0we6x/the_time_before_a_holiday_is_the_least_productive/hlwc3kd/",
      "text": "I do easy stuff.  Like reformatting grass. Collecting mindless data. Organizing files.  Things I need to do but can't be bothered when I am productive. That way it doesn't feel like a total waste",
      "author": "grounded_out",
      "created": 1637760458,
      "upvotes": 3,
      "replies": {}
    },
    "hlwa43c": {
      "link": "/r/GradSchool/comments/r0we6x/the_time_before_a_holiday_is_the_least_productive/hlwa43c/",
      "text": "I feel like that's very normal... I wouldn't worry too much about it honestly. Everyone in my department is extra happy around the holidays and we usually spend more time than usual just talking with each other the few days before holiday. Don't beat yourself up. We're all human.",
      "author": "MIA_8542",
      "created": 1637759342,
      "upvotes": 1,
      "replies": {}
    },
    "hlx6bxt": {
      "link": "/r/GradSchool/comments/r0we6x/the_time_before_a_holiday_is_the_least_productive/hlx6bxt/",
      "text": "I've noticed this trend in myself and started just taking that time off. Why sit at my desk wasting time while I could be doing anything else?",
      "author": "rox_et_al",
      "created": 1637773529,
      "upvotes": 1,
      "replies": {}
    },
    "hly8755": {
      "link": "/r/GradSchool/comments/r0we6x/the_time_before_a_holiday_is_the_least_productive/hly8755/",
      "text": "Struggling with this right now. And it’s the time I should be more productive than ever, with the quarter finishing up.",
      "author": "RadicalizeMe58",
      "created": 1637788377,
      "upvotes": 1,
      "replies": {}
    }
  }
}