{
  "sid": "rhac9l",
  "link": "/r/GradSchool/comments/rhac9l/mendeley_desktop/",
  "title:": "Mendeley desktop?",
  "text": "I made the mistake of updating from mendeley desktop to mendeley reference manager. It's terrible. If you have a choice hold off or at least dont do it in the middle of writing multiple major projects.         Does anyone know how I can roll back or be able to download the desktop version again. I need the full functionality of the desktop version.   Thank you!",
  "author": "maybethisisntused",
  "created": 1639604963,
  "updated": 1639788534,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hophvxp": {
      "link": "/r/GradSchool/comments/rhac9l/mendeley_desktop/hophvxp/",
      "text": "I used to be a diehard mendeley fan, but recently gave up on it. Updated it recently after a bit of a hiatus and none of the web importer functions seemed to work. Even before that, I always had to manually input issue and volume numbers and it was terrible at grabbing information from PDFs. \n\nI recently switched to zotero and haven’t looked back.  It’s so easy to use and their chrome extension rocks.",
      "author": "ducbo",
      "created": 1639609560,
      "upvotes": 6,
      "replies": {
        "hoqsor9": {
          "link": "/r/GradSchool/comments/rhac9l/mendeley_desktop/hoqsor9/",
          "text": "Are you entering things into Mendeley by simply entering the DOI? I'm just getting into Mendeley and find it useful",
          "author": "Extreme-Scientist-75",
          "created": 1639631070,
          "upvotes": 1,
          "replies": {
            "horna4y": {
              "link": "/r/GradSchool/comments/rhac9l/mendeley_desktop/horna4y/",
              "text": "You should try Zotero. It's really comfortable and it's free too",
              "author": "_goat123",
              "created": 1639653371,
              "upvotes": 3,
              "replies": {}
            },
            "hos75xd": {
              "link": "/r/GradSchool/comments/rhac9l/mendeley_desktop/hos75xd/",
              "text": "I was primarily using the web importer but I used their desktop program search function for a while as well. I confirmed with mendeley customer service about two years back that some functionality was removed in importing volume and issue numbers no matter which route. So there was a level of manual work I had to do. I ended up writing out my own citations for a few publications after that and just recently switched to zotero after picking up mendeley again and realizing it still sucks.",
              "author": "ducbo",
              "created": 1639664667,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}