{
  "sid": "qemxc7",
  "link": "/r/GradSchool/comments/qemxc7/another_i_dont_like_my_graduate_program_thread/",
  "title:": "Another “I don’t like my graduate program” thread.",
  "text": "I was excited for graduate school, but now that I’m here I strongly dislike my courses and honestly, most of my cohort. \n\nI’m doing a master’s degree in public policy but 90% of my coursework is essentially a large glass of critical race theory with a small splash of public policy. It’s something to have a class or two about but this is really the entire curriculum. I’m not learning anything particularly applicable, it feels as though I’m wasting my time but I won’t be able to get a job without a master’s in my field so I’m basically stuck here for another 3 semesters.\n\nI’m putting the bare minimum into my coursework in order to get decent grades while I try to improve myself, do internships, or have fun on the weekends with friends. If I was doing just the degree I think I would jump off a bridge.\n\nI was so pumped for graduate school but I made a bad decision and went for a program that gave me decent funding but possesses a curriculum I just don’t care enough about. It feels alienating and depressing. Thank you for coming to my Ted talk.",
  "author": "Tiny_Heron2458",
  "created": 1635058745,
  "updated": 1635185358,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hhuv8oh": {
      "link": "/r/GradSchool/comments/qemxc7/another_i_dont_like_my_graduate_program_thread/hhuv8oh/",
      "text": "Yes grad school has been different than expected for me as well. I won’t learn all the skill sets I expected, so I’m branching out to research and internship to provide me with a little more of skills I need.",
      "author": "MotvStr",
      "created": 1635080613,
      "upvotes": 3,
      "replies": {}
    },
    "hhvaqo2": {
      "link": "/r/GradSchool/comments/qemxc7/another_i_dont_like_my_graduate_program_thread/hhvaqo2/",
      "text": "It sounds like you don’t actually understand what critical race theory is and you don’t care to understand how the intentional marginalization of certain communities/vulnerable populations has shaped systems… or how public policy can be created/applied to create more equitable conditions within these systems.",
      "author": "jtg_95",
      "created": 1635088319,
      "upvotes": 7,
      "replies": {
        "hhvgh78": {
          "link": "/r/GradSchool/comments/qemxc7/another_i_dont_like_my_graduate_program_thread/hhvgh78/",
          "text": "Oh yeah I don’t understand what it is, I’m only in a program whose entire curriculum is devoted to the topic. Thank you for your enlightenment, my weak feeble mind needed it.\n\nNo need for any quantitative curriculum, some basic economics and ethics.",
          "author": "Tiny_Heron2458",
          "created": 1635090857,
          "upvotes": -2,
          "replies": {
            "hhvh8ye": {
              "link": "/r/GradSchool/comments/qemxc7/another_i_dont_like_my_graduate_program_thread/hhvh8ye/",
              "text": "Critical race theory is a legal framework. Unless you are a legal scholar, I highly doubt that you are formally engaging with as much critical race theory as you think you are.",
              "author": "jtg_95",
              "created": 1635091191,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "hhuc51t": {
      "link": "/r/GradSchool/comments/qemxc7/another_i_dont_like_my_graduate_program_thread/hhuc51t/",
      "text": "Go somewhere else.",
      "author": "p53lifraumeni",
      "created": 1635066224,
      "upvotes": 2,
      "replies": {
        "hhvgaeh": {
          "link": "/r/GradSchool/comments/qemxc7/another_i_dont_like_my_graduate_program_thread/hhvgaeh/",
          "text": "Or else what?",
          "author": "Tiny_Heron2458",
          "created": 1635090774,
          "upvotes": -1,
          "replies": {
            "hhvj96k": {
              "link": "/r/GradSchool/comments/qemxc7/another_i_dont_like_my_graduate_program_thread/hhvj96k/",
              "text": "They're telling you to transfer to another school. Wouldn't hurt to apply and see if you get funding for somewhere else. I know GA State has a good MPP program and George Washington University",
              "author": "Ainteazybeingwheezy",
              "created": 1635092029,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "hhy5npq": {
      "link": "/r/GradSchool/comments/qemxc7/another_i_dont_like_my_graduate_program_thread/hhy5npq/",
      "text": "How do you know the next three semesters will be like that too? Seems difficult to predict that all of your classes will be like that when you haven't taken them yet.",
      "author": "raistlin65",
      "created": 1635135096,
      "upvotes": 1,
      "replies": {}
    }
  }
}