{
  "sid": "qkaxkq",
  "link": "/r/GradSchool/comments/qkaxkq/has_anyone_ever_reported_their_academic/",
  "title:": "Has anyone ever reported their academic advisor/supervisor and things actually improved after that?",
  "text": "Has anyone ever reported their academic advisor/supervisor and things actually improved after that?\n\nFrom what I've read, it is not uncommon for supervisors to retaliate after they get reported.",
  "author": "Diplocriterion",
  "created": 1635762041,
  "updated": 1636198739,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hivadmq": {
      "link": "/r/GradSchool/comments/qkaxkq/has_anyone_ever_reported_their_academic/hivadmq/",
      "text": "Reported for what?  \n\n\nEither way, I would imagine things would not improve for most supervisors if you report them for any reason. It is quite rare that people see the error of their ways and genuinely change, mostly they will either not change or change because of the consequences of not changing.",
      "author": "C29372",
      "created": 1635762442,
      "upvotes": 5,
      "replies": {
        "hiw6u4z": {
          "link": "/r/GradSchool/comments/qkaxkq/has_anyone_ever_reported_their_academic/hiw6u4z/",
          "text": "They don’t change.",
          "author": "cracklin_oats",
          "created": 1635780796,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hiwb4wz": {
      "link": "/r/GradSchool/comments/qkaxkq/has_anyone_ever_reported_their_academic/hiwb4wz/",
      "text": "I want to scream this from the mountaintops but reddit will suffice: YOU CAN CHANGE ADVISORS AT ANY TIME. If your advisor is harassing you, talk to your DGS and inform them that you will be switching advisors. Don't ask permission, don't take no for an answer. Remember, your advisor is important not just for your time in the lab, but for most of your early career progress, especially if you want to stay in academia. Don't shoot yourself in the foot because you don't want to \"go through the hassle\" or \"stir the pot.\" You are only hurting yourself, while giving them credit for graduating another student and getting papers out of their lab.\n\nETA: by anytime, I mean literally anytime. A month from graduating and your advisor is threatening to force you to stay for the cheap labor? Switch advisors. A month into your first year and your advisor turns out to be a real dick? Switch advisors. Don't ask for permission, it will only hurt your future.",
      "author": "hiagha",
      "created": 1635782671,
      "upvotes": 10,
      "replies": {
        "hiy07eg": {
          "link": "/r/GradSchool/comments/qkaxkq/has_anyone_ever_reported_their_academic/hiy07eg/",
          "text": "100% agree with this.",
          "author": "Mgyr23",
          "created": 1635808060,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiw6oez": {
      "link": "/r/GradSchool/comments/qkaxkq/has_anyone_ever_reported_their_academic/hiw6oez/",
      "text": "I went to the committee we have for this kinda stuff (faculty committee) to report my advisor for his short comings. They told me to mentor up, talk with him. I did, it was tense. He thanked me for bringing to his attention. Said he was still learning because he’s new. \n\nThings didn’t improve. I can’t say for sure but I’ve sort of become ostracized from lab. He cultivates a feeling of collaboration for all members and their projects except mine. It’s not a big deal though because I got a 3 year fellowship on my own. My committee took notice recently of my poor performance and basically took over and no I report to them every other month. I’m grateful for them because they noticed my advisor isn’t doing shit and basically saved me.",
      "author": "cracklin_oats",
      "created": 1635780723,
      "upvotes": 4,
      "replies": {}
    },
    "hiwaw2y": {
      "link": "/r/GradSchool/comments/qkaxkq/has_anyone_ever_reported_their_academic/hiwaw2y/",
      "text": "If you leave and get a new adviser yeah",
      "author": "rustyfinna",
      "created": 1635782562,
      "upvotes": 3,
      "replies": {}
    },
    "hiws5rl": {
      "link": "/r/GradSchool/comments/qkaxkq/has_anyone_ever_reported_their_academic/hiws5rl/",
      "text": "Nope! Nearly every grad student in the lab reported the PI, either to the department or HR, and not a single thing happened. \n\nWe all left for different labs and everybody is way way way happier and more successful.",
      "author": "Pr0gr3s",
      "created": 1635789800,
      "upvotes": 1,
      "replies": {}
    },
    "hiz5t34": {
      "link": "/r/GradSchool/comments/qkaxkq/has_anyone_ever_reported_their_academic/hiz5t34/",
      "text": "Not that I’ve ever seen. Luckily I was already admitted elsewhere for a different position and have an advisor who is a genuinely good human, and a supportive new dept. but back at the old one? Dumpster fire with burned bridges and ptsd.",
      "author": "sylphrena83",
      "created": 1635828259,
      "upvotes": 1,
      "replies": {}
    }
  }
}