{
  "sid": "quicgm",
  "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/",
  "title:": "I really like the idea of having a PhD, but I'm struggling to care about my thesis overall.",
  "text": "I've come to the realization that I've been pretty depressed for several months now.\n\nThere's many aspects of my PhD that I like, including the field work, making new discoveries, learning more about the field, meeting new and interesting researchers...\n\nBut overall, I've run out of steam when it comes to my thesis. I don't really care about developing an idea for my third chapter, and I just can't envision what the next couple years will look like.\n\nI really like the idea of completing and having a PhD, but I don't know if the journey is worth the destination.",
  "author": "Levangeline",
  "created": 1636988456,
  "updated": 1637182690,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.85,
  "comments": {
    "hkqn3fq": {
      "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hkqn3fq/",
      "text": "I feel like one should have a goal in mind when it comes to grad school. Just having a PhD isn't really enough of a goal. \n\nI'm in the same boat, for what it's worth. I used to have career goals that would require a PhD but I don't think those are important to me anymore. I'm kind of still emotionally attached to the idea of finishing a PhD, but I'm getting to the point where I don't think it's worth it to force myself just for the title. I'm strongly considering mastering out.",
      "author": "KiwiTheKitty",
      "created": 1636995915,
      "upvotes": 8,
      "replies": {
        "hkqnlgr": {
          "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hkqnlgr/",
          "text": "Yeah, I honestly don't know at this point. I like the idea of doing creative consulting and subject matter expertise work, and I like researching and discovering new things, but I dunno if the framework of the PhD is really the best one for me. I dunno, it's hard to know what to do.",
          "author": "Levangeline",
          "created": 1636996115,
          "upvotes": 2,
          "replies": {
            "hkqpkdc": {
              "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hkqpkdc/",
              "text": ">I dunno, it's hard to know what to do.\n\nYeah I really feel you on that, unfortunately life is kind of always like that. I really wish I could get some kind of cosmic insight or something about whether I will regret mastering out because it would really help me make a decision, but unfortunately that's not possible. \n\nBut when I think about finishing my proposal, let alone actually doing the work to finish the degree, I just want to cry and I don't think I should be forcing myself through that for 2-3 more years. Especially since there are jobs out there that only require Master's degrees that I would be happy doing. \n\nThere are still times though where I'm like yeah I could totally do this! Or I talk to other grad students in my department and I'm reminded about how great my advisor is in comparison to theirs and I feel guilty for giving up the chance, but... I also don't think guilt or being emotionally attached to the project and the lab are great reasons to force myself through it either. \n\nThe job hunt also scares me... With a Master's degree, I would also be in a much much better spot for finding a job in my field (bio) than I was with just a bachelor's, but I'm a little traumatized from the brief amount of time I spent looking at jobs during my gap year. But all I need is one job and even if it pays kind of poorly, it'll still be pretty much guaranteed to be double my grad school stipend. I would love to be able to afford the things I've been putting off or that are a pain to save for because I make less than a living wage for my city... also moving to a new city would be great because I don't like it here.\n\nI don't mean to ramble haha, but that's a peek into my thought process. It's really hard to separate all the feelings trying to convince me to stay vs the logic that I really don't need to stay. Even though my advisor is amazing and so caring (and has been supportive when I talked to him about considering about all this), trying to decide if I want to leave my program feels a lot like when I was trying to convince myself to break up with my abusive ex boyfriend years ago. And then I'm like ok if a PhD program or anything reminds you of an emotionally abusive ex, you need to gtfo! \n\nBut yeah I'm really sorry about the ramble, this is something I've been thinking a lot about lately. You aren't alone!",
              "author": "KiwiTheKitty",
              "created": 1636996902,
              "upvotes": 1,
              "replies": {
                "hkr96ks": {
                  "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hkr96ks/",
                  "text": "Nah that's okay, it is really tough! I have similar feelings about guilt and giving up an opportunity and a supervisor who cares about me a lot. I also wish I could just have some external force tally up all the pros and cons about my situation and spit out a decision for me 😩\n\nSounds like you've got a lot to think about, I know how tough that is. Thanks for your insight and best of luck with your situation.",
                  "author": "Levangeline",
                  "created": 1637004653,
                  "upvotes": 2,
                  "replies": {
                    "hkrdck3": {
                      "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hkrdck3/",
                      "text": "Good luck! I'm sure you'll be able to make it work no matter what decision you come to",
                      "author": "KiwiTheKitty",
                      "created": 1637006287,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hkqswb9": {
              "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hkqswb9/",
              "text": "My usual advice to those contemplating a PhD: If there is something you absolutely have to do to have a fulfilling life, and that thing can only be accomplished with the training a PhD provides, then you should go to grad school. Else, not.",
              "author": "IkeRoberts",
              "created": 1636998215,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hkvcmln": {
          "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hkvcmln/",
          "text": "Same boat here. I've been drifting away from pursuing academics after graduating with my PhD, and thus it's a lot harder to justify the vast amounts of time and effort it would take to finish if in going to industry anyway",
          "author": "booksmart00",
          "created": 1637080617,
          "upvotes": 2,
          "replies": {
            "hkvi32y": {
              "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hkvi32y/",
              "text": "Haha there's one thing I never wanted, to stay in academia. I used to want to be a PI in a USDA lab or something similar, but I don't think I care enough to want that level of responsibility anymore.",
              "author": "KiwiTheKitty",
              "created": 1637082759,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hksdgay": {
          "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hksdgay/",
          "text": "> I feel like one should have a goal in mind when it comes to grad school.\n\nAbsolutely key in my experience. I'm a teacher, so a Master's is more or less required. I have quite a few friends and co workers who started around the same time as me.\n\nAlmost universally, the people that went in knowing what they wanted to study (and why), regardless of field, mostly enjoyed their programs and did well. The ones who just sort of fell into it with, \"well I need an MEd/MS/whatever\" but didn't have any plans for their research or how they'd apply the degree afterwards are miserable.\n\nA Master's is hard work, and I can only imagine a PhD is even harder. It's not the kind of thing that seems possible, or worthwhile, if your heart isn't in it.\n\nSomeone else suggested taking a break, and that seems like good advice. When you get back (or during that time) I'd do some serious reflection on how to move forward. How much flexibility do you have in your thesis? Is it possible to change directions somewhat to a topic you're more invested in? Have you talked to anyone other than reddit about this? Burn out happens, interest in projects wanes, etc. I'd assume this happens to students all the time, and someone at your university (advisor, therapist, etc.) has some experience with this and can give you some guidance. \n\nIf not, what's your exit plan? My understanding is it's sometimes possible to \"Master's out\" of a program so the time isn't wasted. Is getting a PhD critical to your other life goals? If you can take your Master's, run, and still do something you want to do, then why bang your head against the wall for a couple letters next to your name?",
          "author": "BPRoberts",
          "created": 1637020948,
          "upvotes": 1,
          "replies": {
            "hkvbvna": {
              "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hkvbvna/",
              "text": "Yeah I've been taking breaks and I've talked to plenty of people about this, including my advisor. I've been reflecting on this for months. \n\nI wrote a super long rant about the live to work, 'I have work/life balance because work *is* life' attitude I encounter a lot and the fact my dreams have changed and I don't really care about being a PI and answering questions in biology anymore, but you probably don't need to hear it haha\n\nI'm like 99% decided I'm going to Master out at this point. I would rather just get a lab tech job where I can peace out at the end of the day and have the money and time to do things that actually matter to me.",
              "author": "KiwiTheKitty",
              "created": 1637080324,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkr55ry": {
      "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hkr55ry/",
      "text": "Usually when I start feeling this way it's an indication that I need a vacation/break. Have you done this recently? It helps get you out of your routine, relax, and reset. Your description makes it seem like you generally enjoy most aspects of being a grad, but you're just a bit burned out and unmotivated at the moment (we've all been there). Take time for yourself and remember that you're probably not going to love every aspect of any career.",
      "author": "rox_et_al",
      "created": 1637003055,
      "upvotes": 1,
      "replies": {
        "hkrg83r": {
          "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hkrg83r/",
          "text": "I haven't had a proper break in a very long time, since I jumped right from my Masters into a PhD. I definitely think a break might be needed, it's just a bit daunting to arrange since I'm already in the middle of my thesis.",
          "author": "Levangeline",
          "created": 1637007431,
          "upvotes": 1,
          "replies": {
            "hkrsnpa": {
              "link": "/r/GradSchool/comments/quicgm/i_really_like_the_idea_of_having_a_phd_but_im/hkrsnpa/",
              "text": "I'm not suggesting anything too extreme, such as an entire semester or a year (though that sounds great). I'm just saying to take a week for yourself. You could spend a bunch of money on some fancy vacation if that's your style or go camping. Taking a week off a few times a year is very normal for grad students, even in the middle of thesis work. Integrating time like this into your schedule should actually increase productivity because it will help reduce burnout and the lack of motivation you're currently experiencing.",
              "author": "rox_et_al",
              "created": 1637012278,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    }
  }
}