{
  "sid": "bguw87",
  "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/",
  "title:": "Rant alert: folks in academia are absolutely useless when it comes to helping you find job.",
  "text": "Like I get it, they've been in academia forever so that's all they know, but come on, you really have no contacts in the community you can set me up with? Also, telling me to volunteer until I find work isn't exactly a viable option since I need money??? My mentors are lovely people, by have been goddamn useless in the job hunt.",
  "author": "cash40",
  "created": 1556114067,
  "over_18": false,
  "upvotes": 341,
  "upvote_ratio": 0.95,
  "comments": {
    "elpi4ki": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elpi4ki/",
      "text": "I think it is important to look at what a professor's students generally do after graduating to see if it matches your desired path. I was given this advice by another professor when I asked him about working in his lab. He said he might be able to fund me, but I'd probably be better off with the professor I ended up working for and collaborating with him, because their research areas overlapped.\n\nI guess I was fortunate to have an advisor who was well connected in his field of study and has a lot of former students all over the industry. We consider ourselves a big family and we look out for each other as much as we can. There is a certain conference we all attend that is kind of like a \"family reunion\".\n\nMy advisor never really had too many former students go into academia. He's not sure why, but it is what it is.",
      "author": "jrajala",
      "created": 1556155748,
      "upvotes": 1,
      "replies": {}
    },
    "elpe4bh": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elpe4bh/",
      "text": "Most people in my field/institute purposely pair with advisors with proper connections if they think they might want to leave academia. \n\nI think your advisor should be supportive of your desires but I’m not sure why people expect them to get the job for you... it’s just a bonus.\n\nBut yeah I hope mine does lol",
      "author": "PM_ME_INVERTEBRATES",
      "created": 1556152969,
      "upvotes": 1,
      "replies": {}
    },
    "elpcr5d": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elpcr5d/",
      "text": "You hitched your wagon to a failing academic then. There is a lesson to learn for new HDRs - Do your homework and select an appropriate supervisor. My supervisor provided me multiple job opportunities, even before I finished my PhD.",
      "author": "edubya15",
      "created": 1556152046,
      "upvotes": 1,
      "replies": {
        "elpe7s4": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elpe7s4/",
          "text": "Basically, yeah.",
          "author": "cash40",
          "created": 1556153038,
          "upvotes": 1,
          "replies": {}
        },
        "ep5bzdl": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/ep5bzdl/",
          "text": "Says the moron who follows Jordan Peterson, a failed academic.",
          "author": null,
          "created": 1559053511,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "elox8gc": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elox8gc/",
      "text": "I mean... duh? They've literally been in academia their entire careers. They know how to train people for academia. They have contacts to get you postdocs. It is a failing of the system that schools don't have more networking events and education to help those that want to go into industry after grad school. \n\nIn my opinion your PI should be supportive of you doing what you need to do to go into industry after grad school. But I don't think it's on them in any way to be able to help you transition into that field.",
      "author": "DarthCharizard",
      "created": 1556141544,
      "upvotes": 9,
      "replies": {}
    },
    "elohl24": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elohl24/",
      "text": "That’s not their job.",
      "author": "BubuBarakas",
      "created": 1556132366,
      "upvotes": 3,
      "replies": {}
    },
    "elohij8": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elohij8/",
      "text": "Professors may have contacts, but constantly tossing new names at them will burn bridges fast. There's also the possibility that the candidate could perform poorly which will make it harder to recommend anyone else in the future.\n\nI've seen a handful of occasions where professors nudged students to certain opportunities. These were cases where the students were clearly high potential, and it was the professors who approached them, knowing they'd be a perfect fit for something.\n\nProfessors are professors, not job recruiters. Go to your school career center or network at relevant gatherings. If you're having problems finding a job, that's completely on you. If you think people owe you any assistance, that's probably why you're having trouble landing a job.",
      "author": "NimblyOwl",
      "created": 1556132323,
      "upvotes": 2,
      "replies": {
        "elorna3": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elorna3/",
          "text": "I agree with you to some extent. However, as mentioned in this forum, the school career center is a sh\\*t show. The other problem is that most professors seem to overly promise graduate students that there is a high chance for them to have a full-time job with a high salary after graduating from their programs, which is farthest from the truth. In other words, many graduate students are being deceived from the truth. Also, another problem is that people within academia look down on graduate students who want to pursue a career that's outside of academia.",
          "author": "anon_405",
          "created": 1556138155,
          "upvotes": 3,
          "replies": {
            "elovinq": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elovinq/",
              "text": "There's enough publicly available data for students to research industry employment trends. Anyone at the graduate level has no excuse for neglecting to put in some due diligence.\n\nUnless a program has outright lied on their employment report, professor/program opinions are just that, opinions. Even with matching personal research, program employment report, and professor opinions, industry is always at risk of a sudden downturn.\n\nWhen it comes to finding an industry job, it isn't the smartest students who get the best offers, it's the students who work the hardest at networking, job searching, and interview prep. Hopefully your program is ranked high enough to be competitive in the current environment, but you'll still have to be ready to prove why you're different and add more value than anyone else coming from an equal or higher ranked school.\n\nI've been working in industry a few years now and only 2 out of 6 recommended students from my school have made it to a job offer. I personally thought all six were outstanding, but there are over 200 applicants for each opening. If I referred every student who pinged me on LinkedIn or the school asked me to consider, the hiring managers would tell me to stop spamming them with mountains of crap.\n\nIf one of them performs poorly, it will reflect on me, and my future credibility to recommend great candidates is shot. If any of your professors saw you as the perfect fit that would boost their reputation, they will approach you. If you're not where you want to be with finding a job, the likely remedy is to take more personal responsibility and give the job hunt everything you have.",
              "author": "NimblyOwl",
              "created": 1556140458,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "elofs66": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elofs66/",
      "text": "Yeah I purposely picked a program with a lot of industry connections.",
      "author": "pm-ing_you_bacteria",
      "created": 1556131284,
      "upvotes": 2,
      "replies": {}
    },
    "elod2r0": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elod2r0/",
      "text": "[deleted]",
      "author": null,
      "created": 1556129695,
      "upvotes": 5,
      "replies": {
        "eloxyqe": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/eloxyqe/",
          "text": "I wish my conferences were valuable. Despite my very applied field, the conferences I went to were basically an old dude academic circle jerk.",
          "author": "cash40",
          "created": 1556142023,
          "upvotes": 3,
          "replies": {}
        },
        "elohew4": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elohew4/",
          "text": "Yes! I’m surprised I had to scroll so far down to see this. Conferences were invaluable to me for industry connections.",
          "author": "yogibella",
          "created": 1556132262,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "elocua8": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elocua8/",
      "text": "I completely agree with you. One of my professors was proud of themselves when they started sincerely telling students about LinkedIn and Indeed. When this professor was politely informed that both platforms had been around for a decade, they were completely shocked.",
      "author": "PopCultureNerd",
      "created": 1556129549,
      "upvotes": 3,
      "replies": {}
    },
    "elo7qsl": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo7qsl/",
      "text": "The most useful thing you can do is to scan job listings early and often. I check Indeed, LinkedIn, USAJobs, and my state government's job site weekly to see what's out there, who's hiring, and what skills are in demand. I follow organizations that look promising on LinkedIn, especially those that have hired alumni. \n\nIf you can go to your advisor with something specific, like \"Do you know anyone that might have connections at Potential Employer?\" or \"Do you know anyone that works as a Job Title that I might be able to talk to?\", you might get a better response.",
      "author": "sonamata",
      "created": 1556126543,
      "upvotes": 3,
      "replies": {}
    },
    "elo5vcn": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo5vcn/",
      "text": "I asked my advisor before I joined their lab if they had any contacts in industry and they said yes, even gave me a list of names. I thought that was reassuring at the time. Later found out, all those people were people they went to school with years ago, hadn't spoke to them since, barely knew each other. They had no interest or reason to help my advisor out. \n\nActually, I had asked my advisor once if I could talk to someone they knew in industry and they got really defensive. Straight up refused to give the info at first because they said they were afraid I'd might find a job and leave...\n\nNeedless to say, they've haven't been very helpful in my job search. The older students in my lab complained about the same thing when they graduated (they were the first to graduate from the lab). If I hadn't done an internship, which I found completely on my own, I'd be completely hopeless.\n\nEdit: grammar",
      "author": "stathicus",
      "created": 1556125398,
      "upvotes": 13,
      "replies": {}
    },
    "elo56po": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo56po/",
      "text": "That's not exactly true, for instance my brother just graduated with a PhD in electrical engineering and his advisor got him 4 interviews which all lead to job offers of $120,000 per year. It all depends what you're studying and for who. Professors who get funding from industry will get you a job without problem.",
      "author": "TheNarwhaaaaal",
      "created": 1556124995,
      "upvotes": 4,
      "replies": {
        "elo9lnh": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo9lnh/",
          "text": "I think the experience that you described in your comment especially applies to engineering.",
          "author": "anon_405",
          "created": 1556127658,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "elo4p4i": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo4p4i/",
      "text": "Network, network, network! Go on LinkedIn and find people who share your alma mater, past grad students that moved to industry, even if you have the slightest connection with them- reach out. I was in the same position and am currently interviewing because of a connection I made with a past graduate student who is now in biotech. My PI also had zero industry contacts and actually made things more stressful. I've also had really good response rates with Indeed, especially using the resume match when applying. Hope that helps!",
      "author": null,
      "created": 1556124720,
      "upvotes": 6,
      "replies": {}
    },
    "elo3zx6": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo3zx6/",
      "text": "Advisor: why don't you try some part-time jobs or whatever while your thesis gets published\n\nMe: It doesn't work like that anymore...",
      "author": "injuredpoecile",
      "created": 1556124319,
      "upvotes": 18,
      "replies": {
        "eloxsux": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/eloxsux/",
          "text": "Literally this. I told my advisor yesterday that I was on the job hunt and he was like \"worry about publishing first.\" (I'm an MS student). I was like \"Haha (*finger guns*) publishing is cool, but I need money to...you know. Eat.\"",
          "author": "cash40",
          "created": 1556141916,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "elo3p4v": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo3p4v/",
      "text": "My advisor's advice was to ignore the guidelines on how long my cover letter should be and that I should stop being so personable. Because people always want to work with someone who is arrogant and never smiles. /s\n\nI take all advice from the older professors at the department with a grain of salt since they haven't been on the job market for 20+ years. (They also believe we have to suffer just as much, if not more, than they suffered, rather than helping us not have to suffer through such things.)",
      "author": "fleeingslowly",
      "created": 1556124149,
      "upvotes": 8,
      "replies": {}
    },
    "elo1b7d": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo1b7d/",
      "text": "Don't give up. With a practical master's and eight months' experience, I had to apply to 117 jobs to get my first position. \n\nMy advice is:\n\n* Apply to 3-5 jobs every day, Monday through Friday. Even if it seems like it's not a perfect match. Even if you don't have exactly their qualifications. Often, overzealous higher-ups stack the candidate profiles in the hopes of getting more than the salary they're willing to pay. If you're the most qualified in the stack, that it often enough.\n* That shit about networking, while annoying, is real. Do you know someone who knows someone who got hired at XYZ Corp? Ask them if they can put you in touch with a manager at XYZ corp. They may not have a job today, but they now know you. If there's ever a \"who referred you to this job?\" box on the bottom of an application, you have a name to put. This does make a difference.\n* Be willing to live somewhere shitty.",
      "author": null,
      "created": 1556122731,
      "upvotes": 20,
      "replies": {}
    },
    "elo0s29": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo0s29/",
      "text": "Does anyone have any tips for other resources to utilize?",
      "author": "will6566",
      "created": 1556122409,
      "upvotes": 1,
      "replies": {}
    },
    "elnxjk7": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnxjk7/",
      "text": "Have you had any internships during your PhD? For people who know they want to go into industry after a PhD, it is pretty important to get 1-2 summer internship experiences under the belt. \n\nI think it is usually easier to find postdocs than industry jobs or academic jobs. If postdocs last long (3-4 or more years), that usually hurts while trying to go back to industry (people assume you wanted to be an academic, couldn't, failed and now you are switching). But I've heard postdocs of 1-2 years (if you are gaining valuable skills for industry) tend to help with job search. If you can't find a job right away, you might want to do a short postdoc instead of volunteering (I'm assuming you are finishing up your PhD?).\n\n I agree, it's quite shocking for your advisor to tell you to volunteer. Firstly, most companies would not want to have volunteers: that's just too complicated work law-wise (since it is free labor). Secondly, have they never had to support themselves and depended on rich parents or something? Weird.",
      "author": "stumpindie",
      "created": 1556120463,
      "upvotes": 8,
      "replies": {}
    },
    "elnwl4d": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnwl4d/",
      "text": "My adviser is in his 80's. I talk about where I want to move, and the type of chemistry I'm interested in. He drops names about people he knows that have done the pioneering work on this or discovered that. I ask him if I can have those people's contact information.  \n\n\n\"Oh they're dead.\"",
      "author": "hdorsettcase",
      "created": 1556119884,
      "upvotes": 116,
      "replies": {
        "elob8we": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elob8we/",
          "text": "“So should I get a shaman then?”\n\nThat’s absurdly hilarious though.",
          "author": "EmpathyIsAHabit",
          "created": 1556128631,
          "upvotes": 41,
          "replies": {}
        }
      }
    },
    "elnw88o": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnw88o/",
      "text": "I say we should create some kind of national association of graduate students that addresses certain issues pertaining to graduate students, which includes, but not limited to, finding career options besides academia after graduating with a graduate degree. This proposed association should also help address the fact that the good jobs (and not post-doctoral fellowships and not adjunt proffesorship positions) are very scarce and rarely exist.",
      "author": "anon_405",
      "created": 1556119674,
      "upvotes": 21,
      "replies": {
        "elobq3r": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elobq3r/",
          "text": "If it doesn’t exist yet, sounds like a great idea! I’m sure there are quite a few people on this sub capable of putting something like this together!",
          "author": "EmpathyIsAHabit",
          "created": 1556128902,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "elnw6du": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnw6du/",
      "text": "This makes me realize how privileged I am to have an advisor with ties to industry and government. A significant amount of his students do not stay in academia. He has managed to keep in contact with previous mentees and use that information to aid current students.",
      "author": "Wine-and-wings",
      "created": 1556119645,
      "upvotes": 26,
      "replies": {
        "elnygf0": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnygf0/",
          "text": "Winner, winner, chicken dinner. . . \nI’m in the midst of completing my master’s degree. If/when I pusue my PhD, I’m going to try to look for an advisor with direct ties to the industry.",
          "author": "anon_405",
          "created": 1556121008,
          "upvotes": 9,
          "replies": {}
        },
        "elnzh4f": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnzh4f/",
          "text": "Same here, our lab actually sends many more people to industry than academia.",
          "author": "abovepostisfunnier",
          "created": 1556121629,
          "upvotes": 3,
          "replies": {}
        },
        "elob7vc": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elob7vc/",
          "text": "Same, all my supervisor’s students have gone into industry.  I chose to remain in academia as a tech but I still had the chance to meet with his former students at conferences and such and got great advice and contacts through them.",
          "author": "PalatableNourishment",
          "created": 1556128615,
          "upvotes": 1,
          "replies": {}
        },
        "elp6u5j": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elp6u5j/",
          "text": "Same here. My advisor been a big help at getting me to present my research to non-academic audiences that could help me find work after graduation.",
          "author": "femalenerdish",
          "created": 1556147908,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "elnv0ig": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnv0ig/",
      "text": "It has been my experience that anybody who has been a professor prior to the market tanking is absolutely clueless when it comes to both academic and nonacademic jobs. \n\n“Psssh! You don’t need publications.  Or presentations. Or grants. Just market well that you’re from a Big Ten school and people will be flying off the handle to hire you.” 🙄",
      "author": null,
      "created": 1556118938,
      "upvotes": 32,
      "replies": {
        "elp6c5x": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elp6c5x/",
          "text": "Agreed. All the tenure positions are being grandfathered out at my institution, and being replaced with 1 or 2 year contracts. Advisers don't seem to grasp either (or just don't want to admit) that the longer they're all staying in their jobs (also a flow on effect from the 2008 recession), the less space there is to hire new blood. People are working well into their 70s now, and I'm on 14 week semester contracts :(\n\nEDIT: plus so many of the post doc positions have been cut so it's even more competitive and only 10% of PhD grads in Australia will be able to even get a post doc position",
          "author": "magpiekeychain",
          "created": 1556147552,
          "upvotes": 7,
          "replies": {}
        },
        "elnwqiw": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnwqiw/",
          "text": "When would you say the market tanked?",
          "author": "Average650",
          "created": 1556119974,
          "upvotes": 4,
          "replies": {
            "elo0dd7": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo0dd7/",
              "text": "More properly, I would say the recession of 2008. I don’t have much of a frame of reference since I’ve never been on the job market for a serious career prior to that, though. I wouldn’t be surprised if academic jobs started tightening up prior to that.",
              "author": null,
              "created": 1556122164,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "elnu5qu": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnu5qu/",
      "text": "It sucks. You gotta network to get a job now a days . Look at alumni on LinkedIn and see if any would talk to you about their career path. I cold emailed many this way and most were willing to help!\n\nI ended up in a career I didn’t even know existed when I started my search, and love it!",
      "author": "NeuroscienceNerd",
      "created": 1556118428,
      "upvotes": 14,
      "replies": {
        "elnvgwu": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnvgwu/",
          "text": "what job did you end up with?",
          "author": "littolady",
          "created": 1556119222,
          "upvotes": 2,
          "replies": {
            "elnwr7l": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnwr7l/",
              "text": "Scientific Sales Consultant/Account Manager",
              "author": "NeuroscienceNerd",
              "created": 1556119986,
              "upvotes": 3,
              "replies": {
                "elnx3qu": {
                  "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnx3qu/",
                  "text": "Do you have to be the typical go-getter/marketer/salesperson to be a scientific sales consultant? I’m curious.",
                  "author": "anon_405",
                  "created": 1556120199,
                  "upvotes": 1,
                  "replies": {
                    "elnxl93": {
                      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnxl93/",
                      "text": "No. At least at my company the product sells itself. People come to you, you don’t need to go to them. You just have to answer a lot of questions, design labs for them/talk science. \n\nI am more introverted, but people really like and respect a sales person that has a lot of knowledge and does not pressure them. I also visit clients a lot and troubleshoot their software issues.",
                      "author": "NeuroscienceNerd",
                      "created": 1556120491,
                      "upvotes": 8,
                      "replies": {
                        "elryebx": {
                          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elryebx/",
                          "text": "When I got out of undergrad (before getting another job and then going back to grad school), I worked in device sales.  It isn't so much sales as it is consulting.  Marketing department does most of the 'selling' so the customer comes to you and your job is just to help the customer get exactly what they need.\n\nI personally found it boring which is why I have moved on, but you definitely don't need to be the 'car salesman' type.",
                          "author": "RexScientiarum",
                          "created": 1556224947,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "elns3s3": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elns3s3/",
      "text": "My advisor and I talked about my options after I graduate with my master’s degree. Although, overall, he’s a good mentor, he also provided me with outdated advice, which involves going to any workplace and dropping off a cover letter and resume. This piece of advice is a big no no in today’s job hunt.",
      "author": "anon_405",
      "created": 1556117199,
      "upvotes": 22,
      "replies": {
        "elns8sg": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elns8sg/",
          "text": "I also got outdated and useless advice, like \"make sure you dress professionally.\" Like, yes? I've worn a suit to every job interview I've had since I was 17.",
          "author": "cash40",
          "created": 1556117286,
          "upvotes": 21,
          "replies": {
            "elnvq5i": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnvq5i/",
              "text": "Not only is the advice that you received outdated, but it is also demeaning.",
              "author": "anon_405",
              "created": 1556119374,
              "upvotes": 15,
              "replies": {
                "elnw0za": {
                  "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnw0za/",
                  "text": "Incredibly so. I get it, I mostly wear leggings/jeans and tees to school, but I'm smart enough to dress up when I need to. And every presentation/awards ceremony/conference, I've always dressed incredibly professionally, so it isn't like there was indication that I didn't know how to do that.",
                  "author": "cash40",
                  "created": 1556119559,
                  "upvotes": 19,
                  "replies": {}
                }
              }
            }
          }
        },
        "elnvpfc": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnvpfc/",
          "text": "That or cold calling the company for a job inquiry. Good luck even finding the right recruiter to call, if they entertain calls at all",
          "author": "tackykcat",
          "created": 1556119362,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "elnrr32": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnrr32/",
      "text": "A professor in my department rode on the coattails of his advisor, got a job back in the 1990s almost immediately after graduating, and now spends most of his time constantly warning graduate students not to get their hopes up about landing an academic job.\n\nI guess it's better than luring grad students into a false sense of security, but fuck me if it isn't infuriating.",
      "author": "purple_ombudsman",
      "created": 1556116989,
      "upvotes": 19,
      "replies": {
        "elnsbe5": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnsbe5/",
          "text": "Seems very honest. It's not his fault that the situation sucks (mostly).",
          "author": "______Passion",
          "created": 1556117328,
          "upvotes": 35,
          "replies": {}
        }
      }
    },
    "elnqu3k": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnqu3k/",
      "text": "I loved my advisor but I can't imagine she would have been much help if I'd tried to rely on her for a job outside of academia. Many folks are heavily embedded in academia, and most if not all of their friends are in academia also. Hell, even her sister was a professor. So was her spouse.\n\nI think many faculty would like to help more, but they can't. For those who would like to help more, you'd have to wonder what kind of training they would need. I think even just learning how to talk to students about their career options would be helpful - like basic career counseling skills. But how many would do it?\n\nI do think there's no excuse for them to not be aware of the crisis *within* academia. Almost every school subscribes to the Chronicle of Higher Education, Inside Higher Ed, or something similar. But I do think that those who've been successful in academia, especially those under 40, put their blinkers on in grad school saying \"la la la there is no crisis I'll be fine\" and that ignorance/denial carried into their TT jobs, and now it's validated their beliefs. They always avoided the bad news.",
      "author": "doobeedoo3",
      "created": 1556116436,
      "upvotes": 40,
      "replies": {
        "elnsgei": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnsgei/",
          "text": "Personally, I don't see it as my advisor's job to help me find a career in industry if that's what I end up pursuing.  Like yes, maybe he could get training about options what different industries are looking for.  But on top of advising students, teaching courses, doing his own research, and service to the department, that's a lot to ask for.  And the reality is that I would be better off receiving that training than my advisor, considering that I'm the one actually looking for a job while my advisor has tenure.",
          "author": "cwkid",
          "created": 1556117410,
          "upvotes": 16,
          "replies": {
            "elo6rrg": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo6rrg/",
              "text": "Agreed. \n\nI think one thing faculty could do quite easily would be to legitimize the idea of going into industry, or not pursing a PhD, etc. To remove the shame and stigma of that idea would be huge. Just having someone say \"So what kind of jobs are you thinking about?\" without feeling personally threatened and projecting this onto a student would make many students' lives easier. \n\nI'm in a professional program now and it's so refreshing to have professors encouraging instead of discouraging my goals.",
              "author": "doobeedoo3",
              "created": 1556125952,
              "upvotes": 17,
              "replies": {
                "eloxdk5": {
                  "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/eloxdk5/",
                  "text": "Wait that's a thing? Maybe I'm just lucky but in my department we all kinda know who's going to industry and who's staying in academia. It's no big deal, it's just different things suit diff people. Plant/agri has a lot of industry links. It's normal for people to plan to move to industry after grad school. Ironically I'm the only PhD in my lab and the neighbouring lab with industry experience and I'm the one most dead set on an academic post doc.",
                  "author": "Gartlas",
                  "created": 1556141634,
                  "upvotes": 2,
                  "replies": {
                    "elpojt5": {
                      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elpojt5/",
                      "text": "Plenty of posts on this sub about people being terrified to announce they want to leave academia. For some, it's not seen so much as going in a different direction as failing to stay on the academic path.\n\nNot all profs are like this, and just because a student is scared to say something doesn't mean it's a warranted fear - but there's definitely a culture around it. I don't see it at all in my current program.",
                      "author": "doobeedoo3",
                      "created": 1556160057,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "elu1txq": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elu1txq/",
          "text": "Mine was the same. Fantastic advisor, totally useless when it came to helping me find a job. I never held it against him though, he helped shape me into the scientist I am today and gave me guidance that helped me develop soft skills (how to present yourself and your work, interview, talk about your project to people who don't know the niche field you're in etc.) I needed to land my current job in industry.\n\nHe too told me it would only take me a couple of months to find a job since I had a decent number of publications, conference presentations and a good GPA coming out of grad school. If only it were that easy...\n\nBasically spammed my resume to every job that looked remotely tied to my field and ended up getting a job directly as a result of what I did in academia so in that sense I feel lucky, but it was not great on the mental health, I'll tell you hwat.",
          "author": "ColickingSeahorse",
          "created": 1556289764,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "elnpz4h": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnpz4h/",
      "text": "Ahh yes. My grad advisor recommended I do an academic post doc even though I was interested in industry because “it can only help” which is entirely untrue. He also couldn’t understand why I wouldn’t want to continue in academia. It’s hard because everyone in academia has only ever been in academia, so they have no idea how things work outside it. \n\nI applied to over 100 positions. Being “entry level” and “unqualified” with my PhD but no post grad experience, I had trouble finding positions looking for my qualifications. Ultimately, startups will be your best route. \n\nI had the most luck looking for jobs on LinkedIn.",
      "author": "goodusernamestaken_",
      "created": 1556115900,
      "upvotes": 98,
      "replies": {
        "elnuh4z": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnuh4z/",
          "text": "Unfortunately, I have found that most industry positions want you to do a postdoc, even if it doesn’t directly apply to the position. So many people apply that they might as well take someone with postdoc experience, especially if the job is research based.\n\nIt’s doable to not do a postdoc, but it’s hard! Took me about 8months to make the transition.",
          "author": "NeuroscienceNerd",
          "created": 1556118617,
          "upvotes": 34,
          "replies": {
            "elnvu5x": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnvu5x/",
              "text": "I went with an industry postdoc. Not as good as a senior scientist position, but still a lot better than an academic postdoc.",
              "author": "kirby726",
              "created": 1556119441,
              "upvotes": 17,
              "replies": {
                "elnwpy3": {
                  "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnwpy3/",
                  "text": "Nice!",
                  "author": "NeuroscienceNerd",
                  "created": 1556119964,
                  "upvotes": 2,
                  "replies": {}
                },
                "elqvk18": {
                  "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elqvk18/",
                  "text": "When you say \"industry postdoc\" . . . is it officially called a post doc? Or is it a fellowship or something that's basically a post doc but just not in a university",
                  "author": null,
                  "created": 1556201038,
                  "upvotes": 1,
                  "replies": {
                    "elr2nqt": {
                      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elr2nqt/",
                      "text": "My title is postdoctoral fellow at a company. My advisor/boss applied for funding (from the company) for a postdoc position for a specific project and then hired me. It may be different at different companies. I have a committee to oversee my progress on said project and they will determine if my contract should be extended for a third year (if I want). The committee process is far less intense than grad school committee. I can add an academic PI to my committee but otherwise I am not affiliated with any University or Institution other than the company I work for. My project is outside of the drug development pipeline for now but I do help the other people that work for my boss with their projects that are in the drug development pipeline.",
                      "author": "kirby726",
                      "created": 1556205508,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "elq94mg": {
                  "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elq94mg/",
                  "text": "Not necessarily. It pays more to do an industry postdoc, but an academic postdoc from the right lab is generally a better career launching point than an industry postdoc.",
                  "author": "billyhoylechem",
                  "created": 1556178513,
                  "upvotes": -1,
                  "replies": {}
                }
              }
            },
            "elnybgo": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnybgo/",
              "text": "Yes, some do want post doc experience. Many prefer industry post doc experience though, so at least you’re out of academia!\n\nFrom starting the application process to job offer was about 3 months for me, but I had already completed my degree at that time, so I was able to put all my efforts into applications and job searching.",
              "author": "goodusernamestaken_",
              "created": 1556120923,
              "upvotes": 5,
              "replies": {}
            },
            "elo0oax": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo0oax/",
              "text": "I echo this. I’ve worked for two major nonprofit (“industry”) research firms and can say that’s becoming the new standard. \n\nI’m certain that many other industry gigs don’t have that requirement yet, but the more high profile ones do. The goalposts keep moving ::",
              "author": null,
              "created": 1556122346,
              "upvotes": 1,
              "replies": {
                "elodjba": {
                  "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elodjba/",
                  "text": "Can you elaborate a bit on these nonprofit research firm post-doc positions? I'm graduating soon and want to transition into industry. Specifically: how did you find them, what was the pay like, do you recommend the experience overall?",
                  "author": "MeditationFabric",
                  "created": 1556129976,
                  "upvotes": 2,
                  "replies": {
                    "elpnscu": {
                      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elpnscu/",
                      "text": "Yes!\n\nI entered one as a full time employee with a master’s degree and then left it to get my PhD. I got a paid internship during my PhD at another nonprofit research firm. \n\nI highly recommend it if you like research (duh) and collaborative teamwork with other researchers. It has been my experience that these roles tend to pay fair wages, too. Because I am pursue the social sciences with an emphasis on translational research, my skills tend to translate a bit easier into these types of settings. Places to look include postings for city-, county-, and state-level research jobs, USAJobs, and other nonprofits that perform research in your field.",
                      "author": null,
                      "created": 1556159526,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "elov33u": {
                      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elov33u/",
                      "text": "You get into consulting, you would be good. Applicable to STEM PhDs. They look for that abstract thinking skills than anything else.",
                      "author": "x-w-j",
                      "created": 1556140195,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "elnv3if": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnv3if/",
          "text": "How did you approach people on LinkedIn?",
          "author": "theCovertoit",
          "created": 1556118989,
          "upvotes": 6,
          "replies": {
            "elnxsv0": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnxsv0/",
              "text": "You approach people on LinkedIn by, first, looking for people who pertain to your job of interest. Then, via LinkedIn, you send that person a message. You wait in anticipation for that person to respond to you.",
              "author": "anon_405",
              "created": 1556120616,
              "upvotes": 15,
              "replies": {
                "elo6mq0": {
                  "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo6mq0/",
                  "text": "Thanks. I always hesitant to message someone because I don't know how they would perceive my message, but thinking about it. It never hurts to try",
                  "author": "theCovertoit",
                  "created": 1556125867,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "elny58l": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elny58l/",
              "text": "LinkedIn has job postings!",
              "author": "goodusernamestaken_",
              "created": 1556120819,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "elnnts1": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnnts1/",
      "text": "Many of my friends who found a job began using their summers to intern at a specific company and continued to do so until graduation.\n\nAlso almost every campus has an employment office, they are who you need to talk to.",
      "author": null,
      "created": 1556114554,
      "upvotes": 42,
      "replies": {
        "elnnyea": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnnyea/",
          "text": "I do need to talk to them. They seem heavily focused on undergrads though.",
          "author": "cash40",
          "created": 1556114641,
          "upvotes": 22,
          "replies": {
            "elnon31": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnon31/",
              "text": "Well a majority of students are undergrads. But they can always help someone who is more qualified.\n\nIn the end all they care about is if you are a student.",
              "author": null,
              "created": 1556115073,
              "upvotes": 29,
              "replies": {}
            },
            "elnrmgk": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnrmgk/",
              "text": "My experience with the career advising office was horrible. I was given advice that didn’t apply to me at all. \n\nI specifically went to my Master’s program because they said they had a good record of getting people into PhD programs OR industry. I asked what the industry people did to find jobs and all the faculty were unhelpful. I reached out to one of the alumni in industry and he said he spent several weeks prepping for technical interviews during his last semester and the faculty weren’t helpful to him either.",
              "author": "Conceptizual",
              "created": 1556116910,
              "upvotes": 20,
              "replies": {}
            },
            "elns2wo": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elns2wo/",
              "text": "That is unfortunate. My university's (UK) careers department actually offers advice and counselling to undergrads, graduate students, and early career researchers (aka postdocs).\n\nNot helpful for you, obviously, but for anyone else who comes along this thread they shouldn't necessarily assume their careers office will be useless.",
              "author": "foibleShmoible",
              "created": 1556117185,
              "upvotes": 6,
              "replies": {}
            },
            "elpqk54": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elpqk54/",
              "text": "I would consider reaching out to the parallel office at your undergrad institution. Mine is available for all alumni for their whole lives.",
              "author": "cooking2recovery",
              "created": 1556161425,
              "upvotes": 3,
              "replies": {
                "elqnr6q": {
                  "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elqnr6q/",
                  "text": "Agreed. I did that, and also went to my undergrad institution's fall career fair. I got an interview (and the job) a few months later.",
                  "author": "jdoe36",
                  "created": 1556195534,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "elnt2v3": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnt2v3/",
              "text": "They probably are heavily focused on undergrads because that's how they make money. It might honestly be a waste of your time to go talk to them.",
              "author": "lift_heavy64",
              "created": 1556117785,
              "upvotes": 1,
              "replies": {
                "elnt8ua": {
                  "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnt8ua/",
                  "text": "That's kind of what I thought, honestly. They bring in big city employers, mostly in tech and marketing, and that's not at all where my field/job hunt is focused.",
                  "author": "cash40",
                  "created": 1556117885,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "elo1gef": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo1gef/",
          "text": "I'm considering that route. It seems difficult to get in the door when I'm so many years away from graduating though. May I ask what general field they were in?",
          "author": "campbell363",
          "created": 1556122818,
          "upvotes": 5,
          "replies": {
            "elo2q3c": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elo2q3c/",
              "text": "Engineering, Construction, Accounting and Business",
              "author": null,
              "created": 1556123573,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "eloie9w": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/eloie9w/",
          "text": "this depends a LOT on what you are studying. I'm a physicist, and my school had a \"STEM careers\" office which apparently had been so used to dealing with pre meds and chemistry/biology, they didn't know what to do with a physics student and just gave me a printout of their \"physics jobs\" google search. This was mainly because the physics department was tiny compared to the chemistry and biology departments, and we didn't have an engineering department (liberal arts college) but still. It was a complete waste of time to try to ask them for anything and I'm still salty about it.",
          "author": "DoctorWatchamacallit",
          "created": 1556132868,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "elnnju2": {
      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnnju2/",
      "text": "Especially people who havne't had to find a job in decades who don't realize how much harder it is now than when they were looking for their entry level jobs.\n\nIf I had a nickel for every time a professor aged 45 or older told me that I'd get a job in a week after graduating with the kind of degree I had, I wouldn't need a job.",
      "author": "iammaxhailme",
      "created": 1556114366,
      "upvotes": 225,
      "replies": {
        "elnnnwg": {
          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnnnwg/",
          "text": "Thank you! There is so much competition now, and people who are holding positions that require an advanced degree aren't retiring",
          "author": "cash40",
          "created": 1556114439,
          "upvotes": 81,
          "replies": {
            "elnnrpx": {
              "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnnrpx/",
              "text": "Heck I'm not even looking for academic positions (which I know I won't get since I mastered out of my PhD). I'm just looking for an entry level position in industry or government. I've got a masters and 2.5 years of research experience (during my unfinished PhD, but it's still experience...) and I've gotten 3 phone interviews and 0 real interviews in 4 months",
              "author": "iammaxhailme",
              "created": 1556114514,
              "upvotes": 49,
              "replies": {
                "elnnwaa": {
                  "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/elnnwaa/",
                  "text": "I'm not looking for academic positions either. I've had 3 in person interviews, and with one of them, it was clear they had hired the candidate  before me before I even walked in the room, and my interview was just a formality. It sucked.",
                  "author": "cash40",
                  "created": 1556114601,
                  "upvotes": 33,
                  "replies": {
                    "eloo2qj": {
                      "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/eloo2qj/",
                      "text": "That is a common element of the academic environment.   \n\n\nOne academic finished a masters and walked into a research assistant job, then got on a PhD program through it. Only then finished that to walk into a three year postdoc role. Naturally had a career of permanent positions. Good luck successfully getting a long term position these days.   \n\n\nThe other thing to remember is that the PhD  will fuck up your job hunt. You are now seen as extremely overqualified for entry level positions.",
                      "author": "phillip-passmore",
                      "created": 1556136134,
                      "upvotes": 15,
                      "replies": {
                        "eloxep6": {
                          "link": "/r/GradSchool/comments/bguw87/rant_alert_folks_in_academia_are_absolutely/eloxep6/",
                          "text": "Good news is that I only have an MS, I guess? *shrugs in overqualified *",
                          "author": "cash40",
                          "created": 1556141654,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634067382
}