{
  "sid": "qmw5lg",
  "link": "/r/GradSchool/comments/qmw5lg/tips_on_getting_better_at_selfstudying/",
  "title:": "Tips on getting better at self-studying?",
  "text": "I've always been good at self-studying, but I guess grad school is a whole new level. I'm in a stem program, and although my research is going great, classes are very difficult. The concepts aren't difficult, but it's just hard knowing what to study and what not to study, as well as how much we should understand each concept. For instance, I don't want to spend much time on a concept that won't be on the exam. My professor is of no help. Neither he nor the TA attend their scheduled office hours. In addition to that, I've fallen quite ill recently so keeping up is much more difficult. Tips on how to survive this class?",
  "author": "grothendieck1",
  "created": 1636064066,
  "updated": 1636138106,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hjcfe6y": {
      "link": "/r/GradSchool/comments/qmw5lg/tips_on_getting_better_at_selfstudying/hjcfe6y/",
      "text": ">For instance, I don't want to spend much time on a concept that won't be on the exam. My professor is of no help.\n\nThis is not first or second year of undergraduate. Professors don't typically give you study guides and outlines of what's going to be on the exam in graduate school. Exams should assess your knowledge of the content of the course. So that's what you have to study to show mastery of it.",
      "author": "raistlin65",
      "created": 1636066444,
      "upvotes": 4,
      "replies": {
        "hjchbv6": {
          "link": "/r/GradSchool/comments/qmw5lg/tips_on_getting_better_at_selfstudying/hjchbv6/",
          "text": "Hah actually I don't think I ever had a professor that didn't give out study guides and outlines of what's to be on the exam as an undergrad (mathematics major). I never knew this was common practice.\n\n&#x200B;\n\nHow exactly does one master a course if there are hundreds of concepts? Trying to understand every single detail just isn't possible since I have other duties, such as other coursework, TA-ing, self-care, and research. How do I know if enough is enough? I can't just work 12 hours a day studying for instance.",
          "author": "grothendieck1",
          "created": 1636067257,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hjevas4": {
      "link": "/r/GradSchool/comments/qmw5lg/tips_on_getting_better_at_selfstudying/hjevas4/",
      "text": "If it's in the class, it will probably be on the exam. I don't really understand this \"what not to study\" part because why would someone waste time on concepts that do not relate to the course?\n\nIf your professors use a textbook, see if you can work on the practice problems.\n\nI used to select one problem of each situation/topic (works wonders for STEM subjects) so I'd know how to work different scenarios, assess what was easy (or difficult!) to me and then pick more of the difficult practice problems.\n\nOn the days leading up to the exam, I'd pick again one problem for each topic, just to make sure I could understand what to do. I found it much easier than solving several practice problems on the same topic one after another and sometimes not covering everything because of it.\n\nA few books that were helpful:\n\nSTEM subjects: [https://barbaraoakley.com/books/a-mind-for-numbers/](https://barbaraoakley.com/books/a-mind-for-numbers/)\n\nGeneral advice/non-STEM classes: [https://www.calnewport.com/books/straight-a-student/](https://www.calnewport.com/books/straight-a-student/)",
      "author": "docindeleite",
      "created": 1636119117,
      "upvotes": 2,
      "replies": {
        "hjg79t8": {
          "link": "/r/GradSchool/comments/qmw5lg/tips_on_getting_better_at_selfstudying/hjg79t8/",
          "text": ">\"what not to study\" part because why would someone waste time on concepts that do not relate to the course?\n\nIdk how things work at your uni, but it is pretty common for professors to talk about shit that will not remotely be on the exam. My friend's professor on fluids spent an entire lecture talking about prisoners of war lol.",
          "author": "grothendieck1",
          "created": 1636138077,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjdighh": {
      "link": "/r/GradSchool/comments/qmw5lg/tips_on_getting_better_at_selfstudying/hjdighh/",
      "text": "Hi there, I can’t really tell if you’re in a MS or a PhD program or what you want to get out of the program because how to “study” will also vary on which STEM program you’re in. It does sounds like you might benefit from speaking with the academic advisor in your program to get advice on what to do if your prof/TA is not responsive though. \n\nAs for studying — generally what worked for me is I look at the syllabus to get a better idea of class goals and what I need to get out of that class, see how that fits into what I know, identify gaps I have, and I focus on those. I also try to connect with people in the class to form study groups/find a study partner.",
      "author": "AccioAddie",
      "created": 1636084292,
      "upvotes": 1,
      "replies": {}
    }
  }
}