{
  "sid": "pufre3",
  "link": "/r/GradSchool/comments/pufre3/mini_rant_i_feel_plagiarised/",
  "title:": "Mini rant - I feel plagiarised!",
  "text": "I'm an MSc student and I have to attend masterclasses whereby we read papers from selected researchers each month and have a discussion with the researcher to ask questions about their research. We also receive grades on the quality of our discussion skills etc. \n\nWe had a prep meeting yesterday before the formal discussion and I suggested a question I wanted to ask. Today, before I get a chance to ask my question, another person asks it word for word and even quotes the same sentence from the article that I quoted the day before. I may seem petty but this is incredibly annoying. I won't be making the mistake of mentioning my questions in the prep meeting again.",
  "author": "storm_borm",
  "created": 1632473511,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.95,
  "comments": {
    "he2m09m": {
      "link": "/r/GradSchool/comments/pufre3/mini_rant_i_feel_plagiarised/he2m09m/",
      "text": "Unfortunately, this happens sometimes, even with paper ideas. A friend of mine had another student scoop her entire paper idea because this student asked her for help and instead they chose to steal her whole idea. She told me that, after that, she only shares vague ideas about what her papers might be about. For example \"I think I'm going to write something about self-esteem and social media use\" and if she is pressed for more info, she will pretend like she hasn't really thought it out yet.",
      "author": "False-Guess",
      "created": 1632476630,
      "upvotes": 18,
      "replies": {
        "he3wgsj": {
          "link": "/r/GradSchool/comments/pufre3/mini_rant_i_feel_plagiarised/he3wgsj/",
          "text": "Ugh, something like that happened to me once. This happened in undergrad, but it was a big class like 150 people and we all had to pick an individual topic. I was talking out ideas with a classmate and they took the idea I had been playing with and claimed it with the professor before I could, and then I had to come up with a new idea. My second idea was not nearly as good.\n\nPeople are shitty.",
          "author": "MilkIsSatansCum",
          "created": 1632500682,
          "upvotes": 4,
          "replies": {
            "he4jnig": {
              "link": "/r/GradSchool/comments/pufre3/mini_rant_i_feel_plagiarised/he4jnig/",
              "text": "This was for a seminar paper that ended up getting published, so she was extra pissed. I'm not one to wish violence on someone, but may their marinara sauce never cling to their pasta!",
              "author": "False-Guess",
              "created": 1632510425,
              "upvotes": 5,
              "replies": {
                "he4n7tg": {
                  "link": "/r/GradSchool/comments/pufre3/mini_rant_i_feel_plagiarised/he4n7tg/",
                  "text": "Oh shit, that is so much worse. I hope they frequently have a small stone in their shoe that they cannot get out!",
                  "author": "MilkIsSatansCum",
                  "created": 1632511899,
                  "upvotes": 3,
                  "replies": {}
                },
                "he6u8de": {
                  "link": "/r/GradSchool/comments/pufre3/mini_rant_i_feel_plagiarised/he6u8de/",
                  "text": "That is terrible, I can’t imagine how wronged your friend must have felt.",
                  "author": "storm_borm",
                  "created": 1632549691,
                  "upvotes": 2,
                  "replies": {
                    "he7co2a": {
                      "link": "/r/GradSchool/comments/pufre3/mini_rant_i_feel_plagiarised/he7co2a/",
                      "text": "Yeah, that department was needlessly competitive. We are in related, but separate, departments so I was not involved in their department aside from a few classes but that department was a mess. The faculty were competitive with each other, which influenced grad student behavior. After that, she was not concerned with making friends in the department and was just focused on graduating and getting out. She and I would talk about research ideas because our research interests were completely different, but her experience taught me to keep my ideas close too. Unfortunately, not all departments do a good job creating a collaborative and collegial environment among their faculty and, since culture is established at the top, that behavior trickles down to the grad students who may incorrectly view this behavior as normative.",
                      "author": "False-Guess",
                      "created": 1632563959,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634065585
}