{
  "sid": "q3ueb8",
  "link": "/r/GradSchool/comments/q3ueb8/need_advice/",
  "title:": "Need Advice",
  "text": "I am in my first year of my PhD program. I don’t have a masters degree, directly joined a PhD program after my Bachelors. I had applied to a bunch of schools and got rejected by all but one. So I decided to purse my PhD. However, I was not awarded any positions that would offset my tuition cost like TAs or RAs. I was told that it was up to me to fund my first semester into the program and after that opportunities could arise. Back then I had saved up some money..enough for my first semester. \n\nCurrently, I am enrolled in a pass/fail course with my potential advisor. He gave me a project to work on about a month ago but I have not been able to produce results so far…heck I don’t even understand what’s going on. But I absolutely love my field and spend about 13-14 hours a day studying. I am having a little problem in adjusting with the courses in grad school as well because my bachelors degree was in a different field of study. So I’m not sure if I would be able to get some financial support by working in his lab next semester.\n\nFew days ago, I emailed department chair regarding the funding opportunities (through TA/RA) next semester but I haven’t heard back. I’m starting to worry about my situation next semester because I’m basically broke right now. Any helpful suggestions? Appreciate the help.",
  "author": "Black_Beard53",
  "created": 1633686014,
  "updated": 1634099829,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hfwo31a": {
      "link": "/r/GradSchool/comments/q3ueb8/need_advice/hfwo31a/",
      "text": "Have you considered applying for the NSF GRFP? I don’t know your field but you should check if you’re eligible. The deadline for this year is soon but it could be doable if your advisor and/or other faculty in your department can help you. It fully funds you for several years and will allow you to pursue your research without having to worry about TA or RA responsibilities. It sounds like you’re in a really tough position, has your program offered to help you find fellowships or other external funding, or are they just leaving you to figure it out alone?",
      "author": "orvilleshrek",
      "created": 1633730149,
      "upvotes": 3,
      "replies": {
        "hfwuku9": {
          "link": "/r/GradSchool/comments/q3ueb8/need_advice/hfwuku9/",
          "text": "It looks like I am ineligible for the fellowship since I am not a US citizen. At this point I’m pretty much on my own..zero support from the department. I’ve been thinking of taking a leave of absence for a while..develop some skills and come back strong. Not sure if this is doable though.",
          "author": "Black_Beard53",
          "created": 1633733025,
          "upvotes": 2,
          "replies": {
            "hfwyss3": {
              "link": "/r/GradSchool/comments/q3ueb8/need_advice/hfwyss3/",
              "text": "Damn, sorry, I didn’t even think to ask about that. I don’t know your status but the Paul and daisy soros fellowship for new Americans has somewhat less restrictive requirements, if you attended college in the US I think you’d be eligible even though you aren’t a citizen. Again, this may not apply to you though. \n\nHonestly, from what you’ve said, being in an unfunded program like this with essentially no support from the department sounds totally unsustainable. I hope you’re able to find a way to get the resources you need in your current program, or find a different program that can fund you :(",
              "author": "orvilleshrek",
              "created": 1633734974,
              "upvotes": 2,
              "replies": {
                "hfwzdbo": {
                  "link": "/r/GradSchool/comments/q3ueb8/need_advice/hfwzdbo/",
                  "text": "Thank you. I’ll check this out",
                  "author": "Black_Beard53",
                  "created": 1633735248,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hfx1aca": {
      "link": "/r/GradSchool/comments/q3ueb8/need_advice/hfx1aca/",
      "text": "Tbh I was always told not to pursue a doctorate without the funding as it wasnt worth it. May be time to upgrade and retry if faculty won't support you? Take others opinions too",
      "author": "Conhbd",
      "created": 1633736163,
      "upvotes": 2,
      "replies": {}
    }
  }
}