{
  "sid": "e8tpwz",
  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/",
  "title:": "UCSC Graduate Students are on WILDCAT Grading Strike!!!",
  "text": "Hi all (mods, I hope you understand how this is a relevant posting on this subreddit),\n\nI’m leaving this here because it’s something that affects all grad students to some extent. Currently, UCSC graduate students are enduring precarious conditions as we are living in one of the roughest housing economies in the nation- the majority of us are forced to pay 50% or more of our TA incomes towards rent alone (likely more if living in campus graduate student housing). We are currently on an unsanctioned WILDCAT GRADING STRIKE in order obtain a necessary Cost of Living Adjustment (COLA). We need this COLA in order to get out from underneath the rent burden so many of us are facing. \n\nWe need support and solidarity  from anywhere and everywhere we can get it! Please visit https://payusmoreucsc.com  or @payusmoreucsc on Instagram for more information on our COLA campaign!!\n\nEDIT: FEEL FREE TO SHOW YOUR SUPPORT IN THE COMMENT SECTION!!!",
  "author": "astute_canary",
  "created": 1575999095,
  "over_18": false,
  "upvotes": 465,
  "upvote_ratio": 0.96,
  "comments": {
    "fjh9apb": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fjh9apb/",
      "text": "OH NO, NOT 50% PERCENT!\n\nWe make 30+/hr for our 20 hour (maximum) work weeks.\n\nTA’s who tell you they work more than 20 hours are unfairly lumping their PAID TA DUTIES with their UNPAID RESEARCH DUTIES THAT ADVANCE THEIR OWN FUCKING CAREERS.\n\nSome people are in dire circumstances.  The rest of you need to stop fucking whining.\n\nTHE UNDERGRADS ARE IN IT WITH US TOO, HOW ABOUT A LITTLE SOLIDARITY WITH THEM??",
      "author": "KerrigansRage",
      "created": 1583343715,
      "upvotes": 1,
      "replies": {
        "fjiw3c4": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fjiw3c4/",
          "text": "Woah. You don’t think paying 50% is too much? Medical issues? Annnd we are in solidarity with undergrads. This post was put up months ago, at the very start of all of this- the context has changed.",
          "author": "astute_canary",
          "created": 1583377087,
          "upvotes": 1,
          "replies": {
            "fjiyt3s": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fjiyt3s/",
              "text": "Correct, the context has changed. Undergrads are unable to obtain the education that they pay for unless they want to walk miles (including disabled folks, Douchebags)and 5% of graduate students are unwilling and 95% are unable to do the work that they are/were getting paid for.  I’m annoyed, the undergrads are annoyed, and the cola subreddit, despite their claims of transparency, will delete things or ban you at their leisure if it is anti cola.\n\nI just feel sorry for the undergrads. I want them to get the education that they are fucking paying for\n\n*and no, Paying 50% of your rent should be considered a gift since it’s part of your package that you signed up for when you were accepted into our program. Obviously there was no statement of the local rent but we were all capable of googling it or searching reddit.  We get a good deal already, though it could be better.  The housing supplement of 2500 they offered was a great start though and the cola folks spat at it.\n\nOur benefits are great, medical, dental and vision, and a slew of other helpful programs like food pantries that I have used too but you don’t hear me crying about it.\n\nCould the situation be improved?  Yes.  Were the cola organizers tactful(or realistic)?  NO",
              "author": "KerrigansRage",
              "created": 1583378927,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "faitm4t": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faitm4t/",
      "text": "TA's out associate profs in?",
      "author": "Neo_Metalsonic",
      "created": 1576116311,
      "upvotes": 1,
      "replies": {}
    },
    "fagy50y": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fagy50y/",
      "text": "I feel your pain as far as housing is concerned. CA real estate prices are absolutely absurd.",
      "author": "Brickolas75",
      "created": 1576074552,
      "upvotes": 1,
      "replies": {}
    },
    "faggdvd": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faggdvd/",
      "text": "[deleted]",
      "author": null,
      "created": 1576053460,
      "upvotes": 1,
      "replies": {
        "fagh2nb": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fagh2nb/",
          "text": "Great!! Twitter account is: https://twitter.com/bananaslums   \n\nPost on IG too! I’m sure the folks managing the site will repost or share via story!!",
          "author": "astute_canary",
          "created": 1576054507,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fagbldb": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fagbldb/",
      "text": "I'm at UC Davis, didn't even apply to UCSC because I couldn't figure out if the school was gonna take any responsibility for grad student wellbeing. We support you!!! Also I really hope you do a spoof on the High School Musical song for this strike as a protest chant, it'd be cute",
      "author": "akb47",
      "created": 1576047100,
      "upvotes": 3,
      "replies": {}
    },
    "fag9gwl": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fag9gwl/",
      "text": "Good luck! I was in a PhD program in NYC and I was living in the university's grad student housing. The cheapest non-shared bedroom apartment they offered cost about 70% of my stipend, leaving me only about 30% left for other purchases like... food and electricity... it's ridiculous how even public schools are charging such insane rents in HCOL areas in their uni owned housing.\n\nEdit: And that's before they hiked the rent 40$/month after my first year. They're the ones paying our stipend. Where are we supposed to get that money from?",
      "author": "iammaxhailme",
      "created": 1576044688,
      "upvotes": 6,
      "replies": {}
    },
    "fag0du4": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fag0du4/",
      "text": "Depends on field/department  but it can range from 1800 (for humanities and social sciences) and up (depending on external funding). Housing is seriously limited and we are lucky if we find a bedroom for less than 800/850.",
      "author": "astute_canary",
      "created": 1576036554,
      "upvotes": 3,
      "replies": {}
    },
    "fafze0w": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafze0w/",
      "text": "This is some BS. I’m glad y’all are standing up for yourselves. \nCan I ask how much y’all get in the stipend? And how much the rent costs are?",
      "author": "PhenotypicalCaBrONa",
      "created": 1576035791,
      "upvotes": 2,
      "replies": {}
    },
    "faftdjn": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faftdjn/",
      "text": "Solidarity! Thank you!!",
      "author": "astute_canary",
      "created": 1576031392,
      "upvotes": 2,
      "replies": {}
    },
    "faftcx1": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faftcx1/",
      "text": "Thank you!!!!",
      "author": "astute_canary",
      "created": 1576031380,
      "upvotes": 2,
      "replies": {}
    },
    "faftc9r": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faftc9r/",
      "text": "HELL YEAH!!!!",
      "author": "astute_canary",
      "created": 1576031368,
      "upvotes": 2,
      "replies": {}
    },
    "faft5w5": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faft5w5/",
      "text": "My friend is a TA at UCSC right now and was just telling me about being on strike! I’m rooting for everyone over there — they deserve a COLA! Thankfully, it sounds like the teaching faculty that she’s associated with are in support of the strike.",
      "author": "KikiDoesMath",
      "created": 1576031241,
      "upvotes": 4,
      "replies": {}
    },
    "fafskjz": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafskjz/",
      "text": "Solidarity!",
      "author": "ChicagoProper",
      "created": 1576030820,
      "upvotes": 2,
      "replies": {}
    },
    "fafpyka": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafpyka/",
      "text": "✊",
      "author": "papa_Struedel",
      "created": 1576028967,
      "upvotes": 3,
      "replies": {}
    },
    "fafls1i": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafls1i/",
      "text": "Best of luck to you and your colleagues from the Northeast! This cost of living situation is unbearable.",
      "author": "galaxywhisperer",
      "created": 1576025973,
      "upvotes": 4,
      "replies": {}
    },
    "fafjzr2": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafjzr2/",
      "text": "Yeah! Good luck. Gotta throw your weight around to get results sometimes.",
      "author": "DarwinZDF42",
      "created": 1576024674,
      "upvotes": 3,
      "replies": {}
    },
    "fafh6t1": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafh6t1/",
      "text": "[deleted]",
      "author": null,
      "created": 1576022647,
      "upvotes": 8,
      "replies": {
        "fafi3q1": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafi3q1/",
          "text": "It is a wild cat strike because it is a non sanctioned (in contract) strike..",
          "author": "astute_canary",
          "created": 1576023305,
          "upvotes": 4,
          "replies": {}
        },
        "fafi6o4": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafi6o4/",
          "text": "It’s a strike that was not sanctioned and not authorized by their own union, and according to their bylaws is technically “illegal”. However I don’t know the short or long term consequences of breaking with your union to organize a strike.",
          "author": "SaintLoserMisery",
          "created": 1576023363,
          "upvotes": 3,
          "replies": {
            "fagbso7": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fagbso7/",
              "text": "I'm sure in the short term there won't be any real repercussions, but long term it's a very boneheaded thing to do. You're not engaging in collective bargaining when you subvert your union and you give the school reason to think that working with the union is a waste of time because the students will just ignore them anyway.",
              "author": "Mezmorizor",
              "created": 1576047344,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "faffph6": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faffph6/",
      "text": "Solidarity from a UCSC alumna! ❤️",
      "author": "rhapsodyofmelody",
      "created": 1576021606,
      "upvotes": 3,
      "replies": {}
    },
    "faffkqk": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faffkqk/",
      "text": "If you live in Silicon Valley you would know how unaffordable rent is. I mean a good rental place. I had3 students and a professor tell me this. Top UC universities are good but they can only give so much. LA is nice and some areas affordable. Silicon Valley is not.",
      "author": "aysha17",
      "created": 1576021514,
      "upvotes": 4,
      "replies": {}
    },
    "fafbnsq": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafbnsq/",
      "text": "Solidarity from the South!",
      "author": "doctoranime",
      "created": 1576018836,
      "upvotes": 2,
      "replies": {}
    },
    "fafaq1y": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafaq1y/",
      "text": "Are you part of a union?",
      "author": "ShutUpAndSmokeMyWeed",
      "created": 1576018229,
      "upvotes": 2,
      "replies": {
        "fafb1az": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafb1az/",
          "text": "Graduate student supporting the COLA campaign!",
          "author": "astute_canary",
          "created": 1576018427,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "faf9g2i": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf9g2i/",
      "text": "Thank you!!!!",
      "author": "astute_canary",
      "created": 1576017418,
      "upvotes": 2,
      "replies": {}
    },
    "faf9d6g": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf9d6g/",
      "text": "Solidarity. Good luck from a fellow grad student. I currently use 30% of my monthly stipend to pay for rent. I can't imagine having to pay 50% along with student loans, healthcare, groceries, etc. You guys are in my thoughts!",
      "author": null,
      "created": 1576017367,
      "upvotes": 5,
      "replies": {}
    },
    "faf5xuy": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf5xuy/",
      "text": "A big oof at the people not agreeing with the strike.  This is a huge part of the problem.  Someone may not care that 50% of income goes towards housing, but when you factor in all that grad students are working (80+ hours a week or more) and getting paid less than minimum wage, it is a huge issue.",
      "author": "TheDivineMissPanty",
      "created": 1576015235,
      "upvotes": 8,
      "replies": {}
    },
    "faf5r6b": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf5r6b/",
      "text": "Current UCSC undergrad lurker here—go grad student slugs!!",
      "author": "oceanlifenerd",
      "created": 1576015123,
      "upvotes": 12,
      "replies": {
        "faf67j9": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf67j9/",
          "text": "Thank you!",
          "author": "astute_canary",
          "created": 1576015398,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "faf4m8j": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf4m8j/",
      "text": "[deleted]",
      "author": null,
      "created": 1576014426,
      "upvotes": -9,
      "replies": {
        "faf5fc0": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf5fc0/",
          "text": "Actually, graduate student housing (one room in a apartment of 4) runs about 1250, not including utilities. The average stipend is about 2000 per month, meaning that of  $1250 to live on campus (in the context, the university IS the landlord) you’d be left with maybe 650/700 per month. What about all other costs? How does make our situations livable. \n\nSure, and bedroom in a house can be shared for $800, but is this a fair living? Considering transportation costs, medical costs, etc- I wouldn’t say that it is.",
          "author": "astute_canary",
          "created": 1576014919,
          "upvotes": 9,
          "replies": {
            "faf6mwe": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf6mwe/",
              "text": "[deleted]",
              "author": null,
              "created": 1576015662,
              "upvotes": -5,
              "replies": {
                "fafjxnz": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafjxnz/",
                  "text": "Is it possible, just possible, that your personal experience is in fact not generalizable to the experience of all other grad students?\n\nLike, you betray that problem I see so often with people on the right -- if you haven't DIRECTLY experienced something, you discount it entirely.  I don't know if it's a failure of imagination or whatever, but it's a common occurrence on a host of issues.  You're simply not capable of reasoning past your own narrow life. Massive mental weakness, btw.\n\nI'm a tenured prof now but I went through grad school in a really expensive part of the country (most good schools are not in the midwest save the Chicago/Milwaukee region).  The problems facing the UCSC grads are the same facing those in the Northeast -- incredibly expensive housing, high student fees not covered under tuition, and the general expenses of life (and heaven help if you if you come in to school with any other sort of debt). The stipend is simply not enough to sustain people if everything goes right, let alone if life circumstances go south in any way.",
                  "author": "autopoietic_hegemony",
                  "created": 1576024633,
                  "upvotes": 6,
                  "replies": {
                    "fafmbzs": {
                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafmbzs/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1576026376,
                      "upvotes": -3,
                      "replies": {
                        "fafnc2e": {
                          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafnc2e/",
                          "text": "I already checked your posting history out.  You're a non-traditional student getting a BS degree on the GI Bill.  You've literally just been accepted into a PhD program. Right now, your knowledge of graduate school is theoretical/second-hand. \n\nI am telling you as someone with two MA's, a PhD, AND \"real-world\" experience before going in -- it's way, WAY harder than you think it is.  I'm not even talking about the degrees themselves. Success and failure in grad school is a matter of skill, intelligence, and hard work... but -- and this is key -- it's also primarily a matter of LUCK.  I made it  through because I was smart, hard-working but also incredibly fortunate. \n\nBeing poor -- as you know -- means you're always one disaster away from catastrophe. However, being a poor grad student means you're one disaster away from a life-wrecking catastrophe.  You're literally gambling nearly a decade of current earning potential on future earning potential.  One misstep and you've basically put yourself in an irrecoverable hole.\n\nNow having said that, these institutions -- supposedly run by enlightened folk -- instead keep their grad students hovering right AT this tipping point.  Can some make it through? Sure, but you've reduced their margin of success radically  (even if you're smart, hard-working, and skilled).  That's why it makes sense to fight for what theyre fighting for.",
                          "author": "autopoietic_hegemony",
                          "created": 1576027096,
                          "upvotes": 8,
                          "replies": {
                            "fafo1g6": {
                              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafo1g6/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1576027601,
                              "upvotes": 3,
                              "replies": {
                                "fafp3wv": {
                                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafp3wv/",
                                  "text": "I'm passionate because i've seen a lot of good people fail for reasons they couldnt really control.  I wish you the best of luck!",
                                  "author": "autopoietic_hegemony",
                                  "created": 1576028363,
                                  "upvotes": 5,
                                  "replies": {
                                    "fafpj42": {
                                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafpj42/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1576028660,
                                      "upvotes": 1,
                                      "replies": {
                                        "fafqo2s": {
                                          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafqo2s/",
                                          "text": "o7 fly safe",
                                          "author": "autopoietic_hegemony",
                                          "created": 1576029464,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "faf668k": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf668k/",
          "text": "Also, give Zillow a look. So far, I’ve found a studio that’s available at $1,350. The rent burden is huge, not to mention other costs that add to a need for a COLA.",
          "author": "astute_canary",
          "created": 1576015377,
          "upvotes": 7,
          "replies": {
            "faf73ot": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf73ot/",
              "text": "[deleted]",
              "author": null,
              "created": 1576015950,
              "upvotes": -9,
              "replies": {
                "fafaeuo": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafaeuo/",
                  "text": "That’s just the cheapest option available on Zillow at the moment. I still think paying even 850-950 per room, per month is ridiculous, particularly when you consider that our 2000/month stipends only extend 9 months. With loans, medical bills, increased food/good costs, it is almost unbearable. \n\nSure, you’re okay with this. BUT this does not mean it is fair, safe, or even healthy to expect graduate students to put forth so much labor (teaching and resource) for so little financial return. Healthy grad students will make for better university conditions all around.  A COLA IS ESSENTIAL.",
                  "author": "astute_canary",
                  "created": 1576018030,
                  "upvotes": 8,
                  "replies": {
                    "fafkktr": {
                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafkktr/",
                      "text": "See my edit to my original post.  \n\nI’m not disagreeing with you that most grads everywhere need a boost, just trying to ground it in a little reality",
                      "author": "ShadowDV",
                      "created": 1576025096,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                },
                "fafk86n": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafk86n/",
                  "text": "> It’s a game that has to be played\n\nWhy? Why shouldn't grad students make a reasonable wage? Ask the schools and it's a full-time job. Many have explicit rules prohibiting other employment if you TA (and sometimes even if you don't). Well, okay then, pay your employees a reasonable wage. The decision to go to school shouldn't also mean you're going to be on the edge of poverty for the duration of your time there. That's lunacy.",
                  "author": "DarwinZDF42",
                  "created": 1576024842,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "fafk51d": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafk51d/",
          "text": "Sounds like you need a union and a better contract, instead of pooping on other people trying to get what they ought to.",
          "author": "DarwinZDF42",
          "created": 1576024780,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "faf2tpt": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf2tpt/",
      "text": "Many do but hope this is not the norm. Universities funding here has to be higher. I was told this by 3 students!",
      "author": "aysha17",
      "created": 1576013352,
      "upvotes": 3,
      "replies": {}
    },
    "faf2qse": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf2qse/",
      "text": "Good luck!!!!!",
      "author": null,
      "created": 1576013303,
      "upvotes": 4,
      "replies": {}
    },
    "faewss9": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faewss9/",
      "text": "Ph.d is already so stressful and with high cost of living it is quite ridiculous. California has become impossible to afford. Students are paying close to 2-3 k to rent shacks in someone’s back yard. One student in Oakland told me he had no hot water or bathroom but he loves his program. It all better be worth it.",
      "author": "aysha17",
      "created": 1576009788,
      "upvotes": 18,
      "replies": {
        "faf2d3n": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf2d3n/",
          "text": "[deleted]",
          "author": null,
          "created": 1576013080,
          "upvotes": 24,
          "replies": {
            "faf85x6": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf85x6/",
              "text": "Yeah I’m a grad student in LA and I can definitely afford my housing and utilities. My stipend is also kinda high though, USC is very generous.",
              "author": "microvan",
              "created": 1576016607,
              "upvotes": 10,
              "replies": {
                "fafdod0": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafdod0/",
                  "text": "PhDs at (reasonably well funded) private schools seems to be so much better an experience than public, it's kind of shocking how terrible students get treated when it's up to a state legislature",
                  "author": "DrJPepper",
                  "created": 1576020182,
                  "upvotes": 7,
                  "replies": {
                    "fafe8aw": {
                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafe8aw/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1576020572,
                      "upvotes": 2,
                      "replies": {
                        "fafet19": {
                          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafet19/",
                          "text": "I meant that private schools in most places fund better than the UC's, which in turn \"solves\" the rent situation",
                          "author": "DrJPepper",
                          "created": 1576020969,
                          "upvotes": 5,
                          "replies": {
                            "fagb8tp": {
                              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fagb8tp/",
                              "text": "Really? I didn’t think there was much variation in stipend amount. I’m on $32k at UCLA which I think is on the lower end amongst STEM departments there. But they also have subsidized grad student housing, so a 2b2b in Palms is only $900 per student per month or something like that.",
                              "author": null,
                              "created": 1576046681,
                              "upvotes": 1,
                              "replies": {
                                "fagd4wm": {
                                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fagd4wm/",
                                  "text": "32?? Are you on a GSR salary? Or that just a standard stipend?",
                                  "author": "astute_canary",
                                  "created": 1576048995,
                                  "upvotes": 3,
                                  "replies": {
                                    "fahf9od": {
                                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fahf9od/",
                                      "text": "Uhh, not sure? My first year we were all fully funded while we did rotations, and then once you join a lab your advisor pays for you.",
                                      "author": null,
                                      "created": 1576084869,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fagb7qu": {
                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fagb7qu/",
                      "text": "My apologies for how ranty this ended up being, but man, it's impressive how many easily fixable ways the school fucks us over.\n\nYep. Thankfully the department subsidizes us a little bit so we're paid more like a shift manager, but the state approved stipend is barely above minimum wage if you work 40 hours which is less than anybody actually works. Never mind that rent+utilities would be more than 50% of that salary (and significantly more than that at the other public school which is in a big city). Obviously the school would argue that you're a student, not a worker (even though we're literally considered faculty by the university) and that the payment is for less than half of 40 hours a week.\n\nNot to mention that the higher ups decided that we should really screw over all the students tax wise with uneven payments. It does get refunded ultimately, but christ, we literally pay an extra ~$300 in taxes throughout the year purely so that the University's balance sheet looks slightly less bad in summer when revenue is down. Never mind that there are people who literally teach during the months where we're not paid.\n\nI also think a big part of why private schools treat students better is that they're just flat out smaller. Don't get me wrong, the state fucks us over too, but based off of the contents of our mandatory TA training class, the University leadership clearly has no god damn idea what TAing a chemistry lab actually involves. We have incredibly helpful exercises like writing a lesson plan even though no graduate student in the entire department has any curriculum control whatsoever, rubric making even though no graduate student in the department makes assignments, test design even though no graduate student in the department makes tests, and techniques for keeping a classes attention during long lectures even though no lab lecture is longer than ten minutes. They figured out that a chemistry lab has chemicals in it, though they vastly overestimated how dangerous they are and underestimated what level of engineering controls the teaching labs have, but literally everything else in that semester long course just straight up does not apply to a chemistry TA position.  I picked on the center of instruction here, but this kind of stuff happens all the time. Like the time they had to find funding for a second chemistry building because nobody on the planning committee realized that chemistry research oftentimes involves class IV lasers and cannot be legally done in an open concept lab which the building design exclusively has.",
                      "author": "Mezmorizor",
                      "created": 1576046647,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "faewf5x": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faewf5x/",
      "text": "I almost applied here but one professor discouraged me. I thought about it later she said there was no money and we are not taking grad students this year but I still kept getting emails.",
      "author": "aysha17",
      "created": 1576009568,
      "upvotes": 2,
      "replies": {}
    },
    "faew8mk": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faew8mk/",
      "text": "Good luck! I interviewed at UCSC, and it was a hard pass for me because the graduate students (thankfully) weren’t shy about the fact that they were struggling financially. Many said they were working side jobs in addition to their PhD.\n\nHell, at the interview recruitment dinner (at which there were only 2 visiting students...), the graduate students had to pay for their own food! Like, “Hey, go out and entertain these recruits, but use your own money to do it!” My impression was definitely that life as a graduate student is tough there.",
      "author": "iloveteax",
      "created": 1576009464,
      "upvotes": 66,
      "replies": {
        "faf38bm": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf38bm/",
          "text": "Holy shit what a red flag",
          "author": null,
          "created": 1576013591,
          "upvotes": 38,
          "replies": {}
        }
      }
    },
    "faew25a": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faew25a/",
      "text": "Good luck from Chicago!!",
      "author": "betty_deez",
      "created": 1576009359,
      "upvotes": 5,
      "replies": {}
    },
    "faeuyow": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeuyow/",
      "text": "Full, full support.  My stipend in Ohio is barely manageable, and the cost of living here is dirt cheap compared to CA.",
      "author": null,
      "created": 1576008720,
      "upvotes": 13,
      "replies": {}
    },
    "faeuobl": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeuobl/",
      "text": "We pay nearly half of our money to rent, too. Don’t know how I’m going to survive december. I really hope you guys can make a change. Good luck!",
      "author": "cansyx",
      "created": 1576008548,
      "upvotes": 13,
      "replies": {}
    },
    "faeshg1": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeshg1/",
      "text": "As a former grad student, I feel your pain! Solidarity!",
      "author": null,
      "created": 1576007254,
      "upvotes": 6,
      "replies": {}
    },
    "faescmt": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faescmt/",
      "text": "I’d love some more info on this strike if OP or anyone else affiliated with UCSC can give me. \n\nLooks like the students are on an unauthorized strike that was not approved by their union. How do you think this will affect your bargaining power with the \nUniversity? What about the future of union representation for the UCSC graduate students? \n\nFrom the article I’ve read it seems that only humanities students are striking. Are any students from other disciplines also involved in this strike? \n\nGoing off of my previous question, do stipends between departments and disciplines vary greatly? For example humanities vs STEM?\n\nThe students are demanding a “cost of living” increase of $1400 per month. What were the metrics used to calculate this figure?\n\nFinally, do graduate students at UCSC have health insurance? Does this include dental? Does the insurance cover the entire 12 months or just the length of the stipend?",
      "author": "SaintLoserMisery",
      "created": 1576007176,
      "upvotes": 50,
      "replies": {
        "faeuxek": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeuxek/",
          "text": "The Academic Student Employees are represented by UAW. There are about 19000 workers who are in-unit state-wide. Santa Cruz is the smallest unit with about 1200 grad students. The Union is in critical solidarity - they agree with the position in principle, but do not believe in this method of going about doing it because the strike is being put on by a minority of students, was not voted democratically, and is in violation of the Union contract.\n\nIt's roughly 200-300 grad students out of more than 1200 and primarily humanities students. \n\nTA salary scales are set UC-wide, so there is no variation between the disciplines although at their discretion your PI can kick extra money to you by giving you a small% researcher position.",
          "author": "LilyOpal14",
          "created": 1576008699,
          "upvotes": 43,
          "replies": {
            "fag1zrx": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fag1zrx/",
              "text": "[deleted]",
              "author": null,
              "created": 1576037844,
              "upvotes": 12,
              "replies": {
                "fahehgy": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fahehgy/",
                  "text": "The union didn’t call it because our current contract has a no strike clause. This is incredibly common for union jobs across the US. The wildcat strike is being held despite that clause.",
                  "author": "ohsideSHOWbob",
                  "created": 1576084478,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "fag8ikb": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fag8ikb/",
              "text": "Don't UCSC's departments provide a stipend bump in the Spring? At Berkeley, teaching and research pay follows the same scales at other UCs, but every department provides a stipend bump to graduate students, which differs significantly between departments. The range is about $22,000 to $36,000, I believe.\n\nIf UCSC's stipend's are salary only, doesn't that come out to only about $18,000 a year?",
              "author": "yerfukkinbaws",
              "created": 1576043673,
              "upvotes": 2,
              "replies": {
                "fagb1tp": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fagb1tp/",
                  "text": "No bump that I know of.....after taxes, our take home is pretty low (for non fellowship years and for those not on fellowship at all). Of course, not all departments are equal (in STEM, it’s also a matter of external funding)",
                  "author": "astute_canary",
                  "created": 1576046456,
                  "upvotes": 3,
                  "replies": {
                    "fahioag": {
                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fahioag/",
                      "text": "If not all departments are equal, then the departments must be doing something like a bump to augment students' stipends because the salary that comes with a TA or RA position is equal. And would come out to about $18,000 a year for 50% positions regardless of your department.\n\nI don't understand how you can be advocating and presumably participating in this strike without fully understanding where the stipends come from.",
                      "author": "yerfukkinbaws",
                      "created": 1576086601,
                      "upvotes": 2,
                      "replies": {
                        "fahrttm": {
                          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fahrttm/",
                          "text": "Again, for many in STEM there are GSR salaries that argument their income.  As stated earlier (for many folks in STEM, external funding is a factor).",
                          "author": "astute_canary",
                          "created": 1576092157,
                          "upvotes": 1,
                          "replies": {
                            "fahtehm": {
                              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fahtehm/",
                              "text": "So at UCSC people will have a TA position and a GSR at the same time? I've never heard of anyone doing that at my campus. I didn't even know it was a possibility unless they stayed under 50% combined.\n\nAnd apart from fellowships, external funding is really only funding for research. It doesn't help with rent and bills.",
                              "author": "yerfukkinbaws",
                              "created": 1576093108,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "fagrtrw": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fagrtrw/",
              "text": "Question: Are most PhD students in debt because their living expenses are much higher than their stipend?",
              "author": null,
              "created": 1576069232,
              "upvotes": 2,
              "replies": {
                "fbntrtg": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fbntrtg/",
                  "text": "Many of us are either in debt or are living in extremely dismal conditions, including unheated garages, cars, and I've heard a couple accounts of tents.",
                  "author": "ladut",
                  "created": 1577003127,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "fbnultt": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fbnultt/",
              "text": " \n\n>It's roughly 200-300 grad students out of more than 1200 and primarily humanities students.\n\nThis is incorrect. On day 1 of finals week (two weeks ago as of this coming Monday), we had over 400 strikers, and most science departments had yet to be approached about it. Since then, department chairs from 7 science departments, along with the majority of students from those and others expressed support of the strike. Over half the faculty have signed a petition in support of the need of the strike.",
              "author": "ladut",
              "created": 1577003476,
              "upvotes": 2,
              "replies": {}
            },
            "fafujwl": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafujwl/",
              "text": "[deleted]",
              "author": null,
              "created": 1576032235,
              "upvotes": 2,
              "replies": {
                "fafw4ly": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafw4ly/",
                  "text": "What happened at Columbia?",
                  "author": "hypercube42342",
                  "created": 1576033379,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "faftal9": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faftal9/",
          "text": "My friend is a graduate math student and she’s also participating in the strike. It sounds like her peers in the department are as well!",
          "author": "KikiDoesMath",
          "created": 1576031335,
          "upvotes": 8,
          "replies": {}
        },
        "fag7wir": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fag7wir/",
          "text": "[deleted]",
          "author": null,
          "created": 1576043052,
          "upvotes": 7,
          "replies": {
            "fajw5bf": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fajw5bf/",
              "text": "This should be a top level comment. Important context. Wildcat striking is dangerous, especially when there isn't even majority support from the local unit.",
              "author": "bvdzag",
              "created": 1576155956,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "faf6pp4": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf6pp4/",
          "text": "Our hope is that ALL graduate students will strike. Also, stipends do vary, and this COLA would apply to all grad students.\n\nPlease go to payusmoreucsc.com for more information!!!!",
          "author": "astute_canary",
          "created": 1576015709,
          "upvotes": 11,
          "replies": {
            "faf7ld2": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf7ld2/",
              "text": "I get that you hoped all grad students would strike, but you don’t even have a majority on your own campus. Now what?",
              "author": "LilyOpal14",
              "created": 1576016252,
              "upvotes": 19,
              "replies": {
                "faf9apj": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf9apj/",
                  "text": "We keep working and community building until we get the numbers and support!\nUltimately, this benefits all grad students. It’s just a matter of getting the support.",
                  "author": "astute_canary",
                  "created": 1576017324,
                  "upvotes": 4,
                  "replies": {
                    "fafhc2g": {
                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafhc2g/",
                      "text": "I just see you having a hard time ever managing to get the numbers and support with the way this went down. By your own info, you had less than 300 people say yes they were willing to strike when the strike was called. As u/SaintLoserMisery pointed, those 300 people have now undermined the bargaining power of their 19,000 union brothers and sisters moving forward. It just doesn't seem like this was well-thought out or with any realistic idea of what it would take to win. I sincerely hope it does for your sake, but it doesn't seem like the odds are in your favor.",
                      "author": "LilyOpal14",
                      "created": 1576022749,
                      "upvotes": 19,
                      "replies": {
                        "fag7r2h": {
                          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fag7r2h/",
                          "text": "It's not clear how this undermines union bargaining. If anything it shows both the union and the UC admins that graduate students are not satisfied with the current \"bargaining\" and they better get their shit together if they don't want to this to become more common or widespread.\n\nI'm at another UC and only hearing about this now. I'm not teaching this semester or else I would join the strike. This solidarity is the actual union. UAW is only a formalization of what the actual union members do. When the union becomes its own agent, separate from the employees, you're on dangerous ground.",
                          "author": "yerfukkinbaws",
                          "created": 1576042903,
                          "upvotes": 6,
                          "replies": {
                            "faglhbh": {
                              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faglhbh/",
                              "text": "It undermines union bargaining because all of the power in unions is a result of 19000 people having a single position. If management believes that agreements with the union will not be honored in totality, they are less inclined to negotiate at all.",
                              "author": "rvaducks",
                              "created": 1576061515,
                              "upvotes": 6,
                              "replies": {
                                "fahhvy3": {
                                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fahhvy3/",
                                  "text": "I'm sure the University administration isn't stupid enough to think there's 100% agreement on any position. The question is not whether we all agree, but whether our union represents us. A strike like this is just as much a message to the union as to the administration.\n\nDon the road, if the union is acting with our confidence, but the University refuses to negotiate claiming that the union doesn't represent us, then it's pretty easy to show them they're wrong.",
                                  "author": "yerfukkinbaws",
                                  "created": 1576086200,
                                  "upvotes": 0,
                                  "replies": {
                                    "fahrzv4": {
                                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fahrzv4/",
                                      "text": "This is naive and uninformed.",
                                      "author": "rvaducks",
                                      "created": 1576092258,
                                      "upvotes": 3,
                                      "replies": {
                                        "fahszac": {
                                          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fahszac/",
                                          "text": "So inform me.",
                                          "author": "yerfukkinbaws",
                                          "created": 1576092853,
                                          "upvotes": 2,
                                          "replies": {
                                            "fajledt": {
                                              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fajledt/",
                                              "text": "The power in a union isn't that you all agree but that everyone acts as on me, whether you agree or not. \n\nWhen a sub-groip takes action out of step with the union, you are allowing yourself to be fractured into increqsing small and less powerful units.",
                                              "author": "rvaducks",
                                              "created": 1576143785,
                                              "upvotes": 3,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "faersa1": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faersa1/",
      "text": "I almost went to UCSC, chose a nearby school instead. Good luck! You guys are so cool, fighting the good fight!!!",
      "author": "Geometer99",
      "created": 1576006842,
      "upvotes": 80,
      "replies": {
        "fafhocs": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafhocs/",
          "text": "Also thought about going to UCSC. Holy cow.",
          "author": "nernthestrudel",
          "created": 1576022993,
          "upvotes": 8,
          "replies": {}
        },
        "fag4lp7": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fag4lp7/",
          "text": "Username checks out, UCSC has some good geometry/mathematical physics going on if I recall",
          "author": null,
          "created": 1576040043,
          "upvotes": 4,
          "replies": {
            "faga78i": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faga78i/",
              "text": "I’m seriously considering changing my username though haha, I just took my first quarter of Diff Geo and seriously DIED. \n\nI’m pretty sure I passed, but I am in *no way* prepared to go on the next quarter. I think a little of it might be impostor syndrome, but I’m switching into the abstract algebra sequence and trying geometry again after a year of fundamentals (algebra analysis topology).",
              "author": "Geometer99",
              "created": 1576045489,
              "upvotes": 7,
              "replies": {
                "fagads9": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fagads9/",
                  "text": "Honestly, that’s kind of what happened to me. I took the first two courses of the differential topology sequence my senior of undergrad after applying to grad schools with differential geometry as my “focus,” and they were honesty the hardest courses I ever took, even to this day. I only did well grade wise because it was all take home assignments, but yeah they left a bad taste in my mouth",
                  "author": null,
                  "created": 1576045691,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "fjhbauw": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fjhbauw/",
          "text": "They’re fighting the good ol “I want everything handed to me” fight.  Not the good fight.  There are a few people in dire circumstances.  The rest are seriously fucking whining.  Don’t buy into it.",
          "author": "KerrigansRage",
          "created": 1583344810,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "faeroz0": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeroz0/",
      "text": "Thanks for the good wishes, y'all!",
      "author": "doomparrot42",
      "created": 1576006787,
      "upvotes": 5,
      "replies": {}
    },
    "faerm3z": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faerm3z/",
      "text": "Good luck, guys! ❤️",
      "author": "starmagnolia",
      "created": 1576006741,
      "upvotes": 10,
      "replies": {}
    },
    "faeqdab": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeqdab/",
      "text": "Good luck!!",
      "author": "lover_of_pancakes",
      "created": 1576005994,
      "upvotes": 8,
      "replies": {}
    },
    "faeq4b0": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeq4b0/",
      "text": "I'd love to see some of the emails from students to their grade-withholding TAs lol.",
      "author": "kudles",
      "created": 1576005846,
      "upvotes": 30,
      "replies": {
        "faer47x": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faer47x/",
          "text": "Many of the undergrads are supportive of this cause. Our intention is not to hurt undergrads, it’s is to make our situations as educators and researchers livable. Of course, admin will try to place wedges between us, but again our goal is NOT to hurt undergrads.",
          "author": "astute_canary",
          "created": 1576006443,
          "upvotes": 56,
          "replies": {
            "faf3dxt": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf3dxt/",
              "text": "It’s the professors’ classes.\n\nIf the TA’s labor is necessary, they will be adequately compensated.\n\nIf it is not necessary, I’m sure the professors won’t mind picking up the slack ;)",
              "author": null,
              "created": 1576013684,
              "upvotes": 20,
              "replies": {
                "faf5m2j": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf5m2j/",
                  "text": "Well over 300 faculty (with some entire departments) have signed a petition to support grad students. Solidarity is what matters here. So far 350 have explicitly joined us in this fight.",
                  "author": "astute_canary",
                  "created": 1576015036,
                  "upvotes": 25,
                  "replies": {
                    "fafjws8": {
                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafjws8/",
                      "text": "if you have 300 faculty why aren't the rest of your union striking then? Seems like something is wrong.",
                      "author": "Furthur",
                      "created": 1576024616,
                      "upvotes": 6,
                      "replies": {}
                    },
                    "faf7i9u": {
                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf7i9u/",
                      "text": "Oh that’s even better.\n\nMaybe the admins could do some real work for once.",
                      "author": null,
                      "created": 1576016200,
                      "upvotes": 8,
                      "replies": {}
                    },
                    "fafps3k": {
                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafps3k/",
                      "text": "That's wonderful!",
                      "author": "vortex_time",
                      "created": 1576028839,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fafayj4": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafayj4/",
              "text": "Have you gotten any angry emails? What if people come to office hours for feedback, is that allowed by the strike?",
              "author": "ShutUpAndSmokeMyWeed",
              "created": 1576018379,
              "upvotes": 3,
              "replies": {
                "fafb5fg": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafb5fg/",
                  "text": "None. We are grading all paper and final materials. We are also answering questions about course material and finals- the only thing we are doing differently is withholding final grades from administration!",
                  "author": "astute_canary",
                  "created": 1576018500,
                  "upvotes": 15,
                  "replies": {}
                }
              }
            }
          }
        },
        "fafpigv": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafpigv/",
          "text": "My TAs were all more than willing to make exceptions for me and my fellow undergrads. Those of us with circumstances that require timely grade-posting—situations that include financial aid/grant/scholarship/international status/probation, etc. were assured exceptions will be made if needed.",
          "author": "sunranae",
          "created": 1576028648,
          "upvotes": 5,
          "replies": {
            "fafq3zv": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafq3zv/",
              "text": "As an ex-TA, I’d hope so. \n\nWas mostly joking because I’ve gotten some dumb emails before about grades, let alone withholding them.",
              "author": "kudles",
              "created": 1576029073,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "faeplcq": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeplcq/",
      "text": "Good luck from the east coast! Even the prospect of a strike was enough to win some important concessions from our administration last year. Hoping things play out well for you all!",
      "author": null,
      "created": 1576005533,
      "upvotes": 42,
      "replies": {}
    },
    "faeovds": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeovds/",
      "text": "I live in a different country so this may sound a little off topic but paying about 50% of your wage for rent is normal here. I'm actually quite suprised this isn't the norm in western countries. The world is really going crazy... Anyway, I hope the situation gets better for you!!",
      "author": "Lady_of_Ironrath",
      "created": 1576005118,
      "upvotes": 2,
      "replies": {
        "faesoz7": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faesoz7/",
          "text": "It should not be the norm anywhere. There are many places in the US where “the rent is too damn high” and a significant portion of income goes towards housing. This is completely unsustainable for middle and lower-income individuals and families. I believe a good rule of thumb is that no more than a third of your income should go towards housing.",
          "author": "SaintLoserMisery",
          "created": 1576007378,
          "upvotes": 14,
          "replies": {
            "faevuap": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faevuap/",
              "text": "I agree but unfortunately no matter who I talk to, the situation seems to be the same everywhere around the world.",
              "author": "Lady_of_Ironrath",
              "created": 1576009232,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "faeuo3q": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeuo3q/",
          "text": "sounds pretty normal to me too. I pay about 50% in rent and utilities while going to school and so do any young people/students in my area who live alone/with roommates and pay their own bills. if 50% isn't normal then wages need to be bumped up across the country, not just for these grad students",
          "author": "CuhrodeLOL",
          "created": 1576008545,
          "upvotes": 9,
          "replies": {
            "faexguw": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faexguw/",
              "text": "> if 50% isn't normal then wages need to be bumped up across the country\n\n[yes](https://thumbor.forbes.com/thumbor/1280x868/https%3A%2F%2Fblogs-images.forbes.com%2Ftimworstall%2Ffiles%2F2016%2F10%2Fwagescompensation-1200x1093.png)",
              "author": "RagePoop",
              "created": 1576010183,
              "upvotes": 13,
              "replies": {
                "faf3pag": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf3pag/",
                  "text": "What happened in the 70s to cause this big diversion?",
                  "author": "maps1122",
                  "created": 1576013874,
                  "upvotes": 2,
                  "replies": {
                    "faf7hng": {
                      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf7hng/",
                      "text": "A lot of things, really.\n\nBut can kinda be summed up by the US losing complete hegemony over the global marketplace as other economies/industrial centers finally began to recover from WW2 providing some semblance of competition.\n\nUp until that point the ridiculously one sided economic situation benefited both capital and labor, however as the rate of increasing marketplace/profits began to stall capital refused to change their slice of the pie and thus began edging labor out. This goes hand in hand with the beginning of the end of powerful unions, deregulation of pretty much every sector: financial/environmental/media+cable/etc, and a bunch of other cultural-economic decisions (Nixon jumping off the gold standard, opening up relations with China, yada yada yada)",
                      "author": "RagePoop",
                      "created": 1576016189,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fag9r91": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fag9r91/",
          "text": "From what I understand, 50% is more normal in many EU countries (especially the more wealthy northern ones and the UK) because they have lower incomes, but also lower tiertiary costs like healthcare, tuitiion etc than the US. So a larger chunk of their income goes to rent, but of what remains, they can save a lot more because they aren't paying health deductibles and all that crap.\n\nPeople in the US general make higher salaries, but have to pay a lot more for things that are cheap or free in Europe; so 50% only to rent is very high in a lot of places in the US outside of the major cities.",
          "author": "iammaxhailme",
          "created": 1576044998,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "faeoibe": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeoibe/",
      "text": "Go hard!",
      "author": "Hottt_Donna",
      "created": 1576004915,
      "upvotes": 38,
      "replies": {}
    },
    "faeofi5": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeofi5/",
      "text": "Hell yeah, you have my support!",
      "author": "ylang_ylang",
      "created": 1576004869,
      "upvotes": 15,
      "replies": {}
    },
    "faeoeag": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeoeag/",
      "text": "Good luck from UCLA!",
      "author": "hypercube42342",
      "created": 1576004849,
      "upvotes": 45,
      "replies": {
        "faf06g4": {
          "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf06g4/",
          "text": "Our turn next maybe? ;P",
          "author": "Guluronate",
          "created": 1576011771,
          "upvotes": 24,
          "replies": {
            "faf46wp": {
              "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf46wp/",
              "text": "I sure hope so! First quarter monthly stipends are lower than monthly rent at Weyburn, it’s highway robbery",
              "author": "hypercube42342",
              "created": 1576014171,
              "upvotes": 22,
              "replies": {
                "faf6uak": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf6uak/",
                  "text": "To say nothing of how trash they are at actually paying students on time. When I finished rotations, they forgot to transfer my stipend to my new department, so neither one paid me. It took them nine months to figure out the paperwork.",
                  "author": "Guluronate",
                  "created": 1576015788,
                  "upvotes": 16,
                  "replies": {}
                },
                "faf69dq": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faf69dq/",
                  "text": "DO IT, DO IT!!",
                  "author": "astute_canary",
                  "created": 1576015431,
                  "upvotes": 8,
                  "replies": {}
                },
                "fafr4n8": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fafr4n8/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1576029790,
                  "upvotes": 6,
                  "replies": {}
                },
                "fag25vc": {
                  "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/fag25vc/",
                  "text": "Yeah, as a 25% TA, I'm having to dip a bit into my savings for Weyburn rent each month.  Looking forward (kind of...) to being 50% next quarter.",
                  "author": "texdiego",
                  "created": 1576037981,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "faeo89f": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeo89f/",
      "text": "Solidarity forever!",
      "author": "supposedlyfunthing",
      "created": 1576004751,
      "upvotes": 26,
      "replies": {}
    },
    "faeo6oy": {
      "link": "/r/GradSchool/comments/e8tpwz/ucsc_graduate_students_are_on_wildcat_grading/faeo6oy/",
      "text": "Good luck, fam, I know the graduate stipend can be brutalizing and depressing.",
      "author": "sweetestboo",
      "created": 1576004725,
      "upvotes": 35,
      "replies": {}
    }
  },
  "updated": 1634066896
}