{
  "sid": "pp9mmi",
  "link": "/r/GradSchool/comments/pp9mmi/whats_the_most_valuable_thing_youve_learnt_in/",
  "title:": "what's the most valuable thing you've learnt in postgraduate education?",
  "text": "I'm in my first year of a PhD and just coming off 12 months of home working.\n\nTo me, the most crucial thing I've come to terms with is that I can't be expected to perform the way I did when I was on campus, especially because of the distractions or general setup I have at home.\n\nMoreover, I suppose it's also important to not judge productivity based upon raw output. Sometimes I only mabage to work 4 hours in a day or only make it through one article when I had 3 queued up. \n\nWhat are some good pointers or tools you've come to use?",
  "author": "Nuclear_Fermion",
  "created": 1631782889,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hd4sura": {
      "link": "/r/GradSchool/comments/pp9mmi/whats_the_most_valuable_thing_youve_learnt_in/hd4sura/",
      "text": "Some bosses are not nice (wording replaced after careful consideration)\n\nIt's important who you surround yourself with\n\nYou always have an option to quit\n\n(but you rarely do, because you might not want to accept the disillusionment of academia that brought you in the first place, so you keep taking the blue pills to forget the bad, and live long enough before you become the villain of the next chapter)",
      "author": "burntoutgradstudent",
      "created": 1631829214,
      "upvotes": 1,
      "replies": {}
    },
    "hd3pk1p": {
      "link": "/r/GradSchool/comments/pp9mmi/whats_the_most_valuable_thing_youve_learnt_in/hd3pk1p/",
      "text": "The biggest thing I learned from my academic experiences is the ability to think critically. Grad school gave me the safe environment to fail in my decision making from time to time. Work in the industry is most likely not going to rely exactly on what you’ve learned/researched during your academic years. But throughout my developing career, I am able to see parallels from the theory based work I’ve done in my studies to the problems we see today. Although my experiences in grad school are mostly neutral, what I gained from my studies is something I’m very grateful for.",
      "author": "WirrryWoo",
      "created": 1631813026,
      "upvotes": 1,
      "replies": {}
    },
    "hd3nxvk": {
      "link": "/r/GradSchool/comments/pp9mmi/whats_the_most_valuable_thing_youve_learnt_in/hd3nxvk/",
      "text": "Sometimes you’re just not going to be productive, and bashing your head against the wall all day won’t fix that. Better to get some R&R, so you can position yourself to be productive tomorrow.",
      "author": "BoostMobileAlt",
      "created": 1631812384,
      "upvotes": 3,
      "replies": {}
    },
    "hd33777": {
      "link": "/r/GradSchool/comments/pp9mmi/whats_the_most_valuable_thing_youve_learnt_in/hd33777/",
      "text": "1. Most grants are written to scam who ever is paying.\n\n2. Academia is inherently dishonest and has vastly more problems than industry.\n\n3. Nothing really matters.",
      "author": "Glarkin42",
      "created": 1631804059,
      "upvotes": 1,
      "replies": {}
    },
    "hd2rchl": {
      "link": "/r/GradSchool/comments/pp9mmi/whats_the_most_valuable_thing_youve_learnt_in/hd2rchl/",
      "text": "I've both learned truly how bad of a perfectionist I am and how to start letting that go. I've started to discover what \"good enough to be proud of\" is without killing myself to get there. \n\nI've also gotten a lot more confident about expressing ideas to people, especially while teaching or helping students one on one and while public speaking.",
      "author": "KiwiTheKitty",
      "created": 1631798966,
      "upvotes": 5,
      "replies": {
        "hd4tdhb": {
          "link": "/r/GradSchool/comments/pp9mmi/whats_the_most_valuable_thing_youve_learnt_in/hd4tdhb/",
          "text": "That sounds like a awesome and productive realisation! I’m curious though; how would you manage a perfectionist PhD student when you make it to tenure? \n\n/Yes, a perfectionist",
          "author": "oh-delay",
          "created": 1631829446,
          "upvotes": 1,
          "replies": {
            "hd4tgow": {
              "link": "/r/GradSchool/comments/pp9mmi/whats_the_most_valuable_thing_youve_learnt_in/hd4tgow/",
              "text": ">when you make it to tenure? \n\nAssuming I want to go into academia...",
              "author": "KiwiTheKitty",
              "created": 1631829486,
              "upvotes": 1,
              "replies": {
                "hd4tl7o": {
                  "link": "/r/GradSchool/comments/pp9mmi/whats_the_most_valuable_thing_youve_learnt_in/hd4tl7o/",
                  "text": "Of course!! Hypothetically.",
                  "author": "oh-delay",
                  "created": 1631829544,
                  "upvotes": 1,
                  "replies": {
                    "hd4u63o": {
                      "link": "/r/GradSchool/comments/pp9mmi/whats_the_most_valuable_thing_youve_learnt_in/hd4u63o/",
                      "text": "I haven't given it much thought. It's more of a personal struggle for me and I think most grad students struggle with it to some extent anyway so I'm not sure if there's anything different I would do differently from just the good advising style I'm trying to learn from my advisor. I don't think I would've been able to fix it just by being told it was a problem or being advised a certain way, it's one of those things you have to work out on your own or with a therapist.",
                      "author": "KiwiTheKitty",
                      "created": 1631829804,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hd2jkn7": {
      "link": "/r/GradSchool/comments/pp9mmi/whats_the_most_valuable_thing_youve_learnt_in/hd2jkn7/",
      "text": "How to receive criticism. I used to get very angry at criticism, but now in my last year I have noticed how improving upon the critiques helped me become a better scientist. So now, I welcome the feedback; although, it can still hurt if it’s harsh.",
      "author": "fserv11",
      "created": 1631795053,
      "upvotes": 3,
      "replies": {}
    },
    "hd2if14": {
      "link": "/r/GradSchool/comments/pp9mmi/whats_the_most_valuable_thing_youve_learnt_in/hd2if14/",
      "text": "I remind myself at times \"You're not here because you know this, you're here because you don't. That's what learning is.\"\n\nI get really caught up in looking stupid or not knowing how to do something and having to struggle or ask questions I *feel* like I should already know. So reminding myself that the role of a student is to learn, not to already know, has been big for my mental health.",
      "author": "Ancient_Winter",
      "created": 1631794401,
      "upvotes": 11,
      "replies": {}
    }
  },
  "updated": 1634066698
}