{
  "sid": "pyc4aq",
  "link": "/r/GradSchool/comments/pyc4aq/is_it_a_big_deal_to_have_a_w_on_my_transcript_in/",
  "title:": "Is it a big deal to have a W on my transcript in Grad School?",
  "text": "I just started the first term of my Ph.D. program and am seriously dying. I signed up for a course that I had no business taking (a very math-y first-order optimization course) and now I am really regretting it. I honestly can't focus on anything else except this course and I am basically just barely able to half-answer some questions. The add-drop deadline passed 2 days ago and now if I were to withdraw, I would first have to double-check with my supervisor and then have a w on my transcript.\n\nOn one hand, I'd have to face my supervisor (who I already told that I was going to stick it out earlier in the term), and also I will have a W on my transcript. On the other hand, my quality of life has hit the floor; I can't sleep and have a permanent headache and can just feel the stress like a cold sweat all day long. I'm really trying in this course but it's affecting my other course and research to the point where I basically can't do them. I am doing all the readings and watching/taking notes for all the lectures but the course just isn't working for me. Are there long term implications to having a W on my transcript for getting a job in industry?",
  "author": "TobusFire",
  "created": 1632975093,
  "updated": 1634100337,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "heua2vb": {
      "link": "/r/GradSchool/comments/pyc4aq/is_it_a_big_deal_to_have_a_w_on_my_transcript_in/heua2vb/",
      "text": "This happened to me too. I don‘t think one W makes too much of a difference. Especially in your first year. You should be fine.",
      "author": "Mega_Dragonite96",
      "created": 1633003608,
      "upvotes": 2,
      "replies": {}
    },
    "heukg9e": {
      "link": "/r/GradSchool/comments/pyc4aq/is_it_a_big_deal_to_have_a_w_on_my_transcript_in/heukg9e/",
      "text": "I did the same exact thing, I'm not worried about having a W. Worth it as I couldn't focus on anything else but that class at the time. I don't imagine they're going to not give you a job in industry all because of a W.\n\nHowever, I still found the class interesting and will actually be auditing it soon. I should have done that in the first place.",
      "author": "Sir_Chilliam",
      "created": 1633009071,
      "upvotes": 2,
      "replies": {}
    },
    "hevxz8x": {
      "link": "/r/GradSchool/comments/pyc4aq/is_it_a_big_deal_to_have_a_w_on_my_transcript_in/hevxz8x/",
      "text": "In industry? I doubt a W would matter much. If you break yourself, though, you probably won't be able to get a job in industry - or any job. Don't break yourself. Your health is most important.",
      "author": "Various-Grapefruit12",
      "created": 1633029881,
      "upvotes": 1,
      "replies": {
        "hezgb10": {
          "link": "/r/GradSchool/comments/pyc4aq/is_it_a_big_deal_to_have_a_w_on_my_transcript_in/hezgb10/",
          "text": "Thanks, that really means I lot to hear",
          "author": "TobusFire",
          "created": 1633101730,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}