{
  "sid": "q303z9",
  "link": "/r/GradSchool/comments/q303z9/tips_for_how_to_survive_and_thrive_in_grad_school/",
  "title:": "Tips for how to survive and thrive in grad school!",
  "text": "Hi everyone, I'm in my last year of my counselling psychology program and I wanted to share some tips for how to not only survive but also thrive in grad school!\n\nI think it's important to know that you're not alone in your grad school struggles. Grad school can be stressful and overwhelming, and there are high expectations and pressures to do well. Most, if not all of us, experience imposter syndrome, and we may think that we don't deserve to be in our programs, we got lucky, or we're frauds that people will find out about. When we feel this way, it can lead us to isolate ourselves from others because we don't want them to know us well enough to see our weaknesses. Sometimes the imposter syndrome goes away when we see ourselves achieve success in our programs or get recognition from others, but sometimes it stays with us for a long time. For me, it helped to hear that other people in my program were experiencing the same feelings, and seeing that they were really accomplished people. Something else that helped me with imposter syndrome was changing my mindset to focusing more on growth and learning, rather than trying to get things right the first time and be perfect. In my experiences, my research supervisor was open to helping me when I had struggles with our research project. It can be a relief to admit that you need some support from either the supervisor, professors, or classmates. I think at the end of the day, people in grad school do want to see you succeed and move forward in academia or your career. So try to reach out to someone if you need help or support!\n\nI also created a short video for more tips on surviving and thriving in grad school that you can check out if you're interested: [https://youtu.be/wZeVvsd6-zw](https://youtu.be/wZeVvsd6-zw)",
  "author": "lindaedith",
  "created": 1633576705,
  "updated": 1634099856,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.78,
  "comments": {}
}