{
  "sid": "qo6wyv",
  "link": "/r/GradSchool/comments/qo6wyv/question_about_first_name_in_university/",
  "title:": "Question about \"first name\" in university applications",
  "text": "I am applying for Master's in computer science to an American university as an International student.\n\nMy name is   \"ABC DEF GHI\"\n\nwhere ABC is my given name, DEF is my middle name (father's) and GHI is the last name.\n\nMy country's passport however has only first name and last name.\n\nMy passport shows first name as \"ABC DEF\" and my last name as \"GHI\"\n\nWhile filling university applications, I see that they ask for only First name and last name.\n\nI am unsure if I need to fill my first name as \"ABC\" (given name) or \"ABC DEF\" (as per the passport).\n\nI would have preferred to use \"ABC\" as \"ABC DEF\" doesn't make much sense as a name.\n\nBut however, can it be matched with my passport by the university?\n\nI have always used the entire \"ABC DEF GHI\" everywhere, be it my CV or transcripts. But the problem arises only when I am asked separately for first name and last name, but there is no middle name option.",
  "author": "inspire_gradschool",
  "created": 1636225436,
  "updated": 1636656733,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.92,
  "comments": {
    "hjl954m": {
      "link": "/r/GradSchool/comments/qo6wyv/question_about_first_name_in_university/hjl954m/",
      "text": "I'm an American. I have four names-- abc def ghi jkl.\n\nWhen they ask for first and last name, I just put Abc Jkl. Full name really isn't important in this context. After I'm accepted, I explain to them that I go by my middle name \"Def.\" There have never been any issues.",
      "author": "what--the-heck",
      "created": 1636229078,
      "upvotes": 28,
      "replies": {
        "hjl98lv": {
          "link": "/r/GradSchool/comments/qo6wyv/question_about_first_name_in_university/hjl98lv/",
          "text": "My passport says ABC DEF GHI JKL, if it makes any difference.",
          "author": "what--the-heck",
          "created": 1636229120,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hjlkhzy": {
      "link": "/r/GradSchool/comments/qo6wyv/question_about_first_name_in_university/hjlkhzy/",
      "text": "For the application, I would write ABC DEF for first name and GHI for last. It’s important your application match any official documentation that they will eventually request. I work in admissions for grad school in the US.",
      "author": "pandawolf313",
      "created": 1636234158,
      "upvotes": 12,
      "replies": {}
    },
    "hjl17kj": {
      "link": "/r/GradSchool/comments/qo6wyv/question_about_first_name_in_university/hjl17kj/",
      "text": "My Brazilian friend has a million names.  He put his beginning true first name, and the very last name. All other names he put as abbreviations.  For example James Y.H.F.L. Adams.",
      "author": "Maskedxangel",
      "created": 1636225587,
      "upvotes": 8,
      "replies": {}
    },
    "hjm611g": {
      "link": "/r/GradSchool/comments/qo6wyv/question_about_first_name_in_university/hjm611g/",
      "text": "If your name is distinctive enough that you are the only ABC GHI applying in this cycle, then the admissions people will not have trouble making sure all your materials end up in the application.",
      "author": "IkeRoberts",
      "created": 1636243943,
      "upvotes": 1,
      "replies": {}
    },
    "hjmrsrd": {
      "link": "/r/GradSchool/comments/qo6wyv/question_about_first_name_in_university/hjmrsrd/",
      "text": "Your application for your I-20 will be different then your admissions application. But - are you sure the admissions application doesn’t have a middle name field?",
      "author": "GradAdmissionDir",
      "created": 1636254545,
      "upvotes": 1,
      "replies": {}
    },
    "hjmuhwq": {
      "link": "/r/GradSchool/comments/qo6wyv/question_about_first_name_in_university/hjmuhwq/",
      "text": "Always match your passport.\n\nI have done international student services for a bit. Always match your passport.\n\nYou can drop the middle name in school work, club rosters, and so on, and maybe the school ID card if they will let you, but for proper application and legal procedures, your \"legal\" name matching your passport is always the best.",
      "author": "lunaticneko",
      "created": 1636256024,
      "upvotes": 1,
      "replies": {}
    }
  }
}