{
  "sid": "q8bc5k",
  "link": "/r/GradSchool/comments/q8bc5k/requirements_for_lecturer/",
  "title:": "Requirements for Lecturer",
  "text": "I am interested in returning to school to ultimately become a teaching-focused professor or lecturer at the university level, teaching such topics as “history of irregular warfare”, “military organization and theory for history/polisci majors”, “irregular warfare theory for history/polisci majors”, “comparative political violence”, “political violence in ireland”, “political violence in quebec”, etc. \n\nI currently have a MS Engineering Management, BS Engineering, and will be the graduate of several US Army schools, including graduate-level education in maneuver warfare. My professional experience has been in supply chain/operations as an engineer and in various command and staff positions as a military officer. I have done significant professional self-study in irregular warfare, general history, and leadership/management.  \n\nWill I need to get a PhD to make this happen? Or will a master’s in history/polisci/etc. be sufficient? \n\nNote I would be good with, and perhaps prefer, being at a small university or college. \n\nThanks for ant advice.",
  "author": "Spirit_of_Autumn",
  "created": 1634253823,
  "updated": 1634332149,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hgodvvw": {
      "link": "/r/GradSchool/comments/q8bc5k/requirements_for_lecturer/hgodvvw/",
      "text": "Typically the requirements for lecturing faculty are one degree above degree teaching with the exception of terminal degrees",
      "author": "feuerwehrmann",
      "created": 1634256974,
      "upvotes": 3,
      "replies": {}
    },
    "hgoe74y": {
      "link": "/r/GradSchool/comments/q8bc5k/requirements_for_lecturer/hgoe74y/",
      "text": "I would suggest looking at the kinds of places you’d like to teach and establishing if their staff all have PhDs. In my discipline, in the UK, it’s basically a requirement now to have a PhD for a lecturer role. It would be unheard of for someone to be a lecturer or professor without one these days. But this can vary across disciplines and countries it seems.",
      "author": "fjkfjldsls",
      "created": 1634257122,
      "upvotes": 2,
      "replies": {}
    }
  }
}