{
  "sid": "qv50hc",
  "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/",
  "title:": "Planning a PhD in Canada",
  "text": "I am planning to do a PhD in Canada in Geoscience  , is the stipend given PhD students enough to live there comfortably? (i am not a spend thrift and am good with my finances) And are the tuition fees for PhD in the university waved off / covered by the funding?",
  "author": "lumberjack1273",
  "created": 1637059032,
  "updated": 1637182662,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.73,
  "comments": {
    "hkv67cl": {
      "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkv67cl/",
      "text": "Edmonton? Toronto? Peterborough?\n\nWhat do you mean by comfortable?",
      "author": "CheeseWheels38",
      "created": 1637078044,
      "upvotes": 10,
      "replies": {}
    },
    "hkuapn3": {
      "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkuapn3/",
      "text": "At the university I go to in Canada for an MSc the stipend is not enough to be comfortable and the tuition (which is supposedly amount the lowest in the country) is not waved. I am paying out of province tuition fees which are less than international fees. There is barely anything left after tuition and rent. It looked about the same for the PhD program. I",
      "author": "UleeBunny",
      "created": 1637061836,
      "upvotes": 7,
      "replies": {
        "hkui7ty": {
          "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkui7ty/",
          "text": "Agreed. Getting a tuition scholarship (where possible) is a game changer. I remember when I originally started I didn’t have one and was left with ~6,500 CAD / year in a relatively expensive city. I think stipends are a bit higher now but still. I suggest OP looks at cost of living in the area and if there are scholarships available (internally and externally).",
          "author": "adnamanda",
          "created": 1637066816,
          "upvotes": 5,
          "replies": {}
        },
        "hkxfk8v": {
          "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkxfk8v/",
          "text": "what is your MSc that you are paying \"out of province\" tuition? I come from Ontario and am doing a MSc in UofC and I pay the same as others",
          "author": "nopenopechem",
          "created": 1637110937,
          "upvotes": 1,
          "replies": {
            "hkxry91": {
              "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkxry91/",
              "text": "I go to MUN in NL. Tuition is higher for non-residents.",
              "author": "UleeBunny",
              "created": 1637116368,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkut541": {
      "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkut541/",
      "text": "Geoscience grad here! Yes, you need to pay tuition fees out of pocket, but they are a lot lower than in US institutions. At my university tuition for 1 year was about $4,000 CAD, which included a pretty good health care and dental care plan. In our department, all the PhD students made a minimum of $25,000 CAD a year, and that was not taxable. If you are an international student (higher tuition) then often you would make more so you would be on the same level as the domestic students. One way to make things easier is to get scholarships, which then boost your income (also untaxed). If you TA that also should increase your income, but that is subject to taxes because it counts as \"employment\" instead of a stipend. \n\nMost of the graduate students in my department lived in shared housing (rent on the order of $500-800 CAD a month). It would still be tight, and not everyone opted to have a car, but we could all make ends meet. Depending where you will be in Canada the costs will be different of course, but I hope this helps!",
      "author": "CuriousAboutLife0",
      "created": 1637072420,
      "upvotes": 5,
      "replies": {}
    },
    "hkupemf": {
      "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkupemf/",
      "text": "Determine your stipend, look up to cost of living where you'd be located, then compare.",
      "author": "rox_et_al",
      "created": 1637070636,
      "upvotes": 2,
      "replies": {}
    },
    "hkuwve5": {
      "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkuwve5/",
      "text": "As with most things, the answer is \"it depends\". I am in a low cost of living city (Edmonton) and the base stipend is enough to live on, though \"comfortably\" could be debated. Our stipends increase every year, if we are not on scholarship (Physics, YMMV). As other commenters have mentioned, tuition is relatively low. Scholarships are not taxed, and while stipends usually *are* taxable, tuition credits will offset this to beneath your base deduction and so you won't need to pay tax.\n\nOverall, I am very happy with my income, though I am on a few major scholarships which increase my income slightly (though not as much as you might think, they *replace* your stipend). In a larger city like Vancouver or Toronto with an out of control real estate market, it might be a different story.",
      "author": "ThePeregrine_87",
      "created": 1637074117,
      "upvotes": 2,
      "replies": {}
    },
    "hkvafnf": {
      "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkvafnf/",
      "text": "The hard answer is every university is different across Canada how they run their stipends and scholarships. When I was researching programs it seems like PhD funding is usually automatically required and usually set between 18-25k cad depending on the university or program. Some programs make TAing a requirement for stipend and some programs TAing is money on top. Tuition can vary greatly across the country from 4k-10k for Canadian students, international is always more but how more depends again on the university. Tuition is often not covered by the department so do not assume it will be taken care of. \n\nI personally would say on a stipend for a PhD you cannot live comfortably alone without additional scholarships, or sources of income like TAing or tutoring.",
      "author": "SuchAGeoNerd",
      "created": 1637079752,
      "upvotes": 2,
      "replies": {
        "hkvotka": {
          "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkvotka/",
          "text": "Good answer. OP should ask the department (or better yet, their potential supervisor), \"If I win a scholarship or do TAing, does that replace or add on to the stipend?\" Get the answer in writing, if possible. Even in one department, profs may handle these differently -- potentially due to the source of their funding.",
          "author": "Frelaras",
          "created": 1637085354,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkviakp": {
      "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkviakp/",
      "text": "Depends heavily on the school and where you live. There are usually set amounts, but then each program and even lab may have different standards for what they pay their students. It will also depend on how competitive your CV is, as that will typically determine external funding (NSERC, CIHR, SSHRC). Also if you live in Vancouver or Toronto (or other expensive cities), it is unlikely you will be able to live super comfortably.",
      "author": "sensorimotorneuro",
      "created": 1637082842,
      "upvotes": 2,
      "replies": {}
    },
    "hkuqqms": {
      "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkuqqms/",
      "text": "Usually you can get a deal where you do some teaching assisting and research for the professor. As far is it livable? You can do it if you have roommates. It really depends where you live.",
      "author": "lovethebee_bethebee",
      "created": 1637071276,
      "upvotes": 1,
      "replies": {}
    },
    "hkve91j": {
      "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkve91j/",
      "text": "Yes- funding makes all the difference",
      "author": "isitsummeryet34y",
      "created": 1637081255,
      "upvotes": 1,
      "replies": {}
    },
    "hkv7sfv": {
      "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkv7sfv/",
      "text": "Do Not Do A PhD In Canada.",
      "author": "anonymousbach",
      "created": 1637078685,
      "upvotes": 0,
      "replies": {
        "hkva60l": {
          "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkva60l/",
          "text": "Why's that?",
          "author": "A_Rude_Canadian_",
          "created": 1637079647,
          "upvotes": 2,
          "replies": {
            "hkvcdgp": {
              "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkvcdgp/",
              "text": "Because unless you're exceptional, the funding situation is shit, and if you're exceptional why work in Canada when you could just as easily go to the US or Europe where they have better equipment,  better labs and better future prospects?",
              "author": "anonymousbach",
              "created": 1637080520,
              "upvotes": 1,
              "replies": {
                "hkxfwqf": {
                  "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkxfwqf/",
                  "text": "Because you like living in Canada?",
                  "author": "NorthernValkyrie19",
                  "created": 1637111090,
                  "upvotes": 0,
                  "replies": {
                    "hkxn7ds": {
                      "link": "/r/GradSchool/comments/qv50hc/planning_a_phd_in_canada/hkxn7ds/",
                      "text": "If you're dumb enough to think that, grad school is no place for you. You're better off trying to sue your primary school for delinquency.",
                      "author": "anonymousbach",
                      "created": 1637114292,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}