{
  "sid": "r9u2qj",
  "link": "/r/GradSchool/comments/r9u2qj/how_do_you_look_at_the_oneproject_onementor_norm/",
  "title:": "How do you look at the one-project, one-mentor norm?",
  "text": "Hi folks!\n\nI'm an undergraduate physics major planning to go to grad school in a year. \n\nThroughout my work at my undergrad institution, I've researched a lot, often with 2 - 3 professors at once. I want to learn about and experience different topics before settling on one for life (I've found it now -- planetary science!). \n\nThe idea that you must commit to one professor and one project makes little sense to me. If I spend the same amount of time as I would otherwise, why does it matter?\n\nBut I have heard from professors, fellow undergrads, and current graduate students that working on multiple projects is a little weird in undergrad and highly discouraged if not outright against the code in graduate school. Even taking on an external job to make ends meet is darn near blasphemous. A friend described it as \"cheating\" on their research mentor.\n\nI'm worried about hitting a \"culture shock\" in grad school: being interested in additional questions outside my thesis, offending my professor by working on additional projects, or struggling to get by financially. I don't want to hurt anyone's feelings, but I don't want to only do one thing at a time, either.\n\nI know research in grad school is deeper and of course much more of a time commitment than undergrad, and doing multiple projects is often humanly infeasible. Yet, it seems counterproductive to discourage students from taking on any other work.\n\nAny advice? How do you personally look at one-project, one-mentor norm in graduate school? Does this norm continue after grad school (e.g., in postdocs and long-term positions)?",
  "author": "insubstantialsh",
  "created": 1638751354,
  "updated": 1639518967,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hned5l3": {
      "link": "/r/GradSchool/comments/r9u2qj/how_do_you_look_at_the_oneproject_onementor_norm/hned5l3/",
      "text": "Doing scattered projects rarely works. On the other hand, doing projects that are part of an interdisciplinary team allow you to address a problem with a variety of approaches and get superior training.",
      "author": "IkeRoberts",
      "created": 1638751779,
      "upvotes": 11,
      "replies": {}
    },
    "hnee7da": {
      "link": "/r/GradSchool/comments/r9u2qj/how_do_you_look_at_the_oneproject_onementor_norm/hnee7da/",
      "text": "Many programs do not allow you to work an outside job if you are also collecting a TA or RA stipend / tuition remission benefits. Check the rules before you try to take an outside job. \n\nThe point is that to do high quality, graduate level research you really have to fully immerse yourself in your project in a way that's not expected of undergraduates. That's not to say you can't do side projects once in awhile, but you really have to put blinders on to do the level of research that's necessary to finish a thesis or dissertation. If you're not in lab, you're reading or writing, planning your next set of experiments, de-bugging code, reading more papers, trying to interpret data... etc. I know you have a taste of all of that from undergrad research but I guarantee you haven't driven a project independently the way you will need to during graduate school. It requires very deep knowledge, which you can really only get by devoting yourself fully to the work. I haven't known anyone who could successfully drive a project from beginning to end who also allowed themselves to get constantly distracted by side projects. It just doesn't work.",
      "author": "boilerlashes",
      "created": 1638752244,
      "upvotes": 11,
      "replies": {
        "hngau4a": {
          "link": "/r/GradSchool/comments/r9u2qj/how_do_you_look_at_the_oneproject_onementor_norm/hngau4a/",
          "text": "Be careful with the outside job. TA and RA assignments are designed specifically to use the rest of your time making progress on your studies. If you instead fill that time with another job, you won't make adequate progress and defeat the whole purpose of being in graduate school.\n\nOn a related topic: If the stipend level is too low to cover living expenses, it is best for everyone to switch to a school where the stipend is sufficient. The practice of underpaying will not change as long as students keep accepting it.",
          "author": "IkeRoberts",
          "created": 1638794617,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnf4x7v": {
      "link": "/r/GradSchool/comments/r9u2qj/how_do_you_look_at_the_oneproject_onementor_norm/hnf4x7v/",
      "text": "I don't think you have to commit to one and only one professor, or even one advisor (I'm fairly sure co-advisors are a thing).  I work closely with a postdoc as well as my advisor, and I could have wound up working with a couple of different professors (simultaneously) had I picked a different project.\n\nFor projects, some of the PhD students I know had some pretty distinct projects for the chapters of their dissertation.  They were all related by some common theme (to fit them together into one dissertation, I assume), but they could get pretty far apart within that.\n\n[I don't know how much of an edge case it is, but I personally also help out a bit with another project in the same research group and I do some work on a spinoff side project of my own, again in the same group, both of which my advisor is fine with--I assume the \"in the same group\" part is important there.]",
      "author": "djp_hydro",
      "created": 1638764375,
      "upvotes": 7,
      "replies": {}
    },
    "hnedl7h": {
      "link": "/r/GradSchool/comments/r9u2qj/how_do_you_look_at_the_oneproject_onementor_norm/hnedl7h/",
      "text": "For what it’s worth, I would not look favorably on a student in my lab double dipping in others, and would likely result in them not continuing in my lab. \n\nHere’s the reasoning: no undergraduate manages to work enough time in my lab to make the time spent mentoring them worth it for research progress, but the more they’re spreading themselves thin trying to keep up with multiple projects, the less they’re usually able to make significant contributions to my labs work. \n\nThe same is true for graduate students. Your PI is spending what is usually a significant amount of funds on both the materials, your stipend, and often your tuition (depends some on the school and field) with usually a significant gap before you’re “productive”. While your time is yours outside of your work, most of us don’t have unlimited mental resources (creativity, energy to read papers, mental space to learn new concepts and techniques) so if you’re splitting that between multiple groups, chances are you’re giving less than “full” effort to each of them. \n\nSince funding that’s used to pay to keep labs open (grants) is dependent on progress being made on the research aims of the grant (publications, etc.) having students you’re paying for that are putting out less than full effort isn’t ideal. \n\nMany companies have clauses preventing you from working for another company in the same field, for this reason. You can’t work at Google and Apple at the same time.\n\nThat said, one project isn’t the same thing as one research group. I was usually juggling 2-4 projects at a time in grad school, they just all related to one research lab.",
      "author": "Eigengrad",
      "created": 1638751968,
      "upvotes": 12,
      "replies": {}
    },
    "hnfkzhw": {
      "link": "/r/GradSchool/comments/r9u2qj/how_do_you_look_at_the_oneproject_onementor_norm/hnfkzhw/",
      "text": "Thank you to everyone for your great responses! I really appreciate everyone's contributions. I hadn't considered the distinction between \"one lab group\" and \"one project\", nor the idea that a dissertation is much more far-reaching and asks many more questions than a year or two as an undergrad on a project. That reshapes the experience!\n\nI also appreciate folks emphasizing that graduate students are usually financially supported by a lab and that it's paid as a full-time job.  Undergraduates are only sometimes paid at my institution, so I hadn't considered the distinction between \"a job with a salary\" and \"minimum wage by the hour, sometimes\". Huge difference there!\n\nThanks again everyone!",
      "author": "insubstantialsh",
      "created": 1638774112,
      "upvotes": 2,
      "replies": {}
    }
  }
}