{
  "sid": "oss0rd",
  "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/",
  "title:": "The aftermath of quitting my PhD",
  "text": "A few months ago, I ended up leaving my Ph.D. program with my Masters degree (biochemistry) after failing my first round qualifying exam. I realized that I was ruining my mental health, hated being in the lab, and didn't enjoy the academic setting. So, in May, I decided to leave the PhD program and get a non-thesis based Masters instead. I left without a backup plan and wanted to share what happened after leaving. \n\nWeek 1 after leaving: forms, forms, forms, phone calls, emails. It took about a week to deal with the academic forms and administrative stuff to leave the PhD program and join the Masters program. If you decide to leave, I would highly recommend figuring out all of the forms before you officially leave so you don't have to deal with them later on. Once all of those were accepted and approved, I was officially done with the program. \n\nMonth 1-2 after leaving: I applied for about 50 different jobs in the area that I was interested in ranging from a lab technician to a research associate (all entry-level, but I had a Masters so I wanted to be on the research side). I received rejection after rejection (Indeed feels like a black hole from your resume). Luckily, I had some friends in my PhD department that had connections to a startup who emailed me for an interview. I also started getting emails from my applications from LinkedIn and Indeed, so it was time to start the interview process.\n\nMonth 3: I prioritized the biotech startup and decided to interview with them first. I had three rounds; phone screen, Zoom interview, and a two-hour in-person research presentation and interview. After my references were contacted, I received an email about a job offer for the Research Associate position at the startup. I have accepted that and will start next month. \n\nOverall, leaving my PhD program was the best thing I ever did. My anxiety is gone, my depression is manageable, and I'm not dreading going into lab every day anymore. If you are miserable in your PhD program, especially if you want to transition to industry afterward, there are more options than suffering through. If you've made it here, thank you for reading, I wanted to share a PhD dropout success story. My DMs are open if anyone wants to talk further about my experience.",
  "author": "lep187",
  "created": 1627409345,
  "over_18": false,
  "upvotes": 623,
  "upvote_ratio": 0.99,
  "comments": {
    "h6tvtnr": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6tvtnr/",
      "text": "Thanks for sharing. I was working fulltime, doing a PHD part time in an academic medical center. The nominal (verbal) support was there to do both, but after completing all my course work, and had an entire committee implode after working on my literature review for a year, I took a year off from the PhD part.   \nI looked around, and no one wanted to be my advisor, and the only real advisor options in my field were on the previously doomed committee. So I began job hunting, and found my fit.   \nI officially sent in notice (email) to the program director that I was not only leaving the program (he had tried to get me to stay a number of times), but I was also leaving the institution.   \nI filled out no forms, and as far as I know, the school prob just thinks I'm on hiatus (again).   \nMy new job is a 30% pay raise (without needing a PhD, they just need my expertise). \n\nI'm tremendously happy and feel like the burden of part-time PhD students is far overlooked.",
      "author": "tmaddog19",
      "created": 1627480094,
      "upvotes": 1,
      "replies": {}
    },
    "h6tpb0h": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6tpb0h/",
      "text": "I'm a Biochemistry undergrad: do you think I'd have a better chance getting into Biochemistry with just my undergrad vs a masters? I'm sure the positions that could be filled by a bachelors are more plentiful than those of a masters, but I also know that higher education is pretty essential to avoid a glass ceiling in the sciences. What do you make of it?",
      "author": "Iridium777",
      "created": 1627476778,
      "upvotes": 1,
      "replies": {
        "h6uq6pu": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6uq6pu/",
          "text": "It really depends on what your career goals are. There’s a huge difference between what you can get in academia vs industry with a bachelors degree. For industry, I have plenty of friends that left with their bachelors, started as an intern or lab tech at a biotech company, and then worked their way up as high as they could in the company. They’re doing completely fine, but the most likely won’t reach the positions that someone with a masters or PhD would. From what I noticed, there is more of a ceiling with a bachelors.",
          "author": "lep187",
          "created": 1627492955,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6szr60": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6szr60/",
      "text": "Dropped out early June and am applying for jobs now this was a refreshing post to read. Currently anxious about everything",
      "author": "violinprofessor",
      "created": 1627457039,
      "upvotes": 2,
      "replies": {
        "h6uqlm1": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6uqlm1/",
          "text": "I was there a month ago! The way I look at it, you were able to get into a PhD program so why can’t you get a good job? From my experience the PhD program interview was even more intense than the one I had for my job! Getting noticed is normally the most difficult part.",
          "author": "lep187",
          "created": 1627493127,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h6slhvy": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6slhvy/",
      "text": "Good on you for taking the initiative and having the courage. \n\nMany of us, are too afraid of the consequences and they are without a doubt for good reasons.",
      "author": "Cowboy_Yankee",
      "created": 1627446653,
      "upvotes": 3,
      "replies": {}
    },
    "h6scibl": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6scibl/",
      "text": "How has the new job been so far?  I've always been interested in joining/starting a startup after grad school.",
      "author": "nunyabidnyz",
      "created": 1627441570,
      "upvotes": 1,
      "replies": {}
    },
    "h6sao34": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6sao34/",
      "text": "I'm so glad this worked out for you! I did the same, although I dropped my masters program and found work with my bachelors in a similar field. Best decision I made regarding academics. My masters felt wrong from day 1 and for the first year my mental health declined, physical health evaporated and social life was non-existent. I resented every second I was in class and just did not like the material at all.\n\nLeaving and gaining work experience and balancing out my life was quite literally a life saver and I'm glad my experience isn't unique. \n\nFor anyone reading,  making the decision to leave or withdraw is scary until it's done. Then, not so scary. It works out.",
      "author": "factdaddy411",
      "created": 1627440589,
      "upvotes": 2,
      "replies": {}
    },
    "h6rmxi1": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6rmxi1/",
      "text": "I left a little over a year ago after 5.5 years in the program. And while there have been ups and downs, I can say that I’m definitely much happier and creative than I was during my PhD years, more confident in my skillset and perspective, and feel invigorated by true collaborative work in a way that I never experienced in grad school. \n\nThat being said, I do miss aspects of my dissertation work. I listened to a podcast that touched on aspects that I had been trying to address in my research and my heart fluttered a bit. But the reality is that I don’t come from wealth, and the choice to continue was seriously jeopardizing any sort of future financial stability I might hope for. We all know that success in academia is a gamble even with all the right credentials, and frankly I couldn’t afford that gamble any more (which fed into the depression/anxiety/pressure that I felt around my PhD… further hurting my odds at dealing a solid hand for the academic job market).\n\n—-(explicit rant begins)—\n\nI once had a (white, male, non-first-gen, able-bodied) successful professor tell me that people in our field “get paid in cool”. Until we get paid in MONEY we will never have any sort of equity in academia. BOY do professors hate when you explain this when explaining why you’re leaving. I guess I’m just a money guzzling monster 👹 for wanting to experience financial stability for the first time in my life… but as Megan Thee Stallion once said “rich bitch pussy only cum for a check” 🤑\n\n—-(explicit rant ends)—",
      "author": "thelittlenatnat",
      "created": 1627428788,
      "upvotes": 5,
      "replies": {
        "h6sb9p5": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6sb9p5/",
          "text": "I voiced my concerns about finding a job after getting a PhD once to a senior director (biotech company) and he asked why I should worry about that. Oh, I don't know, I've gotten use to eating , and even a roof over my head with indoor plumbing and some electricity. How about I take your paycheck and you can do your science for the love of it.",
          "author": "terraincognita360",
          "created": 1627440906,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h6rj3vu": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6rj3vu/",
      "text": "In case nobody has told you: I’m extremely proud of you OP. It takes courage to do what’s best for you and not many do. Cheers to a better and more manageable life. I’m really happy for you",
      "author": "chemeazy97",
      "created": 1627426972,
      "upvotes": 10,
      "replies": {
        "h6rjm0f": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6rjm0f/",
          "text": "Awww thank you so much! It means a lot. Everyone around me has been very supportive which is amazing. Not everyone gets the same support that I have and I’m very lucky to be around people (especially my PIs) who truly care about my well-being!",
          "author": "lep187",
          "created": 1627427212,
          "upvotes": 5,
          "replies": {
            "h6rkclj": {
              "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6rkclj/",
              "text": "Yes, absolutely. Having PI’s who want the best for you and not just 25  year old robots who crank out data for them is a blessing, really. It took my PI 6 months into my part-time status to realize I want to stay in industry… \n\nCongrats on the support and the offer! I think there are very few things more exciting than an actual offer as it speaks highly to your hard work. The next best feeling is having HR/recruitment specialists from your company’s competition reach out with offers, enabling you to ask for a raise haha.",
              "author": "chemeazy97",
              "created": 1627427566,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "h6ri92p": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6ri92p/",
      "text": "What I'm worried about this is that it sounds like you might not have been a candidate had you not had an \"in\" with the startup from your friends. (Not because of any fault of your own, I think its clear you are a capable scientist!) What do you think your path to a job would have been like without the recommendation from your friend? The reason why I ask is because I know a postdoc from my lab recently got a job in biotech after applying for a long time, and it was a job she had a similar connection to, which is a bit disheartening.",
      "author": "PepperJackson",
      "created": 1627426569,
      "upvotes": 8,
      "replies": {
        "h6rirl9": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6rirl9/",
          "text": "That’s absolutely fair and why it’s SO important to make connections anywhere you can. I also had a few other emails about interviews from LinkedIn and Indeed as well that were just from me applying to positions online. I really prioritized the startup since it was exactly what I was looking for. Making sure to play the application/interview game is annoying but definitely important. Include a nice resume and personalized cover letter and ALWAYS thank them after every meeting and phone call. It’s dumb that there are so many hoops, but there aren’t very many jobs and a lot of applicants so standing out in any way you can is also really important.",
          "author": "lep187",
          "created": 1627426812,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "h6r8pc9": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6r8pc9/",
      "text": "Hi! I'm really glad you're doing better and you took the initiative to do what was best for you! \n\nI am soon to be entering my first year in an Engineering PhD program and was wondering if you could give me some of your insight as to when you were starting out. How was your undergraduate experience and if you participated in undergraduate research how related was it to your PhD research? I am just trying to mentally prepare myself for this start and am looking to hear other peoples' stories and perspectives.\n\n&#x200B;\n\nThanks!",
      "author": "kyleculus16",
      "created": 1627422188,
      "upvotes": 4,
      "replies": {
        "h6rc0jp": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6rc0jp/",
          "text": "I abosultey loved my undergrad labs. I started out in a physical chemistry lab and then transitioned to a molecular biology one in undergrad. I really feel that my love for lab came from undergrad. When I came to the end of undergrad, I wanted to stay in school… I was really afraid to join the “real world” so I decided to go to grad school. Looking back, I’m glad I did it because it let me know what I didn’t want to do. I essentially was paid to get my masters in the end and it really helped to jump start my career in industry that’s for sure. \n\nMy research in undergrad only kept some of the cell culture techbiques, everything else I learned in grad school. Really, the research doesn’t matter nearly as much as picking the right PI. It’s also important to know that if you really hate it, you can leave. Only you are able to dictate how your graduate journey goes and you’re allowed to leave if you want to. I stayed longer than I should have in my opinion, but in the end it was clear to me and my PIs that a PhD simply isn’t for me. \n\nGeneral advice would be to get a group of friends that are further along in the program. Ask them absolutely everything you can, and most importantly, ask them to help you study for any department exams. They just did them and will be your best study tool. \n\nAnother thing that I noticed is that department members are ruthless. Be as personable as you can be and make as many friends as you can. The entire department was sad I left, which means I didn’t burn any bridges when I was there. Try to keep those relationships no matter what happens because they are so so so important for the next steps of your career. \n\nI hope that helps a bit! Let me know if you have more questions :)",
          "author": "lep187",
          "created": 1627423665,
          "upvotes": 6,
          "replies": {
            "h6rch62": {
              "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6rch62/",
              "text": "Thanks this is so insightful! I've heard it so many times how important that PI is and I've done my best to pick one I think is genuine and fits my needs. I also recently went out to dinner with her lab group (just us, no PI) and they only really had good things to say about the PI. \n\nI'll definitely be keeping your words of wisdom in my mind as I begin my program. Thanks again!",
              "author": "kyleculus16",
              "created": 1627423877,
              "upvotes": 2,
              "replies": {
                "h6rclmr": {
                  "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6rclmr/",
                  "text": "No problem! Sounds like you’re off to a great start!",
                  "author": "lep187",
                  "created": 1627423935,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h6r2ef3": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6r2ef3/",
      "text": "Good luck! That said the hoop jumping they make you do in interviews these days is absurdly ridiculous.",
      "author": "alvarkresh",
      "created": 1627419416,
      "upvotes": 4,
      "replies": {}
    },
    "h6qwskk": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6qwskk/",
      "text": "Thank you SO much for sharing this. I’ve been thinking about it and afraid I’ll regret it if I go. I’ve promised myself that I will move on if my mental health gets as bad this coming academic year as it was last. Anyway, it’s helpful to hear your positive outcome.",
      "author": "ElphabaTheGood",
      "created": 1627416922,
      "upvotes": 14,
      "replies": {
        "h6r68zj": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6r68zj/",
          "text": "Prioritize mental health (and financial well-being lol). My partner and I are both PhD students and after all these years I think our motivation and energy are irreversibly depleted. Now just empty shells of our former selves hoping to graduate soon.",
          "author": "UnluckyInformation",
          "created": 1627421104,
          "upvotes": 7,
          "replies": {
            "h6s7joz": {
              "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6s7joz/",
              "text": "But I feel like I’m here because I didn’t want to think about what else to do and now idk how to leave because idk what I would do. I’m only a first year though and don’t want to waste my time and energy on this",
              "author": "lilturtle1",
              "created": 1627438995,
              "upvotes": 2,
              "replies": {
                "h6scmom": {
                  "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6scmom/",
                  "text": "Many of us probably ended up in grad school because we didn’t know what else to do after undergrad. And then many post docs I know don’t necessarily want to go into academia but they don’t know what to do after the PhD. If I were a first year again I would master out and find a job in industry.",
                  "author": "UnluckyInformation",
                  "created": 1627441635,
                  "upvotes": 1,
                  "replies": {
                    "h6ut4rn": {
                      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6ut4rn/",
                      "text": "Ugh that sounds so tempting especially because I know you can move up in most industrial positions without a PhD but idk if industry is for me. I love to teach but academia is also toxic af. Considering community college positions but I’m not sure. I wish schools in America pushed finding what you actually enjoy more than just continuing school forever to supposedly make more money down the road",
                      "author": "lilturtle1",
                      "created": 1627494164,
                      "upvotes": 1,
                      "replies": {
                        "h8q1v5t": {
                          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h8q1v5t/",
                          "text": "They don't do that because they (public schools) would rather have more people numbed and dumbed to the point of working in factories and industrial jobs that make the country go 'round than people who are enjoying their lives and chasing their dreams outside of that bleak reality. It just so happens that a lot of the \"smarter\" kids can see past the veil and chase the opportunity for a better, more fulfilling career path. But not without the cost of their mental health ofc, bc if we made achieving dreams and comfortable wages easy then who would work at Amazon?",
                          "author": "ThirdIRoa",
                          "created": 1628814097,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h6qvdrc": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6qvdrc/",
      "text": "If I may ask, what made you hate your lab? Do you think if you either knew about how the qualifying exam would be, or maybe worked in a lab that was better fit, you would have been able to stick it out?",
      "author": "businessbee89",
      "created": 1627416296,
      "upvotes": 2,
      "replies": {
        "h6r0sta": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6r0sta/",
          "text": "It was more so the entire academic setting as a whole. I also just didn’t click well with my advisors, they taught me a lot but when it came to navigating the entire process I struggled a lot. It was definitely a two way street, and it just wasn’t clicking well for any of us honestly",
          "author": "lep187",
          "created": 1627418704,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "h6qrivn": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6qrivn/",
      "text": "I would have dropped out if it weren’t for the fact that I’m in my 6th and final year",
      "author": "cracklin_oats",
      "created": 1627414589,
      "upvotes": 105,
      "replies": {
        "h6qwx4k": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6qwx4k/",
          "text": "Same. Too late for it now.",
          "author": "IMustSayThat",
          "created": 1627416976,
          "upvotes": 33,
          "replies": {
            "h6r0083": {
              "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6r0083/",
              "text": "[deleted]",
              "author": null,
              "created": 1627418347,
              "upvotes": 36,
              "replies": {
                "h6rgtur": {
                  "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6rgtur/",
                  "text": "Saammmee. It's a strugglebus right now.",
                  "author": "campbell363",
                  "created": 1627425900,
                  "upvotes": 14,
                  "replies": {}
                },
                "h6tvwnn": {
                  "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6tvwnn/",
                  "text": "I was on that for a year until I realized sunk-costs is a fallacy.",
                  "author": "tmaddog19",
                  "created": 1627480133,
                  "upvotes": 5,
                  "replies": {
                    "h6ugn9p": {
                      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6ugn9p/",
                      "text": "It’s not always a fallacy. “How much time is left” is definitely a relevant question.",
                      "author": "SomeRandomScientist",
                      "created": 1627489066,
                      "upvotes": 8,
                      "replies": {
                        "h6usa9j": {
                          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6usa9j/",
                          "text": "Economist here and I agree. May not be a fallacy in this case because the benefits of a PhD may exceed one more year of suffering but might not exceed 4 years of suffering in the case of OP.",
                          "author": "maps1122",
                          "created": 1627493817,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "h6sja4y": {
              "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6sja4y/",
              "text": "I was in my fifth year and I used to regularly threaten \"it's never to late to drop out.\" I finished. No regrets, 5+ year friends, you can do it!",
              "author": "danesgod",
              "created": 1627445327,
              "upvotes": 23,
              "replies": {
                "h6togtt": {
                  "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6togtt/",
                  "text": "Just signed up for year five. When do I get my club card?",
                  "author": "nnomadic",
                  "created": 1627476323,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "h6tqslh": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6tqslh/",
          "text": "I'm in the same boat. Except I also just took a job that pays more than the associate profs in my department. So little incentive to finish..yet so little required to finish...",
          "author": "NoFascistAgreements",
          "created": 1627477572,
          "upvotes": 5,
          "replies": {}
        },
        "h6s7bow": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6s7bow/",
          "text": "Yooo I’m a first year and not sure if I want to continue but don’t want to get too deep in that I feel like I can’t leave. But idk what the hell else I’d do. Help??",
          "author": "lilturtle1",
          "created": 1627438886,
          "upvotes": 4,
          "replies": {
            "h6s8cyj": {
              "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6s8cyj/",
              "text": "It’s hard for me to say. Things didn’t start to go down hill for me until after I qualified, advanced etc (3+ years in) you just have to feel for yourself. That’s my best advice.",
              "author": "cracklin_oats",
              "created": 1627439403,
              "upvotes": 10,
              "replies": {
                "h6u2jkr": {
                  "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6u2jkr/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1627483125,
                  "upvotes": 6,
                  "replies": {
                    "h6usdf4": {
                      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6usdf4/",
                      "text": "Are you me",
                      "author": "maps1122",
                      "created": 1627493853,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h6qnz0f": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6qnz0f/",
      "text": "> I had three rounds; phone screen, Zoom interview, and a two-hour in-person research presentation and interview. After my references were contacted, I received an email about a job offer for the Research Associate position at the startup. I have accepted that and will start next month.\n\nJesus. I've worked in government, academia and non-profit and none of them came close to this level of intensity. A two hour presentation and interview? Good lord. Congratulations on the job!",
      "author": "purple_ombudsman",
      "created": 1627413022,
      "upvotes": 47,
      "replies": {
        "h6qovq9": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6qovq9/",
          "text": "Thank you! It was very stressful! They acknowledged it was a lot of interviewing but wanted someone to fit within the 7 person research team (they’re a startup of about 25-30 people right now). It seems like they’re still looking for those core people which might be why they were so intense.",
          "author": "lep187",
          "created": 1627413425,
          "upvotes": 27,
          "replies": {
            "h6qyrbp": {
              "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6qyrbp/",
              "text": "Congratulations on the job mate !",
              "author": "distractedbunnybeau",
              "created": 1627417785,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "h6qsqxn": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6qsqxn/",
          "text": "I was thinking this too!  I hope OP is getting paid well!",
          "author": "Emotional-Apricot289",
          "created": 1627415130,
          "upvotes": 6,
          "replies": {}
        },
        "h6qypk9": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6qypk9/",
          "text": "In my experience start-ups go intense on recruitment process because they are more unsure of what they want or don't want in a candidate compared to seasoned recruitment teams in govt, academia, corporate research divisions. They optimize and streamline their recruitment process as they hire more and more people.\n\nAdditionally, STEM research jobs almost always have 2 rounds of technical interview, which is the case for OP.",
          "author": "distractedbunnybeau",
          "created": 1627417763,
          "upvotes": 7,
          "replies": {
            "h6rhuc8": {
              "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6rhuc8/",
              "text": "First full time job had a phone interview, HR interview, team lead interview.",
              "author": "suckuma",
              "created": 1627426374,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h6qkq6d": {
      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6qkq6d/",
      "text": "[deleted]",
      "author": null,
      "created": 1627411594,
      "upvotes": 57,
      "replies": {
        "h6qon9g": {
          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6qon9g/",
          "text": "I would have had another opportunity but I ended up leaving during the 2 month break between the fail and retry. Even if I passed I most likely would have left just due to bad mental health and absolutely hating it haha \n\nI had a lot of questions about why I left the PhD program but most of them had been in a PhD program and completely understood why I left. It helped that my references were my original PIs and we were all on good terms. It came down to me explaining that I love working in lab, but hated the PhD process and it seemed to work in the end",
          "author": "lep187",
          "created": 1627413320,
          "upvotes": 70,
          "replies": {
            "h6qztj5": {
              "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6qztj5/",
              "text": "[deleted]",
              "author": null,
              "created": 1627418262,
              "upvotes": 14,
              "replies": {
                "h6r0f9y": {
                  "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6r0f9y/",
                  "text": "Sorry if that was confusing, I meant hated being in an academic lab, I love lab work itself but the academic setting was awful for me!",
                  "author": "lep187",
                  "created": 1627418538,
                  "upvotes": 20,
                  "replies": {
                    "h6r9q13": {
                      "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6r9q13/",
                      "text": "Sorry to jump in- and feel free to decline to answer but did you have any mental health issues going into your PhD program or were they all caused by the program? What was awful about the academic lab setting?",
                      "author": "Contagin85",
                      "created": 1627422636,
                      "upvotes": 7,
                      "replies": {
                        "h6rauap": {
                          "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6rauap/",
                          "text": "I had been battling depression a bit before but the anxiety and stronger depression was definitely due to the program. I really didn’t like the culture within the academic setting, it could very easily just be how my PIs ran their labs. But, it felt like I was up against everyone else… there wasn’t much collaboration at all. I’ve found, at least with the company I am about to work for, everyone is essentially working towards a collective goal which makes everyone more willing to help and be collaborative. I also just hated all of the extra seminars and other stuff that comes along with being in academia.",
                          "author": "lep187",
                          "created": 1627423135,
                          "upvotes": 22,
                          "replies": {
                            "h6rjisr": {
                              "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6rjisr/",
                              "text": "gotcha- thanks for the clarification and answer!",
                              "author": "Contagin85",
                              "created": 1627427170,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "h6r0w0l": {
                  "link": "/r/GradSchool/comments/oss0rd/the_aftermath_of_quitting_my_phd/h6r0w0l/",
                  "text": "I’m guessing they were referring to the specific lab(s) they were in during the program.",
                  "author": "hyztori",
                  "created": 1627418743,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634066759
}