{
  "sid": "q5loye",
  "link": "/r/GradSchool/comments/q5loye/working_full_time_and_grad_school/",
  "title:": "Working full time and Grad School",
  "text": "Anybody here went part time to earn their masters while working a full time job? How was the experience ? How many courses did you take a semester ? What would you have done differently ? For those that studied a science, did you have to do a thesis ? Were you able to get your research and thesis done while working ?",
  "author": "interstellar566",
  "created": 1633917269,
  "updated": 1634099748,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.92,
  "comments": {
    "hg6oj5s": {
      "link": "/r/GradSchool/comments/q5loye/working_full_time_and_grad_school/hg6oj5s/",
      "text": "Hi! I currently work full time and am doing a part time MS in Biostatistics.\n\nIt is very challenging to say the least. I am on my second and final year, and am just starting my thesis. I think the biggest reason i was able to handle the coursework was because Covid made me stay at home mostly and not able to work in my lab. My classes are during the working hours, so now being in person is rough.\n\nI would make sure you know when your classes would be, how often, and absolutely ask your bosses to make sure you are able to put aside some time during work hours of you need to. Not sure what youre masters will be in, but definitely do you research and make sure its something you want/need.",
      "author": "Worthy_Mentality",
      "created": 1633921410,
      "upvotes": 3,
      "replies": {
        "hg6olr0": {
          "link": "/r/GradSchool/comments/q5loye/working_full_time_and_grad_school/hg6olr0/",
          "text": "Adding on, i take 2 classes/quarter and full time at my school is 4/quarter.",
          "author": "Worthy_Mentality",
          "created": 1633921448,
          "upvotes": 1,
          "replies": {}
        },
        "hg81d96": {
          "link": "/r/GradSchool/comments/q5loye/working_full_time_and_grad_school/hg81d96/",
          "text": "The masters will be Geology. It’s about a little over half coursework and the rest is thesis work",
          "author": "interstellar566",
          "created": 1633956742,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg6os83": {
      "link": "/r/GradSchool/comments/q5loye/working_full_time_and_grad_school/hg6os83/",
      "text": "I’m in a PhD program and have been working full-time throughout for the last 5 years, I’ve even had part-time teaching jobs and started a nonprofit while maintaining a 4.0 and just celebrated several years of marriage to my partner. I’m about to be in the dissertation stage. That said, I took 2 classes a semester and my field of study has undertones of the principles of adult learning. That means they expect and design it to account for being a working professional. Not all fields, departments, programs, nor professors give a _____. Don’t think it’s been all roses as there have definitely been thorns. Sometimes mental/physical health has been great, other times it’s been really bad. Thankfully I have a partner who is very supportive, a work situation in which we were able to have a define the relationship convo about what it means work wise for me to be in school again, and have found hobbies that fill my bucket on individual and group level experiences. \n\nFeel free to send DMs if you want to talk more.",
      "author": "AggieKnight",
      "created": 1633921545,
      "upvotes": 1,
      "replies": {}
    },
    "hg781di": {
      "link": "/r/GradSchool/comments/q5loye/working_full_time_and_grad_school/hg781di/",
      "text": "I am in Australia so my experiences may vary. I did my Masters over a four year period part time while I worked in front line service with youth and then took a short break for my PhD before going into a data analyst role. I took two out of four courses a semester and then took a leave of absence from work to do my Masters thesis (different system). For writing up my PhD I only took a bit of leave to finish it and it just about broke me. It is very hard, especially if you have other commitments (I have 4 children) but it can also be beneficial in that you make lots of contacts and get good real world experience.",
      "author": "Corrie_W",
      "created": 1633933399,
      "upvotes": 1,
      "replies": {}
    },
    "hg6xdpz": {
      "link": "/r/GradSchool/comments/q5loye/working_full_time_and_grad_school/hg6xdpz/",
      "text": "I was taking two courses at a time until recently. Now I’m taking just 1 and almost finished.",
      "author": "214speaking",
      "created": 1633926232,
      "upvotes": 0,
      "replies": {}
    }
  }
}