{
  "sid": "r7fo47",
  "link": "/r/GradSchool/comments/r7fo47/nonacademic_careers_that_still_involve/",
  "title:": "Non-academic careers that still involve outreach/teaching?",
  "text": "I'm thinking about what I want to do post-grad school (I'm only in my 3rd year of my ~5 year PhD so I have time). I don't really like the idea of working at a university because I'm tired of being on a school campus all the time. I'm not too keen on the beaurocracy in academia, I don’t mind the idea of doing research with students but I don't know if I'm down to be a thesis advisor just yet and not sure how I feel about being paid only through grants or soft money. \n\nThere are jobs in government agencies for the work I do, so that's my primary goal, but through my TAships, I've learned that I really do love teaching. I don't know of many researchers who are also teachers so I am interested in learning about the possibility of this. \n\nWould it be feasible to teach part time at a community college while being a full time researcher? I feel like that's my ideal job but I'm not interested in overworking myself.",
  "author": "Anti-Itch",
  "created": 1638474669,
  "updated": 1638481101,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmz242h": {
      "link": "/r/GradSchool/comments/r7fo47/nonacademic_careers_that_still_involve/hmz242h/",
      "text": "I do research in government and do outreach (I also develop curricular materials, so there are opportunities in education above mentorship) and I know other government researchers who are adjuncts. I'm actually a grad student in a Pathways Internship, so mentoring students while working as a government researcher is very much a thing.",
      "author": "Planetary_Piggy",
      "created": 1638475313,
      "upvotes": 1,
      "replies": {
        "hmz2b5u": {
          "link": "/r/GradSchool/comments/r7fo47/nonacademic_careers_that_still_involve/hmz2b5u/",
          "text": "How do you get into a Pathways Internship (I guess that's for US citizens)?",
          "author": "Anti-Itch",
          "created": 1638475392,
          "upvotes": 1,
          "replies": {
            "hmz362p": {
              "link": "/r/GradSchool/comments/r7fo47/nonacademic_careers_that_still_involve/hmz362p/",
              "text": "I believe this particular internship type is US Citizens only because of how it's structured, but I know of other types of internships with the US Government that are open to non-US Citizens. Most are posted on usajobs.gov, but they can also be found through universities (websites like Handshake) and career fairs.",
              "author": "Planetary_Piggy",
              "created": 1638475731,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmze94l": {
      "link": "/r/GradSchool/comments/r7fo47/nonacademic_careers_that_still_involve/hmze94l/",
      "text": "You can also check out teaching in a carceral setting-- I teach art/creative writing/theater/music/spoken word part-time in my county's juvenile detention center.  A couple classes a week.",
      "author": "Femmeforever",
      "created": 1638479917,
      "upvotes": 1,
      "replies": {}
    }
  }
}