{
  "sid": "qx90d7",
  "link": "/r/GradSchool/comments/qx90d7/social_life/",
  "title:": "Social life",
  "text": "I know grad school is serious academically, but what is it like socially? Like do people socialize/date? And are there “popular” people? Or do people just not bother with all that?",
  "author": "_queen_bee01_",
  "created": 1637299030,
  "updated": 1639877835,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hl8m8of": {
      "link": "/r/GradSchool/comments/qx90d7/social_life/hl8m8of/",
      "text": "Imagine if the whole cohort was just the nerds you normally hang out with.",
      "author": "IkeRoberts",
      "created": 1637317538,
      "upvotes": 2,
      "replies": {
        "hlg3nll": {
          "link": "/r/GradSchool/comments/qx90d7/social_life/hlg3nll/",
          "text": "I always heard this would be the case, but there are almost no nerds in my cohort. :'( I don't know if I just got a strange batch of people or if it's something in the program culture haha.",
          "author": "torgoboi",
          "created": 1637452500,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl8bdhg": {
      "link": "/r/GradSchool/comments/qx90d7/social_life/hl8bdhg/",
      "text": "I can tell you that during my first semester so far, my social life has been pretty much limited to my cohort. I’m lucky that they are mostly nice people, and tolerable enough to hangout with. However, as for making close friends outside of your comfort, well, hopefully someone will let me know that they figured it out",
      "author": "Zam8859",
      "created": 1637308554,
      "upvotes": 1,
      "replies": {}
    },
    "hl8d5ii": {
      "link": "/r/GradSchool/comments/qx90d7/social_life/hl8d5ii/",
      "text": "Well for me my friend and I actually are each other’s cohorts. Graduated together from undergrad and are in the microbiology grad program. Overall, I socialize with my lab and cohorts but I’ve met a few people on campus",
      "author": "suri_arian",
      "created": 1637309908,
      "upvotes": 1,
      "replies": {}
    },
    "hl8gy1k": {
      "link": "/r/GradSchool/comments/qx90d7/social_life/hl8gy1k/",
      "text": "It's fun to talk shop with your graduate colleagues (a rare privilege to find other humans to speak with about your studies, the deeper you get into your field). I have seen other folks in these forums discussing competition and personality conflicts within their graduate programs. However, my grad school experience included zero \"popular\" people and zero dating.\n\nI did my MA in an intimate program in rural Indiana, over several summers in residence, so we really bonded; my experience was atypical, and incredibly religious. We still have a group text going, and it is active every week. Thank God someone was there to wake me up for class every morning.",
      "author": "Astral-Prince",
      "created": 1637313057,
      "upvotes": 1,
      "replies": {}
    },
    "hlba2b3": {
      "link": "/r/GradSchool/comments/qx90d7/social_life/hlba2b3/",
      "text": "It's the same cunts from the rest of the world but they're all intellectuals now",
      "author": "Underbright",
      "created": 1637360235,
      "upvotes": 1,
      "replies": {}
    },
    "hlg6a05": {
      "link": "/r/GradSchool/comments/qx90d7/social_life/hlg6a05/",
      "text": "Part of this will depend on the department culture and just how you luck out that year. The groups are smaller, so you see each other around more, which means more potential to know each other better. At the same time, everyone is busy so it isn't like undergrad where you can spend a ton of time going out. Most folks I know go out sometimes, but spend more time working or at home. \n\n\nPeople-wise, grad students are just people, so you get a whole range.\n\n\nIn my master's program, the cohort above mine is pretty chill and they seem close-knit after surviving COVID together. My cohort has some tension, I think from a combo of personality differences and anxiety over grades. No one is really \"popular\" or \"unpopular\" as much as all of us found 1-2 people we vibe with more and don't reach outside of those groups much.",
      "author": "torgoboi",
      "created": 1637453718,
      "upvotes": 1,
      "replies": {}
    }
  }
}