{
  "sid": "py9wjk",
  "link": "/r/GradSchool/comments/py9wjk/major_procrastination_this_semester_not_feeling/",
  "title:": "Major procrastination this semester. Not feeling motivated at all. Advice?",
  "text": "I feel so burnt out. On average I only had one day off this summer, so I didn't even get a break between semesters (worked my shitty job, took an intense summer class, and worked 2 days a week on research). Have 3 classes this semester and only one interests me. \n\nI don't know what to do. I have stuff due Monday and I haven't even started....my lab I am almost done with, and I have an assignment (luckily a short one) due Friday. \n\nThis isn't like me. I just feel so tired and depressed. Any advice?",
  "author": "An-Anthropologist",
  "created": 1632966984,
  "updated": 1634100340,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hesxg27": {
      "link": "/r/GradSchool/comments/py9wjk/major_procrastination_this_semester_not_feeling/hesxg27/",
      "text": "Phone in the stuff due and then take two days to do whatever you want. Miss some classes and go on a hike, play some videos games, whatever. I'm in the same situation and I just can't make myself do work. I decided to miss class tonight and I'm letting myself procrastinate until the last minute on an assignment due today. I know I can get it done and missing a class won't hurt my progress.",
      "author": "full_on_makeup",
      "created": 1632968744,
      "upvotes": 4,
      "replies": {}
    },
    "hexpewx": {
      "link": "/r/GradSchool/comments/py9wjk/major_procrastination_this_semester_not_feeling/hexpewx/",
      "text": "\nI Totally feel you. Spent last spring semester working ass off, then half summer teaching as a TA(was a lot of work as my instructors gave me lot of work) plus studying for exams, then remaining summer preparing for exams. When the exams ended, I got a few days break, like 4-5 and then again fall semester started. \n\nNow I feel so tired af. I am finally at the point where I have no exams ahead of me and can explore areas of interest. But I have left no motivation at all. \n\nAll I want to do is take 10-15 days long vacation. Go home, etc. and not rot at the same place I've been for the past 9 months. But that's not possible. \n\nSo I'm treating myself with a few breaks now and then. For example, today I missed my classes, took day off(haven't even seen a person the whole day), cooked some good food and binge-watched a few things. \nI'd suggest devoting a few days a month to yourself. It's important to keep yourself mentally well. And while you may not be able to get vacations the way you want, you can still manage to(with some time management) chill and relax now and then. Do whatever you can to stay afloat until you can get a break, my friend. We're all there with you!! :)",
      "author": "notinverse",
      "created": 1633059845,
      "upvotes": 1,
      "replies": {}
    }
  }
}