{
  "sid": "rb9odz",
  "link": "/r/GradSchool/comments/rb9odz/i_need_to_know_i_can_do_it/",
  "title:": "I need to know I can do it!",
  "text": "I'm in the midst of finals week. I'm finishing up one last 15 page paper and project. Luckily, the project is taking form but I still have to write 10ish pages for my proposal. I'm so tired but I cut down my work hours this week so I can write more. Sunday I literally spent almost all day on my computer for 8 hours writing 10 pages of an academic paper that I was so intimidated to start. I had about 30+ pages to write for finals week, and I'm getting there!\n\nPer my letters of accommodation, I got extensions for some of my work this semester and I've managed to get As on pretty much everything. I had to sign up for at least 8 credit hours instead of doing part-time as I wanted to to get my tuition waiver and I had wondered from the start should I get a reduced course load accommodation which I did for next semester. I barely did my 10 credit hours but somehow I did. \n\nGoing to grad school, staying sober, working and having disabilities is really hard. But I have done it   \n somehow and well. I just need some positive vibes and some hype up playlists. Any music is good!",
  "author": "vericuester",
  "created": 1638911630,
  "updated": 1639518621,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hnn1zzm": {
      "link": "/r/GradSchool/comments/rb9odz/i_need_to_know_i_can_do_it/hnn1zzm/",
      "text": "You're killing it! Keep pushing, it will all be worth it in the long run! \n\n[GRiZ](https://youtu.be/tHfQfhi6Lvc) always makes me feel good! Enjoy! \n\nRooting you on from afar!",
      "author": "realgirl_fakename",
      "created": 1638911947,
      "upvotes": 2,
      "replies": {}
    },
    "hnn3hec": {
      "link": "/r/GradSchool/comments/rb9odz/i_need_to_know_i_can_do_it/hnn3hec/",
      "text": "You can do it!\nI had my last one today and MY GOD what a term! Full time work, 3 kids, then my husband started commuting, so he's away 4 days a week, AND we had a freaking water leak just as finals were about to begin, so I have had builders and noise and a demolished kitchen and living area. And 15 kids in my youngest's class have come down with covid the last 3 weeks, so I have just been expecting it (by some miracle, she hasn't caught it yet. They're too young to get vaccinated).\nIn-freakin-sane.\nBut I did it, and if I survived this madness, so can you!\nI don't think I'll keep up my run of good grades. But honestly, I can't believe I battled through all that. \nGo go go! Write write write!",
      "author": "Naivemlyn",
      "created": 1638912556,
      "upvotes": 2,
      "replies": {
        "hnncodd": {
          "link": "/r/GradSchool/comments/rb9odz/i_need_to_know_i_can_do_it/hnncodd/",
          "text": "You are so badass!!! <3",
          "author": "vericuester",
          "created": 1638916497,
          "upvotes": 1,
          "replies": {
            "hnnd24g": {
              "link": "/r/GradSchool/comments/rb9odz/i_need_to_know_i_can_do_it/hnnd24g/",
              "text": "Hahahaha!",
              "author": "Naivemlyn",
              "created": 1638916676,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hnrj9xz": {
      "link": "/r/GradSchool/comments/rb9odz/i_need_to_know_i_can_do_it/hnrj9xz/",
      "text": "Relating to this so hard right now as I finish up my own papers and grading….. you got this!!!!",
      "author": "Gokulantara-Geha",
      "created": 1638996236,
      "upvotes": 2,
      "replies": {}
    },
    "ho5nyoj": {
      "link": "/r/GradSchool/comments/rb9odz/i_need_to_know_i_can_do_it/ho5nyoj/",
      "text": "I did it!!!",
      "author": "vericuester",
      "created": 1639251649,
      "upvotes": 1,
      "replies": {}
    }
  }
}