{
  "sid": "rc6ccp",
  "link": "/r/GradSchool/comments/rc6ccp/failing_all_my_courses/",
  "title:": "Failing all my courses",
  "text": "I’m 20 years old and I relocated entire my life to attend graduate school and I took 12 credit hours this semester. 3 credit hours more than the recommended amount. Anyways, I had a 3.8 GPA when started grad school, now I’m sure that’s going to change.\nAs many of you would know, anything below a 80% is not accredited to graduate school grades. In all four my classes I’ve earned C’s on them. I feel like a complete failure and I just want to give up on grad school in general. How do you y’all cope with not passing a course? Should I retake the courses again? I dont know, I just need advice on this and what should I do next.",
  "author": "wero_024",
  "created": 1639013503,
  "updated": 1639518562,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.83,
  "comments": {
    "hnt8mer": {
      "link": "/r/GradSchool/comments/rc6ccp/failing_all_my_courses/hnt8mer/",
      "text": ">As many of you would know, anything below a 80% is not accredited to graduate school grades.\n\nThis might be the case at your school, but that's not universal.",
      "author": "Quant_Liz_Lemon",
      "created": 1639022722,
      "upvotes": 27,
      "replies": {
        "hnt9jk9": {
          "link": "/r/GradSchool/comments/rc6ccp/failing_all_my_courses/hnt9jk9/",
          "text": "Yeah, this doesn't pass muster for me either.",
          "author": "ThePeregrine_87",
          "created": 1639023198,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hnsq6qs": {
      "link": "/r/GradSchool/comments/rc6ccp/failing_all_my_courses/hnsq6qs/",
      "text": "Would I be correct in assuming you jumped into grad immediately after undergrad?? I think you might be burnt out and need to give yourself a break.",
      "author": "robbynpupperz",
      "created": 1639014240,
      "upvotes": 22,
      "replies": {
        "hnsrcm8": {
          "link": "/r/GradSchool/comments/rc6ccp/failing_all_my_courses/hnsrcm8/",
          "text": "Yeah I jumped from undergrad to grad school. Even in high school, I started taking college courses during every break I could. Hah. I think you’re right.",
          "author": "wero_024",
          "created": 1639014752,
          "upvotes": 12,
          "replies": {
            "hnsruyd": {
              "link": "/r/GradSchool/comments/rc6ccp/failing_all_my_courses/hnsruyd/",
              "text": "If you don't mind me asking, how did you perform in undergrad? decent grades?",
              "author": "robbynpupperz",
              "created": 1639014975,
              "upvotes": 5,
              "replies": {
                "hnsryvn": {
                  "link": "/r/GradSchool/comments/rc6ccp/failing_all_my_courses/hnsryvn/",
                  "text": "They were alright. Mostly A’s and occasional B’s.",
                  "author": "wero_024",
                  "created": 1639015024,
                  "upvotes": 5,
                  "replies": {
                    "hnsskkv": {
                      "link": "/r/GradSchool/comments/rc6ccp/failing_all_my_courses/hnsskkv/",
                      "text": "You're clearly intelligent and possess the intellectual fortitude needed to succeed in grad school. I seriously think this is an issue of burnout. You owe it to yourself to take a break. If anything, consider taking only one or two classes to allow yourself to decompress.",
                      "author": "robbynpupperz",
                      "created": 1639015292,
                      "upvotes": 25,
                      "replies": {
                        "hnv3qqf": {
                          "link": "/r/GradSchool/comments/rc6ccp/failing_all_my_courses/hnv3qqf/",
                          "text": "not only taking a break, but lead a balanced approach to your graduate life. Don't think of it as a race, it's a marathon.  Make sure you have a pace in your research, coursework, and professional and personal development.",
                          "author": "JackKellyAnderson",
                          "created": 1639065084,
                          "upvotes": 6,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hntdt0g": {
      "link": "/r/GradSchool/comments/rc6ccp/failing_all_my_courses/hntdt0g/",
      "text": ">As many of you would know, anything below a 80% is not accredited to graduate school grades.\n\nI may or may not be helpful on this point, but I think that's the important start. Are you absolutely certain of this for your program? \n\nBit of a bizarrely specific case, but I'm completing a dual MS where one program requires that 80% baseline, and one doesn't. \n\nA C in one isn't ideal for GPA minimum requirements, but still counts. A C for the other doesn't count for the program.  \n\nYour first step is to figure that out one way or another for sure. If I were in your situation, I'd start with the registrar's office (I work in university admissions and have to ask them weird questions, they tend to know this stuff), and if you don't get a clear answer or want confirmation, ask them to direct you to your college department and ask there.\n\nA set of Cs isn't ideal GPA-wise, but that should let you know where you stand in terms of program progress.",
      "author": "Crimsonial",
      "created": 1639025459,
      "upvotes": 8,
      "replies": {}
    },
    "hnv3q6q": {
      "link": "/r/GradSchool/comments/rc6ccp/failing_all_my_courses/hnv3q6q/",
      "text": "As I understand it, you didn’t take too much rest from your studies, and it’s not surprising that you had a hard time. If you intend to study further, try to get help from specialists. Among those that I have used is popular grademiners(com)",
      "author": "ElinGerry",
      "created": 1639065078,
      "upvotes": 2,
      "replies": {}
    },
    "hnvage1": {
      "link": "/r/GradSchool/comments/rc6ccp/failing_all_my_courses/hnvage1/",
      "text": "If you need your school probably offers students to take semesters off. Also you can retake courses! It sounds like a case of burnout and I think sometimes we needs breaks between schooling to feel in touch with ourselves again. I did the same thing, mainly jumped from undergrad to grad. It’s a lot especially with a job, but remember to not push past your limits. Your mental health and physical health are really important.",
      "author": "CaughtUpInTheTide",
      "created": 1639067705,
      "upvotes": 2,
      "replies": {}
    }
  }
}