{
  "sid": "rdvni9",
  "link": "/r/GradSchool/comments/rdvni9/teacher_purposely_posts_vague_instructions_and/",
  "title:": "Teacher purposely posts vague instructions and now the final had questions that we never even studied",
  "text": "I need advice.  I'm at an accredited well known school and it's been an absolute shitshow the entire time.  The first class I took has had some of the vaguest instructions in written assignments.  Some of the written assignments still aren't graded despite being submitted months ago.  The few written assignments that were graded were graded by teacher assistants.  It turns out that the TA don't give a shit about the answers.  The answer that I had I got 100%.  The same question was asked on the final and the \"answer hint\" that it gives after the final is complete is so different than what I submitted on both assignments.  I thought I was fine since I was graded good?  \n\n&#x200B;\n\nOne question on the final also required knowledge of hexadecimal.  Um, he never even mentioned hexadecimal let alone how to convert it?  And now it's a big fucking deal in this question?  \n\n&#x200B;\n\nThe teacher gave out a study guide.  The study guide covered everything we learned since the midterm.  I studied everything, rewatched the lecture vids, plus quizzed myself on all of the exams since the midterm.  Not one of the exam questions were in the final, most of the stuff in the study guide wasn't covered, and some questions asked for extremely in-depth answers to  things we only discussed the basics of.  \n\n&#x200B;\n\nOh and I asked multiple people, advisors, even the fucking department chair if programming was involved and made it very clear that I didn't know how to program.  They said there was none to very little programming and that it was \"not required at all\".  A large chunk of the grade is programming.  I've since inquired again and now the answer is \"programming proficiency is expected\".  So they lied to me and let me into a program I probably shouldn't have qualified for based on that.  \n\n&#x200B;\n\nThis is just the tip of the iceberg.  I have more, but it's late.\n\n&#x200B;\n\nWhat do you guys think?",
  "author": "FallingToward_TheSky",
  "created": 1639212535,
  "updated": 1639518518,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "ho4uv1v": {
      "link": "/r/GradSchool/comments/rdvni9/teacher_purposely_posts_vague_instructions_and/ho4uv1v/",
      "text": "I mean, it sounds like they don't care at all about the well-being of their students, if they're so casual about requirements and uninterested in maintaining standards. I expect that getting through that program will be really tough unless you know everything already and can handle more surprise requirements.",
      "author": "pb-pretzels",
      "created": 1639239412,
      "upvotes": 1,
      "replies": {}
    }
  }
}