{
  "sid": "ri443f",
  "link": "/r/GradSchool/comments/ri443f/dilemma_with_potential_supervisor_concerning/",
  "title:": "Dilemma with potential supervisor concerning betrayal (?)",
  "text": "Any help would be highly appreciated :)\n\nSo I am currently undertaking my MSc by thesis with my current supervisor. I have told him that I have applied to do a PhD under his supervision, and he responded with “to get funding you should achieve distinction and it is up to the committee”. The PhD would be in the same area of research as my Masters. This is in the Computer Science Department.\n\nIt turns out that the Engineering Department has a PhD opening for the exact same subject! As in literally the same exact topic, which is not very common itself. Should I contact/apply to this program? Is this betrayal to my current supervisor? I don’t know what the outcome with my current supervisor will be, that’s why I’d like to apply to the one in the other department just in case.\n\nShould I let my current supervisor know? If so how? He is not that responsive (emails back in 2 weeks). \n\nAlso, in the application form I am required to submit my current progress in my thesis. \n\nWhat should I do?",
  "author": "AitBniNsar",
  "created": 1639700026,
  "updated": 1639788500,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "houywuu": {
      "link": "/r/GradSchool/comments/ri443f/dilemma_with_potential_supervisor_concerning/houywuu/",
      "text": "Literally almost everyone everyone applies to multiple groups across departments or universities.\n\nDon't even mention it, it's expected that you do it",
      "author": "Voovoox",
      "created": 1639705458,
      "upvotes": 7,
      "replies": {}
    },
    "hov35mj": {
      "link": "/r/GradSchool/comments/ri443f/dilemma_with_potential_supervisor_concerning/hov35mj/",
      "text": "Applying to relevant grad programs is in no way a betrayal. In fact, his comments make it sound as if applying to more is following his advice.",
      "author": "IkeRoberts",
      "created": 1639707354,
      "upvotes": 3,
      "replies": {}
    },
    "hovajbg": {
      "link": "/r/GradSchool/comments/ri443f/dilemma_with_potential_supervisor_concerning/hovajbg/",
      "text": "He really  can't tell you anything other than that. Because grad admissions are decided by a committee, an individual professor is highly unlikely to be able to guarantee anyone a spot in the program. \n\nPartly because of this, almost everyone applies to multiple programs. If your adviser considers it a \"betrayal\", then he has mental issues that he needs to work through. You need to do what is best for you. You can give him a heads up if you like, but everyone in academia should expect that grad students are applying to multiple programs because it's extremely likely that they did the exact same thing when they applied.",
      "author": "False-Guess",
      "created": 1639710678,
      "upvotes": 1,
      "replies": {}
    }
  }
}