{
  "sid": "qrsn9x",
  "link": "/r/GradSchool/comments/qrsn9x/thesis_proposal_revisions/",
  "title:": "Thesis Proposal revisions",
  "text": "Ok, so I’ve been working on my thesis proposal for almost a year now. I’m hoping to be done with it by the time the semester is over. Unfortunately though, every time I send it to my advisor there are over 20+ things he asks me to fix and it’s making me feel like it’ll never be good enough and I’ll never be able to finish it. Is this normal?",
  "author": "MrUnknown1996",
  "created": 1636658092,
  "updated": 1636745978,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hk8tauh": {
      "link": "/r/GradSchool/comments/qrsn9x/thesis_proposal_revisions/hk8tauh/",
      "text": "Pretty normal. I just got mine approved recently on version 7. After a lot of back and forth I ended up just virtually going through it with my advisor and fixing it all at once, took almost 3 hours but now it is with my committee!",
      "author": "bonefarmer",
      "created": 1636661732,
      "upvotes": 4,
      "replies": {
        "hk8timp": {
          "link": "/r/GradSchool/comments/qrsn9x/thesis_proposal_revisions/hk8timp/",
          "text": "I think I’m going to talk to my professor about doing that. He’s always so busy though.",
          "author": "MrUnknown1996",
          "created": 1636661821,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkakfaw": {
      "link": "/r/GradSchool/comments/qrsn9x/thesis_proposal_revisions/hkakfaw/",
      "text": "Yeah I was bogged down in endless revisions for my masters thesis. When it got to the point where my advisor was revising his own revisions back to how it was before, and then back again, I decided to be assertive in moving it forward.\n\nYou can *always* improve a paper, but there are diminishing returns with every revision. At some point you just have to say \"Okay I'm sending it out now\"",
      "author": "Jwalla83",
      "created": 1636690387,
      "upvotes": 2,
      "replies": {}
    },
    "hk9mt94": {
      "link": "/r/GradSchool/comments/qrsn9x/thesis_proposal_revisions/hk9mt94/",
      "text": "I’m currently going through this with my advisor. I almost had a breakdown the other day because he bombarded me with emails asking if I addressed this or that, when I did but he just didn’t read far enough into the paper. He even made a comment about a section HE TOLD ME to move around lol. It’s normal. I’ve also been wallowing in self doubt and impostor syndrome all semester so you’re definitely not alone in this! It also doesn’t help my committee twiddled their thumbs until the very last minute possible before deadlines so that’s fun too. Keep going! You’ll get through it. If my morbidly anxious ass has made it this far, you can too!",
      "author": "DewfordTownFishNerd",
      "created": 1636674390,
      "upvotes": 1,
      "replies": {
        "hk9n0cw": {
          "link": "/r/GradSchool/comments/qrsn9x/thesis_proposal_revisions/hk9n0cw/",
          "text": "I have had some organizational issues in my proposal too. My advisor has even had me delete entire paragraphs.",
          "author": "MrUnknown1996",
          "created": 1636674515,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}