{
  "sid": "r6so4j",
  "link": "/r/GradSchool/comments/r6so4j/having_really_conflicting_feelings_about_joining/",
  "title:": "Having really conflicting feelings about joining a lab. Should I find a different lab?",
  "text": "I’m in the first year of my PhD I’m Biomedical sciences. I’m currently rotating in a lab that is studying my dream subject. I would have the chance to work on my dream project! \n\nHowever, my rotation experience has revealed some red flags that I’m not sure I should ignore. Two lab members that I have been working with have been non stop telling me terrible things about the lab and the PI. They both mention how they are in lab from the time they wake up till bed time. They talk about how burnt out they are and how unrealistic the PIs expectations are, and how the PI straight up insults them to their face. In addition , They have been to put it lightly, completely unhelpful during my rotation. Every project the PI put me on, they told me it was a waste of time and refused to help me. I ended up having to come up with my own project, and it is going quite poorly as I’m doing it 100% independently. \n\nHowever, after talking to other people in the lab, the other 8 or so people love the PI, love the lab, have a personal life, and seem to genuinely enjoy the lab. When I asked them about the negative things I heard, they seemed surprised as they love the lab.\n\nShould I ignore these red flags as maybe something that is those two lab members personal issue since it seems like the rest of lab is happy. The thought of joining a lab where I would get no help learning lab techniques is terrifying. Having not worked with the positive people in the lab, I have no idea if they will help me if I join the lab or not. In addition, my experience with the PI has been very positive and I really like the PI personally.",
  "author": "UpYour_ButtHole",
  "created": 1638401725,
  "updated": 1638481107,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "hmv71q7": {
      "link": "/r/GradSchool/comments/r6so4j/having_really_conflicting_feelings_about_joining/hmv71q7/",
      "text": "Here are a few of my thoughts in no certain order:\n\n1. Are the two people who dislike the lab newer? Sometimes lab dynamics can change and older lab members aren't affected as much. But it seems like the majority of people are happy which should say something. \n\n2. Not being properly trained is a huge red flag IMO. It's one I ignored and regret immensely. However, this could be resolved by being frank with the PI and explaining you didn't receive as much training as you need (without throwing your potential labmates under the bus), and directly ask how training would work if you joined the lab. \n\n3. Are you not interested in your other rotations? \n\n4. While it's important that you like your research and are intellectually engaged, I would argue it's not *as* important as your relationship with your PI and the support in the lab. Maybe ask something like, \"When I run into troubleshooting issues with an assay, who would I be able to reach out to for assistance?\"\n\nIt's a tough decision, good luck!",
      "author": "BeaverDamns",
      "created": 1638403866,
      "upvotes": 5,
      "replies": {
        "hmv8dfz": {
          "link": "/r/GradSchool/comments/r6so4j/having_really_conflicting_feelings_about_joining/hmv8dfz/",
          "text": "Thanks for responding. \n\n1) one of them is a 4th PhD student the other is a senior post doc. The happy bunch is a mix of newer and senior people.\n\n2) thanks that’s good advice, I was trying to think of way to convey to the PI that I felt unsupported, but am still interested if this is addressed. Wasn’t sure how to say this without throwing people under the bus \n\n3) I did like my other rotations, just less interested in what they are studying \n\nThanks for the advice!",
          "author": "UpYour_ButtHole",
          "created": 1638404449,
          "upvotes": 2,
          "replies": {
            "hmva37r": {
              "link": "/r/GradSchool/comments/r6so4j/having_really_conflicting_feelings_about_joining/hmva37r/",
              "text": "Ah yeah, if it's a mix of new and older lab members then it's tricky. You may just need to talk to more people and trust your gut. It's always a bit of a gamble to be honest. Don't be shy in asking direct questions. As long as you're respectful about it, people will be honest with you.",
              "author": "BeaverDamns",
              "created": 1638405204,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hmvc7o7": {
      "link": "/r/GradSchool/comments/r6so4j/having_really_conflicting_feelings_about_joining/hmvc7o7/",
      "text": "Some PIs play favorites in a major way (or play \"un-favorites\" if you will). I knew people who worked in a lab like that. It was an extremely toxic environment, even for some of the \"favorites\" because they always knew their position was precarious. \n\nOn the other hand, some people have unrealistic expectations of *themselves* and work longer hours than is really necessary, and genuinely feel like they have to do it. I've also seen this happen, and it's not necessarily a sign of a toxic lab or PI. \n\nI think you should do some close observation of the PIs interactions with lab members, and try to have conversations with people who have been there the longest (especially if you can have those conversations physically away from the lab and potential listening ears).\n\nIf it sounds like the first scenario I outlined is what's happening, I would highly highly recommend not joining that lab.",
      "author": "Maximum-Hedgehog",
      "created": 1638406138,
      "upvotes": 4,
      "replies": {}
    },
    "hmvv8uh": {
      "link": "/r/GradSchool/comments/r6so4j/having_really_conflicting_feelings_about_joining/hmvv8uh/",
      "text": "You come to two doors, each with a guard in front, and behind one lies certain ~~burnout~~ death.  One guard tells the truth and one lies, but you don't know which one is which...  \n\nHonestly, I think your best bet is to ask the other people in the lab what's up with the two complainers.  \n\nIt sounds like right now you have two possible situations - \n\n1. Either they are competent graduate students who are actually working as hard as they report, and the PI is bad and landing on them for no reason \n\n2. They are getting landed on because they have a bad attitude and don't do their shit. \n\nIn general I tend to lean towards option 1 - if a PI can't motivate thier students without yelling at them then that is typically a pretty bad sign for them as a manager.  But based on what you've seen, it sounds like option 2 is actually pretty plausible in this situation.  They *weren't* helpful during your rotation, and given how they're shitting on all of your projects, I'm not sure I would trust them as reliable narrators for how your PI does business. \n\nSo asking quietly around about them seems like the best option to suss it out.   Adding in a couple questions about how they were taught lab techniques seems like a good idea too (and might land you some actual training).",
      "author": "Ocelot843",
      "created": 1638414361,
      "upvotes": 3,
      "replies": {}
    }
  }
}