{
  "sid": "rdrdj2",
  "link": "/r/GradSchool/comments/rdrdj2/i_dont_think_ill_be_able_to_finish_my_ma_and_i/",
  "title:": "I don't think I'll be able to finish my MA and I feel heart-broken & incompetent",
  "text": "I'm in my third year of an MA program that was expected to lead into a PhD. But since the start of covid my mental health has tanked and I can't work. I'm on medical leave right now but I can't stay on it forever - especially since not being able to TA means I'm not making money and I'm not insured. It's increasingly looking like I'll be forced to drop out and this makes me feel heart-broken and incompetent. I won't even be \"mastering out,\" I'll be leaving with essentially nothing to show for the past 2+ years of mind-breaking labor. \n\nCue desperate reassurance seeking - is it okay if I don't even get the MA despite working on it for 2+ years? How do I explain this to potential workplaces? Has anyone else been through this? How to cope with the grief?",
  "author": "Various-Grapefruit12",
  "created": 1639196382,
  "updated": 1639518512,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "ho2y5mr": {
      "link": "/r/GradSchool/comments/rdrdj2/i_dont_think_ill_be_able_to_finish_my_ma_and_i/ho2y5mr/",
      "text": "Can you talk to your program director? You’re not incompetent. You’ve worked hard. Investigate what all your options are first.",
      "author": "i_saw_a_tiger",
      "created": 1639196764,
      "upvotes": 4,
      "replies": {}
    },
    "ho31fcn": {
      "link": "/r/GradSchool/comments/rdrdj2/i_dont_think_ill_be_able_to_finish_my_ma_and_i/ho31fcn/",
      "text": "I would definitely investigate all your options before resigning. Take a critical look at what you need to do - if you're only missing a few credits, that's different than completing an entire MA thesis proposal and defense. See if it's possible to finish after you feel like you're in a better place, mentally and physically. That being said...\n\nYou are leaving with the knowledge and experience you gained throughout this process. I'm assuming you took at least a few classes or did some research? That alone is a huge accomplishment and looks great on a resume under \"relevant coursework.\" I would just explain that you decided to go a different way. If pressed by employers in an interview, you can be honest and say you considered X company a better place to apply and expand your skillset, rather than in the classroom.\n\nA great man once told me that not everyone has a dissertation in them. It's not that you failed, just that you found out it's not your path. You need to take care of your health and wellbeing, first and foremost. You'll find the right environment to thrive, it just wasn't this program at this time.",
      "author": "DontFeartheTeacher",
      "created": 1639198468,
      "upvotes": 4,
      "replies": {}
    }
  }
}