{
  "sid": "qtx2qu",
  "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/",
  "title:": "Do you have time for your interests/hobbies outside of grad school?",
  "text": "I’m a first year graduate student in mathematics and reading a lot of these posts has really helped me deal with feelings like the never-ending stress and pressure of grad school. However something that has made me feel very uneasy is the complete lack of time for other things that I enjoy. I love reading books outside of my field, mostly sci-fi and philosophy and I used to like playing video games from time to time but lately it feels impossible to justify these activities. I already have to force myself to set aside time for exercise but there’s always something for me to work on whether it’s research or classes. Sometimes I feel so stressed that I just waste an hour or two on my phone and it becomes hard for me to shift to work. I’m already seeing a therapist for these kinds of things (might get tested for ADHD) but I was wondering how y’all deal with these feelings and if you have any advice for how to manage your other interests or if I should really just start accepting that I have to let go of them if I want to be successful.",
  "author": "UnderstandingOk4516",
  "created": 1636917391,
  "updated": 1637182708,
  "over_18": false,
  "upvotes": 48,
  "upvote_ratio": 0.96,
  "comments": {
    "hkml3yf": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkml3yf/",
      "text": "Yeah, I’ve learned to make time for them. I try to get all my shit done during the day, so I go home at night, not think about grad school at all for 6-7 hours and do whatever the fuck I want. What stops me from doing all the hobbies I enjoy is space and money.",
      "author": "DikkDowg",
      "created": 1636919327,
      "upvotes": 48,
      "replies": {}
    },
    "hkmpgoj": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkmpgoj/",
      "text": "I think grad school is tough and does require time but I've found that I need to get out of lab and do my own thing. Try to get in early, leave by 6, and pursue my interests after that. First two years spent too much time trying to be the best and ended up thinking about killing myself way too often. \n\nI think you should expect to put in more than 40 hours, push yourself, and be pretty busy, but also gtf out of there and enjoy life.",
      "author": "i_like_it_all",
      "created": 1636920962,
      "upvotes": 26,
      "replies": {
        "hkmtn7y": {
          "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkmtn7y/",
          "text": "I like the idea of coming in early and leaving at 6, I’ll try to adapt some sort of schedule.\nYeah our classes are graded based on competition so it’s easy to get a B but trying to get As requires you to be at the top. This is mainly due to the difficulty of the content forcing a curve based on class performance. It’s so stressful because I know the content well enough to use it but I’m sure some of my classmates are much more tryhards than I am. Can’t wait until after prelims when I can primarily focus on research.",
          "author": "UnderstandingOk4516",
          "created": 1636922562,
          "upvotes": 6,
          "replies": {
            "hkncvkw": {
              "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkncvkw/",
              "text": "How important are your classes to your success in grad school? Are you in a PhD program where you are already set and just need to keep up a certain gpa and pass your qualification exams?",
              "author": "i_like_it_all",
              "created": 1636930253,
              "upvotes": 1,
              "replies": {
                "hknd7a8": {
                  "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hknd7a8/",
                  "text": "For this semester it’s really important I achieve good grades because it is related to my funding situation. Afterwards (hopefully) though it’ll be just about maintaining a certain gpa.",
                  "author": "UnderstandingOk4516",
                  "created": 1636930390,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hkn30km": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkn30km/",
      "text": "I do if I’m disciplined. It’s a simple formula for me: I write stuff down in my to do list notebook and I cross them off as I go. If it’s a great day I have time to learn code/guitar, workout, stretch, video game it up, etc. Conversely, if I don’t stick to this method I am an absolute disaster.",
      "author": "ForeverRising-",
      "created": 1636926203,
      "upvotes": 11,
      "replies": {
        "hkn6rjj": {
          "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkn6rjj/",
          "text": "How specific are you with your to do lists out of curiosity? I try making one but I feel like I am often too ambiguous or too ambitious. Example: read x notes, work on hw y, code z.",
          "author": "UnderstandingOk4516",
          "created": 1636927702,
          "upvotes": 2,
          "replies": {
            "hkn901f": {
              "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkn901f/",
              "text": "Depends on what I have to do that day. I primarily break a page down into 4 areas: Trivial, Tasks, Meetings and an hourly breakdown of the day. Tasks is reserved for major things (e.g., R - work up discharge panels for catchments), trivial is for cleaning, working out, get groceries, email x, etc. This video is basically what I do: https://youtu.be/aSskW5xiLiQ\n\nSo specific for main goals/tasks and vague for trivial items (I know what workout I’m doing, etc.)",
              "author": "ForeverRising-",
              "created": 1636928629,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hknd6n5": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hknd6n5/",
      "text": "Just finished graduate school, and for the most part, I had time for hobbies! I also consider myself fairly successful (three first-authors, job offer in industry, finished in five years), so I don't think hobbies/success are mutually exclusive. I rock-climbed and swing-danced during my PhD, and also played a lot of board games with fellow grad students. I think it's good to set a schedule, as others have said already. It also helps to reframe your hobbies as high priority and try to see them as important for your overall happiness/well-being rather than being non-research/a waste of time. Definitely easier said than done, but it's great that you're asking around to see what other grad students have done. Good luck!",
      "author": "versenwald3",
      "created": 1636930382,
      "upvotes": 7,
      "replies": {
        "hkndbma": {
          "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkndbma/",
          "text": "Glad to see another rock climbing grad student!",
          "author": "UnderstandingOk4516",
          "created": 1636930441,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hkmkcr0": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkmkcr0/",
      "text": "Good question! Depends on so many things. Are you already studying your hobbies? So, you already following them a little bit. But, I know there is so much more. I am as well struggling having time for my hobbies. I found my rythm with the mindset that I do every day a small bit, and in the long run I will improve in them. If you would have a full day off, how many hours would you spend on your hobbies and how many hours on the phone? I would spend almost the whole day wasting (without pressure). So, I follow my biggest hobby every morning for one hour. I get up one hour earlier.\n\nBut I can only speak for myself. It is not easy and stressful, and sometimes unpleasant. But I hope that I will have more time for them after graduation/job time.\n\nSorry, this is perhaps completely unrelated to your written problem. But maybe a different point if view helps.",
      "author": "u_reach_ur_goals",
      "created": 1636919042,
      "upvotes": 4,
      "replies": {
        "hkmlga0": {
          "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkmlga0/",
          "text": "Oh it’s very relevant for I want to hear how others such as yourself deal with this! \nI’ve integrated my sci-fi reading into my commute (listening to audiobooks) but for philosophy is difficult because I really have to focus and sometimes it feels like exerting that amount of energy could be better used on my research. Earlier in the semester I definitely wasted my days off doing nothing but now that I have an actual topic then my mind always has a lingering pressure to work. \nI like your idea about doing an hour or so in the morning, maybe I’ll try reading some passages when I first wake up.",
          "author": "UnderstandingOk4516",
          "created": 1636919462,
          "upvotes": 1,
          "replies": {
            "hkmq91d": {
              "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkmq91d/",
              "text": "Yeah, good ideas. I listen to audiobooks or podcasts during commute as well. I dont know about your philisophy but we do not need to put all our energy in research I guess. \n\nYou can try it, but I can tell you the hour in the morning is not easy. Especially getting up this early, but when 5 minutes passed I never regretted it. I think one key element is not forcing it too much, do yourself something good if possible! I know easier said than done.",
              "author": "u_reach_ur_goals",
              "created": 1636921250,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hko75tc": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hko75tc/",
      "text": "I work full-time in my grad program and try to get my work done as quickly as possible in the evenings. Every other night I play animal crossing or Smash with my bf on voice or video and I work out on my lunch breaks at work. This isn't flawless, I get behind on things from time to time, but if you're a good student and have healthy relationships with decent professors, deadlines can be flexible if you ever miss an assignment. \n\nAt the end of the day, my program is over in 180 days and then I'll never worry about this again.\n\nGet in, study some stuff, get your degree, get out.",
      "author": "yungScooter30",
      "created": 1636943929,
      "upvotes": 3,
      "replies": {}
    },
    "hkn4sir": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkn4sir/",
      "text": "In my experience it is normal to not have time for your pre-grad school hobbies until you hit comps. It freaked me out too because I always sought a work-life balance as self care. So, when I started to struggle during my first year of grad school, I went to the chair of my Dept and she gave me advice I’ll never forget: “now is not the time for balance. You’ll only be here a couple of years, and while you should be careful of minding your limits, getting the most out of this time is what should guide you.” It floored me at the time (because work life balance!!!), but she was right. I went all in after that conversation, and cost/benefit, it’s been worth it to me.\n\nYour self care routines will look a little different until you graduate, and this might include finding new, different hobbies that fit better with the demands of grad school. Keep in mind the switch is temporary, and that you absolutely can and should take breaks to do what you love sometimes. However, there are some things I loved to do that I’ve had to let go… it’s been like 8 years since I could enjoy fiction, rode a horse, kayaked, hell I even get haircuts less often. But it won’t always be like this- the sci-fi will still be there when we’re done ❤️",
      "author": "NarciSZA",
      "created": 1636926900,
      "upvotes": 5,
      "replies": {
        "hkn7gya": {
          "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkn7gya/",
          "text": "Love this response! Thank you kind stranger, hope everything is well with you!",
          "author": "UnderstandingOk4516",
          "created": 1636927992,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hknblsq": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hknblsq/",
      "text": "It comes and goes depending on the time of year, deadlines etc. Overall yes though",
      "author": "maroonhaze",
      "created": 1636929716,
      "upvotes": 2,
      "replies": {}
    },
    "hknp0es": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hknp0es/",
      "text": "I do ballroom dancing as my hobby, and have been making the time to go to practice space and competitions. I have a lot of friends in the club who have gone through grad school who tell me that having something to do other than research/studying is the only thing that got them through their programs. Even though I feel guilty about it sometimes, making time for yourself and doing what you love is really important to not completely burn out.",
      "author": "phosphorescentdragon",
      "created": 1636935564,
      "upvotes": 2,
      "replies": {}
    },
    "hko5hix": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hko5hix/",
      "text": "No",
      "author": "dubs_ee_2846",
      "created": 1636943157,
      "upvotes": 1,
      "replies": {}
    },
    "hkn0vwn": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkn0vwn/",
      "text": "…it’s a good thing reading is my hobby",
      "author": "b3tchn",
      "created": 1636925387,
      "upvotes": 1,
      "replies": {}
    },
    "hkn5hum": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkn5hum/",
      "text": "I didn't until I stopped doing my schoolwork, but now it's catching up to me",
      "author": "LiveNDiiirect",
      "created": 1636927185,
      "upvotes": 1,
      "replies": {}
    },
    "hkof05q": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkof05q/",
      "text": "Yes, I have several hobbies. I am not productive if I do math 12 hours straight a day. It’s difficult in the first year, but by your second semester or year (in my program we take quals after our first semester), you start to have free time. Especially when you stop taking classes and start doing research, you’re not going to be productive all the time and that’s okay! Take time for you and the math will still be there when you return :)",
      "author": "tired_gradstudent_7",
      "created": 1636947668,
      "upvotes": 1,
      "replies": {}
    },
    "hkp9hv7": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkp9hv7/",
      "text": "Not really. I work and school and have 2 small kids",
      "author": null,
      "created": 1636968095,
      "upvotes": 1,
      "replies": {}
    },
    "hkphydl": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkphydl/",
      "text": "To begin with, I felt like I didn’t. I was working constantly.\n\nThen, when I purposefully *made* time for my interests, I actually still managed to get the same amount of work done but just was happier and more productive.\n\nI read novels, am a rugby referee, keen road cyclist and play volleyball. I absolutely have to be organised with my time to make everything work, but it’s totally worth it for me.",
      "author": "ayeayefitlike",
      "created": 1636975282,
      "upvotes": 1,
      "replies": {}
    },
    "hkq4ywr": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkq4ywr/",
      "text": "Yes and no. My hobbies have shifted since joining graduate school. I used to flip antique furniture as a hobby and do a variety of crafts. Now, I have neither the time or space to do either of these things… (or the extra energy, tbh). \n\nBut I do play video games or read most nights as a way to wind down. So, yes, I can typically make time for hobbies, but they’ve just kind of changed to better suit my lifestyle and needs.",
      "author": "BiologyPhDHopeful",
      "created": 1636988380,
      "upvotes": 1,
      "replies": {}
    },
    "hkq5xy0": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkq5xy0/",
      "text": "I was thinking about something similar. I used to love reading fictions so much. Now, I just can’t find it in myself to read the books I’ve been wanting to read. My research desk is stacked with textbooks that are yet to be read. I have three more textbooks to go through and two more being shipped to me.\n\nIt’s been tough. I don’t think i’ll get to reading the fiction books not until i’m done with phd but the one comforting thought I have is I have had a good 20+ years reading fiction books. Spending a few years to read academic books is fine for me, for now 😅\n\nMy other interest is traveling. I travel once every 3 or 4 months. During that time it’s 90% vacation, 10% answering emails. I don’t get much breaks but when I do, I spend it well. Sorry i don’t have much of an answer for you but know you are not alone in this struggle.",
      "author": "givemeyourdonut",
      "created": 1636988819,
      "upvotes": 1,
      "replies": {}
    },
    "hkq9fk6": {
      "link": "/r/GradSchool/comments/qtx2qu/do_you_have_time_for_your_interestshobbies/hkq9fk6/",
      "text": "wake up at 6, start studying/experimenting/reading at 7.15, wrap up your work and courses by 6-7, have fun and rest until 9, study a bit more until 10.30, sleep.\n\nmaybe it's my work schedule, but i've managed to stick to this daily cycle; i wake up refreshed and can focus on what i'm doing without mental distractions.",
      "author": "HLA-AIRE-VIT1",
      "created": 1636990346,
      "upvotes": 1,
      "replies": {}
    }
  }
}