{
  "sid": "rh8iq2",
  "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/",
  "title:": "Silly that I have to ask this, but is there any shame in working retail while doing a PhD?",
  "text": "I'm still in the first year of my program and have thought about picking up a part time job to help supplement my income. I'm able to get by OK with my stipend, but I'd like to be a little more comfortable. I've applied to jobs tutoring part time (online and in-person), but I've also looked into potentially working retail/restaurant (strictly) on the weekends. I've got years of experience in both from my undergrad years, and with how badly places are needing people, I figure, why not? \n\nI think I'm just hesitant because it seems like every other PhD student around me/I've known either had a SO who helped pay for rent/food/etc, or had a family that was helping them, or simply didn't need to worry about money. I'm none of those things\n\nHas anyone here worked retail during their program? How'd it go?",
  "author": "nightrecords4",
  "created": 1639600101,
  "updated": 1639788520,
  "over_18": false,
  "upvotes": 18,
  "upvote_ratio": 1.0,
  "comments": {
    "hoox51b": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hoox51b/",
      "text": "I don’t see any shame in it at all, however I would advise you to look through the contract you signed upon joining your program, or ask and advisor, as I know there are some programs that require you not work outside of your PhD. While if you don’t advertise it I don’t know how they would ever find out, in the case that it isn’t allowed and they somehow find out there could be repercussions",
      "author": "wondererererer",
      "created": 1639601286,
      "upvotes": 22,
      "replies": {
        "hooyvpq": {
          "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hooyvpq/",
          "text": "We're allowed to work",
          "author": "nightrecords4",
          "created": 1639601967,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hopc4wk": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hopc4wk/",
      "text": "Why would it be shameful to pay your own way...?! How is that anything but commendable?",
      "author": "ProprioCode",
      "created": 1639607166,
      "upvotes": 9,
      "replies": {}
    },
    "hoq77ys": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hoq77ys/",
      "text": "“If they hate then let ‘em hate and watch the money pile up” -50 Cent\n\nTongue in cheek but for real!",
      "author": "Glittering_Swim_2959",
      "created": 1639620883,
      "upvotes": 9,
      "replies": {
        "hoqap7q": {
          "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hoqap7q/",
          "text": "*NOW THROW YOUR HANDS UP IN THE SKY*\n\n*IMMA BE ON THIS TV MAMA*",
          "author": "nightrecords4",
          "created": 1639622403,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hoq17g5": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hoq17g5/",
      "text": "I’m getting my master’s and I’ve worked landscaping, fine gardening, DoorDash, and part-time farming while in school. \n\nSome people will get weird about “unskilled” work (no work is unskilled work), but I use it as a litmus test. If someone acts like it’s shameful, or embarrassing on my part, I lose respect for them. And if they don’t understand the need to work a part-time job for livelihood, that honestly reflects worse on them. \n\nThe landscaping was tangentially related to my field, albeit not something that a masters student would usually be doing, and I used to justify it by saying “oh, it’s covid, it’s outdoors work. I’m happy to have a safe job.” People usually understood that, especially because I worked full time over the summer. \n\nNow I don’t care. Ah. you’re uncomfortable with the fact that I moonlight as a farmhand outside the city? Don’t care, I get free tomatoes and an income. And it’s nice to do something where I’m not using higher thinking. \n\nThere is shame in turning your nose up at taking retail/service/labor jobs, and there is absolutely no shame in working them.",
      "author": "OldSweatyBulbasar",
      "created": 1639618201,
      "upvotes": 7,
      "replies": {}
    },
    "horbhn2": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/horbhn2/",
      "text": "Do whatever puts bread on your table. Grad student stipend is not enough. I can't get a job for \"reasons\" and I have to fix my car myself so it would be cheaper and I wouldn't go over budget for the month.\n\nWhoever judges you for working retail can plug it. You owe it to yourself to live a comfortable life.",
      "author": "alik00ch00l00",
      "created": 1639643698,
      "upvotes": 4,
      "replies": {}
    },
    "hoqg08p": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hoqg08p/",
      "text": "I bartended during my masters. And it was actually a good complement to be up on my feet moving around where I was having a lot of contact with people. \n\nIn contrast to the hours and hours of sitting in class and spending my time reading, studying and writing. So it actually felt like a break.",
      "author": "raistlin65",
      "created": 1639624775,
      "upvotes": 3,
      "replies": {}
    },
    "hopg8le": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hopg8le/",
      "text": "Not having people to help you like you described isn't shameful. It isn't talked about as often (depending on what you're getting your higher ed in) but it's very much a privilege to have family and loved ones who can support you, and very difficult to make your own way.  \n\n\n\n\nMy biggest warning for you working in retail/restaurant as someone who did the same for a time during her education (11 years retail) is that it is *emotionally* taxing, and to know when to bail versus feel obligated to stay.  A lot of those jobs depend on people who can't walk if they are pushed to their limits and will continue to ask more of you, in ways that are very sympathetic-sounding. Everyone is overworked, underpaid, trying to survive. So make sure you have firm boundaries and a willingness to walk if you are treated unfairly or unkindly, or even asked to do more than you said you were able to commit to. To be willing to be \"mean\" if it means that you get home on time and give yourself time to relax. Do not fall for the \"well they seem nice and they only want help once\" because you'll likely have turnover and people will be desperate for the one worker who isn't already burnt out to pick up the slack from those who already left/are leaving. \n\n\n\n   On top of that, keep an eye on what tasks fall to the wayside when it's crunchtime; my grocery had multiple outbreaks during covid-19 because they would scold people for trying to refill cleaning supplies, for wearing masks, for staying home if they caught a fever, and it was only when it became unavoidable did they start following conduct standards around covid-19 for safety.  I could afford to stop working for awhile so I did, but retail knew that I was friendly and cared about doing a good job so they often tried to compel me emotionally (\"It'd be *so helpful* of you, and everyone is *so stressed* \"). Don't let them do that to you.",
      "author": "italkwhenimnervous",
      "created": 1639608863,
      "upvotes": 2,
      "replies": {
        "hopheah": {
          "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hopheah/",
          "text": "I worked at GameStop for well over seven years, in addition to various food jobs. I know exactly what I'd be getting into and how to handle it. I've never had a problem walking away from a bad job either (ask my parents how many times I've quit a place over shit management and treatment)",
          "author": "nightrecords4",
          "created": 1639609352,
          "upvotes": 2,
          "replies": {
            "hopjzlc": {
              "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hopjzlc/",
              "text": "That's awesome to hear, and you're in a better position than some of my cohorts who tried to do the same but without those experiences! Sorry if I sounded overly cautious, the additional pressure in working through covid-19 in grocery was really eye opening for me in terms of the increase of aggression from both managers and customers. I knew how people were usually but it was strange to see the shifts happening real time, and sometimes it meant when I went home afterwards I felt a lot crankier. If you've already navigated leaving jobs and handling poor management/bad treatment you're ahead of the game vs a lot of other new hires right now, and like you said there is a great market for being choosy vs having to take whatever offers you get.  The only reservation I had working while being in school outside of that sort of stress was the risk of exposure, since my program had specific stipulations if I became exposed and my job became qualified as essential.  All that meant was that I had to ping the student health center and they reduced some of my attendance requirements/had to do the whole zoom class thing if it happened though, as well as an infield hour reduction (like they dropped 50 hours from my total requirement for program completion).",
              "author": "italkwhenimnervous",
              "created": 1639610463,
              "upvotes": 1,
              "replies": {
                "hopmucb": {
                  "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hopmucb/",
                  "text": "To me, retail is \"easy\" in the sense that I can just switch my brain off and do it on auto pilot\n\nThat said, retail is still my last resort. I've been applying to online work, so hopefully something pans out there",
                  "author": "nightrecords4",
                  "created": 1639611703,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hopsxt6": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hopsxt6/",
      "text": "I don't see any shame in it. I would think that you could probably find a better part time but still there's not shame.",
      "author": "KGC444CGK",
      "created": 1639614429,
      "upvotes": 3,
      "replies": {}
    },
    "hoouu46": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hoouu46/",
      "text": "Hello yes my partner and I both work while completing PhDs. Stipends is just not enough for either of us, we work so we have a life outside of the university, essentially. \n\n&#x200B;\n\nIf someone judges you for working so you have money to do things, you can just ignore their existence, in my opinion. My friend has a stipend and his partner pays his way working full time - I am sure life would be good if that were my reality, but it is not, and I have to work. There is no shame in that, at all.",
      "author": "PsychPhDBrah",
      "created": 1639600390,
      "upvotes": 1,
      "replies": {}
    },
    "hope8xw": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hope8xw/",
      "text": "No shame at all. With how desperate these stores are for people you can probably get at least $15 an hour which is nothing to laugh at. If you can handle it there’s no reason not to.",
      "author": "brightlight12234",
      "created": 1639608040,
      "upvotes": 1,
      "replies": {}
    },
    "hoplbth": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hoplbth/",
      "text": "No. Cost of living is high right now, you gotta do what you gotta do.",
      "author": "ElectricalIons",
      "created": 1639611046,
      "upvotes": 1,
      "replies": {}
    },
    "hoq8a8d": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hoq8a8d/",
      "text": "As others mentioned, there may be a clause about outside employment.  If not, there is no shame in working retail or any other job ever. People who judge are not worth the time or energy to tell them off. Definitely look for all types of work that could be possible if you are allowed to pick up extra.  Tutoring undergrads in your specialty might make you more money in less hours. For general budgeting/cost cutting check out  r/frugal and r/eatcheapandhealthy .",
      "author": "calmhike",
      "created": 1639621344,
      "upvotes": 1,
      "replies": {}
    },
    "hoqob7u": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hoqob7u/",
      "text": "I’m currently working at a farmer’s market on Saturdays. The real drawback is that I miss out on a lot of social opportunities with my cohort, but I’m also one of the few students who doesn’t have a partner supporting them (like you). The upside is that I don’t have to worry about money, could buy my family and friends Christmas gifts, etc. As long as the job doesn’t interfere with your degree progress, it might be worth it. \n\nRe: shame, not really. I told my advisor that I have a second job and it has really brought to his attention that I need to be paid better. Not that he can do anything really, but he’s been supportive.",
      "author": "slugs4ever",
      "created": 1639628746,
      "upvotes": 1,
      "replies": {}
    },
    "hos0urh": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hos0urh/",
      "text": "I have a friend who does it. No shame in it.",
      "author": "MrUnknown1996",
      "created": 1639661638,
      "upvotes": 1,
      "replies": {}
    },
    "hot7v7c": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/hot7v7c/",
      "text": "No. \n\nMy roommate worked as a bouncer while finishing his PhD (he also had a RA-ship and multiple fellowships throughout his career.  It was just an extra side-hustle). \n\nHe's now a faculty member of our department. \n\nI think it's also a fun story you can tell someone later.  There's multiple avenues you can take.",
      "author": "HalfEatenPie",
      "created": 1639679317,
      "upvotes": 1,
      "replies": {}
    },
    "howlmfh": {
      "link": "/r/GradSchool/comments/rh8iq2/silly_that_i_have_to_ask_this_but_is_there_any/howlmfh/",
      "text": "If the part time work is taking time and attention that you would otherwise be putting into your research, you may be prolonging your financial situation. Make sure that you are moving as fast as you can on your PhD first.",
      "author": "IkeRoberts",
      "created": 1639740237,
      "upvotes": 1,
      "replies": {}
    }
  }
}