{
  "sid": "qwdcqt",
  "link": "/r/GradSchool/comments/qwdcqt/help_can_my_pi_find_out_that_i_did_not_apply_to/",
  "title:": "HELP: Can my PI find out that I did not apply to her institution?",
  "text": "Hi! I am applying for PhD admissions in BMS this year, and a previous PI has repeatedly pushed me to apply to her instution. She wants me to do my thesis in her lab, although I really don't have any interest in doing this  (for personal and professional reasons). I already have a long list of schools that I'm really excited about, so I don't want to spend the extra time applying to this institution to make her happy. As this PI is not writing one of my recommendation letters (I already have three from more recent employers/PIs), she would not be able to see which schools I'm applying to. She really doesn't take well to people telling her \"no,\" and she is also very well-connected at her and other institutions, so I would like to avoid angering her by pretending that I applied but did not get in. However, because she is so well-connected, I am worried about her asking the graduate admissions committee about me and finding out that I never submitted an application. This would be bad. Can you tell that I'm a little scared of her?\n\nSO....I'm wondering if anyone can tell me how confidential the grad admissions process is. Are admissions committees able to disclose information about their applicants, including who did and did not apply? Any insights would be greatly appreciated.",
  "author": "iisovelle",
  "created": 1637196052,
  "updated": 1637354748,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hl28pto": {
      "link": "/r/GradSchool/comments/qwdcqt/help_can_my_pi_find_out_that_i_did_not_apply_to/hl28pto/",
      "text": "In my experience, they're not confidential at all. My department would split up all of the applications (usually between the 3 faculty of the graduate program committee and the two department chairs) and go through them to identify the \"short list\" of students who match expertise and interest to faculty, and who faculty have expressed interest in working with. There's no anonymity at the department level on who is applying at my Uni, and I wouldn't expect it to be much different elsewhere. \n\nI suggest not bringing it up and avoiding crossing her path as much as possible. Ghost her if you have to because she sounds really toxic and not someone you'd want to work with, even if you were interested in doing research she does!",
      "author": "Planetary_Piggy",
      "created": 1637197530,
      "upvotes": 11,
      "replies": {
        "hl3bg79": {
          "link": "/r/GradSchool/comments/qwdcqt/help_can_my_pi_find_out_that_i_did_not_apply_to/hl3bg79/",
          "text": "Yeah from what I can tell the application process is pretty open with faculty, but it could vary by institution.",
          "author": "TheColt45",
          "created": 1637217417,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hl2jv87": {
      "link": "/r/GradSchool/comments/qwdcqt/help_can_my_pi_find_out_that_i_did_not_apply_to/hl2jv87/",
      "text": ">However, because she is so well-connected, I am worried about her asking the graduate admissions committee about me and finding out that I never submitted an application. This would be bad.\n\nWhy? What do you think's going to happen?",
      "author": "raistlin65",
      "created": 1637202546,
      "upvotes": 2,
      "replies": {}
    },
    "hl6huvg": {
      "link": "/r/GradSchool/comments/qwdcqt/help_can_my_pi_find_out_that_i_did_not_apply_to/hl6huvg/",
      "text": "If she’s that adamant about you applying, I won’t be shocked to hear her ask adcomms why your application was rejected. It’s better to be honest and tell her you’re not applying or just casually apply and maybe reuse material from another application… I would definitely sway away from lying about applying.",
      "author": "m27vzkali",
      "created": 1637275078,
      "upvotes": 1,
      "replies": {}
    }
  }
}