{
  "sid": "ph6zht",
  "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/",
  "title:": "Has anyone quit over Covid concerns?",
  "text": "With variants running rampant in my state, and new data about one of my conditions being more of a risk factor than we thought, I am really worried about working in person. I asked my PI if we could work to accommodate that and was pretty much told \"no, you need to be in lab and interact with everyone\" when I am worried about becoming further disabled or getting severely sick. I'm reaching out to people who might be able to help me, but I'm willing to quit over the lack of care for my health and safety. \n\n&#x200B;\n\nHas anyone else made it to this point because of Covid? Have any of y'all actually quit grad school over it?",
  "author": "voidofneurons",
  "created": 1630681549,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.57,
  "comments": {
    "hbl3jos": {
      "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/hbl3jos/",
      "text": "If you’re vaccinated get your head out from between your legs and start being productive and stop using any little thing as an excuse to not get work done.",
      "author": "Festiveee",
      "created": 1630773801,
      "upvotes": -1,
      "replies": {}
    },
    "hbhsdm0": {
      "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/hbhsdm0/",
      "text": "Related (but somewhat lower stakes) question - how is everyone handling planning for academic conferences that are starting to be held in person? Unlike OP, I’m lucky that the situation at my institution/in my research group is pretty Covid safe at the moment. But, I just had a professor suggest I apply to attend an in-person conference that seems less safe (in the South, for starters..) Is it ok to say I don’t feel comfortable traveling yet?",
      "author": "District98",
      "created": 1630703283,
      "upvotes": 4,
      "replies": {
        "hbm16rj": {
          "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/hbm16rj/",
          "text": "Depends if you value your future and networking less than a minor sickness if you’re vaccinated.",
          "author": "Festiveee",
          "created": 1630788926,
          "upvotes": -1,
          "replies": {}
        }
      }
    },
    "hbhcoqt": {
      "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/hbhcoqt/",
      "text": "I had the great pleasure of graduating with my masters in March of 2020, in another country, with my visa expiring 3 months later. Even if it were feasible to renew my visa and continue on to my doctorate, family concerns forced me back to the States anyway. The way I see it, I can resume grad school any time I want, best to wait until this god-forsaken pandemic has come to an end. \nYour concerns are legitimate and don't let anyone try to convince you otherwise.",
      "author": "mister_peeberz",
      "created": 1630696300,
      "upvotes": 9,
      "replies": {
        "hbhl15q": {
          "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/hbhl15q/",
          "text": "Kermit checks out",
          "author": "MacExtract",
          "created": 1630700003,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hbgzhm8": {
      "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/hbgzhm8/",
      "text": "I have two people in my cohort take a leave over concerns. We are required to have in-person courses and our TA assignments are in person. Although there is mask and vaccination requirements in place, the people that took leave live with people who are considered high risk. Their advisors were supportive of the student’s decisions.",
      "author": "LurkingPorcupine",
      "created": 1630690601,
      "upvotes": 3,
      "replies": {}
    },
    "hbggsnk": {
      "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/hbggsnk/",
      "text": "I have a friend that deferred starting last year due to COVID concerns. Thankfully our institution is taking things quite seriously: vaccination is required, strict mask mandate, and class sizes are being kept very small.",
      "author": "ThrowawayHistory20",
      "created": 1630682857,
      "upvotes": 2,
      "replies": {}
    },
    "hbgg9xi": {
      "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/hbgg9xi/",
      "text": "Does your university have any mask mandates? To be honest, I was extremely afraid when the delta variant started running rampant but everyone in my lab diligently wears a mask, is vaccinated, takes the pandemic seriously and everyone respects social distancing as much as possible. I also reached out to my graduate advisor (I'm a 2nd year) who genuinely listened to my fears and allowed me to take only research hours this semester instead of classes so I have been considerably less anxious. I also now solely wear KN95's indoors from a refutable source.\n\nI think if your PI could enforce masks in the lab that'll make you feel a bit better. Could you reopen that conversation with them and see what they can do to help?\n\n\\*Edit: I forgot to answer your question smh. I definitely debated quitting during the summer but thankfully my PI and graduate advisor are very likeminded and really care about making me feel comfortable. So I feel safe enough to continue.",
      "author": "saoriix",
      "created": 1630682646,
      "upvotes": 5,
      "replies": {
        "hbghbea": {
          "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/hbghbea/",
          "text": "We have a mask mandate, but we had a person come in to lab while someone in their household was testing positive for a breakthrough case. My PI did not seem to agree with my concerns about that situation, so I get to spend a good portion of today contacting people who might be able to help me figure out what to do.",
          "author": "voidofneurons",
          "created": 1630683072,
          "upvotes": 4,
          "replies": {
            "hbgicxy": {
              "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/hbgicxy/",
              "text": "That's a mess :\\\\ They should be considered a close contact and be tested prior to coming back to the lab; we've had labs here on campus who have done similarly. Has that person received a negative test prior to returning? If not, I definitely understand your concerns and your PI is being really inconsiderate",
              "author": "saoriix",
              "created": 1630683504,
              "upvotes": 2,
              "replies": {
                "hbgj2l8": {
                  "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/hbgj2l8/",
                  "text": "Technically, our university policy is that if the person with an exposure is fully vaccinated and not showing symptoms, they're allowed to come to campus. So they did not have a negative test yet, and my PI is following university policy about them not being a close contact to me meaning I should still go in. I am so upset that I need to spend so much time and energy fighting for my own safety when I could be doing my actual work instead.",
                  "author": "voidofneurons",
                  "created": 1630683802,
                  "upvotes": 2,
                  "replies": {
                    "hbgtflg": {
                      "link": "/r/GradSchool/comments/ph6zht/has_anyone_quit_over_covid_concerns/hbgtflg/",
                      "text": "I agree 100%; it is really frustrating and I wish your PI would request them to at least work at opposite shifts for the comfort of the lab. First off, I’m really sorry that you’re having to through this - grad school is hard enough without dealing with an ongoing pandemic.\n\nCan you go in at a different time? Or work in different areas so you’re not close to them? I know it’s inconvenient for you, but it may help temporarily. One thing I will say is that there have been recent studies showing breakthrough infections shed less virus and are less transmissible. Successful mask usage will definitely prevent this as well, especially if they continue to wear them and you maintain distance. I hope that gives you some comfort in between all of this.",
                      "author": "saoriix",
                      "created": 1630688066,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634064570
}