{
  "sid": "r3j7m3",
  "link": "/r/GradSchool/comments/r3j7m3/feeling_unwelcome_in_the_lab/",
  "title:": "Feeling unwelcome in the lab",
  "text": "I joined a new lab for my first rotation. The grad student I was paired with treats me like a burden. Like she is avoiding me, and I know it's not my imagination. Lately, we talk about my experiments, and she says she is going to be there with me, but three days ago, she left me in the lab. I spent over a week preparing the reagents and cells for the experiment. Now I have to throw them away and re-do them after thanksgiving. She spent all day dodging me and pretending to be busy. It would have taken her 10 minutes max to show me what to do. Its not the first time she has done this. My experiments are delayed by several days because no one can help me. I designed my primers, but couldn't order them until an undergrad was able to eventually help three days after. There are so many reagents I needed that I spent hours looking for because I didnt know where they were.  Other lab mates have been so nice, but I need her guidance because she is the only one who knows how to do most of those experiments. It's not just the experimental delays, it's the shady looks, and the dodging. I'm starting to hate going to the lab, and I bet that's her intention. I try to be nice. I even bought her coffee twice. I love the research and other lab mates but have been super frustrated by this. Yet I know she cannot leave her job to attend to me.  I dont feel entitled to her time, I just dont understand this treatment. Its one thing to say hey im sorry im too busy to help. Its another to intentionally waste my time in this manner. I dont know what to do, but I dont think telling the professor is going to help our relationship.",
  "author": "Miracle517",
  "created": 1638036661,
  "updated": 1638207967,
  "over_18": false,
  "upvotes": 22,
  "upvote_ratio": 1.0,
  "comments": {
    "hmbpehb": {
      "link": "/r/GradSchool/comments/r3j7m3/feeling_unwelcome_in_the_lab/hmbpehb/",
      "text": "That sucks. I had a similar experience and changed labs. \n\nIs there anyone who is a leader in the lab that you can approach? I'm thinking of someone like a staff scientist or postdoc. Go to them first. Ask for advice and bring up the idea of talking to your PI with them. \n\nYou can also ask more experienced folks in lab for suggestions on how to set up your experiments. If you go this route, it'll be much more independent but you'll also learn more in the long run.\n\nYou have a lot of options. Don't let one sucky person bring you down!",
      "author": "yamanp",
      "created": 1638050562,
      "upvotes": 8,
      "replies": {
        "hmcbx8v": {
          "link": "/r/GradSchool/comments/r3j7m3/feeling_unwelcome_in_the_lab/hmcbx8v/",
          "text": "Thank you so much for responding. I still have other labs I can rotate in, but this was my first choice. I'm going to be here for three more weeks so I was wondering if I could fix it before I had to move to another lab.  Unfortunately, she is the most senior person since the lab is still fairly new. But youre right, I wont let it get to me anymore",
          "author": "Miracle517",
          "created": 1638060719,
          "upvotes": 3,
          "replies": {
            "hmhbofj": {
              "link": "/r/GradSchool/comments/r3j7m3/feeling_unwelcome_in_the_lab/hmhbofj/",
              "text": "If she's the most senior, maybe she'll graduate soon? Even one semester is a long time with someone miserable though.\n\nYou got this OP! Make the best decision for you at this moment and stick with it.",
              "author": "yamanp",
              "created": 1638152488,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hmdkye7": {
      "link": "/r/GradSchool/comments/r3j7m3/feeling_unwelcome_in_the_lab/hmdkye7/",
      "text": "Your lab mate may be going through some rough times, and it may just be too much for her to take care of someone else's needs. What you perceive as shitty behavior may not be intentional. Difficult to say. If you can, just talk with her; I would not take this to someone else for now.",
      "author": "Matthias_Rillig",
      "created": 1638085352,
      "upvotes": 6,
      "replies": {
        "hmdqscu": {
          "link": "/r/GradSchool/comments/r3j7m3/feeling_unwelcome_in_the_lab/hmdqscu/",
          "text": "true, but in that case wouldnt it be better to just let me know, rather than wasting my time and lab resources? But yes I understand that it may not be intentional like it seems.",
          "author": "Miracle517",
          "created": 1638089944,
          "upvotes": 2,
          "replies": {
            "hmds3gj": {
              "link": "/r/GradSchool/comments/r3j7m3/feeling_unwelcome_in_the_lab/hmds3gj/",
              "text": "Yes. But people are not often not able to talk about such things (least of all to someone new).",
              "author": "Matthias_Rillig",
              "created": 1638090971,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hmcrk9e": {
      "link": "/r/GradSchool/comments/r3j7m3/feeling_unwelcome_in_the_lab/hmcrk9e/",
      "text": "As a former lab staff/tech, this is shitty behavior from a grad student. Get the support you need and go to them rather than her. Lab staff or post doc as previously said can help you with training and understanding what you need to do for running your experiments. You’re doing nothing wrong.",
      "author": "kiwiwater7",
      "created": 1638068229,
      "upvotes": 3,
      "replies": {}
    },
    "hmeo7jd": {
      "link": "/r/GradSchool/comments/r3j7m3/feeling_unwelcome_in_the_lab/hmeo7jd/",
      "text": "straight up tell them what's wrong with their behavior. it's bad that they give shady looks and shit, but it's another to just not help with the work they're supposed to.",
      "author": "HLA-AIRE-VIT1",
      "created": 1638112379,
      "upvotes": 2,
      "replies": {}
    },
    "hmfblwa": {
      "link": "/r/GradSchool/comments/r3j7m3/feeling_unwelcome_in_the_lab/hmfblwa/",
      "text": "I think you need to be more vocal with your needs. You shouldn’t be waiting 3 days after designing primers, nor spending hours looking for reagents, before asking someone for help. \n\nTheir behavior—shady looks, etc—is inexcusable. But mentoring a rotation student is a huge burden. They have to show you how to do literally everything, while still doing their own work. It’s like doing research for two people at once. If you’re not communicating where you are and what you need, they’re going to focus on their own thing.",
      "author": "Tritagator",
      "created": 1638122407,
      "upvotes": 2,
      "replies": {}
    },
    "hmjfhr0": {
      "link": "/r/GradSchool/comments/r3j7m3/feeling_unwelcome_in_the_lab/hmjfhr0/",
      "text": "Hi there! I understand your situation so well, as I had a very similar one. And yes, your thinking is right. First thing is to talk to that person, explain your expectation and feelings (vibes) you get, highlight that you cannot be efficient if this atmosphere is between you and that person. If she will get that and take it into account for the future - it is perfect. But usually, this is not the case. Then, make an appointment to meet with your PI, that person and yourself, before she talks to PI. As that student is working for a long time there, the professor will be on grad student's side. So it would be better to make a meeting before the student will talk to the professor and be ready for possible questions or claims that the student can argue with. I wish you luck and all the best. Hope it won't go so bad and you can friendly talk to students without any further meetings. Head's up!",
      "author": "cozy-scholar",
      "created": 1638199413,
      "upvotes": 1,
      "replies": {}
    }
  }
}