{
  "sid": "qavgyl",
  "link": "/r/GradSchool/comments/qavgyl/training_in_another_lab/",
  "title:": "Training in another lab?",
  "text": "Hi all! I’m in an MS program in a lab where I received zero lab training. My advisor doesn’t have any experience relevant to what I need to do in lab (he’s helpful with field work), and there are no senior grad students, post docs, or techs in the lab. I’ve been on top of all of my field work, but basically haven’t started processing my samples because I’ve been so overwhelmed by it all. I have lab experience in other disciplines, but not in this one, and we don’t even have all the equipment for this work in our lab so I need to get access to two other labs in our department just to do my research.\n\nMy advisor suggested asking one of my committee members (who actually has expertise in this field) at another university if I could come train in her lab for a month or two. Do you think this is a reasonable request, or should I just tough it out and do everything here? My advisor would provide funding for it all.\n\nThanks!\n\nEdit: just to add, I guess my hesitancy stems from the fact that I’ve seen posts on here about how it’s normal to not be trained at all on how do conduct research, and how that’s all part of the learning process. And if it’s normal, then I feel like I should just figure it out instead of asking for help.",
  "author": "IcedCzar",
  "created": 1634589359,
  "updated": 1634655410,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh5n7ch": {
      "link": "/r/GradSchool/comments/qavgyl/training_in_another_lab/hh5n7ch/",
      "text": "If your PI suggested asking the other committee member, I would do that. During my PhD, I got trained by a variety of people not in my lab because they were really good at certain things I needed to do. My PI even sent me clear across the US to train in a collaborator's lab for a week.",
      "author": "kirby726",
      "created": 1634591960,
      "upvotes": 3,
      "replies": {}
    },
    "hh6hzgs": {
      "link": "/r/GradSchool/comments/qavgyl/training_in_another_lab/hh6hzgs/",
      "text": "It's common to figure most of it out. It's also common and smart to seek help from others, even if it's in another department or another university.",
      "author": "fwafwa",
      "created": 1634606449,
      "upvotes": 1,
      "replies": {}
    },
    "hh7vui1": {
      "link": "/r/GradSchool/comments/qavgyl/training_in_another_lab/hh7vui1/",
      "text": "Sounds like you have a great advisor. Mine doesn't even want me to talk with other faculty.",
      "author": "Matterials",
      "created": 1634641250,
      "upvotes": 1,
      "replies": {}
    }
  }
}