{
  "sid": "ris5wd",
  "link": "/r/GradSchool/comments/ris5wd/are_grad_assistantships_hard_to_get/",
  "title:": "Are Grad Assistantships hard to get?",
  "text": "I was accepted into the grad program of my dream months ago but upon viewing my\nfinancial aid package, I realized it was much too expensive. I had settled on going elsewhere. \n\nLast week, however, I received an email inviting me to apply to be a GA. The GA position would be just enough for me to cover the cost of tuition for the program and I’d be able to attend it. So of course, I jumped at the opportunity. \n\nI’m a first-gen navigating all things college on my own so I had never heard of a graduate assistantship. Outside of needing 3 recs, the application is pretty straight forward. Still, I called my admissions counselor and asked for more info and whether or not it was competitive. She made it seem as if being a GA was a pretty easy thing to do. She said things like “it doesn’t have to be an academic role. We even have GAs serving in the admissions office with us.” She told me I could list “no preference” for the question that asked about what position I’d like to work in. \n\nShe made it like filling the application and getting the recs was just a formality and getting a spot would be easy. However, everywhere I look online says that assistantships were competitive and were hard to get.\n\nI plan to complete the application regardless but I just wonder if I’m getting my hopes up for nothing. While I am not at the bottom of the barrel, nothing in my academic is especially remarkable either. I’m a relatively average student with an average resume and GPA. \n\nAnybody have an experience with applying for assistantships? Any input is appreciated.",
  "author": "confusedpsychgirl",
  "created": 1639778962,
  "updated": 1639788475,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hozav6u": {
      "link": "/r/GradSchool/comments/ris5wd/are_grad_assistantships_hard_to_get/hozav6u/",
      "text": "It really just depends on the institution. At my last university, GA positions were super easy to get. You just had to accept the position. I didn’t get one my first semester but it turns out I just had to inquire about it and let them know I was interested in a position when the information was sent about it in an email. My GA through my second year of my master’s was a low fuss grading position. At my current uni, you just get assigned to a class and can accept this position or not. Responsibilities can be anything from leading classes to simple grading responsibilities. But I’ve also heard that positions are competitive at other universities.\n\nSorry this isn’t a straightforward answer, but it just really depends on where you’re at.",
      "author": "meowitsgabi",
      "created": 1639781722,
      "upvotes": 2,
      "replies": {}
    },
    "hoz99zf": {
      "link": "/r/GradSchool/comments/ris5wd/are_grad_assistantships_hard_to_get/hoz99zf/",
      "text": "Also a first gen student who is super lost on how my GA would work or how to apply to it. Aby info is helpful.",
      "author": "origional_esseven",
      "created": 1639781051,
      "upvotes": 1,
      "replies": {}
    },
    "hozoakl": {
      "link": "/r/GradSchool/comments/ris5wd/are_grad_assistantships_hard_to_get/hozoakl/",
      "text": "A lot of graduate schools provide full support on an assistanship. Students get tuition paid, health insurance, and a stipend that covers basic living expenses on a graduate assistanship. The responsibilities of the assistanshtip generally provide a significant learning experience. \n\nYou should only go to graduate school at a place that gives you this kind of arrangement.\n\nThe program that you have been accepted to probably provides an assistantship to most or all students. You just need to apply. Your director of graduate studies will help provide context and direction. The admissions counselor is putting you on the right track and is a good person to get you oriented. They are there to help you succeed, in particular to fill in the gaps that make you feel uncertain.",
      "author": "IkeRoberts",
      "created": 1639787701,
      "upvotes": 1,
      "replies": {}
    }
  }
}