{
  "sid": "r3sexm",
  "link": "/r/GradSchool/comments/r3sexm/raise_my_gpa/",
  "title:": "Raise my GPA",
  "text": "I am having trouble calculating how many units I need to raise my undergrad GPA from a 2.5 to a 3.0 to apply for grad school. My undergrad GPA is a combination of both quarter and semester units. I have a total of 120 units when I graduated. \n\nI was told to go to CC to boost my GPA to apply to grad school with at least a 3.0. The CC I plan to attend is quarter system but I graduated from a school with a semester system.\n\nI have googled various GPA calculators and they are telling me I either need 60 something or 70 something units to graduate (it did not specify quarter or semester.)\n\nIs that an accurate number?? That many units to raise my GPA up 0.5 points??? I just want to raise it to apply for grad school. The program I am want to apply for has 1 requirement...3.0 GPA. Nothing else.\n\nCan someone confirm this or at least help me find an accurate calculation??",
  "author": "sadgirlzzzz",
  "created": 1638063081,
  "updated": 1638207976,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hmchjog": {
      "link": "/r/GradSchool/comments/r3sexm/raise_my_gpa/hmchjog/",
      "text": "If you’ve graduated, you can’t “raise” your GPA. It’s set at where it was when you graduated. \n\nYou can take classes and show you have a better GPA, but it won’t average in with the rest.",
      "author": "Eigengrad",
      "created": 1638063382,
      "upvotes": 3,
      "replies": {
        "hmchqvj": {
          "link": "/r/GradSchool/comments/r3sexm/raise_my_gpa/hmchqvj/",
          "text": "Okay then why are grad school admissions telling me to raise the cum GPA by taking CC classes...",
          "author": "sadgirlzzzz",
          "created": 1638063475,
          "upvotes": 1,
          "replies": {
            "hmchwat": {
              "link": "/r/GradSchool/comments/r3sexm/raise_my_gpa/hmchwat/",
              "text": "No idea. You should ask them that. \n\nMaybe they’re assuming you haven’t graduated? Until you graduate, you can potentially transfer in classes to raise your GPA.",
              "author": "Eigengrad",
              "created": 1638063547,
              "upvotes": 1,
              "replies": {
                "hmci6rp": {
                  "link": "/r/GradSchool/comments/r3sexm/raise_my_gpa/hmci6rp/",
                  "text": "I mentioned that I graduated in the email…hm yeah I guess I’ll ask to clarify how GPA will be calculated. Tbh I’m so confused now that I read what you told me 😅",
                  "author": "sadgirlzzzz",
                  "created": 1638063685,
                  "upvotes": 1,
                  "replies": {
                    "hmcid5i": {
                      "link": "/r/GradSchool/comments/r3sexm/raise_my_gpa/hmcid5i/",
                      "text": "Maybe they’re telling you they’ll average the new grades in with your others?",
                      "author": "Eigengrad",
                      "created": 1638063770,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmci875": {
      "link": "/r/GradSchool/comments/r3sexm/raise_my_gpa/hmci875/",
      "text": "More than likely this calculator is accurate. I was in a similar situation of needing to raise my GPA and every time I calculated it after my grades from a term would come in, I still needed A LOT more credits. It takes a lot of credits to raise your GPA. I don’t understand the advice you got about going to a community college to raise your GPA. Did someone at your school give this to you? Almost all schools will transfer credits however they may articulate, but it does not actually have any impact on your GPA. Only credits at your main institution will impact your GPA. I work at a CC and have reviewed transcripts from all kinds of schools all over the county. Of course, check with your school to make sure what I said is accurate. \nIf you can get up even to a 2.75 I would bet you can still get in. Are you allowed to write a personal statement or is there an interview process? I never got my GPA up to a 3, it was low due to major life traumas and serious stuff. I decided to go to grad school during COVID and I was able to get in even though my GPA was under the schools requirement. It will really depend on the school and how much demand there is for the program you are applying for. Don’t give up though!!",
      "author": "MaybeBabyBooboo",
      "created": 1638063704,
      "upvotes": 1,
      "replies": {}
    },
    "hmezk9m": {
      "link": "/r/GradSchool/comments/r3sexm/raise_my_gpa/hmezk9m/",
      "text": "Depends on how your undergrad institution calculates your gpa. Mine used a metric called quality points I think, which was the number for the grade (4 for an A, 3 for B…), multiplied by credit hours, then multiplied by a modifier based on relative difficulty of the course. Then of course divide that number by by credit hours.\n\nYour best bet is to go through your transcript and hand jam the calculations, or input it all into an excel sheet or something.\n\nAt the end of the day though, I think the other commenters are likely correct, your gpa is your gpa once you graduate, but id confirm that with the graduate admissions coordinator to make sure before you take a bunch of CC courses.",
      "author": "ThrowawayHistory20",
      "created": 1638117418,
      "upvotes": 1,
      "replies": {}
    }
  }
}