{
  "sid": "qbcvs3",
  "link": "/r/GradSchool/comments/qbcvs3/feeling_like_a_mess_at_my_ta_job_due_to_lack_of/",
  "title:": "Feeling like a mess at my TA job due to lack of guidance",
  "text": "I recently became a TA for my department’s tutoring center on campus which had been closed for the last 2 years. Basically, I’m supposed to assist the director in scheduling sessions and planning activities for the community. Thing is, there is no director and I’ve been reporting to the library to help guide me in this process, but they’re not exactly sure how things were operated in the center. \n\nPart of the job is scheduling sessions, and truth be told it takes up most of my time at work. I’m sending about 25-50 emails a day trying to schedule sessions between students and volunteers. Some volunteers are part of this work-study program that has professors monitoring their tutoring hours. \n\nMy system is usually as follows: send an availability email to the volunteer to schedule the session and send an email to confirm the session (time-location-students’ names). If they don’t answer, I send *one* follow up email and leave it at that. \n\nToday, one of the supervising professors for the work-study program came by to ask me *stop* emailing his students. He explained that they only offer sessions by request of the students, not at an established hour. He also explained that this is how the tutoring center is supposed to function. \n\nMy supervisor at the library assured me that I’m doing fine, but I’m honestly dealing with some cognitive dissonance. Have I been pestering students and volunteers for no reason with the scheduling? Am I just supposed to let them wander in when needing sessions or should I just pair them with a random volunteer for that one week and be on their way? If so, all the documents, schedules, and statistics I’ve collected are useless and I’ve wasted a good chunk of my time on unnecessary logistics. \n\nI was very much enjoying this gig but now my confidence on the job is kind of shot. There’s no guide or rule book on procedures to follow so I’m not really sure where to go from here.",
  "author": "Loyal_to_Bloom",
  "created": 1634654369,
  "updated": 1636199256,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hh8nkqn": {
      "link": "/r/GradSchool/comments/qbcvs3/feeling_like_a_mess_at_my_ta_job_due_to_lack_of/hh8nkqn/",
      "text": "I'm not sure if this is helpful but at my uni tutor hours are like an open office hours. You go and wait your turn if need be. For zoom sessions I've seen TAs have students in the waitroom and have 15 minute sessions, on a first come first serve basis. It seems like it would be more convenient that way. You could also make appointments by request if the students can't attend the open scheduled hours or they require more help.",
      "author": "uoftisboring",
      "created": 1634655839,
      "upvotes": 3,
      "replies": {}
    },
    "hhb7701": {
      "link": "/r/GradSchool/comments/qbcvs3/feeling_like_a_mess_at_my_ta_job_due_to_lack_of/hhb7701/",
      "text": "I don't what what to say, other than I really recommend not expending too much emotional and mental energy to TA stuff. Unless you want to teach or something and this stuff will actually be useful to you - just do the best you can and move on.",
      "author": "Pr0gr3s",
      "created": 1634694629,
      "upvotes": 1,
      "replies": {}
    }
  }
}