{
  "sid": "d9btv3",
  "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/",
  "title:": "Does anyone else get so overwhelmed that they end up doing absolutely no work?",
  "text": "I just started my PhD program a month ago and I find myself going through cycles of getting some things done, then spending days in my cubicle in the shared office space getting absolutely nothing done. I leave things for the last minute all the time. I go home early. I’m halfassing basic things. I can’t find it in me to care. \n\nThis is what I want to do. I’ve worked so hard to get here. What is going on with me?\n\nEDIT: Thanks for all the really kind comments and messages. The support has been great. But I just wanted to say that I wrote this comment while in a really bad mindset and it’s not representative of how I always feel or exist. This shit just gets hard and I’ve worked so hard to get here that I am exhausted so it fucks with my head when my background/age/race is thrown in my face to make me feel like I’m not doing enough or as much. It’s horrible. \n\n\nIf I want anyone to take anything away from all of this, it’s to be kind to your cohort members because this PhD shit is hard. Also make everyone feel welcome regardless of their background, because you have no idea what they’re dealing with and kindness can do a lot to improve the culture of your program. ❤️",
  "author": "hood_hermione",
  "created": 1569456701,
  "over_18": false,
  "upvotes": 639,
  "upvote_ratio": 1.0,
  "comments": {
    "f1nvowe": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1nvowe/",
      "text": "Ditto... you are not alone!\n\nExercise worked for me. I swim/sauna every second day. Some of my best ideas/recaps of have happened in that sweat box! That routine made it easier to establish other routines and manage my time more effectively. Also give the Pomodoro technique a try. There are apps(n=i) for that!",
      "author": "ze_baron3",
      "created": 1569627639,
      "upvotes": 1,
      "replies": {}
    },
    "f1kknsy": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1kknsy/",
      "text": "This has been me all week. Crazy I’m seeing this post. We’re all in the same boat here. I just looked up “problems focusing at work.”\n\nI’m planning on getting more sleep. \n\nI’ve been trying to do experiments but messed up some things when culturing cells, so had to start all over. Set me like 2 weeks behind, so when we had a meeting yesterday, I had nothing to present. \n\nTrying to write a paper but find it difficult to focus.\n\nIt happens, I guess. Definitely sucks. But I’m gonna try to get more sleep, maybe you should too if you think you need it.",
      "author": "kudles",
      "created": 1569536825,
      "upvotes": 1,
      "replies": {}
    },
    "f1jx73s": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1jx73s/",
      "text": "Yes",
      "author": "alecahol",
      "created": 1569529082,
      "upvotes": -1,
      "replies": {}
    },
    "f1jfnoc": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1jfnoc/",
      "text": "that's where I'm at right now. holding down a full time job .",
      "author": "kamon405",
      "created": 1569522646,
      "upvotes": 0,
      "replies": {}
    },
    "f1j3hun": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1j3hun/",
      "text": "Make sure that you're spending plenty of time relaxing, where you don't think about work at all. When you feel like you're behind, there's often a danger of slipping into a cycle where you're thinking about work all the time and feeling guilty for taking time off. You need to avoid that and make sure you carve out time in the evenings and weekends when you don't think about work at all, e.g. by doing a hobby that occupies all your attention. I found that creating this separation meant that I was much more productive overall and in a sustainable way, because I was working much more effectively when I was at work.",
      "author": "asherdi",
      "created": 1569518248,
      "upvotes": 2
    },
    "f1iplcb": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1iplcb/",
      "text": "There was about a year (let's be honest, it was more than a year) of my PhD where I did absolutely nothing. Somehow I still graduated.",
      "author": "ag_sci14",
      "created": 1569513424,
      "upvotes": 6,
      "replies": {
        "f1j6hkd": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1j6hkd/",
          "text": "This is very reassuring lol",
          "author": "hood_hermione",
          "created": 1569519358,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "f1ik43j": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1ik43j/",
      "text": "One thing that helps me out is a pomdoro tuner. I have the app “focus keeper” and basically I do as much as I can for 25 min then have 5 mins off and repeat that cycle four times. The fourth break is 25 minutes. It’s helpful cause you see time ticking down and it makes me competitive to get so much writing/research/emailing done before the break.",
      "author": "isitpotatoquality",
      "created": 1569511456,
      "upvotes": 1,
      "replies": {}
    },
    "f1i4nyv": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1i4nyv/",
      "text": "Yup",
      "author": "affluentjones",
      "created": 1569505876,
      "upvotes": -1,
      "replies": {}
    },
    "f1i0o2o": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1i0o2o/",
      "text": "Hey fellow human. That was absolutely me for most of my program. I made it through. \n\nOne thing that really helped me was that I started running for leisure. I'd listen to audiobooks and podcasts while I ran. It was a great way to escape from work for a bit without feeling guilty, and the exercise endorphins or whatever were enough to get what I now realize was depression to a manageable level. I saw some other comments worrying about whether depression is sinking its claws into you, and I agree. Avail yourself of your school's counseling services; they can give you strategies to help cope and if you need medicine there's no shame in that\n\nAs for the \"leaving things for last minute\", I'm still bad at that, but one thing that did help was to start using the pomodoro technique. Sometimes I'm still unproductive, but setting small tasks and getting them done during a 25 minute session helped me make small progress. \n\nOne final thing was changing my environment. If I got stuck, I'd print out some papers or take a notebook and go somewhere different - Starbucks or Chipotle or something - and treat myself while working on reading the paper or planning out my next programming task. \n\nOf those things, though, adding exercise and mental leisure time made the biggest difference. If you're not physically active right now, I *highly* recommend it (the couch to 5k program was a good way to ease into running for me, and don't be afraid to run super slow (I started out with 13-14 minute miles and I have *long* legs); the exercise is what matters, not how many times Usain Bolt would lap you if he was there). And make an appointment with your University's counseling center - it will help. \n\nGood luck. You got this <3",
      "author": "raptoricus",
      "created": 1569504046,
      "upvotes": 3,
      "replies": {
        "f1j6c8p": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1j6c8p/",
          "text": "Can you tell me a little bit more about how you eased into running? I’m very clumsy and uncoordinated and I’m also overweight, which makes me worry about how to get started without hurting myself. I used to be much more active because of how I lived and then things changed in the past year to the point where I have no idea how I walked everywhere like I used to. I’m always tired.",
          "author": "hood_hermione",
          "created": 1569519307,
          "upvotes": 1,
          "replies": {
            "f1j82ug": {
              "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1j82ug/",
              "text": "Take a look in /r/c25k . There's outlines of the program, including two weeks that you can use to lead to into week one of the program if you don't feel like you can run the distances prescribed. It's possible /r/running or /r/fitness have more info on beginning physical activity smoothly. The biggest thing for me was being sure to run *slowly* - you should be able to hold a conversation while running; doing so helped me not wear myself out and/or develop shin splints.\n\nDepending on how overweight you are, just walking some distance (maybe start with a mile and build up to larger distances) might be better - walking isn't hard on your joints, and the real point is to get moving, to get exercise, and to get time to yourself; walking while listening to music, podcasts, or audiobooks (or just with your own thoughts, if you can avoid stressing about work during your walks) totally counts for all of those purposes.",
              "author": "raptoricus",
              "created": 1569519930,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f1hwj62": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1hwj62/",
      "text": "Use your University or local counseling services!! \n\nThis was absolutely me. I was dealing with family stuff so I went in to chat and this stuff eventually was mentioned. My therapist said these are big signs of major depression. I had no idea. \n\nWhile I'm not 100% recovered, my meds and therapy help reduce the frequency (which my dissertation chair and CV are happy about)",
      "author": "belligeren",
      "created": 1569502081,
      "upvotes": 3,
      "replies": {}
    },
    "f1hw4oe": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1hw4oe/",
      "text": "Constantly. You have to force yourself to forget about all the stuff you have to do and only think in terms of the next reasonable-sized task you have to do.",
      "author": "DoctorAcula_42",
      "created": 1569501892,
      "upvotes": 1,
      "replies": {}
    },
    "f1hutdl": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1hutdl/",
      "text": "Just pick something that’s manageable and get it done. Then pick the next thing, and so on and so forth. Then start prioritizing based on urgency.",
      "author": "NoMenLikeMe",
      "created": 1569501264,
      "upvotes": -1,
      "replies": {}
    },
    "f1hq1fp": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1hq1fp/",
      "text": "Absolutely!\n\n(Oh wow, I wrote quite a lot so TLDR: try different method to organize yourself and see what works for you and what don't).\n\nI used to hate myself for being lazy. I felt very inadequate and like a fraud. Until I tried the fabulous method of non-zero days I saw on Reddit. Basically, to not feel like a failure, just do one thing in your day. Doesn't need to be huge. Can be something as small as printing something or read one page. Usually, doing one thing gets you going and you end up doing a lot. But if not, at least you did one thing. Thus the non-zero days and a slightly higher self-esteem.\n\nIt worked quite well until I noticed days with fewer tasks were the \"I kept going\" kind and when my list was too long, it was one thing not work related (buy milk or clean the table). It was not efficient enough for what was needed to be done.\n\nI then tried to divide into minitasks everything and told myself: in the next hour you must have done two of those mini tasks. Just to not feel overwhelmed and be goal oriented.\n\nIt worked for a week or two.\n\n\nI then tried to create a flow of minitasks and build a schedule consisting of doing task A then B then C etc... to have a thread keeping me going. Works some days but I was kinda back on square one with an artificially bigger task list...\n\nThen I tried working at the library. To remove myself from all distraction. Worked the first day but I noticed every small noise or people moving around were distracting me. I discovered I had to have a baseline noise. Youtube was too distracting but nothing at all was even worse.\n\nSo I tried Pavlov method and started going at my favorite chocolate cafe. A few hours of work, because there is nothing else to do + I get to explore their menu. It worked. Then, I started going to other coffee shops, anti-cafe, bistro, etc to work. Seriously, life changing. It forced me to face my work and there is no other thing to do than to read or write! I could work for 4 to 6 hours straight. I was not doing this everyday because money and bad food but it changed my life.\n\nWhen I need to focus on one big task, I go out. The rest can be handled at home.",
      "author": "mouettefluo",
      "created": 1569498783,
      "upvotes": 5,
      "replies": {}
    },
    "f1hhhgv": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1hhhgv/",
      "text": "Yes. I finished my PhD in 2016 and I still feel this way... but I think it’s getting better. I am (finally) in a long-term position so working on balancing my time. \n\nIt always gets easier the longer you do it- but every time you hit a new stage there’s a learning curve.",
      "author": "GrandmaMabelGrey",
      "created": 1569493575,
      "upvotes": 2,
      "replies": {}
    },
    "f1hf9ul": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1hf9ul/",
      "text": "5th year here. \n\n\nSuffering from the \"flu\" this week. \n\n\nAll the fricking time. I swear my mentor thinks I have some kind of immune problem.",
      "author": null,
      "created": 1569492204,
      "upvotes": 10,
      "replies": {
        "f861z57": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f861z57/",
          "text": "omg hahaha I already used the \"flu\" excuse earlier this month to turn in a late assignment, don't think I can pull it again though I definitely need to. . .",
          "author": "knowuow",
          "created": 1574288115,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f1h2n40": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1h2n40/",
      "text": "I fall into this hole every once in awhile. But if I let myself think I'm worthless because of it, climbing out of the hole is much harder. Also, maybe the cycles are just part of the process. They are for me at least.",
      "author": "hannahnoitshana",
      "created": 1569484039,
      "upvotes": 1,
      "replies": {}
    },
    "f1gw6ax": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gw6ax/",
      "text": "My advisor recently told me she sees two mistakes PhD students do primarily due to the structure or lack there of. Either they work too hard and work themselves to death trying to do everything or they get lazy and don’t do enough. You have to find the balance.",
      "author": "Emmabr33",
      "created": 1569479528,
      "upvotes": 5,
      "replies": {}
    },
    "f1grh30": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1grh30/",
      "text": "This is absolutely me this semester. And it makes me so upset with myself, because if I could even out my productivity, I would be so much happier and less stressed. I’ve started counseling this week to try to be happier and more productive, and I’m glad to hear I’m not alone.",
      "author": "LadyOfNumbers",
      "created": 1569474974,
      "upvotes": 2,
      "replies": {}
    },
    "f1gqn1s": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gqn1s/",
      "text": "One of the main things I have learned in grad school is that if I’m going to take a break from working, I’m not allowed to feel guilty about it. Because if I’m worrying about work, then I’m still working, regardless of whether anything is getting done. Last summer, I did basically nothing to further my research. But I spend the entire summer worrying, which meant I didn’t even get to enjoy my break. This summer, I allowed myself to take a couple of months off and actually enjoy my time. I read books, practiced piano, played breath of wild... Obviously you’ll have to dedicate time to work. But like others have said, when you notice yourself hitting a wall... just give yourself a break. You’re not expected to have things figured out in your first year, no matter how much bullshit your cohort members are spewing.",
      "author": "candlesticcs",
      "created": 1569474243,
      "upvotes": 6,
      "replies": {
        "f1iarxt": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1iarxt/",
          "text": "I always force myself to take one day off per week. Completely off, no guilt, just spending time with my SO and gaming. It's kept me sane.",
          "author": "hausdorffparty",
          "created": 1569508193,
          "upvotes": 2,
          "replies": {
            "f1j5y4l": {
              "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1j5y4l/",
              "text": "Saturdays are my off day. But it’s so hard to get working in a normal fashion again after a break. I just want to sleep",
              "author": "hood_hermione",
              "created": 1569519165,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f1i509k": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1i509k/",
          "text": "Is this a common thing to take off summers? I'm on a 12 month contract for my research fellowship so I don't have this flexibility.",
          "author": "_Ctrl_Alt_Delete",
          "created": 1569506016,
          "upvotes": 1,
          "replies": {
            "f1jwbcq": {
              "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1jwbcq/",
              "text": "I don’t think it’s common for people to take intentional breaks, but I do think it’s really common for people to spend several weeks/months not getting anything done because they’re too stressed out. I just eliminate the unproductive stressful days by replacing them with warranted breaks. And I am a year ahead in my program, so I’d say it’s working!",
              "author": "candlesticcs",
              "created": 1569528770,
              "upvotes": 1,
              "replies": {
                "f1nef8r": {
                  "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1nef8r/",
                  "text": "But like if I took the summer off thats so many incubations and cell lines and stuff that would just die. A summer is like 3/4 of the work for one paper for me. Besides that my contract pays me to actually be in the lab over the summer.",
                  "author": "_Ctrl_Alt_Delete",
                  "created": 1569615333,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f1gqkke": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gqkke/",
      "text": "Get counseling",
      "author": "IDrankChocolateMilk",
      "created": 1569474183,
      "upvotes": 0,
      "replies": {}
    },
    "f1gq54d": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gq54d/",
      "text": "Sounds like burnout. I deal with the same thing.",
      "author": "xWhiteRavenx",
      "created": 1569473829,
      "upvotes": 1,
      "replies": {}
    },
    "f1gppn1": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gppn1/",
      "text": "I can definitely relate. It's getting to the point where I can't do it anymore, or I start to jeopardize my graduation date. Hopefully that's enough motivation to minimize procrastination.",
      "author": "flyingbkwds21",
      "created": 1569473473,
      "upvotes": 2,
      "replies": {}
    },
    "f1gmd8v": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gmd8v/",
      "text": "Literally me. You're not alone. I also started ~ a month ago, wait till last minute, sit at my desk staring out the window, go home early, etc... When I go home early I tell myself I'll get work done there after eating/chores. I almost never do until midnight. \n\nSolidarity! ✊",
      "author": "BoJacob",
      "created": 1569470753,
      "upvotes": 2,
      "replies": {}
    },
    "f1gkkor": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gkkor/",
      "text": "All the time. I will pretend to do the work but I usually lose any sense of productivity I had pretty quickly. Unfortunately, I'm about in one of these moments now with my stats class and the way she's having us learn things is stressful and time consuming, and I hate it. I have minimal motivation to do much of anything",
      "author": "Invertqueen92",
      "created": 1569469376,
      "upvotes": 1,
      "replies": {}
    },
    "f1giz0m": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1giz0m/",
      "text": "Oh yeah, sometimes I just sit there staring out.  I play it off well,  people walking by usually think I'm just deep in thought.",
      "author": "FeminineEnergy01",
      "created": 1569468320,
      "upvotes": 2,
      "replies": {}
    },
    "f1gitxf": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gitxf/",
      "text": "Sorry you're having to deal with this, but ohhh boy is it a relief to read all these responses and see that other struggle with this too. I'm in the 5th (and hopefully final) year of my PhD, and I still struggle with shutting down completely when I get too overwhelmed. I'm trying real hard to learn and use different coping skills to manage it (thank god my university has good mental health resources), but I'm not very good at it yet. Sometimes it all just becomes too much and I hide from it all and don't get out of bed for a week (which of course is the most counter productive thing ever...stupid brain). Luckily that hasn't happened in a while thanks to counseling and meds, but if you feel yourself getting to that point, definitely consider seeking out mental health resources around you. Sorry I don't have any great solutions or insights, but yeah, I feel ya. And thank you for posting this. Really.",
      "author": "Hal_Pal",
      "created": 1569468230,
      "upvotes": 7,
      "replies": {}
    },
    "f1gil83": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gil83/",
      "text": "I’m working on my dissertation and I am on the job market. Tonight I played in the Fortnite Contenders Cup instead of working on, ya know, work... \n\nFortnite tournament went good though lol",
      "author": "Rigs515",
      "created": 1569468072,
      "upvotes": 4,
      "replies": {}
    },
    "f1gh4e3": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gh4e3/",
      "text": "Oh totally. I had today off from work and instead of doing what I was supposed to be doing I literally spent the whole day lying naked in bed.\n\nI'm so burnt out dude.",
      "author": "KamalaHarris4Prez",
      "created": 1569467155,
      "upvotes": 6,
      "replies": {}
    },
    "f1ggcpn": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1ggcpn/",
      "text": "Story of my life. My department convinced me to drop my GTA/Fellowship and take an emergency hire 1yr full-time position, adjunct my old classes, take a course, and start my comps in one semester. Now the uni decided I need to pay nearly 20k in out-of-state tuition this year to stay in my program. I’ve got a to-do list a mile long and I spent most of today just feeling stressed and sitting in my office staring at a wall. There’s a certain amount of stress that’s good and helpful, and past that point people just break down.",
      "author": "Putter_Mayhem",
      "created": 1569466697,
      "upvotes": 3,
      "replies": {
        "f1j62s5": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1j62s5/",
          "text": "Is that legal? Because it doesn’t sound legal.",
          "author": "hood_hermione",
          "created": 1569519214,
          "upvotes": 1,
          "replies": {
            "f1mf04u": {
              "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1mf04u/",
              "text": "Legal? Yes. Sketchy af? Also yes.",
              "author": "Putter_Mayhem",
              "created": 1569592381,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f1gg12i": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gg12i/",
      "text": "I have similar tendencies with you for the past 2 months. This is the start of my 2nd year.\n\nThanks for sharing, the replies are helpful. I have qual coming soon so I need to spend my time in cubicle better as well.",
      "author": "SleepyHeadEveryday",
      "created": 1569466506,
      "upvotes": 3,
      "replies": {}
    },
    "f1gel12": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gel12/",
      "text": "OH YES. All the time. what has worked for me is an app called Focus To-Do which used the pomodoro technique and allows you to break your work down into various projects and tasks. For me, it was great because I have lots of different projects on the go and it allows me to chip away at all of them by doing, say, one or two pomodoro (25min focus work) sessions per day per project. Plus you get lots of nice stats to motivate you (if you're like me and love stats).",
      "author": "SporaticPinecone",
      "created": 1569465643,
      "upvotes": 5,
      "replies": {}
    },
    "f1gbi1c": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gbi1c/",
      "text": "This is literally me right now.  I'm nearing the end and it's such a struggle.  I find that your relationship with your advisor affects this 100%.  One thing that can help you now since you're early in is to schedule the things you're going to do and adhere to it.  Reading articles?  Plan it on your calendar.  Writing emails?  Plan that out.  Remember to schedule breaks too.  If you make yourself work for set amounts of time rather than complete tasks you can leave feeling more accomplished.",
      "author": "LateCheckIn",
      "created": 1569463844,
      "upvotes": 11,
      "replies": {
        "f1gw0ff": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gw0ff/",
          "text": "What if you can never finish everything that you’ve scheduled? I’m a month into my PhD and I feel like there’s just never enough time in one day to do everything I planned. And I don’t think it’s because the daily goals I set are too big... At the end of every day I feel like I’ve failed :( I never feel accomplished and I think about leaving this program all the time. My advisor doesn’t expect much of me right now, since I just started... I have a feeling it’s going to get much worse when I’m actually expected to be in lab all day.",
          "author": "milkj",
          "created": 1569479367,
          "upvotes": 5,
          "replies": {
            "f1h3lr9": {
              "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1h3lr9/",
              "text": "My first two years of grad school were periods of time in which I \"tested my capacity\" time and time again (e.g. was overextended beyond help).  What I've learned from others, as well as through my own experience, is what is planned on paper often seems feasible, but in reality there are any number of \"wrenches\" (e.g. detours, unexpected interruptions/distractions, etc.), that, once you're in a place in your program where you have the luxury (if not now), try to account for how a lot of tasks might actually take time-and-a-half or double the amount of time you initially thought it reasonably would.  \n\nIn other words, if you can't finish everything you've scheduled, that suggests you may need to account for more \"buffer time\" or \"wiggle room\" on tasks.  That way, at least you can finish the majority of what you have planned for the day.  If things go well and you're running ahead, then there's always plenty more you can fit in, and if you don't get to everything, then at least some of it got out of the way.\n\nDefinitely easier said than done.  But, if you aren't busy putting out fires (or are), and have long-term deadlines you're working towards, it can help to narrow your daily agenda into maybe 12 items max, broken into up to 9 smaller/medium size tasks (e.g. email so-and-so regarding x follow-up, zoom meeting w/ advisor, etc) and up to 3 tasks that require dedicated, sustained, focused windows of 90+ mins to several hours per session to make any meaningful progress (like coding, writing, grading etc).  Kind of a ramble, but I hope this sheds some insight.\n\nIt might seem counter-intuitive, at first, to scale down the volume and scope of your daily agenda, but it definitely beats the alternative of an \"air-tight\" schedule that bursts at the slightest mishap.  The idea is to distribute your progress in feasible daily chunks, so you can still have time to breathe each day as well.  Again, not always possible, but not necessarily an unattainable ideal either.  It took me three years to get to this point, and I will try to maintain this balance.  But, I'm also fully aware it will not always be possible in the future.",
              "author": "throwaway8753190",
              "created": 1569484710,
              "upvotes": 4,
              "replies": {
                "f1h7tn6": {
                  "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1h7tn6/",
                  "text": "Fuck, you’re absolutely right. I think my issue is that I severely underestimate the time it will take me to finish something in a not-half-assed way. Like in my head, “read chapter 3, take notes and do the hw” sounds like a simple 4 hour task, but it actually takes 3 days to read it thoroughly, take comprehensive notes, get answers to all my questions, and fully comprehend the text... especially when I also need to attend meetings, go to my classes, grade my students’ quizzes/reports, respond to emails, eat and sleep. I definitely would feel better if I didn’t disappoint myself every day by creating infeasible to-do lists, lol.\n\n\nHonestly, I think I unintentionally put more than I can handle on my to-do list because I have a deep fear that I’ll get lazy and become a failure if I don’t push myself hard enough. I worry that the moment I feel good about myself, it means I’m going too easy on myself. I worry that if I put 4 things on my list and finish them all before 5PM, I’ll call it a day and watch Netflix until I sleep instead of working on another task. I’m so burnt out from undergrad (I started grad school the same month that I finished undergrad because I am an idiot lmao) and I try to be understanding to myself but I honestly feel angry that I’m not excited about grad school. I want to feel excited, I WANT TO WANT to learn, but instead I’m just tired and overwhelmed",
                  "author": "milkj",
                  "created": 1569487537,
                  "upvotes": 5,
                  "replies": {
                    "f1kbqm6": {
                      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1kbqm6/",
                      "text": "Totally get what you mean.  I also went straight into grad school from undergrad and was pretty burnt out already from right out the gate having finished my undergrad internship requirement the summer/same month of starting my program as well as my first RA and TA roles that fall.\n\nMy previous post is where I knew I need to get to for quite some time, but, admittedly, it took a solid couple of years of winging it with very rough planning/structure that never seemed to pan out the way intended.  Grades went okay with only a couple below A, but I never felt quite good about most things in general when it came to classes and doing research.  My teaching is one of the areas that has improved enough to my liking, however since I have yet to figure out how to balance teaching several sections with making meaningful (enough) progress on research, I opted to take an \"informal sabbatical\" (e.g. passed on teaching/tutoring opportunities) this fall in order to catch up on my thesis and other research.  \n\nThe process is not the most fun a lot of the time, but I still consider my program to be one of the best ways I could have used my time over the past few years in spite of it being somewhat of a mixed experience a lot of the time.  Anyhow, best of luck with figuring out your balance.  It comes with a lot of trial and error, so as difficult as it may be, you just have try and be flexible and roll with the punches as you trek on through.",
                      "author": "throwaway8753190",
                      "created": 1569533993,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "f1j5rie": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1j5rie/",
          "text": "The thing is I know I’m getting things done because I write myself notes about what I’ve done. But it just doesn’t feel like enough. It feels like I’m missing something that everyone else understands they have to do, but I know that isn’t true. Still, I don’t feel any better.",
          "author": "hood_hermione",
          "created": 1569519096,
          "upvotes": 1,
          "replies": {
            "f1js1ck": {
              "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1js1ck/",
              "text": "80% of your PhD happens in the last 20% of your time.  Keep that in mind.  It's not linear at all.  Relax and enjoy the first year or two but continue to work hard and it'll work out.",
              "author": "LateCheckIn",
              "created": 1569527195,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f1gbd8e": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gbd8e/",
      "text": "Every Tuesday. Tuesday is my only day off from classes/teaching/meetings. I always tell myself I’m going to catch up on research Tuesdays and schedule 6-8hrs to progress on a project.. generally I don’t get out of bed till late afternoon then delay until 9-10pm.",
      "author": "Enzohere",
      "created": 1569463770,
      "upvotes": 6,
      "replies": {}
    },
    "f1gayqn": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gayqn/",
      "text": "[deleted]",
      "author": null,
      "created": 1569463539,
      "upvotes": 7,
      "replies": {
        "f1gdwy7": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gdwy7/",
          "text": "I am so sorry for your loss. I hope you can take some time for yourself soon and remember your furry friend.",
          "author": "cat_therapy",
          "created": 1569465248,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "f1gaghh": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gaghh/",
      "text": "I am so grateful to know I’m not alone in this struggle!! I literally stared at my inbox for a solid half hour today and was just paralyzed.",
      "author": "clarkforpresident",
      "created": 1569463251,
      "upvotes": 2,
      "replies": {}
    },
    "f1g95ak": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1g95ak/",
      "text": "Sometimes I push myself to a place of infinite possibilities. In a sitting I'll drop focus and consider as many courses of action as I can before selecting the most appetizing. This place is an expansive, dizzying place that is one step short of complete paralysis, but it is only there that I can be sure that habit has not yet consumed me.",
      "author": "LetThereBeNick",
      "created": 1569462490,
      "upvotes": 3,
      "replies": {}
    },
    "f1g857b": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1g857b/",
      "text": "Yes",
      "author": "nemoflamingo",
      "created": 1569461912,
      "upvotes": 1,
      "replies": {}
    },
    "f1g7n4i": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1g7n4i/",
      "text": "I mean, I took a nap today instead of working on the three page paper I have due at midnight. But, in context, I had my candidacy exam last week, so had to be super productive for like the past two months. and now I need a (literal and figurative) nap. Sometimes you just need rest, either physical, mental or emotional.",
      "author": "AKiwi89",
      "created": 1569461619,
      "upvotes": 11,
      "replies": {}
    },
    "f1g7mmm": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1g7mmm/",
      "text": "Hey everyone, thanks for commenting/upvoting. It makes me feel way less alone. I struggle since I always feel like I’m the least qualified to be in my (super competitive) program and it doesn’t help to be in my office where everyone is talking about “I’m going to have 3 papers by the time this school year ends” and “I did all the reading for the week” and “I’m getting a head start on dissertation planning” and so on. \n\nIt really helps.",
      "author": "hood_hermione",
      "created": 1569461611,
      "upvotes": 62,
      "replies": {
        "f1hfg1b": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1hfg1b/",
          "text": "If they are first years talking about getting three papers in a year, then they are delusional. They’ll be lucky if they don’t have to start completely from scratch in year two.",
          "author": "fserv11",
          "created": 1569492309,
          "upvotes": 16,
          "replies": {
            "f1hkonp": {
              "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1hkonp/",
              "text": "Or they'll be the nth author on a papers with the entire lab on it. They may have made one supplementary figure for it.",
              "author": "LeopoldTheLlama",
              "created": 1569495511,
              "upvotes": 8,
              "replies": {}
            },
            "f1j52l3": {
              "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1j52l3/",
              "text": "They were working on research teams at the old jobs they had before this, so it’s more just left over work that’s carried over.",
              "author": "hood_hermione",
              "created": 1569518833,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f1gw9e2": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gw9e2/",
          "text": "I’m in the same boat, the other first years I work with seem so excited and eager to get things done and I’m just... not. I’m burnt out from undergrad still and sometimes I just feel so dumb compared to everyone else. You’re definitely not alone",
          "author": "milkj",
          "created": 1569479613,
          "upvotes": 11,
          "replies": {
            "f1j55jw": {
              "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1j55jw/",
              "text": "Same. I graduated undergrad in May. \n\nI’m fucking tired.",
              "author": "hood_hermione",
              "created": 1569518864,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "f1ik9g7": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1ik9g7/",
          "text": "In my time as a graduate student, know that those people often are project their insecurities by saying that shit.",
          "author": "isitpotatoquality",
          "created": 1569511505,
          "upvotes": 2,
          "replies": {}
        },
        "f1iu82f": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1iu82f/",
          "text": "your username is 10/10",
          "author": null,
          "created": 1569515008,
          "upvotes": 1,
          "replies": {
            "f1j4xrk": {
              "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1j4xrk/",
              "text": "Thanks!",
              "author": "hood_hermione",
              "created": 1569518784,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f2ua2hy": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f2ua2hy/",
          "text": "Thank you for posting this. I'm in the exact same position and needed to see this discussion from people who have been in a similar position.",
          "author": "dwrodri",
          "created": 1570411227,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f1g7bhm": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1g7bhm/",
      "text": "My life today! I had a stomach ache and went home early, and have been laying in bed all day since. I am presenting at a seminar next week and I have so much to do to prepare, but it’s so overwhelming that I just freeze and do nothing. Going to try and force myself to get stuff done tomorrow I guess... good luck to you!",
      "author": "weddingthrow27",
      "created": 1569461429,
      "upvotes": 24,
      "replies": {}
    },
    "f1g79xe": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1g79xe/",
      "text": "I don't see that anyone else pointed this out, so I will: these lines \n\n> I can’t find it in me to care\n\nand \n\n> What is going on with me?\n\nmake me wonder if there's some depression going on? In my experience, I know that days where I don't simply \"don't care\" are days when I feel the worst, the most down. Also, the \"cycles\" are familiar to me as well.\n\nDon't know anything about your mental health or your situation so excuse me if I'm overreaching, but I wanted to offer a perspective that I hadn't seen mentioned yet (surprisingly, honestly). Hope your productivity rebounds if it is indeed that simple, or that you get the help you may need if it's more than that.",
      "author": "Bob_Ross_was_an_OG",
      "created": 1569461405,
      "upvotes": 42,
      "replies": {
        "f1hxrez": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1hxrez/",
          "text": "Yes, these are very typical symptoms of depression. OP, this is great advice here. Find a therapist and see about getting coached through burn out. If some productivity strategies and counseling don't help, see a psychiatrist about depression, anxiety, or (if this has been something you've always struggled with) ADHD. Remember that depression isn't \"being sad,\" it's a chemical imbalance in your brain that zaps your motivation and makes you feel bad. Something about grad school (ahem, overwhelming stress?) seems to induce depression in a lot of students, especially those who are more prone to it (i.e. family history).",
          "author": "mimariposa",
          "created": 1569502669,
          "upvotes": 5,
          "replies": {}
        },
        "f1iscku": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1iscku/",
          "text": "Devil's advocate here but maybe they can't find it in them to care because no one else cares? Sounds like they have a pretty hands off advisor. It's really difficult to operate solely on self motivation. Most of the world can't which is why at a normal jobs there's so many rules about time off, when you can leave, when you can't leave, productivity, etc.",
          "author": "stathicus",
          "created": 1569514384,
          "upvotes": 1,
          "replies": {
            "f1j4s2r": {
              "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1j4s2r/",
              "text": "I think I can see what you meant with this, but it’s incorrect. I have two really active, caring advisors and I love working with them and talking with them. Ive also been open with them about feeling out of my element. I’ve struggled with depression for all my life, but I’ve always had someone else’s problems to deal with (my family is unique) that I’ve never been forced to deal with myself. It’s a strange position to be in.",
              "author": "hood_hermione",
              "created": 1569518724,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f1g6tu2": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1g6tu2/",
      "text": "So so glad I’m not alone in this. I thought the first few months would be the most productive since I’m fresh but I feel like it takes me days to do maybe 5 hours worth of work",
      "author": "amls1997",
      "created": 1569461147,
      "upvotes": 19,
      "replies": {}
    },
    "f1g65mu": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1g65mu/",
      "text": "Yes. But I start doing at least one small thing because then the pile of things isn't as bad.",
      "author": "TheMightyWoofer",
      "created": 1569460759,
      "upvotes": 8,
      "replies": {}
    },
    "f1g5wwk": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1g5wwk/",
      "text": "analysis paralysis",
      "author": "pseudoname123",
      "created": 1569460618,
      "upvotes": 138,
      "replies": {
        "f1ga925": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1ga925/",
          "text": "Oh my god. I’ve never heard this term before but it is so me. Because of it, I failed senior seminar in college twice, and stalled grad school. Wow.",
          "author": "spartangrl0426",
          "created": 1569463133,
          "upvotes": 25,
          "replies": {}
        }
      }
    },
    "f1g5e43": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1g5e43/",
      "text": "Yea it happens to me as well. You're not alone. I haven't gotten anything done in two months until yesterday. It happens sometimes it's a matter of resting, sitting on ideas for research and figuring you're next step and other times focusing on other obligations such as teaching. This has been the longest I have been unproductive but that also didn't mean that I never thought of research.",
      "author": "Chemie_ed",
      "created": 1569460311,
      "upvotes": 23,
      "replies": {}
    },
    "f1g437a": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1g437a/",
      "text": "Gosh all the time. I feel like grad school is a constant ebb and flow of productivity. I’ve employed several tactics over the years, like breaking things down into small, manageable task - to-do lists are lifelines to me! I’ll write down the smallest thing just to have something to cross off.\nThe other things I’ve learned is to give yourself a break. When I start hitting that point of not being productive like that, I’ll take a day off. Sometimes on a Friday so it’s a long weekend. Do no work, don’t even think about work. It’s a mental reset and you come back refreshed and ready to go. \n\nHang in there!",
      "author": "Team_Cap",
      "created": 1569459480,
      "upvotes": 90,
      "replies": {}
    },
    "f1g17ul": {
      "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1g17ul/",
      "text": "All the time. You'll soon become comfortable with the work load and figure out how to maintain energy (or what structure you need in your life to maintain energy). I work really hard to maintain the perspective that it is a privilege to be in such a position of learning. But I also take breaks and go home early and play a whole lot of nintendo switch when needed. It's all good.",
      "author": null,
      "created": 1569457626,
      "upvotes": 183,
      "replies": {
        "f1gfssx": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1gfssx/",
          "text": "I found how ever much you spend in class a week you should spend double that outside of class doing stuff for it for the really tough courses at least which is an upper limit btw. For the easier classes I spend about half the class time for it.",
          "author": null,
          "created": 1569466370,
          "upvotes": 22,
          "replies": {}
        },
        "f1icyaj": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1icyaj/",
          "text": ">nintendo switch\n\nSuper Smash Bros. is my cool down tool. You can play for five minutes or two hours, alone or with your SO and friend. The ultimate pick up and chill out. I do it every day when I get home if things have been stressful. And I pretty much had stopped playing video games, but I love getting good with diff. characters, it's a challenge and very engaging, and thus stays fresh.\n\nI also heavily guard my time to read fiction. I'm currently reading a book called *Vineland* and having at least 30 mins to concentrate totally on something other than school is, I think, extremely good for the mind.",
          "author": "fearandloath8",
          "created": 1569508973,
          "upvotes": 5,
          "replies": {}
        },
        "f1j5eg7": {
          "link": "/r/GradSchool/comments/d9btv3/does_anyone_else_get_so_overwhelmed_that_they_end/f1j5eg7/",
          "text": "I do feel like I’m privileged to be able to learn in this manner, but I keep in mind that that privilege applies to everyone around me and not just me, because then it devolves into me feeling bad about myself and that’s bullshit because I worked my ass off to get here.",
          "author": "hood_hermione",
          "created": 1569518958,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634067435
}