{
  "sid": "r4f5w9",
  "link": "/r/GradSchool/comments/r4f5w9/how_do_i_politely_but_firmly_remind_recommenders/",
  "title:": "How do I politely but firmly remind recommenders to send letters before the deadline?",
  "text": "So my grad school application is due December 1st (less than 3 days) and a couple teachers have agreed to write me letters of recommendation but still have yet to submit them and I'm getting a little anxious \\*stress\\* haha. Thanks for your help and perspectives!",
  "author": "FanEast289",
  "created": 1638135668,
  "updated": 1639880293,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.94,
  "comments": {
    "hmgajka": {
      "link": "/r/GradSchool/comments/r4f5w9/how_do_i_politely_but_firmly_remind_recommenders/hmgajka/",
      "text": "I know it's stressful but it often is something professors do very very near the deadline. \n\nI've also heard professors say the most helpful thing you can do is go into the application system and have it send the reminder, as that contains the link they need. So it's a more helpful reminder as they don't have to go dig that up, especially if you have multiple schools due on that day.",
      "author": "-QuietStorm-",
      "created": 1638136311,
      "upvotes": 16,
      "replies": {
        "hmgb75q": {
          "link": "/r/GradSchool/comments/r4f5w9/how_do_i_politely_but_firmly_remind_recommenders/hmgb75q/",
          "text": "Oh ok. yea I sent them the direct link twice from the application. also will ask if they need anything from me",
          "author": "FanEast289",
          "created": 1638136573,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hmhh6er": {
      "link": "/r/GradSchool/comments/r4f5w9/how_do_i_politely_but_firmly_remind_recommenders/hmhh6er/",
      "text": "My supervisor signed it 3 hours before deadline. Welcome to grad school culture.",
      "author": "ThePoliteCanadian",
      "created": 1638154967,
      "upvotes": 7,
      "replies": {
        "hmpzl1h": {
          "link": "/r/GradSchool/comments/r4f5w9/how_do_i_politely_but_firmly_remind_recommenders/hmpzl1h/",
          "text": "Wow",
          "author": "FanEast289",
          "created": 1638311979,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmg9xav": {
      "link": "/r/GradSchool/comments/r4f5w9/how_do_i_politely_but_firmly_remind_recommenders/hmg9xav/",
      "text": "When did you last talk with them about this?\n\nSend out an email stating that your following up on the recommendation letter you both discussed, emphasis on the deadline and any other pertinent details. Link them where to submit it if you can.\n\nDon't feel anxious about it, especially if it's been awhile since you talked with them. Profs write a lot of rec letters, and most don't mind a gentle reminder. If you just talked about it recently however, then I would consider whether you want to be reminding them again.",
      "author": "Knightfall31",
      "created": 1638136067,
      "upvotes": 6,
      "replies": {
        "hmgbbz5": {
          "link": "/r/GradSchool/comments/r4f5w9/how_do_i_politely_but_firmly_remind_recommenders/hmgbbz5/",
          "text": "like 3 weeks ago. also sent them the direct link twice",
          "author": "FanEast289",
          "created": 1638136628,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmhr5ql": {
      "link": "/r/GradSchool/comments/r4f5w9/how_do_i_politely_but_firmly_remind_recommenders/hmhr5ql/",
      "text": "This is normal. I have a schedule I stick to for sending out reminders. I send the initial request at least 1month before the deadline with my CV attached and a quick overview of what I'm applying to/why I think I'm qualified, ask if they need anything else from me. 1 week before the deadline, follow up asking if there is anything they need, along with the link or instructions. And finally 2 days before the deadline with the link or instructions. \n\nThis generally works well as it has everything the professors could need plus an offer to give verbiage as needed. So it makes it easy to write and submit the letter. I've had people submit mere hours before the deadline. Its stressful but it gets in.",
      "author": "what-the-whatt",
      "created": 1638159678,
      "upvotes": 2,
      "replies": {}
    },
    "hmi4odn": {
      "link": "/r/GradSchool/comments/r4f5w9/how_do_i_politely_but_firmly_remind_recommenders/hmi4odn/",
      "text": "As a rule I always email a week before the deadline then also a day before if it still hasn't been submitted. I always include any pertinent links and remind them to reach out with any questions they may have. Profs often leave these things till the last minute",
      "author": "potatoloaf39",
      "created": 1638167552,
      "upvotes": 1,
      "replies": {}
    },
    "hmjuprx": {
      "link": "/r/GradSchool/comments/r4f5w9/how_do_i_politely_but_firmly_remind_recommenders/hmjuprx/",
      "text": "Unfortunately, this is common. Repeat emails. It's not rude if they've agreed to do it, and you gave them at least 3 weeks, and they were made aware of the deadline at the onset. Most professors are quite aware that they need multiple reminders, and do not mind at all. Just be polite in the email, include the link again, emphasize the deadline, and thank them for their agreement and time. If they haven't done it by the afternoon the day before the deadline, I wouldn't even be against showing up at their office during office hours or a period you know they'll be in (and not rushing to prepare for an important meeting or lecture), and asking if they would have a moment to do it then.",
      "author": "_Dysnomia_",
      "created": 1638205811,
      "upvotes": 1,
      "replies": {
        "hmpzs8f": {
          "link": "/r/GradSchool/comments/r4f5w9/how_do_i_politely_but_firmly_remind_recommenders/hmpzs8f/",
          "text": "Good advice but unfortunately I am in a different state than where they are located so can't show up in person",
          "author": "FanEast289",
          "created": 1638312061,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}