{
  "sid": "qq65g0",
  "link": "/r/GradSchool/comments/qq65g0/uk_msc_contact_hours/",
  "title:": "UK MSc contact hours",
  "text": "Good afternoon! \nDoes anyone know for full time taught masters, what are contact hours ? \nIn some universities, it's stated two days per week actually in lectures/other activities in campus, for some nothing is stated. Asking, because I am looking to apply in different city and what to prepare - for two days in person,say I would travel, if more than that, would consider moving closer. \nParticularly, thinking about QMUL. Emailed, received response that didn't actually answer my question.\n\nThanks in advance!",
  "author": "Banofffee",
  "created": 1636471864,
  "updated": 1636656547,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjygy7j": {
      "link": "/r/GradSchool/comments/qq65g0/uk_msc_contact_hours/hjygy7j/",
      "text": "This is a massively general question which is difficult to answer without knowing what your department/course is. I have something like 3 contact hours per module per week (4 modules/term) but that is in a London university in computer science + finance. Other courses in other departments can have massively different hours.",
      "author": "dxn99",
      "created": 1636478102,
      "upvotes": 3,
      "replies": {
        "hjyhjp4": {
          "link": "/r/GradSchool/comments/qq65g0/uk_msc_contact_hours/hjyhjp4/",
          "text": "You are right! \nI'm looking into Biomedical sciences. Will likely try to call or email program lead and hope they might clarify.",
          "author": "Banofffee",
          "created": 1636478339,
          "upvotes": 1,
          "replies": {
            "hjzfjpi": {
              "link": "/r/GradSchool/comments/qq65g0/uk_msc_contact_hours/hjzfjpi/",
              "text": "Often universities have a module catalogue for each of their modules listing the topics covered, who the lecturer is, how it's graded etc. Usually, it also lists the number of contact hours. So I would find the course that you would be enrolled in from your university website, then look at each of the modules it mentions in the module catalogue. Should help a little bit?",
              "author": "dxn99",
              "created": 1636491803,
              "upvotes": 2,
              "replies": {
                "hjzi4ne": {
                  "link": "/r/GradSchool/comments/qq65g0/uk_msc_contact_hours/hjzi4ne/",
                  "text": "Should thank you! That's the issue, particular one has no information about contact hours in module catalogue unfortunately:/",
                  "author": "Banofffee",
                  "created": 1636492831,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjyr1g9": {
      "link": "/r/GradSchool/comments/qq65g0/uk_msc_contact_hours/hjyr1g9/",
      "text": "There’ll be a lot of variability between different courses and different universities. For my M.Sc, I was in 5 days a week for about 9 months. A friend did an MA and was in for about 2 hours every other week. I’d see if there was a PDF with extra course information on the websites of universities you’re interested in and go from there. \n\nGood luck!",
      "author": "singinhallelujahtoem",
      "created": 1636482078,
      "upvotes": 2,
      "replies": {}
    }
  }
}