{
  "sid": "pgjtqa",
  "link": "/r/GradSchool/comments/pgjtqa/how_is_columbias_mstm_program/",
  "title:": "How is Columbia's MSTM program?",
  "text": "Hey, undergrad this side. I am planning to apply to the Masters of science in technology management program for fall'22.\nI want some honest opinions about the course as a whole , job prospects, etc. Is it worth it? \nAlso ,since this program is offered by SPS, alot of people have said all sorts of bad things about it on the internet. So I really need someone to clear my doubts.\n\nAny help would be appreciated.Thanks in advance.",
  "author": "uchiha_shubhangi",
  "created": 1630595473,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hbe3awu": {
      "link": "/r/GradSchool/comments/pgjtqa/how_is_columbias_mstm_program/hbe3awu/",
      "text": "Not worth it. Management programs are for people with some work experience. This will not help anyone get a job.",
      "author": "fwafwa",
      "created": 1630632180,
      "upvotes": 2,
      "replies": {
        "hbeos7b": {
          "link": "/r/GradSchool/comments/pgjtqa/how_is_columbias_mstm_program/hbeos7b/",
          "text": "Okayy. I see your point. Thankyou for your opinion! Really helps me narrow down my list.\nThanks again for responding, and hope you have a wonderful day!",
          "author": "uchiha_shubhangi",
          "created": 1630642860,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hbc1iyq": {
      "link": "/r/GradSchool/comments/pgjtqa/how_is_columbias_mstm_program/hbc1iyq/",
      "text": "I looked into this program at Columbia and a few other schools. \n\nIf you’re in undergrad rn I’m not sure if I’d recommend it. You can network your way into a job, get some experience, then come back for a degree. \n\nA few questions: \n\nWhat’s your major rn? Immediate job goals? Long term career goals. \n\nAlso isn’t it like insanely expensive? \n\nI liked the NYU program a little more. They have a wide variety of concentrations and pretty good career placement.",
      "author": "itsthekumar",
      "created": 1630600518,
      "upvotes": 3,
      "replies": {
        "hbc3kfw": {
          "link": "/r/GradSchool/comments/pgjtqa/how_is_columbias_mstm_program/hbc3kfw/",
          "text": "Hey! Thanks for responding.\nSo I'm a final year undergrad pursuing a BTech in Electronics and communication from a tier-2 college. \nImmediate job goals : meh, I'm just sitting for placements for  the sake of it all. I'm interested in studying some more  because I think that if I settle for a job, I won't be able to muster up the courage to pursue higher studies again.\nLong term goals : I wanted to pursue something in the management side (but not entirely management). I would definitely prefer having a mix of both technical and management. Therefore , I'm looking at universities providing programs like MIS and such.\n\nHell yeah it's expensive. That's why I wanted to know if it's even worth spending the money( because of the ivy league brand tag you know) \nAnd yes, NYU is on my list for sure.",
          "author": "uchiha_shubhangi",
          "created": 1630601315,
          "upvotes": 1,
          "replies": {
            "hbe5ij8": {
              "link": "/r/GradSchool/comments/pgjtqa/how_is_columbias_mstm_program/hbe5ij8/",
              "text": "Oh also just curious are you in the US or overseas? \n\nIf you're overseas I'd rather recommend any other college because Columbia is hella expensive and their MSTM program seems more like a random offshoot more towards older executives. \n\n1. Definitely agree with doing grad school now. I work in tech and have put off grad school for a while and don't know if I will ever do it lol. \n2. Look at the employment reports for any programs you apply to. NYU's was amazing (as you prolly know) because they placed in so many fields at so many companies. \n3. Even tho it's a Tech management degree you most likely will get like a Analyst/Consultant job. A friend I know did an MSTM at SUNY or somewhere and he worked as a Business Analyst working on requirements docs.",
              "author": "itsthekumar",
              "created": 1630633217,
              "upvotes": 2,
              "replies": {
                "hbeohph": {
                  "link": "/r/GradSchool/comments/pgjtqa/how_is_columbias_mstm_program/hbeohph/",
                  "text": "Oh, I'm from the overseas, just to put it out there.\nYeah, I understand what you're trying to say, and I cannot agree more with your reasoning.\nBased upon my own research and and opinions from various people, looks like I would drop this choice for good.\n\nAgain, thanks alot for your time and response! Choosing universities is a pretty daunting task and you really helped me a great deal with your insights. Wish I could give you an award but my broke ass...well... :') \nAnyway, sending loads of good wishes your way, thanks and have a very nice day!",
                  "author": "uchiha_shubhangi",
                  "created": 1630642695,
                  "upvotes": 1,
                  "replies": {
                    "hbepsdd": {
                      "link": "/r/GradSchool/comments/pgjtqa/how_is_columbias_mstm_program/hbepsdd/",
                      "text": "No worries! \n\nHope you have a good day as well!",
                      "author": "itsthekumar",
                      "created": 1630643447,
                      "upvotes": 2,
                      "replies": {
                        "hbeq2un": {
                          "link": "/r/GradSchool/comments/pgjtqa/how_is_columbias_mstm_program/hbeq2un/",
                          "text": "Oh and happy cake day!! :D",
                          "author": "uchiha_shubhangi",
                          "created": 1630643620,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634064773
}