{
  "sid": "pyvw9z",
  "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/",
  "title:": "How do you get by financially with one spouse in grad school and the other at home with two kids?",
  "text": "Long story short, my husband is going to grad school next fall. We will have a 3 yr old and a 1 yr old by then. I’m just new to all this and we haven’t looked too deeply into fin aid, but is that enough to live on? Or will i need to work? Doing the math, working with two kids in daycare will not bring in a ton of extra cash unless im making a ton, which I don’t know if i will! But I will obviously try my best to find a good job. I have a BA so I’m sure i can work something out but I’m still stressing. How has anyone else made this work?",
  "author": "juliaakatrinaa0507",
  "created": 1633045749,
  "updated": 1634100092,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.9,
  "comments": {
    "hex06uh": {
      "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/hex06uh/",
      "text": "Could one work in the day and the other at night? It will be stressful but thats what my parents did when I was little because we couldnt afford a sitter",
      "author": "Sriracha11235",
      "created": 1633047345,
      "upvotes": 10,
      "replies": {}
    },
    "hewyksq": {
      "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/hewyksq/",
      "text": "Does the school provide daycare? Is the program fully funded with stipend? \n\nWhen I was in my masters I was one person (with a deadbeat bf). My program was funded through a TAship and I took out loans and had a serving job to cover expenses. \n\nCan your husband reach out to current students to learn about the work/life balance?",
      "author": "lykexomigah",
      "created": 1633046546,
      "upvotes": 9,
      "replies": {}
    },
    "hexq9hf": {
      "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/hexq9hf/",
      "text": "At my school, a PhD salary will be maybe 30k a year if you are lucky. Grad school loans are usually about 20k a year for living expenses. Health insurance for a spouse and children is 8k a year. I think you should find a job. Grad school stipends/loans aren’t meant to support a family.",
      "author": "nemesisira",
      "created": 1633060332,
      "upvotes": 7,
      "replies": {}
    },
    "hexggi6": {
      "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/hexggi6/",
      "text": "Family money.\n\nLong long hours for both of you.\n\nA job that makes more than 2x daycare.\n\nA really good lottery ticket.\n\nYou get the point.  There’s no magic answer.  But I’d sure as shit give it some more thought than you currently have.  Going in blind is… a bad decision.",
      "author": "Weekly-Ad353",
      "created": 1633055241,
      "upvotes": 18,
      "replies": {
        "hexynf2": {
          "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/hexynf2/",
          "text": "Well he just barely started the process. We will definitely take the time to figure it all out. But thanks for the tips.",
          "author": "juliaakatrinaa0507",
          "created": 1633065743,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hex3icd": {
      "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/hex3icd/",
      "text": "We do a mother's day out 3 days a week. It really only lets me teach 2 of my classes on campus with 4 hours of time to work (read: people schedule more meetings for me). Most of the time, I'm home with my kids (2 and 5) and the housework and school work and teaching whe my husband works 2 jobs.\n\nI'm tired. But, I try to be efficient. I read when I wait in car rider lines. I sit outside and let me kids play while I work on papers. I stay up late occasionally. I multi-task (today I watched a documentary while I did laundry and dishes). I use voice activated software to record thoughts to turn into short papers, and my kids get screen time when I zoom into class. I never watch TV, and when my family does, I usually read or work on a paper. I always hammer out 1-2 books over breaks. I annotate well and review material as needed. \n\nAlso, to be brutally honest, my classes haven't gotten that hard or time consuming yet since I am getting a degree in a field I have been in for 10+years. And, I read fairly quickly. So, most of time goes to my kids and house, then the classes I teach, then the courses I take.",
      "author": "basicteachermom",
      "created": 1633048996,
      "upvotes": 3,
      "replies": {}
    },
    "hexhv0r": {
      "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/hexhv0r/",
      "text": "Husband has a good job and we have free daycare since grandparents live in town. I also have a fully funded PhD with a GA stipend. It's the best case scenario for us, currently. I don't know how I'd do it without grandma and grandpa. We are lucky.",
      "author": "arinko_mi",
      "created": 1633055940,
      "upvotes": 3,
      "replies": {}
    },
    "hexjrno": {
      "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/hexjrno/",
      "text": "Making it work with one kid, right now. I'm in a PhD program and my partner is a lecturer, having finished her PhD. My university offers decent funding for student parents, it covers a good portion of the cost of daycare, along with some money from a city program. You're basically at the point where you'll need to make massive use of university and government resources, from food stamps to childcare.",
      "author": "Beren87",
      "created": 1633056893,
      "upvotes": 3,
      "replies": {}
    },
    "hexzcls": {
      "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/hexzcls/",
      "text": "From people around me it's usually the student who cares a bit more for the kids while the other partner works full time, otherwise student salary is not sufficient for a family. Also, family help or low cost childcare is a most. Unless your partner has a good income as a student with many benefits/ family money/ you planned this and put money aside for this, being a stay at home parent is not very sustainable with a studying partner .",
      "author": "579red",
      "created": 1633066248,
      "upvotes": 3,
      "replies": {}
    },
    "hezqwks": {
      "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/hezqwks/",
      "text": "Is his program funded or not? Is his program in person or online? Does the school provide daycare services? If so, how much do they cost? Definitely will need more details if you want advice. You may also want to post on r/personalfinance. You will want to have a sit down with your husband and go over the nitty gritty ASAP to plan for jobs, support, daycare, applying for welfare if needed, insurance considerations, etc.",
      "author": "ioniansea",
      "created": 1633106273,
      "upvotes": 1,
      "replies": {}
    },
    "hezz5z1": {
      "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/hezz5z1/",
      "text": "Totally depends on what kind of program he's looking at. Most PhDs are funded - you don't pay much, if any, tuition and receive a stipend, but it'll be in the $15-30k  range (in the US). Master's programs are less likely to be funded through the program but they can be. You can look for fellowships (thru the school or external), but they are competitive. In general I'd say it's going to be tough to live off just his salary, assuming he has one with his program. A friend of mine supported 2 kids and her husband on her PhD stipend when he was laid off and they managed but it was extremely tough - they couldn't afford a car or much beyond basic needs. Look into all your options while applying and what kind of support each program offers",
      "author": "Unlikely-Name-4555",
      "created": 1633109824,
      "upvotes": 1,
      "replies": {}
    },
    "hf08bg2": {
      "link": "/r/GradSchool/comments/pyvw9z/how_do_you_get_by_financially_with_one_spouse_in/hf08bg2/",
      "text": "With student loans it’s possible but not fun or easy. That’s how I make it as a single mom with kids I homeschool.",
      "author": "sylphrena83",
      "created": 1633113807,
      "upvotes": 1,
      "replies": {}
    }
  }
}