{
  "sid": "q7ojkr",
  "link": "/r/GradSchool/comments/q7ojkr/is_it_acceptable_to_write_down_a_personal_reason/",
  "title:": "Is it acceptable to write down a personal reason in fellowship grant applications?",
  "text": "Hi, everyone!\n\nI'm currently applying for a university postdoc fellowship, and I have to give a reason for choosing this laboratory. Is it acceptable or is it unprofessional to write a personal reason for it? To put it bluntly, I am applying to a lab that's doing research on cardiovascular development, and I have a personal interest in this because I have a family history of cardiovascular diseases.\n\nThank you!",
  "author": "melukia",
  "created": 1634171787,
  "updated": 1634252401,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "hgjzymn": {
      "link": "/r/GradSchool/comments/q7ojkr/is_it_acceptable_to_write_down_a_personal_reason/hgjzymn/",
      "text": "That is a fine reason. Providing your larger motivations for something is really helpful.\n\nIf the *personal reason* were that you are hoping to woo one of the current postdocs in the lab, you'd want to keep that to yourself.",
      "author": "IkeRoberts",
      "created": 1634172694,
      "upvotes": 23,
      "replies": {
        "hgkbosa": {
          "link": "/r/GradSchool/comments/q7ojkr/is_it_acceptable_to_write_down_a_personal_reason/hgkbosa/",
          "text": "Haha I'd keep that in mind, lol. Thank you for your input!",
          "author": "melukia",
          "created": 1634178399,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hgk09v9": {
      "link": "/r/GradSchool/comments/q7ojkr/is_it_acceptable_to_write_down_a_personal_reason/hgk09v9/",
      "text": ">To put it bluntly, I am applying to a lab that's doing research on cardiovascular development, and I have a personal interest in this because I have a family history of cardiovascular diseases.\n\nThat's a personal reason for pursuing the broad research field, not really the lab. There are lots of labs out there doing research on cardiovascular health.\n\nI'm pretty sure the question is more about the specific resources and training opportunities that the lab would offer you.",
      "author": "aggressive-teaspoon",
      "created": 1634172843,
      "upvotes": 12,
      "replies": {
        "hgkbyud": {
          "link": "/r/GradSchool/comments/q7ojkr/is_it_acceptable_to_write_down_a_personal_reason/hgkbyud/",
          "text": ">about the specific resources and training opportunities that the lab would offer you.\n\nOf course, I would be writing that in too. I'm just wondering if adding personal motivation would be considered unprofessional. And, to add, the research goal of the lab is directly applicable to my personal condition, so it is actually quite a good fit.",
          "author": "melukia",
          "created": 1634178536,
          "upvotes": 4,
          "replies": {
            "hgm47dv": {
              "link": "/r/GradSchool/comments/q7ojkr/is_it_acceptable_to_write_down_a_personal_reason/hgm47dv/",
              "text": "I doubt it would be unprofessional, especially since it's conceptual and not wanting to bang someone in the lab. At the same time, I don't think it *helps* much. Since most fellowship applications have limited space, that should be a lower priority to include.",
              "author": "aggressive-teaspoon",
              "created": 1634221276,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgk7i2y": {
      "link": "/r/GradSchool/comments/q7ojkr/is_it_acceptable_to_write_down_a_personal_reason/hgk7i2y/",
      "text": "That's fine. I like it when someone has that extra, personal motivation.",
      "author": "fwafwa",
      "created": 1634176346,
      "upvotes": 3,
      "replies": {
        "hgkbzjq": {
          "link": "/r/GradSchool/comments/q7ojkr/is_it_acceptable_to_write_down_a_personal_reason/hgkbzjq/",
          "text": "Thank you for your input!",
          "author": "melukia",
          "created": 1634178546,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}