{
  "sid": "qwz6th",
  "link": "/r/GradSchool/comments/qwz6th/really_angry_with_myself/",
  "title:": "Really angry with myself",
  "text": "I’m six months into my PhD program (in a dual degree program MD/PhD), and had my first committee meeting, and I feel miserable. My advisor okayed my presentation but I got tripped up by some questions/criticized for knowing some details and just wasn’t able to communicate my points well. I don’t know if it’s anxiety or sleep deprivation, but I wasn’t happy with it at all.\n\nAnd I guess that’s the thing, I’m so angry with myself for not performing up to my own standards. I know I can do better - I’m the kind of person that can cram a few days before the test and do fine - but I’m not. With wfh and maybe being lonely, I really struggle to motivate myself to work; once I start, I am okay, but it’s hard to get there. I often get distracted by the internet. Or, it might be something dumb like I didn’t sleep well the night before because I didn’t eat well, which is because I was too unmotivated to prepare food. Because of this, and some family problems that ate up a solid few months, I feel like my overall knowledge is lacking. I really need and want to maximize my PhD time, but I just feel like I’m doing such a terrible job and I don’t know how to fix myself.\n\nDoes anyone have any advice? I’m feeling pretty down right now",
  "author": "Trudateu",
  "created": 1637268396,
  "updated": 1637354584,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.75,
  "comments": {
    "hl6rddz": {
      "link": "/r/GradSchool/comments/qwz6th/really_angry_with_myself/hl6rddz/",
      "text": "Just as a reality-check: you're 6 months into a years-long program. You aren't *supposed* to know all the answers, otherwise you wouldn't need to be here. You aren't *supposed* to skate through with no issues. It's a long learning process. Your committee has helped identify some areas to focus on, that's expected. Nobody is expecting you to be perfect, you shouldn't either.",
      "author": "Jwalla83",
      "created": 1637279216,
      "upvotes": 8,
      "replies": {}
    },
    "hl65beb": {
      "link": "/r/GradSchool/comments/qwz6th/really_angry_with_myself/hl65beb/",
      "text": "Yes, go outside and get some sunlight, or start taking Vitamin D regularly.\n\nAlso you will have times where you are unproductive or less productive. You can't cram for a PHd. It's a marathon. Chunk it up and find the times you are most productive in the day, then do your work then.\n\nI found I have 3-5 hours a day of high intensity focused work in me. The prime time for these hours for me has been at night. \n\nFigure this stuff out for yourself and be gentle with yourself. You can do this, but space it out more and optimize.",
      "author": "Big_Faithlessness625",
      "created": 1637269965,
      "upvotes": 5,
      "replies": {}
    },
    "hl6y8iz": {
      "link": "/r/GradSchool/comments/qwz6th/really_angry_with_myself/hl6y8iz/",
      "text": "Give yourself a break. It's a marathon, not a sprint, and we learn more from failure than from success. By all means, take care to prepare well, but it's probably impossible at this moment to have a hand on all the possible issues that might arise. \n\nWhen you find that you don't know something, make a note of it; write it down. Thank the person that suggested it. Be humble. These moments are a skillset as or more important than the actual meat of the presentation.",
      "author": "stablegenius98",
      "created": 1637282340,
      "upvotes": 1,
      "replies": {}
    }
  }
}