{
  "sid": "qg7xp2",
  "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/",
  "title:": "Do you sometimes wish your friends/ family did similar research?",
  "text": "I ask because sometimes I really want to share my work and discuss the results I'm obtaining but I don't really have anyone close to me who can relate to my work :( It'd be great to bounce ideas and generally discuss things.",
  "author": "Weekend_metalhead",
  "created": 1635259446,
  "updated": 1636198727,
  "over_18": false,
  "upvotes": 38,
  "upvote_ratio": 0.95,
  "comments": {
    "hi4csw0": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi4csw0/",
      "text": "Oh God no. I love that my friends and family do all sorts of different things, and I learn new ideas every time we get together. \n\nYou are looking for work friends. Those are great to have too.",
      "author": "public_health_nerd",
      "created": 1635259901,
      "upvotes": 53,
      "replies": {}
    },
    "hi4wpmg": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi4wpmg/",
      "text": "Absolutely not. I talk about my field enough as it is and id like to actually enjoy my time with my family. \n\nAlso look at this as an opportunity. If you can't dumb down your research enough that anyone can understand a surface level general idea then you don't understand it well enough. The better you can explain your research and why it matters in a general sense to *anyone* the better off you'll be.",
      "author": "Tcanada",
      "created": 1635267851,
      "upvotes": 16,
      "replies": {}
    },
    "hi4vz7e": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi4vz7e/",
      "text": "Your PI might be the best person to bounce ideas. You'll never find another person doing the same research as you (and if you do, you're kinda screwed, your research isn't unique and you might be scooped). Take advantage of having someone who knows your project almost as well as you do.",
      "author": "blueflovver",
      "created": 1635267564,
      "upvotes": 7,
      "replies": {}
    },
    "hi6avjr": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi6avjr/",
      "text": "No, my family would probably never stop trying to micromanage or criticize my work and they would be more pissed off than they are now.",
      "author": "NoComfortable7128",
      "created": 1635287803,
      "upvotes": 6,
      "replies": {
        "hi6j9ad": {
          "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi6j9ad/",
          "text": "Lulz",
          "author": "Pr0gr3s",
          "created": 1635291576,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hi53m2j": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi53m2j/",
      "text": "Nah. Someone I can try to explain my project to in simple terms and figure out if I can do that well is much more valuable than unsolicited advice from people I can't ignore.",
      "author": "Single_Blueberry",
      "created": 1635270564,
      "upvotes": 3,
      "replies": {}
    },
    "hi52b8u": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi52b8u/",
      "text": "I'm fortunate in that most of what I research (decision making, emotion) is stuff that people can understand, which makes it easy to talk about. Obviously they're not gonna fully grasp the stats underlying it, but the concepts are there.  \n\nI'm also pretty thankful my partner is not an academic, it reminds me that there's life outside of my work/program.",
      "author": "hooloovooblues",
      "created": 1635270051,
      "upvotes": 2,
      "replies": {}
    },
    "hi59ohx": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi59ohx/",
      "text": "My entire family is in the CS world but do different things ie some to do telecom, QA, ML/AI etc. I think it helps having people who can understand what you are doing and maybe give some ideas but ultimatly I would go crazy if they did the same thing as me. I need some separation from work otherwise it would feel like I'm doing work 100% of the time.",
      "author": "Melon_Lord_13",
      "created": 1635272961,
      "upvotes": 1,
      "replies": {}
    },
    "hi6dtmt": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi6dtmt/",
      "text": "My only friends are in my department so we all have somewhat common research",
      "author": "Sriracha11235",
      "created": 1635289108,
      "upvotes": 1,
      "replies": {}
    },
    "hi6fk5m": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi6fk5m/",
      "text": "I’m surprised to see so many no’s! I wish every time I tried to share something about my academic life I didn’t have to explain all the context surrounding it in simpler terms first, for my fam/friends to only get the jist of it. At the very least, another academic in a different field would be nice, if not in my own field. I’m with you!",
      "author": "Cubasian",
      "created": 1635289890,
      "upvotes": 1,
      "replies": {}
    },
    "hi6k69l": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi6k69l/",
      "text": "I can talk about my work with a lot of my family. Nobody is in a related field but they're smart folks.\n\nI loved talking about my work with my aunt. She was a board certified surgeon and ER physician, professor of medical ethics, and generally one of the smartest people I have ever met in any context. She would relate my focus of neuroscience with non-brain diseases in a way that was super insightful and helpful. Or she would bust out some St. Thomas Aquinas. Or Telliard. She was my role model. She passed during my first year, but she was the first person I told when I got into my program. She always wanted another doctor in the family and was willing to settle with a neuroscientist.\n\nSorry for the heavy story. She's just been on my mind today.",
      "author": "Pr0gr3s",
      "created": 1635291988,
      "upvotes": 1,
      "replies": {}
    },
    "hi6s7um": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi6s7um/",
      "text": "Sometimes I wish my family knew just a tiny bit more about what I study. I do East Asian studies and my grandfather, very smart man and has a doctorate of his own, asked me \"so do Chinese Korean and Japanese people all understand each other? Do they need actually learn the other languages?\" \n\nThat was the first time in my life I realized he didn't know everything lol",
      "author": "thelaughingmansghost",
      "created": 1635295635,
      "upvotes": 1,
      "replies": {}
    },
    "hi73epx": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi73epx/",
      "text": "It's why I go to conferences, so I can talk to like-minded people for a few days :)",
      "author": "impossible_planet",
      "created": 1635300724,
      "upvotes": 1,
      "replies": {}
    },
    "hi7ngz4": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi7ngz4/",
      "text": "Definitely not. The last thing I wanna talk about in my free time is more fuckin chemistry.",
      "author": "DikkDowg",
      "created": 1635311271,
      "upvotes": 2,
      "replies": {}
    },
    "hidk32m": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hidk32m/",
      "text": "Yes and no. I'm first gen, so for me, the negative part is that there's an aspect of my life (research, and college life in general) that the people closest to me don't understand. My field is one where I can *vaguely* tell them what I'm working on, though, and I appreciate that it lets me think about how to communicate ideas with a non-academic audience, which is important to me.\n\n\nWhat I found as I've come into grad school, though, is that those intellectually fulfilling conversations don't *need* to be with close friends and family. In fact, they may even be better when they're with someone who isn't as attached to you. For academic interests, I talk to my cohort buddy or my current supervisor, and that fills the need for intellectual engagement. Then, when I visit family, I can just enjoy our time together and appreciate what our relationship *does* give, versus what it does not give.",
      "author": "torgoboi",
      "created": 1635426454,
      "upvotes": 2,
      "replies": {}
    },
    "hi7aabn": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi7aabn/",
      "text": "My dad does, I call him literally every day about something. It’s created a deeper bond between us!",
      "author": "adorationn01",
      "created": 1635303951,
      "upvotes": 1,
      "replies": {}
    },
    "hi7p8az": {
      "link": "/r/GradSchool/comments/qg7xp2/do_you_sometimes_wish_your_friends_family_did/hi7p8az/",
      "text": "As an undergraduate, I can't speak to the graduate level. However, I find that I am very fulfilled when I talk to my family about what I have learned and how I am applying it. That is, I already have a close-knit family and I try to share as much about myself to them as I can. There are plenty of times when I have let some niche 3D modeling term like, \"parametric\" slip out and then be forced to explain what it means in detail.\n\n*If a 3D object is \"parametric\", it basically means that I am able to make it stretch and flex to my liking (often times, with nothing more than a click of the mouse)!*\n\nAs the others have said, I think it is best to look forward to explaining your research in such a way that makes sense to them and a way that makes it applicable in their lives. When I discuss my love of 3D scanning and 3D modeling, I always try to overlay how I will be implementing it into Heritage Preservation (the field I am ultimately striving towards). Then I try and illustrate what that would mean to them in terms of how they would get to enjoy our shared heritage (an ancient temple, etc.). Perhaps they could experience something I make someday through a VR experience.\n\nAdditionally, my father has been flipping houses and doing renovations for as long as I can remember. So, being able to draft plans for him using my 3D architectural drafting software is just one more way that I am able to help him while enriching my knowledge in the field.",
      "author": "Shineingrock",
      "created": 1635312453,
      "upvotes": 1,
      "replies": {}
    }
  }
}