{
  "sid": "q3otbu",
  "link": "/r/GradSchool/comments/q3otbu/mba_vs_masters_in_cs_as_a_finance_graduate/",
  "title:": "MBA vs Masters in CS as a Finance graduate",
  "text": "I'm a Finance graduate and I was thinking of doing a tech related masters like MS in Computer Science or Data science or data analytics. Would it be too hard for me considering I didnt take CS for undergraduate? Would the Masters already start at advanced topics? And how would it compare to getting an MBA in Finance or Data Science?",
  "author": "The_Evil_Panda",
  "created": 1633661557,
  "updated": 1634099836,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hft8hlt": {
      "link": "/r/GradSchool/comments/q3otbu/mba_vs_masters_in_cs_as_a_finance_graduate/hft8hlt/",
      "text": "there are bridge CS MS programs offered but you will have to take some fundamental/core courses in those programs - the ones i’ve seen offer about a year of foundation coursework then the 2 year master coursework. for non bridge programs, they will usually expect applicants to have completed certain classes. in short, you can get into MS CS programs but you’ll have to get your fundamentals first. MS DS programs tend to be cash cows from my knowledge but still look into it if you’re interested, just know most DS roles will require a PhD. I do not know much about MBA programs or Finance programs but the subject material is vastly different from CS and DS so not really comparable.\n\nEdit: what is your goal OP? you’re asking about two totally different subject matters so I am confused but if i knew more then maybe i could be more helpful",
      "author": "SnoobNoob7860",
      "created": 1633662667,
      "upvotes": 1,
      "replies": {
        "hftk0z4": {
          "link": "/r/GradSchool/comments/q3otbu/mba_vs_masters_in_cs_as_a_finance_graduate/hftk0z4/",
          "text": "Well I've been struggling to get a job in Finance because I have little job experience and didnt go to a target school so I thought an MBA would help or changing to the tech field by learning programming",
          "author": "The_Evil_Panda",
          "created": 1633669613,
          "upvotes": 1,
          "replies": {
            "hfv6zkp": {
              "link": "/r/GradSchool/comments/q3otbu/mba_vs_masters_in_cs_as_a_finance_graduate/hfv6zkp/",
              "text": "well, I actually worked within finance (internships, now i’m in tech) and getting an MBA really won’t necessarily get you in, especially without work experience - this is just what I know based on the colleagues, mentors, and friends i know in the finance industry. however, I would still look further into this because you obviously need a job but MBAs can very expensive so you can’t make that decision lightly. if you’re trying to break into the tech industry then you’ll be saddened to know a lot of people are struggling to get entry level jobs because the labor shortage within the field is mainly for experienced workers but obviously it’s not impossible to get in. since you don’t really have any background in it though, i’d suggest taking a few entry level courses before jumping into a masters (even if it’s a bridge program) because you can at least see if you like it. a lot of people declare cs majors and don’t finish them. Whichever program you decide to pursue, with the lack of experience, I’d suggest trying your best to get into a really good program - especially with the MBA - to make it easier on yourself. best of luck :)\n\nNOTE: please take this with a grain of salt as i do not know everything and can only speak on what i know from my experiences and what i’ve read/seen, definitely do your own research too :)",
              "author": "SnoobNoob7860",
              "created": 1633707974,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}