{
  "sid": "q4f683",
  "link": "/r/GradSchool/comments/q4f683/feeling_like_i_let_my_presentation_partner_down/",
  "title:": "Feeling like I let my presentation partner down",
  "text": "Just got an A- for a partner presentation that's worth 15 percent of our overall grade. I am disappointed we  didn't get a solid A because we both worked really hard and felt good after the presentation. The professor did say overall it was well done. But all of the feedback was about my portion. Most of it was stuff like good connection but wish you would have explored/explained/discussed that more or wish you would have made more of a direct link. I can't help but think my partner would have gotten a solid A or A+ if it hadn't been for me. I honestly did the best I could and I certainly did my full share of the work. The professor's criticisms were all constructive, valid and fair. I just feel like maybe the professor should have graded us separately since we divided the work in half and the feedback was not at all about my partner's section. A- is fine for me but it doesn't seem fair for my partner. Should I talk to the professor? Apologize to my partner? Anyone have a similar experience? Any advice would be appreciated. Thanks in advance.",
  "author": "ammie8",
  "created": 1633758518,
  "updated": 1634099810,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hfycv5o": {
      "link": "/r/GradSchool/comments/q4f683/feeling_like_i_let_my_presentation_partner_down/hfycv5o/",
      "text": "It seems extremely unlikely that an A- on this project is going to change their overall course grade from what it would have been if you'd gotten an A. It sounds like you got feedback you can learn from and a strong grade, count it as a win! No need to apologize.",
      "author": "static_sea",
      "created": 1633762228,
      "upvotes": 3,
      "replies": {
        "hfyd7n8": {
          "link": "/r/GradSchool/comments/q4f683/feeling_like_i_let_my_presentation_partner_down/hfyd7n8/",
          "text": "Thanks so much for this! I tend to overthink things as you could probably tell.",
          "author": "ammie8",
          "created": 1633762478,
          "upvotes": 1,
          "replies": {
            "hfyda8f": {
              "link": "/r/GradSchool/comments/q4f683/feeling_like_i_let_my_presentation_partner_down/hfyda8f/",
              "text": "I'm intimately familiar with this tendency haha",
              "author": "static_sea",
              "created": 1633762529,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hg130i0": {
      "link": "/r/GradSchool/comments/q4f683/feeling_like_i_let_my_presentation_partner_down/hg130i0/",
      "text": "I wish I could find a link to this thing I read one time, but it was about how different grad school is from any other type of schooling. I’m not sure this will be helpful advice or not but I found it comforting. \n\nA lot of people in grad school have a rude awakening because we are so used to learning in a way that tests us, and then moving onto the next thing. This is very different in grad school where the expectation is to iteratively cultivate work until it is as good as it can be, for any number of reasons. I think this is why people feel that evaluations can be more “brutal” at this level of education. You and everyone around you are there because you have proven that you can reliably do things mostly right. The idealistic pursuit is that experts are, well… just that. So critique is meant to zero in on all the little things that weren’t perfect, which allows you to account for those things in the future as you iteratively improve your work. It sounds to me like you delivered a hell of a presentation and that (just like everybody else) it wasn’t completely perfect. That can be unsettling, when you’re so passionate about your work, but you should still be proud of yourself. \n\nAs for the group grade, when academics publish collaborative work it’s on all the authors to ensure it is at the highest quality possible. Even though it’s tempting to blame yourself, it seems like this was accounted for in the grading plan. It might be that your professor also sees it as your partners fault for not catching your mistakes in the presentation. I am still a junior researcher, but I’m learning the hard way that what makes an academic great is far from perfection at the first try (to loop my initial point back in this is kind of how we are evaluated in pre-graduate education), but how well they dust themselves off and refine their initial ideas into something great. I am a random person on the internet and I’m proud of you, remember to be proud of yourself too!",
      "author": "Kingdomterror",
      "created": 1633815698,
      "upvotes": 2,
      "replies": {
        "hg14h5d": {
          "link": "/r/GradSchool/comments/q4f683/feeling_like_i_let_my_presentation_partner_down/hg14h5d/",
          "text": "Thank you so much. I can't adequately express how much your words means to me. Just thanks from all of my heart.",
          "author": "ammie8",
          "created": 1633816365,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hg1afdt": {
      "link": "/r/GradSchool/comments/q4f683/feeling_like_i_let_my_presentation_partner_down/hg1afdt/",
      "text": "I would be shocked if a single material consequence came from getting an A- instead of an A.",
      "author": "BoostMobileAlt",
      "created": 1633819180,
      "upvotes": 2,
      "replies": {}
    }
  }
}