{
  "sid": "q74gqn",
  "link": "/r/GradSchool/comments/q74gqn/do_i_include_relevant_coursework_on_my_resume_for/",
  "title:": "Do I include Relevant Coursework on my resume for Grad School Application?",
  "text": "Do I include a relevant course work section in my resume? I'm applying for a Master's program in computer science, not sure if I should include it.",
  "author": "QueefingPigeon",
  "created": 1634103138,
  "updated": 1634167922,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hggx64r": {
      "link": "/r/GradSchool/comments/q74gqn/do_i_include_relevant_coursework_on_my_resume_for/hggx64r/",
      "text": "I think if there's anything that would make you stand out then you should include it in your statement of purpose/letter of interest, but otherwise the program will be reviewing your transcript and will see the coursework you've completed there.",
      "author": "PurrPrinThom",
      "created": 1634123574,
      "upvotes": 3,
      "replies": {}
    },
    "hghan29": {
      "link": "/r/GradSchool/comments/q74gqn/do_i_include_relevant_coursework_on_my_resume_for/hghan29/",
      "text": "If you have any grad level/ advanced courses, especially in an area that you want to do research in, then include them in your resumé as well.",
      "author": "Captain_Of_All",
      "created": 1634131447,
      "upvotes": 1,
      "replies": {}
    },
    "hgix1l4": {
      "link": "/r/GradSchool/comments/q74gqn/do_i_include_relevant_coursework_on_my_resume_for/hgix1l4/",
      "text": "Keep in mind that you will usually need to include an unofficial transcript with your application, which would have that same information.\n\nThat aside, I think it can be useful in certain situations. For example, if CS wasn't your undergraduate major, then including your CS coursework can count as a relevant credential on your CV. \n\nUltimately, you will need to step back and consider if this really adds information or not.",
      "author": "aggressive-teaspoon",
      "created": 1634155394,
      "upvotes": 1,
      "replies": {}
    },
    "hggymk3": {
      "link": "/r/GradSchool/comments/q74gqn/do_i_include_relevant_coursework_on_my_resume_for/hggymk3/",
      "text": "If u have a term paper, lab project or academic project which align with ur research interest or with professor, u can mention it. Transcripts only have credit hour and grade. They don't contain projects name.",
      "author": "JulioReese",
      "created": 1634124591,
      "upvotes": 0,
      "replies": {}
    }
  }
}