{
  "sid": "pyyyrc",
  "link": "/r/GradSchool/comments/pyyyrc/how_much_does_low_gpa_in_first_2_year_matter_when/",
  "title:": "How much does low gpa in first 2 year matter when applying for grad school?",
  "text": "in my first two years tbh my grades were really bad. I had C+ in most of my courses. Luckily though I got B+/B in my economics courses and math. Second year covid happened and my grades weren't that great but I marinated B-B+ grades in my econ courses except for 2 i got C and C+. In third year my grades average is B+ I got couple A's and an A+ and in my last year I'm doing really well like A's, A+ B+ minimum.\n\nMy cumulative gpa is going to be around 3.1-3.2 but my last 60 credit hours GPA is 3.5-6+. Do I have hope in getting accepted into masters in economics or should I pursue something else realistically. I tried taking a bunch of high level calc and stats classes to show that I really want it and I even took 3 not required for bachelor's advanced econ courses in macro,micro and metrics to prove so and I got B+, A+ and B+. I'm trying my best to show desire but I look at my bad grades from first 2 years and it kind of bad",
  "author": "Sinsiski",
  "created": 1633056584,
  "updated": 1634100163,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hexjmgc": {
      "link": "/r/GradSchool/comments/pyyyrc/how_much_does_low_gpa_in_first_2_year_matter_when/hexjmgc/",
      "text": "From what I was told, the last 60 credit hours tend to hold more weight than the first 60 credit hours. Just because there's the fact that maybe you had a little too much fun your first two years but got serious and can show commitment, or its the fact you excel in curriculum that interests you but didn't care so much for GEs... I'm no admissions person but when I applied to school I was in a similar situation. Get some good letters of rec and nail your personal statement, I think you'll have a pretty good chance, and this is just my opinion as a 2nd year MS student..",
      "author": "taco___pizza",
      "created": 1633056819,
      "upvotes": 3,
      "replies": {
        "hexlncm": {
          "link": "/r/GradSchool/comments/pyyyrc/how_much_does_low_gpa_in_first_2_year_matter_when/hexlncm/",
          "text": "I have 2 letters now I'm trying to get a third do you think that's enough?",
          "author": "Sinsiski",
          "created": 1633057849,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hexo0pr": {
      "link": "/r/GradSchool/comments/pyyyrc/how_much_does_low_gpa_in_first_2_year_matter_when/hexo0pr/",
      "text": "Masters program should be a doable, but you’re gonna need to ace your way through the Masters to have any shot at PhD. They hold the undergrad gpa against you the whole way. Not impossible but you gotta work hard to rise above.",
      "author": "thiscalltoarms",
      "created": 1633059078,
      "upvotes": 1,
      "replies": {
        "hexp2xt": {
          "link": "/r/GradSchool/comments/pyyyrc/how_much_does_low_gpa_in_first_2_year_matter_when/hexp2xt/",
          "text": "Do you think it's matter of going for top 5 schools or nothing? I never understood the concept of you're not going for MA in top 5 schools then it's not worth it. Would I still be better off if I get a MA degree maybe from a top 15 school?",
          "author": "Sinsiski",
          "created": 1633059658,
          "upvotes": 1,
          "replies": {
            "heyoxq5": {
              "link": "/r/GradSchool/comments/pyyyrc/how_much_does_low_gpa_in_first_2_year_matter_when/heyoxq5/",
              "text": "Not entirely sure about econ: I do Phil of Religion / Theology / Queer Theory so a very very different field. I can just tell you my path. I got a 3.2gpa at a small school with an average reputation. Because of that, I got into an ok (read: top 25) masters program with very little financial assistance (hence, loans). My 4.0 at that school got me into my second masters program which was top 15. Jumping from a top 15 school to top 5 for a PhD was not possible. You need that top 10 or top 5 pedigree to nap the PhD at the top schools. And the difference between a top 5 and a top 15 is stipend size during the doctorate, prestige and future job prospects afterwards.",
              "author": "thiscalltoarms",
              "created": 1633087907,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "heyjr5d": {
      "link": "/r/GradSchool/comments/pyyyrc/how_much_does_low_gpa_in_first_2_year_matter_when/heyjr5d/",
      "text": "I had almost exact same numbers as you (like 2.5 first two years, 3.9 last two; my average was right around 3.2) and I got accepted to several good schools. Only one person asked me about one class (I got a D) and I simply said I was irresponsible for my first two years but realized I needed to take my work seriously, and demonstrated this in my upper level classes.",
      "author": "gradthrow59",
      "created": 1633084010,
      "upvotes": 1,
      "replies": {}
    }
  }
}