{
  "sid": "oqo9ii",
  "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/",
  "title:": "If you’re worried about your career path post-PhD",
  "text": "I used to worry a lot about what I was going to do after my PhD and whether or not there would be good career paths available. And I did not have much luck getting good information from professors about this.\n\nA recent discussion on /r/gradschool made me realize that some of what I learned while struggling with this might be useful to others. So here are some suggestions from someone who used to spend a lot of time obsessing on this stuff, but wound up deciding to stay in and graduate and am now very glad that I did:\n\n1. Pick 15-25 papers published in your field in the past 2 years, and look up where each author is and what their job title is. Not just the first and last author, the ones in the middle too. (Hint: Some middle authors may not be as easily Googled, try the staff directory at the institution they work at.) Make a list/keep track of what job titles you find.\n2. Get a list of names of people who graduated from your PhD program 6-12 years ago (long enough ago they won’t all be postdocs). If your program can’t provide this, make your own list using your university’s online repository of dissertations, or ask a librarian for help. Look up where these people are now and what their job titles are. Put in extra time and effort to find as many as possible, not just the ones who are easily-Googlable/on LinkedIn. Make a list/keep track of what job titles you find.\n3. Read Melanie Sinche’s book “Next Gen PhD”. Take the time to do the exercises and really think about your answers. I have no affiliation with her/nothing to gain from promoting her book - I’m recommending it because it really helped me and was a big part of my decision to stay and finish my PhD.\n4. Talk to people who have careers you might be interested in. Don’t call it “informational interviewing”, that’s cringe-y and awkward - tell them you’re a PhD student looking into career paths and invite them “coffee” or “Zoom coffee” to discuss their experiences with careers in your field. Ask them how they got where they are, what they like and dislike about their job, what else they would have considered doing/what other people they know wound up doing, and what advice they have for a student interested in this career path. Take notes, and type up the notes while your memory of the details is still fresh, this is information worth hanging onto long-term.\n\nA big part of what made the “PhD careers” thing so scary for me was the lack of information/the not knowing. Using these steps to go find the information I was lacking helped me **a lot** - I hope it will also be helpful to other people struggling with similar doubts. Whether you end up deciding to stay/finish or to leave, having information to base that decision on feels much, much better than just not knowing.\n\n\nFinal note: When talking to people, pay special attention to who planned out their career path and stuck to the plan, and who followed unexpected opportunities and made decisions as they went. Think about which approach you prefer - do you want to decide on/plan for a specific career, or do you just want to know whether there are good options out there and what you need to do to have those options open to you?",
  "author": "tentkeys",
  "created": 1627126340,
  "over_18": false,
  "upvotes": 635,
  "upvote_ratio": 0.99,
  "comments": {
    "h8v5idv": {
      "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h8v5idv/",
      "text": "Don’t get a PhD. Masters is good enough then build skills, don’t waste time being out of the workforce",
      "author": "Demfer",
      "created": 1628908597,
      "upvotes": 0,
      "replies": {}
    },
    "h6fn5my": {
      "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6fn5my/",
      "text": "I am dealing with a situation similar to that one. This is incredibly helpful. Thank you !",
      "author": "freeze01",
      "created": 1627181227,
      "upvotes": 1,
      "replies": {}
    },
    "h6fk2tr": {
      "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6fk2tr/",
      "text": "Also, if you are cold-emailing people to talk to, try to hit early to mid career level. They went through the experience more recently and are still motivated to help those struggling. And their inboxes aren’t as crowded with cold emails.",
      "author": "EquineSilhouette",
      "created": 1627179415,
      "upvotes": 4,
      "replies": {}
    },
    "h6emqwb": {
      "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6emqwb/",
      "text": "Having graduated a year ago, looking back the best advice I can give is to not go into a post-doc unless you're absolutely sure you want to be a professor and you see a path to professorship (i.e. you're confident there's at least 10-20 years more research that can sprout off what you're doing).\n\nMost people in my lab went straight to post-doc, going from abject poverty ($30,000/year) to barely scraping by ($60,000/year). (I live in California, so those numbers may change depending on where you are). It makes me so sad. These are smart people who are just too afraid to leave. They think it's their lot in life to study a tiny subject with little marketable value. \n\nWhy bother getting an advanced degree if you get nothing from it? Every industry job I interviewed offered over $100,000/year (assuming your doctorate is in STEM). Industry *LOVES* PhDs. I was hesitant to accept, thinking I wouldn't be good at my job because it wasn't related to my research- not true. There are a million and one tiny advantages you have over any other new hire. Just because you're the world expert in XYZ does not mean you've got no spillover skills.",
      "author": "TheNarwhaaaaal",
      "created": 1627161258,
      "upvotes": 22,
      "replies": {}
    },
    "h6e4zln": {
      "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6e4zln/",
      "text": "Great advice but I still struggle with anxiety every single day about this",
      "author": "New_Hawaialawan",
      "created": 1627152237,
      "upvotes": 5,
      "replies": {}
    },
    "h6e1m9a": {
      "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6e1m9a/",
      "text": "I attended a seminar on \"non-academic careers for psychologists\" at a conference, and that showed me the way.",
      "author": "arcadiangenesis",
      "created": 1627150570,
      "upvotes": 9,
      "replies": {
        "h6hs0rs": {
          "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6hs0rs/",
          "text": "Could you share who the speaker was? Fellow psych here",
          "author": "FrostStrikerZero",
          "created": 1627234144,
          "upvotes": 2,
          "replies": {
            "h6hud60": {
              "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6hud60/",
              "text": "There were actually three speakers representing three different fields. The one that most appealed to me was Todd Kelley from Xbox Studios User Research. His talk literally altered the course of my life because I'm now working in the field of UX Research.\n\nThe other two speakers I don't remember by name, but one of them was a Human Factors consultant from the company Exponent, and the other was an industrial psychologist from the US Navy.\n\nThis seminar was at Psychonomics 2016, btw. My favorite conferences were always Psychonomics :)",
              "author": "arcadiangenesis",
              "created": 1627235262,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h6dso1y": {
      "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6dso1y/",
      "text": "Great information! \n\nAnd yes, some people are super focused on the goal line while others let fate steer the way, and these types do tend to judge each others' style so knowing the type you are and the type the people you are getting advice from is important.",
      "author": "Plant-Outside",
      "created": 1627146217,
      "upvotes": 2,
      "replies": {}
    },
    "h6d7iwo": {
      "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6d7iwo/",
      "text": "Not sure if you’re referring to my post or not (posted this exact question about 10 hours ago), but this is really useful advice! I’ve been debating whether it’s worth it to get a PhD or stick with a master’s, and looking into what others in my area have done should help resolve some of those worries.",
      "author": "You_Stole_My_Hot_Dog",
      "created": 1627135739,
      "upvotes": 2,
      "replies": {
        "h6d9vxs": {
          "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6d9vxs/",
          "text": "Heh - nope, it wasn’t your post, it was [this one](https://www.reddit.com/r/GradSchool/comments/oqdujv/how_did_you_know_not_to_do_the_phd/). But the question seems to come up here often enough that it could have been any one of dozens of recent posts!\n\nGood luck with figuring out if a PhD will lead to someplace you want to go!!",
          "author": "tentkeys",
          "created": 1627137011,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h6d38o4": {
      "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6d38o4/",
      "text": "This is good advice. I am in a lab that specifically trains us to go into academia. I work in power systems, so we’re on the cusp of a big hiring boom in the US. I can feel it rolling in. I’m about a year away from finishing my PhD. \n\nMy advisor regrets going into academia, so I’ve been lucky to spend a lot of time tagging along on site visits to various companies to discuss projects. Every project we have funded has industry contacts (which I’m not sure is a norm), so I’m aware of the work they do. \n\nI will not feel better until I have a job offer. I have such weird impostor syndrome that no one will hire me. I need a plan lol",
      "author": "happytransformer",
      "created": 1627133289,
      "upvotes": 17,
      "replies": {}
    },
    "h6d1h3q": {
      "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6d1h3q/",
      "text": "Thanks! I'm saving this post for future reference.",
      "author": "afMunso",
      "created": 1627132204,
      "upvotes": 2,
      "replies": {}
    },
    "h6czaw5": {
      "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6czaw5/",
      "text": "Good advice. I wish I did some of this. \n\nThe tricky thing is that, in my experience job searching post-PhD, your success is very project dependent. People graduating from my lab all had wildly different experiences- One person got a job at a federal lab, another person was still a barista last time I heard. The most important thing are skills and some projects use more relevant skills than others. All of things done in academia are academic niche. Of course, anyone with a PhD is capable of learning whatever skills they need to but the reality is, most hiring managers don't look at your potential they just look at you as you are. \n\nThe catch is as a PhD student you usually don't get to pick your project.",
      "author": "throwawaygrad001",
      "created": 1627130819,
      "upvotes": 110,
      "replies": {
        "h6d2f3q": {
          "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6d2f3q/",
          "text": "Agree skills are a major part of determining what options you have. And figuring out what options you might want will help you figure out what skills you should target.\n\nDoesn’t necessarily have to be within your PhD project. When I was talking to people with “careers I might want”, statistical skills seemed to be a major thing that opened doors for them, so I’ve tried to fit in an extra class/book/Coursera course/workshop/collaboration/helping someone out with something/other department’s seminar here and there as time allowed, and have gradually become someone colleagues go to when they have statistical questions. I’m still at the postdoc stage right now and not sure how much my efforts here will pay off career-wise, but even at the postdoc level this has already opened a few doors for me.\n\nThere’s also a chance to change focus as a postdoc. Some PIs will hire you as a postdoc because your track record suggests you can learn the skills needed for the position, rather than expecting you to already have them. Then once you’ve done a postdoc involving that skill, you now credibly have that skill on paper for your next job…",
          "author": "tentkeys",
          "created": 1627132786,
          "upvotes": 29,
          "replies": {
            "h6degoo": {
              "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6degoo/",
              "text": "Agreed!\n\nI’m currently doing a computational astro project, but anyone who knows astronomers also knows that we can’t code for shit. We’re very “hacky”, so it doesn’t translate super well to industries.\n\nThe best advice I’ve gotten for moving into data science /programming / ML:\n\n1. Do a boot camp or similar. Your uni might offer residency programmes or classes for free so make the most of those before you graduate.\n\n2. Get GitHub and put some example code up there. Try making some analysis scripts for boring “normal” data like house prices or your favourite sports team. \n\n3. Try to get a job with a startup first. They’re more willing to take risks on people and the bar is lower, so it’s a much easier way to get your foot in the door. Once you’ve been working as a Machine Learning Engineer or whatever for 3 years, it doesn’t matter what your PhD was in.\n\n4. Look at job postings in the field and highlight the expected skills that you lack. Try to fit them into your PhD if you can, or otherwise showcase them on your GitHub account. If you’re doing anything vaguely computational or involving data, you can almost certainly apply ML models to some small part of it.",
              "author": "officially_anxious",
              "created": 1627139373,
              "upvotes": 23,
              "replies": {}
            },
            "h6d5xrz": {
              "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6d5xrz/",
              "text": "Yes, I think postdoc is viewed more as training still. I didn't want to do a postdoc, I wanted to go straight into industry so my experience is solely trying to get into industry/govt. \n\n> Doesn’t necessarily have to be within your PhD project...\n\nThis is what I did actually. When I got deeper into my PhD I started to feel like my research was too niche and wasn't going to cut it n the job market so I devoted a lot of time (time I probably should have spent reading papers or doing research lol) to learning R and python for data analysis. Now in my current job, I am primarily a python developer. I actually don't use anything I did during my PhD at all in my job. But I still work in a lab in a field very similar to what I did my PhD in so its all tangentially related. \n\nPivoting is a lot hard than it is made out to be though. I feel like the way people talk about it makes it seems like it is easy for people with PhDs to pivot. \"Oh with a PhD you can just pivot to data science or project management or etc.\" You *can* but once you pivot you are now competing with people whose primary background is in that field so you are automatically at a disadvantage. Having a PhD won't mean much to some people. And there's a lot of time you need to devote to learning. My PhD advisor was one of those absentee, do whatever you want just get it done kind of people so I was able to choose what I spent my time on. Other people aren't so lucky and have slave driver advisors who expect them to devote 80 hours a week to doing research and nothing else. I wouldn't have been able to get my current job if I had an advisor like that.",
              "author": "throwawaygrad001",
              "created": 1627134864,
              "upvotes": 19,
              "replies": {
                "h6d98u3": {
                  "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6d98u3/",
                  "text": "> Pivoting is a lot hard than it is made out to be though. I feel like the way people talk about it makes it seems like it is easy for people with PhDs to pivot. \"Oh with a PhD you can just pivot to data science or project management or etc.\"\n\nAmen to that. A good pivot takes a few years (at least) and a lot of work/preparation.\n\n> You can but once you pivot you are now competing with people whose primary background is in that field so you are automatically at a disadvantage. Having a PhD won't mean much to some people.\n\nDepends how far you want to pivot. There’s the kind of pivot where your background is still useful in a new way, and then there’s the kind of pivot where your background isn’t actually very useful.\n\nThe latter kind of pivot is OK if you’ve already got the PhD, but any PhD students thinking about this kind of pivot might also want to think about whether or not it’s worth it for them to finish the PhD.",
                  "author": "tentkeys",
                  "created": 1627136667,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h6cuug2": {
      "link": "/r/GradSchool/comments/oqo9ii/if_youre_worried_about_your_career_path_postphd/h6cuug2/",
      "text": "Thank you for this! I have a year left to go and am stressing about jobs. This is amazingly helpful",
      "author": "lightschangecolour",
      "created": 1627127642,
      "upvotes": 20,
      "replies": {}
    }
  },
  "updated": 1634065770
}