{
  "sid": "pfa751",
  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/",
  "title:": "Why is there such a strong pressure for people to be \"fully\" educated (ex: masters, PhD, law) by age 30?",
  "text": "Why is there such an obsession to achieve this by age 30 at the expense of gaining life and work experience, and having opportunities to develop talents and make/save money, especially when the rewards of education are less certain than they ever have been?",
  "author": "metisviking",
  "created": 1630429826,
  "over_18": false,
  "upvotes": 314,
  "upvote_ratio": 0.94,
  "comments": {
    "hdvs39m": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hdvs39m/",
      "text": "I think for me, it’s that I feel that biological clock pressure a little. I have mad respect for people who can have kids and make their programs work but I struggle with being tired constantly and can’t imagine both the exhaustion of dealing with kiddos and trying to do school. I won’t be truly financially stable until I graduate from my program and the sooner I do that, the sooner I can start paying loans and settling down a little more. I think everyone has their own timeline and there’s absolutely nothing wrong with continuing your education after 30 but I think it’s that there are often other life priorities that happen in your 30s and 40s and not everyone has the financial ability or stamina to handle the mix of both.",
      "author": "sister_of_a_foxx",
      "created": 1632339144,
      "upvotes": 1,
      "replies": {}
    },
    "hbazv3g": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hbazv3g/",
      "text": "I guess it's like a midway point before you retire. Age 1-30 is education, ages 31 - 60 work, ages 61-90 retirement. That said, I'm 27 now, I have a BS and an MS. I worked my ass off and during both of them I told myself that after I got the degree this is it, I'm done with school after this. Turns out once you're out you tend to miss it, and I can see myself taking courses and maybe going after degrees for the sake of learning way after age 30.",
      "author": "smmstv",
      "created": 1630583768,
      "upvotes": 1,
      "replies": {}
    },
    "hb7cc2b": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb7cc2b/",
      "text": "I have definitely seen this pressure.  I think you have to decide for yourself what the right path is for you.  I told myself at 25 i would go back for my masters degree but 60k in student loans had other plans.  I was pretty much forced to get experience and work my loans off if I was going to survive student loan debt.\n\nFast forward to last year(age 29) getting accepted to a masters program while working full time.  I now personally think its the best option because you can work towards your personal goals(house, debt free, etc.). While getting an education.  The big downside is you are incredibly busy.\n\nIm still open to getting a phd but i think id rather take another few years off and work, im ok with the fact that I might be around 40 by the time i start",
      "author": "t3hchanka",
      "created": 1630513222,
      "upvotes": 1,
      "replies": {}
    },
    "hb78iuw": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb78iuw/",
      "text": "I'm 38 and will be graduating with my master's degree this December.  The hardest part of the experience is not making a steady income as I did before.  Romantic relationships have also been tougher to navigate.  Should I have completed this degree earlier?  When I evaluate my life, the answer is \"no\".  I simply wasn't inspired to at the time.  When I made the choice to enroll, it was the culmination of my work experience that led me to pursue a professional master's program.",
      "author": "phosphorescent1983",
      "created": 1630511663,
      "upvotes": 1,
      "replies": {}
    },
    "hb76oeq": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb76oeq/",
      "text": "Something I think is missing in a lot of the discussion is (outdated) ideas about retirement. If you're looking to retire by 60 you *need* to be done with your education and have started to make an actual income. \n\n(family planning is definitely important too, but that seems to be heavily discussed in the top comments)",
      "author": "-jautis-",
      "created": 1630510911,
      "upvotes": 1,
      "replies": {}
    },
    "hb75xlr": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb75xlr/",
      "text": "Society, for whatever reason, tells us that if you go to college and you get a degree and you do ok or well even that you’ll walk out and get a good job. In the real world this just simply isn’t true for everyone. Sure, some will get lucky and get that dream job right away. Others will have to job hunt for months or even years to get a “real” job. \n\nThat time spent in depression and feeling useless makes a lot of people think that if they had a higher degree their situation would be different, or that they’re wasting the time they’re spending job hunting. Or if they acknowledge this before graduating they might get freaked out. And thus: more schooling.",
      "author": "Pikalover10",
      "created": 1630510612,
      "upvotes": 1,
      "replies": {}
    },
    "hb6wwh2": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6wwh2/",
      "text": "Because it takes a lot of time and money to complete grad school for terminal degrees (MD, PhD, JD, etc). \n\nMost people dont want to/have the resources/opportunity to start families at that point in their life. Being that biology isnt friendly to this entering your 30s, we want to be done and stable by that time",
      "author": "CptSmarty",
      "created": 1630506861,
      "upvotes": 1,
      "replies": {}
    },
    "hb6ln5e": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6ln5e/",
      "text": "I don’t think it’s universal. Regarding societal pressures, somehow I managed to buy a home during my PhD but that’s only because I married a successful businesswoman. There is a way…",
      "author": "geometer2015",
      "created": 1630501829,
      "upvotes": 1,
      "replies": {}
    },
    "hb6jo3a": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6jo3a/",
      "text": "I'm in STEM and there are plenty of us who aren't fully educated by 30 and there isn't any pressure.",
      "author": "kevinbsmith006",
      "created": 1630500849,
      "upvotes": 1,
      "replies": {}
    },
    "hb6ip7v": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6ip7v/",
      "text": "I’ve never felt that pressure. Hell, I didn’t even get my BS until I was 29, MA at 37. I’m just now working on a PhD at 40. Life happens at different speeds for everyone.\n\nEdit due to early morning typos.",
      "author": "brilliantcheese",
      "created": 1630500356,
      "upvotes": 1,
      "replies": {}
    },
    "hb6faf3": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6faf3/",
      "text": "My experience with grad school was there were a lot of...socially awkward people and many of them held PhD positions and were project PI's.  Some might refer to them as \"dorky\", others might call their behavior traits disgusting, but my point is as a 30+ year old, you may recognize these character defects and think negatively about them while a young person may be more tolerant of the behaviors that come with professions that entail sitting alone and reading/writing for huge amounts of time.  My least favorite colleague was one who would pick and eat her dandruff during Webcam meetings; in academia, that crap is tolerated!!!",
      "author": "murfmurf123",
      "created": 1630498501,
      "upvotes": 1,
      "replies": {}
    },
    "hb6a86f": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6a86f/",
      "text": "Personally I feel that pressure. I think it’s because people get to a point in their lives where “other things” start happening. Like marriage, babies, houses, car. And at least for me, that 30k stipend from my fellowship just doesn’t cut it anymore. It’s not enough to survive on when you have to pay for the “other things”. Like don’t get me wrong, there were lots of ramen nights in college, and now many more in grad school. But the reality is, I was 22,23 when I was doing that. I am 28 now and have a wife. It’s a bit of a different feeling not having the money to contribute to doing stuff and contributing money for eating and rent and power and internet. Your money just doesn’t go very far.\n\nThus, having the terminal degree by 30 is 100% the expectation.",
      "author": "mfs619",
      "created": 1630495394,
      "upvotes": 1,
      "replies": {}
    },
    "hb69mqk": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb69mqk/",
      "text": "2 main things imo: the information age requiring nontraditional and nonintuitive skills at the workplace, and the infinite expansion of capitalism pressuring for more job growth, but with the cost of requiring infinite specializations. And if the employer can extract work and value from you when you're fresh out of the education system and don't have a good grasp on your worth, you're easier to underpay, overwork, and not speak up.",
      "author": "JakesAHunk",
      "created": 1630494998,
      "upvotes": 1,
      "replies": {}
    },
    "hb6702r": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6702r/",
      "text": "Personally, I've lived a very challenging life since I was a kid. I want to finish all these steps at least before postdoc so that I can focus on my career before 30. I never intended to do it before 30 though so I never did it because it was expected of me, but rather that this is just how my life journey turned out to be.\n\nI think I am okay at reading, writing and synthesizing large amount of information so I am doing okay so far.",
      "author": "givemeyourdonut",
      "created": 1630493160,
      "upvotes": 1,
      "replies": {}
    },
    "hb5t3qu": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5t3qu/",
      "text": "One reason mentioned by my senior who did his phD was that you would have more time to focus on yourself and the work. Many people might have a family after 30, so it’d be harder for them to spend all their time and energy for themselves",
      "author": "sidetrack-123",
      "created": 1630481237,
      "upvotes": 1,
      "replies": {}
    },
    "hb5oifn": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5oifn/",
      "text": "Historically you could be on a reasonable career path and given your working life mostly ends at 65, stopping at 30 gives you only 35 years left. Having kids when you're older is also not good.  Today the economy is basically shot, people are going to graduate school because of career reasons not because the want to. If you look at graduates vs job openings you see there are too many people so people are trying to climb over each other to get the positions that exist, pushing up qualifications.",
      "author": "Glarkin42",
      "created": 1630477535,
      "upvotes": 4,
      "replies": {}
    },
    "hb5htr5": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5htr5/",
      "text": "So there is time to have babies.",
      "author": "no1uneed2noritenow",
      "created": 1630472756,
      "upvotes": 1,
      "replies": {}
    },
    "hb5dunf": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5dunf/",
      "text": "Most humans have 10 fingers (counting thumbs) and 30 is a multiple of 10.\n\nAs far as I’m concerned, that’s the only real significance of the number 30.\n\nSome people see it as the age at which you stop being young and “figuring things out” and should be an adult with your life figured out and kids and a mortgage and stuff. But that’s not realistic - the days of a straightforward path through life where you have one job or even one career for decades are loooong since over. Most of us will be “figuring out our next step” for our entire lives - and personally I like it that way, being stuck doing the same thing my whole life sounds excruciatingly boring.",
      "author": "tentkeys",
      "created": 1630470326,
      "upvotes": 2,
      "replies": {}
    },
    "hb5co6t": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5co6t/",
      "text": "There is?",
      "author": "esotericish",
      "created": 1630469636,
      "upvotes": 1,
      "replies": {}
    },
    "hb5a1tx": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5a1tx/",
      "text": "Haha I love your username.",
      "author": "xaxathkamu",
      "created": 1630468151,
      "upvotes": 1,
      "replies": {}
    },
    "hb56d3g": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb56d3g/",
      "text": "Personally bc I wanted my life settled in my 30s and not living on a grad stipend. Yeah the rewards are uncertain so why not do it while I have the energy to bounce back?",
      "author": "paoromatisse",
      "created": 1630466193,
      "upvotes": 2,
      "replies": {}
    },
    "hb55rpr": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb55rpr/",
      "text": "Getting a job that pays enough to live off of . . . has not worked out for me in the 12 years since I graduated with my B.A. degree. \nSo grad school seems like a good alternative when other areas of your life are not moving forward in a favorable direction.",
      "author": "ADifferentDimension",
      "created": 1630465882,
      "upvotes": 2,
      "replies": {}
    },
    "hb50zjw": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb50zjw/",
      "text": "This is a powderkeg question with multiple answers. Speaking for myself, I did get a Master's degree at age 30, but I guess it wasn't the \"right degree.\" I'm now going back for a more desirable career. Also, both my parents are educated (dad is a physician, and mother is a nurse). I don't think there is a way for me to obtain the level of education my father has, or his salary (unless I am extremely lucky). I guess 20-30 is the time where you found the \"right career\" and did the right things milestone-wise, but that never was the case for me. No spouse, no home, no assets, and so on. Sometimes you just look back and wonder \"what if.\" However, this gets you nowhere. I'm 30, and despite being \"fully educated\" by your question, the reward for that has not been favorable. And again, this is just my personal circumstances.",
      "author": "MalphasOfCrows",
      "created": 1630463494,
      "upvotes": 2,
      "replies": {}
    },
    "hb4z4yo": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4z4yo/",
      "text": "I never really felt the age pressure when I decided to do grad school. I think for my case, I was more anxious and I was coming to realize that my current degree and circumstances just weren’t cutting it. \n\nIt wasn’t so much an age thing but a “I need to do this for a better life” thing. My realization just happened before I turned 30 though.",
      "author": "Chronos2016",
      "created": 1630462601,
      "upvotes": 1,
      "replies": {}
    },
    "hb4rdzj": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4rdzj/",
      "text": "I've never heard of this pressure either.",
      "author": "svBunahobin",
      "created": 1630459047,
      "upvotes": 1,
      "replies": {}
    },
    "hb4nmkp": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4nmkp/",
      "text": "It stems from the saying \"life begins at 30\" and there is an inherent assumption that someone else is paying for your education and you are still a child until you finish.",
      "author": "Glucksburg",
      "created": 1630457313,
      "upvotes": 2,
      "replies": {}
    },
    "hb4k21o": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4k21o/",
      "text": "narrow mindedness. convention.",
      "author": "RuthlessKittyKat",
      "created": 1630455626,
      "upvotes": 0,
      "replies": {}
    },
    "hb4izun": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4izun/",
      "text": "Where? No pressure at all in my part of the world. We down under have been called 'the lucky country', i.e the combination of obscene amounts of natural resources, low population, and anglo/first-world values. High-school educated tradesmen (carpenters, plumbers, electricians etc) and those in mining industry can earn double or triple my salary as a fulltime faculty member.\n\nPerhaps this perceived pressure is more internalized and thus projected outwards? It's like a person who owns a BMW suddenly notices so many other BMWs on the road.",
      "author": "gergasi",
      "created": 1630455138,
      "upvotes": 2,
      "replies": {}
    },
    "hb4gz98": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4gz98/",
      "text": "I did't finish undergrad until I was 30 with kids. Now a masters with kids and work sucks haha.",
      "author": "never_remember_ID",
      "created": 1630454207,
      "upvotes": 7,
      "replies": {}
    },
    "hb4gn79": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4gn79/",
      "text": "I’ve never heard of the concept of “fully educated,” but if you’re getting that pressure from a job or from career mentors, then you should find some new ones. Fully educated implies that you’re somehow done. Less focus should be placed on the credential and more on learning how to be a lifelong learner. The world is moving too fast to rely on a few letters after your name on a business card to get you by. I get that some career fields require the credential… but I know many old timer doctors whose brand of practicing medicine seems very outdated; or IT staff who have MBAs in MIS and don’t know their away around the current technology landscape today. I wouldn’t get hung up on whatever perceived pressure you’re getting. Because your educational journey should be unique to your life journey, and for a lot of people, it doesn’t include the letters after the name, within some arbitrary timeframe, if at all.",
      "author": "makakilo_",
      "created": 1630454052,
      "upvotes": 1,
      "replies": {}
    },
    "hb4ggb8": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4ggb8/",
      "text": "Dunno. I'm definitely an advocate of taking time off after undergraduate. In my case, I did my undergraduate part time because I worked full time. I had a whole ass career. \n\nThe disadvantage of going to grad school in your 30s is the stress of \"retirement/savings\". But the advantage is that I do notice that I'm a lot more \"together\" then most grad students. I approach it like a job. It's also a conscious choice I made. So many students I see going to grad school and leaving after a year or never finishing because they just don't know what they want to do, and they just think it's an extension of undergraduate. Not all, but a significant amount. I also do not value my worth on this particular job. I'm doing it till the money runs out. It'll suck if the money runs out but that's life. \n\nCurrently I'm making bank because I publish tons and generally just complete all my tasks. I'm also very passionate about the work since obviously this was a life changing choice I made. All that to say I've scored some big fellowships, plus I'm already teaching. \n\nSo why delay? To avoid imposter syndrome, to not have FOMO about other career choices, to understand what it means to make your career a significant priority not in theory but in practice, to generally just know yourself (your needs, wants, expectations, limits) better, to have perspective on expectations, etc.. \n\nOnce you drop out of grad school, there's basically no going back, so I feel you should be pretty sure this is what you want. Jobs, however, you can take a few years off, change careers, try out different jobs. Of course, if your expectation is to make 100K out of undergraduate, that's unlikely. But you can still work somewhat in the field and get a sense for problems that need addressing, and whether your prospective career is a good fit for you. If you've got even entry level experience in the field, you're more likely to get accepted, more likely to get a scholarship, etc. \n\nSo this is really just if your only reason to go right out of undergraduate is \"pressure\" -- that's a terrible reason and you shouldn't do it. You will not be well-served by making a huge decision to take on all this work for usually very little pay if your only reason to go is because it feels like what is expected of you.",
      "author": "mencryforme5",
      "created": 1630453963,
      "upvotes": 2,
      "replies": {}
    },
    "hb46hap": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb46hap/",
      "text": "I didn’t go into grad school until I was 35. I’m 37 with a masters in industrial and organizational psychology. \n\nMy starting pay will be higher than someone with a bachelors and I went into grad school not just bigger salaries but better opportunities. \n\nI transitioned career focus from clinical (my background) into business. I also didn’t want to be in school so long either obtaining a PhD as a clinical psychologist. I figured if I went into a business route, I would have a title as an industrial organizational psychologists with just a masters. \n\nFurthermore, my degree alone is “gold” in a lot of organizations. My bachelors in psychology wouldn’t make me much.",
      "author": "Round-Life-1108",
      "created": 1630449409,
      "upvotes": 8,
      "replies": {}
    },
    "hb447ya": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb447ya/",
      "text": "I know for me its been a tradeoff of time spent earning money/experience vs time spent training to get a better position faster. \n\nAs i approach my 30s the need for a graduate degree has been diminishing in value as the overall money earned and experience that comes from working a steady job in my field steadily brings me to an equivalent level of expertise and earning potential. \n\nI wanted to do my PhD for years because of a goal to reach an earning potential and stable job position with more autonomy over what i do,  but as im approaching the 10 year mark of experience in my field ive become more and more competitive in a way that gives me access to those same jobs as well as giving me the background to justify being paid better. \n\nIm at an experience point that getting a masters degree wouldnt make a difference in ny ability to be hired and would cost me time and money i could otherwise spend building my life in other ways. \n\nA PhD might still give me earning potential but the payoff of spending 4-5 years underpaid for a degree is steadily turning into an overall net loss investment  for me in terms of time,  mental health,  and money.",
      "author": "LeiasBigRoundBuns",
      "created": 1630448413,
      "upvotes": 1,
      "replies": {}
    },
    "hb41cd4": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb41cd4/",
      "text": "Never heard that.... Does it depend on your field?",
      "author": "Winesday_addams",
      "created": 1630447173,
      "upvotes": 1,
      "replies": {}
    },
    "hb40ic7": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb40ic7/",
      "text": "You seem to have two questions - why do people want to go to grad school & why people want to do it by 30. \n\nThe first question is really individual, but it's required in a lot of fields - no amount of work experience replaces a PhD in academia. Doing education later often means you took a side step for work experience another field which is fine, but not something inherently good everyone needs to do. It's something to only do if that other field brings you something. \n\nAs for why people want it early, being a grad student sucks in a lot of ways. You don't have much money, you're often living with roommates, etc. People want the post education salary as soon as possible so they can enjoy themselves more and afford to have kids, care for aging family, etc.",
      "author": "mediocre-spice",
      "created": 1630446817,
      "upvotes": 6,
      "replies": {}
    },
    "hb3z1n4": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3z1n4/",
      "text": "It's just the typical age you'd be if you did schooling all the way through without stopping - and many people think that you go through school all the way and then you're done and start your life.",
      "author": "cm0011",
      "created": 1630446197,
      "upvotes": 1,
      "replies": {}
    },
    "hb3xl6x": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3xl6x/",
      "text": "If it helps, I started my Computer Science PhD at Age 29. I built a career in industry for 6 years, saved & invested money, decided it was time to do something I was passionate about. there are advantages (and disadvantages) to doing it later, AMA.",
      "author": "the_universe_is_vast",
      "created": 1630445583,
      "upvotes": 9,
      "replies": {
        "hb4haxm": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4haxm/",
          "text": "What were the three main disadvantages/advantages? Also what country did you study in? Thanks!",
          "author": "drumgrape",
          "created": 1630454359,
          "upvotes": 1,
          "replies": {
            "hb4ke30": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4ke30/",
              "text": "In the US. Advantages: my life is pretty much established. There is no spending time on trying to find myself, finding a partner, etc. That's done. I treat my PhD like a job with deliverables. Since consistency is the name of the game, it's going well. I know what I want to get out of it and I am there to get it, the PhD has 100% of my focus. Disadvantages: More constraints on my time. I am married, have kid, a house, a car, all of which requiring my time and attention in some capacity. I work 9-5 and a bit after my kid goes to bed. Weekends are weekends, I spend them with my family. Thus, I have less time than other grad students. But focus and consistency really helps because the hours I do spend on PhD work are 100% productive.",
              "author": "the_universe_is_vast",
              "created": 1630455779,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "hb3t4cg": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3t4cg/",
      "text": "I think it's less about 30 being the end-stage goal and wanting to make sure that the student was moving straight into progress. Even though a lot of us started later (I went after my AS when I was 30), the traditional thinking is to have gone straight in after high school and plugged away until you are done. Just old thinking from a traditionalist mindset that holds very little logic in this day and age. I will say that one of the other comments mentioned children and its a good point. Finishing a doctorate with a 3 year old running around the house has to be a lot harder than doing it with no kids (mad props to you parents doing this).",
      "author": "TSSki",
      "created": 1630443711,
      "upvotes": 2,
      "replies": {
        "hb40hyk": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb40hyk/",
          "text": "Yes, it is incredibly difficult to manage your time as a grad student while raising children. I just finished my MA, I can't tell you how many sleepless nights I had trying to meet deadlines or something popping up for my kids when I needed to write a paper. That is on top of working full-time to support my family. Thankfully the subject I studied was relatively easy.",
          "author": "Chataro",
          "created": 1630446813,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hb3s0yu": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3s0yu/",
      "text": "I've seen this with family too and got the whole \"it's about time you should be done with school. You're nearly 30\" thing from mom...which I had to then promptly remind her was a bit odd of a sentiment coming from someone who went back for her master's when I was in middle school and she was in her mid 40s.\n\nI think it's because socially people see your 30s as having gone into \"full\" adulthood and leaving youth behind, and they see being in school still by that point as clinging onto childhood/youth for too long or being a kind of arrested development case.",
      "author": "DoctorWatchamacallit",
      "created": 1630443264,
      "upvotes": 2,
      "replies": {}
    },
    "hb3qry5": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3qry5/",
      "text": "My neighbor just got his phd and he's over 70, it made me think about this a lot",
      "author": "shaysalterego",
      "created": 1630442765,
      "upvotes": 8,
      "replies": {}
    },
    "hb3qo44": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3qo44/",
      "text": "I was watching The Marvelous Mrs. Maisel and one of the dialogues is \"3 before 30\" which meant back in the 1950s (and like for many decades after that), women were told repeatedly they should have at least 3 kids (sometimes all their kids) before they turned 30 - and so many women did their best to have all their children before turning 30 (by then standards - the sooner the better).  If you were unmarried by 30, you were called a spinster who is unlikely to get married at all.  This is the kind of thing I can think of when I hear people say \"finish all your education by 30\". No thanks! I'm not competing with anyone...I'll do things at my own pace.",
      "author": "mstalltree",
      "created": 1630442721,
      "upvotes": 8,
      "replies": {}
    },
    "hb3opsq": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3opsq/",
      "text": "I think its just an extension of people being asked to figure things out early. When I was in high school it was \"where are you going to college?\" Then it was \"what are you majoring in?\" Then it was \"what will you do when you graduate?\" Now its \"what comes after you get your PhD?\"\n\nIt's asking the same question in different ways, in my opinion",
      "author": "philliesdude1",
      "created": 1630441940,
      "upvotes": 2,
      "replies": {}
    },
    "hb3m1fu": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3m1fu/",
      "text": "What pressure?  Are you speaking for yourself?  I don't believe this is a thing.",
      "author": "wjrasmussen",
      "created": 1630440911,
      "upvotes": 3,
      "replies": {}
    },
    "hb3jrn1": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3jrn1/",
      "text": "A lot of it is that humans live for a finite amount of time.  The earlier you finish school, the more time you have to exploit the knowledge you've learned, before it evaporates (along with everything else).\n\nAnother large part is that, as life progresses, one tends to become more encumbered.  Commitments accumulate (the classics are spouse and children, but there are others as well -- community, home, politics, career, etc.), and it becomes harder to dive into school with the same vim that you can muster straight out of college.  You can see this effect even within graduate school -- you get your classes done early, because it's hard to bring yourself to focus on problem sets when you're already probing the secrets of the Universe with your independent research (later in your Ph.D. program).\n\nFinally, on the vim topic:  people in their 20s simply have more energy than people at other (later) stages of life.  Getting the Ph.D. process out of the way early helps get a good launch.",
      "author": "drzowie",
      "created": 1630439978,
      "upvotes": 19,
      "replies": {}
    },
    "hb3j9uy": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3j9uy/",
      "text": "I haven't felt a type of \"obsession\" in my area, but personally I'd say the drive is to reach a point of freedom to really live my life while I'm still young. PhD/law/med school is incredibly time consuming no matter how good you are at maintaining balance in your life. You will sacrifice - a lot. I still maintain a lot of things that are important to me in my life (e.g., I'm a fitness instructor on the side, I workout 6 days a week for my 'me' time, I'm not willing to put school before my partner, etc.), but it's still this huge thing I'm chained to that affects my life greatly. I haven't been on a vacation the entire time, my partner and I can't make life plans beyond school with no concrete end point, I'm financially strained, and the anxiety my PhD gave me is real. I (and we) desperately want to move on with our lives and enjoy our time together while we're still young and (if we have them later) child-less.",
      "author": "Unlikely-Name-4555",
      "created": 1630439763,
      "upvotes": 3,
      "replies": {
        "hb3mpne": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3mpne/",
          "text": "I feel the same way, which is why breaks to live, stay healthy and sane, find and experience good supportive relationships, gain experience and make money/save, and create some art are important instead of 8 years straight of just schooling/debt piling. I started at age 24 and graduated with my BA 7 years later due to working through it to graduate debt free.",
          "author": "metisviking",
          "created": 1630441165,
          "upvotes": 0,
          "replies": {
            "hb4io7o": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4io7o/",
              "text": "Yeah you're not wrong. Totally up to the person what they feel is the better way to get more of that time to live for themselves. Personally if I had to drag my PhD out into my 30s I wouldn't do it (granted I already regret it now at 27 so that influences that outlook). I'd rather juggle everything for a shorter amount of time and be done. I might feel differently if I wasn't able to balance having another job and be leaving school without debt. But I can 100% understand why someone else would rather take breaks to be happier during it. Burnout is real and if it can be avoided, do whatever you need to do to avoid it",
              "author": "Unlikely-Name-4555",
              "created": 1630454989,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hb3j2ge": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3j2ge/",
      "text": "I do not think it's so much pressure to get everyone as educated as possible, but it is more \"If you want to do it, you should get it done before you are thirty.\" The argument I heard when I decided to go to graduate school was that by thirty, you are probably starting a family, career, and time is a premium.",
      "author": "noravea",
      "created": 1630439673,
      "upvotes": 5,
      "replies": {}
    },
    "hb3fv2r": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3fv2r/",
      "text": "never heard of this before.",
      "author": "isaac-get-the-golem",
      "created": 1630438303,
      "upvotes": 16,
      "replies": {}
    },
    "hb3dvww": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3dvww/",
      "text": "I think that the expectation is a relic of the past that will slowly and surely change as people from a wider range of backgrounds enter into academia and professional schools.\n\nThis is already happening in undergrad. This piece seems to link to some good resources on these trends: https://comevo.com/the-changing-student-demographics-in-2020/\n\nAs things stand, these socio-economic and racial trends are materializing more slowly in graduate and professional schools. As such, the folks in them at present will largely be those who were already predisposed to having a clear idea of a.) what they want as their future career b.) what achieving it entails c.) the confidence to dive headfirst into their training at an early age. \n\nSo many others (and I include myself in this group) may have to exist in the working world for a while to get a better idea of what’s “out there” and observe power dynamics within society and organizations. This is especially the case for folks who do not have college-educated parents. \n\nI don’t think that there is anything wrong with either path. I think that as things stand now, the number of people in the former group VASTLY outnumber the latter.",
      "author": "GOROnyanyan",
      "created": 1630437425,
      "upvotes": 9,
      "replies": {
        "hb3m73b": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3m73b/",
          "text": "I'm a first generation indigenous woman student so I'm definitely in the other group",
          "author": "metisviking",
          "created": 1630440969,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hb3daqv": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3daqv/",
      "text": "I don't see this pressure but as someone who started grad school on their 26th birthday and defended their PhD at 32, it has delayed a lot of traditional adulthood milestones. I'm just about to turn 36 and not married (though I am in a committed, but long distance relationship due to academia), nowhere near ready to buy a house, and kids are something I doubt I could ever afford with my student loans from undergrad. I'd imagine that the pressure is more about having your career established by 30 so you can do the other stuff, but a lot of people are not prepared for grad school at 21-23.",
      "author": "RoyalEagle0408",
      "created": 1630437161,
      "upvotes": 46,
      "replies": {
        "hb3jjug": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3jjug/",
          "text": "This is basically it. I’m 24, getting my bachelors at 25, starting my masters at 25 as well, finishing when I’m 27/28 depending on how long it takes. I have my bf of almost 4 years but we’re also long distance. I’m going to start my masters next year and so far the one main school I’m interested in would require us to stay long distance because he’s 100% done with school and working a full time job for a great company. We’re watching our friends get engaged, moving in together, having “normal” lives and we don’t because of me. I don’t feel bad because he could easily break up with me if he wanted too. Nothing is “keeping” us together like kids, engagement, rent, etc. I just take it one day at a time!",
          "author": "Natalie-cinco",
          "created": 1630439885,
          "upvotes": 10,
          "replies": {
            "hb3qmjc": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3qmjc/",
              "text": "It’s definitely rough! My partner is also an academic (though he is a year older, went straight to grad school, and did not have a pandemic during his post-doc, so he’s got a TT jobs so the delay for us is also me getting a permanent job near him.\n\nWatching friends get married and buy houses while I’m over here like “I only worked 60 hours this week…yay…”.",
              "author": "RoyalEagle0408",
              "created": 1630442703,
              "upvotes": 11,
              "replies": {}
            },
            "hb71cmg": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb71cmg/",
              "text": "Yup! We basically had to put a pin in our relationship too whilst I did the PhD - thankfully it's only 3 years here in the UK but it basically meant putting any further relationship milestones on hold whilst we worked on the long distance thing. Thankfully we've come through it well and are now actually starting to talk about next steps. I turn 30 next week so it'll be a while before we go through the marriage-house-kids steps.",
              "author": "ayeayefitlike",
              "created": 1630508717,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hb3r0ad": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3r0ad/",
          "text": "I can relate to this quite a bit. I started a PhD program at 26, and left it ABD at 32 when I realized I wanted to go into industry work where a PhD wasn't necessary and could even be a hindrance. (I did get a Master's along the way, which helped in the job market.)\n\nNow it's 5 years later and I'm doing fine career wise, but feel like my personal life's a bit of a mess because I missed the boat in terms of settling down with a relationship and thinking about starting a family at a normal age.\n\nI finished paying off my student loans last year, but I'm just now getting to the point where I feel comfortable starting to think about home ownership.\n\nWorking in a business setting makes it worse in some ways, too, because most people I work with hit the big life milestones on a more standard timeline, because they were making professional-level money the whole time I was being a broke grad student and figuring my life out.\n\nI didn't feel the urgency OP mentioned when I was younger, but looking back now I kind of wish I had.",
          "author": "mon_dieu",
          "created": 1630442858,
          "upvotes": 6,
          "replies": {
            "hb4lnx5": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4lnx5/",
              "text": "> industry work where a PhD wasn't necessary and could even be a hindrance\n\nCould you elaborate on this? What field is this, and how is a PhD a hindrance?",
              "author": "valryuu",
              "created": 1630456386,
              "upvotes": 3,
              "replies": {
                "hb51trk": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb51trk/",
                  "text": "My PhD program was in Psychology. I went into consumer research / Market Research. And now I've ended up in User Experience Research, which looks to have a better long-term outlook, in terms of demand/opportunities, than Market Research. And I enjoy it a lot more, to boot.\n\nThe reasons for PhDs being less desirable that I came across, back when I was initially job hunting and debating whether to stay in grad school, were mainly that business people associate PhDs with being too perfectionistic to be able to move quickly and know when a task or project is in a \"good enough\" state to wrap up. As opposed to the dreaded \"analysis paralysis,\" which is an issue wherever time and budget are critical considerations (i.e., pretty much any industry setting). There are also perceptions that PhDs will expect more pay than they're worth since they be starting with little to no applied experience.\n\nIn practice though, whether or not this is true can vary quite a bit depending on the company and the hiring manager. My impression is that big, modern tech companies (FAANG, etc.) have more of an appreciation for PhDs. But for smaller or mid-sized companies, it can vary.\n\nBear in mind that most business folks only have a bachelor's. And an MBA is the highest degree most will have. So anything more than a Master's could be overkill in some settings. Or it could even make people envious or whatever in some settings. (Again, YMMV and the context & culture matters a lot.)\n\nI can think of four friends from my program who finished their PhDs and went into industry jobs afterwards. And they're all in a fairly similar place in their careers now as me. So having the PhD didn't necessarily get them any further.\n\nOnce you get into an industry career, and work your way up within that world, your actual industry experience and skills start to matter more than your academic training in a lot of cases.\n\nI'll admit that motivated cognition played some role in my paying attention to this advice initially. I was at the end of my rope with my program when I started exploring industry careers. I just didn't have it in me to continue - mentally, financially, motivation-wise, even spiritually. I was way, way beyond burnt out. \n\nBut the additional 2-3 years of research experience I put into the program beyond my Master's still helped, in terms of giving me additional experience and skills. So it all worked out alright in the end.",
                  "author": "mon_dieu",
                  "created": 1630463900,
                  "upvotes": 3,
                  "replies": {
                    "hb7s9mv": {
                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb7s9mv/",
                      "text": "Thank you very much for your very detailed response! I'm also in Psychology and looking to end up in User Experience Research. I've heard similar things a while ago to what you explained here, and it motivated me to start preparing industry-related experience during my PhD as a pivot point as well.",
                      "author": "valryuu",
                      "created": 1630519698,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hb3d82w": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3d82w/",
      "text": "I feel this pressure. I always felt pressure that I had to have my PhD done by 30. No idea where it came from and I'm going to be like 32 when I finish so it has caused frustration.",
      "author": "Task876",
      "created": 1630437127,
      "upvotes": 1,
      "replies": {}
    },
    "hb3bgxj": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3bgxj/",
      "text": "[deleted]",
      "author": null,
      "created": 1630436332,
      "upvotes": 62,
      "replies": {
        "hb47dse": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb47dse/",
          "text": "Yep, especially if you want kids. Don’t want to be living on grad school money with kids, and delaying retirement contributions, etc.",
          "author": "applehilldal",
          "created": 1630449812,
          "upvotes": 35,
          "replies": {
            "hb49nxt": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb49nxt/",
              "text": "Lol retirement",
              "author": "RagePoop",
              "created": 1630450832,
              "upvotes": 21,
              "replies": {}
            }
          }
        },
        "hb4lyu1": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4lyu1/",
          "text": "May be idealistic of me, but if that's how your education feels, you may want to reconsider your trajectory",
          "author": "deathofamorty",
          "created": 1630456536,
          "upvotes": 1,
          "replies": {
            "hb4nmky": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4nmky/",
              "text": "No matter how much you love your field and how sure you are of it, the low salary sucks. There is nothing wrong with wanting basic things in your 20s and 30s like your own apartment, being able to take vacations, being able to have kids or help elderly family, the stability of living in one location long term.",
              "author": "mediocre-spice",
              "created": 1630457313,
              "upvotes": 20,
              "replies": {
                "hb4q3b2": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4q3b2/",
                  "text": "I wasn't at all meaning to discount the challenges. I'm in my PhD with a 1 year old, so I get all of that. But that's a far cry from putting your life on hold. \n\nYou will always have something on hold, so better to appreciate what is moving forward in your life and make sure to maintain some acceptable balance. Sometimes the appreciation to suck balance falls in the negative, but that should be pretty short term. Much shorter than the time school takes. \n\nBut that's just my opinion on a happy life. It's hard to balance blind hedonism and suffering your life away in hopes it'll payoffs",
                  "author": "deathofamorty",
                  "created": 1630458455,
                  "upvotes": 1,
                  "replies": {
                    "hb4tj2m": {
                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4tj2m/",
                      "text": "Sure yes of course you can frame it to look at the positives however you like, but fundamentally, money and time buys you freedom and both are in low supply. Committing to a long term low paid time intensive position takes a lot of choices in your life from you, more so than most jobs. It's not all bad, or even most bad, but no one would do grad school if it lasted 10 or 20 or 30 years because it involves some level of putting things on hold.",
                      "author": "mediocre-spice",
                      "created": 1630460014,
                      "upvotes": 6,
                      "replies": {
                        "hb50il4": {
                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb50il4/",
                          "text": "Why do you have to have a low paying job to go to grad school? What am I missing here? It’s late and I’m tired so be nice.",
                          "author": "TehSakaarson",
                          "created": 1630463265,
                          "upvotes": 2,
                          "replies": {
                            "hb51otg": {
                              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb51otg/",
                              "text": "A PhD is more than a full time job itself and the stipends are just enough for essentials. Lots of contracts also restrict you from having a second job, even if you have the time for it.",
                              "author": "mediocre-spice",
                              "created": 1630463835,
                              "upvotes": 9,
                              "replies": {
                                "hb52kzk": {
                                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb52kzk/",
                                  "text": "Got it. Well, hopefully I’ll finish even just my bachelor’s degree but I doubt PhD would ever be possible given family/home ownership, etc.",
                                  "author": "TehSakaarson",
                                  "created": 1630464273,
                                  "upvotes": 2,
                                  "replies": {
                                    "hb5xz7d": {
                                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5xz7d/",
                                      "text": "Come do a PhD in western Europe! We are paid ok and treated like employees. :)",
                                      "author": "opheliazzz",
                                      "created": 1630485548,
                                      "upvotes": 2,
                                      "replies": {
                                        "hb6cp41": {
                                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6cp41/",
                                          "text": "Ha, if I could I would consider it!",
                                          "author": "TehSakaarson",
                                          "created": 1630496980,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hb4nyqr": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4nyqr/",
              "text": "[deleted]",
              "author": null,
              "created": 1630457471,
              "upvotes": -1,
              "replies": {
                "hb4qjml": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4qjml/",
                  "text": "How so?\n\nThat's part of why I take that view. Why spend 6 years waiting for something you may not even want anymore by the time you are done? Better to make sure you are never on hold so you can course correct early",
                  "author": "deathofamorty",
                  "created": 1630458664,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hb3b89h": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3b89h/",
      "text": "Because a lot of people just burn out by the age of 30, so they can no longer keep up studying and working at the same time.",
      "author": "montrealbro",
      "created": 1630436222,
      "upvotes": 2,
      "replies": {}
    },
    "hb3amu7": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3amu7/",
      "text": "For me it’s that I feel like having been poor and overworked through my undergrad, being poor and overworked through grad school is just more of the same, which makes it more tolerable. My friends who didn’t go on to grad school are now enjoying the money and time that comes with a regular job and many of them who thought about going back to graduate school simply won’t because they don’t want to head back into the misery that is studentship. Once I’ve finished my schooling, I can find a job, save money consistently and start a family without worrying about how I can afford to keep all of that while also being a student.\n\nI really just don’t see the benefit to waiting. Grad school is hard and you have to slum it for the most part just to get by. I’d rather do that early on when I have fewer responsibilities and bills to pay than try to manage doing it later. The science, the self-fulfillment and the educational aspect of my career will always be there but jumping through the requisite hoops to get a PhD and be taken seriously by other scientists just seems like a young persons game.",
      "author": "WhoCaresWhyBother",
      "created": 1630435956,
      "upvotes": 54,
      "replies": {
        "hb49omt": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb49omt/",
          "text": "I agree with what you're saying overall, it is the same choice I made for myself. I didn't really think through the other side of that choice, which is that when you get out of school, you're waaaaayyyyy behind. Most of my friends are having their second kids now, living in a nice house, and taking an annual vacation... I'm 31 and finally getting around to getting some decent socks and figuring out what a 401K is. (And if you keep nagging me, you're NEVER getting grandchildren.)",
          "author": "lionlament",
          "created": 1630450840,
          "upvotes": 12,
          "replies": {}
        },
        "hb3n3b5": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3n3b5/",
          "text": "Some folks end up waiting not so much because there is a specific benefit to waiting, but because there may be factors in their lives that are less conducive to completing grad school earlier.",
          "author": "CoomassieBlue",
          "created": 1630441309,
          "upvotes": 3,
          "replies": {}
        },
        "hb52ooq": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb52ooq/",
          "text": "Yeah, slowing down that hedonic treadmill and lifestyle creep is an underappreciated benefit of doing grad school early. I'm out now and even with a relatively meager postdoc salary going back to e.g. roommates making half as much would be quite obnoxious, but after undergrad having double the stipend felt like quite the luxurious upgrade.",
          "author": "--MCMC--",
          "created": 1630464324,
          "upvotes": 3,
          "replies": {}
        },
        "hb67h7p": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb67h7p/",
          "text": "I fully agree with your comment. I myself have worked multiple jobs to keep myself afloat during my high school/undergrad years so the financial pain of grad school feels like entry level for me haha. My motivations are the same as yours.",
          "author": "givemeyourdonut",
          "created": 1630493495,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hb3929q": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3929q/",
      "text": "Weird societal pressures and expectations. I think a lot has to do with starting a family, but it's so much more common and expected to delay that or just not do it. Family takes many different forms. Everyone's on their own timelines and it's better to take your time than rush through based on some arbitrary deadline.",
      "author": "sinfonia21",
      "created": 1630435292,
      "upvotes": 7,
      "replies": {}
    },
    "hb38f09": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb38f09/",
      "text": "I think a lot of people still see 30 as an age where you need to be starting to have children IF children are something you want. A lot of people also see it as being more advantageous to have your career “figured out” before you add kids to the equation.\n\nNot that I necessarily agree with it, but I do see this with many of my friends. My parents had me at 36 (mom) and 40 (dad) though, and my sister and I are both in our 30s with no kids….so wtf do I know.",
      "author": "CoomassieBlue",
      "created": 1630435025,
      "upvotes": 136,
      "replies": {
        "hb6shuk": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6shuk/",
          "text": "Yeah, if having kids is important to you, it's pretty important to not wait until 35 to start trying. Some people get pregnant right away when they start trying, but for others it can take a year or so (depending on biology etc.), so it's best not to roll the dice and start late. All the people who say \"well I had a kid at age 37\" are the success stories, not a representative sample of how easy it actually is generally.\n\nPeople start worrying at age 30 also because of finances. Childcare costs as much as a month's rent in many places in the U.S., so it's wise to plan your career a few years in advance to make sure you'll be making enough money by the time you need childcare. And around the same time you need to start saving for retirement, kids' college funds, buying a house... It all adds up.",
          "author": "pb-pretzels",
          "created": 1630504972,
          "upvotes": 2,
          "replies": {
            "hb6swvq": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6swvq/",
              "text": "I don’t disagree with any of what you’re saying. \nThat’s why I specifically said IF kids are important to you. \n\nI have nothing against kids (I’m not one of the crazy childfree folks who loathes tiny humans, I swear) - but as I said to the other user, an increasing number of young-ish adults do not plan to have kids, so the career/life timeline based on having kids does not apply to them.",
              "author": "CoomassieBlue",
              "created": 1630505158,
              "upvotes": 1,
              "replies": {
                "hb6yl6h": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6yl6h/",
                  "text": "Oh ok, I see, I misread your intent there. I was thinking you were confused about why 30-year-olds get concerned about family planning.",
                  "author": "pb-pretzels",
                  "created": 1630507566,
                  "upvotes": 1,
                  "replies": {}
                },
                "hbb04eb": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hbb04eb/",
                  "text": "I'm starting to agree with you. I'm not a CF maniac either, but getting more degrees and pulling late nights studying feels more rewarding to me than having kids and pulling late nights trying to put them to bed.",
                  "author": "smmstv",
                  "created": 1630583916,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hb6gsqj": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6gsqj/",
          "text": "Just to confirm though, if you do want to give birth to your biological children then you probably don't want to push that much beyond 35.\n\nOnce you reach around 35 years old, you're looking at 40% of your eggs having chromosomal abnormalities. In your early 40's, it's around 75%. And there's a significantly heightened risk of complications (for the pregnant person) or disability (for the child) once you're over 40. So that's a lot of miscarriages/stillbirths to go through and I completely understand why people would be hesitant to play that game when they could avoid it. \n\nOf course you can freeze eggs or do IVF or adopt, but all are expensive. Egg freezing is the cheapest but then you need something like IVF to use them.\n\nThese problems are definitely something people should be aware of so they can make the best personal decisions in their family planning. Maybe they'll choose to have children earlier, maybe they'll freeze eggs/do IVF, maybe they'll adopt, or maybe they'll decide to live childfree. But they need all of [that info](https://www.bbc.com/future/article/20200828-how-fertility-changes-with-age-in-women). I don't want someone to *plan* to have children at 35, completely unaware of the risks, and then suffer because of it.",
          "author": "officially_anxious",
          "created": 1630499334,
          "upvotes": 1,
          "replies": {
            "hb6qsp8": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6qsp8/",
              "text": "Yes, I am definitely not saying that age isn’t a factor at all. Just that 30 still seems to be that mental tipping point for a lot of folks.\n\nI can certainly see many sides to the discussion about kids. I know folks who wanted children desperately and spent years fighting infertility - so that is definitely a consideration. Close friends spent over 7 years trying to have their daughter (and I am beyond delighted for them to have had her, she is a wonderful kiddo and they are fantastic parents). On the other hand, an increasing proportion of young people do not plan to have kids for various - in which case this career timeline based on childbearing age really isn’t super applicable.",
              "author": "CoomassieBlue",
              "created": 1630504223,
              "upvotes": 1,
              "replies": {}
            },
            "hb73pqh": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb73pqh/",
              "text": "Where are you getting the 40% number for chromosomal abnormalities? That is unusually high.",
              "author": "pavloviandogg",
              "created": 1630509701,
              "upvotes": 1,
              "replies": {
                "hb7dv9v": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb7dv9v/",
                  "text": "It's given in the link I gave:\n\n>For a woman in her 20s, a quarter of her eggs may be expected to have chromosomal abnormalities – this increases to up to 40% for a woman between 30 and 35, and “goes up simply exponentially from there on”. Beyond the age of 35, the frequency of these chromosomally abnormal eggs increases by 0.5% per month, so that for a woman in her early 40s up to three-quarters of her eggs will have chromosomal abnormalities.",
                  "author": "officially_anxious",
                  "created": 1630513843,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hb718rl": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb718rl/",
          "text": "As someone who is in that situation I believe this is true. I used to be told people accomplish most of their work/research in 20's to early 30's and thought it had something to do with being more cognitively or physically able to do the work. Now I see that was a time when one had less personal concerns and could focus on the work. Marriage, kids, mortgage, dog, lawn, neighbors, etc result in much more things to care about. Much easier to focus on science when you're single, living in an apartment, and living off of ramen and mac and cheese.",
          "author": "hdorsettcase",
          "created": 1630508673,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hb2zznx": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb2zznx/",
      "text": "You are missing an important element here, which is why people are doing grad school. It's not because of social pressure to be fully educated like you seem to think. You don't go into grad school for fun*. Grad school opens up positions and opportunities that would have been off limit or very very very hard to achieve for someone with only a bachelor unless they have years of relevant experience.  \n\nThat's the case if you want to go into an academic career, industrial R&D or any other industrial position that require a grad degree. The ''opportunities'' that you seem to think that are out there for us do not align with our interests. What you see as opportunities are not career opportunities for those who have a career goal that requires grad studies. \n\nSomeone who goes on the job market instead of directly going to grad school isn't in the wrong either. Maybe they do not know yet what they want to specialize in and prefer to discover that through a job they like. Even better, maybe their employer will even end up paying for it to promote them in a specialized position! But for those who already know they want a career in a specialized field that require grad studies, there's not really any point in taking on an unrelated job and delaying gaining valuable work experience for their future career.\n\nFor example, if your goal is to become a lawyer, you don't have much choice but go to law school no? What's the point of spending years of your life doing something you don't like that could be accessible if you get the proper education for it? Being on the job market for something that you are not interested in is not going to further your career since it doesn't align with your career goal. The only true opportunity in this scenario is to make money to afford an above-average living quality during grad school. It's not much more rewarding to do a job you don't like just for money no? And also, those years you spend on the wrong job market are years that you could be spending furthering your career in the specialized field of your choice, which is the one accessible through grad school. \n\nIt's not about the ''rewards of education'' it's about the reward of a career that is not accessible without grad degrees either because it requires research experience or to be specialized in a field.\n\nEdit: Not going to grad school for fun *does not mean* you can't have fun during grad school or enjoy it. This comment was to address the general purpose of pursuing grad school. This edit is for those who think the comment is not valid because they had fun during grad school (it's not for those who are making jokes about our awesome mental health. That's funny keep them coming)",
      "author": "methomz",
      "created": 1630431614,
      "upvotes": 186,
      "replies": {
        "hb31kfd": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb31kfd/",
          "text": "> You don't go into grad school for fun.\n\nChallenge accepted!",
          "author": "VexedCoffee",
          "created": 1630432236,
          "upvotes": 69,
          "replies": {
            "hb36135": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb36135/",
              "text": "Yeah I accepted that challenge too a while back. \n\n&#x200B;\n\n\\*Cries in PhD\\*",
              "author": "methomz",
              "created": 1630434057,
              "upvotes": 74,
              "replies": {
                "hb3asbt": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3asbt/",
                  "text": "For some of us, developing an anxiety disorder is ~fun~",
                  "author": "VexedCoffee",
                  "created": 1630436024,
                  "upvotes": 49,
                  "replies": {
                    "hb3dh14": {
                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3dh14/",
                      "text": "I joke (in that \"laugh so you don't cry\" kind of way) that in addition to a degree I also got an anxiety disorder during my PhD so it was definitely a bargain! Only cost me my late 20s/early 30s!",
                      "author": "RoyalEagle0408",
                      "created": 1630437239,
                      "upvotes": 25,
                      "replies": {
                        "hb3hoan": {
                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3hoan/",
                          "text": "When I graduate I’ll start styling myself as “*Milch Paprika*, PhD, GAD, ADHD”.",
                          "author": "Milch_und_Paprika",
                          "created": 1630439069,
                          "upvotes": 37,
                          "replies": {
                            "hb5y1dz": {
                              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5y1dz/",
                              "text": "Are you me? I definitely didn’t have anxiety before grad school. Now though, I’m still trying to push myself to see a therapist.",
                              "author": "nunya123",
                              "created": 1630485602,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "hb3zt8f": {
                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3zt8f/",
                      "text": "Good times",
                      "author": "obinaut",
                      "created": 1630446523,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hb3w62f": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3w62f/",
              "text": "I loved grad school... beats my 'normal' job (that I like too) by far",
              "author": "HappyHrHero",
              "created": 1630444986,
              "upvotes": 7,
              "replies": {}
            },
            "hb3j4iw": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3j4iw/",
              "text": "I totally did.  Some of the most fun I've ever had.",
              "author": "drzowie",
              "created": 1630439698,
              "upvotes": 12,
              "replies": {}
            }
          }
        },
        "hb3snwu": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3snwu/",
          "text": "Thank you for saying this. So many people in my life don't understand my desire to go to graduate school since getting my BA in psych. They don't understand that I literally \\*need\\* a masters degree to do what I want in life... I'm not trying to just keep going to school for the hell of it.",
          "author": "cappuccinocatt",
          "created": 1630443522,
          "upvotes": 42,
          "replies": {
            "hb3vi51": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3vi51/",
              "text": "I agree! So many people I talk to seem to disapprove of me wanting to go straight into grad school from undergrad. They're like \"don't go into grad school just yet, get a job and work first\" but none of the jobs I can do with my undergrad degree interest me and I so desperately want to go the research route. It makes so much more sense for me to do grad school right away because I know that's what I want",
              "author": "impossible_wins",
              "created": 1630444711,
              "upvotes": 17,
              "replies": {}
            },
            "hb5eodd": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5eodd/",
              "text": "bach in psych and almost done w my masters now. feel this 100%.",
              "author": "cailkin",
              "created": 1630470820,
              "upvotes": 2,
              "replies": {}
            },
            "hb462z7": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb462z7/",
              "text": "Social work right here, and grad school is no joke",
              "author": "jenkneefur28",
              "created": 1630449232,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hb3tmwq": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3tmwq/",
          "text": ">You don't go into grad school for fun\n\nSpeak for yourself. I'm having fun!",
          "author": "I-Am-Uncreative",
          "created": 1630443927,
          "upvotes": 7,
          "replies": {
            "hb3tv39": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3tv39/",
              "text": "But did you go just to have fun?",
              "author": "methomz",
              "created": 1630444020,
              "upvotes": 7,
              "replies": {
                "hb3uioj": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3uioj/",
                  "text": "No, I went because I love computers!",
                  "author": "I-Am-Uncreative",
                  "created": 1630444294,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "hb55o3t": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb55o3t/",
          "text": "Idk I went to grad school because I had fun doing research with professors in undergrad. I still have fun, and I'm close to the end. My goal was industry R&D from day one and I chose an advisor that was more than open to that, but had collaborations with, and since then I've worked on some really interesting stuff relevant to ongoing projects.",
          "author": "eng2016a",
          "created": 1630465831,
          "upvotes": 3,
          "replies": {
            "hb57rrv": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb57rrv/",
              "text": "But again, did you really go to grad school for 5-7 years just for fun or because your goal was to go into industrial R&D, which requires grad school? Fun can be a side motivation for some but I do not believe it's a logical reason to stay in school for 5-7 years.\n\nYou can have fun in gradschool. That's not what the comment said. Grad school is such a commitment that you need a purpose for doing it and just \"for fun\" meaning not for you career in any ways, doesn't make much sense. It was to point out to OP that it's not because of a social pressure that we go to grad school and decide not to delay it, it's because we need it. It was to point out there is a reason that they didn't think through before asking this question.",
              "author": "methomz",
              "created": 1630466930,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "hb7hpq5": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb7hpq5/",
          "text": "One thing I will say is that it’s not entirely apparent to me that you can’t get to the same position as a recent PhD graduate if you just skipped the two gap years in a research assistant / lab tech role (that many life sciences programs more or less seem to require these days), the 6ish year PhD, and the 3 year postdoc (that many employers in life sciences now unofficially require irrespective of academic or industry track) - and instead just went straight into industry right after college.\n\nTaking the latter track, we are talking about over a decade of work experience where starting salaries are around $60K/yr. I seriously question anyone that says you can’t make as much in industry as a recent postdoc within the time span that getting all of that education requires… which shows the dismal value society places on the enormous time investment of our scientists and the huge financial trade-offs they make to achieve that. Sure you probably won’t be a researcher without the PhD, but let’s be honest: the people that control the flow of money are the ones making the money. So despite more education, more credentials, more working hours invested, etc… the managers will almost always make more than the scientists (generally speaking). The sooner you realize this, the better you will be able to weigh the pros and cons of grad school.\n\nNow this does not take into account the possibility of managers themselves being sourced from the PhD population. I don’t personally think this is likely though as financial know-how doesn’t overlap too well with basic science/ wet lab knowledge. I could be wrong. A decent counterpoint to this thesis might be that nearly all leaders of biotech have either a PhD or MD.\n\nMy point is that if you care about making money, you may just want to go into industry, get them to pay for a masters, and then go into management in the field of your actual interest. Otherwise you might end up quite resentful after spending so much time pursuing the highest degree available and sacrificing so much for it, only for the rewards to be lacking when compared to the alternatives and the lifestyles those people had and continue to maintain during all that time.\n\nBarring society valuing PhDs higher, I’m not particularly bullish on the US science job market (in terms of pay) over the next 10 years or so.",
          "author": "TheWiseGrasshopper",
          "created": 1630515387,
          "upvotes": 1,
          "replies": {
            "hb7pt1w": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb7pt1w/",
              "text": ">One thing I will say is that it’s not entirely apparent to me that you can’t get to the same position as a recent PhD graduate \n\nSome positions require specialized knowledge that you will not be taught about during your undergrad and are not likely to learn about while you are working on something else. Other positions require research experience for R&D. These things can't be acquired without grad school. Many industries have research centres established on universities campuses where they do research projects in collaboration with the school and recruit the PhD students from there. \n\n> the two gap years in a research assistant / lab tech role (that many life sciences programs more or less seem to require these days), the 6ish year PhD, and the 3 year postdoc (that many employers in life sciences now unofficially require irrespective of academic or industry track)\n\nI am not in social sciences (if that's what you mean by life science - correct me if not English is my second language), but in STEM, having a postdoc can actually negatively impact your chances of working in the industry because they often consider you are too academic-focused and might not adapt well. Also, in many fields, you absolutely do not need to have any research/assistant or lab tech role related to academia as you would be seen again too ''academic-oriented''.  Having a PhD if you have no intention of using it in the industry can also affect you negatively as well as many will deem you overqualified. I am not sure which field you are in that would have so many academic requirements for a non-academic job, but I can assure you it's not a generalized experience. \n\n>Taking the latter track, we are talking about over a decade of work experience where starting salaries are around $60K/yr. \n\nMany positions will accept either a bachelor, master or PhD. However, you are forgetting that they will adjust the years of work experience that you need to apply. The entry-level positions that require a PhD are not entry-level positions for those who have a bachelor or master.  For example, here is what I have seen: ''A bachelor degree with 6 years of experience, master degree with 3 years of experience or a PhD with 0-1 year of experience''.   So while it is possible for someone with a bachelor to get a position that is also offered to people with a PhD, they would often need years of work experience to compensate, which are equal to if not greater than the years you would be spending in school. Unfortunately, unless you are an exceptional candidate and were able to accumulate formally the specialized knowledge somehow, the PhD applicants will be the stronger applicants and the job will likely be going to them or to people with a master. Having work experience to qualify for a PhD position is one thing. Having the necessary specialized knowledge, relevant experience, research experience and other requirements to hold a position is a whole other thing. \n\nWhen doing a PhD, you also need to see beyond the level-entry salary.  There are different reasons to do a PhD and money shouldn't be one since, in the first years, the difference can be close to none in some fields. You have to consider that there might be a soft progression cap at some point in your career that will prevent you from making a higher salary or progressing in your role without a graduate degree. So the starting salary is not necessarily a good indicator of career success or opportunities. I must say that the number indicated is pretty low for my field, usually, that's the starting salary without a PhD, so this might just apply to your field.\n\nOverall, I think your comment is very specific to your field. So your first statement (1 quote of my comment) might be true, but applied to your field only. Generalizing it wouldn't be adequate. That's what OP did, they generalized their situation (changing career to do law school) to everyone in grad school. Yes, exceptions exist, but let's not make a rule out of our own experience. \n\nI was in a situation where I wanted to access a certain position and my employer literally sent me away overseas to do a PhD so I can come back and get it. I skipped the master and went directly to the PhD outside of the US (so no master requirements), so in my case, it will take me 3 years of additional school to achieve the positions that I want. I could take my example to contradict your time frame of 6+ years, but I know many here are from the US so it would be useless to do that.  I have also never mentioned the possibility of doing a sponsored PhD after being in the industry for 1-2 years (Just to show you that I also respect my rule of not making an exception out of my own experience).",
              "author": "methomz",
              "created": 1630518692,
              "upvotes": 3,
              "replies": {
                "hb88dnb": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb88dnb/",
                  "text": "Life sciences is an umbrella term which refers to everything related to biology (e.g. pulmonology, osteology, cardiology, neuroscience, regenerative medicine, immunology, genetics, etc.).\n\nI’m applying to neuroscience and the field is so competitive that PhD programs basically require all applying candidates to have a research assistant position after graduating from college, largely irrespective of whether the applicants did research in their undergrad. I’ve been told by the postdocs within my current lab (of which there are about 15) that biotech heavily favors those with postdoctoral work… which makes intuitive sense to me considering the vast overproduction of biological PhDs within the US.\n\nI guess I’m just fatigued with the application process (completely struck out last year and now carry an inferiority complex do to that and my full year of unemployment just to find a research assistant job, which ended up not even being in my field of study) and demoralized by seeing nearly all my peers make significantly more than me, with better benefits, less hours, and often less responsibility. So while they are already doing glamorous stuff worthy of Instagram, I’m over here committing to around a decade of poverty-level wages (locally defined by the cost of living). Under those circumstances, it’s quite hard not to be resentful and question literally every career decision you’ve ever made. All of which is making me wonder whether I’ll actually be happy pursing the thing I’m intellectually interested in if the pay for that will always be lower than my less educated peers. I don’t have a good answer to that at the moment, but for the time being I am somewhat willing to roll the dice.",
                  "author": "TheWiseGrasshopper",
                  "created": 1630526275,
                  "upvotes": 1,
                  "replies": {
                    "hbb1mwy": {
                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hbb1mwy/",
                      "text": "Yeah both of these people seemed to miss that it's highly field and subfield - specific",
                      "author": "smmstv",
                      "created": 1630584773,
                      "upvotes": 1,
                      "replies": {
                        "hbbk5gw": {
                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hbbk5gw/",
                          "text": "I’m speaking about the finances of the two paths, not whether you’ll be able to make it to the identical end job (which is unlikely).",
                          "author": "TheWiseGrasshopper",
                          "created": 1630593405,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hbb1a12": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hbb1a12/",
              "text": "I'm going to chime in here - I went right from undergrad to a full time job, started working on my MS part time that they paid for while working full time, all the while saving and investing money. I then got promoted after I got the MS. I was curious as to what my financial situation would look like if I instead went into a PhD program full time right after undergrad. When I got out, I'd probably be making a bit more than I am now with an MS, but probably not enough more to offset the 4-6 year opportunity cost of that degree. Especially when you consider the compound growth of my investments in the early years of my career, it doesn't seem likely to me that the increased earnings of holding a PhD would ever offset the head start I got with working + MS. However this did require me to both be in the advantageous position of having enough money left over to invest and actually doing it.\n\nObviously doing a PhD is about more than just money, but some people,  especially those outside of academia, seem to think it's a ticket to riches and that's simply not the case.\n\nI do want to say one thing though - the \"just get a job and get someone to pay for your masters\" is getting less realistic each year. I'm seeing a lot of companies reducing or even axing the benefit altogether. Not to mention that getting one of these positions is challenging in the first place, especially if you're considering a grad degree because you can't get hired.",
              "author": "smmstv",
              "created": 1630584574,
              "upvotes": 2,
              "replies": {
                "hbbgzq2": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hbbgzq2/",
                  "text": "That’s exactly what I mean! I’ll concede that the two options (PhD vs straight to industry after college and then do a masters) will result in vastly different career tracks. The former will likely result in a Senior Scientist position, while the latter will likely result in getting pushed into management.\n\nPoint being, I’m doing a cost/benefit analysis looking very specifically at the finances of it all. I’m presently in a research assistant role juggling 3 separate research projects, making $40K/yr with few benefits, and working a 60hr/wk. Even without hypothetical overtime pay, just looking at weekly pay divided by weekly hours, I’m making under my state’s minimum wage. Target cashiers make more than me on an adjusted hourly basis. \n\nNotably, lab tech jobs in industry start at around $60K/yr for new college grads - somehow inexplicably above what even postdocs are paid in academia. But here the thing: no one recently graduated and seeking a PhD in the near term can really take these roles for gap year jobs (academia is the best predictor of success in academia, and industry often has NDAs which greatly complicate grad school applications). This reality is utterly infuriating to me.\n\nConservatively I’ll estimate: 2 years as a research assistant @ 40k + 6 years of PhD @ 40K (being generous here) + 4 years of postdoc @ 50K = $520K in 12 years.\n\nNow let’s assume you instead go straight into industry and never get promoted. You’ll make $200K more over the same period - and that’s without any promotions or pay raises!! It’s also disregarding potential gains due to investment of that difference.\n\nThis is why it’s unclear to me that the PhD will be able to catch up financially to the person that just went straight to industry. Functionally what this means is that America significantly undervalues the time investment of PhDs… Or does anyone here want to argue that those who have sacrificed a decade of their life to getting the highest degree and becoming an expert deserve to be paid less than those with less education and expertise?\n\nSure a PhD will likely confer higher employment guarantees, but along a financial basis I’m really struggling to justify why I should pursue that route. PhDs might have a higher ceiling salary, but on average over the long haul I’d argue most will be lucky to meet parity with their non-PhD industry counterparts.",
                  "author": "TheWiseGrasshopper",
                  "created": 1630592078,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hb67bef": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb67bef/",
          "text": "Agreed. I'm not done with grad school but I get to work for a few hours a week and focus on grad school. The pay I receive for those few hours, others with no grad degree would probably have to work a week to get the same pay.",
          "author": "givemeyourdonut",
          "created": 1630493382,
          "upvotes": 1,
          "replies": {}
        },
        "hb6zyie": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6zyie/",
          "text": ">You don't go into grad school for fun\n\nMeh, I did. I just enjoy research, and had tried a few different full time jobs and hated them. Very aware the chances of getting a job in research are close to nothing, only made worse by massive funding cuts here due to COVID and Brexit and the fact that I'm fairly limited in where I'm willing to be based thanks to my partner. So yeah, came into the PhD with the attitude of enjoying myself working on a large research project of my own that I may never get to do again.",
          "author": "ayeayefitlike",
          "created": 1630508136,
          "upvotes": 1,
          "replies": {}
        },
        "hb313e1": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb313e1/",
          "text": "I'd be waiting to go, to get a break, save money, and work on creative writing because I want to be an author too. I don't see how I'd gain personally from rushing into law school. Only professionally.",
          "author": "metisviking",
          "created": 1630432047,
          "upvotes": -20,
          "replies": {
            "hb34c25": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb34c25/",
              "text": "So you have 2 career goals in 2 different fields. One you are trying to fulfil before the other and that's ok. However, the question you asked wouldn't apply to you since it's reasonable to expect someone to work in a different field before deciding to change fields. You are looking at pursuing a professional degree, which in countries outside the US is an undergrad degree. It's a different situation that is hard to compare with non-professional degrees.\n\nThose who are pursuing grad school (non-professional) after their bachelor want to achieve a single career goal within the same field or similar field, which is only available through grad studies. They do not have a different career goal prior to grad studies vs after grad studies. Someone can have a career goal and decide later in their career they are not entirely satisfied and want to move to another area that requires a grad degree. But if you already know what you want and that it requires a grad degree and that it's only in a single field, then you can't really come up with a different career goal within the same field that would feel as rewarding. What would be the point of staying besides money? In your case, you have 2 fields where you can have 2 career goals, so no need to rush achieving your second one by 30, I agree.\n\nFor example, I am an engineer and need a PhD if I want to be considered for the industrial R&D position that I want. I would still be working in engineering with my PhD, but I would not be progressing in a mechanical engineering role. I would be progressing in a research role that has different opportunities and is a different career path within engineering. So my career goal in the engineering field requires a grad degree. Otherwise, I am gaining work experience that wouldn't be so relevant to my future area of work within engineering. And unlike you, I can't spend time working towards a career goal within engineering that wouldn't require a grad degree since that would be wasting my time career-wise unless it's just for the money.\n\nWhere I am from, law school is an undergrad degree. Pretty much only in the US it's a grad degree. So from my point of view, to do what you are looking at doing you would need to have done 2 separate undergrad degrees instead of a grad degree + undergrad. That's an unusual situation that doesn't apply to most. So from a perspective outside the US, your situation is not really comparable to others who are going for non-professional master and PhD. Motivations are different, the career path is different and education background is different too. Your question is well-targeted towards professional degrees in the US tho.",
              "author": "methomz",
              "created": 1630433353,
              "upvotes": 30,
              "replies": {}
            },
            "hb3tl1l": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3tl1l/",
              "text": "> expense of gaining life and work experience, and having opportunities to develop talents and make/save money\n\n> to get a break, save money, and work on creative writing\n\nYah you're right that graduate school comes at the cost of lowered income but you lost me when you said you want to work on your creative writing. \n\nI mean by going to graduate school instead of taking a break and working on creative writing you gain more work experience, still develop your talents, and 95% of the time make more money then a writer. You're getting downvoted because your comment makes zero sense with the background given in your post. Beyond that if you're 100% going to be a lawyer why delay it? \n\nAlso you can absorb a income loss at the age of 21. Starting law school or a PhD program at the age of 30 is much harder when you have to think about a family.\n\n> rewards of education are less certain than they ever have been?\n\nThis sounds like you don't know if you should go to higher education. Because even if you delay higher education this will still be true.",
              "author": "Try_Not_To_Comment",
              "created": 1630443905,
              "upvotes": 8,
              "replies": {}
            },
            "hb40q1t": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb40q1t/",
              "text": "Then don't go? There's no reason you have to do it early. Most people just would rather have the extra personal time after when they're making a good salary rather than before.",
              "author": "mediocre-spice",
              "created": 1630446908,
              "upvotes": 5,
              "replies": {
                "hb4kl01": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4kl01/",
                  "text": "Yeah, but what about all the years that I WASN'T developing my skill set as a writer? Do people think you can just sit down and perfect at it without putting time in throughout your life? It takes revisiting many times throughout your life to keep the skill fresh and you have to build a portfolio of projects over time.",
                  "author": "metisviking",
                  "created": 1630455874,
                  "upvotes": -7,
                  "replies": {
                    "hb4vrey": {
                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4vrey/",
                      "text": "I also enjoy writing. Unless you're independently wealthy, it's a bad idea to put another career on hold to be a writer. Majority of people don't make money writing, and majority of published authors are in their late 20s and above because that's how long it takes to develop the skill. \n\nPersonally, I just completed a grad degree and wrote almost daily. It was a stress reliever for me, especially with covid. I completed two novels and am now in the editing process. My friend who prefers writing fanfiction wrote throughout her law degree. You can absolutely do both, though obviously the expensive advanced schooling and any jobs you have come first.",
                      "author": "era626",
                      "created": 1630461027,
                      "upvotes": 8,
                      "replies": {
                        "hb5drnm": {
                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5drnm/",
                          "text": "I already have a good job after getting my BA. Why is everyone acting like I'm making minimum wage. My entire goal of getting my BA was to have a basic way to support myself and writing if I wanted to (but it's not all I want to achieve in life)\n\nI went to school full time and worked throughout most of my BA, and wrote journal/poetry style, but never actual written works that took weeks to write. I have no drive for that while I'm putting everything into school and general life balance/relationships. I've been writing since I was 15, but off and on throughout life. I have a few short stories and hundreds of poems, nothing published though. I really need to go through all my stuff and write more stories",
                          "author": "metisviking",
                          "created": 1630470276,
                          "upvotes": 1,
                          "replies": {
                            "hb6bq72": {
                              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6bq72/",
                              "text": "You said you were focusing on your creative writing, not writing in the side. Maybe if you were more clear about your situation, people wouldn't have assumed something based on the information you provided.\n\nYou likely got worse at writing during undergrad since you weren't practicing it. While I took a bit of a break after high school on novels because I'd just finished two, I kept writing and my edits/redrafts were far stronger for the novel I decided to pursue farther. If you find more technical and analytical writing to worsen your creative writing, your creative writing is also likely weak. These other skills should make you stronger.\n\nThe novel-writing process is not easy nor fast. It is not about some creative muse, but pure persistence. You will go through several edits AFTER you finish your novel before you have something to send in. You must understand plot and many other mechanics. Then you'll still have edits from your publisher. If your only motivation is the creativity, and you believe anything technical dimishes your writing, you'll lose interest long before you get there.",
                              "author": "era626",
                              "created": 1630496370,
                              "upvotes": 1,
                              "replies": {
                                "hb6mrsz": {
                                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6mrsz/",
                                  "text": "This post isn't really about my situation per se, but people could also quit with the assumptions and ask questions too if I've not offered information they're focused on.\n\nNo offense but everyone is different. Analytical writing doesn't have much of a place in my creative writing style. Yes, I assume writing a novel would take planning and persistence but it's not something I've tried to do as of yet. I do short stories for now.",
                                  "author": "metisviking",
                                  "created": 1630502375,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hb4m9p5": {
                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4m9p5/",
                      "text": "I don't get your point here... People don't go to law school because they don't think writing is a time intensive career. They go because they only want to be lawyers or because they value the money/stability of law and want to focus on that first before anything else. It's common in law to work in law for awhile then do something else after. You're allowed to look at the same trade offs and make different decisions. You don't have to go by age 30 or 40 or 50 or ever. But the downside is you don't get the higher salary until that age.",
                      "author": "mediocre-spice",
                      "created": 1630456678,
                      "upvotes": 4,
                      "replies": {
                        "hb4qhf2": {
                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4qhf2/",
                          "text": "I want to be lawyer and a creative writer. The only way I can do both is by putting time into both throughout my life. I finished my undergrad to prepare for law, now it's time to save money while I have a fairly decent job and get some creative work done before I'm not able to for awhile. It feels sensible to me but it doesn't mean I don't deal with the feeling I'm behind in life because I've got two competing career goals to balance.\n\nI feel like people discount the artistic inspiration of youth and ideas as they arise. It's important to leave time to embrace these ideas and develop them as they arise, instead of looking at writing as a \"future\" activity - that's how people never actually end up putting the time in.",
                          "author": "metisviking",
                          "created": 1630458636,
                          "upvotes": -2,
                          "replies": {
                            "hb4rm8y": {
                              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4rm8y/",
                              "text": "There's no rules to any of this. People get to build their own lives and make their own priorities, year by year. Everyone has different wants and needs and priorities. Lots of people want to delay one thing to prioritize another or are happy coming and going from a certain passion in different seasons of their life. You seem to be operating from this framework that people are just going to grad/law/professional school in their 20s because they're caving to societal pressure when the reality is people just want different things than you do and are weighing the trade offs differently.",
                              "author": "mediocre-spice",
                              "created": 1630459150,
                              "upvotes": 4,
                              "replies": {
                                "hb5glzy": {
                                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5glzy/",
                                  "text": "I see your point, but many feel the pressure is real or part of the culture",
                                  "author": "metisviking",
                                  "created": 1630471998,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hb3ie3o": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3ie3o/",
              "text": "You sound obtuse and naive. I wouldnt read anything from you lol.",
              "author": "articlesarestupid",
              "created": 1630439380,
              "upvotes": -6,
              "replies": {
                "hb3m9of": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3m9of/",
                  "text": "Why exactly do you say that?",
                  "author": "metisviking",
                  "created": 1630440996,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "hb3mdhn": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3mdhn/",
              "text": "Why are people down voting this? What's wrong with my life plan",
              "author": "metisviking",
              "created": 1630441035,
              "upvotes": -12,
              "replies": {
                "hb3solu": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb3solu/",
                  "text": "I didn't, but I would guess it's because, in your post, you are questioning other people's life choices internally comparing them to yours thinking you are in a similar situation, but in that comment, you clearly show it's not even comparable. The best comparison I can find is this:\n\nYou, part of 10% of the population living in a city\\*: Why are people even buying cars? I take public transportation every day and it works for me and is better for the environment. Are they socially pressured to do like everyone and have a car?\n\nThe people you are talking about: \\*\\*Literally live in a rural area with no public transportation 40km  from the city and hospital\\*\\*\n\n(\\*not factual, just to represent that not many people globally have to do grad studies for law school, hence have literally the opportunity of 2 career goals)\n\nSee how that sounds weird and unaware that living in the city is the exception, not the norm? To me, your comment shows you are a bit out of touch with the reality of the majority and are in an exceptional situation. I mean who has 2 different career goals? Anyways That would be my guess but maybe there's another reason.\n\nOr maybe it's because you said you don't see what you would gain from ''rushing'' to become a lawyer, which from your point of view is fine but many others might not agree. You would have a significantly higher salary way sooner. The time you are currently spending away from grad school is less money in your pockets, which was the argument you used to justify not going to grad school. Personally, you would be able to establish yourself way sooner and would be able to start a family if you want to in better financial conditions and with better chances of having a baby (over 30 becomes harder apparently)",
                  "author": "methomz",
                  "created": 1630443530,
                  "upvotes": 14,
                  "replies": {
                    "hb4josh": {
                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4josh/",
                      "text": "Anyone who wants to be a writer has to have 2 different career goals, or starve literally/figuratively writing things they hate writing for a living.\n\nThere's something to be said about developing my writing after I worked my ass off to get a BA Hons and finish debt free before I delve into something that will constrain the time I have available and shape the linguistic part of my brain in unforeseen ways.\n\nIt's not just about a salary or a race to get the highest one possible. It's about developing my artistic skills and portfolio in a world where I need a day job to achieve that goal comfortably and with any degree of creative control.",
                      "author": "metisviking",
                      "created": 1630455460,
                      "upvotes": -2,
                      "replies": {
                        "hb4o3bc": {
                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4o3bc/",
                          "text": "You don't have to justify to me why you have 2 career goals. That's not the point. The issue is that your situation is not the norm and it's wrong for you to think it could apply to everyone else without considering basic things such as careers that literally require a grad degree.\nYou are the one who keeps talking about money and work opportunities. That's the 2 reasons out of 3 that you gave. So if not going to grad school is not about that anymore, what is it then?\n\nAlso, you try to use your situation as a supporting example of your post, but it really doesn't help. It's doing the opposite.  If you need an unrelated day job to make your first career goal achievable, then why are you talking about work opportunities, money/saving opportunities as being advantages of not going to grad school? No offense, but you are a walking proof that it's not, you are working a part time job to survive until you can become a lawyer. You talk about having free time to write, but that's literally not what is going on because of your day job. If you would be in grad school part time, you could be working on your artistic skills part time just like you are doing with your day job right now. Grad school is also usually funded. So your situation does not support your arguments in favor of not going directly to grad school.  Your arguments are targeted towards professional degrees, which the majority of us are not pursuing here. Your question targets the wrong audience and your argument do not make sense for that audience either. That's why you are being downvoted.",
                          "author": "methomz",
                          "created": 1630457530,
                          "upvotes": 6,
                          "replies": {
                            "hb4rn8b": {
                              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4rn8b/",
                              "text": "I gave more than 3 reasons for waiting - life experience, work experience, making/saving money, developing talents/hobbies/artistic career goals. \n\nI'm working a full time job and a part time job right now and making a pension. The position is temporary but further opportunity exists. When you're developing two simultaneous career pursuits in life, how does work experience ever not matter? Do you think artistic people don't care about professional development outside of the artistic career goals they have? That simply doesn't make sense in today's world, especially for writers. My day job is a good job and is a great starting point in life, and I'm committed to developing it regardless, because good experience is good experience period. It's not like I'm working at Star bucks. Yet I find time to write on evenings and weekends. I don't know why this is so incoherent to you.\n\nI don't want to go to grad school, I want to go to law school. Even if I went part time to either, higher education takes all of one's thoughts throughout most of any day. It simply isn't conducive to producing art at all unless its what you're studying.",
                              "author": "metisviking",
                              "created": 1630459161,
                              "upvotes": -1,
                              "replies": {
                                "hb4u5dl": {
                                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4u5dl/",
                                  "text": "I counted ''life and work experience'' as one argument. But if you want to count it as 2, fine. So 50% of your argument are still about making money and having work experience. What's your point with that?\n\n>how does work experience ever not matter?\n\nIt does not matter when you are not working towards your career goal. Nobody cares if I am a mechanical engineering designer in automotive if what I want to get specialized in is numerical simulations for aerospace R&D. I need experience in numerical simulation, not in design. That's why not going to grad school for most people that are in a position where grad studies are necessary has little to no use to their career goal. That's what everybody is trying to explain to you.\n\n>That simply doesn't make sense in today's world, especially for writers \\[...\\] I don't want to go to grad school, I want to go to law school.\n\nThere!  You hit it!! Why are you using your life experience to ask people why they are going to grad school instead of doing things that you are doing for the benefits that you \\*think\\* it's bringing you while you are NOT even technically going to grad school? Your question doesn't even apply to you!  In other words, you were not in any position to make that statement:\n\n>at the expense of gaining life and work experience, and having opportunities to develop talents and make/save money, especially when the rewards of education are less certain than they ever have been\n\nYou made a post based on assumptions that were wrong because you wrongly used your own situation to apply it generally. As you said it yourself finally, your situation does not apply here and you are in an exceptional position. The simple fact that you are asking such a question shows that you are not in the normal situation regarding career paths and grad school. Your question is not targeted towards the correct audience and your own life experience does not support your statements for people who are attending grad school directly after their studies.  That's why you are being downvoted when you try to talk about your own experience and make it relate to the post. I don't have anything else to add, it's going in circles a bit. I suggest you reread the comments under this thread for more clarification. Maybe repost your question in a r/LawSchool or r/medschool subreddit.",
                                  "author": "methomz",
                                  "created": 1630460292,
                                  "upvotes": 3,
                                  "replies": {
                                    "hb5exvl": {
                                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5exvl/",
                                      "text": "Sorry, but when you apply for law school, your work experience does matter, so I don't know what you're taking about with my not building my career. And simply having work experience, so long as it's good experience, will always matter because you can build on it, unless you're focused on obtaining some extremely particular kind of work and you take nothing from different work environments and cultures.\n\nI'm not using \"my life\" as a specific example or question. The post could be true for why many different people want to wait and is questioning the general pressure some have experienced or acknowledge to get life done a certain way... How ridiculous to say ones own question doesn't apply to themselves",
                                      "author": "metisviking",
                                      "created": 1630470973,
                                      "upvotes": 0,
                                      "replies": {
                                        "hb67d78": {
                                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb67d78/",
                                          "text": "Again you are not getting the point. That's not what I said about lawschool. I gave you an example of why having random work experience just to delay grad school (non-professional degrees) is not worth it for most. You are in an exceptional situation. Stop talking about lawschool and your own experience to justify your post that is aimed at everyone in grad school. It won't work. I am explaining to you why you are getting downvoted. If you don't want to hear it, that's your choice.",
                                          "author": "methomz",
                                          "created": 1630493417,
                                          "upvotes": 1,
                                          "replies": {
                                            "hb9909l": {
                                              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb9909l/",
                                              "text": "My post is not aimed at everyone in grad school. Look at the title and content of the post",
                                              "author": "metisviking",
                                              "created": 1630543180,
                                              "upvotes": 0,
                                              "replies": {
                                                "hb9eiuz": {
                                                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb9eiuz/",
                                                  "text": "You: why are people downvoting me\n\nMe: literally explain it to you 5 times in different ways\n\nYou: keep arguing about it and not listening why\n\nAs I told you, I am not one of those who originally downvoted you, but I understand why others did. I am trying to answer your question. Your title is aimed at everyone in grad school except med students, your comment has no point. Please move on from my comment if you don't want to hear it",
                                                  "author": "methomz",
                                                  "created": 1630545688,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "hb9iosa": {
                                                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb9iosa/",
                                                      "text": "I'm sorry but I don't agree with your explanations. You're the only person on this entire thread that seems to think I'm trying to project my life path on to everyone and get them to answer for it. You don't have the answers",
                                                      "author": "metisviking",
                                                      "created": 1630547644,
                                                      "upvotes": 0,
                                                      "replies": {
                                                        "hb9louw": {
                                                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb9louw/",
                                                          "text": "I guess that's why people keep upvoting my comments who are telling you why you are being downvoted while downvoting yours. I am not the kind to talk about upvoting but since this will literally prove you wrong: \n\nYour comment has 19+ downvotes and every comment you made since then have been downvoted.  My first comment adressing why you are wrong in asking that question has 30 upvotes. The next one explaining why you are being downvoted has 15+ and the next one repeating the same exact time because you keep arguing  6+, the next one because again you keep arguing  3+, up to here. 2 other people provided a similar answer to mine and were upvoted too. \n\nSurely, that must mean I am the only one who thinks this is why you are being downvoted. So why denying it? \n\nI have been providing you the same explanation over and over again. You keep arguing none sense about it. Why did you even ask the question then? If you can't accept criticism, don't ask why people think you are wrong. I am sorry but this is getting beyond annoying, I will block you for a few days so you stop replying and then unblock you so you can still have access to my comments and those under mine. I wish you the best of luck on working on taking criticism",
                                                          "author": "methomz",
                                                          "created": 1630549098,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "hba2zn5": {
                                                              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hba2zn5/",
                                                              "text": "People always down vote people who ask why they're being down voted. Regardless of your \"explanation\" it doesn't make sense, because people are making connections between my personal situation which is separate from the content of the post, which is talking about societal pressure around life achievement timelines. It made no sense that people down voted my private life plan, and your explanation likewise doesn't make sense even if you're attempting to explain their behaviour, because you sound as though you're defending their rationale for doing so, when there is no sound rationale.\n\nThem down voting me is akin to everyone down voting all the comments that prioritized pacing out achievements and going to school later. Plenty of people were not down voted for their life plans, yet mine was, because people nonsensically expected my personal life plan to have a level of alignment with the topic of the post when that synchronicity was never there necessarily, they just assumed it should be, which is why I don't agree with you.\n\nAnd, where alignment does happen to exist between the two totally separate issues of the question posed and my personal plans, the post clearly talks about leaving time to develop talents, and making/saving money as part of why a person would wait, which is a big part of why I'm waiting. It makes no sense why people would downvote someone who's asking about societal pressure that ignores the importance of things like making/saving money/developing talents in the literal question/issue raised, just because they share these are their own personal reasons to wait. It makes sense to expect people who elect to wait to have reasons for it. However, having these reasons does not negate the social pressure I'm asking about.\n\nIt appears that people are insulting my personal reasons for waiting, which is unjust. If instead, they are rejecting my question about societal life timeline pressures JUST BECAUSE I have my own reasons for waiting (which seems to be your argument), they are denying the reality of the social pressure I feel despite having my reasons, which is also unfair.\n\nHopefully this clears up why I don't accept your explanation nor the down voting as reasonable.",
                                                              "author": "metisviking",
                                                              "created": 1630558460,
                                                              "upvotes": 1,
                                                              "replies": {}
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "hb4wnoh": {
                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4wnoh/",
                          "text": "Oh dear lord, if that's your attitude and outlook on creative writing, you'll never get a novel published. If anything, studying law will make you more aware of language and expand your vocabulary.",
                          "author": "era626",
                          "created": 1630461436,
                          "upvotes": 3,
                          "replies": {
                            "hb5d7f2": {
                              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5d7f2/",
                              "text": "Sorry, but I fail to see how enjoying writing in comfort in the evenings and weekends because I'm enjoying a decent job after getting my BA and taking a few to devote myself to writing is how ill never become a writer.\n\nI want to be a creative novel/short story author and poet, after getting a good sized portfolio going and continuing with it.\n\nStudying law also means being influenced by a certain style of writing and a particular jargon/vocabulary. I found going to university made my creative writing worse because of the pressure to adopt an analytical perspective",
                              "author": "metisviking",
                              "created": 1630469948,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hb2zrrz": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb2zrrz/",
      "text": "Because it's often enforced that 30 is the gate to full \"adulthood\", the age where everything gets real and you're no longer young enough to keep making mistakes. \n\nSo people feel like they need to get their live together by the time they're 30. And in graduate school, one does not simply have their life together, and often think it's only possible when they've graduated.",
      "author": "KingofSheepX",
      "created": 1630431526,
      "upvotes": 27,
      "replies": {}
    },
    "hb2wm7k": {
      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb2wm7k/",
      "text": "Idk I don’t particularly feel that pressure. At least as a STEM grad, I had to do it eventually. Figured I’d get it out of the way so the rest of my life I can focus on living.",
      "author": "BoostMobileAlt",
      "created": 1630430273,
      "upvotes": 234,
      "replies": {
        "hb4hdrr": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4hdrr/",
          "text": "never felt that pressure. I went because I had a free ride and wanted to actually learn some more advanced topics, but writing this thesis is killing me.",
          "author": "suckuma",
          "created": 1630454396,
          "upvotes": 54,
          "replies": {
            "hb4ppq4": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb4ppq4/",
              "text": "Haha no kidding.  Sometimes I read back what I wrote and wonder how'd I get this far.  \n\nBut hey my advisor seems to like it well enough.",
              "author": "HalfEatenPie",
              "created": 1630458281,
              "upvotes": 22,
              "replies": {}
            },
            "hb5mf4n": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb5mf4n/",
              "text": "As I sit here trying to finish my thesis too while surfing Reddit 😂😩",
              "author": "CosmicWarrior3",
              "created": 1630475953,
              "upvotes": 9,
              "replies": {
                "hb6e37q": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6e37q/",
                  "text": "and doing TA",
                  "author": "BenL90",
                  "created": 1630497817,
                  "upvotes": 5,
                  "replies": {}
                },
                "hb6hidt": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6hidt/",
                  "text": "They call it thesis hell for a reason. Once you accept it you'll start to feel better.",
                  "author": "suckuma",
                  "created": 1630499723,
                  "upvotes": 5,
                  "replies": {}
                },
                "hb6ym04": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6ym04/",
                  "text": "Are you me? I've been staring at the discussion section of the first draft of a chapter for literally two weeks at this point and am even CLEANING to avoid it.",
                  "author": "ayeayefitlike",
                  "created": 1630507576,
                  "upvotes": 6,
                  "replies": {
                    "hb7flnm": {
                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb7flnm/",
                      "text": "Everyone I talk to is struggling to write right now",
                      "author": "suckuma",
                      "created": 1630514547,
                      "upvotes": 2,
                      "replies": {
                        "hb7fu78": {
                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb7fu78/",
                          "text": "Whereas my mate took great pleasure in asking how I hadn’t managed to finish writing my paper yet. I could have thumped him.",
                          "author": "ayeayefitlike",
                          "created": 1630514641,
                          "upvotes": 2,
                          "replies": {
                            "hb83ok8": {
                              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb83ok8/",
                              "text": "If you ever want to talk about your paper feel free to dm me. I find talking to someone about it helps immensely. Even if they don't know what's going on.",
                              "author": "suckuma",
                              "created": 1630524377,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "hb7iagh": {
                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb7iagh/",
                      "text": "I am an idiot with literally no brain cells and I was able to pass through grad school with flying colors and a 3.89 GPA.  My secret to success was staying busy with my work pretty much all day every day.  If I can do it, with my 1.35 brain cells,  I know you can do it.\n\nLooking back, is procrastination a character trait of all academics?  I did not fit in with my cohort who used to wait until the very last minute to begin working on their papers, which were always low-quality as one could imagine.",
                      "author": "murfmurf123",
                      "created": 1630515621,
                      "upvotes": 1,
                      "replies": {
                        "hb7ikit": {
                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb7ikit/",
                          "text": "Usually I’m too busy to procrastinate - if you only have so much time to do a task then it has to be done then and that’s it. But thesis writing is a different beast because I’m not in the lab anymore and there is just huge blocks of time to be spent writing. I think I’m too used to constantly juggling looming deadlines.",
                          "author": "ayeayefitlike",
                          "created": 1630515737,
                          "upvotes": 1,
                          "replies": {
                            "hb7orxh": {
                              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb7orxh/",
                              "text": ">Usually I’m too busy to procrastinate - if you only have so much time to do a task then it has to be done then and that’s it.\n\nMy entire grad student experience.  Use that same self-discipline when writing your thesis",
                              "author": "murfmurf123",
                              "created": 1630518275,
                              "upvotes": 1,
                              "replies": {
                                "hb8l5es": {
                                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb8l5es/",
                                  "text": "What self-discipline? *cries in ADHD*",
                                  "author": "lea949",
                                  "created": 1630531636,
                                  "upvotes": 2,
                                  "replies": {
                                    "hbbcf2r": {
                                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hbbcf2r/",
                                      "text": "If you don't mind me asking, how do you deal with ADHD in grad school?",
                                      "author": "A5hnil",
                                      "created": 1630590076,
                                      "upvotes": 2,
                                      "replies": {
                                        "hbc5tv5": {
                                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hbc5tv5/",
                                          "text": "Well friend, that’s a long story.. The short answer is: oh shit, I’m not sure there is a short answer?\n\nHonestly, if you wanna dm me to talk, I’m down! Because I can’t figure out how to condense any of it right now? But also, I’ve learned a LOT through failure that I’d love to be able to share, because I spent so long looking for resources that were specific to ADHD and grad school, and life is hard yo—grad school especially so. (But also bear in mind I definitely wouldn’t say I’ve overcome my weaknesses or am like hella excelling right now. Just to set/lower expectations 😅)\n\n(That goes for other ADHD grad students too—you can dm me, but keep your expectations low lol)",
                                          "author": "lea949",
                                          "created": 1630602203,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hb6e26c": {
          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6e26c/",
          "text": "really?  I seen many 24 years old already has PhD in STEM, and age 30 mostly become professor with a lot of reputable research, it's unreachable for me, and I felt left behind because many of them already at the top at 30(as I still at Master at 25 now).. it's crazy tbh... How smooth their carrier are. Because at Master course now I'm quite struggling with working on Research",
          "author": "BenL90",
          "created": 1630497800,
          "upvotes": -5,
          "replies": {
            "hb6fgub": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6fgub/",
              "text": "Because those people have gone straight through without deviation. There's no reason why anyone has to artificially delay doing XYZ if they don't want to and don't need to, and that applies just as much to the 24yo as it does the 50yo. If someone works at the pace that suits their life position best and they graduate at age 24 or 34 or whatever then that's just the age they've graduated. It's nothing special and it's no measure of skill or passion.",
              "author": "officially_anxious",
              "created": 1630498599,
              "upvotes": 7,
              "replies": {}
            },
            "hb8kd0v": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb8kd0v/",
              "text": "Having a PhD by age 24 is pretty ridiculous here in the US - would require having graduated from undergrad at an unusually young age instead of the regular 22.",
              "author": "Reverie_39",
              "created": 1630531282,
              "upvotes": 4,
              "replies": {}
            },
            "hb6s63l": {
              "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb6s63l/",
              "text": "Well that’s not in the US and not in STEM, but other countries and cultures do things differently. I can only report on my experience as an American student.",
              "author": "BoostMobileAlt",
              "created": 1630504824,
              "upvotes": 2,
              "replies": {
                "hb70sl2": {
                  "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb70sl2/",
                  "text": "Hm... interesting. Most of them I known graduate from US based uni, but come back to my country after that. Now because we have PhD after Bachelor, it's possible also some of them graduate in our home country, but under supervision of US based Uni or Canada.",
                  "author": "BenL90",
                  "created": 1630508483,
                  "upvotes": 1,
                  "replies": {
                    "hb7hd92": {
                      "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb7hd92/",
                      "text": "IIRC average stem PhD time is like 5.5 years",
                      "author": "BoostMobileAlt",
                      "created": 1630515249,
                      "upvotes": 1,
                      "replies": {
                        "hb7jynt": {
                          "link": "/r/GradSchool/comments/pfa751/why_is_there_such_a_strong_pressure_for_people_to/hb7jynt/",
                          "text": "Yeah. it's also the same in Indonesia. Most of them accelerate when they are on elementry or middle high, with only 3.5 years for elementry, total 4 years to junior high and senior high, so at the age of 14-15 they could take bachelor for 3.5 years and jump directly to take PhD at US uni at age f 18/19, well they will graduate at 24/late I seen 26 or 27, and their supervisor are supportive, and most of the prof encourage them to publish a lot of journal and work close with industries. Some of them that are very brilliant can finish PhD (join with MIT and Standford as I know, UI, ITB, ITS), for about 4-4.5 years.\n\nBut tbh to see this become mainstream is insanity tbh... It's abnormal :/ Look you see, I'm 25 years old, struggling going out master and probably finding PhD and try to catch up with them. at age of 30-32 I will finish PhD (if all on track), and at that time they if very productive at age of 30 or lat 35 will already been Fully prof at their respected Uni (and In Indonesia, it's hard to get Prof, because it's granted by the Gov not by the Uni, and it takes 1-2 years to promote, check, and see their impact of research, IP, Patent, by MoE and help of international Community), like... is there even any chance for normal people like me? I just thinking about it. like OP did. I need to make my head straight, because well it's really bumpy road out there...",
                          "author": "BenL90",
                          "created": 1630516314,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634065051
}