{
  "sid": "qpri63",
  "link": "/r/GradSchool/comments/qpri63/advice_about_transferring_when_mentor_retires/",
  "title:": "Advice about transferring when mentor retires",
  "text": "So my mentor dropped a bomb on me today, she’ll be retiring at the end of the year. Which is pretty bad news for me. I’m in my first year of a design based MFA and now I’m questioning everything. My two options are either to stay at the university I’m at and potentially have three different mentors for the three years I’m in grad school, or I could look into transferring to a different institution.\n\nNeither is my preferred situation but here I am I guess. My profession is very much about word of mouth/networking and who you study under matters. I worry that if I stay I won’t build a connection with any of the new professors who will only be there for a year and I will feel lost in my studies. They will also likely be younger and less established than my current mentor and therefore have less outside connections to help me once I graduate. And who’s to say if we will even get along. I was also questioning whether or not I had even picked the right university a couple weeks back for other reasons so this all feels like a sign maybe.\n\nOn the other hand, transferring presents it’s issues as well. It would cost me a bunch of money to relocate and I just relocated in August. I’m and international student so there would be a ton of paperwork. I may not even be accepted to a university on the same or better level of my current program. I have started to meet people and carve out a routine here that would feel horrible to do again. I also have recently started dating someone that I would have to shut down. I might feel behind others at the new university. And the other program might turn out badly because it’s an unknown. I also think there is a possibility that I am just super over thinking this and that maybe having three different opinions and teaching styles might be a good thing. Maybe I will create even more connections and learn more things than I would’ve had my current mentor stayed.\n\nI guess I’m just looking for some advice about the whole situation as I’m currently bouncing every single outcome around in my own brain. You thoughts would be appreciated.",
  "author": "artsyswarley",
  "created": 1636418105,
  "updated": 1636656552,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "hjxrrgx": {
      "link": "/r/GradSchool/comments/qpri63/advice_about_transferring_when_mentor_retires/hjxrrgx/",
      "text": "Hello there. I personally have not had an advisor retire/resign etc. But it happens quite often in my faculty. I've seen around 5 of my batch mates experience it at different stages of their research. The bright side of being a first year is that if another experienced advisor steps in to fill in the role of your previous advisor, it wouldn't be as challenging as it would be if you were 3-4 years in.  It happens more often than you think, honestly.\n\nAll of my batchmates had new advisors either in main/co-supervisory roles and they all managed to graduate. I think from what you have shared, you can cope well even with new advisors. I would worry if you were isolated and lack social connections, but it doesn't seem that way. \n\nDo you have another advisor? From your experience, do you have anyone in mind that could fill in the role of your current advisor?\n\nAnd, remember to breathe. It's a tough day for you. Don't make big decisions right now. You are more capable than you think and while supervisors make up a big part of our postgrad life, surviving with new advisors may bring forth new opportunities. Best of luck.",
      "author": "givemeyourdonut",
      "created": 1636467603,
      "upvotes": 1,
      "replies": {}
    }
  }
}