{
  "sid": "oynn9k",
  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/",
  "title:": "Revelation: PIs Lack of Work-Life Balance is Not My Problem",
  "text": "I am entering my 4th year in my PhD program, and since coming to the revelation in the title I think I've finally found inner peace. My PI is incredibly hard working: with half a dozen projects, multi-million dollars in yearly grant revenue, a national lab appointment, has an impact factor through the roof, and dozens of collaborators. Everything is an emergency because she has to meet so many external expectations, and works all hours of the day. She often says she sleeps 2 hours a night, and I tend to believe that. She also has a family, and has to balance those expectations as well. I have a tremendous amount of respect for her, but she also had those same expectations for me.\n\nTook me most of my first year to realize that isn't normal, not something I should emulate, nor something any person should be expected to do. Took me longer to stop feeling guilty for not being able to perform and deliver like that and actually take a weekend off. For a while I felt bad about not working that hard. Although given she makes 10-20x my salary, not that bad. She has a family, kids and aging parents, and sometimes I'd pick up some extra slack if she'd sent me an email at 9PM. But those woes continued, my extra work wasn't appreciated it was expected, and she would ask for more involved help, including submitting papers and proposals to projects I wasn't involved with at all and would receive no credit on and TAing an extra semester. That's where I stopped, when it caused friction I raised this issue to the department head and dean, and we've had a great working relationship since.\n\nPoint being, her career goals and 'grindset' aren't fair to anyone including herself, and once I learned that it's not my responsibility to fill in her gaps or emulate her work, I was able to set sane boundaries for myself. Regardless of the chaos she is currently living through, I can't make that better or fundamentally easier. That's the field she sowed, not my job to reap it. If I'm drummed out of academia, so be it, but I won't work and live like that. I just wanted to share this, hopefully the experience I had will prevent the overwork and unrealistic expectations many grad workers feel.",
  "author": "Outmodeduser",
  "created": 1628185526,
  "over_18": false,
  "upvotes": 459,
  "upvote_ratio": 0.99,
  "comments": {
    "h7y8fz9": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7y8fz9/",
      "text": "These are all amazing points. (And things I am struggling with myself). \n\nBut a quick observation: if your PI has MILLIONS in funding, you should not have to TA. That is ridiculous. (Unless it’s a requirement for your department.)",
      "author": "BiologyPhDHopeful",
      "created": 1628266626,
      "upvotes": 2,
      "replies": {}
    },
    "h7xsos3": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7xsos3/",
      "text": "I absolutely hate when people brag about their lack of sleep. i’ve had chronic onset insomnia for my entire life and it has wrecked my life and my mental health many times. if you can sleep, don’t punish yourself by not sleeping. it’s never worth it",
      "author": "x-files-theme-song",
      "created": 1628259935,
      "upvotes": 4,
      "replies": {}
    },
    "h7xf78m": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7xf78m/",
      "text": "Well said. You should decide your own work-life balance and if you don't want to work 80 hour weeks then you shouldn't. Also, if you are to work such long hours, it should be for your own career advancement, not that of your supervisors.",
      "author": "CaptainCornerCamper",
      "created": 1628253372,
      "upvotes": 2,
      "replies": {}
    },
    "h7x1o9j": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7x1o9j/",
      "text": "sounds like a carbon copy of my PI haha. Fortunately i realized quite early into this program that i didnt want to be like that, and have prioritized my personal health/well being and hobbies.\n\nYeah some weeks i put in a lot of hours to meet deadlines but im definitely doing <40 hrs a week of graduate work",
      "author": "pinkolomo",
      "created": 1628243644,
      "upvotes": 3,
      "replies": {}
    },
    "h7wqxak": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7wqxak/",
      "text": "Maybe she wouldn't be so stressed out if you were working harder.",
      "author": "AAAAdragon",
      "created": 1628234451,
      "upvotes": -5,
      "replies": {
        "h7wz5q6": {
          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7wz5q6/",
          "text": "Lol. But seriously why does OP care if his supervisor doesn't rest. She seems happy with how she lives her life seeing how successful she  is. If OP thinks she isn't there for her family as much as she should be, then that's between his supervisor and her family. I understand its not healthy to overwork ourselves but this sub can sometimes be ludicrous with all the judgements passed on supervisors who seem happy with how they have structured their lives. If they werent happy they would probably leave academia. We all complain about our lives, just because a supervisor complains about theirs doesnt make them unhappy",
          "author": "AvosticLala",
          "created": 1628241521,
          "upvotes": 1,
          "replies": {
            "h7xfmv5": {
              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7xfmv5/",
              "text": "'For a while I felt bad'\n\nFelt is past tense. Thank you for reiterating what I said in my second paragraph. Took me a while to learn what you're saying and I wanted to share my experience.",
              "author": "Outmodeduser",
              "created": 1628253615,
              "upvotes": 1,
              "replies": {
                "h7z6oqm": {
                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7z6oqm/",
                  "text": "You sound bitter that your supervisor is successful.",
                  "author": "AvosticLala",
                  "created": 1628281267,
                  "upvotes": -1,
                  "replies": {
                    "h7zajp3": {
                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7zajp3/",
                      "text": "If that's what you wanna project be my guest. I certainly sleep more.",
                      "author": "Outmodeduser",
                      "created": 1628282985,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "h7zxh4c": {
          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7zxh4c/",
          "text": "Dislikes because you can't handle the truth.",
          "author": "AAAAdragon",
          "created": 1628293846,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7wmka7": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7wmka7/",
      "text": "A very good insight, and a sign of maturity to recognize the situation for what it is, and then to act accordingly. Thanks for sharing.",
      "author": "Matthias_Rillig",
      "created": 1628230934,
      "upvotes": 3,
      "replies": {}
    },
    "h7w0d0t": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w0d0t/",
      "text": "[deleted]",
      "author": null,
      "created": 1628217556,
      "upvotes": -3,
      "replies": {
        "h7w1lac": {
          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w1lac/",
          "text": "Yeah man really enjoying raking in less than 30k a year for what is highly skilled labor, for 50 hours a week, so I can prove to some ivory tower fuckheads like you I know what I'm talking about because I have letters next to my name.\n\nFound the PragerU graduate.",
          "author": "Outmodeduser",
          "created": 1628218163,
          "upvotes": 11,
          "replies": {
            "h7w73u5": {
              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w73u5/",
              "text": "OP you're not the one in the wrong here. Grad school can very much be a broken and abusive structure that takes advantage of grad students. It isn't right, and just saying \"you're not good enough\"  doesn't actually fix the problem",
              "author": "Astsai",
              "created": 1628220976,
              "upvotes": 4,
              "replies": {}
            },
            "h7w2alf": {
              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w2alf/",
              "text": "[deleted]",
              "author": null,
              "created": 1628218510,
              "upvotes": -3,
              "replies": {
                "h7w4x53": {
                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w4x53/",
                  "text": "It's so inconsequential, yet here you are. And you delete because you can't stand by your word. Sorry you're licking the boot so hard you think what you're doing is healthy. You need help. Yay.",
                  "author": "Outmodeduser",
                  "created": 1628219835,
                  "upvotes": 6,
                  "replies": {
                    "h7w5fvi": {
                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w5fvi/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1628220102,
                      "upvotes": -1,
                      "replies": {
                        "h7w6v3e": {
                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w6v3e/",
                          "text": "You're the one who is being condescending here",
                          "author": "Astsai",
                          "created": 1628220848,
                          "upvotes": 1,
                          "replies": {
                            "h7w7roz": {
                              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w7roz/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1628221310,
                              "upvotes": 1,
                              "replies": {
                                "h7w84os": {
                                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w84os/",
                                  "text": "Not really. I'm a PoC and I had years of racial trauma occur in my life, so I'm aware what systematic abuse is. What I went through is due to an unfair system, and likewise I can extend that when it comes to classist systems that don't benefit people who aren't in places of privilege. The issue isn't the OP, the issue is our system is broken. Grad students make a minimal amount, and things should change so grad students and PhD students in general have more autonomy.  \n\n\nYou keep implying that you're better than OP because you're surviving something they haven't. I don't see why those comments are necessary.",
                                  "author": "Astsai",
                                  "created": 1628221499,
                                  "upvotes": 2,
                                  "replies": {
                                    "h7w8kt6": {
                                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w8kt6/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1628221739,
                                      "upvotes": 1,
                                      "replies": {
                                        "h7w8yb1": {
                                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w8yb1/",
                                          "text": "You said grow a pair to the OP, and you don't even know their gender lol. That phrase can come off offensive regardless of gender though.",
                                          "author": "Astsai",
                                          "created": 1628221934,
                                          "upvotes": 2,
                                          "replies": {
                                            "h7w91we": {
                                              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w91we/",
                                              "text": "You are not keeping up with the conversation very well. Lol.\n\nOof you must not read very well at all. It hurts!\n\nDw. Deleting soon so the whining can commence without logic and reason. Not my scene. Sounds like yours tho",
                                              "author": "sincere_eel",
                                              "created": 1628221987,
                                              "upvotes": 0,
                                              "replies": {
                                                "h7w9dtz": {
                                                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w9dtz/",
                                                  "text": "That's fine, but the problem is still that this is a systemic issue and not an individual one. It's fine to admit that grad school needs to change to be less classist. It's well knownthere is an economic and racial divide in PhDs, and it's not because that PoC or poor people aren't working hard enough, it's just that there are a multitude of systemic factors that prevent them from succeeding:   \nhttps://heller.brandeis.edu/phd/concentrations/economic-racial-equity.html",
                                                  "author": "Astsai",
                                                  "created": 1628222157,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "h7w9lqs": {
                                                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w9lqs/",
                                                      "text": "Everyone knows…. Yawn.\n\nBye subreddit. It’s been boring",
                                                      "author": "sincere_eel",
                                                      "created": 1628222273,
                                                      "upvotes": 0,
                                                      "replies": {
                                                        "h7w9vx3": {
                                                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w9vx3/",
                                                          "text": ">Everyone knows…. Yawn.\n\nThen we agree the system needs to change and it's less about the individual succeeding or failing",
                                                          "author": "Astsai",
                                                          "created": 1628222427,
                                                          "upvotes": 2,
                                                          "replies": {
                                                            "h7wd6tm": {
                                                              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7wd6tm/",
                                                              "text": "It is unfair to burden the oppressed with the obligation they are the cause of the oppression by not doing something.\n\nIn other words, your strategy doesn’t work for everyone. \n\nI am a parent who tried to create a support infrastructure for student parents at my institution such as providing nursing stations so please lecture somebody else. I am not only working harder than OP and most grad students, I am actively doing things to change my graduate program ON MY PERSONAL TIME without extra pay. \n\nPeace - outta this negative space and into one that validates my achievement and empathy for fellow scholars. Enjoy whining with OP. So productive! His post history is so low quality. It will make you wonder why you are supporting someone so childish. To each their own I guess? I am not on the wokeism bandwagon. I have other priorities than lip service.",
                                                              "author": "sincere_eel",
                                                              "created": 1628224394,
                                                              "upvotes": -1,
                                                              "replies": {}
                                                            }
                                                          }
                                                        },
                                                        "h7wahy4": {
                                                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7wahy4/",
                                                          "text": "It's not an airport, no need to announce your departure.",
                                                          "author": "Outmodeduser",
                                                          "created": 1628222772,
                                                          "upvotes": 1,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "h7w6wi5": {
                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w6wi5/",
                          "text": "Thanks girlboss I know what options I have. You don't seem very friendly. I'm at peace and doing well in my program, have plenty of friends and support and hope you find the same.",
                          "author": "Outmodeduser",
                          "created": 1628220868,
                          "upvotes": 1,
                          "replies": {
                            "h7w7i5w": {
                              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w7i5w/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1628221184,
                              "upvotes": -2,
                              "replies": {
                                "h7wd9f2": {
                                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7wd9f2/",
                                  "text": "You literally came onto my post where I was attempting to help people avoid overwork and unrealistic and unhealthy work habits. That it doesn't take 60+ hours of work isn't neccesary and you can find balance. That some of this is due to your PI, who could be abusing power structures and hierarchies to extract labor and compliance for credentials. How those unrealistic work habits were bad for my health.\n\nYou proceeded to post how I was a leech and said you'd never hire me, and how you're too good for this subreddit but have since edited it away (gaslight much?). That aksually unless you're working 60 hours a week and suffering you aren't cut out for it (abusive). That I wouldn't know suffering amd hard work because I haven't had a child. I'm sorry. That's actually sexist. Women choose to have children or not have children for a multitude of reasons, that decision does not make them more or less a women, more or less capable of working hard and understanding pain.\n\nSaying girlboss is sexist is like saying you can't call cops pigs because its fatphobic, its such a stretch and devalues the actual experiences of sexism women do face in grad school. There is nothing feminist about capitalism and exploitation of labor.",
                                  "author": "Outmodeduser",
                                  "created": 1628224437,
                                  "upvotes": 2,
                                  "replies": {}
                                },
                                "h7xqvxj": {
                                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7xqvxj/",
                                  "text": "You should check your ego. Judging by your post history, you clearly have an inflated sense of self-importance. Self-proclaimed intelligent people — people who think themselves cognitively superior to others — are generally not very wise, or, worse, immature. You should work on this. \n\nAlso, lay off the weed. Pothead.",
                                  "author": "Gambenis",
                                  "created": 1628259139,
                                  "upvotes": 0,
                                  "replies": {
                                    "h7xyvxj": {
                                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7xyvxj/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1628262578,
                                      "upvotes": 0,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "h7w4etg": {
                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w4etg/",
                  "text": "Hard work =/= unhealthy exploitation and toxic work culture. I've worked since I was 13, I know hard work, but I also know when I'm being taken advantage of when a system is inequitable and exploitative.\n\nWeren't you leaving?",
                  "author": "Outmodeduser",
                  "created": 1628219568,
                  "upvotes": 4,
                  "replies": {
                    "h7w4yx9": {
                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w4yx9/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1628219862,
                      "upvotes": -1,
                      "replies": {
                        "h7w5kfv": {
                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w5kfv/",
                          "text": "I weep for your child.",
                          "author": "Outmodeduser",
                          "created": 1628220168,
                          "upvotes": 1,
                          "replies": {
                            "h7w6fhv": {
                              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w6fhv/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1628220625,
                              "upvotes": 1,
                              "replies": {
                                "h7w84s6": {
                                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w84s6/",
                                  "text": "Yeah I bet your friends tell you all the time how helpful you are. I was in research for years and was published before I even got to grad school but alright you know best, after all you had a kid something millions of people do as an afterthought so you must know best.",
                                  "author": "Outmodeduser",
                                  "created": 1628221501,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "h7w8aax": {
                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w8aax/",
                          "text": ">I am used to dealing with entitled people.\n\n>so this subreddit is sort of beneath me\n\nHuh. 🤔 Guess you're talking about yourself.",
                          "author": "Various-Grapefruit12",
                          "created": 1628221584,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h7vm7rf": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7vm7rf/",
      "text": "Bravo!! And this whole sleeping 2 hours is a death wish. Horribly unhealthy.",
      "author": "RuthlessKittyKat",
      "created": 1628210627,
      "upvotes": 6,
      "replies": {}
    },
    "h7vc3qu": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7vc3qu/",
      "text": "Your story sounds almost like mine. My PI is also insanely hard-working, barely sleeping, always working on weekends, taking on more and more students and projects and collaborators. And yeah, I also didn't feel appreciated whenever I had breakthroughs of hard work because that was expected of me. It was and still is always hard to express to her when I'm feeling exhausted or burnt out because she can't help but invalidate how I feel by comparing it to her own experience.\n\nI don't have much more to add other than this was incredibly validating, and you're also not alone.",
      "author": "valryuu",
      "created": 1628205641,
      "upvotes": 12,
      "replies": {}
    },
    "h7v7h0f": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7v7h0f/",
      "text": "A friend of mine once said that every PI was once the student who bragged about how \\*little\\* sleep they got, and it's really stuck with me.",
      "author": "SkulGurl",
      "created": 1628203454,
      "upvotes": 20,
      "replies": {}
    },
    "h7v45it": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7v45it/",
      "text": "You're already better off than all the people I know in academia. They do realize this shit, but they don't set boundaries nor put a stop on it. Proud of you, OP.",
      "author": "M_is_for_Magic",
      "created": 1628201939,
      "upvotes": 10,
      "replies": {}
    },
    "h7v3dsq": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7v3dsq/",
      "text": "This sound like my old lab I was in. The current lab I’m doing my PhD in is very chill and laidback but still do necessary stuff when required and not go overboard.",
      "author": "chingalingdingdongpo",
      "created": 1628201594,
      "upvotes": 12,
      "replies": {}
    },
    "h7v2ajv": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7v2ajv/",
      "text": "[deleted]",
      "author": null,
      "created": 1628201105,
      "upvotes": 6,
      "replies": {
        "h7v60g6": {
          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7v60g6/",
          "text": "I'd argue the superstructure of academia is inherently exploitative and exclusionary for that reason, and it doesn't have to be that way. People don't do their best work when stretched thin, and what discoveries, bits of technology, or scientific and cultural achievements are we missing out on because the only pathway to success is running yourself ragged chasing funding and publications. We're being told to trust science, well science says people working more than 50 hours a week are less efficient and capable at their jobs.\n\nWe are capable of shaping our society, workplaces, and enviorment. We are academics, and we should decide how academia functions institutionally and culturally, and there is a lot of work to do.",
          "author": "Outmodeduser",
          "created": 1628202789,
          "upvotes": 27,
          "replies": {
            "h7vlzpg": {
              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7vlzpg/",
              "text": "Amen! I'm thinking of the recent study out of Iceland, too, that people are just as or even more productive on less hours of work.",
              "author": "academico5000",
              "created": 1628210516,
              "upvotes": 9,
              "replies": {}
            },
            "h7wacd9": {
              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7wacd9/",
              "text": "[deleted]",
              "author": null,
              "created": 1628222683,
              "upvotes": 0,
              "replies": {
                "h86fwec": {
                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h86fwec/",
                  "text": "That's a pretty big question/ask, I'm in hard science/physics (details redacted because I've gotten some really angry folks come at me because of this post), so I wouldn't know without a thorough lit review. Just not versed enough on specific policies and programs that's other countries would have.\n\nHowever based on my experiences both in industry and union organizing, I could give you some examples at a micro level which would be easy to implement at both department and college level. Easiest thing right off the bat is universal benifits, health, dental, vision, childcare/child leave and paid/accruable vacation. No R1 has any excuse not to provide these to its PhD students, but track record varies institutionally and many programs aren't transparent in recruitment. Paid vacation time that you either A) use or B) are compensated for is standard at national labs and within industrial R&D so the idea we need to be on the clock all the time doesn't track.\n\nWhich brings me to working hours. I'm sure you can do a search on productivity studies, sleep, and hours worked; such that we are less effective at our jobs after ~50 hours. Two ways to address this: cultural and financially. Financially would be overtime pay for grad workers who need to be putting in those hours, because they are going above and beyond, while providing a metaphorical thorn in the side of department admin which can then encourage labs who are overworking to bring in more students instead which from a cost-benefit perspective makes more sense. Same incentive structure as literally everywhere else. Culturally though, that's a tough one. As evident by a lot of replies, at a spiritual level a lot of people tie their identity to hard labor, and at least in the USA that protestant work ethic doesn't just vanish and runs beyond academia. Big discussion with lots of ways to approach it. Having grad unions or orgs have actual voting power at trusteeship/deans meetings would be a place to start, we currently have no input into the culture we live in.\n\nLastly, every department should be doing rotations before students commit to a lab. Currently in many programs you're tied to your lab for a fixed amount of time lorded over by someone you may or may not have had a good opportunity to meet and see if the next 5 years will be a good fit. You can transfer labs, but that's often detrimental or not possible, or you can quit. I think offering rotations prior to qualifying exams (or similar) would alleviate a lot of these student-professor mismatch issues while allowing incoming grad students to develop a breath of knowledge and skills they need in their field.",
                  "author": "Outmodeduser",
                  "created": 1628436881,
                  "upvotes": 1,
                  "replies": {
                    "h86nnor": {
                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h86nnor/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1628440508,
                      "upvotes": 1,
                      "replies": {
                        "h8fprsk": {
                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8fprsk/",
                          "text": "Hey sorry about the delay, real work/life called.\n\nA lot of these policies would effectively increase the cost of graduate student labor. In terms if capitalist market negotiation, we as grad students don't really hold enough power, individually, to demand more. To the Provosts and bean counters, why pay more when you can pay less? Even assuming good faith on behalf of administrators and PIs wanting to pay us a fair wage and decent benefits that any worker has earned, increasing cost per head of graduate worker and giving them more time off would decrease the amount of students most colleges would allow in and thus reduce the degree of work/productivity in terms of publication metrics. Research and academia is just as beholden to the same forces of capitalism as we all are. So that's the answer in a nutshell, below is my rant about why that is and what we can do to start fixing it. Its unions.\n\nIn America, wages have not kept up with productivity; yet my University's endowment grows and its president makes 45x my salary. Clearly, they are not operating in good faith. Universities COULD stop paying their presidents and upper admin crazy high salaries and instead of investing the endowment in real estate or the S&P, invest it in its students and workers; but, since that is unlikely to happen we are left with the situation we have. \n\nGrad students are largely captive labor, we are tied to the institution and our PIs like peasants to their lord and field. You could leave, but you cannot transfer your skills, negotiate salary, or interview for better position. It is a very narrow and precarious spot to be in, admin knows this, and can pay accordingly. Because, at the end of they day we aren't here for a paycheck we're here for a degree and to do research, and many students will put up with the abuse to get that degree. We are stuck, and in the case of international students, quite literally; your immigration status is tied to your employment. This is structure which compels quiet compliance and is by definition non-democratic.\n\nThis is why it is critical for grads to unionize, and why we are seeing such a big push for that right now. Individually, we can't do much more than send a pleading email. But united, our labor makes the university function and without us it would grind to a halt. We can demand things like cost of living adjustments and vacation time, but only if we work together. The only reason things like a 40 day work week or vacation time exist at all is because of the labor movement of the 1890s-1920s. The American labor movement never really 'won' or formed its own political body* so over time the New Deal was gutted. In my view, this helps explain the growing income inequality and income productivity gap, and should be a call to revive labor movements.\n\n* Footnote: America is unique in that it never succesfully formed a discrete labor party. Most industrialized countries that had a labor rights movement ended up forming it's own lasting political party, be it UK Labour or the French Socialist Party.",
                          "author": "Outmodeduser",
                          "created": 1628618058,
                          "upvotes": 1,
                          "replies": {
                            "h8fs0ep": {
                              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8fs0ep/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1628618994,
                              "upvotes": 1,
                              "replies": {
                                "h8fy3kj": {
                                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8fy3kj/",
                                  "text": "I can really only speak with any specificity to the situation in the States. Just because you're a non-profit doesn't mean you'll make student-first spending decisions. I think you'll find plenty non-profits, University or otherwise, spending quite frivolously. 501(c)(3) doesn't preclude you from paying your president a seven figure salary or buying up land and buildings in the area.\n\nIronically, in the States STEM labs are pretty well funded and most PhD students with active research projects are fully funded. In my field, ARL/ONR/AFRL grants pour billions into fundamental research because America has prioritized funding of \"defense\" research in interests of national security. So depending on your country, they might have other priorities.\n\nI think my broader point is that our academic output has increased but our quality of life and pay has decreased relative to the cost of living and inflation. We could alleviate this, but it requires systemic change, which is why I can't say \"Oh look at country X or University Y\". It requires a revaluation of how we prioritize research and labor and a fundamental shift in how our economy works. But, just like in 1900 the idea of a 40 hour work week seemed ludicrous with no one implementing it, we can change our world through coordinated action.",
                                  "author": "Outmodeduser",
                                  "created": 1628621549,
                                  "upvotes": 0,
                                  "replies": {
                                    "h8gczt2": {
                                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8gczt2/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1628627894,
                                      "upvotes": 0,
                                      "replies": {
                                        "h8gl3jn": {
                                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8gl3jn/",
                                          "text": "It is always economic forces at play, from the Sumerians to now. I am more interested in critical analysis of who is currently directing those economic forces and if the trajectory of those forces is leading us in a net positive direction. You are viewing things with a very narrow cone of reference, treating these things as a zero sum game of winners and losers. Nothing in analyzing academia, and the degree holders and careers it produces, would imply that it is a zero sum game so I am not sure how you came to this conclusion. \n\nYou are working from the assumption that the US system is better, I disagree. By what metrics or contexts is it superior? Can you honestly say the United States, and/or its University system, is a perfectly healthy with a positive trajectory and no need for improvement or critical analysis? I am saying that the current resource allocation system is not functional, competitive, or beneficial to society. Academia is competitive, but one which is competed against on many fronts and across many events/skill-sets. The multitude of economic, political, and social levers which select who climbs the ivory tower and who stays at the bottom is anything but meritocratic OR democratic. It is this I am saying we should change.\n\nI think if you want an introductory text into the critical analysis I'm discussing and the reasons why I think we need to radically change our approach to not only academia, but our broader economic, political, and social frameworks as well then you need to read \"Why Socialism?\" by Albert Einstein. My philosophy of how we should change things and shape society stems from that understanding and worldview he espouses.",
                                          "author": "Outmodeduser",
                                          "created": 1628631434,
                                          "upvotes": 1,
                                          "replies": {
                                            "h8gt7aw": {
                                              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8gt7aw/",
                                              "text": "[deleted]",
                                              "author": null,
                                              "created": 1628635127,
                                              "upvotes": 1,
                                              "replies": {
                                                "h8h8zpq": {
                                                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8h8zpq/",
                                                  "text": "How many times has capitalism failed? From chattel slavery to inperialist wars of conquest, these are features of liberal capitalism, yet we continued to analyze, build, and improve until we reach the present day. How many millions die from inadequate medical care and nutrition, yet the UN has had these as human rights since the mid 1950s. Capitalism has failed deliver on those goals, and instead enriched an increasingly smaller minority of people at the top while driving us to the cliff of climate catastrophe with no solution in sight.\n\nMarx understood the value of capitalism in accumulating sufficient surplus and level of industrialization to transition to socialism, a more efficient and equitable economic system. To me, we have long past the neccesary productive forces to enable socialism. We produce enough food, medicine, and technology; it's a question of distribution and what purpose the technology is serving. Socialism in the 20th century were our first experiments with State Socialism, largely in impoverished, semi feudal, or post colonial nations. They were encircled and fought in a cold war, and in the case of Veitnam, literally bombed back to 1890 infrastructurally, with 3 million killed, and are still dealing with the effects of chemical warfare committed against them. Perhaps if capitalist countries weren't constantly exploiting and invading the 3rd world, these nations wouldn't experience crushing poverty. The reasons for the failures of socialism in the 20th century are a big discussion, but there are many successes and lessons to be learned in those experiments. For being such an advocate of STEM, you do not approach economics as a science. \n\nSeems like every 8 years they need to prime the pumps and bail out some massive sector of the economy. My family lost their jobs, nearly lost the home, in 2008. I began working when I was 13. We relied on charity and community to get by until things stabilized, we never got a bailout but Wall Street did. Perhaps I wasn't a \"competitive\" enough child laborer in your world view; but my world view stems from that, so spare me with \"you should be more grateful\". Parts of America are a third world country, 1 in 7 of our children go hungry, lacking running water or are food deserts. What you don't understand is many Americans are already living a third world existence. The apocalypse is here, it just isn't evenly distributed yet.\n\nChange is inevitable. Socialism or barbarism? As the pressure cooker of climate change literally boils the world, will we use our technology and surpluses to empower and serve the people or will we face common ruin and war over dwindling resources and shrinking markets?",
                                                  "author": "Outmodeduser",
                                                  "created": 1628642742,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "h8i1szg": {
                                                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8i1szg/",
                                                      "text": "[deleted]",
                                                      "author": null,
                                                      "created": 1628658445,
                                                      "upvotes": 0,
                                                      "replies": {
                                                        "h8ix0s1": {
                                                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8ix0s1/",
                                                          "text": "Ah the old \"Before I address your points, let me deflect and ask a completely unrelated and different question\". Great move, I too read the \"Ben Shapiro Guide for Debates with Big Boys\". Speaking for myself, our university made a surplus/profit last year, I got out two publications, and I am on two grants which bill my labor (combined) at 85k/yr. I am not paid 85k/yr, do not own the IP I generated, nor did I see a share of that surplus. Does this answer your surplus value and exploitation question?\n\nWhat about investors? How much exploitation did they do to accrue their surplus billions such that they, and they alone, decide what is worthy of investment?  From Enron to Theranos, doesn't seem like they do a great job either, and given the state of the US economy worthy of criticism. Heck, my own universities portfolio underperformed the S&P and they have several professional investors managing its endowment. I don't think investors should exist, and the decisions of resource allocation and investment made through a democratically controlled, algorithmically and machine learning informed, decision matrix. Imagine Chile's CyberSyn but with the resources and technology of America.\n\nWill you address my points now?",
                                                          "author": "Outmodeduser",
                                                          "created": 1628683778,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "h8ix1fd": {
                                                              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8ix1fd/",
                                                              "text": "I saw that you mentioned Ben Shapiro. In case some of you don't know, Ben Shapiro is a grifter and a hack. If you find anything he's said compelling, you should keep in mind he also says things like this:\n\n>When it comes to global warming, there are two issues: is there such a thing as the greenhouse gas effect, the answer is yes. Is that something that is going to dramatically reshape our world? There is no evidence to show that it will. Is that something that we can stop? There is no evidence to show that we can\n\n\n*****\n\n^(I'm a bot. My purpose is to counteract online radicalization. You can summon me by tagging thebenshapirobot. Options: climate, civil rights, dumb takes, feminism, etc.)\n\n[^Feedback: ^/r/AuthoritarianMoment](https://np.reddit.com/r/AuthoritarianMoment) ^| [^More ^info](https://np.reddit.com/r/AuthoritarianMoment/wiki/index) ^| [^Opt ^out](https://np.reddit.com/r/AuthoritarianMoment/comments/olk6r2/click_here_to_optout_of_uthebenshapirobot/)",
                                                              "author": "thebenshapirobot",
                                                              "created": 1628683789,
                                                              "upvotes": 2,
                                                              "replies": {
                                                                "h8ja1n2": {
                                                                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8ja1n2/",
                                                                  "text": "Good bot.",
                                                                  "author": "Outmodeduser",
                                                                  "created": 1628690663,
                                                                  "upvotes": 1,
                                                                  "replies": {
                                                                    "h8jaw8k": {
                                                                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8jaw8k/",
                                                                      "text": "Thank you for your logic and reason.\n\n\n*****\n\n^(I'm a bot. My purpose is to counteract online radicalization. You can summon me by tagging thebenshapirobot. Options: novel, healthcare, feminism, patriotism, etc.)\n\n[^Feedback: ^/r/AuthoritarianMoment](https://np.reddit.com/r/AuthoritarianMoment) ^| [^More ^info](https://np.reddit.com/r/AuthoritarianMoment/wiki/index) ^| [^Opt ^out](https://np.reddit.com/r/AuthoritarianMoment/comments/olk6r2/click_here_to_optout_of_uthebenshapirobot/)",
                                                                      "author": "thebenshapirobot",
                                                                      "created": 1628691053,
                                                                      "upvotes": 1,
                                                                      "replies": {}
                                                                    }
                                                                  }
                                                                }
                                                              }
                                                            },
                                                            "h8izyk2": {
                                                              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8izyk2/",
                                                              "text": "[deleted]",
                                                              "author": null,
                                                              "created": 1628685526,
                                                              "upvotes": 0,
                                                              "replies": {
                                                                "h8j8nvi": {
                                                                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8j8nvi/",
                                                                  "text": "See this is the value of the \"deflect, ignore, and insinuate your conversation partner doesn't actually know things\". Now we're talking about something different. I'm not describing the LVT, and there is and isn't value in adherence to Marxist orthodoxy. You wouldn't argue Deng, or even the Soviets under Khrushchev, as adhering to LVT, but in the case of Deng was able to rapidly industrialize and modernize his country irregardless. I've read more than a few hot takes, certainly know more about socialism than a self proclaimed investment banker; someone directly benefiting and profiting from this exploitation. Do you not think that would introduce some bias into your view? Academics still discuss the validity and application of LVT, but again, you're attempting to change topics. \n\nIf you don't want to pay graduate students, then higher education will only ever be available to the wealthy. Same issue with unpaid internships, which are required in many fields for people to ascend, get a career, and escape poverty. Or, you're requiring those from the working class to work more than their wealthy cohort to make a living which would negatively impact their ability to obtain a PhD. I am well aware of the race to the bottom mentality of capitalism, like rats crawling over each other to escape a barrel. Perhaps this is what people like you want, humanity to constantly be fighting itself to the bottom, but I will work for a better, more productive, and more humane system.\n\nI'm not writing you a paper with calculations and 45 citations about where and how value is stolen in the form of IP at universities. You could commission that research, and my rates are competitive, but otherwise you can do your own work. I am simply answering the question of where my surplus value has been stolen, and you are not entitled to a research report in a casual conversation. Now, unless you're willing to actually respond to my points and argument rather than project your own lack of knowledge onto me and insult me with this, you can continue to gish gallop your way to the door.",
                                                                  "author": "Outmodeduser",
                                                                  "created": 1628690022,
                                                                  "upvotes": 1,
                                                                  "replies": {
                                                                    "h8jbuuf": {
                                                                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8jbuuf/",
                                                                      "text": "[deleted]",
                                                                      "author": null,
                                                                      "created": 1628691490,
                                                                      "upvotes": 0,
                                                                      "replies": {
                                                                        "h8jdv8n": {
                                                                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8jdv8n/",
                                                                          "text": "Yeah, running it into the ground. Workers keep the global economy running, not some spreadsheet jockey. Same hedge funds that got a 3 trillion dollar bailout last summer because capitalism works so great and your models are so good? Your profile is publically available, I wouldn't have found a need to dig deeper had you not gotten personal. Your geographic circumstances don't make your argument for or against capitalism any better; being born in a \"3rd world country\" (which one, do they have socialized healthcare?) isn't some card that erases any and all arguments for socialism. Its intellectually lazy and dishonest.\n\nYou are doing the \"Oh you live in society yet you critique it\" argument, the Mr. Gotcha by Matt Bors. Your arguments are a literal cartoon. Once you respond to my initial arguments that you've avoided because you lack the ability and knowledge to do so, tell me, what benifits have I recieved from the US system? The freedom to accrue debt for the priviledge of getting an education so I can escape poverty? The freedom to buy different kinds of potato chips? Honestly, I don't know enough about you or you me for either of us to be making claims like that.",
                                                                          "author": "Outmodeduser",
                                                                          "created": 1628692380,
                                                                          "upvotes": 1,
                                                                          "replies": {
                                                                            "h8jf9wz": {
                                                                              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8jf9wz/",
                                                                              "text": "[deleted]",
                                                                              "author": null,
                                                                              "created": 1628692991,
                                                                              "upvotes": 0,
                                                                              "replies": {
                                                                                "h8jgsa2": {
                                                                                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8jgsa2/",
                                                                                  "text": "I'm mocking you, not trying to analyze and describe the modern FinTech system. I'm just taking this conversation as seriously as you are. I've taken interviews to develop ML and data driven approaches to finance, its hokum and not my cup of tea. You aren't some special boy for working in Fintech.\n\nI'm very happy. Thats literally what my post was about, I've found peace and balance. I've got plenty of friends, creative pursuits, a partner who I trust and get to share the world with; and I don't need to chase a career or salary to feel happy. I feel bad that you feel the need to brag online about your job and salary; that it gives you some status over others. It's sad that your entire personality and self worth revolves around that.\n\nYou're against them but you directly benefit from them, curious. You haven't listened or learned anything, still viewing things as a zero sum competition of survival.",
                                                                                  "author": "Outmodeduser",
                                                                                  "created": 1628693648,
                                                                                  "upvotes": 0,
                                                                                  "replies": {
                                                                                    "h8jkvt4": {
                                                                                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8jkvt4/",
                                                                                      "text": "[deleted]",
                                                                                      "author": null,
                                                                                      "created": 1628695379,
                                                                                      "upvotes": 0,
                                                                                      "replies": {
                                                                                        "h8jmdfh": {
                                                                                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8jmdfh/",
                                                                                          "text": "Whatever helps you sleep at night, since you can't actually argue or form a cogent point. Again, I'm living my best life and don't have my identity tied to my employment; like what kind of loser brags about their salary for a job they don't even work in full time yet? How insecure are you?\n\nI'll tell you this, I'll certainly be less miserable now that this conversation is over. Eat shit, pal. All the best :)",
                                                                                          "author": "Outmodeduser",
                                                                                          "created": 1628696003,
                                                                                          "upvotes": 1,
                                                                                          "replies": {
                                                                                            "h8jnwmb": {
                                                                                              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8jnwmb/",
                                                                                              "text": "[deleted]",
                                                                                              "author": null,
                                                                                              "created": 1628696648,
                                                                                              "upvotes": 0,
                                                                                              "replies": {
                                                                                                "h8ju4rt": {
                                                                                                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8ju4rt/",
                                                                                                  "text": "Huh? I thought you left. Bud, we are having an ideological discussion. It's all virtue signalling. You're standing up and defending the virtues of capitalism and I, communism. Your leaning into this trope of the 'hard working immigrant' culture and bootstrap mentality is virtue signaling. We just have different virtues. The very act of accusing someone of virtue signalling is virtue signalling, it's overuse devaluing its meaning. Nothing but an insult for the right wing to dismiss statements they disagree with while clinging to their own outdated virtues.\n\nI made plenty of arguments, you failed to read or understand them and instead focused on personal attacks and changed the topic once you couldn't argue anymore. If you feel it neccesary to have the last word, be by guest, but I can't talk with someone that can't listen.",
                                                                                                  "author": "Outmodeduser",
                                                                                                  "created": 1628699256,
                                                                                                  "upvotes": 1,
                                                                                                  "replies": {}
                                                                                                }
                                                                                              }
                                                                                            }
                                                                                          }
                                                                                        }
                                                                                      }
                                                                                    }
                                                                                  }
                                                                                }
                                                                              }
                                                                            }
                                                                          }
                                                                        }
                                                                      }
                                                                    },
                                                                    "h8jcw3v": {
                                                                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8jcw3v/",
                                                                      "text": "[deleted]",
                                                                      "author": null,
                                                                      "created": 1628691947,
                                                                      "upvotes": 0,
                                                                      "replies": {
                                                                        "h8jf3sd": {
                                                                          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8jf3sd/",
                                                                          "text": "Again, intellectually dishonest and lazy. I didn't know PragerU had a PhD program in Bullshit Spewing.\n\nBut no, according to Marxist ideology, as an employee of a hedge fund who's job it is to further the goals of Capital you are not a member of the working class. You are what socialists would call a class traitor. Which is a bad place to be in if and when a revolutionary movement takes root. People certainly lost their heads over less.",
                                                                          "author": "Outmodeduser",
                                                                          "created": 1628692917,
                                                                          "upvotes": 1,
                                                                          "replies": {
                                                                            "h8jfo1p": {
                                                                              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8jfo1p/",
                                                                              "text": "[deleted]",
                                                                              "author": null,
                                                                              "created": 1628693165,
                                                                              "upvotes": 0,
                                                                              "replies": {
                                                                                "h8jh68j": {
                                                                                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h8jh68j/",
                                                                                  "text": "Where did I say that? Im saying there is historical precedent for people loosing their heads for less, RE: the Jacobins. See this is the problem, we've got people who can't read and write with zero understanding of history entering the financial sector.\n\nEither respond to my points or fuck off.",
                                                                                  "author": "Outmodeduser",
                                                                                  "created": 1628693805,
                                                                                  "upvotes": 1,
                                                                                  "replies": {}
                                                                                }
                                                                              }
                                                                            }
                                                                          }
                                                                        }
                                                                      }
                                                                    }
                                                                  }
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h7v07qo": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7v07qo/",
      "text": "I found that I love teaching more than research, so I chose to take a leave of absence from my PhD program and accepted a tenure-track faculty position at a Community College. The work-life balance is so much better out of grad school, and while I make less than the starting salary at an R1, I work half the hours.",
      "author": "Schmidty102",
      "created": 1628200189,
      "upvotes": 22,
      "replies": {}
    },
    "h7uv7ph": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7uv7ph/",
      "text": "It just plain isn't healthy to live like that too. All that stress + lack of sleep can actually take off years of your life. Good on setting boundaries OP, it isn't worth it. You can still contribute a lot to research while also living a healthy schedule",
      "author": "Astsai",
      "created": 1628198037,
      "upvotes": 18,
      "replies": {}
    },
    "h7unu0d": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7unu0d/",
      "text": "A succinct version of this I read recently was \"your urgency is not my urgency\"",
      "author": "C29372",
      "created": 1628194929,
      "upvotes": 118,
      "replies": {
        "h7ut76g": {
          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7ut76g/",
          "text": "Absolutely! Always funny how papers that have been in her inbox for months become urgent two days before the deadline.\n\nThe quip 'A lack of planning on your part doesn't constitute an emergency on mine' came to mind but I felt that was inaccurate. There was an immense amount of planning to take on two appointments, a dozen students, tons of grants, and the responsibility therein. An immense amount of planning and work went into creating this situation.",
          "author": "Outmodeduser",
          "created": 1628197181,
          "upvotes": 64,
          "replies": {
            "h7uu4uj": {
              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7uu4uj/",
              "text": "You capture how I feel - sometimes I feel like “being busy” is used as an excuse when the amount of workload is caused by all the projects and students that a prof has taken on. Even more so when they’re tenured and don’t have the pressure to publish. \n\nAs an aside, I find it’s common that the profs who have taken on more than they can reasonably manage often end up generating poorer quality publications because they have to rush everything more than others do. Not sure if that’s the case with your advisor",
              "author": "C29372",
              "created": 1628197575,
              "upvotes": 25,
              "replies": {}
            },
            "h7v1a8z": {
              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7v1a8z/",
              "text": "It took over a year, but I can proudly say that we no longer submit grant applications at the literal last minute, and even have started writing them *weeks* in advance.\n\nAlthough, the entire clinical trial that my office mate and I wrote in 3 days still has the distinction of our best scored proposal, ever...",
              "author": "xixoxixa",
              "created": 1628200662,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "h7uldsi": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7uldsi/",
      "text": "Preach. Figuring out this boundary will be great for you in the future, especially when you have subordinates that you discourage from working at ungodly hours. \n\n\nAlso if anyone wants ammo to reject the \"I work too much to sleep culture,\" check out The Peter Attia Drive podcast episodes with Matthew Walker and Dr Walker's sleep research. It's fascinating and scary. Your advisor is literally working herself to death and no amount of grant money or h-score makes that worth it.",
      "author": "AMostAverageMan",
      "created": 1628193919,
      "upvotes": 52,
      "replies": {
        "h7utys0": {
          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7utys0/",
          "text": "Yeah, never feels fun to learn lessons like that, but certainly makes me more aware and better equipped for the future. We do yearly reviews, and I basically echoed that; no career is worth jeopardizing my health, mind, soul or however you want to go about framing it. It's literally killing her if she isn't exaggerating her sleep habits, long term health effects of stress and sleep deprevation are awful. My partner who is doing a PhD in Epidemiology joked she could hook my PI up with some late life sleep studies, but shes absolutely right; something like 80% of adult sleep disorders go undiagnosed because of the work-life culture we've developed.",
          "author": "Outmodeduser",
          "created": 1628197504,
          "upvotes": 16,
          "replies": {}
        },
        "h7vawyf": {
          "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7vawyf/",
          "text": "Isn’t the whole point of this post that every person should get to decide for themselves what they find valuable or fulfilling? Why doesn’t OP’s advisor have the right to also do that?",
          "author": "oakaye",
          "created": 1628205068,
          "upvotes": 0,
          "replies": {
            "h7vfnms": {
              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7vfnms/",
              "text": "They do, but they 100% do not have the right to impose those as expectations on their subordinates or peers. If the advisor feels the ability and desire to take on so much that they sleep 2 hours they are within their right. But they also need to understand that that cannot be the expectation for their students. OP mentioned that the overwork became the expectation and that's not good management. OP rightfully set up boundaries.",
              "author": "AMostAverageMan",
              "created": 1628207381,
              "upvotes": 15,
              "replies": {
                "h7vhof6": {
                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7vhof6/",
                  "text": "I 100% agree that they don’t have the right to impose it on others. I was more responding to your assertion that the amount of work she’s subjecting herself to isn’t worth it. \n\nHaving said that, though, I can see now that it’s possible that I mistook what you meant and what you actually meant was that it wouldn’t be worth it *to you*. If that’s what you meant, then I apologize for misunderstanding.",
                  "author": "oakaye",
                  "created": 1628208375,
                  "upvotes": 4,
                  "replies": {
                    "h7viedv": {
                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7viedv/",
                      "text": "Yea sorry, I can see you reading it that way. I can only control my sphere, so it should read \"not worth it for me.\" \n\nThat being said, if someone asked me or worked for me, my two cents would be to steer them away from that lifestyle. But at the end of the day, they could do whatever they wanted.",
                      "author": "AMostAverageMan",
                      "created": 1628208735,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "h7w76ix": {
              "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7w76ix/",
              "text": "Everyone has the right to decide for themselves what's valuable or fulfilling... But if you decide, say, heroin is what's most fulfilling to you, there will be consequences. I think work addiction is not a whole lot different. Especially if you have a family. If you're an absent parent, whether it be because of drugs or overwork, don't be surprised if your kids hate you and want nothing to do with you when they're grown. Academia fosters a culture of work addiction. And no addiction is *actually* valuable or fulfilling.",
              "author": "Various-Grapefruit12",
              "created": 1628221013,
              "upvotes": 10,
              "replies": {
                "h7xhvyc": {
                  "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7xhvyc/",
                  "text": "No matter how you prioritize your life, there is very nearly always an opportunity cost for whatever your individual priorities are. Outside of having a direct impact on you, you’ll never convince me that someone else’s consequences are your business to comment on or judge. That’s just as true when the consequences come from prioritizing work over other things as it is when the consequences arise from prioritizing other things over work.",
                  "author": "oakaye",
                  "created": 1628254824,
                  "upvotes": 0,
                  "replies": {
                    "h7z0rm1": {
                      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7z0rm1/",
                      "text": "If someone's consequences are having a direct impact on children then I consider it my business. If someone's consequences are having a direct impact on a culture I'm part of (e.g. academia) then I consider it my business. If someone's consequences *only* impact them then I'd consider it only their business. But when it comes to overwork, that's rare.",
                      "author": "Various-Grapefruit12",
                      "created": 1628278669,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h7ueus2": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7ueus2/",
      "text": "I relate to this so much, thank you for sharing. I hope to get to that place too someday.",
      "author": "Maliawka",
      "created": 1628191224,
      "upvotes": 7,
      "replies": {}
    },
    "h7u2d9q": {
      "link": "/r/GradSchool/comments/oynn9k/revelation_pis_lack_of_worklife_balance_is_not_my/h7u2d9q/",
      "text": "Very well said. The fact that anyone falls into this trap and feels that it's acceptable is beyond me. Seriously, nothing in academia is worth this toll on your well-being, and it will eventually have long-term effects on your relationships. My PI is also overworked, I feel fortunate to even get a timely email response from them even after two years of working in the lab. I hope the incoming generation of academics can shift things towards the expectation of a healthy work/life balance.",
      "author": "BeforetheBullfight",
      "created": 1628186199,
      "upvotes": 129,
      "replies": {}
    }
  },
  "updated": 1634065151
}