{
  "sid": "qloimf",
  "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/",
  "title:": "Thoughts on introducing your significant other to your PI?",
  "text": "She knows about my partner and asks about him often (possibly as just a “how’s everything going “ type of situation and we get along well and are generally casual with each other with the exception of when we’re working on something together. Though not at all time-sensitive, I’m wondering down the line if I should introduce my partner to her or if that seems unprofessional as a mentee to cross that boundary.",
  "author": "deepfriedokra",
  "created": 1635921121,
  "updated": 1636138139,
  "over_18": false,
  "upvotes": 67,
  "upvote_ratio": 0.91,
  "comments": {
    "hj4av86": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj4av86/",
      "text": "I brought my parents as my guests to an awards event my first semester of grad school. Aside from the fact my mom made more friends in a night than I did all semester, I don't think it's weird or unprofessional when it happens organically.",
      "author": "DontFeartheTeacher",
      "created": 1635922022,
      "upvotes": 209,
      "replies": {
        "hj50tx2": {
          "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj50tx2/",
          "text": "Why are moms so good at making friends? I wonder what their secret is.",
          "author": "callmegranola98",
          "created": 1635942119,
          "upvotes": 59,
          "replies": {
            "hj60215": {
              "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj60215/",
              "text": "Years of experience. Also I bet once a large chunk of your life is just working and child-rearing, after a little while you start to savour every last bite of whatever social situation floats your way.",
              "author": "ElectroMagnetsYo",
              "created": 1635957022,
              "upvotes": 21,
              "replies": {}
            }
          }
        },
        "hj56ykh": {
          "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj56ykh/",
          "text": "Your username checks out really well!",
          "author": "funkykookaburra",
          "created": 1635945284,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hj4k7va": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj4k7va/",
      "text": "My adviser takes group members out to dinner a couple of times a year and encourages us to bring partners. It’s not weird.",
      "author": "performanceburst",
      "created": 1635930205,
      "upvotes": 105,
      "replies": {
        "hj5bmr3": {
          "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj5bmr3/",
          "text": "Yeah, my wife's PI would invite everyonen in the lab and their partners over for dinner about once per semester. He was nice if awkward, but I always loved talking to his wife",
          "author": "BewareTheSphere",
          "created": 1635947417,
          "upvotes": 16,
          "replies": {}
        },
        "hj4wwv7": {
          "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj4wwv7/",
          "text": "Same here",
          "author": "PityUpvote",
          "created": 1635939826,
          "upvotes": 14,
          "replies": {
            "hj59pdx": {
              "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj59pdx/",
              "text": "Same here as well. Even people who graduated get invited",
              "author": "suckuma",
              "created": 1635946566,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "hj4mjx4": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj4mjx4/",
      "text": "I'm on very good terms with one of my PIs and I've been over to his house, together with my husband, and he's been over to our place with his wife and they even met my mom",
      "author": "abstractgoomba",
      "created": 1635932294,
      "upvotes": 35,
      "replies": {}
    },
    "hj4yk7d": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj4yk7d/",
      "text": "First, a caveat--there may be individual lab, departmental, local, regional, or national cultural differences; take any advice here with a grain of salt.\n\nMy own experience (large-city Canadian institution) was that it would be very unusual to arrange a *specific* outing to introduce your spouse to your PI. \n\nOn the other hand, back in the Before Times it was entirely unremarkable for partners to drop by when meeting or picking up a lab member for lunch or an evening event (for example).  If the PI was in, and not busy, then an introduction would be appropriate, followed by a modest amount of small talk.\n\nFinally, different groups and departments will have varying numbers of outside-of-work events, ranging from beer-after-work to holiday-party to backyard-barbecue. Each will have its own expectations about whether a \"plus one\" is invited. My own group used to do a lunch potluck before the winter break each year that was just lab members in a conference room; the lab next to us did an evening gathering at the PI's house where spouses were invited. Everybody's different.\n\nThe best summary I can think of is that the grad-student-PI relationship is much less like an undergrad-professor relationship and much more an employee-manager one. There's certainly still an authority gradient, but you're both adults. Your PI isn't a part of your family, or necessarily part of your circle of friends--but is a close coworker who will likely run into your spouse *organically* at least once or twice a year.",
      "author": "cryptotope",
      "created": 1635940822,
      "upvotes": 33,
      "replies": {}
    },
    "hj4tucu": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj4tucu/",
      "text": "I wouldn’t make a specific trip to do so but I would be very surprised if a natural opportunity doesn’t come up eventually. My partner was actually also a student under my PI so it wasn’t an issue for me but plenty of other students brought their partners and/or children to appropriate school events. I personally knew almost everyone’s partner and many of the professors in the department sort of knew them at least in passing. Not weird or unprofessional in my opinion.",
      "author": "14kanthropologist",
      "created": 1635937857,
      "upvotes": 30,
      "replies": {}
    },
    "hj5d97h": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj5d97h/",
      "text": "I wouldn't do an organized \"meet my partner\" thing, that's weird. But it's fine if your partner comes to a social event, or even just meets you at the lab when you're leaving and meets your PI if she's around",
      "author": "TheApiary",
      "created": 1635948104,
      "upvotes": 17,
      "replies": {
        "hj5sym5": {
          "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj5sym5/",
          "text": "yeah, this. A girl in my cohort arranged a special lunch for her advisor to meet her husband and her and her advisor weren't even on like amazing terms. She later said it was extremely awkward. :/",
          "author": "synesfreesia",
          "created": 1635954357,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hj4agrk": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj4agrk/",
      "text": "Only introduce her when it is necessary i.e. you meet your PI when you are with your SO.",
      "author": "Wise-Replacement7286",
      "created": 1635921704,
      "upvotes": 23,
      "replies": {}
    },
    "hj512jw": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj512jw/",
      "text": "My PI likes to get to know her students. So I've brought him up from time to time when it naturally came up and that was normal between us. She also gets really excited about weddings. The first time she actually met him was at my wedding this past weekend. I think if I time presents itself, introduce them, but don't force it.",
      "author": "Its_Just_Jen",
      "created": 1635942249,
      "upvotes": 5,
      "replies": {}
    },
    "hj53ema": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj53ema/",
      "text": "I think it's a good idea. If anything ever happens to you, if there's a medical emergency or your SO needs to pick something up on your behalf, then your PI will already know them.",
      "author": "imallakimbo",
      "created": 1635943492,
      "upvotes": 3,
      "replies": {}
    },
    "hj56t59": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj56t59/",
      "text": "It's not weird! I invited my whole group (of 5 people) and my PI to my wedding last month!! If you have a nice PI (and it sounds like they do) then I don't see any reason why it's not weird if it happens organically.",
      "author": "devonha",
      "created": 1635945211,
      "upvotes": 3,
      "replies": {}
    },
    "hj5m9yk": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj5m9yk/",
      "text": "I like to introduce my partner to my PI/coworkers so they can meet the people I complain about everyday",
      "author": "maroonstripedsocks",
      "created": 1635951761,
      "upvotes": 3,
      "replies": {}
    },
    "hj6mwxp": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj6mwxp/",
      "text": " I know how much spouses and partners have to sacrifice. It makes me happy to treat them to a nice dinner or buy them a bottle of wine to say thank you. I always appreciate those opportunities. Family gives up a lot for your PhD.",
      "author": "LegallyThrownFarAway",
      "created": 1635965669,
      "upvotes": 3,
      "replies": {}
    },
    "hj4dx9h": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj4dx9h/",
      "text": "I wouldn't unless we accidentally bump into each other somewhere and even then, I'll only reveal if my PI asks me who is the person I'm with.",
      "author": "givemeyourdonut",
      "created": 1635924553,
      "upvotes": 10,
      "replies": {}
    },
    "hj53wc0": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj53wc0/",
      "text": "Most labs arrange lab social events at which partners are encouraged to attend. That's where the meeting would typically happen. I assume that's not happening right now because of COVID but it will happen eventually.",
      "author": "tchomptchomp",
      "created": 1635943748,
      "upvotes": 2,
      "replies": {}
    },
    "hj6jwkl": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj6jwkl/",
      "text": "My godmother was a professor, and she would regularly throw parties and invite her PhD/Post-doc students. If your PI inquired about your SO, I don't see any reason not to introduce him.",
      "author": "Loumena",
      "created": 1635964518,
      "upvotes": 2,
      "replies": {}
    },
    "hj5qull": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj5qull/",
      "text": "Why would you?",
      "author": "cracklin_oats",
      "created": 1635953555,
      "upvotes": 1,
      "replies": {}
    },
    "hj59qzc": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj59qzc/",
      "text": "I would let her take the lead on this. If she introduces you to her partner or someone else important in her life, she's probably open to you introducing your partner to her. I introduced my partner to my advisor when we were at a work-related party to celebrate someone in our lab's publication. She brought her husband and introduced him to everyone there, so at that point I felt it was fine to introduce by own partner.",
      "author": "H2-van_g-O",
      "created": 1635946586,
      "upvotes": 1,
      "replies": {}
    },
    "hj5gmh7": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj5gmh7/",
      "text": "It depends on your relationship with your PI. Let it happen organically. My undergrad mentor was invited to his PI’s wedding and his PI went to one of the other students in that lab’s wedding. Think it’s all very subjective.",
      "author": "Pikalover10",
      "created": 1635949500,
      "upvotes": 1,
      "replies": {}
    },
    "hj5nnv1": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj5nnv1/",
      "text": "My now advisor happened to be at my PhD defense so he met my mom and partner (and brother and extended family). He's since met my mom and partner when they've visited town. It wasn't like a \"Hey this is my partner\" so much as an organic thing.",
      "author": "RoyalEagle0408",
      "created": 1635952311,
      "upvotes": 1,
      "replies": {}
    },
    "hj5xqo5": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj5xqo5/",
      "text": "I don't think it's unprofessional if it happens naturally, but it really could depend. For examine, a really close friend of mine is from a country in Asia, and one of the professors we worked with is also from that same country. The professor would ask about my friend's fiance, but my friend felt that the questions were more like the professor trying to be like a parent and see if this guy is \"good enough\". It's kind of complicated because I am not from that culture so I didn't really completely follow why she felt this way, but it had something to do with professor being an elder (and higher status) and the fact that, even if my friend started the conversation in English, the professor would speak in their native language where it is considered taboo to not speak to an elder in formal language and to be deferential, so there was no real way to say \"no\" without committing a faux pas. Bless my friend's heart, because they made consistent excuses for 5 whole years lolol\n\nIf you have a good relationship with your adviser, then I'm sure they are just genuinely interested in how youre doing so it would not be a big deal if you introduce your partner to them in a casual context. People in my department do it all the time, if we have a happy hour or department party, so it would not at all be unusual.",
      "author": "False-Guess",
      "created": 1635956160,
      "upvotes": 1,
      "replies": {}
    },
    "hj61mpe": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj61mpe/",
      "text": "Idk if this is just Geology, but I have seen the head PI on my project, and advisor (yeah, they are different people) straight up hammered at a party celebrating the end of field season. I don't find that unprofessional necessarily..it actually makes me respect them more realizing they're human.",
      "author": "latinageologist",
      "created": 1635957612,
      "upvotes": 1,
      "replies": {}
    },
    "hj6995o": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj6995o/",
      "text": "before COVID my PI used to take us out to a restaurant once a year and she always tells us to bring our significant others, so naturally that's when I introduced mine. I wouldn't go out of my way to do this, but if it naturally happens then why not. but this may depend on the culture where you go to and just how casual your PI is with their students.",
      "author": "4x1t",
      "created": 1635960476,
      "upvotes": 1,
      "replies": {}
    },
    "hj81k3j": {
      "link": "/r/GradSchool/comments/qloimf/thoughts_on_introducing_your_significant_other_to/hj81k3j/",
      "text": "I mean my PI came to my wedding so I think it’s case by case",
      "author": "mfs619",
      "created": 1635986286,
      "upvotes": 1,
      "replies": {}
    }
  }
}