{
  "sid": "lviokp",
  "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/",
  "title:": "Coping with the suicide of a labmate",
  "text": "My lab recently learned that we lost a labmate due to a probable suicide. I am wracked with guilt and regret that we could have done more to support her. We have a nose to the grindstone lab culture that does not leave ample room for social relationships. As a result I don’t feel that I knew her on a deep level but I am profoundly shaken by her death. I don’t know how to cope with these feelings or how to move forward. I feel angry at myself and my lab that we let her down. It feels wrong to throw myself back into my work and work towards research deadlines again but I don’t know what else to do.",
  "author": "moonlight_wanders808",
  "created": 1614628284,
  "over_18": false,
  "upvotes": 702,
  "upvote_ratio": 0.99,
  "comments": {
    "gpfbomr": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpfbomr/",
      "text": "It sounds like you should really consider how this environment could be detrimental to your mental health. Labs can be very toxic environments, working people to the absolute edge. I work in two grad labs and it’s sad to see the mental health status of everyone that works in them. I hope you can heal from this while also reflecting on your own situation. I know how hard it can be to leave a position when you worked so hard to to get there.",
      "author": "Nuttafux",
      "created": 1614700260,
      "upvotes": 1,
      "replies": {}
    },
    "gpf61mi": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpf61mi/",
      "text": "Just want to send you my condolences. I cannot imagine the feeling. \n\nI see that you already have a therapist. Even if you already had a meeting recently, don't hesitate to call / write directly to see if you can have another earlier. If she/he has a spot they will probably oblige.\n\nTake care... I wish you the best.",
      "author": "jtmooon",
      "created": 1614697669,
      "upvotes": 2,
      "replies": {}
    },
    "gperrle": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gperrle/",
      "text": "I’m so sorry for your loss. You’ve gotten some comments on this post that offer great advice and I hope that you’re able to take the time you need to process this event and move forward. \n\nThere’s a graduate student organization at my school designed to help students early in the program and prevent these things from happening. There are also similar organizations at other schools. As one commenter said, having a purpose and something to do may be helpful to you here, and if that would work for you, getting a group of students together and starting an organization like this on your campus could be something you could do to satisfy that need.",
      "author": "unicornsanshorn",
      "created": 1614689939,
      "upvotes": 1,
      "replies": {}
    },
    "gpehy77": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpehy77/",
      "text": "I’m so sorry that this happened to you and your class.\n\nMy closely-knit program lost one of our peers to a horrifically violent murder last year. We were obviously devastated, and our program faculty found itself in a conundrum due to the rigor of our program curriculum  that seemed to exist in conflict with our need to grieve and process this loss and trauma.  They did grant us some leniency with our assignments for a few weeks following the event, with the expectation that we would take the initiative to reach out to them if we needed an extension on a deadline. \n\nSomething that was tremendously helpful in giving us space to process our loss while staying on track academically was to hold a group counseling session with our school therapist.  I honestly felt apprehensive going into the session, but I noticed a major shift in the energy and outlook of my group as a whole, and feel that many of us turned a corner after that.  It’s so important to have space to fully process and move through these experiences.",
      "author": "PTAcrobat",
      "created": 1614682040,
      "upvotes": 1,
      "replies": {}
    },
    "gpdxsym": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpdxsym/",
      "text": "I am so sorry this happened and you are going through this. We lost a student in my program a little over a year ago, and I unfortunately think I know some of the feelings you are describing. Your lab mates may be processing these same feelings as well, and I hope you can be a source of support for each other. Please know and trust yourself in that you did the best you could with the information you had at the time.",
      "author": "kangarookarate",
      "created": 1614663700,
      "upvotes": 1,
      "replies": {}
    },
    "gpdjk01": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpdjk01/",
      "text": "I'm sorry for your loss. I think your feelings are normal, and I would definitely talk to someone about it, whether it is your therapist or a grief counselor, or both. I also think it's important to practice self care, whatever that looks like for you. Someone mentioned to be wary of advice suggesting that you throw yourself into your work, and I agree depending on who it's coming from. If it is helpful for *you* to take your mind off of things rather than watch Netflix and eat takeout, then I'd consider that part of self-care. If your PI is the one giving that advice, I'd look at it with some serious side eye. Work *can* be helpful for individuals experiencing a loss or some trauma, but it isn't always or for everyone, so I think the focus should be on your mental health, what you want to do, and what is best for you. \n\nI also very much agree with others suggesting that a serious look at the lab culture needs to take place. It's a huge red flag to me that you said your lab culture does not leave room for social relationships. Your PI's work is not that important, regardless what they think or what they say. You are human beings, not slaves or drones, and you have social needs as any human being does. If the lab work does not leave room for social relationships, then the lab work needs to change. I also feel like it's handicapping you and your labmates, because part of the educational experience in graduate school is networking. Unfortunately, it's not always what you know that helps secure a job, but who you know, so I think networking should be an integral part of any graduate education.\n\nIf your PI's work environment is one that gives you anxiety and depression, or contributes to it, that is a toxic environment. I know someone who was in a toxic lab and justified it for years before finally having a breakdown. They were diagnosed with PTSD. Any PI that contributes to a culture that gives their students the same mental disorder combat veterans get should be jailed, and blacklisted for all academic and research institutions for life. It's honestly not that hard to not abuse your students. I'd pay critical attention to how your labmate's suicide is addressed moving forward. Serious changes *should* be made moving forward and things should not just go back to normal in a week or two. This is a serious and traumatizing experience and needs to be treated as such, not just like a break from research or an inconvenience. It's good that he reached out via email, but the conspiratorial side of me wonders if he did that because email is official university communication and he reached out so there'd be a record. His actions moving forward would shed more light on whether this was genuine or something he felt like he had to do in case there was any questions.",
      "author": "False-Guess",
      "created": 1614655098,
      "upvotes": 2,
      "replies": {}
    },
    "gpdibh2": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpdibh2/",
      "text": "You seem to be compassionate and empathetic which is why you're feeling this so intensely. But please know the suicide had nothing to do with you and there was nothing you could have done. One of my colleagues committed suicide about ten years ago and afterward all of us wondered if we could have done something. But in all honesty, we had no idea what she was dealing with in her personal life. We had no idea why. All we could do is celebrate the time we had and tell her family stories about the time she worked with us. That meant a lot to her family and to our work group. I hope you can find a way to feel the feelings but not get too sucked into them.",
      "author": "SpiderDogLion",
      "created": 1614654429,
      "upvotes": 6,
      "replies": {}
    },
    "gpdhluv": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpdhluv/",
      "text": "I just listened to a recent episode, We Believe Each Other into Being, in the podcast On Being, and it really consoled me to listen their conversation on suicide. Check it out if you are a podcast listener.",
      "author": "gingeroo96",
      "created": 1614654048,
      "upvotes": 2,
      "replies": {}
    },
    "gpd8yo0": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpd8yo0/",
      "text": "I am absolutely sorry for your loss.  Please, PLEASE, please take advantage of on-campus resources like psychological counseling center and the student health center.",
      "author": "apl2291",
      "created": 1614649435,
      "upvotes": 1,
      "replies": {}
    },
    "gpd8jwb": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpd8jwb/",
      "text": "It’s not your fault. People punch out for selfish reasons",
      "author": "FeistyHelicopter3687",
      "created": 1614649220,
      "upvotes": -13,
      "replies": {}
    },
    "gpd7pt0": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpd7pt0/",
      "text": "I am so sorry.\n\nPlease just remember you had no idea this was gonna happen, and that you did al you could.",
      "author": "doingasifeel",
      "created": 1614648780,
      "upvotes": 1,
      "replies": {}
    },
    "gpd0yo1": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpd0yo1/",
      "text": "Honestly, I don't have much to give in terms of advice for how to cope. I can only relate to the labmate, where I felt really alone and isolated in my grindstone lab/department culture, and have seriously contemplated suicide. I don't think it's your fault, and I think a lot of it can be blamed on the culture of your lab. Sometimes, this kind of behaviour and culture was started from a few extremist students a while ago and just perpetuates for a long time, long past their graduation. Support and guidance for this kind of thing needs to come from the top-down, too, so the PI of the lab needs to also do more to foster a more open lab. If anything, I'd try to focus on yourself first to make sure you feel like you have enough social support so you wouldn't be next to suffer poor mental health, since it's apparent that your lab culture can cultivate it. Maybe also try to push for more openness in your lab now to try and prevent the cycle from perpetuating.",
      "author": "valryuu",
      "created": 1614645159,
      "upvotes": 8,
      "replies": {
        "gpfyj5h": {
          "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpfyj5h/",
          "text": "Thank you. I’m trying to take care of myself. I do believe that if she could talk to me, she would tell me that there was nothing I could do. I even think she would be surprised that I’ve reacted so strongly to this. In an alternate world I don’t think that I ever would have thought about how it would have affected her if I had been the one to take my life",
          "author": "moonlight_wanders808",
          "created": 1614710255,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gpcznvv": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpcznvv/",
      "text": "I have no advice for you except to affirm one thing: you have a right to be shaken up here, regardless of your relationship or closeness to that person. This is a perfectly normal reaction to witnessing or learning of a traumatic event. Allow yourself to feel that way without guilt or shame.",
      "author": "stolid_agnostic",
      "created": 1614644466,
      "upvotes": 2,
      "replies": {}
    },
    "gpcw2aa": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpcw2aa/",
      "text": "I've posted this on another thread in this sub but I'll repeat what I said there and some more:\n\nTake your time to grieve. It's natural and more importantly, human, to feel the loss of a life. It's important that you don't lose your empathy especially during this time and you are doing a good job of being empathetic. Do not change that. \n\nNext thing - it's not your fault. I've lost a few friends to suicide and if I could have, I would have treated all of them differently. But i cannot because that's how life is. Do not beat yourself up but rather reflect on whatever good times you shared. \n\nIf you wanna talk, my DMs are open. \n\nStay strong, OP.",
      "author": "kruger_schmidt",
      "created": 1614642568,
      "upvotes": 6,
      "replies": {}
    },
    "gpcrlu8": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpcrlu8/",
      "text": "All of the feelings you have right now are normal. It will take a lot of honesty and rawness to get through the work it will take to heal - but it will get better, if you take care of yourself.\n\nAt one point in my life, I was a teacher. One of my middle school students took his own life. I was the last teacher to talk to him that day and I was not in a great mood for a variety of reasons. I wasn't outwardly rude to him or anything, but I was usually a warm and fuzzy teacher and wasn't that day. If I'm totally honest, I still feel a twinge of guilt, but I have come to the realization that I was just one slice of my student's life. My interactions that day did not cause a young person to take their life. He made his horrible mistake based on a combination of factors that I probably could not have individually have stopped. \n\nI don't say any of that to gain sympathy here, but to say that I feel like you are where I was those years ago when it happened. It was not your fault. You are going to work through this and be kind to yourself. It was not your fault.",
      "author": null,
      "created": 1614640268,
      "upvotes": 18,
      "replies": {
        "gpeu8ut": {
          "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpeu8ut/",
          "text": "Thank you. Logically I can accept that it’s not my fault individually but I also can’t shake that I do need to accept part of the blame because I am a part of the lab culture that may have contributed to it. The idea that my labmates and PI may be accepting that it’s not their fault makes me mad because we all contributed to the lab culture. I don’t want everyone to think that the lab culture couldn’t have been part of the problem because I think it was, because it’s been part of the problem for me before, and I want it to change",
          "author": "moonlight_wanders808",
          "created": 1614691498,
          "upvotes": 2,
          "replies": {
            "gpfi0cb": {
              "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpfi0cb/",
              "text": "Well, I'd say that anger about lab culture sounds valid. I am in grad school for something in the social sciences, but from reading posts about what working in a lab is like, it sounds like it can be damaging. \n\nYou are a grad student though and your job was more to adjust to your environment, not make radical change. How much power did you really have to alter the culture of your lab? I'm guessing very little to none. Your anger is totally justified, but I don't think your guilt is at all. That doesn't mean you can't feel guilty, but just that it is something you should work through and one day let go of as much as possible. I really feel for you right now.",
              "author": null,
              "created": 1614703076,
              "upvotes": 1,
              "replies": {
                "gpfxmuz": {
                  "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpfxmuz/",
                  "text": "I guess you are right that I didn’t have much power to alter the culture, but I could have tried a lot more and I didn’t. I accepted that the lab culture seemed to work ok for my labmates and even though it wasn’t great for me I just needed to push through it. And so far I have been able to push through it. But my friend wasn’t able to and I could have tried to make it better for her but I didn’t. I don’t know, I just feel like my knowing that the environment hasn’t been great for me but assuming that it’s still ok for everyone else was an awful mistake that I can’t take back",
                  "author": "moonlight_wanders808",
                  "created": 1614709872,
                  "upvotes": 2,
                  "replies": {
                    "gpi58ia": {
                      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpi58ia/",
                      "text": "I read your comment the hour you posted it and have tried to response three times, but end up deleting my comment every time because I can't find the words to say. I guess if there was the right or perfect thing to say, I would say it and there just isn't....The feelings you're describing remind me so much of where I was when my student took his own life.\n\nWe all could always be better. But you're not the reason she took her life nor could you have stopped her. This isn't your fault. Full stop. \n\nThere are other things that I keep typing out and then deleting because I don't know how helpful they are. I see that others are telling you to talk to a professional. You should absolutely do that. You can also message me if you ever want to do so. I am all ears.\n\nThis might follow you for a long time, and it's going to change your perspective of the world. Please be kind to yourself. It's probably very raw right now, but if you take care of yourself it can heal. I promise.",
                      "author": null,
                      "created": 1614748759,
                      "upvotes": 1,
                      "replies": {
                        "gpja53g": {
                          "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpja53g/",
                          "text": "Thank you. Your comments and all the others have helped me to start working through what I’m feeling. I have a lot of people checking in on me and supporting me in real life too but it’s a lot easier to be completely honest about what’s going on in my head when I’m anonymous. I’m grateful for the support of so many kind strangers.",
                          "author": "moonlight_wanders808",
                          "created": 1614781058,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gpci24b": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpci24b/",
      "text": "I am so sorry for your loss. I don't have advice other than make sure you are taking care of yourself during this time. There is no wrong or right thing to do. If you want to keep working that's fine, but if you want to take a couple days off to process that is also okay. I can relate to what you're feeling right now, I was in an extremely similar situation a couple years ago. A couple months after I left my undergrad lab to go to grad school in a different state one of the grad students committed suicide. Our lab was extremely close, everyone (21+ undergrads, grad students, the PI) would go for drinks a couple times a month and we would hang out together outside of the lab often. None of us knew the grad student was struggling and even with being across the country I felt like I let them down because we texted the day before and I didn't sense anything wrong. I just want you to know that it'll get better with time and to reach out to a therapist/grief counselor or even your PI/lab members because they are likely feeling the same as you are right now.",
      "author": "DesertDreamer491",
      "created": 1614635603,
      "upvotes": 10,
      "replies": {}
    },
    "gpc7wby": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpc7wby/",
      "text": "I'm so so sorry. I see that you have a therapist, which is so important, and I want to encourage you to give yourself time and soace to process. That said, don't feel guilty about wanting to work, and if people judge you for that they don't get it.\n\nMy dad passed away about a year ago, he was losing his life to cancer but his passing was still unexpectedly soon. I was in lab when I got the news, I had a literal 24 experiment planned for that day (breaks every ~6 hours, but timepoints over 24 hours). Luckily my lab mates were able to cover my next time point so I could go home and bawl. But that night, I felt the overwhelming need for some kind of control or action in my life, and because there was absolutely nothing I could do about my father's death, I decided to go back into lab and finish the last late night/early morning time points. Probably looked crazy from the outside, but I had already talked on the phone will all my (small) family, couldn't start planning any services (everything was closed), and I don't know how to describe it, other than that accomplishing anything that day felt important for my soul? After that I took 2 full weeks out of lab for myself, which I also needed, but sometimes normalcy and productivity in small doses can be just as healing as other forms of self care.",
      "author": "kronning",
      "created": 1614631015,
      "upvotes": 65,
      "replies": {
        "gpccuat": {
          "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpccuat/",
          "text": "Thank you. This is a helpful perspective to hear. Lots of people keep telling me not to push myself with work right now but what is the alternative? The idea of sitting around and watching Netflix  instead of researching doesn’t make me feel any better than researching does",
          "author": "moonlight_wanders808",
          "created": 1614633201,
          "upvotes": 20,
          "replies": {
            "gpchfku": {
              "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpchfku/",
              "text": "I know exactly what you mean. So long as you pay attention to your needs/emotions and check that you aren't using work to avoid processing your feelings and experience, working can be weirdly therapeutic for some of us. Just pay extra close attention to your well-being, and do what you need to do.",
              "author": "kronning",
              "created": 1614635316,
              "upvotes": 10,
              "replies": {
                "gpci2jy": {
                  "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpci2jy/",
                  "text": "Now that I think about it more, I think that the idea of doing the things that I typically do for self-care/relaxation are especially unattractive to me right now. I usually do those things to reward myself for accomplishing something. And it feels completely wrong to reward myself for the death of someone who I liked and admired.",
                  "author": "moonlight_wanders808",
                  "created": 1614635609,
                  "upvotes": 9,
                  "replies": {
                    "gpdi8gr": {
                      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpdi8gr/",
                      "text": "I think that is part of the toxic productivity culture though, the idea that self-care can only come as a reward for an accomplishment or productivity rather than something that you deserve because you are a living, breathing creature who needs care. Even physical machines in the lab need maintenance, and humans do too, beyond just a bare existence. I realize it is easier said than done as this may come off as \"just don't feel guilty\" which one cannot really exactly reprogram. But there are maybe forms of self-care that you don't often access that you could and should right now so that you don't accidentally trigger the \"reward\" association in your brain. Long term part of taking care of mental health is allowing yourself to make space for the human needs of life beyond producing a tangible output that can be recognized and rewarded by others. It sounds like you are not in a work environment that allows that, and for that I am absolutely enraged on your behalf. I hope you can allow yourself the generosity that it sounds like you would absolutely extend to anyone else in this situation. If a friend came to you, what would you advise they do to take care of themselves? Maybe see if you can kind of step outside of yourself and pretend like you are giving someone else that permission, and then really you're taking it for yourself.",
                      "author": "ohsideSHOWbob",
                      "created": 1614654384,
                      "upvotes": 11,
                      "replies": {}
                    },
                    "gpdkd1l": {
                      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpdkd1l/",
                      "text": "What if instead of thinking of it as a “reward”, think of In December, a lab member from a lab close to mine (she was also a friend from my graduate program) passed away in a car accident. I ended up taking a few days off because I couldn’t imagine going back to work (to me it felt wrong to just return to normal and I also really didn’t want to face the people in my lab that also knew about her passing away because it felt like acknowledging it and I wasn’t ready to yet). I don’t really remember exactly what I did during those days. I know I spent some time in bed just doing nothing but thinking about my memories with her and crying. I attended some zoom memorials (and a small in personal candlelit vigil) and eventually I got to the point where I was watching Netflix or something and just kind of crying intermittently (especially as things in the show would remind me of her). I also took some time to connect with other friends of hers. And I wrote a letter to her. \n\nThen I needed to get back to work because I had a presentation to give the following week, but I took it easy. I only did as much work as I could. \n\nThis definitely doesn’t have to be your approach. If you feel like working will help you, then go for it. But if you need time off, I think you should take it. And I think any kind of self care you can give yourself doesn’t have to be thought of as a “reward”, but can be a way to take care of yourself during this difficult time. \n\nI’m so sorry for your loss and I hope you do want you need to, to take care of yourself 💙",
                      "author": "Cyto_Skeletal",
                      "created": 1614655540,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gpc2pph": {
      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpc2pph/",
      "text": "I’m sorry for your loss. As someone who has lost two people I knew fairly well to suicide, I can tell you that feelings of grief are normal. Does your program have counseling or therapy for students? If so, I’d talk to a professional in your case. Even if it’s just over zoom, they can be a good resource to understanding your feelings.",
      "author": "PsychologicalAd489",
      "created": 1614628736,
      "upvotes": 208,
      "replies": {
        "gpc3hax": {
          "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpc3hax/",
          "text": "Thank you. I see a therapist on a weekly basis but this news came the day after our weekly session so I still have a few more days until our session this week. I’m not sure whether I will be better off talking to my therapist who already knows me or reaching out to the grief counselors that the university has told us are available to us",
          "author": "moonlight_wanders808",
          "created": 1614629079,
          "upvotes": 75,
          "replies": {
            "gpc7zae": {
              "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpc7zae/",
              "text": "Why not both?\n\nAlso, the best thing to do is probably to look hard at what in the lab is unhealthy. One person got pushed too far, that probably means that other people in the lab are struggling, even if they haven't hit that same point yet.",
              "author": "Jaxom3",
              "created": 1614631050,
              "upvotes": 92,
              "replies": {
                "gpcckr8": {
                  "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpcckr8/",
                  "text": "I myself have been pushed into my worst depressive episode and have experienced horrible anxiety due to the pressures and expectations of our PI. I wouldn’t call it a toxic environment but it is extremely stressful and up until this point mental health has never been something that is openly discussed in our lab. I don’t have a lot of confidence that our PI is going to change how he advises due to this though and I don’t know how I can influence a change on my own",
                  "author": "moonlight_wanders808",
                  "created": 1614633081,
                  "upvotes": 54,
                  "replies": {
                    "gpcd6l2": {
                      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpcd6l2/",
                      "text": "Toxicity takes many forms, I would argue that \"pushed into a depressive episode\" is one of them. If your PI doesn't change, they're going to end up without a lab. Either due to people leaving, getting burned out, or worse. My point is that what's happened is a legitimately horrible and traumatizing experience for you and the rest of the lab. It should also serve as a wakeup call to take a close look at your own mental health and that of the people around you, even if that's \"just how things are around here\"",
                      "author": "Jaxom3",
                      "created": 1614633357,
                      "upvotes": 90,
                      "replies": {
                        "gpcdg2q": {
                          "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpcdg2q/",
                          "text": "Thank you. I needed to hear that.",
                          "author": "moonlight_wanders808",
                          "created": 1614633476,
                          "upvotes": 36,
                          "replies": {
                            "gpcdqtm": {
                              "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpcdqtm/",
                              "text": "\"I'm used to it, it's fine\" is one of the most subtly dangerous phrases in the English language. Stay safe out there friend, and try to find the light in life. If not today, then maybe tomorrow.",
                              "author": "Jaxom3",
                              "created": 1614633612,
                              "upvotes": 59,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "gpchzz3": {
                      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpchzz3/",
                      "text": "With this in mind, tread extra lightly with my \"normalcy/work can be therapeutic\" advice, and listen to the other comments here. Seriously evaluate whether you are working genuinely as a self-soothing or self-care act, or if it's a less healthy self preservation instinct to avoid the damaging pressures from your PI. Based on this comment I certainly wouldn't describe your lab as having a healthy environment....",
                      "author": "kronning",
                      "created": 1614635576,
                      "upvotes": 22,
                      "replies": {
                        "gpckneh": {
                          "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpckneh/",
                          "text": "Yes I see your point. Part of wanting to work is definitely an anxiety about not wanting to disappoint my PI with my progress on top of all of my feelings. He hasn’t said to the lab that we shouldn’t be worried about research output right now or that we should take a break. I’m not sure what to expect in our next scheduled meeting, or if we will even be meeting for out next scheduled meeting",
                          "author": "moonlight_wanders808",
                          "created": 1614636819,
                          "upvotes": 9,
                          "replies": {}
                        }
                      }
                    },
                    "gpdhg7q": {
                      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpdhg7q/",
                      "text": ">I myself have been pushed into my worst depressive episode and have experienced horrible anxiety due to the pressures and expectations of our PI. I wouldn’t call it a toxic environment\n\nThat is the definition of toxic, OP! I'm so sorry. Sometime when we are in the middle of feeling miserable, the misery feels \"normal\".",
                      "author": "peregrination_",
                      "created": 1614653965,
                      "upvotes": 8,
                      "replies": {}
                    },
                    "gpf24ec": {
                      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpf24ec/",
                      "text": "That is a very toxic environment. If you were working any normal job you would quit. Academia has brainwashed you, your lb mates, and many others into thinking toxic work environments are normal ans unchanging. Get help. Report the environment in your lab to an ombudsman.",
                      "author": "JamesTiberiusChirp",
                      "created": 1614695782,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "gped62w": {
                      "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gped62w/",
                      "text": "This needs to be reported to your lab mates family and the administration.  There may be a lawsuit here depending on the PIs recorded behaviors",
                      "author": "RyzenMethionine",
                      "created": 1614677215,
                      "upvotes": 1,
                      "replies": {
                        "gpetn7c": {
                          "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpetn7c/",
                          "text": "I do feel that something needs to be done but in terms of the PIs behavior the issue is really that he is a generally cold and impersonal person and he has high expectations for his students. I guess that’s why I initially said it’s not toxic, because he’s not intentionally cruel to his students. I just don’t know how much someone can be made to change a lab culture like that because those two aspects alone are not punishable offenses",
                          "author": "moonlight_wanders808",
                          "created": 1614691132,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gpdtufm": {
              "link": "/r/GradSchool/comments/lviokp/coping_with_the_suicide_of_a_labmate/gpdtufm/",
              "text": "Almost all therapists are equipped to handle grief, and as long as you already like and trust your current therapist, you should definitely continue your psych care with them.\n\nCall the office and see if your therapist can squeeze in an extra session. \n\nI don’t know you at all, and I am not a mental health professional, but my PhD was pretty damaging to my mental health, and I also lost a PhD friend to suicide last year. \n\nThis isn’t your fault. You couldn’t have stopped this.",
              "author": "thisdude415",
              "created": 1614661077,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634064611
}