{
  "sid": "pxhupk",
  "link": "/r/GradSchool/comments/pxhupk/creating_and_maintaining_a_healthy_social_life/",
  "title:": "Creating and maintaining a healthy social life",
  "text": "I'm a 23 year old man and I'm exactly 1 year into my program. I'm a PhD student in Maths and I do research in a small office. I'm \n\nI started September 2020 in the middle of COVID, so hardly any clubs were holding in person meetings back then, so I just didn't even go to any. I shut myself in my house, made small talk with my 2 supervisors, and kept in touch with my friends. \n\nAny advice for me? It's been really hard to navigate social life during COVID, at least for me.\n\nI was recently told I can return to the office but I've never physically met the people I'll be sharing it with- any tips on how to garner a good social life?",
  "author": "Erwin_Schr0dinger",
  "created": 1632868898,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "herdfiq": {
      "link": "/r/GradSchool/comments/pxhupk/creating_and_maintaining_a_healthy_social_life/herdfiq/",
      "text": "Depends on many things.\n\nDepends on your cohort.  Depends on your program.  Depends on personalities.  etc.  \n\nThe rule of thumb I've usually gone with is socialization is a two-way street.  They can extend an invitation to you but you've also got to extend an invitation to them.  Maybe try and organize something, like a bowling night or a poker night.  \n\nYou might have to be that friend that brings people together.  Or maybe they have someone who is willing to be the glue to organize something and gather people.  Who knows.  The important thing is to build an environment where you can be comfortable and sociable.  \n\nBut also recognize that not everyone has the time to respond nor give you the time.  It's not that they don't like you, it's that everyone might look like they have their shit together but grad school is like swimming.  You look fine above water but everyone's just swimming like mad to keep their head above the water.  Spending time on the social event might not be a high priority for them as they might need to finish X, Y, and Z within a given timeframe.  Just recognize that and continue to invite people who have previously (and regularly) rejected invitations to hang out.  This act of kindness does not go unnoticed.  \n\nGrad school is hard for everyone.  You're not alone (everyone who is new to the program all have the same worries).  You can always reach out to a more senior and sociable grad student to help you get to know other people in the program.",
      "author": "HalfEatenPie",
      "created": 1632943633,
      "upvotes": 1,
      "replies": {}
    },
    "henpmqa": {
      "link": "/r/GradSchool/comments/pxhupk/creating_and_maintaining_a_healthy_social_life/henpmqa/",
      "text": "The absolute best thing you can do, in my opinion, is build social connections outside of your department/program. Most cohorts split apart as people jump into their respective projects, whether its teaching, exam prep, or dissertation research and writing. I found that, for both my MA and PhD, I had to build some social circles outside. For me, martial arts, my volunteer work, and my different hangout spots (bar, coffee shop, etc) were all vital. During Covid, I had to navigate which ones I felt safe doing depending on my city's situation, especially before I got my vaccine.   \n\n\nIf you mostly stay remote, see if there is an online community like a game or hobby that seems appealing. I found MMO(s) work nicely, as something I can either zone out during or participate in raids/clan events actively.  \n\n\nAs far as your office mates go? Be polite and speak as you feel comfortable.",
      "author": "Kerokawa",
      "created": 1632872164,
      "upvotes": 8,
      "replies": {}
    }
  },
  "updated": 1634065572
}