{
  "sid": "q8t6ry",
  "link": "/r/GradSchool/comments/q8t6ry/does_anybody_have_a_mentoradvisor_who_is/",
  "title:": "Does anybody have a mentor/advisor who is extremely adept at expressing negative thoughts on your work but no real guidance/feedback? Is it wrong of me to feel frustrated or even angry?",
  "text": "For some background I'm an MS student who's in his 5th semester. I was supposed to graduate in August but my plan is to do a PhD abroad, and I applied last year and didn't get in anywhere so my advisor suggested I stay another semester. I've been desperately trying to get a paper with me as the first author out even as a preprint ever since February but have had no luck. The stress is starting to build up, and I don't know who else to talk to about this, so apologies in advance for the rant.\n\nAnyway I've been working with a PhD student in our lab for the past 7-8 months. Our lab is fairly large and our advisor is pretty much non-existent so the more junior students work with PhD students. My mentor's a 4th year PhD student who doesn't have any first-authored publications in venues that people in our subfield want to publish in. That's fine, I mean I'm not exactly in a position to speak but the past 7-8 months have been a little more than frustrating for me.\n\nThis particular senior of mine is a little...pessimistic. I'm not sure if that's the right word, but I'm also not sure what else to say. I'm differentiating between being \"critical\" and being \"pessimistic.\" For example, whenever I bring a new idea, his kneejerk reaction is \"I don't think this will work\" or \"this won't be able to make it past the reviewers.\" This is fine and is one of the reasons why having other people's opinions is important, but I also usually expect some sort of thought process to follow. Maybe something like \"I don't think this will work --- due to A, B and C.\" But there is usually either no convincing argument or after a lengthy conversation it often turns out that my mentor had a fundamental misunderstanding of the underlying task or what he was talking about. We usually spend 40-50 minutes just arguing over these things and it's frankly getting really exhausting. It doesn't exactly help that my mentor is also quite \"hierarchical\" (I'm from an East Asian country where that whole senior-junior hierarchy is quite real) and has the attitude of \"I'm the senior and you're the junior so I _have_ to be right.\"\n\nI'm writing this right now at 2 a.m. and am actually feeling really sad because I've really looked up to this guy up until when we started working together. I'm starting to wonder if I'm being an asshole and expecting to be spoon-fed, but when I see other PhD students mentor my friends I can see and feel the difference.\n\nI mean, I'm sure I'll be exposed to these types of and even worse scenarios as I progress into my career but yeah it sucks. Just wondering if anyone out there's going through or has gone through similar.",
  "author": "Seankala",
  "created": 1634318815,
  "updated": 1634332133,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgsbj68": {
      "link": "/r/GradSchool/comments/q8t6ry/does_anybody_have_a_mentoradvisor_who_is/hgsbj68/",
      "text": "I’m going to take this as a rant and just say I hope it works out for you to finish up and move on to your next step.",
      "author": "herpslurp",
      "created": 1634331925,
      "upvotes": 1,
      "replies": {}
    }
  }
}