{
  "sid": "rh86mo",
  "link": "/r/GradSchool/comments/rh86mo/questions_about_the_postdoc_process_as_an/",
  "title:": "Questions about the Post-doc process as an International PhD Student on an F1 visa",
  "text": "   I'm currently in my third year of a PhD program who recently completed candidacy (yay!) and am beginning to explore different labs with the plan of continuing in Academia, thus, am looking at a Post-Doc for the next steps. For some more background information, I am a Canadian citizen who is currently on an F-1 visa and am attempting to weigh out the options of transitioning my visa status and was hoping for some recommendations or assistance with the easiest process from others who have gone through a similar process?\n\nAt the moment, I am weighing out OPT vs. a TN (CAD-US) or H1B visa, but likely will continue in the post-doc position for 3-4 years as it's typical in my field of study, so I'm unsure at the best route to go for what I'm hoping to achieve. Thanks so much for any and all responses!",
  "author": "_Jalybean_",
  "created": 1639599201,
  "updated": 1639788537,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hoovy3d": {
      "link": "/r/GradSchool/comments/rh86mo/questions_about_the_postdoc_process_as_an/hoovy3d/",
      "text": "Correct me if I'm missing something, but why wouldn't you be put on a J1 visa for a post doc? My understanding is that TN visas are used for industry/staff positions (long term), J1 visas are used for post docs (contract based, max 5 years), and H1B visas are used for tenure-track faculty.",
      "author": "CuriousAboutLife0",
      "created": 1639600819,
      "upvotes": 2,
      "replies": {
        "hoowfov": {
          "link": "/r/GradSchool/comments/rh86mo/questions_about_the_postdoc_process_as_an/hoowfov/",
          "text": "Thank you for the response! J1’s are a potential option, but the issue with that would be the requirement that J1 visa holders are required to return to their home country and live for at least 2 years in order to be allowed to return to the United States",
          "author": "_Jalybean_",
          "created": 1639601014,
          "upvotes": 1,
          "replies": {}
        },
        "hooyaj0": {
          "link": "/r/GradSchool/comments/rh86mo/questions_about_the_postdoc_process_as_an/hooyaj0/",
          "text": "Actually, upon looking more technically since the department I work under wouldn’t be equated to medical training I could potentially be able to submit a waiver since I then would not subjected to the two year home-country physical presence test. \n\nFor some reason, I didn’t even consider that I would be able to be exempt. Thank you so much!",
          "author": "_Jalybean_",
          "created": 1639601737,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}