{
  "sid": "qshlst",
  "link": "/r/GradSchool/comments/qshlst/received_my_first_ever_c_on_a_paper_in_grad_school/",
  "title:": "Received my first ever C on a paper in grad school",
  "text": "Mostly just looking to vent here and wondering if if anyone else has run into this situation before. I’m working on a PhD in English literature and I just received a C on a midterm paper despite having only ever received A’s through my whole graduate career including my MA program. As I understand it, no one received higher than a B on this paper. \n\nHere is why this is especially annoying: the professor provided no rubric prior to submitting the paper. Three weeks after the papers were submitted, she said that she would give A’s only on the basis that a peer-reviewed journal would accept it with no edits. This rarely happens even on a paper that has been through several drafts. On top of that, she asked for what is essentially a synthesis essay. This is not the kind of essay one would even write for a journal publication. Further, if that was the grading criteria, students should have been made aware of this fact BEFORE submitting their papers.  \n\nI should also add that it took her a full six weeks to even grade and respond to the papers. We are on a quarter system and only have a ten week quarter. We are now expected to turn in a final paper that is an expansion of that midterm paper, with only a couple weeks to do so because we just now received our feedback. People are very angry and our next class period is going to be very awkward for her, that’s all I can say. \n\nAnyone else have any grading horror stories to share?",
  "author": "slaydiator",
  "created": 1636741932,
  "updated": 1636745956,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkdc1ap": {
      "link": "/r/GradSchool/comments/qshlst/received_my_first_ever_c_on_a_paper_in_grad_school/hkdc1ap/",
      "text": "Every program has that one professor that just doesn’t get it. Students always want to take it straight to the dean. Personally I just keep my head down and try to get through it. Usually nothing ever gets done despite multiple students stomping their feet and if you’re doing the loudest foot slamming your relationship with the professor suffers even more for the rest of the semester",
      "author": "Dustin_Bromain",
      "created": 1636745919,
      "upvotes": 1,
      "replies": {}
    }
  }
}