{
  "sid": "rh1pry",
  "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/",
  "title:": "I want to go to grad school but I'm a terrible candidate.",
  "text": "I [26M] have been playing around with the idea of going to get my masters in History since I finished undergrad in 2018 but due to educational burnout and what I now realize was a hesitancy for the career path I chose I ducked out of the grad school path and went into the workforce as a delivery person.\n\nFlash forward to now and I have no access to any of my undergrad work thanks to my old laptop dying, my academic career wasn't great in undergrad (I got straight A's in a brief follow up to try and get a teaching license from a university) and I have never really been the type to be outgoing enough with my professors to get recommendations. Outside of nailing the GRE and getting a very lucky break from the Grad school admissions; I feel like I'm just trapped in my current state with no way out. \n\nIs there anything I could do to remedy some of these shortcomings?",
  "author": "GMJizzy",
  "created": 1639582381,
  "updated": 1639788529,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.85,
  "comments": {
    "honkr1l": {
      "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/honkr1l/",
      "text": "Why do you want a masters in history?",
      "author": "Stereoisomer",
      "created": 1639582555,
      "upvotes": 12,
      "replies": {
        "hoq44ij": {
          "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hoq44ij/",
          "text": "I've wanted to teach history and originally wanted to teach public high school but every teacher i knew hated it and my own internship showed me that teaching in public school is just a nightmare and not rewarding enough compared to the work one puts in. So the plan was to get a masters for now, teach at a community College and potentially work up to a PhD.",
          "author": "GMJizzy",
          "created": 1639619511,
          "upvotes": 1,
          "replies": {
            "hoqieyr": {
              "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hoqieyr/",
              "text": "Id be really careful with this path. Barrier to entry is growing, even at the CC level in my experience. Its cheap for them to pay adjuncts and part timers, and the CC I had an in at basically replaced the full timers with those types of roles when they retired. Of the good positions, I don't know about history, but oversaturation and competing with PhDs for a masters level job can be a thing. I wouldnt feel great about my masters getting me stable college work. And not much work at all with my masters in high demand field that just wasnt from a top school. Thats all to say, that may be a high risk low reward option financially. Maybe my experience is not consistent with others though. \n\nFor what its worth, while high school can be a massive pain in the ass, the experience and pay can vary dramatically as you move around the country, and can be quite good.",
              "author": "wxectvubuvede",
              "created": 1639625865,
              "upvotes": 5,
              "replies": {
                "hos3anx": {
                  "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hos3anx/",
                  "text": "This is a gentle way of phrasing what should be a gigantic sign in capital letters saying DON’T DO THIS. There are tons of history PhDs clawing for community college jobs… and these aren’t bottom of the barrel PhDs either. Many of them are very accomplished. A master’s in history simply isn’t getting you anywhere in competing with them. It’s PhD or bust and even then, you have to realize and fully accept how bad your odds are for finding a job in any college setting for it to be even possibly a good idea.",
                  "author": "minicoopie",
                  "created": 1639662853,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "honnoy9": {
      "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/honnoy9/",
      "text": ">and I have never really been the type to be outgoing enough with my professors to get recommendations.\n\nThat doesn't matter as much as people think. Professors write letters for people who are quiet and shy all the time.\n\nProfessors recommendation letters are about your academic work, and not whether you talk to them several times or met with them in their office.\n\nSince you graduated recently, any classes for which you submitted papers electronically and the professor returned to you electronically, they may still have access to copies of your work and can review it to write a letter for you.",
      "author": "raistlin65",
      "created": 1639583696,
      "upvotes": 12,
      "replies": {}
    },
    "honxnyc": {
      "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/honxnyc/",
      "text": "First make damn sure that a history MA is the right choice for you. I studied history in undergrad and had my heart set on a history PhD and love history more than anything in the world, but I decided against it and switched fields. A terminal history MA is almost worthless honestly. I basically opens no new doors for you professionally, doesn’t appreciably increase your earning potential in most cases, and typically (though not always) you have to pay out of pocket for them because there’s not a lot of funding available. Im of the opinion that a history MA is only worth it if someone else is paying for it and you’re planning on doing a PhD afterward. PhDs are a whole other thing, but a history PhD also holds very little value right now.\n\nNow as for what you can do to increase your odds of admission and funding, research experience is the answer. One option is to just cold contact professors whose work you’re interested ina be ask if they have need of a research assistant. That will also met you a solid recomm letter.\n\nIf that doesn’t work, pick a research topic you’re interested in and pursue it. Pick up a Turabian Manual for a good beginning guide on how to choose and narrow down a research question, read all the secondary literature, visit the appropriate archive, and have fun! History is great as independent research is very accessible.\n\nThe other thing is to learn a language. It’s less critical at the MA level, but they’ll usually want you know at least one foreign language that you can research in.\n\nLastly, if you lost your old work, do you have any saved as email attachments from turning them in? Or can you log into your old canvas account still? I can still log into my undergrad canvas account and download every assignment I ever turned in as an undergrad.",
      "author": "ThrowawayHistory20",
      "created": 1639587621,
      "upvotes": 6,
      "replies": {
        "hookgd3": {
          "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hookgd3/",
          "text": "As a current PhD in History, I agree with this assessment about doing an MA in History. Getting into a History MA program is probably easier than you think because (in my jaded opinion) many serve as money makers for bigname universities (U Chicago, Georgetown, etc). And an MA in History does not open doors to specific careers, so it's not really an investment in a future career.\n\nI think its work asking yourself why you really want a Masters in History. If it's because you want to invest in one in order to have a shot at an Ivy League or equivalent PhD program and you have the means, maybe it is worth pursuing.",
          "author": "histfr9283",
          "created": 1639596404,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hoowwfc": {
      "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hoowwfc/",
      "text": "Others have mentioned looking at your motivations - if it is for career, then it may not be the right path. If you just love learning history and have the resources to afford graduate school and low to no income for the time being, then it may be okay.\n\nI also sense that you are lacking some confidence for some reason. It's normal to be unsure of yourself in new situations, but it does seem like your application would have some good qualities.\n\n&#x200B;\n\n>I feel like I'm just trapped in my current state with no way out.\n\nAre you talking about your psychological state, or your situation in life? Are you looking to do something other than delivery driving?",
      "author": "PeaceAndPrajna",
      "created": 1639601194,
      "upvotes": 3,
      "replies": {}
    },
    "hopc0v2": {
      "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hopc0v2/",
      "text": "I mean zero offense by this but I know it will SOUND harsh.\n\nDitch the excuses. If you still are willing to put in the work for a well-defined goal and have a timeline in mind for it, then work for it. If you aren't willing to problem-solve your way into grad school, it's not for you. It's not for anyone who wants to just walk into it and do the work that's put in front of them, even if they were perfect students with excellent references and curriculars. Those guys fail too.",
      "author": "ProprioCode",
      "created": 1639607120,
      "upvotes": 3,
      "replies": {}
    },
    "hoplwpi": {
      "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hoplwpi/",
      "text": "Hi there! Congrats on considering grad school! I'm a PhD student and have a lot of thoughts on this.\n\n&#x200B;\n\nFirst off, you totally can get into a program! However, the issue will be trying to get a funded program (in the US). A european masters would be fun and less expensive but you would have to pay full price. \n\nOne way to make your future application more competitive would be to start building up your portfolio for research and outreach related to history. (Start volunteering at a museum, find someone to team up with to do some personal research that you can publish somewhere, write some history related articles for a blog somewhere). These activities will get you some solid LORs. \n\nHeres some links of volunteer things that might spark ideas:  \n[https://www.zooniverse.org/projects?discipline=history&page=1&status=live](https://www.zooniverse.org/projects?discipline=history&page=1&status=live)  \n[https://app.unv.org/opportunities/1678467981469952](https://app.unv.org/opportunities/1678467981469952)\n\n[https://www.nps.gov/subjects/archeology/volunteering.htm](https://www.nps.gov/subjects/archeology/volunteering.htm)\n\n[https://gointern.com/course/cultural-museum/](https://gointern.com/course/cultural-museum/)\n\n&#x200B;\n\nWhat aspect of history are you thinking of studying? What is your dream job? I'm in an interdisciplinary research program, if there is any overlap in interests, I could help you get a little research project going.",
      "author": "somethinggood4once",
      "created": 1639611296,
      "upvotes": 3,
      "replies": {}
    },
    "hoptzy9": {
      "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hoptzy9/",
      "text": "What other work experience do you have?",
      "author": "OldSweatyBulbasar",
      "created": 1639614913,
      "upvotes": 1,
      "replies": {
        "hoq8805": {
          "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hoq8805/",
          "text": "A brief internship in a high school political science class before realizing that I wanted to go into higher ed/academia",
          "author": "GMJizzy",
          "created": 1639621316,
          "upvotes": 1,
          "replies": {
            "hoqnczi": {
              "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hoqnczi/",
              "text": "Did you work in college? What kind of delivery job is it?\n\nWhen applying to grad school they told me they were interested in people with solid work experience. I know some people with master’s degrees who have had trouble getting jobs in their field because they didn’t have much work experience in general. I guess it depends on the specific program you’re applying to, but this was my experience. I didn’t have experience in my field, wasn’t a straight A student, but they liked the fact that I had solid work experience combined with the research I’d done in undergrad.\n\nEdit: My program is really career-track focused, so I guess that makes sense. But I also echo what others have said about making sure an MA in History is something you really want. Grad school is exhausting and you’ve got to be dead set on it before jumping in or else it’ll be hard to find the light at the end of the tunnel.",
              "author": "OldSweatyBulbasar",
              "created": 1639628276,
              "upvotes": 1,
              "replies": {
                "hoqo7lf": {
                  "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hoqo7lf/",
                  "text": "In college I worked for the university with a program called Safe Ride meant to give students safe transportation from different points around campus after the local busses had ended their routes. \n\nPost undergrad I worked for FedEx as a delivery driver and now a different company as a delivery driver.",
                  "author": "GMJizzy",
                  "created": 1639628694,
                  "upvotes": 1,
                  "replies": {
                    "hoqomrx": {
                      "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hoqomrx/",
                      "text": "Are there any MA programs you’re really excited about? It never hurts to set up a meeting with the program advisor and talk about the program. That way you’ll be able to find out what they’re looking for in a candidate, and more importantly know if their program is the type of program you’re looking for. Cause again, if you’re not dead set, it’s brutal.",
                      "author": "OldSweatyBulbasar",
                      "created": 1639628913,
                      "upvotes": 1,
                      "replies": {
                        "hoqp7sj": {
                          "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hoqp7sj/",
                          "text": "I've only just started looking so I'm not sure what I'm looking for, or at leastwhat I should be looking for in a good MA program. The only thing I know is that I need it to be online so that I can keep working my day job which I've found at least one from a reputable school.",
                          "author": "GMJizzy",
                          "created": 1639629220,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hopvp44": {
      "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hopvp44/",
      "text": "I’ll ask a friend. Currently in a program and my close friend is 30yo and I am 22yo. Ping me tomorrow and I’ll send what he says!",
      "author": "lrntrng",
      "created": 1639615697,
      "upvotes": 1,
      "replies": {}
    },
    "hotg7ju": {
      "link": "/r/GradSchool/comments/rh1pry/i_want_to_go_to_grad_school_but_im_a_terrible/hotg7ju/",
      "text": "Others have touched on the need to make sure you have a solid plan (or, preferably, several) post-graduation. I can think of a few things you can do to better your odds of admission:\n\n\n-Research. Unless you're working on something obscure, *so many* sources are available online now. You could do your own independent research, or see if you could do something in connection with a museum or historical society. That gives you a chance to develop your writing sample (you want a strong one) and, if you do it through an outside org, to talk through your readiness for graduate study on an SoP.\n\n\n-Check with profs you had and see if they're able to write a strong recommendation for you. If they can't, they will say so. If you find you don't have any writers, it may be possible, albeit costly, to take some courses as a non-degree seeking student. \n\n\n-You want to look for schools with a good \"fit.\" What I mean is you want a program that's strong in your area of history, has faculty who fit your interests well, and if possible, has recently taken students with profiles like yours. My undergrad GPA was mediocre, but I got into funded programs because I was *extremely strategic* about where I applied and in articulating why that fit was so good.\n\n\n-Make sure you really nail that SoP. This and your writing sample are often your most important materials. Don't give them a generic \"I love history and this is my dream\" -- that's assumed. Talk about your research, the kinds of historical questions you want to answer, your vision for how you will utilize the resources within a particular graduate program for your professional development. Basically, you want to show that you're prepared to ask interesting questions and are the student they want to throw their money at.",
      "author": "torgoboi",
      "created": 1639682590,
      "upvotes": 1,
      "replies": {}
    }
  }
}