{
  "sid": "pwojuw",
  "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/",
  "title:": "GPA from 10 years ago hurting my chances, my current GPA of 2.57 is not good enough for any graduate program I apply for. How can I increase my chances if my more recent classes have really good scores recently semesters?",
  "text": "All my applications get denied because of classes I messed up when I was homeless 10 years ago. This is making my GPA at a nice disgusting 2.63 and its really not helping. Every page I send of letters of intent, it's like they just throw it out without looking at my reasons. Even though my last couple semesters I've had 3.2GPA's overall, it doesn't matter it feels.\n\nWhat's the point? I'm stuck in an endless cycle of submitting bunches of letters of recommendation and showing courses I have taken to improve myself, but all in all I feel like its all for nothing.\n\nI've been rejected from 6 different graduate courses related to Finance in the past 2 years. $700 in fees down the drain so far.\n\nPlease, any tips on successfully applying with such a low GPA? I've even mentioned non-matriculated but that doesn't seem to help.",
  "author": "TheSaltIsNice",
  "created": 1632770984,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.8,
  "comments": {
    "hekz5bc": {
      "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hekz5bc/",
      "text": "I had a 2.82. I’d try to reach out to professors or heads of departments and ask them for advice. Don’t write some long response, just 7-8 sentences describing your situation and that you are super motivated to go to graduate school. It’s possible a department head or professor may want to help, supporting you through the application process. Are your letter of recs from academics? If they are, consider asking them for advice.",
      "author": "meteorchopin",
      "created": 1632828024,
      "upvotes": 1,
      "replies": {
        "heldiq9": {
          "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/heldiq9/",
          "text": "Hey. You were able to do grad school with a 2.82?\n\nThis gives me confidence",
          "author": "TheSaltIsNice",
          "created": 1632836086,
          "upvotes": 1,
          "replies": {
            "henkenh": {
              "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/henkenh/",
              "text": "I probably applied to ten places over two years. I got two offers without funding at programs that were not ranked very high. But I used those masters programs to do well academically and get a publication, so I could pursue a PhD. My field is in the physical science so it might be different than your field. What ended up working in my favor was a LOR from a senior famous person in my field.",
              "author": "meteorchopin",
              "created": 1632869725,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hejxlsg": {
      "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hejxlsg/",
      "text": "Do you have to report grades that old? Find out how far back they want them to go? Include everything you just told us in your personal statement if they do. Take some harder courses and ace them to show them what you can do. Let us know when you get in. You’ve got this. See you at the finish line buddy.",
      "author": "cyberwiz21",
      "created": 1632799561,
      "upvotes": 2,
      "replies": {}
    },
    "hejgron": {
      "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hejgron/",
      "text": "Why are you so sure it's the GPA? Have they indicated that to you?",
      "author": "Wherefore_",
      "created": 1632791549,
      "upvotes": 1,
      "replies": {
        "hejgylk": {
          "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hejgylk/",
          "text": "It’s a 2.57 GPA where most graduate programs require 3.0 or higher. Yes, lmao",
          "author": "TheSaltIsNice",
          "created": 1632791638,
          "upvotes": 1,
          "replies": {
            "hejh6hh": {
              "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hejh6hh/",
              "text": "Yikes okay. I just assumed you weren't applying to schools that had a GPA requirement that far above the one you have.",
              "author": "Wherefore_",
              "created": 1632791741,
              "upvotes": 1,
              "replies": {
                "hejj1l3": {
                  "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hejj1l3/",
                  "text": "I’m confused.\n\nThere are extremely few graduate programs that advertise less than a 3.0.\n\nI’m not being picky. It’s just any actual college has pretty strong GPA requirements.",
                  "author": "TheSaltIsNice",
                  "created": 1632792589,
                  "upvotes": 2,
                  "replies": {
                    "hejmllw": {
                      "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hejmllw/",
                      "text": "Some don't have minimum GPA requirements to get in, just to stay in the program. I figured you were applying to those, considering I personally wouldn't spend money to apply to a program when I didn't meet the requirements posted.",
                      "author": "Wherefore_",
                      "created": 1632794218,
                      "upvotes": 2,
                      "replies": {
                        "hejnh8e": {
                          "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hejnh8e/",
                          "text": "I hate my life lmao. Why should classes taken back in 2009 hold any bearing to 2021 smh…",
                          "author": "TheSaltIsNice",
                          "created": 1632794629,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hejfwsm": {
      "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hejfwsm/",
      "text": "Look into if your current school has academic clemency policies. Usually, if you have sufficiently old low grades you can apply to have them removed from contributing to your GPA if you provide the extenuating circumstances. I reccomend talking to an advisor at your institution to see if they can help you make your GPA more representative of your current abilities and progress. Good luck!",
      "author": "magletix",
      "created": 1632791163,
      "upvotes": 3,
      "replies": {
        "hejh14x": {
          "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hejh14x/",
          "text": "Wait, this is extremely useful. Can you provide more info? I’d like to immediately bring this up with my college",
          "author": "TheSaltIsNice",
          "created": 1632791670,
          "upvotes": 1,
          "replies": {
            "hemlrnc": {
              "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hemlrnc/",
              "text": "I'm not sure what it would be called at your school, but I've seen it called \"academic clemency\". Usually if you reach out to your registrar's office or your academic advisor they may be able to point you to the correct form. If you want, DM me your institution and I can take a look.",
              "author": "magletix",
              "created": 1632854667,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hej5tq2": {
      "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hej5tq2/",
      "text": "I had a 3.75 in my undergrad but I failed two classes finance, and an ethics class. If I’m not doing well I shut down. Like I can’t just take a c. So I retook both and my gpa shot up. Now the fs don’t count towards my gpa and I got in a super competitive masters at uw and completed that with a 3.88.  I’m in a 2nd masters at Georgetown in project management and I have a 4.0. We are more than our worst moments. I’m not even mad at my old self she did the best she could. Just retake them and the new grades replace them.",
      "author": "beanie1816",
      "created": 1632786442,
      "upvotes": 3,
      "replies": {}
    },
    "hej59oj": {
      "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/hej59oj/",
      "text": "Reach out directly to professors you’re interested in.\n\nIf they like you, they can pull your application from the auto-sorter and make sure it gets to the admissions committee.",
      "author": "Weekly-Ad353",
      "created": 1632786175,
      "upvotes": 1,
      "replies": {}
    },
    "heia7ro": {
      "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/heia7ro/",
      "text": "Can you retake a couple of your lowest scoring classes to boost your GPA?",
      "author": "HobbitStomper",
      "created": 1632771644,
      "upvotes": 11,
      "replies": {
        "heib3l4": {
          "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/heib3l4/",
          "text": "That's an interesting point. I'll definitely consider this",
          "author": "TheSaltIsNice",
          "created": 1632772043,
          "upvotes": 5,
          "replies": {
            "heiiu3d": {
              "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/heiiu3d/",
              "text": "That's what worked for me, but I was also going to a community college at the time and trying to apply to a 4-year school. Classes were a lot cheaper to retake at a community college. However, by the time I was done, I had boosted my GPA from 2 something to over 3.6. I just started with the lowest scoring classes first. There were a lot of 2.0s on my transcript. It took me about a year to take enough classes to boost my GPA and get me into the university.\n\nWhatever happens, I hope it works out for you. That sounds like a shitty situation.",
              "author": "DecoherentDoc",
              "created": 1632775521,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "heia4mp": {
      "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/heia4mp/",
      "text": "It is hard to know exactly how to help you, but I had a similar experience. I had a ton of things in my life at a couple different times that caused me to have a lower GPA, probably about the same as yours. I was easily able to get into the program I applied for and now I’m 3 classes from graduation and I have maintained a 4.0 while working full time. Here is what worked for me: I explained my circumstances in my application letter but in a way that was not a pity party or too much of a downer, I explained what is different in my life now, and I had two very strong professional letters of recommendation. I also did not apply to a sought after school, I applied to a smaller state school with a great program in my subject that is very affordable. I work in the field I am studying which is Higher Ed., so that also helped. \nGrad school is a capitalist enterprise, even at public schools. Apply to less popular ones that are looking for students and you are more likely to get in. \nBest of luck and I hope it works out for you!",
      "author": "MaybeBabyBooboo",
      "created": 1632771605,
      "upvotes": 3,
      "replies": {
        "heib7fx": {
          "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/heib7fx/",
          "text": "Homelessness was a big part of why I had to leave college and get many F's for a few years back in 2014",
          "author": "TheSaltIsNice",
          "created": 1632772091,
          "upvotes": 1,
          "replies": {
            "heibhjq": {
              "link": "/r/GradSchool/comments/pwojuw/gpa_from_10_years_ago_hurting_my_chances_my/heibhjq/",
              "text": "I experienced that too. Also DV, and a brain injury. I think it’s important to explain the situation to show that things are different now and that you are resilient, without dwelling on it too much. It can be challenging to find that right balance. Speaking to your GPA in later terms should help too.",
              "author": "MaybeBabyBooboo",
              "created": 1632772215,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634066937
}