{
  "sid": "ripuzi",
  "link": "/r/GradSchool/comments/ripuzi/original_thoughts_by_undergraduates_should_they/",
  "title:": "Original thoughts by undergraduates - should they never be included in an article?",
  "text": "A friend of mine is writing their first paper as part of an assignment. They're studying English translation and the research has to do with that.\n\nThey haven't had much guidance from their tutor, so they feel uncertain about how to go writing the paper in terms of quotes and paraphrasing.\n\nThey asked some questions such as:\n\n> Am I supposed to never include my own original thoughts in the paper?\n\nNot to get too philosophical by saying it's probably unlikely we've had thoughts no one has ever thought of first, but according to my understanding, an undergraduate student should stick to paraphrasing in their own words and only sometimes directly quoting pieces of text, while \"original thoughts\" could be left for sections such as the methodology/results/discussion/conclusion, and perhaps a little bit in the introduction, depending on the type of the article.\n\nIs this a fair assessment?\n\n> What is the point of me paraphrasing rather than sticking to directly quoting other articles while making sure to reference them properly? After all, I could never say things better than these experienced authors did.\n\nI think that is not the right mentality to have. I think the point is to learn how to write a paper and to put in the effort and show that actual research has been done, rather than copy/pasting portions of text. Why is this done? I don't know, but I do know this is how it's been done for centuries.\n\n>I'm not sure how to paraphrase and reference a collection of ideas into an amalgamation in a single paragraph in my own words, rather than paraphrasing each idea separately\n\nI think this can be done just fine - I've seen references written as something like [2-6] for example, following a piece of text that has taken something from references 2, 3, 4, 5, and 6, for example. I'm not sure how easily this can be done in APA/MLA styles, though.",
  "author": "TheMaxClyde",
  "created": 1639772164,
  "updated": 1639788482,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hoz3j0u": {
      "link": "/r/GradSchool/comments/ripuzi/original_thoughts_by_undergraduates_should_they/hoz3j0u/",
      "text": "> Am I supposed to never include my own original thoughts in the paper?\n\nIt's not quite clear to me what you mean by this. Original thought should be put into research every step of the way, from the design of the study to the words in the paper.\n\n> an undergraduate student should stick to paraphrasing in their own words and only sometimes directly quoting pieces of text, while \"original thoughts\" could be left for sections such as the methodology/results/discussion/conclusion, and perhaps a little bit in the introduction\n\nMy field is in the physical sciences, which has a different culture, but we were taught to never quote. It was highly stressed, so I will repeat, do not put quotations of any other work in your paper. It is not appropriate. If you are writing a book, sure, but a technical paper in a journal, no. If you have a quote that is data of your study, sure, that is fine, but not direct quotes of other work. You should always paraphrase the other work without plagiarism. Read the other work, put it away, and type original words/sentences about that in your paper. \n\n> I think that is not the right mentality to have. I think the point is to learn how to write a paper and to put in the effort and show that actual research has been done, rather than copy/pasting portions of text.\n\nYes, exactly. This is the way. The reason is that researchers have so much to read and do, they don't want to waste time reading your second-hand work that adds nothing to the original. It is also the intellectual product of another and they deserve the reputation for their original work. Briefly describe it in your own words and cite it. \n\n> I've seen references written as something like [2-6] \n\nYes, that is acceptable and standard. Just makes sure to follow a consistent formatting guideline appropriate to the targeted journal/audience.",
      "author": "Pancurio",
      "created": 1639778661,
      "upvotes": 1,
      "replies": {}
    }
  }
}