{
  "sid": "r468f4",
  "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/",
  "title:": "What does the transition to Grad School look like?",
  "text": "Hello all! I'm currently applying to grad school for admissions next fall and am starting to get a little stressed out about what the physical transition looks like. I don't so much mean about classes or research or anything like that. I'm more concerned about what the rest of life is like. For me, I'll likely be moving halfway across the country to a place I've never been to without knowing anyone else there. That's a little worrying. So what are the logistics like of finding somewhere to live and everything like that? Do you have a part-time job outside of classes as well? Any sort of advice and/or stories about these types of questions would be incredibly helpful!\n\nI'd love to hear about anyone's experiences and if anyone has any advice for an incoming graduate student! Thanks all in advance!!",
  "author": "akirchman16",
  "created": 1638111845,
  "updated": 1638207955,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.77,
  "comments": {
    "hmeuyrz": {
      "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmeuyrz/",
      "text": "Started my first semester in September. Moving cross-country wasn't an issue for me because I did it for my undergrad as well (CA to AL for undergrad, AL to PA for PhD). Maybe not the most qualified voice here, but here's a couple pointers:\n\n1) Doing your homework on which landlords are best pays dividends. Browse the local subreddit page for the town you're moving to, they'll tend to have a FAQ on the best options for certain items such as neighborhoods for students, landlords, life with/without a car, etc. There are some real shitty landlords that you do *not* wanna subject yourself to on the first semester fighting to get basic maintenance done, especially if you're moving into a neighborhood with older buildings that need more work. Losing sleep because your landlord refuses to do something as simple as swap a dead smoke detector battery in the common areas really blows.\n\n2) I wouldn't leap at a part time job right away. It's easy to over-commit and might cause issues. I had to drop a class this semester because I stretched myself too thin, thinking things would be just like my undergrad and that I could survive doing 1.5x full time in terms of credit hours. Find a good class load balance, then consider getting a job from there. This also gives you an opportunity to look for paid research opportunities instead if you didn't get one off the bat, which will do a lot more for your degree than flipping burgers or some other part time gig. Be sure to ask some of your first-semester professors about research, as not everything gets posted per se. Networking and asking around is king.\n\n3) Pick a hobby and use that to find local friends. For me, that was DnD, but whatever floats your boat. It's been super helpful to have somebody local to hang out with in a new city, especially having friends not tied to school/research.\n\n4) Attend as many of the school new-student events as humanly possible. You'll want acquaintances and want them right quick once classes start. My mom's a professor and has drilled it into me that graduate classes aren't made to be soloed, working together is key (so long as you don't cross the line into cheating), and that advice really came back to bite me when I had to drop a class - I knew none of my classmates for half of the semester and the professor was less than helpful in office hours, so I had no real help to dig myself out of a hole and salvage my grade.",
      "author": "David375",
      "created": 1638115446,
      "upvotes": 7,
      "replies": {
        "hmfdfn2": {
          "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmfdfn2/",
          "text": "About 3 - I'm into D&D as well and I'd love to join a group if I end up moving somewhere for grad school! How did you go about finding a D&D group ?",
          "author": "KnifeShoe",
          "created": 1638123152,
          "upvotes": 2,
          "replies": {
            "hmhi30w": {
              "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmhi30w/",
              "text": "I watched r/lfg like a hawk and found a listing for a local game that wasn't related to school, but it's also worth checking your school subreddit for a games club where you can find stuff like that. Another good option is the feature Discord recently released that allows you to join a school-specific hub of servers. That got me connected with a school tabletop game club right quick before I even got to campus.",
              "author": "David375",
              "created": 1638155393,
              "upvotes": 2,
              "replies": {
                "hmhi485": {
                  "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmhi485/",
                  "text": "Here's a sneak peek of /r/lfg using the [top posts](https://np.reddit.com/r/lfg/top/?sort=top&t=year) of the year!\n\n\\#1: [Thanks to donors we were able to give away 55 D&D 5e Player's Handbooks and 100 sets of dice to lfg users unable to afford them this month. I am awed by the generosity of our donors and glad to welcome so many new users to our ranks. Although on hold for now, there will be future giveaways.](https://np.reddit.com/r/lfg/comments/l4rlr4/thanks_to_donors_we_were_able_to_give_away_55_dd/)  \n\\#2: [If you literally can't afford a 5e Player's Handbook, I want to give you one. With the help of donors I have given away fourteen already and still have more.](https://np.reddit.com/r/lfg/comments/kok7xk/if_you_literally_cant_afford_a_5e_players/)  \n\\#3: [If you literally can't afford a 5e Player's Handbook, I want to give you one. With the help of donors we still have more to give.](https://np.reddit.com/r/lfg/comments/ktu1am/if_you_literally_cant_afford_a_5e_players/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[Source](https://github.com/ghnr/sneakpeekbot)",
                  "author": "sneakpeekbot",
                  "created": 1638155409,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmgba35": {
      "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmgba35/",
      "text": "Started my first semester in August of 2020. Fortunately moving wasn’t to difficult as the school I go to is just a couple of hours away from my hometown. Occasionally I will do some work study on the side to make some money, but I’ve been fortunate enough to have parents to cover rent and tuition. \n\nAs far as adjusting to grad school. It is very rough. Or at least it was for me because the pandemic was in full swing. I didn’t even have a traditional class until this past August. \n\nAll I can tell you is this. The next couple of years are going to be some of the toughest and most transformative years of your life. You will be challenged in ways that you didn’t think possible. And by the time it’s over, you will not be the same person you were going in. Trust me, I know what I’m talking about. I’m not even finished yet and mentally I feel a lot differently than I did going in. \n\nThat being said, you will do fine. Just don’t let deadlines sneak up on you. And try to make time for breaks and exercise. If you abuse your physical health, your mental health will suffer as well. If anything else, if you are going to screw up, get it out of the way early.",
      "author": "MrUnknown1996",
      "created": 1638136606,
      "upvotes": 4,
      "replies": {}
    },
    "hmenea2": {
      "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmenea2/",
      "text": "It is a lot like going to college.  My social life suffered until I learned that undergraduates are more fun than graduate students, and started hanging around with them instead in my off hours.",
      "author": "drzowie",
      "created": 1638111984,
      "upvotes": 10,
      "replies": {}
    },
    "hmfqcap": {
      "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmfqcap/",
      "text": "If you have any kind of assistantship/funding, your contract might have a clause saying you’re disallowed or strongly discouraged from getting outside work while school is in session. Some programs offer seasonal work for summer/winter; others don’t. Mine doesn’t, and I ended up getting a seasonal job where I befriended other students, mostly undergraduates. Like other comments in this thread mention, I enjoyed their company a lot more than I thought I would. I thought my cohort and I would all become instant ride-or-die buddies but this wasn’t the case. The rest of them all have live-in significant others and I don’t, so there’s this awkward gap between our lifestyles. So I highly recommend taking work outside of the university in the off-season if your situation allows it.",
      "author": "garbage_eater_1996",
      "created": 1638128223,
      "upvotes": 2,
      "replies": {}
    },
    "hmg8gmb": {
      "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmg8gmb/",
      "text": "Good luck! I moved 7 hours away for my phd and didn't know anyone in the city. I found my current apartment and roommate on a local facebook group (there are usually roommate/housing facebook groups for each city, at least in my region). My phd stipend and savings cover most of my living expenses, though I did also take out a small student loan. I had a part-time job for a bit but it was too much for me. Honestly it's very tough being far from family for me, but i've made good friends through my program.",
      "author": "boyoftm",
      "created": 1638135467,
      "upvotes": 2,
      "replies": {}
    },
    "hmep9tl": {
      "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmep9tl/",
      "text": "I feel like this transition is very different from program to program. I’m in a department that’s composed of mostly international students so whenever someone new comes people tend to reach out to you and help you find an apartment. We also have donated home essentials in storage for whenever a new student comes into the department with nothing other than clothes. If your department has a big international community it’s possible that similar things happen. To make friends a just reached out to other Latino students that took me in immediately. In terms of a job outside of school I can’t have one, and this is true for most students on a fellowship. But I know that people in social sciences and outside of STEM have a harder time getting fully funded in their program and might have to keep an job to avoid a huge debt. A last piece of advice, don’t hesitate to ask your advisor about these things they probably already had students that went through your same experience and can help you find solutions.",
      "author": "methanies",
      "created": 1638112884,
      "upvotes": 1,
      "replies": {}
    },
    "hmfr6st": {
      "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmfr6st/",
      "text": "I’ve moved around a bunch for work and now grad school. Common theme for making friends and getting comfortable for me has been spending time mountain biking or hiking. You’ll probably be mostly solo for a bit, but if you have a car its a good way to get familiar with an area. \n\nRe. Finding a place to live, that’s pretty much universally tough. If you can contact other grad students in your program, ask what neighborhoods they live in. I was able to get in touch with a couple grad students who are housemates this way and its been working out well.",
      "author": "Psychological-Ear-32",
      "created": 1638128564,
      "upvotes": 1,
      "replies": {}
    },
    "hmfyj0d": {
      "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmfyj0d/",
      "text": "Less of a transition and more of a slap in the face. But a good slap in the face?",
      "author": "C29372",
      "created": 1638131526,
      "upvotes": 1,
      "replies": {
        "hmgbgo5": {
          "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmgbgo5/",
          "text": "There’s no such thing.",
          "author": "MrUnknown1996",
          "created": 1638136681,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmgwz73": {
      "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmgwz73/",
      "text": "Fun",
      "author": "RedFlutterMao",
      "created": 1638145829,
      "upvotes": 1,
      "replies": {}
    },
    "hmh5z6q": {
      "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmh5z6q/",
      "text": "Make a budget and live in the cheapest possible accommodation. I’ve never been so stressed out about finances. Consider saving a few thousand before your move.\n\nAlso look into sharing a pod with someone if you want to bring your stuff",
      "author": "IcyPresence96",
      "created": 1638149910,
      "upvotes": 1,
      "replies": {}
    },
    "hmhswul": {
      "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmhswul/",
      "text": "I started grad school in late August and I’m still figuring out but the prep for moving seemed to be the easiest bit.\nTo find a place to live i put all my options on an excel spreadsheet and prioritized choices based on my personal preferences (distance from bus stop, food/parks nearby etc.) \nAs for now, focusing on getting my work done in time takes enough time as is but I’m finding that having a routine is VERY important. So is eating good. \nI know someone else said finding hobbies/being part of orgs and thats v important too because from what I’m seeing, its really easy to lose yourself in your work.",
      "author": "nucleotidey",
      "created": 1638160572,
      "upvotes": 1,
      "replies": {}
    },
    "hmjb3ps": {
      "link": "/r/GradSchool/comments/r468f4/what_does_the_transition_to_grad_school_look_like/hmjb3ps/",
      "text": "For housing try seeing if your new school has a website for finding apartments/roommates or you can try graduate housing if you want to really minimize your hassle. \n\nFor most of your other questions, ask your department to put you in touch with some older graduate students. They likely will gladly answer your questions.",
      "author": "local_man_says",
      "created": 1638197403,
      "upvotes": 1,
      "replies": {}
    }
  }
}