{
  "sid": "cyrqlj",
  "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/",
  "title:": "My imposter syndrome has imposter syndrome.",
  "text": "Most of us struggle with imposter syndrome. It’s nothing new. I’ll feel myself comparing my achievements or intellect to other scientists around me and coming up short, feeling inadequate, like I just faked my way in and don’t belong. Then I recognize that that’s just imposter syndrome speaking and most of us get it from time to time. \n\nBut wait, is it really imposter syndrome? Sure, *real* academics get it. And it’s totally valid when they do - they’re just as deserving as everyone around them. But am I just appropriating that term to make it sound like I belong here, when those feelings are actually very real feelings of failure and the accurate sense that everyone else really *is* better than me? Is my imposter syndrome just another way I pretend to be a real academic? \n\nAAAAAAAAAAA",
  "author": "notjasonbright",
  "created": 1567443915,
  "over_18": false,
  "upvotes": 424,
  "upvote_ratio": 0.98,
  "comments": {
    "f279byz": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/f279byz/",
      "text": "When I first got to grad school, people kept telling me to read PhD comics, especially because it helped them understand and recognize their own imposter syndrome. I kept putting off reading it because I thought I hadn’t earned ‘being in on the joke’ yet. I was having imposter syndrome about reading a comic about imposter syndrome. We’ve all been there.",
      "author": "banamana27",
      "created": 1570033259,
      "upvotes": 1,
      "replies": {}
    },
    "ezcej9g": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/ezcej9g/",
      "text": "Oh god yeah. Sometimes I try to remind myself that my feelings of inadequacy are unwarranted because clearly my supervisor saw something in me that I dont but then I remember the fact that for every 1 thing I do successfully I mess up 5 way more important things and realize that I'm way too much of a screw up to actually have imposter syndrome. I figure soon they'll wise up and kick my clumsy butt out but until that point I'm going to stick around and keep trying",
      "author": "r3allybadusername",
      "created": 1567833917,
      "upvotes": 1,
      "replies": {}
    },
    "eyvz26j": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyvz26j/",
      "text": "I come from the city and started studies in Agriculture and Animal Productions... bro I love animals, but boy do I feel like an imposter. Feeling like I know nothing, not being integrated, not having the same hobbies or aspirations as others... I'd like to work in genetics, in a lab, but here everyone wants to work on the field or in a farm...",
      "author": "jane-qc",
      "created": 1567516397,
      "upvotes": 2,
      "replies": {}
    },
    "eyv7233": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyv7233/",
      "text": "Ahhh, you need this essay from Daniel Mallory Ortberg. [Everyone has imposter syndrome, except for you](http://the-toast.net/2014/01/28/everyone-imposter-syndrome-except/)",
      "author": "ohsideSHOWbob",
      "created": 1567482699,
      "upvotes": 1,
      "replies": {}
    },
    "eyv4sv1": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyv4sv1/",
      "text": "I didn't fail... I discovered one way NOT to do it!",
      "author": "ThaeliosRaedkin1",
      "created": 1567480665,
      "upvotes": 2,
      "replies": {}
    },
    "eyuy76f": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyuy76f/",
      "text": "Mine always has me thinking I somehow tricked my program into letting me in. But me? I’m definitely not smart enough to trick all these people with PhDs and years of experience.",
      "author": "puffycheetopuff",
      "created": 1567475301,
      "upvotes": 2,
      "replies": {}
    },
    "eyuxah2": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyuxah2/",
      "text": "Wow.   Get out if my head!!",
      "author": "tcunningham27",
      "created": 1567474609,
      "upvotes": 2,
      "replies": {}
    },
    "eyuqdqm": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyuqdqm/",
      "text": "Lol, I have thought this exact same thing. Maybe both of us can be real imposters together while everyone else around us just has imposter syndrome. \n\nBut seriously though, it comes and goes in phases. There will be times when you really don't feel like you belong and other times when you realize how far you have come and how you feel like you are starting to really understand your field and how to contribute to it in meaningful ways. Then you can feel proud of how far you have come. \n\nRemember to compare yourself to where you were when you started, don't get too caught up in comparing yourself to everyone around you. \n\nFor some reason, now that I am writing up my papers and my thesis, a lot of my confidence is coming back. Sometimes it is hard to keep things in perspective.",
      "author": "baller_unicorn",
      "created": 1567469298,
      "upvotes": 3,
      "replies": {}
    },
    "eyue2uq": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyue2uq/",
      "text": "There’s an episode of the podcast The Hilarious World Of Depression about imposter syndrome",
      "author": "turboshot49cents",
      "created": 1567459697,
      "upvotes": 2,
      "replies": {}
    },
    "eyudvh8": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyudvh8/",
      "text": "I found really forward friends/bosses/mentors/ acquaintances etc. Basically anyone that isn't afraid to call me out or minse words when I am being stupid. These people are typically those labeled assholes by most, but I knew that if I could handle their harsh criticism, I could take what they told me and build with it. And probably most important, I could trust that if they didn't say anything, I was on the right track.",
      "author": "wickzer",
      "created": 1567459546,
      "upvotes": 2,
      "replies": {}
    },
    "eyuau2u": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyuau2u/",
      "text": "I knew I was fucked up but I didn’t know I was two levels deep fucked up until now.",
      "author": "safeXcamp",
      "created": 1567457310,
      "upvotes": 2,
      "replies": {}
    },
    "eyuaaex": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyuaaex/",
      "text": "I know this feeling. It is a spiral that just goes round and round until you have no idea what you actually feel and eventually, you get completely detached from your true self. The only way out of this that I have found , is to trust your emotions. Your emotions aren't out to fool you. In fact, they might be the truest part of you.\n\nYou feel stupid because there are people all around that are smart and hard working and dedicated. You feel it because you are human and trust me, most of us feel it too because we, just like you, are fallible human beings. We are scared of competition, ashamed of failure, jealous of other's success and desperate for appreciation. Learning to deal with the complex being, that is you, is part of the process :)",
      "author": null,
      "created": 1567456916,
      "upvotes": 3,
      "replies": {}
    },
    "eyu6qtk": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu6qtk/",
      "text": "This is exactly me. Can you get imposter syndrome so bad that it's basically psychosis?",
      "author": "karlymoon999",
      "created": 1567454375,
      "upvotes": 6,
      "replies": {}
    },
    "eyu5gyi": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu5gyi/",
      "text": "I wish there was a way to get an accurate count of just how many of us experience imposter syndrome. It would make it feel less alienating!\n\nEdit: spelling",
      "author": "Passacagalia",
      "created": 1567453474,
      "upvotes": 6,
      "replies": {
        "eyudq65": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyudq65/",
          "text": "So you're saying someone should go do a PhD on impostor syndrome? And have an impostor syndrome about having an impostor syndrome while doing it? :D",
          "author": "laakmus",
          "created": 1567459438,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "eyu4jlf": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu4jlf/",
      "text": "You need metrics. A place to start is with publications. How many do you have? Me, I have a masters and a PhD from two separate programs and graduated from the PhD program 9 months ago yet still have zero publications. You think you're an imposter? GET ON MY LEVEL!",
      "author": "bicepsion",
      "created": 1567452818,
      "upvotes": 22,
      "replies": {
        "eyui0ov": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyui0ov/",
          "text": "They let you graduate without publications? Genuinely curious because for my program we aren’t allowed to.",
          "author": "soundstragic",
          "created": 1567462683,
          "upvotes": 6,
          "replies": {
            "eyur4pu": {
              "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyur4pu/",
              "text": "I had never heard of a program that required pubs before graduation until I read a thread about the topic on this sub a while back. In my field, research is typically in the field during short spurts, so all the time you're on campus you can't actually do research. It's only towards the end that it all comes together so it would be pretty shitty for a program to hold you hostage to the contingencies and unpredictableness of journal editors at that point.",
              "author": "bicepsion",
              "created": 1567469885,
              "upvotes": 2,
              "replies": {}
            },
            "eyumj5t": {
              "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyumj5t/",
              "text": "Differs by field, in some case even by subfield. For instance I'm a social scientist whose data is primary documents / archival materials. Not quite as simple as devising a stats model to test hypotheses. \n\nSo, thankfully, the standard isn't that I'm going to pump out pub after pub like folks in my own department even, who do voting behavior and have gobs of data with a mouse click.",
              "author": "Jack-ums",
              "created": 1567466206,
              "upvotes": 1,
              "replies": {
                "eyuoi04": {
                  "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyuoi04/",
                  "text": "Oh okay, makes sense.",
                  "author": "soundstragic",
                  "created": 1567467783,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "eyu3tar": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu3tar/",
      "text": "I’m doing my comps exam now and it’s 30% reading, 30% writing, and 40% staring out the window thinking about how incompetent I am. Feeling this!",
      "author": "gradstudentgrunt",
      "created": 1567452301,
      "upvotes": 4,
      "replies": {}
    },
    "eyu2u1w": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu2u1w/",
      "text": "> AAAAAAAAAAA\n\nI felt that scream in my soul.",
      "author": "TrumpetMatt",
      "created": 1567451595,
      "upvotes": 7,
      "replies": {}
    },
    "eyu2gvw": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu2gvw/",
      "text": "This is meta beta. congrats you've reached a new level of wimp.",
      "author": "virtuous_aspirations",
      "created": 1567451326,
      "upvotes": -5,
      "replies": {}
    },
    "eyu00go": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu00go/",
      "text": "Yo bruh I'm actually a fucking idiot and I'm gonna see if I can fool these people long enough to finish. But then I have to fool potential employers too...\nFuck",
      "author": "tehlolredditor",
      "created": 1567449575,
      "upvotes": 23,
      "replies": {
        "eyu9qaq": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu9qaq/",
          "text": "Once you've got that down it's just a simple matter of fooling bosses, subordinates, and funding agencies. Keep it up for the rest of your life and you might just eventually get smart.",
          "author": "kyew",
          "created": 1567456514,
          "upvotes": 7,
          "replies": {}
        },
        "eyuca2u": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyuca2u/",
          "text": "Fake it till you make it!",
          "author": "shirkej",
          "created": 1567458367,
          "upvotes": 7,
          "replies": {}
        },
        "eyv7lz8": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyv7lz8/",
          "text": "I started a new job a couple months ago and literally sit at my desk waiting to overhear a conversation about my incompetence or maybe that the recruiter thought I was someone else :D (it sounds so ridiculous typing it out) but it makes me so sad that the feeling doesn’t go away even when you reach the goals that you thought were the key to feeling successful. I don’t know how this worry and anxiety will ever go away but I hope one day we both feel like we belong, because we do ❤️",
          "author": "violentponykiller",
          "created": 1567483220,
          "upvotes": 3,
          "replies": {
            "eyvcgbj": {
              "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyvcgbj/",
              "text": "Damn I'm sorry! That's rough. Yeah, I hope so too 😹",
              "author": "tehlolredditor",
              "created": 1567488299,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "eyuhqvh": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyuhqvh/",
          "text": "Yeah I have the luck to have a supportive advisor who I can discuss these kinds of things freely with, but when he brings up how even he still gets imposter syndrome, I still believe that it's all lies. He wasn't there when I messed up a presentation so badly that my boss had a word with me afterwards, or for my first summer research report that could've been written by a 5th grader, or witnessed my most pathetic moments when I literally begged people for work. I guess he'll just find out what a big loser I am when I take the qualifying exam that I keep putting off.",
          "author": "tackykcat",
          "created": 1567462472,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eytzxbb": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eytzxbb/",
      "text": "My take on why Impostor Syndrome is so high in graduate school is because many people here are 'average'. What I mean by this, is when most (we) were young, they probably looked at people in PhD programs as the smartest of the smart, the best in the world, a place unfeasible. Then you get here, and realize that grad school is filled these individuals, sure, but most are just 'regular' people who are very hard working and goal orientated. But the idea that everyone in grad school is a genius is the reason that we look at ourselves and think, \"well that's definitely not me. I must be a con. This is all just luck\". \n\nIt's just not true. You're here because you deserve to be here. Now prove that to yourself and proving it to others will be a piece of cake.",
      "author": "Necessary_Pseudonym",
      "created": 1567449512,
      "upvotes": 52,
      "replies": {}
    },
    "eytyjz6": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eytyjz6/",
      "text": "Oh God I relate to this so hard. Starting my Master's this semester and I totally feel this too!",
      "author": "ShrewdFoodDude",
      "created": 1567448557,
      "upvotes": 5,
      "replies": {}
    },
    "eytwn08": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eytwn08/",
      "text": "oh my god did i secretly write this?",
      "author": "momhugs",
      "created": 1567447388,
      "upvotes": 13,
      "replies": {}
    },
    "eytwfmk": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eytwfmk/",
      "text": "r/gradschool might as well be r/ImposterSyndrome at this point lol I wonder if the first one to discover imposter syndrome was a grad student",
      "author": null,
      "created": 1567447250,
      "upvotes": 23,
      "replies": {
        "eyu9kqq": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu9kqq/",
          "text": "Considering how the easiest way to do research is with volunteers recruited on campus, if the discoverer wasn't a student the subject probably was.",
          "author": "kyew",
          "created": 1567456404,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eytvs99": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eytvs99/",
      "text": "Yup, I've felt this way too. There are times when I've struggled with it, and told myself \"I'm not smart enough to have imposter syndrome.\"\n\nFeels like galaxy brain level imposter syndrome.",
      "author": "jcrespo21",
      "created": 1567446818,
      "upvotes": 156,
      "replies": {
        "eyuhyim": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyuhyim/",
          "text": "Honestly vibe with this too hard lol",
          "author": "soundstragic",
          "created": 1567462637,
          "upvotes": 26,
          "replies": {}
        },
        "eyv4mpl": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyv4mpl/",
          "text": "Same here. I have always felt stupid and inadequate when I was in grad school, but to be honest I don't know if I ever felt like an \"imposter\" per se (I know it's a term to describe the general feeling and symptom). I didn't even think I was good at faking, I just felt that I was a flat out failure and everyone was waiting to kick me out. \n\nAll it took was a good man (bless my advisor) who told me I'm not a failure to inspire me to finish my degree.",
          "author": "aquaflute",
          "created": 1567480519,
          "upvotes": 9,
          "replies": {}
        },
        "eyuu1wb": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyuu1wb/",
          "text": "i feel you",
          "author": "maayuxz",
          "created": 1567472146,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "eytuzjt": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eytuzjt/",
      "text": "I get that about my depression too. It's like you're getting inside your own head about getting inside your head",
      "author": "notleonardodicaprio",
      "created": 1567446291,
      "upvotes": 34,
      "replies": {
        "eytvn5h": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eytvn5h/",
          "text": "A fellow I/O with impostor syndrome? There are dozens of us!",
          "author": "Astroman129",
          "created": 1567446727,
          "upvotes": 10,
          "replies": {
            "eytw1ms": {
              "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eytw1ms/",
              "text": "There's really no other way!",
              "author": "notleonardodicaprio",
              "created": 1567446985,
              "upvotes": 6,
              "replies": {
                "eyu0qux": {
                  "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu0qux/",
                  "text": "Joining this party! That's a good thing, right??",
                  "author": "TheFork101",
                  "created": 1567450093,
                  "upvotes": 5,
                  "replies": {
                    "eyu3j27": {
                      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu3j27/",
                      "text": "Even if it's a tiny party that no one knows about",
                      "author": "notleonardodicaprio",
                      "created": 1567452094,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "eyu3vus": {
              "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu3vus/",
              "text": "OB with imposter syndrome anyone?\n\nWait... maybe I don’t belong...",
              "author": "discoverysol",
              "created": 1567452352,
              "upvotes": 1,
              "replies": {
                "eyu459d": {
                  "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu459d/",
                  "text": "I welcome you with open arms (:",
                  "author": "Astroman129",
                  "created": 1567452537,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "eyv7det": {
              "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyv7det/",
              "text": "Dozens!",
              "author": "violentponykiller",
              "created": 1567482999,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "eyvi26c": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyvi26c/",
          "text": "Somewhat unrelated but Alan watts has a lecture on that exact phenomenon. People worrying which leads them to worry about their worrying and so on. Just thinking about it in those terms can help reduce those kinds of thoughts a bit.",
          "author": "muridis95",
          "created": 1567495402,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eytuxg6": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eytuxg6/",
      "text": "My impostor syndrome:\n\nMe \"I feel really confident going into my PhD, especially compared to going into my Masters. I feel like I can actually do this.\"\n\nevil me \"But what if your confidence is misplaced and you're actually a con artist who fooled all of these people, including your husband, into thinking you're smart and capable. \\*What if...\\*\"",
      "author": "NarcissisticDramaQwn",
      "created": 1567446252,
      "upvotes": 93,
      "replies": {
        "eyu6bba": {
          "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eyu6bba/",
          "text": "I found out being confident no matter how bad the situation is for be tends to give me better results",
          "author": null,
          "created": 1567454067,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "eytsvqs": {
      "link": "/r/GradSchool/comments/cyrqlj/my_imposter_syndrome_has_imposter_syndrome/eytsvqs/",
      "text": "p r e a c h",
      "author": "patchclampgal",
      "created": 1567444840,
      "upvotes": 7,
      "replies": {}
    }
  },
  "updated": 1634064566
}