{
  "sid": "q39tru",
  "link": "/r/GradSchool/comments/q39tru/tips_for_managing_my_schedule/",
  "title:": "Tips for managing my schedule",
  "text": "Greetings! First year PhD student here. My advisor offered me a PhD position after I successfully defended my Master’s thesis which was quite an achievement for me. Fast forward to now, I have been granted a TA position by my department for taking recitations and office hours of 77 undergrads thrice a week, I also have to take a course which is thrice a week to fulfil my coursework requirement and my advisor is demanding about research outputs despite me telling him about my schedule. Is there any way I can make my life a bit easier or any valuable tips that could help me manage my work-life balance better?",
  "author": "soh_amore",
  "created": 1633615516,
  "updated": 1634099852,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hfqjjjv": {
      "link": "/r/GradSchool/comments/q39tru/tips_for_managing_my_schedule/hfqjjjv/",
      "text": "I'm in the same boat. Sometimes it feels like the workload is impossible for one person and it probably is. I dont meet every deadline, even working 50+ hours a week (my max before I start losing my mind and crying uncontrollably at the drop of a hat).\n\nFirst, check that you're managing your time well. Are you using the time in between office hours and classes efficiently for the most part? It helps me to keep a to-do list broken out by each day and only putting a few priorities on each day (write outline for chapter X, work on data cleaning, meetings at blahblahblah times, etc.). Inevitably, I'll fall short of the to-do list even if it sounded reasonable when I wrote it so sometimes things get pushed to other days and that's okay. \n\nIf you're already doing all that and making good use of your time then your workload is likely just more than is humanly possible. Professors dont realize the demands of classes and they often forget just how many tasks theyve put you in charge of because they also are juggling a million and one things. So either you accept that not everything will get accomplished in the ideal timeline or you start looking for a different advisor whose students tend to have more reasonable workloads. It varies so much between advisors. \n\nAlso, the advisors who overwhelm their students usually end up with students who take longer to graduate because they struggle to meet deadlines. So think deeply about how sustainable this is for 5+ years. You're in your first year. How long can you keep this up?\n\nSpeaking as someone in their fifth year, having seen how this can play out - if I had known this then I dont think I would have stuck it out to be honest. It's really wrecked me mentally, physically, and socially. I just have a few months before defense and even being that close to the finish line, it feels like an insurmountable, never-ending prank where someone is seeing how far they can push another person before they break.",
      "author": "Two-HeadedBolognaGod",
      "created": 1633619590,
      "upvotes": 3,
      "replies": {
        "hfqkzjg": {
          "link": "/r/GradSchool/comments/q39tru/tips_for_managing_my_schedule/hfqkzjg/",
          "text": "Hi I’m so sorry for your situation. Some things are plain wrong and this is one of them. I hope you ace the defense leave this all behind. In my case, I have so little time for me to spare I tend to sleep 5-6hrs a day (ik 8 hrs is far fetched in STEM). With being clinically depressed almost half of my life, at one point I just give up and cry uncontrollably. I’m scared that I’ll eventually lose interest and drop out. My advisor has critiqued me about investing my time for recitations and office hours but I’m not able to compromise that time because I feel some sort of moral obligation toward undergrads and helping them out. I’ve got homework to do, homework to assign and grade (77 of them every week) projects to do, projects to assign, give exam, proctor exams, revise stuff before recitations, work on research and that basically gives me no time for myself.",
          "author": "soh_amore",
          "created": 1633620196,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hft6ax9": {
      "link": "/r/GradSchool/comments/q39tru/tips_for_managing_my_schedule/hft6ax9/",
      "text": "There should be a cap on the hours you devote to the TA. With that many students, there is a high risk of exceeding the cap simply because they are in your face all the time. A first step is to avoid having the TA creep into your other commitments.",
      "author": "IkeRoberts",
      "created": 1633661543,
      "upvotes": 2,
      "replies": {
        "hft9sts": {
          "link": "/r/GradSchool/comments/q39tru/tips_for_managing_my_schedule/hft9sts/",
          "text": "I have the professor of that course telling me previously there used to be 3 TA’s but now they’re restricting it to one",
          "author": "soh_amore",
          "created": 1633663352,
          "upvotes": 1,
          "replies": {
            "hfvriib": {
              "link": "/r/GradSchool/comments/q39tru/tips_for_managing_my_schedule/hfvriib/",
              "text": "That is indeed a problem for the professor. It does not mean you can be assigned three times as much work.",
              "author": "IkeRoberts",
              "created": 1633716503,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}