{
  "sid": "r7jyq7",
  "link": "/r/GradSchool/comments/r7jyq7/how_to_healthily_engage_with_colleagues_who_are/",
  "title:": "How to healthily engage with colleagues who are also on the job market at the same time",
  "text": "On the job market, which is already a psychic hellscape, and one of my cohort mates who has always been a consummate grad student and is applying to a lot of the same jobs as me is getting a million bites, interviews, requests for more material, and even position offers. \n\nI'm trying my best to remain supportive and happy for them, but it's also extremely depressing that I have gotten one bite, that didn't pan out. \n\nHow do I keep engaging as a decent person while also protecting my own mental health?",
  "author": "dramaturgicaldyad",
  "created": 1638486609,
  "updated": 1639519020,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hn09cnx": {
      "link": "/r/GradSchool/comments/r7jyq7/how_to_healthily_engage_with_colleagues_who_are/hn09cnx/",
      "text": "You can do this by not comparing your success with theirs. It really won’t help you in any way other than to bring you down like how you are feeling right now. If anything, you should use this opportunity to ask ask them what they’re doing different and even ask them to review your resume to see how you can improve. I always find it helpful to not compare my success with other people’s success and that everyone is on a different timeline. Their success does not mean you are failing!!! It just takes a little longer and a few more tries for you and that’s totally ok!!! Best of luck!",
      "author": "m27vzkali",
      "created": 1638492922,
      "upvotes": 3,
      "replies": {
        "hn16ezj": {
          "link": "/r/GradSchool/comments/r7jyq7/how_to_healthily_engage_with_colleagues_who_are/hn16ezj/",
          "text": "> You can do this by not comparing your success with theirs.\n\nMuch easier said than done.... but thanks yeah. I would consider asking to share materials once the job cycle is over I guess, and I'm sure they'll be in a postdoc/job by then so I guess it won't be awk",
          "author": "dramaturgicaldyad",
          "created": 1638508142,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hn1cpgz": {
      "link": "/r/GradSchool/comments/r7jyq7/how_to_healthily_engage_with_colleagues_who_are/hn1cpgz/",
      "text": "I would encourage you to Google the word “mudita”.\n\nIt’s a Buddhist concept that’s like sympathy, but the reverse because it’s for someone else’s happiness instead of someone else’s pain.\n\nIf you do some reading on it, you might come across something that “clicks” for you to help you deal with your current situation and emotions.",
      "author": "tentkeys",
      "created": 1638511901,
      "upvotes": 1,
      "replies": {}
    },
    "hn4dbgk": {
      "link": "/r/GradSchool/comments/r7jyq7/how_to_healthily_engage_with_colleagues_who_are/hn4dbgk/",
      "text": "Remember free will doesn't exist. Nothing happens because of you or your faults. Everything is just environment, biology and perhaps some cosmic randomness. People doing better than you do so 100% because of luck and being privileged enough to have had better oppertunities than you to bulk up their CV. Meritocracy is a convenient myth for those who benefit from the system as is.",
      "author": "desalaalasterde",
      "created": 1638569004,
      "upvotes": 0,
      "replies": {}
    }
  }
}