{
  "sid": "hmbmf0",
  "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/",
  "title:": "Not sure if I'm burnt out from the hell that is 2020, have developed a disdain towards benchwork, or am just done with grad school in general.",
  "text": "Or D all of the above. I'm a 4th year in my program but am just so damn apathetic rn. Love feeling like my day to day labwork is completely irrelevant and useless in the context of everything going on in the world, including but not limited to the lack of action of many of my local & national govt officials to combat COVID, the necessity of actively fighting racism and working towards justice , and the anti-science attitude of so many people around.",
  "author": "sheltiesideeye",
  "created": 1594055364,
  "over_18": false,
  "upvotes": 303,
  "upvote_ratio": 0.98,
  "comments": {
    "fx6f9hs": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx6f9hs/",
      "text": "I'm 100% there with you! I'm going into my third year and oh man. It seems like with everything going on in the world there is no point. I went into science because I wanted to help people and solve problems and instead all I'm doing is research that is being done for the sake of research, there's no practical application. My supervisor has completely lost the plot during the pandemic and is being more of a bully than ever. The only think keeping me going is just the thought of being done.",
      "author": "16hooves",
      "created": 1594099870,
      "upvotes": 1,
      "replies": {}
    },
    "fx6d744": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx6d744/",
      "text": "[removed]",
      "author": null,
      "created": 1594098245,
      "upvotes": -7,
      "replies": {
        "fx6i0in": {
          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx6i0in/",
          "text": "People are stressed, their mental health isn't the best. You blaming them for experiencing perfectly reasonable feelings is not helping any. Scientists are human beings too and they are just as susceptible to mental health issues as everyone else. Have some sympathy even if you can't empathize.",
          "author": "SBR249",
          "created": 1594102144,
          "upvotes": 2,
          "replies": {
            "fx7t72u": {
              "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx7t72u/",
              "text": "[removed]",
              "author": null,
              "created": 1594138026,
              "upvotes": -3,
              "replies": {
                "fx8veh2": {
                  "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx8veh2/",
                  "text": "The point is that you are blowing this way out of proportion. Burnout is not uncommon and these are extraordinary times. When you are in a bad place, it can be hard to see the silver lining. But that doesn't mean that the person is somehow too entitled or too ungrateful. It simply means that they are dealing with things need encouragement and help. \n\nNow are other people also dealing with things? Yes. But each person faces their own challenges and they deserve sympathy and understanding when they voice them, especially for something that is a known issue within the community. \n\nThis isn't a phallus measuring contest of who is the most miserable or downtrodden. It's not a zero-sum game of how we allocate our sympathies. You can both empathize with the those who are suffering economically and physically in this pandemic and also recognize that others who are working still face the same challenges they have always faced. It's not one or the other. Implying that the latter should buck up and put on some macho pretense of everything-is-just-fine and be grateful because they \"obviously\" aren't suffering as much as the former is just plain BS. \n\nTo blame the whole \"anti-intellectual culture\" on a student who acknowledges their mental health challenges is cruel, unjust, absurd, and frankly uncalled for. Why don't you also blame the student for climate change while you are at it? I'm sure his minuscule contributions to humanity's carbon footprint is clearly responsible for what's happening too.",
                  "author": "SBR249",
                  "created": 1594156246,
                  "upvotes": 2,
                  "replies": {
                    "fxa9u1l": {
                      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fxa9u1l/",
                      "text": "Lol.\nYa it's just one student, with a bunch of replies from other grad students trying to victimize themselves while still having a job.\nYou're making the same argument as the All Lives Matter groups. \"All people are affected by COVID19.....All pandemic issues matter\"\n\nNo. That's not how it works. The working and lower class (especially people of color) are the people who are disproportionately affected by the pandemic. Its not all lives are affected. Quit victimizing yourself while people are dealing with issues that are far more than the average grad student will ever deal with.\n\nStart showing empathy for the working class and accepting how privileged you are to be in grad school. That's the only way people will take scientist and intellectuals seriously so that we won't have a repeat of this administrations handling of the pandemic",
                      "author": "BerserkFuryKitty",
                      "created": 1594186086,
                      "upvotes": 0,
                      "replies": {
                        "fxax4mv": {
                          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fxax4mv/",
                          "text": "It's not about just having a job. That's not the end-all-be-all of life. And neither are mental health issues faced by students (a long standing issue) something directly comparable to the current macroeconomic issues facing society. To directly conflate the comparison with BLM vs. ALM is just disingenuous and frankly offensive. By your logic, we should also stop worrying about the multitude of issues like climate change, the gender gender pay gap, and even systemic racism because...COVID-19! That's not how life works. \n\nNow that you are done accusing me indirectly of being a racist, like I said, it's not a phallus measuring contest. Not being a dick to grad students who feel burned out does not preclude you from also feeling sympathetic to those who are hard hit by the pandemic financially or physically. And this is not about \"victimizing\" oneself. It's about recognizing that one is not an unfeeling robot and reaching out to those who are feeling the same (you have managed to remember that this is a grad school subreddit right)? \n\nTo be honest, I find that compassion and sympathy is not something that you selectively bestow on those you find \"worthy\" but rather something intrinsic that you show to all. It's more a reflection of who you are rather than what you do. \n\nIn the end, I don't dispute that \"ivory tower syndrome\" is a contributing factor to anti-intellectualism. It's something that all scientists should be aware of and work to avoid. But at the same time, I object to using a populist perspective of \"intellectuals\" as a baseline for how we in the community should treat our own colleagues.",
                          "author": "SBR249",
                          "created": 1594207949,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "fxbycq0": {
                          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fxbycq0/",
                          "text": "I will just add that I did not report any of your comments.",
                          "author": "SBR249",
                          "created": 1594228567,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fxbp52w": {
          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fxbp52w/",
          "text": "I'm not complaining about having a job, I'm complaining about the general stress and negative aspects of grad school compounded by everything currently going on in the world. FWIW I worked multiple minimum wage jobs in high school and college to get out with as little debt as possible. For years I've worked to be good with money and save as much as I can, I live with a roommate and keep a reasonable budget. No I don't have a family to care for, but I'm 25 and don't intend on having children anyways. By no means do I take still getting my stipend and being able to keep my job for granted. I won't deny the privileges I have or that I'm sitting in a better situation than many. Why do you think I chose to rant on here instead of to a more general group? \n\nYet none of this changes that half my extended family is not taking the pandemic seriously while a lot of them are immunocompromised or have a condition that makes them more susceptible. I have family and others I'm close to that have contracted COVID or have otherwise been affected by it. There are evidence based safety precautions not being implemented for political reasons, and of course I'm concerned about the consequences (including but not limited to economic, death, and less wellbeing) that will come from this. I don't feel like what I'm doing in school at the moment is a net benefit to society. But if all you still take from what I've said is that I'm complaining about having a job, you're purposefully misinterpreting what I'm saying.",
          "author": "sheltiesideeye",
          "created": 1594224252,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fx6by4q": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx6by4q/",
      "text": "Same here, I am exhausted and not motivated. ...",
      "author": "SelectShirt6",
      "created": 1594097314,
      "upvotes": 2,
      "replies": {}
    },
    "fx5u7pm": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx5u7pm/",
      "text": "Put it in this perspective:\n\nThe little things in lab don't matter, and the world around you is seemingly going the wrong direction. It's hard to care about lab work when other things don't seem like they are falling into place. \n\nDespite all of this, you and I are going to be fine. We will have a PhD with bright career prospects. It is a bit selfish, but we cannot control everything. We cannot force idiots to wear masks. We cannot force science on skeptics. We cannot get rid of the plague that is Trump even if he loses the election. \n\nAnd while our work in lab doesn't seem important, and it may not be in the grand scheme of things, you can put your degree to work when you graduate. Industry is not grad school. You will earn a higher than average wage (probably if you avoid academia). You will have made it to the first part of the rest of your life. \n\nI keep myself going by thinking about the the fruits of my labor. I know my work (protein engineering) isn't as exciting as I would like, but it's a stepping stone to my actual career. I have plans for a ton of things that would have never materialized by taking another path. I am excited about finishing up and getting started, and so should you",
      "author": "resorcinarene",
      "created": 1594085982,
      "upvotes": 4,
      "replies": {
        "fx6sugp": {
          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx6sugp/",
          "text": "Its so damn hard to not feel like I need to jump in on every anti-science thing I see (be it on social media or IRL). Still learning to pick my battles and not waste time or mental effort on people that won't give a damn regardless of how many facts are put in their face.\n\nYou're right though, this all is just a necessary step to get to our long term careers. The past couple months I've been putting more and more focus on finding what I want to do and looking for jobs (or general areas) that I could see myself working long term in. For sure not academia haha.",
          "author": "sheltiesideeye",
          "created": 1594112568,
          "upvotes": 2,
          "replies": {
            "fx6t3a5": {
              "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx6t3a5/",
              "text": "Fuck academia. It may have been a viable career path two decades ago, but not today. Industry is looking very nice right now, and they're hiring like crazy! Biotech and pharma are experiencing a boom!",
              "author": "resorcinarene",
              "created": 1594112826,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "fx7rkf3": {
          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx7rkf3/",
          "text": "Glad to see fellow protein engineering is thriving in this difficult time. Im on my last straw with situations in the US. It's best to focus on our present and what we can control right now.",
          "author": "Sailor_Alpaca",
          "created": 1594137222,
          "upvotes": 1,
          "replies": {
            "fx89idv": {
              "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx89idv/",
              "text": "It is a good skill to have for industry. Protein therapeutics are en vogue. Let's hope this remains true next year",
              "author": "resorcinarene",
              "created": 1594145801,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fx5j7c3": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx5j7c3/",
      "text": "[deleted]",
      "author": null,
      "created": 1594079552,
      "upvotes": 8,
      "replies": {}
    },
    "fx5et65": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx5et65/",
      "text": "Got my PhD last month in molecular bio. I fucking hate wet-lab and never will do research ever again. So happy to be out of the hellhole that is academia.",
      "author": "Icy_Put_4817",
      "created": 1594077114,
      "upvotes": 1,
      "replies": {}
    },
    "fx5bu0j": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx5bu0j/",
      "text": "starting my fourth year this august. last week, i missed 3 days of lab work and stayed home. felt great and helped a little, but now I feel guilty and behind. :-(",
      "author": "cascaderade",
      "created": 1594075525,
      "upvotes": 2,
      "replies": {}
    },
    "fx55wt5": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx55wt5/",
      "text": "I feel this SO hard. i’m coming in on my fourth year, and everything i’m doing feels completely irrelevant and unimportant. I’m having such a hard time being productive. Part of me wants to quit and leave, but I’ve been at this so long, I don’t even know what I’d do instead. I’ve been in school my entire 20s, and to leave feels like I’d waste it all. But damn, I just don’t enjoy it at all and it doesn’t make me happy anymore. There’s been so much bullshit in my department too, and it’s really clear that we (grad students) are just not cared about either, so it’s just hard. I’m really sorry you’re feeling this way, but you’re not alone at all! I feel like this is completely normal, especially with everything going on in the world. Always here if you need to talk or vent!!",
      "author": "douche-chills",
      "created": 1594072502,
      "upvotes": 8,
      "replies": {
        "fx6seq0": {
          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx6seq0/",
          "text": "Yea this past fall I was a TA for a class that required so much time, prep, and effort, and I made next to no progress on my research. It mentally wore me out and made me full of disdain and apathy. Fortunately I don't have to TA that class ever again (I'd legit straight up leave the program if I was forced to). Since then I've been struggling to do the bare minimum though. I want to and know I'm gonna stick it out and finish, but damn if it isn't rough.",
          "author": "sheltiesideeye",
          "created": 1594112121,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fx55u2q": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx55u2q/",
      "text": "I’m going to use a very unorthodox example to get my thoughts across on this, so bear with me if this just sounds like word vomit. I’m also just a first year masters student not in STEM, so take what I have to say with a grain of salt. . .\n\nOne of my favorite types of stories to read are fantasy, and while a lot of “literature people” may find it low brow, I think it has a lot to teach us about the human condition. My favorite fantasy series is *The Wheel of Time*. If you’re familiar with fantasy, you’ve probably read it or at least heard of it. It’s considered one of the foundational works of the genre among *Lord of the Rings*, *A Song of Ice and Fire*, etc.\n\nAnyway, it’s a fourteen long epic about the battle between the reborn soul of The Dragon - a powerful male channeler - and the Dark One. Pretty stereotypical battle of good vs. evil, at least on the surface. Now The Dragon (I’m avoiding names to avoid spoilers) pretty much went insane and destroyed the world as they knew it after barely imprisoning the Dark One the first time. While the ‘new’ Dragon has no memory of doing this, it’s been passed down through the world’s mythology for thousands of years. This time around, when the battle with the Dark One comes again, he is determined to leave the world in a better state. He doesn’t want to save the world just to destroy again. He wants a legacy. So, one of the things he does is establish. . . schools. You see, knowledge has been on a slow decline for millennia. Everybody hoards it, nobody shares it. He tours them every once in a while to see what the students invent. One of the most worthless inventions he sees is a wagon powered by steam. Pretty dumb in his mind when there are plenty of good horses around. . .\n\nSo during this climactic battle of good vs. evil where the world hangs in the balance, The Dragon is worried about small advances in science and philosophy and other subjects to leave the world a better place when he (hopefully) wins this battle and is gone.\n\nI guess the point I’m getting at is right now the world is in a battle of good vs. evil. Maybe not quite as dire or climactic, but important all the same. And just because you feel like your work is unimportant (like a steam powered wagon, pft), who knows what kind of impact it can make on the world?",
      "author": null,
      "created": 1594072463,
      "upvotes": 21,
      "replies": {
        "fx5hry4": {
          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx5hry4/",
          "text": "Thank you for also highlighting why arts are just as important as sciences.\n\nI want to reinfirce your point, it is an excellent one. We are all chasing knowledge which was decided at some point was important to the world. While it may no longer seem like the most important, it still has value, and we should still strive to create new ideas.",
          "author": "mein_hamburger",
          "created": 1594078746,
          "upvotes": 10,
          "replies": {}
        },
        "fx5rgdt": {
          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx5rgdt/",
          "text": "[deleted]",
          "author": null,
          "created": 1594084355,
          "upvotes": 1,
          "replies": {
            "fx5rstp": {
              "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx5rstp/",
              "text": "I’m extremely hype for the Amazon series. I’ve wanted it to be on television ever since I picked up the first book, so this is my adolescent dream come true. Some of the set photos have looked awesome, but I’m trying to not get my hopes up *too* much - especially after the way Game or Thrones ended.\n\nYes there are certain parts of the books that seem to annoy people as they progress. Mannerisms and phrases specifically. . . However if you are still enjoying the series at book four, I’d definitely recommend reading it all the way through.",
              "author": null,
              "created": 1594084560,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fx51p76": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx51p76/",
      "text": "I feel this deeply. My supervisor is consistently neglecting me in favour of new exciting projects. I feel like I’m drowning and also don’t care",
      "author": "Derpazor1",
      "created": 1594070400,
      "upvotes": 14,
      "replies": {
        "fx5km0w": {
          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx5km0w/",
          "text": "I HAVE BEEN FEELING THIS TOO.",
          "author": "TheodoreLinux",
          "created": 1594080351,
          "upvotes": 2,
          "replies": {
            "fx5qh2f": {
              "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx5qh2f/",
              "text": "*hugs*",
              "author": "Derpazor1",
              "created": 1594083777,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fx4zz0w": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx4zz0w/",
      "text": "Same. \nI dont have any words of wisdom. The only thing keeping me going is virtual study dates and fear of joining the job market right now.",
      "author": "frankie_prince164",
      "created": 1594069549,
      "upvotes": 13,
      "replies": {}
    },
    "fx4wslh": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx4wslh/",
      "text": "Completely understandable, and you are not alone. You're also not a failure as a scientist for feeling the way that you do. The fact that you can't ignore injustice and death around you is a strength, not a weakness (contrary to what traditional academia would tell you).\n\nIt might help to consider career paths that would allow you to fight some of those problems, and try to find motivation there, if you haven't already.",
      "author": "Maximum-Hedgehog",
      "created": 1594068009,
      "upvotes": 13,
      "replies": {
        "fx6rjey": {
          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx6rjey/",
          "text": "I ruled out a career in academia a couple years ago for multiple reasons lol. It's definitely not for me. But I'm starting to seriously looking into career paths now (I should be able to graduate by the end of 2021 according to my committee) and finding something in science policy, advocacy, or communication is becoming more and more enticing.",
          "author": "sheltiesideeye",
          "created": 1594111221,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fx4nsp7": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx4nsp7/",
      "text": "I'm right there with you, but I'm working on powering through this summer. My reward will be leave that I'm taking in the fall.",
      "author": "OfTheWater",
      "created": 1594063597,
      "upvotes": 5,
      "replies": {}
    },
    "fx4lnf9": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx4lnf9/",
      "text": "The 4th year slump is a super real thing - something about ~year 4 is the perfect storm for burn out and apathy, even in the best of times. Combine that with a global pandemic and the civil unrest, it's no surprise you're having a rough time, so know that you aren't alone.\n\nI don't know if you're looking for advice, and it's not like I know everything anyways, but I'm happy to spitball some ideas if you think that would be helpful? Otherwise, in the wise words of Chris Traeger, \"that sucks\". Sending you positive thoughts ❤",
      "author": "kronning",
      "created": 1594062549,
      "upvotes": 45,
      "replies": {
        "fx6rvac": {
          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx6rvac/",
          "text": "Thanks, and thoughts or advice are def welcome. At this point I've come to acceptance that being a mediocre grad student is sufficient, and as long as I get done with what I need to get out of here with a degree in a semi-reasonable timeframe thats good enough haha. But putting thoughts into action & actually motivating myself is easier said than done.",
          "author": "sheltiesideeye",
          "created": 1594111565,
          "upvotes": 1,
          "replies": {
            "fx7tv1q": {
              "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx7tv1q/",
              "text": "Definitely, a complete thesis is the best kind of thesis! And hey, I don't personally know a single person who actually likes their thesis when they sit down to write it. Anyways though, the advice I can think of are (1) to help you feel more productive and (2) honestly maybe dive into that social justice and covid stuff a bit more, like in a way to see how your talents could contribute?\n\nSo, for point 1 re:productivity\n\n•Start literally putting together your thesis. Could be as simple as pulling up your institution/program guidelines to start formatting, skim through some other dissertations to get a feel for style and formatting choices that you like, start creating the table of contents, whatever! Or, if you've already published something, start reformatting that to fit withing the dissertation- these things genuinely take more time than you would think, and if you have to do them at some point anyways, why not now? And hey, then you'll have a \"dissertation_version1.docx\" which made me feel better anyways.\n\n•For whatever experiments or analyses you've done most recently, put together some nice mock figures. For me, that can both help me feel better about the work I've done (seeing it in Figure form always feels more complete?), and I find those mock figures actually really helpful when putting together the paper.\n\nNow, for 2:\n\n•Have you considered science policy fellowships like AAAS? There are opportunities for recent phd grads to apply their knowledge of experimental design, logical reasoning, and investigative skills, but to help shape policy decisions at federal, state, and local levels.\n\n•Get involved with career exploration opportunity stuff at your institution. It might help you feel more motivated and optimistic to see other ways you can use your phd? I feel like so often we talk about career options in the binary of academia or industry, but there are actually a ton of other options - from jobs at funding agencies like the NIH (*and you might especially be interested in looking into their teams that support DEI initiatives?), to careers implementing training programs, to directly working with policy makers, to teaching and/or pedagogy work, to academic leadership, to so so much more. Sometimes my university does career related seminar or lunch series, I've participated in a career and mentorship-based journal club, most universities have some kind of career center, etc.\n\nTruly sending you my best wishes",
              "author": "kronning",
              "created": 1594138360,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fx4i5sc": {
      "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx4i5sc/",
      "text": "I'm 100% with you. I'm going to be a 6th year this fall. With all that's going on in the world, it's so hard to care about little things in the lab. My research has nothing to do with COVID as well. It doesn't help that I've realized over the past couple years that I do not want to stay in academia, have the disdain towards benchwork that you mentioned, and that this is all just a stepping stone for me to get a decent job after grad school. I'm just so over being in my late 20's and doing troubleshooting, working on slow-ass projects, and not feeling fulfilled. I want a faster-paced work environment, interactions with and to serve people in my community, to teach more, work with kids, etc., and have just realized that my career will not and should not include any more pipettes, lab coats, and reagents.\n\nRecently, as a WOC, I've been instigated to think a lot more about race, my race, and my place in society as well. The things I could explain to my family. The things I am very privileged to have. The things I can do for other POC. \n\nWe have to just keep chugging along and get things done. We made it this far, we will one day be done with this chapter of our lives! Take it day by day and make sure to take care of your health first and foremost! Without that, you have nothing. Please take care. :)",
      "author": "FewActinomycetaceae9",
      "created": 1594060820,
      "upvotes": 108,
      "replies": {
        "fx6u1xp": {
          "link": "/r/GradSchool/comments/hmbmf0/not_sure_if_im_burnt_out_from_the_hell_that_is/fx6u1xp/",
          "text": "> I'm just so over being in my late 20's and doing troubleshooting, working on slow-ass projects, and not feeling fulfilled.\n\nThis this this. I'm not even in my late 20s yet but a lot of my friends are either recently out of or finishing up with grad school/law school and I'm ready to have a \"real adult job\" and not be a student anymore. I've felt stuck in a rut for a couple years now and while I am making sufficient progress its just not enjoyable or what I want to do long term. I want to be able to use my degree and knowledge to benefit others, and I don't see how spending the bulk of my life doing basic research in a lab is going to accomplish that (nothing wrong with that path in general of course, but for me specifically). What's the point of spending the rest of my life doing research if too many people are still scared of vaccines, refusing to wear masks, or denying climate change?\n\n\nI have lots of friends and family that don't have strong science backgrounds, and they trust me to help clarify things or find factual information. I'd rather use that influence, trust, and knowledge I have to help bridge the gap and make science more accessible and easier to understand, and to combat disinformation. \n\nThanks, best to you as well :)",
          "author": "sheltiesideeye",
          "created": 1594113825,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634066922
}