{
  "sid": "qrt2c8",
  "link": "/r/GradSchool/comments/qrt2c8/biology_major_w_cs_minor_should_i_go_back_for/",
  "title:": "Biology major w/ CS minor. Should I go back for second BS or MS?",
  "text": "I’m a Biology grad from a top 50 school with CS coursework that is equivalent to a minor. Decided that medical school wasn’t for me, however, I don’t have any internships or industry experience at all in the tech industry. The CS-relevant coursework I have taken are Computer Architecture and Organization, DS&A, OOP, Discrete Math, and Linear Algebra. So pretty much a majority of the lower-division courses.\n\nMy main goal is to use the master’s to fill in my CS gaps as well as use it as a springboard to get a job (I live in the Bay). I’m been learning iOS for the last year or so and having this master's is kind of a back-up in the situation that recruiters decide to just trash my resume since I don’t have a CS degree.\n\nI’m currently in this dilemma of whether I should go back for a 2nd bachelors in CS or just go for a program like OMSCS or on-campus CS master's programs like UPenn, UCLA, and USC. This would probably require me to take the GRE and obtain additional letters of rec. Getting a 2nd bachelors also seems hard to attain considering most universities don't allow for it or put 2nd bachelor applicants at a lower priority compared to 1st bachelor applicants.\n\nWould love anyone's input on this as I'm starting to reach out for letters of rec and I'm not sure if I should be expending my energy on grad school applications. :)",
  "author": "iamthat1dude",
  "created": 1636659233,
  "updated": 1636745984,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkb0z26": {
      "link": "/r/GradSchool/comments/qrt2c8/biology_major_w_cs_minor_should_i_go_back_for/hkb0z26/",
      "text": "Just go for the master’s",
      "author": "iloveregex",
      "created": 1636700343,
      "upvotes": 2,
      "replies": {}
    }
  }
}