{
  "sid": "f8rzld",
  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/",
  "title:": "UC Santa Cruz Strikers to Lose TA Jobs",
  "text": "An update on the UCSC strike.\n\n\"The university is “threatening to fire graduate student workers en masse for asking to be paid enough to live where they work,” reads a memo from graduate employees in the department of astronomy and astrophysics, for example\"\n\n[Article Link](https://www.insidehighered.com/quicktakes/2020/02/24/uc-santa-cruz-strikers-lose-ta-jobs)",
  "author": "POLcyt",
  "created": 1582554555,
  "over_18": false,
  "upvotes": 495,
  "upvote_ratio": 0.98,
  "comments": {
    "fipyjcc": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipyjcc/",
      "text": "Currently on strike in the UK, solidarity!",
      "author": null,
      "created": 1582628026,
      "upvotes": 2,
      "replies": {}
    },
    "fipm5zs": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipm5zs/",
      "text": "Solidarity with the UCSC strikers. My university’s grad students are currently fighting to overturn a ban on graduate assistant unions, so I hope this push from all of you can help all of us over here.",
      "author": "Cubranchacid",
      "created": 1582611484,
      "upvotes": 3,
      "replies": {}
    },
    "fipagj0": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipagj0/",
      "text": "If they hold out and get fired, won’t that incite more to strike?",
      "author": "stripedpixel",
      "created": 1582601742,
      "upvotes": 5,
      "replies": {}
    },
    "fiokvv0": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiokvv0/",
      "text": "Somebody has to be the adult here and say “don’t apply to grad school programs in places where you can’t afford to live on the stipend.”\n\nWhen choosing grad schools it should be on your list of considerations right along with program ranking and prospective advisors.\n\nIt’s not really the school’s fault that their area became ridiculously expensive to live in, that’s on California politicians banning affordable housing through NIMBYism and “environmental protection” laws (which are all about protecting rich people’s property values).\n\nYou can’t get mad at the schools for not having the funds to provide stipends commensurate with the artificially inflated CoL there. Not all of their money is fungible, it’s mostly all earmarked. They can’t easily spend football stadium money on stipends, as annoying as that is.\n\nDon’t get me wrong, I’m not heartless, and the whole system’s dysfunctional, but unless you were promised one stipend and then given a lower one you don’t really have a leg to stand on: you went in with this information.",
      "author": "TakeOffYourMask",
      "created": 1582585247,
      "upvotes": -23,
      "replies": {
        "fipxb6z": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipxb6z/",
          "text": ">You can’t get mad at the schools for not having the funds to provide stipends commensurate with the artificially inflated CoL there\n\nYeah, I can.  CA is the 6th largest economy in the world.  If you're going to operate a R1 university your grad students need to be paid well enough to live.  It's really that simple.",
          "author": "aleatorybug",
          "created": 1582626266,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fiodtrs": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiodtrs/",
      "text": "“You don’t have enough money to live off of? Okay, we’ll just fire you.” How dare the TAs ask for a livable wage. /s",
      "author": "ylang_ylang",
      "created": 1582581300,
      "upvotes": 11,
      "replies": {}
    },
    "fins1q8": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fins1q8/",
      "text": "I have a legitimate question about this.\n\nSo TA/RA/GAs etc are essentially workers, right? When calculating their income, does the university include the costs of their tuition as part of their pay, as a 'compensatory package' or whatever? Since they get to go tuition free, is the university \"paying\" their tuition on their behalf? Or is the tuition just never being charged? Just wondering how exactly that is considered.",
      "author": "validusrex",
      "created": 1582569048,
      "upvotes": 13,
      "replies": {
        "finuhwo": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finuhwo/",
          "text": "*Typically*, TA tuition is paid by the department that hires the TA out of a pot of money it receives from the university to fund teaching for all its. It likely happens as a transfer of funds between ledgers in the University's account since the \"department's money\" is still the \"university's money.\"\n\n*Typically*, GA/RA tuition is paid by the PI who hired the student and the money comes from their grants. This is why RAs in \"poor\" labs also have to TA to get tuition covered.\n\nAt a state school, the school *may* classify out-of-state US citizens/permanent residents as in-state students for the purposes of tuition so that hiring decisions are based on qualifications, not geography. Some state schools also give in-state tuition to all grad students after their first year if they fully shifted their residency over to that state.",
          "author": "MidnightSlinks",
          "created": 1582570428,
          "upvotes": 18,
          "replies": {
            "fipmc3w": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipmc3w/",
              "text": ">Typically, TA tuition is paid by the department that hires the TA out of a pot of money it receives from the university to fund teaching for all its. It likely happens as a transfer of funds between ledgers in the University's account since the \"department's money\" is still the \"university's money.\"\n\nIn departments with steady streams of external grants money, tuition \"waivers\" are often paid by the department out of overhead. This is the same reason science and engineering departments typically pay their TAs quite a bit more than university minimum. So it's not exactly just the university moving imaginary money around; it in fact is a steady stream of money from external granting agencies (often publicly funded federal agencies) into general university income via actual tuition payment. Tuition waivers are often only distributed to have-not departments where there is a need for undergraduate education above and beyond the funding the department actually brings in. Universities distribute those because teaching \"Freshman Comp\" or \"Shakespeare for Nonmajors\" generates way more income for the university than it costs to waive a PhD student's tuition.\n\nWhile we're at it, \"tuition\" for thesis-based grad students is a goddamn scam. I take no classes, teach half-time, and work as a full time lab technician and research scientist, get paid less than minimum wage, and I am assessed \"tuition\" because I am still classified as a \"trainee.\" They'd try to scrape \"tuition\" out of postdocs if they could find a way how to do that. Bunch of goddamn vultures.",
              "author": "tchomptchomp",
              "created": 1582611662,
              "upvotes": 3,
              "replies": {}
            },
            "finvj01": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finvj01/",
              "text": "Interesting, thank you!",
              "author": "validusrex",
              "created": 1582571016,
              "upvotes": 2,
              "replies": {}
            },
            "fipfa45": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipfa45/",
              "text": "Anecdotally, my department spends much more on TAs (~$750k) than the college gives us money for ($350k) in order to both meet our teaching load and to ensure PhD student enrollment is where the college demands it be.\n\nEven though on paper it should seem like two transactions that just cancel each other out, departments, colleges, and the University are all treated as their own independent fiscal units and that excess money has to come from funds generated by the department (departmental portion of student lab fees/grant receipts/industry contracts/patent royalties/alumni donations/etc.)",
              "author": "tharvey11",
              "created": 1582605285,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fiom56k": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiom56k/",
          "text": "> Just wondering how exactly that is considered.\n\nIt is argued that it is considered, and I think that that is a fair point coming from the University. However, it is something that should be discussed openly and comprehensively when discussing you're benefits package as a graduate assistant.\n\nSome basic math as well for you:\nEngineering TA/RA stipend (for a MS student) at my public research institution: ~$25k plus a tuition waiver for up to 9 credits each semester at ~$1,100 per credit. Total value of ~$45k per year.\n\nWith only a BS and 1.5 years of experience in my field I was making ~$65k. Even if you count the cheaper and better health insurance that only counts for ~$6k. Even with the most generous considerations of what is considered GA \"compensation\" you're still ~20% in the hole.\n\nFurther, consider that I left graduate school and got a job as a junior research engineer (very similar in role to a middle of graduate school PhD student) and am receiving comperable health insurance, slightly worse tuition benefits, $81k on salary plus paid sick days, holidays, and time off.\n\nKnow your worth. Solidarity.",
          "author": "jabrodo",
          "created": 1582585937,
          "upvotes": 3,
          "replies": {
            "fioqpux": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fioqpux/",
              "text": "This is exactly the kind of breakdown I was looking for. Very interesting. Thanks!",
              "author": "validusrex",
              "created": 1582588771,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "finrfzd": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finrfzd/",
      "text": "Workers of the world unite",
      "author": "RagePoop",
      "created": 1582568749,
      "upvotes": 17,
      "replies": {}
    },
    "finqhza": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finqhza/",
      "text": "Don't read the comments there, they're all cancer.\n\n*Workers should be paid a living wage.* End stop.",
      "author": "raggedpanda",
      "created": 1582568279,
      "upvotes": 93,
      "replies": {
        "fio8281": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fio8281/",
          "text": "Bet if this were happening at Alabama or Clemson these comments wouldn’t be here",
          "author": "xX_throw__away_Xx",
          "created": 1582578106,
          "upvotes": 14,
          "replies": {
            "fioini6": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fioini6/",
              "text": "[deleted]",
              "author": null,
              "created": 1582584076,
              "upvotes": 8,
              "replies": {
                "fiojzoj": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiojzoj/",
                  "text": "I’m referring to boomers hating everything California because they think it’s the modern-day Sodom and Gomorrah",
                  "author": "xX_throw__away_Xx",
                  "created": 1582584775,
                  "upvotes": 16,
                  "replies": {
                    "fipyi6j": {
                      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipyi6j/",
                      "text": "Well it is, which is why it's a great place to live, until the smiting anyway",
                      "author": null,
                      "created": 1582627982,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                },
                "fiolbkp": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiolbkp/",
                  "text": "Low cost of living is great, but heads up I suggest you take a look at the grad student fees at Clemson (which are never covered by assistantships, as far as I know). It’s about twice as much there as what I’ve seen at any other uni.",
                  "author": "obscure_mammal",
                  "created": 1582585479,
                  "upvotes": 8,
                  "replies": {
                    "fiosxxj": {
                      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiosxxj/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1582590242,
                      "upvotes": 3,
                      "replies": {
                        "fiot5u0": {
                          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiot5u0/",
                          "text": "Damn, that stipend though! My department doesn’t offer that much. The up side is that the stipend pays for a bunch of perks... assuming you have the time to take advantage of them.",
                          "author": "obscure_mammal",
                          "created": 1582590389,
                          "upvotes": 2,
                          "replies": {
                            "fiovvpu": {
                              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiovvpu/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1582592220,
                              "upvotes": 4,
                              "replies": {
                                "fipcctv": {
                                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipcctv/",
                                  "text": "You don't need to worry about the horror stories - Clemson is great and the cost of living is so ridiculously low. When I started my program (2014), my stipend was $18k and that was enough to live comfortably AND start chipping away at some of my undergrad student loans.\n\nAt $27k, you really won't have to worry about money - especially if you will be able to live with family. If you do end up at Clemson and have any questions or need advice feel free to shoot me a PM - all 3 of my degrees (in STEM) are from Clemson and I'm a now a NTT faculty member here as well, so I'm pretty familiar with the University and area!",
                                  "author": "tharvey11",
                                  "created": 1582603103,
                                  "upvotes": 3,
                                  "replies": {}
                                },
                                "fis25aj": {
                                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fis25aj/",
                                  "text": "27k in an area like that? I was doing chemistry and got 25k... in NYC... which was a big reason why I quit halfway through my PhD",
                                  "author": "iammaxhailme",
                                  "created": 1582676080,
                                  "upvotes": 1,
                                  "replies": {
                                    "fis3ro3": {
                                      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fis3ro3/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1582677121,
                                      "upvotes": 1,
                                      "replies": {
                                        "fis42x4": {
                                          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fis42x4/",
                                          "text": "True, I didn't pay any tuition. My uni health insurance wasn't free though, but it was only like $150/year so close enough by American standards",
                                          "author": "iammaxhailme",
                                          "created": 1582677324,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "fiq49v7": {
                          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiq49v7/",
                          "text": "That's a really great stipend in a low cost of living area. I'd think you're among the more fortunate, in that regard.",
                          "author": "Naxek",
                          "created": 1582634622,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fioltaz": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fioltaz/",
                  "text": "A decent program would account for high COL by giving students more money in their stipends but alas we live in a society",
                  "author": "BottleONoobSauce",
                  "created": 1582585756,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "fipbfov": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipbfov/",
              "text": "We're actually going through something similar at Clemson. Not a strike, but lots of reporting has come out recently that lecturers in our English department make substatially less than their peers at similar institutions and that brand new, fresh out of undergrad teachers in the local school districts are earning more than MA/PhD faculty at the University \n\nAny time the articles get discussed on Reddit/Facebook (and especially in the comment sections of the articles) there are an unsettling number of similar comments, FWIW.",
              "author": "tharvey11",
              "created": 1582602443,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fipuo30": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipuo30/",
          "text": "[deleted]",
          "author": null,
          "created": 1582622292,
          "upvotes": 0,
          "replies": {
            "fiqxss8": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiqxss8/",
              "text": "I'd really have to default to people with better economics backgrounds on how to appropriately adjust for cost of living, inflation, and so on. As a grad student, I fully understand the limits of my knowledge and deferral to expertise. My issue is an ethical and moral one, not an economic one.",
              "author": "raggedpanda",
              "created": 1582653543,
              "upvotes": 2,
              "replies": {
                "fire1ew": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fire1ew/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1582662608,
                  "upvotes": 1,
                  "replies": {
                    "firjgfr": {
                      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/firjgfr/",
                      "text": "Family size should certainly be factored into compensation- my school, for example, does give medical benefits to family members and assists with childcare, but as I don't have children or dependents myself I don't have that lived experience. Whether those benefits would be better factored into the actual wage amount or not I'm not really qualified to say.",
                      "author": "raggedpanda",
                      "created": 1582665545,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fioleyi": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fioleyi/",
          "text": "No, workers should be paid the wage they mutually agreed upon. That’s how prices work, and wages are prices.  Setting price floors just leads to a surplus (in the case of jobs, a surplus is *unemployment*).  If stipends are too low, that will show up as a shortage of applicants and high turnover and schools will adjust naturally, with no coercion necessary.",
          "author": "TakeOffYourMask",
          "created": 1582585531,
          "upvotes": -22,
          "replies": {
            "fiopn3o": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiopn3o/",
              "text": "Right, because that’s obviously how it works in real life. No one is taking TAships at UCSC and those that are deserve sub-subsistence level wages because they weren’t savvy enough to not be duped. Okay. Sure.",
              "author": "raggedpanda",
              "created": 1582588068,
              "upvotes": 11,
              "replies": {
                "fip281m": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fip281m/",
                  "text": "Yeah, actually, that is how the real world works. Visit your local economics department.",
                  "author": "TakeOffYourMask",
                  "created": 1582596390,
                  "upvotes": -10,
                  "replies": {
                    "fipkfq5": {
                      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipkfq5/",
                      "text": "As the local economics department, LOL. Graduate stipends are a classic example of monopsony or market power by the employer in which case prices floors can be optimal.",
                      "author": "A_Crazy_Canadian",
                      "created": 1582609735,
                      "upvotes": 5,
                      "replies": {
                        "fiqk9y4": {
                          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiqk9y4/",
                          "text": "How are graduate stipends monopsonies when there are many universities competing with each other for grad students?",
                          "author": "TakeOffYourMask",
                          "created": 1582646111,
                          "upvotes": 1,
                          "replies": {
                            "fir1tfa": {
                              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fir1tfa/",
                              "text": "PhD students aren't choosing schools based on TA wages, if they were, they wouldn't be doing a PhD. It is a monopsony in a practical sense, in that students can't choose to be TAs at a different school even if they could theoretically teach at another university.",
                              "author": "terrycranberry",
                              "created": 1582655678,
                              "upvotes": 1,
                              "replies": {}
                            },
                            "fis364d": {
                              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fis364d/",
                              "text": "Several methods:\n* For applications, most students have a plausible set of a dozen or so schools to choose from for applications purposes given faculty research interests. This is small enough that when coupled with any sort of locational constraints that monopsony power exists. Plus applications to each schools are costly at $200 dollars or so and high search costs lead to market power/monopsony. \n\n* After applications, students usually face a handful or less acceptances to choose among. Myself and most by buddies applying had 1-3 choices or we would have to deal with the costs of delaying a year. \n\n* A student in their second year forward faces large lock-in-effects since they cannot easily switch programs. Its something that is rare and even when possible often extends time to graduation significantly. \n\nAll three factors lead to significant market power in the hands of universities who then can extract sub-competitive equilibrium wages from graduate students.",
                              "author": "A_Crazy_Canadian",
                              "created": 1582676739,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "fipjimt": {
                      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipjimt/",
                      "text": "First I’d challenge you to visit a local ethics department, then return with some idea of how to treat people trying to make a living. We have enough money. The schools have enough money. We don’t need to be slaves to capitalism, we can afford to treat other human beings as worthy of basic support and rights.",
                      "author": "raggedpanda",
                      "created": 1582608877,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fir4ld6": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fir4ld6/",
              "text": "What do you think is happening here? Workers are bargaining with their employer to secure a better wage. Bargaining for a raise is not setting a wage floor, and I don't believe that a raise in the state minimum wage is one of the demands of these students.",
              "author": "puffdexter149",
              "created": 1582657254,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "finmzwe": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finmzwe/",
      "text": "Don't read the comments on the article. Wow. \n\nSolidarity!",
      "author": null,
      "created": 1582566288,
      "upvotes": 55,
      "replies": {
        "finonif": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finonif/",
          "text": "“Those grad students knew it was expensive before they signed up!” \n\nGive me a fucking break... the university is rich and exploiting these people—graduate labor is inherently exploitative. Capitalism has a hell of way of making workers the bad guy when they ask to be paid fairly.",
          "author": null,
          "created": 1582567248,
          "upvotes": 98,
          "replies": {
            "finrcq9": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finrcq9/",
              "text": "Victim blaming never goes out of style for some people, ugh",
              "author": null,
              "created": 1582568702,
              "upvotes": 44,
              "replies": {
                "finrhp0": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finrhp0/",
                  "text": "The solution for these people is legitimately for graduate students to do something else with their lives. But the rich university paying them more money...? No, that wouldn’t be right.",
                  "author": null,
                  "created": 1582568774,
                  "upvotes": 23,
                  "replies": {
                    "fipd7e6": {
                      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipd7e6/",
                      "text": "Well why do you deserve a doctorate I your family doesn't have a fortune? \n\n\\s",
                      "author": "goodytwoboobs",
                      "created": 1582603719,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fio7mt9": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fio7mt9/",
              "text": "Heck, capitalism itself is inherently exploitative.",
              "author": "bennyandthef16s",
              "created": 1582577868,
              "upvotes": 18,
              "replies": {
                "fio7x5u": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fio7x5u/",
                  "text": "I personally think that view is a little bit reductive, but I mostly agree.\n\nEdit: okay yeah I get it guys capitalism bad",
                  "author": null,
                  "created": 1582578027,
                  "upvotes": -6,
                  "replies": {}
                }
              }
            },
            "fiozpdb": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiozpdb/",
              "text": "Capitalism in a publicly funded university? What are you even talking about? lol",
              "author": "resorcinarene",
              "created": 1582594749,
              "upvotes": -11,
              "replies": {
                "fip12i5": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fip12i5/",
                  "text": "There’s still time to delete this incredibly stupid comment",
                  "author": null,
                  "created": 1582595636,
                  "upvotes": 11,
                  "replies": {
                    "fip47e1": {
                      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fip47e1/",
                      "text": "Tax funded University pays very little. OMG, the capitalists have done it again!",
                      "author": "resorcinarene",
                      "created": 1582597655,
                      "upvotes": -9,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "finmc4l": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finmc4l/",
      "text": ">request for $1,412 extra per month.\n\nThat seems like a lot",
      "author": "MyRedditAccount001",
      "created": 1582565915,
      "upvotes": 4,
      "replies": {
        "finn04b": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finn04b/",
          "text": "Have you seen rent prices in many of the big cities with UC's? Santa Cruz, San Francisco, Berkeley, and LA and San Diego are all areas with a very high cost of living. \n\nI think the issue is that grad student salaries are negotiated for all UC's collectively, instead of giving higher salaries for UC's where the cost of living is high.",
          "author": "cclfitzge",
          "created": 1582566292,
          "upvotes": 57,
          "replies": {
            "finyjbw": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finyjbw/",
              "text": "Southern CA TA here, I had to HUSTLE to make rent. Including so many side jobs- teaching local CC classes as an adjunct, tutoring, dog sitting, and donating my eggs. It's been a real struggle",
              "author": "nemoflamingo",
              "created": 1582572768,
              "upvotes": 23,
              "replies": {
                "fipmgov": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipmgov/",
                  "text": ">and donating my eggs. \n\nNot the first time I've heard of that. Which ought to be a goddamn scandal.",
                  "author": "tchomptchomp",
                  "created": 1582611799,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "finq2n0": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finq2n0/",
              "text": "do any of those campuses have grad student housing? UM did, it was pretty reasonable.",
              "author": "Furthur",
              "created": 1582568069,
              "upvotes": 7,
              "replies": {
                "finttfc": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finttfc/",
                  "text": "Irvine is the only one with affordable housing for graduate students, but its not guaranteed",
                  "author": "oligobop",
                  "created": 1582570033,
                  "upvotes": 21,
                  "replies": {
                    "finug1a": {
                      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finug1a/",
                      "text": "Gotcha I didn’t utilize them because they didn’t allow dogs unless it was a service animal but almost my entire cohort lived in the grad student housing it was like a mega apartment complex filled with them.",
                      "author": "Furthur",
                      "created": 1582570397,
                      "upvotes": 2,
                      "replies": {
                        "finv1gt": {
                          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finv1gt/",
                          "text": "I think that's a very rare thing. I'm in Toronto and there are maybe 80 graduate student housing spots (dorm style, so really doesn't work for adults with pets and kids) for 10k graduate students.",
                          "author": "riotous_jocundity",
                          "created": 1582570737,
                          "upvotes": 8,
                          "replies": {}
                        }
                      }
                    },
                    "fiobtjp": {
                      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiobtjp/",
                      "text": "UCSD has graduate housing being built which is much cheaper than the surrounding neighborhood. I'm paying $850/mo for a studio in the graduate housing in UTC which normally would cost $1400-1600 for a studio, and utilities are included.",
                      "author": "eng2016a",
                      "created": 1582580201,
                      "upvotes": 2,
                      "replies": {
                        "fiojkr3": {
                          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiojkr3/",
                          "text": "Ya that's much cheaper, but you have to live in UTC and that sucks.  It's essentially a mall town.",
                          "author": "oligobop",
                          "created": 1582584561,
                          "upvotes": 2,
                          "replies": {
                            "fioknlf": {
                              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fioknlf/",
                              "text": "yeah not gonna lie it's pretty godawful boring here, but at least i can walk to lab from home so i don't have to commute to work",
                              "author": "eng2016a",
                              "created": 1582585134,
                              "upvotes": 1,
                              "replies": {
                                "fioovvz": {
                                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fioovvz/",
                                  "text": "Ya I worked at scripps for a long while during my graduate.  The mesa is pretty cool as a place to work, but not so much to live.",
                                  "author": "oligobop",
                                  "created": 1582587582,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "fipncui": {
                          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipncui/",
                          "text": "And that's still 40-50percent of the average stipend.. and HDH raising rent again next year so that they can return half of what they get paid every month back to the university.",
                          "author": "doiknowyou9",
                          "created": 1582612768,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fino5gv": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fino5gv/",
          "text": "It does, but California rent is disgustingly high. Cost of living is ridiculously high there.",
          "author": "happytransformer",
          "created": 1582566960,
          "upvotes": 22,
          "replies": {
            "fio0cdu": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fio0cdu/",
              "text": "Seems like a good time to remind everyone that California killed SB 50 which would have been a big first step in fixing the state's housing costs.",
              "author": "zcleghern",
              "created": 1582573810,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "finoims": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finoims/",
          "text": "[deleted]",
          "author": null,
          "created": 1582567171,
          "upvotes": 3,
          "replies": {
            "finp73p": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finp73p/",
              "text": "Shortly after that number is cited in the article it explains the rationale is to reduce the proportion of income spent on rent from 60% to 30%.",
              "author": "Pancurio",
              "created": 1582567565,
              "upvotes": 15,
              "replies": {
                "finpz3p": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finpz3p/",
                  "text": "I mean, we get weighted stipends for studying in London compared to the rest of the U.K. due to cost of living, and I get ~£3-3.5k more a year because of it. I still speak a higher proportion of my stipend on rent than my cousin doing hers in Glasgow though - me at 43% and she at 28% - and that’s not including increased cost of food and travel etc. However the London weighting makes it doable.",
                  "author": "ayeayefitlike",
                  "created": 1582568014,
                  "upvotes": 13,
                  "replies": {
                    "finsbp3": {
                      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finsbp3/",
                      "text": "I have been sort of looking at career prospects in the UK recently (I’m from the US) and it sounds like the “London Adjustment” is something that is regularly considered for all types of jobs located in London. Is this correct? I had not heard of this until I randomly stumbled upon a job posting that mentioned it.",
                      "author": "SaintLoserMisery",
                      "created": 1582569187,
                      "upvotes": 6,
                      "replies": {
                        "finthoe": {
                          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finthoe/",
                          "text": "It is for a few - typically for careers that aren’t otherwise London-centric (like finance is for example) and therefore the salaries don’t compete.\n\nHowever, it’s only a *true* adjustment in public sector jobs like teaching etc, where that is mandated - in most industries it’s a competition based thing, just called London weighting.",
                          "author": "ayeayefitlike",
                          "created": 1582569844,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "finpf20": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finpf20/",
              "text": "I think it says in the article that that increase would reduce the rent burden to 30% of monthly income. It's presumably based on some kind of city or county average rent price.\n\nIt's just a bargaining number, though. The university has reponded with a counter offer of $208 per month (in the form of a $2500 a year bonus).",
              "author": "yerfukkinbaws",
              "created": 1582567696,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "fink1xo": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fink1xo/",
      "text": "Title makes it sound like they are definitely being fired, but being threatened is a bit different.",
      "author": "garulous",
      "created": 1582564757,
      "upvotes": 29,
      "replies": {}
    },
    "finjlt8": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finjlt8/",
      "text": "Some more info:\n\nThe original grade deadline was last Friday, 2/21, but due to the outcry and statements from most departments that they would not fill TA vacancies vacated by fired TAs, the administration decided to push that deadline to 2/27. What's more, the offer of a guaranteed $2500 a year COLA is the first time the administration has actually made an offer. This is big news considering the university has consistently argued that negotiations with the strikers was not legally permitted. It opens the door for us to negotiate a better cola.\n\nBut there's more: the statewide union is considering filing an unfair labor practice against the university for direct dealing, which means we may end up having the union on our side for a while at least moving forward. To be clear, there is precedent for us negotiating with the university directly and independently of the union, but if the union wants to step into the fray with us, we won't say no.\n\nFor the first time since we started this, it looks like we have the upper hand. Some of our TAs are still very much at risk of not getting TA appointments, but the administration is showing vulnerabilities that we've been waiting to exploit.",
      "author": "ladut",
      "created": 1582564536,
      "upvotes": 212,
      "replies": {
        "finoi51": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finoi51/",
          "text": "> the statewide union is considering filing an unfair labor practice against the university for direct dealing, which means we may end up having the union on our side for a while at least moving forward\n\nCan you explain this? It sounds like the opposite. It sounds like UAW would be suing to prevent the UC from dealing directly with the students, which wouldn't be helpful at all. What am I missing?",
          "author": "yerfukkinbaws",
          "created": 1582567163,
          "upvotes": 32,
          "replies": {
            "fip2i1a": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fip2i1a/",
              "text": "The university broke the rules by making a direct offer, this gives the union a bunch of powers that they wouldn't normally, and may result in opening up real UC-wide bargaining for a raise for everyone. Plus, it tips the university's hand at a starting offer.",
              "author": "SangersSequence",
              "created": 1582596570,
              "upvotes": 23,
              "replies": {}
            },
            "finpal6": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finpal6/",
              "text": "I don't fully understand the details myself, but apparently by filing, they would also be opening up the ability for us to have a 1-3 day statewide sanctioned strike.",
              "author": "ladut",
              "created": 1582567623,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "finj36k": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finj36k/",
      "text": "Not surprised, but disappointed.",
      "author": "iammaxhailme",
      "created": 1582564251,
      "upvotes": 14,
      "replies": {}
    },
    "finiixb": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finiixb/",
      "text": "Solidarity with UCSC grad workers. Please donate to their strike fund.",
      "author": "wombatblue",
      "created": 1582563953,
      "upvotes": 206,
      "replies": {
        "fintys0": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fintys0/",
          "text": "[deleted]",
          "author": null,
          "created": 1582570119,
          "upvotes": 23,
          "replies": {
            "fio6xvi": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fio6xvi/",
              "text": "https://payusmoreucsc.com/\n\nThey have a GoFundMe link on their home page.\n\nEdit: Formatting",
              "author": "deliciouswaffle",
              "created": 1582577486,
              "upvotes": 24,
              "replies": {
                "fiodriy": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiodriy/",
                  "text": "Thank you!",
                  "author": "DocVafli",
                  "created": 1582581266,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fingynk": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fingynk/",
      "text": "solidarity  \ni make a livable wage in nj as a grad student, wish everyone else could too. Grad school is stressful enough without worrying about eating and rent.",
      "author": "Onion-Fart",
      "created": 1582563173,
      "upvotes": 100,
      "replies": {
        "fioe2nx": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fioe2nx/",
          "text": "Where the hell do you live here in NJ on a grad student stipend? I have two jobs (plus my stipend) and it's hard.",
          "author": "DocVafli",
          "created": 1582581433,
          "upvotes": 9,
          "replies": {
            "fipiztw": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipiztw/",
              "text": "roughly 35k a year at Princeton, 30k at Rutgers. You can live comfortably on that.",
              "author": "budna",
              "created": 1582608405,
              "upvotes": 14,
              "replies": {}
            },
            "fiovpz1": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiovpz1/",
              "text": "Probably someone in STEM where we aren't allowed to have jobs outside of school. It's literally in my contract. I live in a major city and make enough from my stipend to live on just fine.\n\nI know grad students at Rutgers that are doing fine",
              "author": "ImJustAverage",
              "created": 1582592112,
              "upvotes": 20,
              "replies": {}
            }
          }
        }
      }
    },
    "finfs7o": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finfs7o/",
      "text": "I would say that this would be cutting off the nose to spite the face, but there will be a thousand other desperate grad students ready to jump into those labs/classes. Unfortunately, the monopoly may be winning...",
      "author": "stolid_agnostic",
      "created": 1582562607,
      "upvotes": 44,
      "replies": {
        "finnjea": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finnjea/",
          "text": "Terminating TAships is not the same thing as kicking them out of grad school. It just means that the university stops paying them for the semester and tries to rescind tuition waivers, which won't succeed because it is patently against the law and California will stand by workers rights here.  \n\nMeanwhile, the univeristy is stuck trying to find some way to fill in thousands of TAships, which are extremely low-paying jobs, at a moment's notice for a two month period of time. UCSC will have to organize a search for literally thousands of temporary employees, who will each require background checks and application packages. Those searches will likely take several weeks just to get through HR, which means that realistically another month of classes will go untaught at the very least. Furthermore, no one is going to relocate to Santa Cruz for two months just to take a few TAships that will pay maaaaaybe a few thousand dollars in total over those two months.\n\nThis is a completely empty threat. At the very most the university ties up tuition waivers in court for a while, which costs a lot for students in the interim but will ultimately lose in court. This doesn't do the university any good. Realistically, that ends up costing departments rather than students, because most departments will have committed to funding students in their offer letters. At the very most, the university saves a few months of TA pay at the expense of committing to undergrads having no labs or discussion sections.",
          "author": "tchomptchomp",
          "created": 1582566606,
          "upvotes": 77,
          "replies": {
            "fipdknz": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fipdknz/",
              "text": "Forgive my ignorance (I'm not an expert in employment law, nor California laws) but why would it be illegal for the University to rescind tuition waivers? \n\nThe waiver is essentially a benefit of (and contingent on) employment - if the employee is terminated for cause, why would the University not be entitled to charge them tuition to remain enrolled? Sure it may need to be prorated, since the semester is underway, but why are the striking workers entitled to it as compensation when they are refusing to work?",
              "author": "tharvey11",
              "created": 1582603984,
              "upvotes": 2,
              "replies": {
                "fiplbwe": {
                  "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiplbwe/",
                  "text": "Participation in a legal work action is protected and therefore cannot be \"cause\"",
                  "author": "tchomptchomp",
                  "created": 1582610616,
                  "upvotes": 2,
                  "replies": {
                    "fiq0hxn": {
                      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fiq0hxn/",
                      "text": "Isn't a wildcat strike not a legal work action though?",
                      "author": "tharvey11",
                      "created": 1582630621,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "finnkrd": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finnkrd/",
          "text": "> there will be a thousand other desperate grad students ready to jump into those labs/classes\n\nWill there? There's not really much competition for these positions. It's not like there's a ton of grad students who can't get a TA position and end up having to pay full tuition. Generally, at least in the UC system, if you want a TA job, you can get one easily.",
          "author": "yerfukkinbaws",
          "created": 1582566628,
          "upvotes": 46,
          "replies": {}
        },
        "finqlzk": {
          "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finqlzk/",
          "text": "Someone said in another comment that departments are refusing to fill any forcibly vacated positions and standing with their students!",
          "author": "mollymayhem08",
          "created": 1582568331,
          "upvotes": 42,
          "replies": {
            "finr5rc": {
              "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/finr5rc/",
              "text": "That's good to hear!",
              "author": "stolid_agnostic",
              "created": 1582568605,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "fineafr": {
      "link": "/r/GradSchool/comments/f8rzld/uc_santa_cruz_strikers_to_lose_ta_jobs/fineafr/",
      "text": "The base of the pyramid scheme is getting crushed",
      "author": null,
      "created": 1582561781,
      "upvotes": 145,
      "replies": {}
    }
  },
  "updated": 1634065023
}