{
  "sid": "q5656z",
  "link": "/r/GradSchool/comments/q5656z/planning_to_apply_for_grad_school_in_the_us_where/",
  "title:": "Planning to apply for grad school in the US: where do I begin?",
  "text": "So I am planning to apply for an Economics PhD programme next year and the process is quite overwhelming. I am an international student so I'm not very familiar with what unis are good, which specific programmes would be suitable for me and the expenses I should be ready for. I would ask someone, except everyone ends up saying that I need to look up unis on my own to see if they are suitable. However, there are so many unis that I don't know where to start. I'm also very unsure about the application processes. So my question is, how do I start this search process?",
  "author": "charu_stark",
  "created": 1633864649,
  "updated": 1634099778,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hg406y5": {
      "link": "/r/GradSchool/comments/q5656z/planning_to_apply_for_grad_school_in_the_us_where/hg406y5/",
      "text": "A good place to start looking at universities would be a site like this:\n\n[https://www.usnews.com/best-graduate-schools/top-humanities-schools/economics-rankings](https://www.usnews.com/best-graduate-schools/top-humanities-schools/economics-rankings)\n\n&#x200B;\n\nThey have a comprehensive ranking of graduate schools in economics, so you can get an idea of the schools in the range you are shooting for (obviously the top programs are going to be hyper competitive). The previous advice you received is right though, you need to do the research on your own to find the best place for you. Every university is going to be different and have different application requirements.  You'll also want to dig through the websites of schools you are interested in to learn a bit more about the faculty and research they specialize in.\n\nExpenses are also going to vary from program to program. Typically the pay rate (stipend) will be fairly comparable across schools, but the cost of living will vary drastically from city to city. You can live comfortably on a small stipend in some cities, but other cities are so expensive you will need to have some kind of external support to survive. \n\nTalk to faculty at your undergrad university. Have any of them done a PhD in the US? The best resource is going to be having a conversation with someone who walked the same path you are trying to walk.",
      "author": "cman674",
      "created": 1633878586,
      "upvotes": 2,
      "replies": {
        "hg7j47l": {
          "link": "/r/GradSchool/comments/q5656z/planning_to_apply_for_grad_school_in_the_us_where/hg7j47l/",
          "text": "Thank you so much!",
          "author": "charu_stark",
          "created": 1633942928,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}