{
  "sid": "r4wln1",
  "link": "/r/GradSchool/comments/r4wln1/although_ive_followed_how_to_use_apa_for/",
  "title:": "Although I've followed how to use APA for citations, there still are quite a lot of issues coming up for me",
  "text": "Sometimes, I don't have the physical book with me, and I don't see clearly what I should put for Publisher. \n\nFor example, I am trying to find what to put for the Publisher for this book: Schwebel, J. & Raph, M. (1974). Piaget in the Classroom.\n\n&#x200B;\n\nHere ( [https://www.worldcat.org/title/piaget-in-the-classroom/oclc/677088](https://www.worldcat.org/title/piaget-in-the-classroom/oclc/677088) ) it says the publisher is: New York, Basic Books\n\nBut here ( [https://journals.sagepub.com/doi/10.1177/003452377902100101](https://journals.sagepub.com/doi/10.1177/003452377902100101)  ) it says the publisher is: Routledge & Kegan Paul.\n\n&#x200B;\n\nAlso, I have seen papers that were distinguished and received high marks that cite Journal articles with the title in bold with APA styling, but online it shows the correct APA styling is the title is not bold but normal and the journal is italicized. \n\nFrom what I can gather, is this correct: When it is a book, for APA, I should italicize the title, and not the publisher. But for Journals I should italicize the Journal/volume,etc but not the title. And I should not bold anything?\n\nThank you.",
  "author": "MattPilkerson",
  "created": 1638194864,
  "updated": 1639880421,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmjdn38": {
      "link": "/r/GradSchool/comments/r4wln1/although_ive_followed_how_to_use_apa_for/hmjdn38/",
      "text": ">When it is a book, for APA, I should italicize the title, and not the publisher. But for Journals I should italicize the Journal/volume,etc but not the title. And I should not bold anything?\n\nThat seems correct to me. I mostly use APA style, but individual journals also sometimes have their own style which is incredibly annoying.",
      "author": "False-Guess",
      "created": 1638198577,
      "upvotes": 1,
      "replies": {}
    },
    "hmkgdnf": {
      "link": "/r/GradSchool/comments/r4wln1/although_ive_followed_how_to_use_apa_for/hmkgdnf/",
      "text": "Use Purdue owls apa guide.\n\nThe publisher should always be the edition you're citing in your paper. Bc page 99 of one edition is not necessary page 99 in a different edition.",
      "author": "lanabey",
      "created": 1638214481,
      "upvotes": 1,
      "replies": {}
    }
  }
}