{
  "sid": "qum52f",
  "link": "/r/GradSchool/comments/qum52f/just_about_had_it/",
  "title:": "Just about had it",
  "text": "I'm about to graduate next month with my master's, but I'm likely to score a D in one of my classes, delaying my official graduation by another semester as I'd need to retake it.\n\nI've had it, though. The class average for that course this semester is a high D as well, and the attrition rate is about 60%. The same professor will be teaching it next semester, and it's very unlikely he'll change any policies. The only way for me to officially get out is if I score an 85 or higher on the final, an improbable feat given that my highest score this semester was a 70.\n\nIf things don't work out for me, I'll probably just walk the stage and drop out of grad school afterwards. I can't take being in school for so long, only to be denied completion by just 1 factor.",
  "author": "brokenglasses97",
  "created": 1636998761,
  "updated": 1637182693,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hkrpmmo": {
      "link": "/r/GradSchool/comments/qum52f/just_about_had_it/hkrpmmo/",
      "text": "Maybe you can talk to your program advisor and see if they’re willing to let you graduate with a D. Explain the situation and show them that the average is a high D. Also, if it’s a graduate class and the average is that low he might even curve it. I honestly don’t think you should let one class hinder your masters degree. If there’s a will, there’s a way!",
      "author": "m27vzkali",
      "created": 1637011097,
      "upvotes": 6,
      "replies": {}
    },
    "hkqwfjl": {
      "link": "/r/GradSchool/comments/qum52f/just_about_had_it/hkqwfjl/",
      "text": "Are you sure if you retake the class, and study like crazy, that you can't earn a better grade? \n\nNot getting your Masters because of one class is something you might regret later in life.",
      "author": "raistlin65",
      "created": 1636999611,
      "upvotes": 10,
      "replies": {}
    }
  }
}