{
  "sid": "ragrsl",
  "link": "/r/GradSchool/comments/ragrsl/economics_phd_question/",
  "title:": "Economics PhD Question",
  "text": "I'm not entirely sure if this is the right place to ask this question, but 🤷‍♂️\n\nI am a sophomore studying physics at an honors college at public flagship and am currently in the top 100 students overall in the college. I have a rigorous math background and am currently on track to graduate with a dual degree in math and physics. I have discovered though that physical problems don't interest me as a course of research. It's already too late to switch my major to an engineering program and, honestly, I don't know if that's where my future lies. This isn't uncommon for physics majors who don't really know what physics research looks like until they get far enough in to the major to realize it's not for them.\n\nResearch questions that do interest me include economic questions. I did debate in high school and had to read quite a bit of economic literature (more on the paper end than the book end, though books were quite fun!) This literature was always interesting and tantalizing, but, given my talents/interests in other areas and my family history as scientists, I chose to pursue the natural sciences over the social sciences as part of continuing that legacy (I was 17 at the time, so it wasn't unreasonable).\n\nAt this point, I could switch out of physics and move into statistics starting my junior year (I'll try and finish up my core requirements in the physics department and take math courses essential to stats). It is too late though to get a degree in economics. I could only pursue a minor with the time I have left on my scholarship. I could focus on econometrics and the application of statistics (as well as physics) to economics with this minor and pursue research in economics at my university through certain professors amenable to that sort of thing.\n\nWould this be enough to be competitive in applications to PhD programs? I know lacking a full economics degree would cut me off from certain research questions (definitely historical questions would be hard to justify) as an applicant. Is it still possible that I could attempt a PhD, or should I focus on industry jobs and consider the PhD program later in life after having time to independently finish an economics degree?",
  "author": "Realistic-Set-7937",
  "created": 1638822273,
  "updated": 1639518947,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hni7be9": {
      "link": "/r/GradSchool/comments/ragrsl/economics_phd_question/hni7be9/",
      "text": "First off you don’t need a degree in economics to get e PhD in economics (in the US). To pursue a PhD degree at a minimum you need to have a foundational background in economics. This is typically intermediate macro and micro and an econometrics course. To improve you competitiveness as a candidate taking additional math is always beneficial. I suggest looking at the aea webpage for applying to graduate. It is a top notch resource that will help you in planning your schedule both academic and application. \n\nEntering a program in the US you are not required to have a research question. Having one won’t hurt but you won’t even touch that until part way through your second year.\n\nHappy to answer any other questions you may have.",
      "author": "dalilewok",
      "created": 1638823610,
      "upvotes": 5,
      "replies": {
        "hnij869": {
          "link": "/r/GradSchool/comments/ragrsl/economics_phd_question/hnij869/",
          "text": "Thank you for the answer!\n\nI had noticed the math emphasis and various iterations of \"demonstrated interest\" in economics, but I figured that was due to various possible degrees that could have a connection to economics (several of which are found in business schools). Knowing that there's not a strict major grouping is good. I'll have access to honors sections in every single one of those foundational courses, so that's giving me hope.\n\nAs for research questions, it feels as if just reading the news and various papers always leaves me wanting because of unquestioned premises that need more brushing up to really defend, so I will happily not develop a specific research question. They're floating around everywhere!\n\nI might take up your offer for further questions another day. I am, however, not terribly close to the timing of admission specific questions. This is more of a general question of what options are available.",
          "author": "Realistic-Set-7937",
          "created": 1638828224,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hniciki": {
      "link": "/r/GradSchool/comments/ragrsl/economics_phd_question/hniciki/",
      "text": "Minor is fine. More important is the math prereqs. You should try googling \"economics phd\" and you'll get a LOT of resources.",
      "author": "bugeatingplant",
      "created": 1638825616,
      "upvotes": 2,
      "replies": {
        "hnikj4k": {
          "link": "/r/GradSchool/comments/ragrsl/economics_phd_question/hnikj4k/",
          "text": "I've found several resources, so thank you!",
          "author": "Realistic-Set-7937",
          "created": 1638828745,
          "upvotes": 1,
          "replies": {
            "hninlnr": {
              "link": "/r/GradSchool/comments/ragrsl/economics_phd_question/hninlnr/",
              "text": "Great! Check those out now, as they will help you figure out what to take etc.",
              "author": "bugeatingplant",
              "created": 1638829992,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hnirvfz": {
      "link": "/r/GradSchool/comments/ragrsl/economics_phd_question/hnirvfz/",
      "text": "It’s not uncommon for people to go from physics/engineering to economics. An Econ minor plus your math background should be fine. Economics is a big field so do what you can to figure out what kind of research you want to do. Econ blogs and podcasts are a great place to start",
      "author": "Unofficial_Overlord",
      "created": 1638831774,
      "upvotes": 2,
      "replies": {}
    },
    "hni9va9": {
      "link": "/r/GradSchool/comments/ragrsl/economics_phd_question/hni9va9/",
      "text": "I know several people who have a phd in a different field than their undergraduate degree. A friend springs to mind who is a historian on bachelor/master level, qualitative methodology, who did a phd in education which was basically 4 years of hard core statistics (sorry, I can't explain it in more detail).\nHistory and education are obviously not too far removed, but the methodology and theoretical framework were very different.\n\nI can't remember the other examples from the top of my head. But I know it's often the case. \n\nI understand that you would like to go straight from undergrad to phd? \nI don't know how all these systems work in other countries. But how about a masters in economics? I think there are master degrees that allow you in as long as you have a bachelor. Maybe social economics has more lax requirements in terms of academic background? Then dig deep into economics there, and continue on your economics PhD? \n\nI don't know if this helps. But you sound like a clever person, and with a good understanding of science, it makes sense that you would do well in economics (correct me if I'm wrong, economists). You will find a way :)",
      "author": "Naivemlyn",
      "created": 1638824585,
      "upvotes": 1,
      "replies": {
        "hnikb91": {
          "link": "/r/GradSchool/comments/ragrsl/economics_phd_question/hnikb91/",
          "text": "Thank you for the encouragement!\n\nI should have clarified that I'm in the US. Do to a wonderful relationship that seems to be working out with a wonderful gal, I am currently not planning on incurring much debt if I can avoid it. This means that a masters program is expensive for me. I come from a relatively poor (lower-middle) family background (which is amazing considering the sheer number of graduate degrees in my family), and I want to break that cycle. I didn't starve growing up, but my intellectual appetites were limited by the monetary restrictions. I want my kids to have an opportunity to go to summer camps and, possibly, private school (places like Thales give me hope). PhD programs are far more affordable, so that's my hope.\n\nKnowing that I can transition out is nice. I don't think I'll make a top PhD program, but I expect I can get in somewhere if I work hard enough.",
          "author": "Realistic-Set-7937",
          "created": 1638828657,
          "upvotes": 2,
          "replies": {
            "hnkbpo4": {
              "link": "/r/GradSchool/comments/ragrsl/economics_phd_question/hnkbpo4/",
              "text": "I understand!\nThat tertiary education isn't free is one of the most unfathomable features of the US from an outsider's perspective. (I'm in Europe.) It makes social mobility almost impossible. But you sound like you will make good choices. I wish you all the best of luck both with your education and the girl!!",
              "author": "Naivemlyn",
              "created": 1638858131,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}