{
  "sid": "rglepn",
  "link": "/r/GradSchool/comments/rglepn/update_and_a_thank_you_to_this_community/",
  "title:": "Update and a thank you to this community!",
  "text": "My first post on here was asking advice about what to do if my toxic former PI showed up to my defence. I got excellent advice and reassurance gram several of you, and appreciate it greatly—really put my mind at ease!\n\nAs a few of you noted, other faculty were TOTALLY aware of their behaviour and ready to shield me if need be. But former PI showed up and, instead of being petty, I think actually realised they were wrong that I was incapable. They asked a softball question and congratulated me. \n\nI ran into them a couple of weeks later at a conference and they were very friendly. Introduced me to some great contacts as a ‘very impressive’ researcher and later apologised for doubting me. Happy ending!",
  "author": "tarkaleancondor",
  "created": 1639527362,
  "updated": 1639788531,
  "over_18": false,
  "upvotes": 143,
  "upvote_ratio": 0.99,
  "comments": {
    "hol3eky": {
      "link": "/r/GradSchool/comments/rglepn/update_and_a_thank_you_to_this_community/hol3eky/",
      "text": "Nice to see that people can change. However, I would probably still be careful to trust this person in the future.",
      "author": "AdvanceImpressive158",
      "created": 1639530419,
      "upvotes": 49,
      "replies": {
        "holl8q8": {
          "link": "/r/GradSchool/comments/rglepn/update_and_a_thank_you_to_this_community/holl8q8/",
          "text": "Most definitely. Luckily, I shouldn’t need to work with them in the future!",
          "author": "tarkaleancondor",
          "created": 1639538532,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "hol4b0a": {
      "link": "/r/GradSchool/comments/rglepn/update_and_a_thank_you_to_this_community/hol4b0a/",
      "text": "That's so very satisfying! Thank you for posting the update, and congratulations on your defense!",
      "author": "Weaselpanties",
      "created": 1639530834,
      "upvotes": 17,
      "replies": {}
    },
    "hol2pg8": {
      "link": "/r/GradSchool/comments/rglepn/update_and_a_thank_you_to_this_community/hol2pg8/",
      "text": "[deleted]",
      "author": null,
      "created": 1639530104,
      "upvotes": 2,
      "replies": {
        "holm96c": {
          "link": "/r/GradSchool/comments/rglepn/update_and_a_thank_you_to_this_community/holm96c/",
          "text": "They tried to change/remove significant parts of my thesis because of their lack of confidence in my abilities—and tried to put me on various other unrelated projects, all the while putting me down. I left their lab and started working with another PI in the same department. Since that coincided with COVID and related restrictions, it was pretty painless as I didn’t have to be around them at all.",
          "author": "tarkaleancondor",
          "created": 1639539003,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  }
}