{
  "sid": "q4272x",
  "link": "/r/GradSchool/comments/q4272x/anyone_struggle_with_studying_and_working_abroad/",
  "title:": "Anyone struggle with studying and working abroad?",
  "text": "I moved to another country to do my master's and PhD. My SO and I have been discussing possibly even moving abroad to another country if a job in my field opens up abroad, and generally how we'd like to possibly live in another country one day.\n\nBut my mind is constantly plagued by the guilt of leaving my family behind. I know how much they miss me and with the pandemic I haven't traveled to see them for almost 2 years now because covid still isn't under control. It's already hard to talk to them much, and they never visited me in the 5 years I've been abroad, I always had to travel a couple times a year to see them (though sometimes they generously paid for it).\n\nI just can't help but constantly feel guilty about this. I was always really close with my family and I think my decision to move away from school really hurt them. It was something I wanted to do but I'm never completely happy about it and wonder if I made the right decision because of their reaction. My family seems to think I moved away because I don't want to be near them, but that isn't true. I just want to have new experiences and know what it's like to live in other places. I never left my hometown until this and basically never even traveled outside of the country. I want the freedom to live in another country if a good job opens there and if my SO and I agree to it. But I get these obsessive thoughts about so many things, like: what if a parent becomes sick or dies? What will happen to my sibling (one of them lives at home at them due to mental disabilities), shouldn't I be there to take care of them? Shouldn't I care for my parents in old age? My mom has been sick and I constantly worry I won't be there for her when she needs it. When I see pictures of them now I can see them getting slightly older and it breaks my heart. I feel like I'm missing out on events and other things they are part of that I'm not because they live far from me. But it also just doesn't feel like they make an effort to be more involved in my life either.\n\nDoes anyone struggle with this? How do you balance this guilt and doing what's best for you?",
  "author": "Haunting0fMilhouse",
  "created": 1633713247,
  "updated": 1634099815,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.87,
  "comments": {
    "hfvwcz9": {
      "link": "/r/GradSchool/comments/q4272x/anyone_struggle_with_studying_and_working_abroad/hfvwcz9/",
      "text": "I started my master's abroad this year (though I lived here for two years before that) and it can be difficult, especially with covid. I didn't see my family in person for a really long time when covid hit and I missed a lot of things both then and more recently -- surgeries, a wedding, a family reunion. I'm lucky to have parents that are really supportive because they've spent time abroad and understand why I moved and why I want to stay abroad. They've also been able to see how much I've grown into myself during the time I've already been abroad -- which really helps them to deal with it better, as they've admitted it's hard on them. The fomo for me has not been easy (as an only child with a small amount of family I would see on a regular basis at home, it’s mostly friend fomo for me at this point, but the principle still stands), but remember that it’s physically impossible to be there for everything and also have all the experiences you want to have. There will always be something that falls by the wayside and that doesn’t mean it doesn’t matter to you, it’s just that you’re prioritizing something else. It makes it easier with time, though it may not go away.\n\nPer your worries about if something happens, one thing that really helped was having the conversation with my mom about what would happen if something big *did* happen -- what would be expected of me, what plans were in place to deal with any eventualities. I have older parents, so the question of \"what happens if something happens to either of them\" is a real one we had to talk through. I can't say that anything will magically make your family understand, but all you can do is remind them that you care about them and show them that this experience is good for you on a personal level. You can’t make them be more involved. You can only affect your own actions and reactions, like reaching out to them as much as you feel you can.",
      "author": "starryeyesmaia",
      "created": 1633718590,
      "upvotes": 7,
      "replies": {
        "hfx9so0": {
          "link": "/r/GradSchool/comments/q4272x/anyone_struggle_with_studying_and_working_abroad/hfx9so0/",
          "text": "Thanks for sharing. I do think it's been easier with time, but also harder with the pandemic. I just feel like I am out of touch with them and we are drifting apart when we used to be close and I want us to keep being close. I guess I just want to be able to do everything I want to do in life. I want to travel and live in different places while also at the same time just staying at home with my family. But it's hard to do both. I guess I am just trying to grapple with my decisions and accept that I can't do everything.",
          "author": "Haunting0fMilhouse",
          "created": 1633740336,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfvqh8k": {
      "link": "/r/GradSchool/comments/q4272x/anyone_struggle_with_studying_and_working_abroad/hfvqh8k/",
      "text": "This was incredibly challenging for me and ultimately I moved back to my home city to finish my PhD. I think we really don't talk enough about how life changes during the years we are in a PhD (our 20s), and by the end of it, I am married and looking to live closer to home. My parents are aging, my mom is also sick, and I knew I needed to settle down. \n\nI am grateful that I went to a well-known school in the US, so it has not been that hard to transition. However, doing a PhD is an isolating process and this is amplified by being far away from most of your support networks. Moving back was the best thing for me, and  I'm so glad I was able.",
      "author": "namenamename0",
      "created": 1633716063,
      "upvotes": 3,
      "replies": {
        "hfvrdql": {
          "link": "/r/GradSchool/comments/q4272x/anyone_struggle_with_studying_and_working_abroad/hfvrdql/",
          "text": "I guess my concern is that I don't actually want to live there. I wish I could be close to them but somewhere else, if that makes sense. And there are basically 0 jobs in my field in my home country, and immigrating there with my SO would be very difficult (they aren't a citizen of my home country). So these factors do make it difficult for me to move back, and if it weren't for my family I wouldn't even really think about it because there are tons of other places I'd rather live. I'm not actually THAT far from them right now despite being in another country but with covid just one border makes everything so difficult now that wasn't previously. I'm trying to think about my future and what would make me happy and it's conflicting I guess.\n\nI'm glad to hear you were able to do what is best for you!",
          "author": "Haunting0fMilhouse",
          "created": 1633716447,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfx95lb": {
      "link": "/r/GradSchool/comments/q4272x/anyone_struggle_with_studying_and_working_abroad/hfx95lb/",
      "text": "No, I love it but YMMV. Learning a different culture is an amazing experience in of itself and almost everyone I run into has a sense of respect towards me for being this guy who moved halfway across the planet at 17 and still landed on his two feet. I always tell them it's not that hard in this day and age with planes and fast internet and what not but everyone instantly thinks it's super cool. It makes it so much easy for you to become an extrovert and good at networking. \n\nI understand what you mean when you it feels like you are abandoning your family. It's kinda easier for me because I have three siblings and my parents are never too lonely and not everyone has this advantage.",
      "author": "Tangent_runner",
      "created": 1633740031,
      "upvotes": 4,
      "replies": {
        "hfxa3no": {
          "link": "/r/GradSchool/comments/q4272x/anyone_struggle_with_studying_and_working_abroad/hfxa3no/",
          "text": "I do think moving to another country for my PhD really did help me grow up. I'm not an extrovert by any means but I never left my house let alone hometown before doing this. I think it's a good learning experience and helps me grow. but I still feel like I'm doing something wrong because my parents didn't expect me to do this. I do have 2 siblings at least.. it does help to know they aren't completely alone",
          "author": "Haunting0fMilhouse",
          "created": 1633740480,
          "upvotes": 3,
          "replies": {
            "hfxb3cj": {
              "link": "/r/GradSchool/comments/q4272x/anyone_struggle_with_studying_and_working_abroad/hfxb3cj/",
              "text": "Ahh, I can't help you there. My parents were always super hands off and even encouraged me to aim far and wide. They are pretty fine with daily video calls and an in-person visit every now and then. Do you like video chat everyday or is that difficult due to a time difference?",
              "author": "Tangent_runner",
              "created": 1633740960,
              "upvotes": 3,
              "replies": {
                "hfxduy4": {
                  "link": "/r/GradSchool/comments/q4272x/anyone_struggle_with_studying_and_working_abroad/hfxduy4/",
                  "text": "Part of my problem is it's so hard to communicate with them. I've tried to ask to video chat countless times and they will say sure that sounds fine but then will never do it, say they have trouble setting it up, etc. For a while it would take days for them to get back to me with texts. Sometimes they will let me know important things, like someone is in the hospital, many hours later. it's frustrating how difficult it is to talk to them, so if I were just around to see them it wouldn't be a problem. No time difference though.",
                  "author": "Haunting0fMilhouse",
                  "created": 1633742306,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}