{
  "sid": "rdj84e",
  "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/",
  "title:": "Bonuses/appreciation gifts?",
  "text": "Have any PhD students received bonuses or even appreciation gifts from their institution? Asking because my university’s medical center just sent an email announcing a second $1000 “gratitude bonus” for employees that grad students are once again ineligible to receive. This came just days after they finally got back to a fellow student in my program who had reached out inquiring why we weren’t eligible, stating that they “see us as students first” and building an excuse around that. I get that the main reason for the bonuses is to help with employee retention, especially those employees involved in patient care, but even nonclinical employees (including research faculty and staff) are eligible for the bonuses.\n\nWe’re obviously pissed about this, especially given how many grad students helped with prepping kits for the university’s independent COVID testing facility or even volunteered to help process tests.  Someone in my program said Michigan gave their grad students a $1500 bonus, so I was wondering if any other institutions have given their grad students bonuses or even appreciation gifts?",
  "author": "jlas037",
  "created": 1639171929,
  "updated": 1639518511,
  "over_18": false,
  "upvotes": 33,
  "upvote_ratio": 0.95,
  "comments": {
    "ho2ca8j": {
      "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho2ca8j/",
      "text": "We are always students when it benefits employees but employees when it benefits students.",
      "author": "spacefurl",
      "created": 1639186463,
      "upvotes": 31,
      "replies": {
        "ho2jhxk": {
          "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho2jhxk/",
          "text": "At least now we have it in writing that they consider us students for the next time they try to screw us over by claiming we’re employees",
          "author": "jlas037",
          "created": 1639189740,
          "upvotes": 12,
          "replies": {
            "ho34dak": {
              "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho34dak/",
              "text": "\"We consider graduate students to have a unique relationship with the institution as both and in this situation, students are primarily acting in their role as employees....\" \n\nthere is no internal consistency 🙃",
              "author": "mediocre-spice",
              "created": 1639200087,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "ho32pt5": {
      "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho32pt5/",
      "text": "form a union :)",
      "author": "isaac-get-the-golem",
      "created": 1639199170,
      "upvotes": 8,
      "replies": {}
    },
    "ho312e0": {
      "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho312e0/",
      "text": "At my university, I wanted to be able to try to save even a meager amount in a retirement account. That was only available to students. I also was never considered an in-state student at my public university because I started <9 months after moving to the state. Even though I was in grad school for 7 years, bought a house, got married, had 2 kids in the state. \n\nI never heard of students getting bonuses. They fought us on $0.50/hr raises. And they punished people for taking 2nd jobs outside the university to make ends meet.",
      "author": "thrombolytic",
      "created": 1639198273,
      "upvotes": 5,
      "replies": {}
    },
    "ho3kwiw": {
      "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho3kwiw/",
      "text": "We get a 13th month in december, our holiday bonus in may (a bit over 1000 euro each), bicycle/public transport compensation, 200 euro in \"eco cheques\" to spend on sustainable stuff, 50 euro a month working from home compensation, annual staff parties and outings, a women's day gift, and a christmas gift. But PhDs in my country (Belgium) are both employees and students.\n\nand we got free masks and rapid tests :P",
      "author": "doornroosje",
      "created": 1639211286,
      "upvotes": 6,
      "replies": {
        "ho735jf": {
          "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho735jf/",
          "text": "We’re technically employees and students too, they just like to flip flop between which role applies to us based on what’s cheapest/easiest for them",
          "author": "jlas037",
          "created": 1639275141,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho29s5d": {
      "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho29s5d/",
      "text": "i wish. lurking for pure curiosity cuz i am feeling particularly underappreciated and undervalued by my university.",
      "author": "sspumpkaboo",
      "created": 1639185341,
      "upvotes": 13,
      "replies": {
        "ho2dvf5": {
          "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho2dvf5/",
          "text": "English departments will do that to you.",
          "author": "Dawalkingdude",
          "created": 1639187180,
          "upvotes": 6,
          "replies": {
            "ho2e9os": {
              "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho2e9os/",
              "text": "yeah... although my major bone to pick is with the university higher ups and not my department.",
              "author": "sspumpkaboo",
              "created": 1639187356,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "ho45koi": {
      "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho45koi/",
      "text": "In the weirdest coincidence, my girlfriend (who goes to Michigan) comes into the living room and goes \"huh, the university just made a deposit into my account that's not my paycheck\" AS I'M READING THIS POST. \n\nSo I can confirm that rumor. But also pissed my university isn't giving me anything.",
      "author": "NotMichaelBolton",
      "created": 1639226719,
      "upvotes": 5,
      "replies": {}
    },
    "ho2vtbj": {
      "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho2vtbj/",
      "text": "This semester is the second (if not third) I have gotten from my uni. 500, prorated if youre not FTE",
      "author": "mrt1416",
      "created": 1639195568,
      "upvotes": 3,
      "replies": {}
    },
    "ho3421z": {
      "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho3421z/",
      "text": "lol nope\n\nWe do get COL adjustments and got some covid money",
      "author": "mediocre-spice",
      "created": 1639199914,
      "upvotes": 3,
      "replies": {}
    },
    "ho3c80v": {
      "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho3c80v/",
      "text": "not about bonuses but on what status we are: at my uni we have a mental health service that takes care of the students and another one for the employees. If a PhD student needed help, both used to say to go to the other one. (Happily enough, there was a big outcry about that a few months ago and now one of them takes us. Not sure which one, though)",
      "author": "dirac37",
      "created": 1639204877,
      "upvotes": 3,
      "replies": {}
    },
    "ho4r9wg": {
      "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho4r9wg/",
      "text": "I’ve never heard of it but I’ve been at my uni for 2 years and have never gotten a bonus lmao",
      "author": "fueledbykass1",
      "created": 1639237836,
      "upvotes": 1,
      "replies": {}
    },
    "ho3lg3c": {
      "link": "/r/GradSchool/comments/rdj84e/bonusesappreciation_gifts/ho3lg3c/",
      "text": "i would declare a jihad against your administration",
      "author": "HLA-AIRE-VIT1",
      "created": 1639211699,
      "upvotes": -1,
      "replies": {}
    }
  }
}