{
  "sid": "q90rc9",
  "link": "/r/GradSchool/comments/q90rc9/kind_of_dislike_my_office/",
  "title:": "Kind of dislike my office...",
  "text": "I'm a PhD student going into my second year and I recently made a return to the office for the first time. \n\nThere are 12 other PhD students in the office and amongst themselves 8 were invited to another office mate's flat for a \"PhD dinner party\". I (alongside 4 others) was ignored and not invited despite spending time trying to socialise with them and introduce myself for the last couple of weeks.\n\nThis is Why I don't miss working from home, stupid office politics. It sucks because I thought we were all getting in and this happened. For starters they thought my desk was abandoned becuase the university forgot to assign one to me. This means I didn't even have a chair and don't even have an office workstation to use on campus...\n\nI missed a 2 week period of being on campus because of this delay and I think this kind of set me back socially.\n\nThey were planning it openly right in front of us and didn't even think to ask if we'd like to join them or make up for it if slave was an issue ...\n\nSorry just needed to vent...",
  "author": "Weekend_metalhead",
  "created": 1634342855,
  "updated": 1634424336,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.87,
  "comments": {
    "hgsyrhz": {
      "link": "/r/GradSchool/comments/q90rc9/kind_of_dislike_my_office/hgsyrhz/",
      "text": "This seems to be the case in a lot of programs. Wonder if you and the other 4 people could go out and hang out on your own? Or maybe making friends outside your department?  I know it sucks to have them act like jerks, but ignoring them might be the best route?\n\nOne of the best pieces of advice my advisor has given me is to make friends who have intellectual and social interests outside of my department… makes things easier when they’re not always connected to crappy work/office drama.",
      "author": "astute_canary",
      "created": 1634343238,
      "upvotes": 10,
      "replies": {
        "hgszgel": {
          "link": "/r/GradSchool/comments/q90rc9/kind_of_dislike_my_office/hgszgel/",
          "text": "Yeah, socialising outside my department is probably going to be difficult but a better bet...",
          "author": "Weekend_metalhead",
          "created": 1634343596,
          "upvotes": 3,
          "replies": {
            "hgtit67": {
              "link": "/r/GradSchool/comments/q90rc9/kind_of_dislike_my_office/hgtit67/",
              "text": "Sorry it’s been a rough time! You’ll find your group, I’m sure of it!",
              "author": "astute_canary",
              "created": 1634354096,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hgsyf3t": {
      "link": "/r/GradSchool/comments/q90rc9/kind_of_dislike_my_office/hgsyf3t/",
      "text": "I hope you took the others and had your own dinner party.",
      "author": "Accurate-One-7037",
      "created": 1634343059,
      "upvotes": 6,
      "replies": {}
    },
    "hgtiy60": {
      "link": "/r/GradSchool/comments/q90rc9/kind_of_dislike_my_office/hgtiy60/",
      "text": " Did those PhD students already know each other? Cause then it sounds just it was just a dinner amongst friends.\n\nWhat's the limit on people gathering due to Corona? Maybe that's why?",
      "author": "doornroosje",
      "created": 1634354177,
      "upvotes": 3,
      "replies": {}
    },
    "hgsy9o0": {
      "link": "/r/GradSchool/comments/q90rc9/kind_of_dislike_my_office/hgsy9o0/",
      "text": "Can you talk to your supervisor and work out a situation where you work mostly remotely or partially remotely?",
      "author": "redditknees",
      "created": 1634342981,
      "upvotes": 2,
      "replies": {
        "hgszt6p": {
          "link": "/r/GradSchool/comments/q90rc9/kind_of_dislike_my_office/hgszt6p/",
          "text": "Yes. I plan to scale back my in campus work and only work there on days I have meetings.\n\nI'm going on 24 and just don't need petty office politics when I'm trying to get my PhD and life together...",
          "author": "Weekend_metalhead",
          "created": 1634343778,
          "upvotes": 4,
          "replies": {
            "hgtux36": {
              "link": "/r/GradSchool/comments/q90rc9/kind_of_dislike_my_office/hgtux36/",
              "text": "Recognizing that it depends entirely on what you PhD is, but holy hell am I ever glad I can do everything from home.",
              "author": "redditknees",
              "created": 1634361787,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}