{
  "sid": "q7o5w3",
  "link": "/r/GradSchool/comments/q7o5w3/my_qualifier_is_coming_up_monday_i_havent_been/",
  "title:": "My qualifier is coming up Monday. I haven't been paid in 2 months. I hate everything.",
  "text": "Title. \n\nOh and also not to mention, dealing with car repairs, vet bills for my cat's surgery, and being behind on my meds because of pharmaceutical red tape? I'm ready to be done with grad school.",
  "author": "tackykcat",
  "created": 1634170423,
  "updated": 1634603930,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.87,
  "comments": {
    "hgmbnxf": {
      "link": "/r/GradSchool/comments/q7o5w3/my_qualifier_is_coming_up_monday_i_havent_been/hgmbnxf/",
      "text": "I'm so sorry to hear this. Do you know why you aren't being paid? Are your advisor and department head aware and involved? Not being paid for your work is, frankly, illegal and should be rectified immediately. Just because you also go to school there doesn't make your employer illegally withholding paychecks any less illegal.",
      "author": "hiagha",
      "created": 1634224440,
      "upvotes": 3,
      "replies": {
        "hgn1p5x": {
          "link": "/r/GradSchool/comments/q7o5w3/my_qualifier_is_coming_up_monday_i_havent_been/hgn1p5x/",
          "text": "Admittedly, with everything that was going on, I didn't notice the missed paychecks until last month. Then I reached out to my graduate coordinator immediately and checked up every week since. They submitted paperwork for the missed checks, which was taking a very long time with the HR and payroll offices for some undisclosed reason. I sent another angry email this week, cc'ing multiple department admins and several offices, and finally it seems the first tier of paperwork went through. In retrospect, I probably should have just started with that last angry email. It's just so frustrating that I have to fight so hard for money I'm owed, that I brought in from an external fellowship I won.",
          "author": "tackykcat",
          "created": 1634235166,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgo9t9b": {
      "link": "/r/GradSchool/comments/q7o5w3/my_qualifier_is_coming_up_monday_i_havent_been/hgo9t9b/",
      "text": "That all sucks. I can relate, within the same month during the spring I had two large unexpected auto repairs totalling like 1.5k, my dog got sick, and then I was told that (because I've progressed through my program more quickly than required) I would lose my fellowship funding come fall. \n\nWhen it rains it pours. You'll get through it. Focus on your immediate goals - quals - then go from there. If I think about too many things at once I end up doing them all poorly. \n\nGood luck Monday!",
      "author": "Pr0gr3s",
      "created": 1634255053,
      "upvotes": 2,
      "replies": {
        "hgpn6fq": {
          "link": "/r/GradSchool/comments/q7o5w3/my_qualifier_is_coming_up_monday_i_havent_been/hgpn6fq/",
          "text": "Thanks, I hope you pull through as well! That's a nice/true saying. I have suffered worse than this before, it's just the stakes feel higher because of the qual. Honestly, I'm kind of excited for it (thinking about science is definitely more fun than thinking about debt)!",
          "author": "tackykcat",
          "created": 1634281592,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgqg5j4": {
      "link": "/r/GradSchool/comments/q7o5w3/my_qualifier_is_coming_up_monday_i_havent_been/hgqg5j4/",
      "text": "Something similar happened at my old institution. I had to raise a stink with the dept. chair to get paid and ofc it was the stupid payroll dept that was delaying it, but it got done soon after I complained. Another student had this happen and said they would go to the dept of labor if there was another missed check and they rushed the paperwork through. If you're unionized talk to your representative.",
      "author": "mathdude00",
      "created": 1634303296,
      "upvotes": 2,
      "replies": {}
    }
  }
}