{
  "sid": "rgoewe",
  "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/",
  "title:": "Summer before grad school advice?",
  "text": "I just got an offer to do a research internship for the summer. It’s 10 weeks and if I start shortly after the semester, I’d have a full month off at the end of summer. But I’m contemplating whether to do it or just relax the entire summer. Can anyone share what they did the summer before grad school & advice on making a decision?",
  "author": "hermy448",
  "created": 1639536209,
  "updated": 1639788543,
  "over_18": false,
  "upvotes": 28,
  "upvote_ratio": 0.91,
  "comments": {
    "holt4n2": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/holt4n2/",
      "text": "I did some research before school started in the same institution that I’m attending and honestly it gave me a leg up. Albeit my research wasn’t intense (~10 hrs a week), I got to practice concepts I’m learning in class way ahead of others. Not to mention, the extra cash is never bad.",
      "author": "MotvStr",
      "created": 1639542412,
      "upvotes": 18,
      "replies": {
        "holw7iq": {
          "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/holw7iq/",
          "text": "Did u have enough to live on when u only worked for ten hours a week though? Just wondering how the financial situation worked out :)",
          "author": "hermy448",
          "created": 1639544087,
          "upvotes": 4,
          "replies": {
            "holwhjf": {
              "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/holwhjf/",
              "text": "I commute from home so that helped! But you could also do a little research and some other jobs that require less mental stress if you’re in need of more income. I know a lot of grad students do waitressing on weekends",
              "author": "MotvStr",
              "created": 1639544240,
              "upvotes": 3,
              "replies": {}
            },
            "hopphfb": {
              "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hopphfb/",
              "text": "I was in a similar situation to u/MotvStr but not living at home so I also worked as a host in a restaurant at night. I enjoyed staying immersed in science and having an extra line on my CV.",
              "author": "MercuriousPhantasm",
              "created": 1639612872,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "holgo67": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/holgo67/",
      "text": "Relax. You already got in.",
      "author": "Apprehensive_Golf_52",
      "created": 1639536428,
      "upvotes": 38,
      "replies": {}
    },
    "holjctx": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/holjctx/",
      "text": "My only goal my summer before my PhD was to “get a good tan” (save me with any skin care lectures). I took a vacation. I hung out by the pool and mentally prepared myself for the out of state move. I moved a month before the semester started. I burned out in my third year. Got back on track in my 4th. Won a fellowship  my 5th. That was 2020. Blew that. Got a 6th year funded. And almost quit last month. \n\nDo whatever you want to do. You’re gonna burn out. It’s designed to burn you out. \n\nI’m inclined to say take the 10 weeks with the break and REALLY TAKE A BREAK. You’ll have a good footing in the program and you’ll remember how to rest. That will all be important.",
      "author": "ResponsibilityOk617",
      "created": 1639537651,
      "upvotes": 35,
      "replies": {
        "honi5pr": {
          "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/honi5pr/",
          "text": "Yup! Take a break, I tried preparing the summer before to get a headstart and regretted it.",
          "author": "ParmesanPepper",
          "created": 1639581497,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hom66la": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hom66la/",
      "text": "Just finished my first semester of PhD and I kinda did what you plan on doing - I worked for 2 months and then took one month chill. I don’t entirely regret working since I’d have no money otherwise, but I also felt much less motivated than usual while working and did not feel that I got as much rest as I wanted that I was refreshed to begin a new journey when I started my PhD. Thankfully I survived (up this this point lol), but I’d highly advise just taking the entire summer off if you don’t need to work (I.e for money)",
      "author": "kinesinia",
      "created": 1639550072,
      "upvotes": 6,
      "replies": {}
    },
    "homgz7e": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/homgz7e/",
      "text": "I was glad to have a research job before I started my PhD. One, I needed the money and the pay was better than my job at the time, and two,  it helped me ease into my studies. I'm in humanities so my field is very theoretical and after a few years off, I felt very out of touch with academia. \n\nBut if you're feeling that you want to just take the summer off, then follow your gut.",
      "author": "frankie_prince164",
      "created": 1639558297,
      "upvotes": 4,
      "replies": {}
    },
    "holi9e7": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/holi9e7/",
      "text": "Definitely take the summer to relax if you can. I didn’t, and I regretted it. I burned out so much faster than everybody else in my cohort my first semester.",
      "author": "hermit_the_fraud",
      "created": 1639537145,
      "upvotes": 9,
      "replies": {
        "holw4y5": {
          "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/holw4y5/",
          "text": "What did u do during the summer?",
          "author": "hermy448",
          "created": 1639544047,
          "upvotes": 2,
          "replies": {
            "holwvy7": {
              "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/holwvy7/",
              "text": "I worked my day job until mid July, spent two weeks packing/moving long distance/unpacking, and then started classes ten days after I moved. Do not recommend.",
              "author": "hermit_the_fraud",
              "created": 1639544459,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "homynxr": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/homynxr/",
      "text": "I worked at my university the summer before I started and it made me realize I wasn't interested in the kind of research that I thought I was, it saved me a lot of time and effort and kept me from committing to a group that I may not have been successful in.",
      "author": "loosehead1",
      "created": 1639571943,
      "upvotes": 3,
      "replies": {}
    },
    "honens8": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/honens8/",
      "text": "Are you doing MS or PhD? Honestly, I finished up a research associate position the summer before I started grad school and I genuinely wish I had just taken that summer off to decompress, hang out with my friends before everyone moved away, and just enjoyed life a bit more. \n\nGrad school is very demanding and I think I could've avoided some problems if I had taken more care and granted myself some time off!",
      "author": "Arbiter1728",
      "created": 1639579994,
      "upvotes": 3,
      "replies": {
        "honq03b": {
          "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/honq03b/",
          "text": "PhD",
          "author": "hermy448",
          "created": 1639584592,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "honewa7": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/honewa7/",
      "text": "i did a field work job that was a great opportunity. not only did I get more experience and have a blast, but they ended up offering me the project as my thesis. if you’ll have a month off at the end anyways, i say take the job. you’ll still have a month off and you’ll (hopefully) enjoy the experience",
      "author": "kingratandmushrooms",
      "created": 1639580097,
      "upvotes": 3,
      "replies": {}
    },
    "homy071": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/homy071/",
      "text": "Relax, start building good habits like working out and healthy cooking if you don't already. These habits will serve you better than whatever theoretical bullshit you manage to cram in your skull.",
      "author": "fishnoguns",
      "created": 1639571545,
      "upvotes": 5,
      "replies": {}
    },
    "hom1o28": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hom1o28/",
      "text": "Enjoy your last summer of freedom",
      "author": "FunctionalSpinalUnit",
      "created": 1639547196,
      "upvotes": 4,
      "replies": {}
    },
    "homwks3": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/homwks3/",
      "text": "Take the summer to relax. Do nothing if possible. Sounds odd but you will really be more excited about your work/less burnt out when you start.",
      "author": "SuspiciousWhiskers",
      "created": 1639570660,
      "upvotes": 2,
      "replies": {}
    },
    "hona94d": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hona94d/",
      "text": "I spent the summer before grad school interning in Austin, TX (I’m from NY) and the only draw was to be essentially on working vacation for 3 months. I worked my 8 hours and had nights and weekends to explore somewhere different, and the pace of work was quite slow. I also get bored easily, all my family lives local to me, etc so I would’ve been pretty much at home the entire summer had I not worked. \n\nIt really depends on what your undergrad schedule looked like, where the research internship is, and what kind of expectations there’d be on it.",
      "author": "happytransformer",
      "created": 1639578014,
      "upvotes": 2,
      "replies": {
        "hoob0e0": {
          "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hoob0e0/",
          "text": "Yeah, I find that I still have weekends & evenings completely off so that’s why working is appealing 😢",
          "author": "hermy448",
          "created": 1639592772,
          "upvotes": 2,
          "replies": {
            "hoojc8n": {
              "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hoojc8n/",
              "text": "It depends. Are you moving across the country/internationally for grad school? Are your friends moving far away after graduation? Then I’d say stay home and spend time with your friends and family. I’ve found a lot of grad students can’t afford to either take off a ton of time to go home during breaks or financially can’t pull it. When it takes 10+ hours to get home or a flight costs a couple hundred dollars, it’s tough to come home unless it’s for a few weeks. It’d also give you time to arrive to campus early to acclimate if you know it’ll be a big adjustment or culture shock, like if it’s your first time living away from home. \n\nI moved back in with my parents for my PhD and commute about 30 min to school, so I couldn’t have cared less about spending the summer between undergrad and my PhD at home lol. I am planning on taking off a few months between defending and starting full time work to travel, move, and decompress.",
              "author": "happytransformer",
              "created": 1639595981,
              "upvotes": 2,
              "replies": {
                "hor0e25": {
                  "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hor0e25/",
                  "text": "Either moving across the country or moving a driving distance away from my family- depends on where I get into! I don’t really have any close friends back home 😅 But I really should spend more time with my family, regardless!",
                  "author": "hermy448",
                  "created": 1639635615,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "honasma": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/honasma/",
      "text": "I ended up going straight from undergrad to grad school, so got two-ish weeks of a break in-between, which didn't feel like quite enough. Was also doing some work for my supervisor during that time, so maybe that's why it didn't feel like a good break. I'd say the summer of research would be a good chance to work on your research skills and get into that kind of a mindset for grad school. Unless it already sounds like it will not be fun or be too stressful for some reason. A month off sounds decent at least! Although, if you're really burned out then go with your gut and take the summer off.",
      "author": "Thefanciestnoodle",
      "created": 1639578262,
      "upvotes": 2,
      "replies": {
        "hoob63r": {
          "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hoob63r/",
          "text": "The project options are really in line with my area of research and super exciting/fun! Not too stressful too. Ahhhhhhhhhhhhhhh",
          "author": "hermy448",
          "created": 1639592834,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "honhu3i": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/honhu3i/",
      "text": "Grad school for me started in the summer. :/",
      "author": "cattleprodlynn",
      "created": 1639581360,
      "upvotes": 2,
      "replies": {}
    },
    "honrpr2": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/honrpr2/",
      "text": "It is good to take a break because the workload is excruciating and the depth of topics you will learn is even more taxing mentally. Professional experience will always give you a leg up in grad school, and usually help you understand how to apply concepts you learn in the real world and quickly asses potential gaps in academia and industry application. I am personally pretty ambitious so I wouldn’t decline the opportunity if I could still take a week or two off before the semester starts. After a year and a half in grad school, I have realized that a better strategy is to figure out how to have work life balance or learn how to take breaks during the semester rather than waiting for breaks. This makes you more productive and allows you to deal with stress better rather than planning for a long break which might or might not be possible based on ad hoc deadlines or workload.",
      "author": "scorp-rising",
      "created": 1639585271,
      "upvotes": 2,
      "replies": {}
    },
    "hooch22": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hooch22/",
      "text": "I finished my masters. To be exact, I submitted my last draft of my thesis (no defense) the day after I started my PhD. \n\nI regret it, I never recovered, I am so burned out and I wish I had taken the summer off.\n\nSo my advice: take your summer off.",
      "author": "Selfconscioustheater",
      "created": 1639593340,
      "upvotes": 2,
      "replies": {}
    },
    "hopbab8": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hopbab8/",
      "text": "i quit my job the summer before i started grad school and i am so glad i did. fortunately i was in a financial position to do this and it gave me so much more freedom to see some family, go for a trip with my girlfriend, relax, explore and find some new hobbies (which has been super helpful  since starting grad school to de-stress). i definitely think you should! enjoy a nice break before your workload picks up",
      "author": "mushr00mcup",
      "created": 1639606820,
      "upvotes": 2,
      "replies": {}
    },
    "hoq55xt": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hoq55xt/",
      "text": "Honestly, just relax. This is the only time I will advise someone to drop a summer opportunity like this because you really will need those months to yourself doing fun things before going to grad school.",
      "author": "KoreanBigShaq",
      "created": 1639619977,
      "upvotes": 1,
      "replies": {}
    },
    "homarhu": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/homarhu/",
      "text": "Live it up (i.e., say yes to everything).",
      "author": "ForeverRising-",
      "created": 1639553340,
      "upvotes": 1,
      "replies": {}
    },
    "honv98q": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/honv98q/",
      "text": "I fully relaxed the summer before starting grad school. My program required an internship in the summer after the first year. So I decided to just chill for once (I had been either working or studying since I was 18 and graduated with my bachelor's at 29). I did lots of hiking, visited a bunch of towns, visited a friend living outside the country, took my dog on trips.\n\nI never planned on staying in academia. So I didn't think I needed the leg up on research and it worked out for me.",
      "author": "Advanced_Meal",
      "created": 1639586674,
      "upvotes": 1,
      "replies": {
        "hooat33": {
          "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hooat33/",
          "text": "Sad cuz I can’t go anywhere due to covid :(",
          "author": "hermy448",
          "created": 1639592692,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoo3ai3": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hoo3ai3/",
      "text": "Take a break. Chill out",
      "author": "SnooTomatoes1513",
      "created": 1639589795,
      "upvotes": 0,
      "replies": {}
    },
    "hoo6nij": {
      "link": "/r/GradSchool/comments/rgoewe/summer_before_grad_school_advice/hoo6nij/",
      "text": "This is your last summer of relative freedom. Don’t give it up! My colleagues whose chose to work this past summer burned out shortly after their first semester of grad school started. Yes, it can give you a leg up, but realistically you won’t be working on anything related to your thesis until at least partway through your first year. Don’t give this summer up; just relax, enjoy life, and recharge for the road ahead.",
      "author": "chem_swimguy",
      "created": 1639591077,
      "upvotes": 0,
      "replies": {}
    }
  }
}