{
  "sid": "pyjggk",
  "link": "/r/GradSchool/comments/pyjggk/10000_for_a_course/",
  "title:": "$10,000 for a course?!",
  "text": " My mom just paid off her $30,000 graduate session fees for 2020 - 2021. We knew the tuition for her graduate program was about $28,000 since we're international students, and so we planned accordingly. Unfortunately, after covid hit, the loan company that was supposed to take care of it kinda bailed without warning. We just got an email saying they won't be dealing with it yet because of covid. They stopped accepting calls or responding to emails either. That was around July last year, I believe. Her program started in Sept 2020 and was supposed to end this July. We finally were successful in getting the loan about a week ago (after monthsss of dragging this with them), and she has to pay them back about $58,000, which we all agreed to do together as a family if it came down to that.\n\nShe was failed one of the courses she took in Sept. She didn't sleep or eat for days and cried thinking about it, and I thought she should have appealed it then because she honestly believed she shouldn't have failed at all. She had done well in her other courses. She decided to retake the course instead this semester (Fall 2021) not by choice, but the course is only given once a year. We finally paid off the $30,000 for the school year she owed yesterday, and just after, she was registered for the course she had to re-take (she would have finished in July if not for this course) only to see the new balance was now $10,000 after the course registration! We couldn't believe it! Since she had taken about 3 - 4 courses for the past 3 semesters, we assumed the price for a course was about $3 - 4k. We had no reason to ask the price for a course because we never expected this plus because the loan company hadn't gotten back to us for almost a year. We did though, and we were told by student services that it should cost about $3 - 4k but to still ask student billing (I honestly don't remember if we did or not, and what happened after because we were all stressing about the $30,000 and the threats to take the account to collections and having to wait till 2022 fall again, and what not). We asked student services again yesterday and they said, 'oh, it must be charged by the term then'.\n\nWhen she saw the $10,000, she just broke down in tears. She hasn't eaten, slept or said a word since then. My mom, I and my sibling are all international students. I know some people may comment 'why not just go back home?' but it's not that easy/convenient since we've been here for a few years working hard for this, and this is, of course, her last semester. None of these issues were expected at all. I honestly don't know what to do because I know for a fact that we can't afford another $10,000 with the hefty debt we have to pay, not including our own school fees, rent, utilities and whatnot. I stopped working due to covid, and so she covered most of our bills for over a year. She spent months not sleeping, crying, depressed, worrying and looking for other ways to pay the $30,000 until we got an email from the loan company saying they will be paying it soon. I for one, couldn't sleep or comfortably exist knowing she was going through all that. We really can't go through this again.\n\nAs much as I'd like advice, sometimes some of them just make us feel worse or downplay our hard work by telling us to 'go back home' which is totally unfair since the commenters know nothing about what we've gone through to get here. I just felt like ranting and telling someone.",
  "author": "alloverated",
  "created": 1633007423,
  "updated": 1634100274,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.86,
  "comments": {
    "heuomr3": {
      "link": "/r/GradSchool/comments/pyjggk/10000_for_a_course/heuomr3/",
      "text": "This all sucks.\n\nJust a note for the cost… some universities have a flat rate after a certain number of credits, which is why you wouldn’t be able to just divide previous course number and bill.\n\nAlso, some programs have flat costs per semester on top of costs for courses.  I had looked at learning some courses in 3D rendering, but to take the course you had to declare VTD as a major, and if you were a VTD major you had to pay a few thousand dollars in fees for all of the software packages licensed in the program.  Engineering had a similar arrangement for the CAD packages from what I understood.\n\nBut, the finance office should NOT have been just guessing when they talked with you.   That is absolutely horrendous.",
      "author": "xienwolf",
      "created": 1633010961,
      "upvotes": 11,
      "replies": {
        "heuv81k": {
          "link": "/r/GradSchool/comments/pyjggk/10000_for_a_course/heuv81k/",
          "text": "Thanks so much for responding!\n\nIt does :/ It’s super unfortunate but I hope we can get this sorted soon :)",
          "author": "alloverated",
          "created": 1633013785,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hevixoi": {
      "link": "/r/GradSchool/comments/pyjggk/10000_for_a_course/hevixoi/",
      "text": "I don’t have any advice for you but I am so sorry that this happened. I understand that you all have worked your butts off for years and it does not make sense at all to just “go back home.”",
      "author": "pumpkinator21",
      "created": 1633023580,
      "upvotes": 4,
      "replies": {
        "hf0znl2": {
          "link": "/r/GradSchool/comments/pyjggk/10000_for_a_course/hf0znl2/",
          "text": "Thank you so much!! 💖\n\nYeah, I wonder why people say things like that but we keep striving, I guess.",
          "author": "alloverated",
          "created": 1633126389,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}