{
  "sid": "r5zjt3",
  "link": "/r/GradSchool/comments/r5zjt3/what_are_my_chances_of_getting_funding_for_an_phd/",
  "title:": "What are my chances of getting funding for an phD outside of STEM, like edD?",
  "text": "What are my chances of getting funding for an phD outside of STEM, like edD?\n\n&#x200B;\n\nApologies if you've been seeing my name everywhere, I'm absolutely balls to the wall doing research on possible pathways. These past few days, I've been completely obsessed with the idea of garnering a phD or edD, especially the phD as I've heard they are paid for, whaaaaa? \n\nI'm an aspiring teacher, so my alternative certification program will subsidize heavily my first masters. Most likely, it'll be a masters of science in special education, adolescent history, grades 7 to 12, allowing me to teach as a generalist for high school students. \n\nFrom there, I'm looking to either increase my salary steps as a teacher by obtaining a secondary masters, +30 professional development credits, or obtaining a phD or edD. \n\n&#x200B;\n\nBack to the question at hand, what are my chances of getting these degrees paid for? I make currently what the stipend living amount would be, and am super frugal, but as I'm not a STEM major, realize this may be super difficult.",
  "author": "10pumpsclassic",
  "created": 1638312152,
  "updated": 1638481167,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.43,
  "comments": {
    "hmq4bbq": {
      "link": "/r/GradSchool/comments/r5zjt3/what_are_my_chances_of_getting_funding_for_an_phd/hmq4bbq/",
      "text": "Low.",
      "author": "cropguru357",
      "created": 1638313985,
      "upvotes": 9,
      "replies": {
        "hmql4i7": {
          "link": "/r/GradSchool/comments/r5zjt3/what_are_my_chances_of_getting_funding_for_an_phd/hmql4i7/",
          "text": "Even lower than that.",
          "author": "offalt",
          "created": 1638321497,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmqjorr": {
      "link": "/r/GradSchool/comments/r5zjt3/what_are_my_chances_of_getting_funding_for_an_phd/hmqjorr/",
      "text": "PhDs are typically funded. EdDs are not. \n\nThe career pathways for each are very different, so it would be a good idea to spend some time researching each to better understand what kind of degree program would best suit your goals and qualifications.",
      "author": "redrosehips",
      "created": 1638320847,
      "upvotes": 6,
      "replies": {}
    },
    "hmqubfg": {
      "link": "/r/GradSchool/comments/r5zjt3/what_are_my_chances_of_getting_funding_for_an_phd/hmqubfg/",
      "text": "I have never heard of a funded EdD.  Many EdD programs can be completed part-time, often with employer financial support provided.",
      "author": "MissProfessor",
      "created": 1638325614,
      "upvotes": 3,
      "replies": {}
    }
  }
}