{
  "sid": "r1grxk",
  "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/",
  "title:": "Does anyone feel bad about enjoying Thanksgiving?",
  "text": "It’s my first semester of grad school and as things draw to a close I feel even more overwhelmed. My cohort and I have been bombarded with projects and assignments that are due next week. It’s the final week of classes and I’ve put in my best effort to manage my time but I still have so much to do! Because of this I feel so stressed and borderline guilty if I take a day off for Thanksgiving. Does anyone feel like this or am I just putting undue pressure on myself?",
  "author": "Shezsocereal",
  "created": 1637792341,
  "updated": 1638208015,
  "over_18": false,
  "upvotes": 59,
  "upvote_ratio": 0.93,
  "comments": {
    "hlz9ue2": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlz9ue2/",
      "text": "My advisor sent a slack message to the entire lab saying we are closed from Thursday to Sunday except for watering the plants (horticultural science, plants don’t take vacations). Get you an advisor like mine.",
      "author": "hiagha",
      "created": 1637804574,
      "upvotes": 59,
      "replies": {
        "hlzhsdb": {
          "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlzhsdb/",
          "text": "Plants don't take vacations lol!",
          "author": "sixbekahone",
          "created": 1637808136,
          "upvotes": 16,
          "replies": {}
        },
        "hm1xqei": {
          "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hm1xqei/",
          "text": "Same! My advisor went in this AM to put fish on system (someone apparently didn’t plan their breedings well….) and to care for the embryos and told us to enjoy the break. Fish also don’t take vacations 😂",
          "author": "tsb0673",
          "created": 1637860216,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlz483m": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlz483m/",
      "text": "If it makes you feel better, I have one of four projects started and I haven't done anything class or RA related since Thursday. I'm in my fifth of six semesters and my fuck-o-meter is at an all time low. It'll get done! You have to give yourself time to shut off your brain. You can't go all the time always or you'll snap :) One of the most valuable things I've learned in grad school is how to listen to my body when it's asking for rest. You'll get it done.",
      "author": "signedizzlie",
      "created": 1637802070,
      "upvotes": 20,
      "replies": {}
    },
    "hlykpl1": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlykpl1/",
      "text": "Both! I’m in the same place as you lol. I’m taking two days off—today and Thanksgiving day. Im home for the first time in months and my seminar papers are spinning in my head haha. You deserve your break. Take a day off and relax. \n\nPrep yourself and prioritize your tasks if it’ll help you ease the tension. I’ve got a list of TO-DOs with days and times that I’ll be working on after the next two days of break so I can at least feel better about not doing any work. \n\nCan you ask for extensions? Maybe an extra day or two if your professors don’t have grades to input yet? At least asking is better than not and finding out you could have been helped! \n\nAnyways, enjoy your time off. It’s important to put your needs first! No need to feel guilty about it. ❤️",
      "author": "scholarsara",
      "created": 1637793391,
      "upvotes": 8,
      "replies": {
        "hlym5li": {
          "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlym5li/",
          "text": "Thank you for the advice! The most overwhelming aspect of this semester has been the group work! I have had to basically accommodate the schedules of my peers because everyone works full time or has prior responsibilities. I don’t doubt we can finish it in time I just worry about the quality of our work. But I think I deserve some time for myself! Thank you and happy holidays!",
          "author": "Shezsocereal",
          "created": 1637794008,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hlyv5xt": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlyv5xt/",
      "text": "No",
      "author": "Weekly-Ad353",
      "created": 1637798009,
      "upvotes": 9,
      "replies": {}
    },
    "hlzfhux": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlzfhux/",
      "text": "It is good that you recognize these thoughts early in your graduate studies because they can become toxic if not managed. It is important to be kind and compassionate with yourself and set reasonable expectations.\n\nWhen you encounter such intrusive thoughts, try this:\n\n\"\\_\\_\\_\\_ is something I enjoy doing, therefore I do not feel guilty prioritizing this activity at least for a little while.\"\n\nCelebrating Thanksgiving and enjoying the social company of family and friends is important to me and something I enjoy doing, therefore I do not feel guilty prioritizing this activity at least for a little while. This break will help me return to my work refreshed and ready to take it on.",
      "author": "Zealousideal-Row-110",
      "created": 1637807108,
      "upvotes": 7,
      "replies": {}
    },
    "hm043m7": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hm043m7/",
      "text": "Grad school is a marathon not a sprint. I realize it can be hard to take a break from work, but you should, especially on meaningful holidays.\n\nPeople who say otherwise are contributing to a toxic work environment.",
      "author": "roachRancher",
      "created": 1637819565,
      "upvotes": 3,
      "replies": {}
    },
    "hlz7kcy": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlz7kcy/",
      "text": "I’m literally sitting here watching Highlander and painting. I should be working on papers, but I will start again tomorrow and work next week hard core.  This is also my first semester so I guess I’m just trying to find a swing in things.  Enjoy your thanksgiving and bust a** next week. Maybe start work on Sunday?",
      "author": "Ecstatic-chipmonk",
      "created": 1637803560,
      "upvotes": 8,
      "replies": {
        "hm0vp7e": {
          "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hm0vp7e/",
          "text": "Just curious, did you start writing research papers in your first semester? Isn't that too early?",
          "author": "Shebaro",
          "created": 1637839971,
          "upvotes": 2,
          "replies": {
            "hm47gsk": {
              "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hm47gsk/",
              "text": "I’m in a intro to research class that is learning how to write. We pretty much just write up a lit review and the whole process is to get us to understand how to read and write papers.  I’m not actually doing the research like in a lab I’m just pulling articles reading them drawing up a story on one particular subject.",
              "author": "Ecstatic-chipmonk",
              "created": 1637899407,
              "upvotes": 1,
              "replies": {
                "hm4zqfd": {
                  "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hm4zqfd/",
                  "text": "Yep. Same here rn. They obliged us to start with Introduction to Research in first semester and we are also doing paper critique and rotation mini projects. Ngl it was a tough semester. Thank god it's almost over though. Good luck to you.",
                  "author": "Shebaro",
                  "created": 1637918974,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlyzbd7": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlyzbd7/",
      "text": "Same. But mainly because I have some unfinished assignments from last semester. I think give yourself a day or two to relax is crucial",
      "author": "gappoppop",
      "created": 1637799859,
      "upvotes": 3,
      "replies": {}
    },
    "hlz2stc": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlz2stc/",
      "text": "Yea. And I’ve been bombarded with projects too. I’m going to hit it hard again tonight. But tomorrow I’m not going to even think about it. I’m going to enjoy a nice lunch, spend time with family, and watch the Macy’s parade with my Grandma.",
      "author": "MrUnknown1996",
      "created": 1637801425,
      "upvotes": 3,
      "replies": {}
    },
    "hlzkgls": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlzkgls/",
      "text": "If it's not going to add undue stress to you next week, enjoy. If you're going to be overwhelmed, maybe do an hour or two of work, so you feel like you've given yourself a jump on the next week.",
      "author": "Karbar049",
      "created": 1637809356,
      "upvotes": 2,
      "replies": {}
    },
    "hm1f0mr": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hm1f0mr/",
      "text": "Humans need breaks. Take this time",
      "author": "yungScooter30",
      "created": 1637851858,
      "upvotes": 2,
      "replies": {}
    },
    "hm1ifyh": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hm1ifyh/",
      "text": "The draft for our final capstone is due Sunday. I get it I get it I could have been working steadily on the damn thing all semester but here I am working my ass off trying to get it all done in time. Working full time and school full time was not the greatest choice for my personal life….\n\nTo add insult to injury the professor sent us all an email encouraging us to take time off and enjoy the day with our families. 😵‍💫 \n\nOTOH I will be done in a few weeks so there is that.",
      "author": "sailor_em",
      "created": 1637853518,
      "upvotes": 2,
      "replies": {}
    },
    "hm1m5av": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hm1m5av/",
      "text": "It's normal for a new grad student to feel that way. Give it some time and eventually you'll feel no guilt taking days off even though you're like a month behind on two chapters and a book review because you'll realize that, with rare exceptions, almost nothing anyone produces in academia (especially as a grad student!) has even a tenth of the value of one good day spent with loved ones.\n\nEnjoy the day.",
      "author": "Pinkfish_411",
      "created": 1637855205,
      "upvotes": 2,
      "replies": {}
    },
    "hlz1q5c": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlz1q5c/",
      "text": "I feel the same. Although I have nothing to do this week, it feels weird to enjoy my break instead of starting a paper due next week.",
      "author": "Available-Tough-2331",
      "created": 1637800945,
      "upvotes": 1,
      "replies": {}
    },
    "hlzqesy": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hlzqesy/",
      "text": "I don’t feel bad taking holidays off! I do however feel bad taking time off normally. But I’ve learned it has to happen because my brain without rest is dumb and my brain with rest can solve problems easier.\nedit: because I can’t spell.",
      "author": "kritann87",
      "created": 1637812224,
      "upvotes": 1,
      "replies": {}
    },
    "hm0heos": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hm0heos/",
      "text": "My cohort is doing a Friendsgiving on Saturday! We’ve all become surprisingly close in the few months we’ve known each other.",
      "author": "chem_swimguy",
      "created": 1637828404,
      "upvotes": 1,
      "replies": {}
    },
    "hm13ama": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hm13ama/",
      "text": "You won't happen to go to USC would you? Lol",
      "author": "HAHAHABirdman",
      "created": 1637845436,
      "upvotes": 1,
      "replies": {}
    },
    "hm1cig3": {
      "link": "/r/GradSchool/comments/r1grxk/does_anyone_feel_bad_about_enjoying_thanksgiving/hm1cig3/",
      "text": "You’re allowed to take breaks. Sometimes it helps you be more productive and less stressed out in the long run.",
      "author": "Firejay112",
      "created": 1637850633,
      "upvotes": 1,
      "replies": {}
    }
  }
}