{
  "sid": "qsp0hf",
  "link": "/r/GradSchool/comments/qsp0hf/less_deserving_than_all_of_you_and_still_burned/",
  "title:": "Less deserving than all of you - and still burned out",
  "text": "(Edit - I'm *feeling* less deserving. Can't seem to change my title....)\n\nLooking for some schedule-setting feedback and pep talks from anyone who would be so kind:\n\nI'm about to finish grad school with a VERY general, nonspecific master's degree in environmental studies (not science). I have no plans for what to do after. I jumped into this with the inheritance from my mother's death in order to \"get my life together\" but it kind of did the opposite. I ended up stretching it out as long as possible as I continued to work menial jobs I was terrible at.\n\nNow I'm in the final capstone class. Unfortunately I found sabotaged myself at the beginning the semester by changing my paper topic multiple times and ended up being perpetually behind in my assignments in a sort of domino effect. On the bright side my job assignment recently ended -- so I have time. On the less bright side, I haven't done much good with that. I have ended up getting overwhelmed rather than motivated by the newfound extra time. Maybe the lack of structure was jarring or something.\n\nNow I'm weeks late for paper assignments, -- even late for the revised deadlines the prof was kind enough to give me. I don't think he'll fail me if I'm really late but obviously I need to finish this to graduate and don't want to be disrespectful.\n\nI really need advice for time management and schedule setting when you're ALREADY BEHIND and having a hard time forgiving yourself. I've seen a lot of advice for keeping a buffer but we're past that.\n\nLike, I still have a month left in this b\\*\\*\\*\\* so it's still more of a marathon than a sprint. I get easily overwhelmed and am not great at \"powering through\" things. In fact I've needed to work 5 minutes on/off just to get anything done or I fall into a depressive stupor.\n\nWould someone with more brain cells than me be willing to suggest a scheduling system I can abide by? No time of day works better or worse for me. I really need some boundaries that aren't based on \"just do it.\" It doesn't have to be perfect. Kind words welcomed too XX",
  "author": "Wrong-Challenge3500",
  "created": 1636763452,
  "updated": 1637182756,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkezjiv": {
      "link": "/r/GradSchool/comments/qsp0hf/less_deserving_than_all_of_you_and_still_burned/hkezjiv/",
      "text": "This is a rough place to be in, and you have my sympathy. [NaNoWriMo](https://quiz.tryinteract.com/#/5c93adfd5e6c6c0014f53063) has an informal quiz for helping participants make writing schedules, and maybe you can at least get some ideas from there. More generally though, and whether or not scheduling strategy seems to help, I tend to recommend [this self-compassion workbook](https://www.cci.health.wa.gov.au/Resources/Looking-After-Yourself/Self-Compassion) because we all can benefit from being kinder to ourselves. One of the things that bothers me the most about grad school is strong attachments between our self worth and our productivity (fuckin capitalists, amirite?). A lot of schools get short-term benefits when students are willing to sacrifice their wellbeing for validation from faculty, but we're worth more than that. You are worth more than that. You deserve to be kind to yourself. Full stop.",
      "author": "EtTuSouffle",
      "created": 1636773540,
      "upvotes": 3,
      "replies": {
        "hkezobs": {
          "link": "/r/GradSchool/comments/qsp0hf/less_deserving_than_all_of_you_and_still_burned/hkezobs/",
          "text": "Thank you. This means so much, and I will eagerly check out your suggestions. You're the best!!",
          "author": "Wrong-Challenge3500",
          "created": 1636773610,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}