{
  "sid": "qev8xv",
  "link": "/r/GradSchool/comments/qev8xv/love_my_research_and_advisor_but_dislike_my/",
  "title:": "Love my research and advisor, but dislike my school/program - not sure if I should stick with PhD",
  "text": "I'm in a weird spot where I actually really enjoy my research and really like my advisor. I chose my current school because the rare research opportunity that was offered to me. However, I'm now in my second year and I'm not enjoying my environment and don't feel that I'm a good fit in my program (I already transferred programs within the school once to try and find a better fit). I'm really torn as I don't know whether it's worth it to follow my research passion, if it means another 2-3 years of poor mental health, trudging through the tasks of an unfitting program and living in a city that I really dislike.   \nI'm not sure how to broach these feelings with my advisor, who will undoubtedly want me to stay. Is this normal for PhD students? Has anyone ever been in a similar situation?",
  "author": "Jeebchungus",
  "created": 1635091923,
  "updated": 1636197538,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhvrbnx": {
      "link": "/r/GradSchool/comments/qev8xv/love_my_research_and_advisor_but_dislike_my/hhvrbnx/",
      "text": "I also love my research and my advisor, but absolutely hate my program and school, mostly because they have screwed me and many of my friends/cohort over. I used to hate the city and the state I live in, but starting really embracing it in the second half of my 3rd year. I'm probably graduating in about 15-18 months and I'm actually sad at the thought of leaving. \n\nIt helps that I am really close to my cohort, I have a really good living situation, and a lot of friends. But I didn't make most of my friends or get really close to my cohort until second half of 2nd year on.\n\nSo, the question is, why do you hate your program? If it's an atmosphere thing that you experience all the time and when doing your research, you may consider dropping out now. If it's effectively classes, seminars, and other temporary things that will go away when you shift to full time research, I would stick it out.\n\nWhy do you hate your city? Is it because it's new, different, and not as good as the place you left? Or is it because there is nothing redeemable about it? Have you had a chance to explore and find good things about it? Again, I didn't until my 3rd year, and then found many things I love about where I live. I don't think I'm going to live here forever, but I will be sad when I leave.\n\nSo it really depends on why you dislike your program/city, and if those issues are transient or permanent. I can tell you that my mental health improved so much after my 2nd year was over, but your story might be different.",
      "author": "IRetainKarma",
      "created": 1635095279,
      "upvotes": 2,
      "replies": {}
    },
    "hi01mi9": {
      "link": "/r/GradSchool/comments/qev8xv/love_my_research_and_advisor_but_dislike_my/hi01mi9/",
      "text": "I'm in the same boat. I was really excited to start but all of that was immediately sucked by what i consider to be a challenging atmosphere (for me). I'm kind of not sure what to do because this was all a big deal but I just don't care anymore.",
      "author": "vezione",
      "created": 1635178714,
      "upvotes": 1,
      "replies": {}
    },
    "hi2q920": {
      "link": "/r/GradSchool/comments/qev8xv/love_my_research_and_advisor_but_dislike_my/hi2q920/",
      "text": "Ive been in a similar situation. Advisor and program was wonderful,  several of the other grad students I had to work with were awful. There were some really nice students of course but the bad apples were so bad they really did spoil the bushel. Bullying, extreme cliqueshness neither of which anyone would bother to confront directly and they actually attempted to sabotage people for no good reason when they got jealous over the most ridiculous things. It didnt work, but imagine having to go to the Dept every day and be surrounded by a bunch of people you know tried to sabotage your research but can't definitely prove it which is what it would take to get them kicked out. \n\nEveryone hated the toxic students, but no one could do anything about it. They produced just enough work that their advisors wouldn't kick them out for being horrible people",
      "author": "bucky_list",
      "created": 1635221316,
      "upvotes": 1,
      "replies": {}
    }
  }
}