{
  "sid": "ov810c",
  "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/",
  "title:": "I’m in my final year of a Masters degree and today was the first time a professor encouraged me.",
  "text": "And it was very bittersweet.\n\n\nI was in a meeting with my supervisor and another professor who is part of a project with us. In response to my presentation, he made a lot of comments and questions and eventually started sharing some anecdotes of his experience in research.\n\n\nI don’t know what it was. Maybe the fact that his statements always started with “I” which indicated that he is someone with minimal self-awareness. But then he started talking about the research process. Coming up with a hypothesis, the joy of finding an original thought, the struggles of writing and the relief that comes after the first sentence. It hit home. It’s like he took me by the hand and showed me all these cool toys in the playground. He encouraged me to keep going.\n\n\nThen, silence. Before I could acknowledge this pep talk, my own supervisor chimed in. To my surprise, he admitted that this was probably the first time I was receiving encouragement in my grad journey and apologized/messily thanked the professor on my behalf. He admitted that he only gives me negative, often harsh feedback. \n\n\nBefore any of us could respond to that, he shared his own anecdote of his equally harsh supervisor. The way he spoke about it, though he chuckled nervously, it’s clear that his own grad school experience was inhumane and traumatizing. \n\n\nI felt sad for him, but something clicked within me: hurt people hurt people.",
  "author": "duascoisas",
  "created": 1627741371,
  "over_18": false,
  "upvotes": 321,
  "upvote_ratio": 0.99,
  "comments": {
    "h7cz803": {
      "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h7cz803/",
      "text": "I can relate, but when I finally asked for some encouragement in my last few months, she told me “Ive always known you can do it so I never needed to tell you that, you just need to believe it yourself and get it done. You shouldnt need other people to tell you what you can do to do what you can do”. And it really hit home because, especially once I go into industry, a PhD program, or academia, whatever, its all going to be stuff I *can* do but that I just need to find it within myself to do it. \n\nShe had never really given me a bad word but never many good either but I realized thats because she wanted me to become confident without *needing* praise from anyone and I think learning that has made me a lot more productive and confident about my defense next week.",
      "author": "GayMedic69",
      "created": 1627854876,
      "upvotes": 1,
      "replies": {
        "h7d2jwy": {
          "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h7d2jwy/",
          "text": "I’m happy for you that she never gave you “a bad word” though. \n\n\nI see what you mean. I think every grad student/employee needs to have a certain level of self-efficacy when starting up. It makes it easier for your mentor to actually mentor you, if you already have some motivation and knowledge of yourself and your abilities.",
          "author": "duascoisas",
          "created": 1627856513,
          "upvotes": 1,
          "replies": {
            "h7d32uu": {
              "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h7d32uu/",
              "text": "Very true. My biggest issue was that she had no idea what I was doing. She is the director of the clinical micro lab at the vet hospital at our uni, she teaches, and allows our lab to run itself, so when I went to her for help it was kind of general advice so she didnt help much so one day I was just like “Dr. _____ Im lost and I dont think I can do this, I need you to give me some feedback or encouragement to get me there”. And she was just like “If I didnt think you could do this you would have been gone long ago”, hyped me up a bit, and told me to believe in myself because people arent going to be there to hype me up. \n\nI was incredibly lucky to have an amazing post-doc who mentored me on all the science and some of the personal stuff, but it wasnt until that convo with my advisor like 2 months ago lol that I realized she just wanted me to be able to do science like an independent researcher.",
              "author": "GayMedic69",
              "created": 1627856780,
              "upvotes": 1,
              "replies": {
                "h7d5xfb": {
                  "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h7d5xfb/",
                  "text": "I’m happy you learned a valuable lesson from the experience! \n\nSupervisors shouldn’t coddle, but they should supervise and even, in some cases, mentor. I don’t know. Maybe it’s an optional choice to mentor.\n\nAfter all we call them “supervisors”, and I guess yours was it.",
                  "author": "duascoisas",
                  "created": 1627858220,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h7btxy6": {
      "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h7btxy6/",
      "text": "I can relate.\n\nIn 5 years of grad school, my PI/main supervisor has never said one uplifting comment, offered any encouragement, or given any helpful advice or direction on my project. \n\nThey are also revered in their field and treated like a god by the powers that be and people who they don't work directly with, whilst reviled by almost all of the students (there are a few exceptions for the professional brown nosing \"yes to everything\" types).\n\nSucks.",
      "author": "Shulgin46",
      "created": 1627835240,
      "upvotes": 3,
      "replies": {}
    },
    "h78scv8": {
      "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h78scv8/",
      "text": "In really happy for you! I didn't get much encouragement until I was defending my thesis. I made a statement regarding the fact I didn't have positive results and after my committee discussed amongst themselves and called everyone back in, my two committee members (not my advisor) said I did a really great job in spite of things going wrong and that I should be proud of myself because I did what I set out to do and what I was supposed to do. It was so nice but man I wish I had gotten that way beforehand. My advisor was not bad but she was absent or very minimally involved and just didn't want me to be one of her other students who took years to graduate. I did it in  just over 2 years. Anyway, I'm glad you heard it when you did and hope you keep getting encouraged. Grad school is hard and we all need a little something to keep going sometimes! I hope you know I'm proud of you!!",
      "author": "gingerlovingcat",
      "created": 1627766116,
      "upvotes": 4,
      "replies": {}
    },
    "h78jpw4": {
      "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h78jpw4/",
      "text": "Recently had a similar experience, I cant elaborate too much, I need to do an update post at some point, but I had to switch advisors and my new advisor has so far been leagues better at communication than my last one. It feels like I can actually do what I'm supposed to now instead of playing farts with their expectations.\n\nDarts* I'm leaving it.",
      "author": "InfuriatingComma",
      "created": 1627761742,
      "upvotes": 5,
      "replies": {}
    },
    "h78g4u3": {
      "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h78g4u3/",
      "text": "[deleted]",
      "author": null,
      "created": 1627759930,
      "upvotes": 3,
      "replies": {
        "h78vhrw": {
          "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h78vhrw/",
          "text": "I should have elaborated more on this, you’re right.\n\n\nBut there is a concept of “nonviolent communication”, and one of the principles in healthy communication overall is to always stick to your feelings (vs projecting onto others or using many “you” statements).\n\n\nI.e. \n- I feel hurt and frustrated when you do that. \nVs\n- You always hurt and frustrate me when you do that. \n\n\nThe difference may not be obvious at first, but both statements lead to different paths. Using “I” statements keeps you accountable to your own reality. It helps your email responsible for your emotions, but still leaves some space for you to express yourself and seek solutions.\n\nIn the case of my supervisor, all his feedback starts with “you”. “You don’t understand this. Why aren’t you understanding this? You’re not reading enough. You don’t seem interested. You’re not interested right?” Etc etc. \n\nIt’s exhausting, I feel so much is being projected onto me, and it leaves me no choice but to reply “yes, sir” because I don’t want to disagree with his “diagnosis” of me and start another conflict.",
          "author": "duascoisas",
          "created": 1627767721,
          "upvotes": 5,
          "replies": {
            "h79e433": {
              "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h79e433/",
              "text": "[deleted]",
              "author": null,
              "created": 1627777590,
              "upvotes": 3,
              "replies": {
                "h79k6gd": {
                  "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h79k6gd/",
                  "text": "Oh, I meant that him having a minimal self-awareness is good in relation to my supervisor who appears to have none (because he projects a lot).\n\n\nI see my original post was a bit misleading, I’m sorry for that! \n(My prof, bless his soul, would have said: “you keep misunderstanding my post.”)",
                  "author": "duascoisas",
                  "created": 1627780935,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h78366o": {
      "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h78366o/",
      "text": "Such a good story, thanks for sharing. Professors are typically a little self centered to be good at their jobs. Nice to see they’re learning self awareness haha.",
      "author": "GJThreads",
      "created": 1627753578,
      "upvotes": 13,
      "replies": {
        "h78vvem": {
          "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h78vvem/",
          "text": "Which part of their job do they excel at by being self-centered? \n\n\nI mean it, what’s the correlation exactly?",
          "author": "duascoisas",
          "created": 1627767918,
          "upvotes": 1,
          "replies": {
            "h79nerx": {
              "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h79nerx/",
              "text": "It’s easier to stand out when you make yourself and your research the center of every conversation.",
              "author": "ooooq4",
              "created": 1627782733,
              "upvotes": 9,
              "replies": {}
            },
            "h7crafg": {
              "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h7crafg/",
              "text": "Cause competition is murderous to even get the job",
              "author": "doornroosje",
              "created": 1627851004,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h77oj40": {
      "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h77oj40/",
      "text": "Hey, I'm sorry that you have a tough supervisor. The journey itself is already challenging without a less than encouraging supervisor. I'm glad that he is acknowledging it as I know many that do not realize that their demeanour is causing hurt to others.\n\nJust wanted to chime in and say, it's great that you also can see beyond the rough exterior of your supervisor. It shows the kind of person you are, considerate and wise. Great job on your Masters. Wish you the best.",
      "author": "givemeyourdonut",
      "created": 1627746637,
      "upvotes": 6,
      "replies": {}
    },
    "h77lj12": {
      "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h77lj12/",
      "text": "I guess your advisor is taking baby steps towards dealing with that himself, which is good. I guess this kind of people management training is rarely given to researchers. I hope he gives you and his other advisees more encouragement in the future. \n\nAnd best of luck for whatever is left of your masters :)",
      "author": "Researcher_Life",
      "created": 1627745160,
      "upvotes": 57,
      "replies": {}
    },
    "h77l2jd": {
      "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h77l2jd/",
      "text": "I wish professors who weren't my advisor gave me encouragement! My advisor is incredibly encouraging and my collaborators are overly harsh/critical (to a point where my advisor has said he doesn't want to collaborate with them in the future). I find it frustrating because my advisor consistently makes me like I am capable of doing great work and then when I meet with the collaborators, I feel like a complete fool who can't do anything.",
      "author": "poniesgirl",
      "created": 1627744933,
      "upvotes": 43,
      "replies": {
        "h77rm3n": {
          "link": "/r/GradSchool/comments/ov810c/im_in_my_final_year_of_a_masters_degree_and_today/h77rm3n/",
          "text": "It is possible to go too far in the direction of encouragement also.  That’s not to say you are doing poor work, but you do need to calibrate some internally.  Take encouragement from your advisor’s kind words, but don’t let yourself grow complacent in your own current ability.  The whole point of research is to dive into places where you feel stupid or overwhelmed, and then conquer them.\n\nI have encountered more than one Postdoc who came out ill prepared for the research world, because they had\noverly effusive advisors and did not push themselves to grow.",
          "author": "drzowie",
          "created": 1627748062,
          "upvotes": 14,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634066874
}