{
  "sid": "gwuv29",
  "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/",
  "title:": "I [Rant] I want to be completely candid about something I’ve been hesitant to admit to myself",
  "text": "Edit: Thank you all for commiserating with me, sending me words of encouragement, and just generally engaging in this discussion. I wrote this last night during a mini anxiety attack so my post probably came off as disorganized, whiny, entitled, and perhaps defensive. As I responded to someone below, the whole point of this was to say that I ultimately want to have a career where my work is financially valued more than it is in academia. I want my life to be about passion, and science is something I am truly passionate about. However, I am also of the opinion that at the end of the day a job is a job is a job and we should all demand to be compensated appropriately for our level of education, skill, and experience. \n\n.\n\n\nComplete stream of consciousness below and seriously not even worth reading:\n\n.\n\n\n\nI love being an academic scientist in the sense that I enjoy doing the research, the hours of reading/learning that goes into it, the discussion, and generally the *idea* of being an academic. But I hate doing the fucking work. I hate it. I don’t want to do it anymore. I hate having to write, the deadlines, having to come home after a full workday and continue working on my couch at 8pm like I’m doing right now editing my prelim exam. I am just not a person who believes that your work should permeate every aspect of your life. I want the work-life balance and I want to get paid well for the work that I do. My (now ex) partner started a job as an assistant professor at a small liberal arts college last May after graduating for $50k a year. Like, wtf. I was earning that much as a research coordinator with a BA before I started my PhD. \n\nWhat I want is to work my 40-50 hours, and then go home for the weekend, smoke a bowl, and live my life without having work on my mind all the time. But most of all, I want to get paid more than what I would get paid as a professor. I can’t wait to finish my PhD in two years and dip the fuck out into government or private sector. The idea of having to put so much fucking effort into my career makes me want to vomit. \n\nI understand this may ruffle some feathers in a sub where a majority of its subscribers are hardworking individuals and high achievers who will probably end up in academia. But I’m done with it and I feel so liberated saying this.",
  "author": "SaintLoserMisery",
  "created": 1591320240,
  "over_18": false,
  "upvotes": 344,
  "upvote_ratio": 0.97,
  "comments": {
    "ft5t7tq": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/ft5t7tq/",
      "text": "I do think there is an element of this problem that is self-imposed.  I did not work that hard in grad school - honestly I probably averaged like 30 hours/week, tops.  It's doable if that's what you want.  I intentionally chose a hands-off professor who gives his students a lot of flexibility, and I set pretty firm limits with myself about not working in the evenings or weekends.  I chose a committee that is known for being friendly/supportive rather than rigorous.\n\nOf course there's a trade-off -  I'm graduating a little later than most of my cohort, but I'm by no means the last.  I probably have fewer and lower-impact papers than them.  I definitely could not get a job in academia.  But I do have a job lined up at a high-profile consulting company that I'm hella excited for.\n\nAnd during the last 5 years, I've had a lot of fun!  I got married, I've gone on great vacations, I've read a ton of books and knitted a lot.  I have the best quality of life of anyone I know.\n\nNot everyone wants this, and that's okay.  But you can choose to set limits on work, and still graduate.",
      "author": null,
      "created": 1591468493,
      "upvotes": 3,
      "replies": {}
    },
    "fszvdbp": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fszvdbp/",
      "text": "I mean I get and understand this attitude, can even appreciate it..so no judgement there.  What I have more difficulty with is how cavalier some people seem to pursue a PhD.  Really, to anyone thinking about a PhD....don't do it unless you are VERY confident that you are willing to sign your life over to that field and understand that for the next 5 years you will be consumed by it for very little pay or even a debt.  \n\n\nMaybe it takes this sort of experience to figure out that it isn't for you, but if you are graduating college looking forward to \"work life balance\" then don't do a PhD.",
      "author": "Grevious47",
      "created": 1591380162,
      "upvotes": 2,
      "replies": {
        "fszysxq": {
          "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fszysxq/",
          "text": "A lot of people think that graduate school is the only way to advance their career, and often times it is depending on their field. I was well aware of what I was getting into, having been involved in academic research for over a decade. I will never regret getting my PhD. It’s the hardest and the most rewarding thing I’ve ever done. However, this experience also illuminated for me that academia is a broken system rife with elitism, competition, and bureaucracy. Something I’ve always known but thought it was worth dealing with to be a scientist. Another thing is that people keep perpetuating the “you have to sacrifice work-life balance to be a good academic” narrative. Academia gaslights us into believing that you have to submit yourself to that kind of life, and then feel inadequate when we don’t want to be subjected to that because those who have bought into the culture make us feel like we aren’t good scientists because of it. I urge you to unlearn that you have to “sign your life over to your field”, it will truly liberate you.",
          "author": "SaintLoserMisery",
          "created": 1591381822,
          "upvotes": 3,
          "replies": {
            "ft0imqd": {
              "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/ft0imqd/",
              "text": "I'm sorry you got burned by the experience but I'm glad to hear that you don't regret your PhD.  Best of luck.",
              "author": "Grevious47",
              "created": 1591391426,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fsz7436": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsz7436/",
      "text": "I have many friends whose lives are their work. That works for them, that doesn’t work for me. I did my best to work 40-50 hour weeks, no work at home, and minimal weekend work. And for those who say that kind of crazy dedication helps you finish faster, that definitely is not always the case. I finished in about the same amount of time as my friends who put in 2-3x the hours. Given all that, I knew academia wasn’t the right path for me. Realizing that early on I was able to start educating myself about industry, jobs that are out there, and who to talk to to learn about and actually get those jobs. Now I still work 40-50 hour weeks and no weekends and make 2x what I would as a postdoc. Don’t let the guilt of leaving academia dissuade you, it’s perfectly fine to want to have a life.",
      "author": "Juggernaut1210",
      "created": 1591368470,
      "upvotes": 3,
      "replies": {}
    },
    "fsz4d7w": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsz4d7w/",
      "text": "I think what you are expressing is a perfectly legitimate outlook. However, bear in mind, no matter what line of career you end up in, academic or otherwise, if you want to be in the top 1% of successful people (the metric for how this is measured varies according to the line of work), you are going to have to put in the hours. On the flip side, there is nothing wrong with wanting to work 40-50 hours and maintaining an strict work-life balance, but doing this you're likely going to have to make peace with being a cog in the machine, with minimal control over the larger aspects of the work you're doing and possibly fewer avenues for career growth. But as I said, there is absolutely nothing wrong with that. Life is yours! You get to decide what to do with it!",
      "author": "Dick_Winters",
      "created": 1591367055,
      "upvotes": 1,
      "replies": {
        "fsza7h8": {
          "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsza7h8/",
          "text": "I am very aware of the corporate hierarchy, the point is that I want to have a career where my work is financially valued more than in what it is in academia. An hour of work in academia is inherently compensated less than it is in government or the private sector. My goal isn’t to be a corporate overlord, only to be paid appropriately for my education level, skills, and experience, which is something academia is unable to provide unless you work at extremely competitive R1s.",
          "author": "SaintLoserMisery",
          "created": 1591370018,
          "upvotes": 3,
          "replies": {
            "fszl3t6": {
              "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fszl3t6/",
              "text": "Agree with this. Good luck!",
              "author": "Dick_Winters",
              "created": 1591375268,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fsz4b1a": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsz4b1a/",
      "text": "I felt the same and then I quit and it was the best decision I’ve made in awhile. I was tired of defining my self worth by my seat in the high ivory castle of academia.",
      "author": "stellte",
      "created": 1591367022,
      "upvotes": 3,
      "replies": {}
    },
    "fsz483f": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsz483f/",
      "text": "I feel you. We work so hard, you would think that putting in so many hours would give us a decent salary. My sister has an associates degree from a cc and is making 3-4x with half the work compared to what I make as a TA and if I actually end up on the tenure track she will still make 2x as much as me! \n\nI can never really relate when someone says the job 'is not about the money.' Of course it's not about money, I get to do something I love. HOWEVER, framing it in that way (but you get to do what you love!) makes academia a breeding ground for abuse (i.e. adjunct positions that pay less than a TAship with no stability). \n\nWhile I would love a tenure track job, I will not let it interfere with my personal life. So, I am working hard to build my CV in a way that I can obtain an 'alt' career if I choose.",
      "author": "gekkogeckogirl",
      "created": 1591366980,
      "upvotes": 2,
      "replies": {}
    },
    "fsyy7k6": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsyy7k6/",
      "text": "I just started my PhD program and I feel the exact same way",
      "author": "manc4life",
      "created": 1591363670,
      "upvotes": 3,
      "replies": {}
    },
    "fsywx4r": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsywx4r/",
      "text": "I thought about moving on to vet school after I finish my Masters but after a year of doing my Masters, I realized I just don't want to be in school anymore. I want to actually make money instead of living on a stipend and loans.",
      "author": "CaffeinatedThighs",
      "created": 1591362910,
      "upvotes": 2,
      "replies": {}
    },
    "fsyudd0": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsyudd0/",
      "text": "Academia was never really my goal but I fear that years of not having a real job made me unemployable.",
      "author": "geometer2015",
      "created": 1591361321,
      "upvotes": 2,
      "replies": {}
    },
    "fsytu9f": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsytu9f/",
      "text": "You are not alone. One of the reasons I'm leaving research is because I WANT A LIFE. \n\nI attended a conference and one session was about postdocs. They were talking about the reasons people choose postdocs and why students choose careers after. I asked if they ever talked to anyone who choose a career to prioritize their lives and happiness. They said no. Most of them felt they HAD to do a post doc not matter what. Their happiness was never part of the decision. \n\nI love research, but I found another passion that can help people and make the country a better place for scientists (hopefully). It also would afford me the life I want. REAL vacations, being able to stop working at the end of the day, maybe making more but I doubt it.",
      "author": "michelle_luvz_bugz",
      "created": 1591360970,
      "upvotes": 5,
      "replies": {
        "fsz8rts": {
          "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsz8rts/",
          "text": "If you don’t mind me asking, what is your other passion that you feel can hopefully help people and make the country better for scientists? \n\nI’m also fed up like OP but trying (as much as possible rn) to decide whether to stay or leave academia, and your post inspires me.",
          "author": "gloomcoil",
          "created": 1591369312,
          "upvotes": 1,
          "replies": {
            "ft0i505": {
              "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/ft0i505/",
              "text": "I want to go into STEM outreach and communication. More specifically in my field of Microbiology. \n\nTeaching and inspiring the next generation of thinkers, voters, scientists, politicians will help our community for the better. We fail as a country to provide equal educational opportunities for all communities. We fail to encourage kids to be critical thinkers (maybe because it's harder to control them). We fail as scientist keeping this barrier up between us and the general population. I'm not some mythical intelligent being because I have a PhD. I'm still the same woman who sometimes fails at math, has a hard time telling left from right, and likes all things colorful. I just happen to know a lot about bacteria. \n\nI can give you a huge list about how public outreach would benefit our society and improve our future. We need more scientist going into the communities volunteering, organizing camps, participating in outreach. Showing kids that science is fun, its creative, it's beautiful and can help us solve so many problems. I want to help provide those tools for national or international programs. To make is easier and less scary to make that step.",
              "author": "michelle_luvz_bugz",
              "created": 1591391175,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fsynh1s": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsynh1s/",
      "text": "I hear your. It sucks that the only way to make extra money is grants, which makes you lose more sleep, is highly competitive and tied to university prestige.",
      "author": "nanon_2",
      "created": 1591356226,
      "upvotes": 3,
      "replies": {}
    },
    "fsyn3ym": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsyn3ym/",
      "text": "I am in the process of leaving academia because I hate the work-life balance, long days and weekend work, constant pressure and feeling like my whole life only revolved around my job. Because at the end it is just a job. \n\nDuring the quarantine I have had a lot of time to think and reflect on what I want, and I realized how much happier I was feeling when I had more free time to do the things I wanted and to connect with others. I have now found a new job that I'll start in a few months in data science for a small governmental organization :)",
      "author": "vicster_6",
      "created": 1591355923,
      "upvotes": 10,
      "replies": {}
    },
    "fsyiiqv": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsyiiqv/",
      "text": "> What I want is to work my 40-50 hours, and then go home for the weekend\n\nThere are countries where this is the norm for PhD students and academics more broadly.  From your post I guess that you live in the US.  I realize not everyone is willing to move and you may not be able to.  But if you meet younger students thinking of doing grad school, at least make sure you tell them that this is not a universal academia problem but one specific to certain cultures.  If they don't like it, they can and should vote with their feet.",
      "author": "polyphonal",
      "created": 1591351792,
      "upvotes": 2,
      "replies": {}
    },
    "fsygn15": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsygn15/",
      "text": "Amen to that. I'm going to try and become a high school teacher. I want to have time to do some volunteering, to consider having a pet, to go out with friends even during the week without feeling guilty that I should be working. I am not my work and I'll never be, and if the rest of my life doesn't add value to my work and vice-versa, then it's not the right job for me.",
      "author": "Dontgiveaclam",
      "created": 1591349962,
      "upvotes": 2,
      "replies": {}
    },
    "fsyfq7w": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsyfq7w/",
      "text": "If you would like to stay in science, did you consider coming to Europe? (I got the impression most posters in this sub are in the US, sorry if I got it wrong for you.) In most of the labs around here you can have a healthier work-life balance and still do meaningful, well-funded research.",
      "author": "Despinida",
      "created": 1591349075,
      "upvotes": 4,
      "replies": {}
    },
    "fsyannb": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsyannb/",
      "text": "I left academia for the same reason. I am not trying to be a workaholic.",
      "author": "baller_unicorn",
      "created": 1591344251,
      "upvotes": 5,
      "replies": {}
    },
    "fsy3vrv": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsy3vrv/",
      "text": "Most people in my program are planning to go into industry. I think only 3 people in my cohort are seriously considering academia. It’s not nearly as uncommon as you think",
      "author": "microvan",
      "created": 1591338493,
      "upvotes": 6,
      "replies": {}
    },
    "fsxvq3k": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxvq3k/",
      "text": "The things you're complaining about are real and it's okay to feel the way you do and want to live the life you want.\n\nAcademic culture makes us feel like we fail or quit if we don't end up tenured faculty. But that's just not true and it doesn't reflect on you as a person. The fact of the matter is that academia is a pyramid. Most people who start down this path don't get to be faculty. And while smarts and hard work are necessary, they're not sufficient. You must be lucky.\n\nThe *only* thing that can make you a failure is if you live a life not aligned with your values.\n\nFor what it's worth. You're not alone. I struggled a lot with this when I decided to go into government. No regrets. I love my job and I love the life that I can build now that I have one outside of work.",
      "author": "equationsofmotion",
      "created": 1591332485,
      "upvotes": 19,
      "replies": {}
    },
    "fsxv7hz": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxv7hz/",
      "text": "That's one of the reasons I don't know a single person in my cohort that wants to be a professor. It gets talked about in a \"well, if it comes down to it I guess I would teach\" kind of way. That's where I land. I'm going into government where I won't get paid as much as my labby equivalents but the law, HR, and workplace culture will keep me working around 40 hours a week barring unusual circumstances. I'll also have excellent benefits, and have the pinnacle of job stability because you pretty much have to commit a felony to lose a government job. Teaching is something I'd do if a family situation forced it or as a retirement gig if a school was interested. I'm super curious to see what academia looks like in 30 years because I just don't know anybody that wants to enter the nightmare.  \n\n\nDon't know what field you're in, but on the \"bright side\" some professors get paid a lot. The upper end of salaries in my department is upwards of $300k. Those are tenured professors who have been around for a couple decades, but still. That's some cash.",
      "author": null,
      "created": 1591332131,
      "upvotes": 33,
      "replies": {}
    },
    "fsxqlnw": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxqlnw/",
      "text": "I want the same, research was so much more fun to me as an undergrad. I was never micromanaged and ended up doing great work. Now that Im in gradschool I have been constantly being micromanaged and it makes it not fun and exhausting. I was so much better when I wasn't being micromanaged because I wanted to do good by myself already.\n\nNow Im like getting emails at 11 pm about research and stuff dislike, but love science.",
      "author": "AlphaBetablue",
      "created": 1591329156,
      "upvotes": 25,
      "replies": {}
    },
    "fsxpjuj": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxpjuj/",
      "text": "If I may ask what is your research topic and what was your interest in for your PhD? Honestly I’m just starting my PhD this fall in Psychology and my plan is to get a lot of skills relevant in the field as well as private sector (stats and programming). That’s really my backup plans at this moment if anything doesn’t go as I plan(academia).",
      "author": "chingalingdingdongpo",
      "created": 1591328502,
      "upvotes": 8,
      "replies": {
        "fsxqbhs": {
          "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxqbhs/",
          "text": "Sure. I study healthy and pathological aging. Currently I am looking at how lifestyle factors affect brain networks across the adult lifespan in healthy and AD individuals.  My work is centered around various neuroimaging techniques so I do have extensive stat and coding experience that I believe will make me a viable candidate in the private sector.\n\nEdit: yes, LEARN TO CODE. Learn to use Unix and Python. From my research into non-academic careers, knowledge of Python and machine learning are by far the most often listed required/preferred skills in job postings.",
          "author": "SaintLoserMisery",
          "created": 1591328980,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "fsxg2jq": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxg2jq/",
      "text": "[deleted]",
      "author": null,
      "created": 1591322856,
      "upvotes": 0,
      "replies": {
        "fsxj64z": {
          "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxj64z/",
          "text": "I am in my thirties and started my PhD well into my post-bac career. I have almost 20 years of work experience and 15 of that in various research and academic roles.  I do believe it’s absolutely possible based on my own experience and that of a few of my friends. While I am certainly not saying I can just phone it in for 40 hours a week and make six figures in the private sector or in the government, I also know that the work I would be doing would require totally different levels of mental input than what an academic career demands. The point is that the work would be categorically different than what I am doing now as a scientist.",
          "author": "SaintLoserMisery",
          "created": 1591324661,
          "upvotes": 1,
          "replies": {
            "fsxlrc6": {
              "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxlrc6/",
              "text": "[deleted]",
              "author": null,
              "created": 1591326193,
              "upvotes": 3,
              "replies": {
                "fsxnhkr": {
                  "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxnhkr/",
                  "text": "Good question. Because I love it. I love science, I really really fucking do. And for a long time I believed that to be a scientist you had to just accept the hard but rewarding work (and that’s true). And for a long time I didn’t care that much about the money at all, I just wanted to do what I loved. However, when I started my program and had to take a huge paycut to follow my dreams it was a rough adjustment. Like I said, I am in my thirties and getting paid a pathetic stipend while most of my friends have well-established careers. It’s hard to really explain this to people who have never been passionate about something. You’re willing to make those drastic sacrifices. However, the cutthroat competition, the pressure to publish or perish, the stress and anxiety of always feeling like you’re not as capable or as smart as your peers is truly starting to ruin me emotionally. Maybe I’m just another academic casualty. I still want to do something that’s science adjacent, just not this...not this way.\n\nEdit: it was less intellectually stimulating work but it was research that other people created. I wanted to be a scientist, not a research assistant. And although at the time I was getting paid more than I do now, I was basically at my earning ceiling, and I would not have been able to earn more or progress in my research career without an advanced degree.",
                  "author": "SaintLoserMisery",
                  "created": 1591327240,
                  "upvotes": 4,
                  "replies": {
                    "fsxqtpd": {
                      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxqtpd/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1591329298,
                      "upvotes": 5,
                      "replies": {
                        "fsxr39m": {
                          "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxr39m/",
                          "text": "Very well said. There will always be shitty* aspects of work, we just have to find the balance and hope that there are more good hours than bullshit hours in the day. Good luck to you too!",
                          "author": "SaintLoserMisery",
                          "created": 1591329464,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fsz4g8g": {
                  "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsz4g8g/",
                  "text": "“Less intellectually stimulating work” sounds like you’re disparaging those who have to work to provide for themselves. Getting a Phd doesn’t make you better than anyone else nor does it imbue your work with more worth. Labor is still labor.",
                  "author": "stellte",
                  "created": 1591367099,
                  "upvotes": -1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fsxdk5s": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxdk5s/",
      "text": "Thank you for sharing! I am 100% with you! I’m a year away from finishing and I *cannot wait* to graduate and have a job where the work doesn’t follow me home constantly. Like, I can’t wait to have enough free time to have more than one hobby!! It feels like there is social pressure to want to work constantly in graduate school, and my ideal work-life balance features the “life” side a little more prominently.",
      "author": "rocky_the_snail",
      "created": 1591321408,
      "upvotes": 89,
      "replies": {
        "fsxeuwe": {
          "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxeuwe/",
          "text": "You get it. I want to start reading for pleasure again! I used to be a huge bookworm and loved reading fiction. Still do but after a full work day of mostly reading that’s the last thing I want to do when I get home. \n\nGood luck, fellow psychologist!",
          "author": "SaintLoserMisery",
          "created": 1591322149,
          "upvotes": 29,
          "replies": {
            "fsxg1hj": {
              "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxg1hj/",
              "text": "I totally feel that!! I read for fun, but that doesn’t leave me time to watch the literal dozens of tv shows I want to see someday, or play any of the video games I want to play.\n\nI’m rootin’ for ya!!",
              "author": "rocky_the_snail",
              "created": 1591322838,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "fsxcl2i": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxcl2i/",
      "text": "You are not alone. I’m trying to finish my masters which is difficult because everything is shut down. All I want is for this shit to be over. I left a decent paying job to return to school. I own that and don’t regret it one bit. I got a second degree (BSc - I had a BA) to fulfill a lifelong goal, then embarked on a masters, and was seriously debating a PhD. After seeing how other students devout their lives to a career where, let’s be real, most won’t get a teaching job, moving all over the world living in shitty places with shitty pay, no thank you. I, like you, also enjoy the active research, the analytical techniques, but can’t stand the writing and the writing process. I can’t stand the publishing and academic business models. All of this to say, I’m with you 110%",
      "author": null,
      "created": 1591320848,
      "upvotes": 77,
      "replies": {
        "fsxds7g": {
          "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxds7g/",
          "text": "I will say, the academic life really can be intoxicating. It’s the glory of it all. Toiling away in your lab advancing world knowledge,  being called professor, the aura of “intellectual superiority” as a colleague once said. Academia is a weird beast. The reason why I’m saying it’s hard to admit this to myself is that it still feels *wrong* to say it. And honestly, I often feel like I am going to regret it. But the thing is, I only feel that way when I’m not actively in writing or manuscript preparing mode. I don’t want to teach anyway. I’d want to stay in research, which unavoidably means moving on to a shitty-paying postdoc after graduating. No thanks. \n\nHowever, people who are good at it and who don’t mind the crazy amount of work really love it most of the time. I think you just need to figure out whether you’re that type of person or not. I’d rather get paid.",
          "author": "SaintLoserMisery",
          "created": 1591321537,
          "upvotes": 44,
          "replies": {
            "fsyxmb5": {
              "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsyxmb5/",
              "text": ">It still feels wrong to say it\n\nThat's because there's this internalised thought-process in academia that when you do research, you can *only* do research, and *only* at academic institutions. Stepping out of the ivory tower is still seen as betrayal to many higher academics unfortunately. My supervisor has made off-hand comments about my friends taking positions in industry or management/policy/technician/sci-comm roles, as if she thinks they suddenly can't expand their career options beyond one path. I'm in Aus and although academia is probably more relaxed here than in many places, it's still insane.\n\nJust today I told my PhD supervisor that one of my friends got the industry  science management job I had applied for (we were both qualified, but my friend's a bit further ahead of me. So thrilled for her regardless). My supervisor's disappointed response: \"hmm I thought she would go into research...\" What the fuck? So she has a PhD in research but can't possibly do work in related areas? And during a situation where jobs are so hard to find due to a worldwide pandemic? Good to know my supervisor will be disappointed in my future endeavours then...\n\nThe job my friend got is 37 hours a week, full time in a small city, and pays 85-92K a year for conducting really collaborative and important work. Weekends. Holidays. No expectation to work once you leave your office. Entry level - only a bachelor's degree was required. That's the fucking dream man. Fuck the 90 billion-hour week, the publishing/funding slavery, and the academics who try to pigeon-hole you into one niche career path for the rest of your working life. After my supervisor made comments suggesting Post Docs today, I just smiled and nodded silently. No thanks. \n\nSubmitting my PhD thesis in four months, publishing my chapters for closure and planning my leave. Have multiple exit plans but times are difficult and opportunities few. Full solidarity with you here.",
              "author": "Neyface",
              "created": 1591363324,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "fsxci6q": {
      "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxci6q/",
      "text": "I did it, it's awesome making six figgies with sweet benefits. Get your plan ready.",
      "author": "Mugstotheceiling",
      "created": 1591320802,
      "upvotes": 40,
      "replies": {
        "fsxd9n0": {
          "link": "/r/GradSchool/comments/gwuv29/i_rant_i_want_to_be_completely_candid_about/fsxd9n0/",
          "text": "Mind telling me what you do? You can PM me if you don’t feel like sharing publicly!",
          "author": "SaintLoserMisery",
          "created": 1591321240,
          "upvotes": 18,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634067366
}