{
  "sid": "rdl9ga",
  "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/",
  "title:": "Is it normal to feel jealousy or insecurity when a new grad student arrives to your group?",
  "text": "Yeah my supervisor announced a new grad student was coming for next year and everyone welcomed her but I couldn't avoid feeling jealous and insecure about this.\n\nIt happens every time a new person comes... I don't know why! I don't act upon this though, I try to be supportive and welcoming, but I would like to know if I'm the only one that feels this?\n\nThank you\n\nEdit: I want to add that I think I might feel insecure because I am actually new in this field of research whereas the new students already arrive with some experience and publications. So it makes me feel like all my efforts are going to be unseen??? I honestly don't know, maybe I have to look at how I look my supervisor...",
  "author": "fallen_pillow",
  "created": 1639177499,
  "updated": 1639518506,
  "over_18": false,
  "upvotes": 167,
  "upvote_ratio": 0.91,
  "comments": {
    "ho23d7m": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho23d7m/",
      "text": "Is it normal? Probably, I think many people feel this way.\n\nIs it healthy? No. These are your allies, your collaborators, perhaps even your mentees. As the \"veteran\" grad student in the group, you get to shape the culture. You can help create a culture where grad students in your lab build each other up, rather than compete with each other.",
      "author": "public_health_nerd",
      "created": 1639182479,
      "upvotes": 177,
      "replies": {
        "ho47vc0": {
          "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho47vc0/",
          "text": "I like this answer a lot, good job nerd",
          "author": "crudestemu",
          "created": 1639228107,
          "upvotes": 22,
          "replies": {}
        }
      }
    },
    "ho2qebd": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho2qebd/",
      "text": "How long have you been there? Once you hit fifth year, instead of jealousy every every new student brings the dread that you’re the senior student now and a reminder of your advanced age 😂",
      "author": "Milch_und_Paprika",
      "created": 1639192923,
      "upvotes": 25,
      "replies": {}
    },
    "ho1v30y": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho1v30y/",
      "text": "I used to feel pretty insecure when the new cohort arrived, usually because they all seem so smart and talented and I felt so bad at what I do. For me, it would go away after I realized they were new and probably just as terrified as I did when I started. I'm happy to share more of my experiences, but I would say to reflect on why new people would make you feel insecure",
      "author": "Planetary_Piggy",
      "created": 1639178863,
      "upvotes": 62,
      "replies": {}
    },
    "ho203ho": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho203ho/",
      "text": "I’m gonna have to say that’s unhealthy and sounds possibly unfounded? If not unfounded (ie every time there’s a new student you get thrown under the bus) then maybe something you should talk about with someone if that’s the case. \n\nWhen you joined did you feel the inverse towards the other students? \n\nPersonally, I’m pretty excited when a new person joins bc that’s someone new to meet and has the chance to work with my advisor who I think is amazing. \n\nI wouldn’t say you need to feel that way, but I don’t think feeling jealous or insecure about just a new person arriving is good. Plus, students graduate and new people have to come in eventually? It never occurred to me that someone could feel this way. And from the other comments it seems more common than I initially thought. \n\nThat’s just my take, everyone is obviously entitled to their opinion.",
      "author": "crudestemu",
      "created": 1639181036,
      "upvotes": 84,
      "replies": {
        "ho3krzw": {
          "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho3krzw/",
          "text": "You might not have experienced this yet because you’re a Masters or first year PhD at most at this point (since you messaged me [less than a year ago](https://www.reddit.com/r/PhD/comments/lcfel1/advice_pursuing_a_phd_in_the_uk/) asking about applying to UK PhD programmes), so you haven’t been around long enough to experience this yet.\n\nUnfortunately, things being unhealthy doesn’t make them uncommon or unreasonable in grad school, eg working weekends. \n\nNew (PhD) students below you mean that you are becoming an old student, which means you transition to a position of less support and guidance usually. If you’re not ready for that, it may be tough.\n\nE: and it actually does seem a little founded for OP, who’s worried that they’re going to fade into obscurity or be seen as worse in comparison to newer students with (apparently) better skills. Imagine being afraid that a first year PhD might legitimately outperform you, a 4-5th year. Imagine how bad that would make you look in comparison. It’s just imposter syndrome, and you can’t possibly say that’s uncommon.\n\n\\* link",
          "author": "officially_anxious",
          "created": 1639211190,
          "upvotes": 14,
          "replies": {
            "ho47gdg": {
              "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho47gdg/",
              "text": "I’m a 3rd year grad student and have never felt this way, so I disagree with your first statement. I also didn’t say bc it was unhealthy that it was uncommon or unreasonable, I just said it hadn’t occurred to me. \n\nI guess your 3rd/4th points are fair. But I feel everyone is aware, or should definitely find out soon, that a PhD is largely a solo effort. It’s not really even about the problem, it’s about how you problem solve. Your advisor should absolutely need less time with you the longer you’re in the program, if you couldn’t stand on your own 2 feet that means they haven’t done a good job (or maybe it wasn’t really for you in the first place, hard reality but sometimes true). \n\nI don’t think that’s imposter syndrome, it can feed into it but this specific situation sounds more like an insecurity to me. I’m not saying these feelings aren’t valid, you’re 100% entitled to feel how you feel. The poster just asked for perspective and I gave mine. \n\nI do think the worry that a 1st year would outperform you is a massive confidence issue that should probably be addressed. Imagine if someone was playing basketball for the first time and you’ve been playing for 5 years. It’s insane that you would be afraid of them reaming you, they don’t even know the rules! \n\nI obviously don’t know all the specifics, nor am I a psychologist. But this sounds like anxiety more than anything to me. Which is a serious issue that needs attention. Or maybe a case of jealousy, which is human nature but usually not great.\n\nAnyway, hope OP can determine the best way to address their feelings. And same to everyone that finds themselves in a similar state of mind",
              "author": "crudestemu",
              "created": 1639227862,
              "upvotes": 4,
              "replies": {
                "ho4cfi7": {
                  "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho4cfi7/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1639230644,
                  "upvotes": -3,
                  "replies": {
                    "ho4g18e": {
                      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho4g18e/",
                      "text": "I didn’t really read the edit until now (oops), but that sounded pretty hypothetical to me tbh doesn’t seem like there’s any concrete evidence to support those fears. \n\nNgl your sports analogy makes less sense than mine. We’re not competing for position on a team, new guy comes in and is brilliant doesn’t mean you get kicked out of the group (if so that’s fucked). \n\nYea idk if you got into a program you acknowledge isn’t your area why would you be surprised some people are going to be more capable than you from the get go? Seems like that’s to be expected. \n\nI don’t think taking the perspective of the new guy is “irrelevant” if the concern stems from the new guy..? Seems like a logical comparison to me. I’m also not a first year PhD, not sure why you’ve brought that up so many times. Even if I was it doesn’t discredit my viewpoint. \n\nAt the end of the day this isn’t nearly enough context for either of us to offer any meaningful advice. We’re obviously interpreting what they’ve said differently, so unless we got more info this is pretty pointless. \n\nI will admit my advisor is more conscious of mental wellness than most so my viewpoint is probably a little skewed. But either way the only actual advice I can give, regardless of the specifics, is that if you don’t voice a concern you can’t expect anyone to know.",
                      "author": "crudestemu",
                      "created": 1639232489,
                      "upvotes": 0,
                      "replies": {
                        "ho4h3yu": {
                          "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho4h3yu/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1639233043,
                          "upvotes": -3,
                          "replies": {
                            "ho4jfwh": {
                              "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho4jfwh/",
                              "text": "I’m somewhere between a 2nd and 3rd year PhD, my situation is weird and I didn’t feel like explaining. Also, based on your logic, a psychotherapist couldn’t help this person bc they haven’t experienced this exact situation? (Yes I know training and what not etc., it’s solely a hypothetical comparison). You can’t tell me you honestly believe not having felt this way means I can’t offer an opinion. \n\nI know I’m lucky, and I can appreciate that. But when someone posts something and says “care to weigh in” I do believe anyone can voice an opinion. It’s not like I found this person on the street and started going in on them. \n\nAnyway, your comments have slowly morphed into attacking my credibility instead of my words (Ad hominem? Now that’s something I am painfully familiar with). So I’m going to vacate this “discussion”. \n\nHope you have a nice day",
                              "author": "crudestemu",
                              "created": 1639234205,
                              "upvotes": 2,
                              "replies": {
                                "ho4rjuk": {
                                  "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho4rjuk/",
                                  "text": "‘Someone else disagrees with me so they must be lying about their student status’ is a very weird take for someone doing a PhD! I also find the jealousy odd and I’ve just submitted so I agree with you.",
                                  "author": "fjkfjldsls",
                                  "created": 1639237956,
                                  "upvotes": 2,
                                  "replies": {
                                    "ho4uh1t": {
                                      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho4uh1t/",
                                      "text": "I know right? Lots of conclusion jumping, multiple times too. \n\nYea I mean it’s a natural human emotion, so it can happen. It just seems to be more in their head than based on actual events. Any how congrats on submitting!",
                                      "author": "crudestemu",
                                      "created": 1639239240,
                                      "upvotes": 2,
                                      "replies": {}
                                    },
                                    "ho4x6bw": {
                                      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho4x6bw/",
                                      "text": "I don't think they're lying because they disagreed with me, I thought they were lying because we've actually spoken before, and they told me they were a Masters student. Since that was less than a year ago, it doesn't make sense that they would have gained 3 years of PhD experience in the last 10 months.",
                                      "author": "officially_anxious",
                                      "created": 1639240398,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                },
                                "ho4x0d9": {
                                  "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho4x0d9/",
                                  "text": "Then why did you tell me <1 year ago that you were a Masters student?",
                                  "author": "officially_anxious",
                                  "created": 1639240327,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ho3g3h1": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho3g3h1/",
      "text": "I was in a lab where the newest person was always put on a pedestal and the people who were actually publishing and wrapping up were devalued, so that was weird both coming and going.",
      "author": "MercuriousPhantasm",
      "created": 1639207641,
      "upvotes": 10,
      "replies": {}
    },
    "ho284xk": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho284xk/",
      "text": "No… Typically I feel excited by the addition of new potential collaborators and conspirators",
      "author": "isaac-get-the-golem",
      "created": 1639184596,
      "upvotes": 24,
      "replies": {}
    },
    "ho32mbd": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho32mbd/",
      "text": "I’m practically begging my advisor to hire a new grad student to help me. I’ve written several successful grants, where we now have 3 grad students worth of funded projects and he keeps being crazy stingey with all the money 😭😭",
      "author": "3Pi3ce",
      "created": 1639199116,
      "upvotes": 7,
      "replies": {}
    },
    "ho1vivz": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho1vivz/",
      "text": "It makes sense to me. You throw your entire life into meeting the expectations of your program and supervisor while sacrificing other things you care about, so when the entities that you are sacrificing for start acknowledging someone who wasn't even in the mix a day ago, it feels like a slap across the face even when it isn't.",
      "author": "ProprioCode",
      "created": 1639179054,
      "upvotes": 41,
      "replies": {}
    },
    "ho3i19p": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho3i19p/",
      "text": "Always remember that your feelings and actions are two separate things. Allow yourself to feel your feelings in a constructive manner.",
      "author": "RuthlessKittyKat",
      "created": 1639209094,
      "upvotes": 5,
      "replies": {}
    },
    "ho46cve": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho46cve/",
      "text": "These people saying it's not normal have got to be wrong. It's absolutely normal, but it's probably unjustified and definitely not for the best. I think I felt that way a time or two, but don't let it affect how you interact with them, because they don't deserve it **and** you are probably being too sensitive, meaning you have nothing to be jealous of. I still often think of myself as the most useless member of my lab because it seems like everyone else is getting so much done in a much straighter path than I had, but when we've talked about those feelings, they feel the same way I do. It's just a little impostor syndrome illusion.",
      "author": "DonHedger",
      "created": 1639227196,
      "upvotes": 4,
      "replies": {}
    },
    "ho23eax": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho23eax/",
      "text": "Yes. \n\nOne phrase that I try to live by - rather than just blindly repeat and forget - \"comparison is the theft of joy\". I try not to lie to myself all the time.",
      "author": "deadcatdidntbounce",
      "created": 1639182492,
      "upvotes": 17,
      "replies": {}
    },
    "ho2sojl": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho2sojl/",
      "text": "Yeah but then that is usually overtaken by the feeling of wanting to make them feel included",
      "author": "Itsavoid33281",
      "created": 1639194027,
      "upvotes": 5,
      "replies": {}
    },
    "ho3hvph": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho3hvph/",
      "text": "absolutely a normal way to feel, I don't understand people saying that it's something to be concerned about lmao. In life generally, insecurity, competition, and jealousy probably go hand in hand. don't be too hard on yourself, these are extremely normal and human ways to feel. don't act on them obviously and over time, I'm sure your new lab member will grow on you! everyone has their own distinct strengths and weaknesses and maybe reassuring yourself about your own strengths will help (also at some point, I swear the new member will look to you for help/as a mentor figure, and putting that kind of small investment into developing someone can take away feelings of jealousy)",
      "author": "knowuow",
      "created": 1639208982,
      "upvotes": 3,
      "replies": {}
    },
    "ho3kb1k": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho3kb1k/",
      "text": "Never heard of anyone feeling this. I'm usually excited to work with someone new and see what they're like. What on earth are you jealous of? Insecure about your abilities and afraid they'll show you up?",
      "author": "Drostafarian",
      "created": 1639210835,
      "upvotes": 1,
      "replies": {}
    },
    "ho3zz9a": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho3zz9a/",
      "text": "It's human, but I am glad you are aware of it and try to behave friendly. \nI've been on the \"receiving end\" of work jealousy (not grad school, but very similar. In a professional and quite competitive environment).\n\n I got along well with somebody elses, call her Sally, superiors/close co workers, call them Anna and Adam, and it was obvious for everybody around that Sally couldn't handle it.\n\nSally was a very ambitious and competitive person, and I think she felt I was stealing her spotlight. Which I obviously wasn't, as her role and her expertise were more vital to the workplace than mine. We rarely worked together. About 90 percent of the time they did their brilliant work that was vital for the very existence of the workplace, and then I would come in and help them with communication and marketing. But without people like them, I wouldn't even have a job. I did a good job there, and I'm proud of my profession, but each workplace has its \"core employees\" and \"support employees\", and although you need highly competent people in all roles, some are more vital than others. My expertise could be changed out with any other communication person, theirs were directly related to them as people (they all had phds and amazing networks). \n\nIt got really hard, actually, as I eventually became actual friends with Anna and Adam, but every time Sally was there, she either made me feel invisible or she was straight out rude. I didn't know what I'd done. I tried everything to make her like me. I was super friendly and accommodating. The others and I were friends. But she was just ice cold.\n\nIn the end I confided in Anna - which was difficult, as they were all good friends. She told me straight out that Sally was jealous of me as I'm quite chatty and outgoing, and she's more nerdy. She was literally the star of the workplace, but for some reason she was still scared that I constituted some kind of threat and it didn't seem like she could handle it. \n\nIronically Anna and I ended up collaborating on something which was hugely successful and did wonders to her career thanks to my help with communication. This came about as we had an open and friendly dialogue and could challenge each other. I never managed to do more than the bare minimum with Sally. So this attitude can be potentially damaging to your career. You need to contribute to other people's success in order to receive something back.  \n\nSorry, you got the whole long story here, but this was really upsetting. I wish Sally had been more mature about her jealousy. I ended up giving up. When I left that place, I kept in touch with Anna, but I have next to no contact with Adam. I see all 3 of them doing fun social stuff, and I know if it hadn't been for Sally, I could have been part of their life. I feel like great potential friendship was lost as I just \"quit\" to save myself from the constant humiliation. \n\nI can also completely understand where Sally's jealously came from. We all have it in us. But it's one of those instincts we have to challenge in ourselves.\n\nI can feel the same, but I try not to see people as competition. There is enough success in the world for all of us, it's not a zero sum game. I think dealing with these feelings is what makes us mature.",
      "author": "Naivemlyn",
      "created": 1639222941,
      "upvotes": 1,
      "replies": {}
    },
    "ho48afp": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho48afp/",
      "text": "It’s normal and perfectly healthy too. What would be unhealthy is to hold on to those feelings and not move past them. A lot of our social behaviour is based on group dynamics from deep in evolutionary history. It’s normal to feel defensive and jealous when a new individual joins a group - those feelings are a part of the process of integrating the new individual and establishing a new group structure. Try to resolve the integration in a peaceful way.",
      "author": "rainbowWar",
      "created": 1639228353,
      "upvotes": 1,
      "replies": {}
    },
    "ho4hkuu": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho4hkuu/",
      "text": "Not normal no. when we got newbs we were given the responsibility of mentoring and guiding them to do some of the tasks in the lab and share in the labor.",
      "author": "rthomas10",
      "created": 1639233281,
      "upvotes": 1,
      "replies": {}
    },
    "ho2tcka": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho2tcka/",
      "text": "I am sorry you are experiencing these thoughts and feelings. It must be uncomfortable and distressing. \n\nI can't relate, thankfully. \n\nI have only felt jealous/ insecure a handful of times in my life (thankfully), but on the few times I *have* I remember that I 100% DID NOT LIKE IT. \n\nIt feels bad, painful and it sucks.\n\nI don't know how common it is, but I do know that you don't deserve to feel this way. \n\nAre you able to see a counsellor on campus so that you can work through these feelings?",
      "author": "Ok_Organization5596",
      "created": 1639194349,
      "upvotes": 1,
      "replies": {}
    },
    "ho3hcim": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho3hcim/",
      "text": "I'm always \"yay new person!\" but maybe it's different in a lab where you all work on much closer topics?",
      "author": "doornroosje",
      "created": 1639208582,
      "upvotes": 1,
      "replies": {}
    },
    "ho4lb03": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho4lb03/",
      "text": "I felt that, but then I got to know them and felt less insecure. Also when they would ask about my research, they seemed so interested, and it also decreased my insecurity.",
      "author": "sartrecafe",
      "created": 1639235120,
      "upvotes": 1,
      "replies": {}
    },
    "ho5kaa0": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho5kaa0/",
      "text": "Its hard, but better for ur mental health to not compare yourself to others. Idk ur situation, but people in my lab do very different things so its easier to not compare each other as much. Focus on ur specialty/topic/skills",
      "author": "tommiboy13",
      "created": 1639250061,
      "upvotes": 1,
      "replies": {}
    },
    "ho3yurt": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho3yurt/",
      "text": "No, I don’t understand this, sorry. I do understand feeling your efforts are unseen but then you need to promote yourself and your work more. Besides, new students with publications etc aren’t taking something away from you - you can also get publications etc but it’s down to you, other people having them doesn’t stop you getting them too",
      "author": "fjkfjldsls",
      "created": 1639222137,
      "upvotes": 0,
      "replies": {}
    },
    "ho63vmj": {
      "link": "/r/GradSchool/comments/rdl9ga/is_it_normal_to_feel_jealousy_or_insecurity_when/ho63vmj/",
      "text": "That’s very unhealthy. It’s likely a sign of some insecurity or a desire for attention or fear of someone else receiving more attention.",
      "author": "throwawayfornvj",
      "created": 1639258719,
      "upvotes": 0,
      "replies": {}
    }
  }
}