{
  "sid": "qhmyvc",
  "link": "/r/GradSchool/comments/qhmyvc/should_i_enroll_in_a_grad_school_if_im_confused/",
  "title:": "Should I enroll in a grad school if I'm confused",
  "text": "A little bit about my background. Im a cs undergrad final year with a decent profile and was planning on doing mscs in the states. But idk if I want to do CS for the rest of my life. Idk if feel this way because my undergraduate degree was a below par in terms of education or if I have genuinely lost interest. I don't really have an alternative I'm interested in. Im reluctant because of the massive debt I'll accumulate in grad school. Should I go through with grad school. Am I just overthinking. Are grad schools and a career in CS rewarding and fulfilling.\n\nIf you've done a ms in CS please let me know how your life was during grad school and how it changed after it graduating and how long it took you to repay your student loan. Thanks in advance :)",
  "author": "lupusinside",
  "created": 1635427425,
  "updated": 1635457632,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hidsgrr": {
      "link": "/r/GradSchool/comments/qhmyvc/should_i_enroll_in_a_grad_school_if_im_confused/hidsgrr/",
      "text": "If you’re going to have to pay for it, just take a year or two off. Get a job (possible the company would pay as well). You can always go back and get a master’s.",
      "author": "RoyalEagle0408",
      "created": 1635430296,
      "upvotes": 3,
      "replies": {}
    },
    "hie0zbt": {
      "link": "/r/GradSchool/comments/qhmyvc/should_i_enroll_in_a_grad_school_if_im_confused/hie0zbt/",
      "text": "Agree with the other poster. Sounds like you should work for a year or two and then make a decision. Going to grad school is not a good idea if you're not highly motivated.",
      "author": "raistlin65",
      "created": 1635433836,
      "upvotes": 2,
      "replies": {}
    },
    "hie72n1": {
      "link": "/r/GradSchool/comments/qhmyvc/should_i_enroll_in_a_grad_school_if_im_confused/hie72n1/",
      "text": "If you have a bachelors in CS, there’s not much need for a masters - in CS, a masters is just like a bachelors but almost all electives. CS masters are mostly for people who had a bachelors in something else; if you want to do the “next level”, you’d want to look at going straight to your PhD. This is a great link my advisor sent me that touches on the subject and talks about the difference between a CS masters and PhD in the third question:\n\nhttps://idleprocess.wordpress.com/2009/12/07/why-go-to-graduate-school-and-how-to-get-into-the-program-of-your-dreams/\n\nI have the opposite advice of the two other posters - I took a few years off of school and had an INCREDIBLY hard time coming back. It can be really hard to adjust to a smaller income once you’ve been making real money for awhile. I always recommend to people that if they’re going to do it, they do it now",
      "author": "FormerlyKnownIntent",
      "created": 1635436282,
      "upvotes": 2,
      "replies": {}
    },
    "hie7jjs": {
      "link": "/r/GradSchool/comments/qhmyvc/should_i_enroll_in_a_grad_school_if_im_confused/hie7jjs/",
      "text": "Go get your MBA. But essentially yes, I regret working deadend jobs for years before I went to grad school. I feel like I wasted time.",
      "author": "Chemical_Western3021",
      "created": 1635436468,
      "upvotes": 2,
      "replies": {}
    },
    "hie95jp": {
      "link": "/r/GradSchool/comments/qhmyvc/should_i_enroll_in_a_grad_school_if_im_confused/hie95jp/",
      "text": "Speaking as someone currently confused and in a program, don’t do it.",
      "author": "Fabulous_Proof7201",
      "created": 1635437105,
      "upvotes": 2,
      "replies": {}
    }
  }
}