{
  "sid": "pn13hy",
  "link": "/r/GradSchool/comments/pn13hy/should_i_applygo_to_grad_school/",
  "title:": "Should I apply/go to grad school?",
  "text": "I majored in Writing and want to go into School Psychology, so I don’t even know if I’d get in (I took a few psych classes). I have been working minimum wage and living with roommates.",
  "author": "FairRiver3",
  "created": 1631480600,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hcnahly": {
      "link": "/r/GradSchool/comments/pn13hy/should_i_applygo_to_grad_school/hcnahly/",
      "text": "If you didn't major in psychology you'll want to check with the schools you're interested in to see if you would need to take the Psychology GRE (which is common in that scenario). It's a beast so you'll need to study quite a bit.\n\nAs for whether you should go, I mean I guess that depends on what your career goals are. I always tell my students look for people who are doing what you want to do and see what qualifications they have, and to look at professional organizations that would house your career and see what they recommend. That usually gives you a pretty good idea on whether you should go and what you should do to prepare.",
      "author": "DocShards",
      "created": 1631501683,
      "upvotes": 2,
      "replies": {}
    },
    "hcmgptb": {
      "link": "/r/GradSchool/comments/pn13hy/should_i_applygo_to_grad_school/hcmgptb/",
      "text": "Your post is very vague, so it's impossible to tell what sort of chances you have at getting into specific grad programs. At least in here in Canada, psychology (including educational psychology) is a highly regulated field and thus grad programs have very strict admissions requirements including a list of undergraduate courses you need to have to even apply.\n\nI think you need to look at specific programs, look at the positions these programs could open up for you, and assess whether these positions are ones you may be happy in. You may have done all of this, but the majority of people toying with the idea of going onto further education have not done the types of research and critical thinking that I would hope to see. Where you are now should have ***zero*** impact on whether or not you go to graduate school. Don't rush into a program that you think you might like just because you are frustrated with where you are now.",
      "author": "Laovvi",
      "created": 1631487520,
      "upvotes": 3,
      "replies": {}
    },
    "hcm1352": {
      "link": "/r/GradSchool/comments/pn13hy/should_i_applygo_to_grad_school/hcm1352/",
      "text": "Well the only way to find out is to apply. You’re getting accepted",
      "author": "Thediamondinthedirt",
      "created": 1631480881,
      "upvotes": 6,
      "replies": {
        "hcm1azi": {
          "link": "/r/GradSchool/comments/pn13hy/should_i_applygo_to_grad_school/hcm1azi/",
          "text": "Yeah, true",
          "author": "FairRiver3",
          "created": 1631480973,
          "upvotes": 2,
          "replies": {
            "hcm1chu": {
              "link": "/r/GradSchool/comments/pn13hy/should_i_applygo_to_grad_school/hcm1chu/",
              "text": "You got it, you do",
              "author": "Thediamondinthedirt",
              "created": 1631480990,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634065740
}