{
  "sid": "q3fjw3",
  "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/",
  "title:": "How to people remember what they actually read?!?!?!",
  "text": "Title!\n\nI feel like whenever I read a paper, no matter how many notes I take (I use obsidian), I can never remember what I actually read. But whenever I'm in lab meeting with my other grad students they're able to cite with ease findings from other papers and link it to our work. Or my PI who has an almost photographic memory on papers (citing the author/journal mid conversation)",
  "author": "rockpooperscissors",
  "created": 1633631805,
  "updated": 1634099827,
  "over_18": false,
  "upvotes": 104,
  "upvote_ratio": 0.99,
  "comments": {
    "hfrfb8v": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfrfb8v/",
      "text": "You don't. At least, you don't read a handful of papers and expect to recall their every detail with photographic detail.\n\nRead in quantity, with regularity, and at speed. Learn how to skim a paper effectively (abstract>conclusion>intro), and use this skill to peruse a great breadth of literature, only stopping to do deep dives on the ones you find truly interesting. Consider setting up an RSS journal feed and make a habit of keeping up on it. Immerse yourself in the literature of your tiny subfield and eventually you will start to see patterns. You'll begin to recognize authors by their techniques and unique approaches. You'll start to develop a holistic understanding of the state of work in your field. And one beautiful day, there'll be a heated discussion in lab meeting and you'll realize you have pertinent literature details to contribute -- not because you tried to memorize them, but because your brain soaked up ambient science like meat in a nice marinade.",
      "author": "tpharroawdaiygm",
      "created": 1633632595,
      "upvotes": 131,
      "replies": {
        "hfucw0k": {
          "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfucw0k/",
          "text": "Really this. No one digests all the info in a paper. Eventually you’ll get efficient. I find myself reading the abstract and experimental more than anything as I’m usually trying to relate their experiment to mine, or develop some new method. The intro is a great place for learning about a new topic. Every section has its own purpose and I almost never read the entirety of it unless it’s a review paper and I’m new to the field./area",
          "author": "RichTannins",
          "created": 1633693295,
          "upvotes": 4,
          "replies": {}
        },
        "hftlws1": {
          "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hftlws1/",
          "text": "Love your response. My advisor recently told me to read one paper a day. It’s hard in the beginning but this gave me motivation",
          "author": "Ming725",
          "created": 1633670946,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hfs0ebw": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfs0ebw/",
      "text": "Hand written notes. There's something about the physical act of writing that makes details stick in our memories.",
      "author": "DJGlennW",
      "created": 1633641451,
      "upvotes": 25,
      "replies": {
        "hfsudnc": {
          "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfsudnc/",
          "text": "This. I use GoodNotes and write all my notes out by hand. I have a color coded system for note taking, (green is definitions, blue is for headings, pink for the main idea of each paragraph, purple for context notes and code, orange are my own questions, and red for very important) \n\nRead through a paragraph, then sum up the main idea of the paragraph in your own words. Having to rephrase it in your own words makes you understand it on a deeper level, and the act of writing it tells your brain that it's important enough to store in long-term memory. \n\nIt's a little more tedious than just skimming and typing - but I was able to recall relevant passages with near verbatim accuracy when I was in grad school, and it is still serving me well to this day.",
          "author": "ifpthenq2",
          "created": 1633655727,
          "upvotes": 12,
          "replies": {}
        },
        "hftecqw": {
          "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hftecqw/",
          "text": "This is because by doing the writing your brain is recalling and also reprocessing the information and continuing to connect it to prior information. By writing it you're reinforcing the memory that this info has been taken in and helping it move to long medium- or long-term memory.",
          "author": "qwertyrdw",
          "created": 1633665972,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfrfjqo": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfrfjqo/",
      "text": "Repetition really. I couldn’t recall details from a paper I just randomly read once, but when it comes to a close collaborators paper I’ve probably read them a few times and have cited them in a couple papers. So those papers I can easily tell you who wrote it when and it’s role in the field",
      "author": "FutureDrDr",
      "created": 1633632689,
      "upvotes": 11,
      "replies": {}
    },
    "hfsczp4": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfsczp4/",
      "text": "haha that's the funny part, i have no idea what i'm doing.",
      "author": "ning7",
      "created": 1633647192,
      "upvotes": 10,
      "replies": {}
    },
    "hfrr0v5": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfrr0v5/",
      "text": "The advice that my PI has repeatedly given me is,  \"Only focus on the bridges you are about to cross\". Gotta say, it has been very useful advice.\n\nYour goal is to understand the topic not the paper, the paper/a paper/any paper  is only a tool, a stepping stone in that direction. Your PI probably remembers the gist and the zinger of the paper and not the excruciating details and also it is easier to remember papers and their authors when you meet the authors in person. ( Does your PI go to a lot of conferences and seminar and is s/he active in networking?)\n\nWhenever I read something I do it to find a specific piece of information. \n\nFor example,if I want to add something to my experiment design and need direction on that then I find something as close as possible to the task at hand, find the information and move on with my life. \n\nI only keep in mind the the structure of the current input and current expected output of the step in my experiment that I am executing. Hell, I barely remember the output of the previous step and will have to look it over if that need arises.\n\nI can only comment on my own field and YMMV depending on a million factors. I am in bioinformatics.",
      "author": "Tangent_runner",
      "created": 1633637466,
      "upvotes": 20,
      "replies": {
        "hfsbq3u": {
          "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfsbq3u/",
          "text": "I really like the analogy of papers as a bridge. When I started, I couldn’t keep anything straight in the lit. Once you get more context and figure out what’s been going on out there, things sorta fall in to place and I remember the work better. \n\nI still really struggle with recalling who the corresponding author is, making it hard to retrieve said papers, but the PI has likely been working this field for some time and knows most of the big players already. That makes it easier to recall who did which paper.",
          "author": "Milch_und_Paprika",
          "created": 1633646592,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hfrp9de": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfrp9de/",
      "text": "Takes lots of practice. Once you start to get a lay of land in terms of who’s who, what they’re doing, what’s new, etc., it’ll become easier.   \n\nThink of it this way. ANY topic that you are new at will have a steep learning curve. Like I tried to get into hockey a couple years ago (gf’s family is super into it) and I struggled to remember the players’ names, positions, and teams. Meanwhile the people who’ve been watching for years will know exactly which team every players has been on the past 10 years, what their stats are, and compare plays/games to stuff that happened years ago. It’s not like they have a photographic memory, it’s just years of practice and learning that they know what’s going on.",
      "author": "You_Stole_My_Hot_Dog",
      "created": 1633636732,
      "upvotes": 6,
      "replies": {}
    },
    "hfs70b1": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfs70b1/",
      "text": "Tbh I feel like a full cup of water, someone pours more water in me and so some spills out, just a constant barrage of new information that I can't full retain because I'm so busy learning new information",
      "author": "thelaughingmansghost",
      "created": 1633644376,
      "upvotes": 4,
      "replies": {}
    },
    "hft15ru": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hft15ru/",
      "text": "Hi there, I'm a reading teacher. When you read text, you're using your working memory, which is kind of like the scrolling news ticker on TV. The information just flows past in a continuous stream and mostly vanishes.  In order to get anything into long term memory, you have to process it somehow. \n\nOne of the most effective and accessible ways to do this when you're studying is to explain it to someone else (even your cat, or the wall) using your own words.  It helps to break your reading into chunks-- subsections or paragraphs, depending on how dense the text is. \n\nYour notes can help you do this. Summarize the main ideas of each section in your own words, using just a few sentences. Then use those notes as a reference to teach someone else the material, even if you're just talking out loud to a poster. Good luck!",
      "author": "Astropecorella",
      "created": 1633659050,
      "upvotes": 5,
      "replies": {}
    },
    "hfs4x4a": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfs4x4a/",
      "text": "Handwrite",
      "author": "Normal_Kaleidoscope",
      "created": 1633643429,
      "upvotes": 2,
      "replies": {}
    },
    "hfta3rn": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfta3rn/",
      "text": "I have found that recall comes largely from repeated exposure to a paper, especially if i'm engaging with it in different ways over time. For example, I read seven papers today and only vaguely remember bits from any of them. But if I run into one of these papers again, it will be familiar enough that after reading it I will likely remember what it's about, and if I read it a third time I will most likely remember the author and at least a few key elements.",
      "author": "Weaselpanties",
      "created": 1633663519,
      "upvotes": 2,
      "replies": {}
    },
    "hfrjcp0": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfrjcp0/",
      "text": "Writing it!",
      "author": "mr_kazemiro",
      "created": 1633634283,
      "upvotes": 2,
      "replies": {}
    },
    "hftaj1j": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hftaj1j/",
      "text": "I don't, I have reference management software remember for me. I catalogue papers into folders for different types of outcomes and methods, and I assign each keywords. Then when I need to reference work related to my own, I can open the relevant folder and skim abstracts directly in the software, or search by keyword. Load PDFs of papers into your software to really streamline things.",
      "author": "heythereanydaythere",
      "created": 1633663756,
      "upvotes": 2,
      "replies": {}
    },
    "hfs0p8t": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfs0p8t/",
      "text": "!Remind me 5 days",
      "author": "impossible_wins",
      "created": 1633641581,
      "upvotes": 1,
      "replies": {
        "hfs0u0f": {
          "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfs0u0f/",
          "text": "I will be messaging you in 5 days on [**2021-10-12 21:19:41 UTC**](http://www.wolframalpha.com/input/?i=2021-10-12%2021:19:41%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfs0p8t/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FGradSchool%2Fcomments%2Fq3fjw3%2Fhow_to_people_remember_what_they_actually_read%2Fhfs0p8t%2F%5D%0A%0ARemindMe%21%202021-10-12%2021%3A19%3A41%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20q3fjw3)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "author": "RemindMeBot",
          "created": 1633641637,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hft59kj": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hft59kj/",
      "text": "Try a reading matrix to keep track of what you’ve read and make connections.",
      "author": "Letsgeticecream",
      "created": 1633661053,
      "upvotes": 1,
      "replies": {}
    },
    "hfulu7d": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfulu7d/",
      "text": "Repetition and relevancy for me. I only remember stuff that saves me time on my experiments really. Also the PI likely has met that person irl multiple times, putting a face to a name helps",
      "author": "eatmoresardines",
      "created": 1633698450,
      "upvotes": 1,
      "replies": {}
    },
    "hfuzuok": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfuzuok/",
      "text": "Personally, I have to take notes by hand. If I use any form of note taking software or even type them in a doc, I 100% will not retain it.\n\nAlso, if you can, print out what you’re reading. Annotate and take notes within the article. Easier to refer back to when looking up info bc it’s right there.",
      "author": "relativereader7692",
      "created": 1633704950,
      "upvotes": 1,
      "replies": {}
    },
    "hfva3dy": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfva3dy/",
      "text": "I have exceptional memory for written texts. It's not photographic but I can usually remember a surprising amount almost word for word, including things like around the third page, second paragraph.\n\nHowever, my memory is absolute complete shit for verbal communication. Like in one ear out the other. Most people are going to be either visual or auditory learners, but not both. So what I do for verbal information is literally write everything down. Not using a computer, but pen and paper. The act of writing converts it into information I can now remember years later in fairly good detail.\n\nWriting by hand is usually good for most people, since there's just something about motor memory. BUT if you try pen and paper notes and it's just not working, you might be an extreme auditory learner. In which case you could try reading articles out loud, or using text to speech function on your device of choice.",
      "author": "mencryforme5",
      "created": 1633709266,
      "upvotes": 1,
      "replies": {}
    },
    "hfwe67g": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfwe67g/",
      "text": "I ask the same thing. I think writing helps",
      "author": "EmelaJosa",
      "created": 1633725917,
      "upvotes": 1,
      "replies": {}
    },
    "hfwuik4": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfwuik4/",
      "text": "What is obsidian?",
      "author": "Schadenfreude_9756",
      "created": 1633732997,
      "upvotes": 1,
      "replies": {
        "hfwujtx": {
          "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfwujtx/",
          "text": "**Obsidian (; ) is a naturally occurring volcanic glass formed when lava extruded from a volcano cools rapidly with minimal crystal growth. It is an igneous rock.Obsidian is produced  from felsic lava, rich in the lighter elements such as silicon, oxygen, aluminium, sodium, and potassium.**\n\nMore details here: <https://en.wikipedia.org/wiki/Obsidian> \n\n\n\n*This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!*\n\n[^(opt out)](https://www.reddit.com/r/wikipedia_answer_bot/comments/ozztfy/post_for_opting_out/) ^(|) [^(report/suggest)](https://www.reddit.com/r/wikipedia_answer_bot) ^(|) [^(GitHub)](https://github.com/TheBugYouCantFix/wiki-reddit-bot)",
          "author": "wikipedia_answer_bot",
          "created": 1633733013,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfxajuz": {
      "link": "/r/GradSchool/comments/q3fjw3/how_to_people_remember_what_they_actually_read/hfxajuz/",
      "text": "Cue card summary of each article. 1 cue card = 1 article. Keep a whole stack and review 'em on your commute.",
      "author": "funkykookaburra",
      "created": 1633740694,
      "upvotes": 1,
      "replies": {}
    }
  }
}