{
  "sid": "r1dyjv",
  "link": "/r/GradSchool/comments/r1dyjv/grad_school_gift_giving_etiquette/",
  "title:": "Grad school gift giving etiquette",
  "text": "I love gifting people things. I am very close with the prof who’s class I help TA, and I thought of the perfect gift to give her for the holidays. But, I don’t want to gift her something and not get my own MSc supervisor as well (plus, he deserves it). I’m also thinking that it would be nice to get the other two members on my thesis committee something small too.\n\nWhat is the etiquette around gifting faculty members you have a relationship with? Will this seem weird to some? Will they feel bad or awkward for not getting me something in return? All of these people have helped tremendously through my grad career and I want to say thank you, but I don’t want to overstep boundaries. Any thoughts?\n\n(As a side note: anyone have gift ideas for academics? For better context, we are epidemiologist)",
  "author": "amipregananant",
  "created": 1637784461,
  "updated": 1638208028,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hlzxe5m": {
      "link": "/r/GradSchool/comments/r1dyjv/grad_school_gift_giving_etiquette/hlzxe5m/",
      "text": "I may be outside the norm but I do not like receiving gifts from students.  I may be uptight about it but it really does pose an ethical dilemmas.  We are not supposed to accept gifts from students because of the appearance of favoritism.  Whether there is or is not favoritism is beside the point.  It can also lead others to feel compelled to give a gift which sets up a weird dynamic .  \n\nHonestly for me what is worth a lot more is a thank you card or genuinely telling me why you appreciate working with me.  I don’t in anyway expect thank you cards but when I receive them they are cherished. In other words, put your gift into words.  I promise you that professors everywhere pull them out and read them to remind themselves of why they do what they do when they’re having a bad day.  It may sound curmudgeonly so disregard if you please but that’s my take.",
      "author": "DicaxErsatz",
      "created": 1637815833,
      "upvotes": 5,
      "replies": {}
    },
    "hly3uxq": {
      "link": "/r/GradSchool/comments/r1dyjv/grad_school_gift_giving_etiquette/hly3uxq/",
      "text": "A few of my professors this semester have accommodated me immensely during some really tough life stuff, so I'm giving them all my husband's favorite coffee, homemade baked goods, and a painting from my mom as it has affected her as well. She, a former professor and dean herself, has seen no issue with this. I also plan on getting my favorite professor a very special thank you gift once I finish my program (for reference, this ridiculous woman, a very successful PhD, is back in school to be a vet tech in retirement, so I'm either getting her custom bandage scissors/suture scissors or giving her my own custom set I no longer need). I don't think it's weird at all, especially because it can sometimes be a thankless job. As long as it's not something outrageous I think it's totally appropriate and appreciated.",
      "author": "signedizzlie",
      "created": 1637786662,
      "upvotes": 3,
      "replies": {
        "hly5pws": {
          "link": "/r/GradSchool/comments/r1dyjv/grad_school_gift_giving_etiquette/hly5pws/",
          "text": "Those are all such thoughtful gifts! I really like the idea of giving things that are homemade, thanks for the great ideas!",
          "author": "amipregananant",
          "created": 1637787396,
          "upvotes": 2,
          "replies": {
            "hly6e4o": {
              "link": "/r/GradSchool/comments/r1dyjv/grad_school_gift_giving_etiquette/hly6e4o/",
              "text": "You're welcome! Enjoy your gift giving! :)\n\nPS i love the username lol",
              "author": "signedizzlie",
              "created": 1637787659,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlyug4p": {
      "link": "/r/GradSchool/comments/r1dyjv/grad_school_gift_giving_etiquette/hlyug4p/",
      "text": "I think handcraft is one good choice, since you have to put some effort and artistic idea in it.",
      "author": "ParlorPink",
      "created": 1637797693,
      "upvotes": 1,
      "replies": {}
    },
    "hmfha8a": {
      "link": "/r/GradSchool/comments/r1dyjv/grad_school_gift_giving_etiquette/hmfha8a/",
      "text": "I say don’t give gifts. You might have good intentions, but it has so many issues with the power dynamics in academia. For example, it’s for this reason why most programs are forbidding students from buying committee members food/coffee at update meetings. A handwritten card is great. But not a purchased “gift.”",
      "author": "Tritagator",
      "created": 1638124653,
      "upvotes": 1,
      "replies": {}
    }
  }
}