{
  "sid": "r4wufp",
  "link": "/r/GradSchool/comments/r4wufp/what_happens_to_rejected_scholarships/",
  "title:": "What Happens to Rejected Scholarships?",
  "text": "Hi,\n\nI was thinking about scholarships and now I'm down in this rabbit hole. \n\nOften when you apply for a funding/scholarship, the application form that you use is the same form you use to apply to get the study place itself. And the offer that you get from the school is either \"accepted with no funding\" or \"accepted with a funding.\"\n\nLet's say I apply to two schools, A and B. School A is my preferred choice. I am accepted into both schools. However, only school B gives me the funding. Both schools' response deadlines are May 10. I, as an asshole, wait until May 7 or 8 to respond to school B, accepting the funding. However, school A contacts me on May 9 saying, \"congrats, we actually want to offer with the funding now.\" So, I as an asshole, accept school A's new offer. \n\nWhat happens to the funding from school B? How do I tell school B? I assume schools just pick the next best applicants. But from which pools -- the next best applicants who have already accepted the study places OR the next best applicants who do not yet respond to the pending offers (May 9 is still within the deadline)? And at this point, assuming late into the year, wouldn't most students be already settled with their study places?\n\nDoes anyone have a similar experience? >.<",
  "author": "meeteetp",
  "created": 1638195614,
  "updated": 1638207942,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmjm62d": {
      "link": "/r/GradSchool/comments/r4wufp/what_happens_to_rejected_scholarships/hmjm62d/",
      "text": "It depends on who the funding source is. If we're talking about an internally funded provided by the school itself, then it's usually just in a general account devoted specifically to tuition/scholarship funding for students. If it was tuition reimbursement for doing research, it's not unheard of to see a section devoted for a student assistant on a research grant in lieu of traditional employee payment/benefits.\n\nOccasionally you might have accounts set aside for specific gifts if say someone decided to make an individual donation and have specific things they want the donation used for. It happens a bit in hospital finances too where a patient might make a donation to their physician as an extra thanks for their procedure going well or because they were especially pleased with their care.\n\nIf it's a separate entity providing the scholarship then they'd usually just do the same process of storing the funds but just apply them at a later time mid semester, so it won't necessarily mess someone up.\n\nJust be direct and say something else came up and you don't plan on attending since you won't be. You don't have to go into detail as to why. they're usually going to just either reach out to someone else or hold the funding for a later time period if need be. It's not impossible to retroactively apply funding as circumstances change, so these things happen quite often in unis. Even if someone is settled mid semester, it doesn't mean they can't apply funding changes or make changes in circumstances.\n\nUsed to work in this field and this kind of thing is a fairly frequent occurrence.",
      "author": "BSWolf777",
      "created": 1638202304,
      "upvotes": 1,
      "replies": {}
    }
  }
}