{
  "sid": "rb3lqm",
  "link": "/r/GradSchool/comments/rb3lqm/undergrad_looking_for_grad_programs/",
  "title:": "Undergrad looking for Grad programs",
  "text": "I am set to graduate in spring 2022 with a B.S in Integrative Organismal Biology having already obtained a minor in chemistry (with a focus in organic and biochem). My interests include organismal bio, ecology, behavioral ecology, entomology (primarily with Hymenopterans), evolution, and genetics. I am located in Northeast Pennsylvania and would like to go to school in and around the area, open to going to New York and New Jersey. If anyone knows of a really good program else where I’m open to that as well, even if it’s clear across the country. Interested in M.S and doctorate programs anyone may know about or grants/funding that may be good for me to apply for !! thank you all",
  "author": "bave_the_sees",
  "created": 1638897395,
  "updated": 1639518824,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hnm5p0k": {
      "link": "/r/GradSchool/comments/rb3lqm/undergrad_looking_for_grad_programs/hnm5p0k/",
      "text": "While you might be lucky and have someone from the field respond to this thread, I think you should start by going to professors in your current school who have a knowledge of the field and the schools that are available for you (and can be a good connection to help you be accepted to these programs). Otherwise, open a journal online about organismal biology or ecology and start opening articles that sound cool (even if you're paywalled) until you see an article from a local university.",
      "author": "venona",
      "created": 1638898126,
      "upvotes": 1,
      "replies": {
        "hnm8r2w": {
          "link": "/r/GradSchool/comments/rb3lqm/undergrad_looking_for_grad_programs/hnm8r2w/",
          "text": "My professors have recommended quite a few good schools for me ! and I contacted said schools already too. This post is more of a catch-all to see if anyone else may have some advice or know of any opportunities. I will try looking through the journal articles thank you!",
          "author": "bave_the_sees",
          "created": 1638899467,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}