{
  "sid": "rbkryp",
  "link": "/r/GradSchool/comments/rbkryp/contacting_advisors/",
  "title:": "Contacting advisors?",
  "text": "The more I learn about how to apply for a Ph.D. the more concerned I am. I'm from El Salvador, in comparison, it's a really poor country. I have absolutely no way of paying for graduate studies in developed countries so I would need to be accepted through a fully-funded scholarship. There are no laboratories related to what I want to study in the whole country (Astrophysics), the closest thing we have is an observatory that belongs to this one university, to which I have tried contacting the staff, didn't get an answer, then tried just dropping in unexpectedly, which also failed, THUS I have cero lab experience relevant to my field (I was an intern at my own university's laboratory tho it's called a *nanotech lab* so not really space-stuff lab experience), and no publications or presentations. Trying to solve this problem I think my next move is going to be just going to RH directly asking for at least an internship there.\n\n&#x200B;\n\n**I wanted to contact an advisor to get any feedback on my situation but all google results point out that I should already meet all those criteria so I can even just call the advisor's attention.**\n\nStudents are considered for admission without regard to who they are, based purely on their potential. So, no consideration for students from a poor no-interest-in-scientific-progress country?",
  "author": "Duardo_e",
  "created": 1638945004,
  "updated": 1639518587,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hnrs0eu": {
      "link": "/r/GradSchool/comments/rbkryp/contacting_advisors/hnrs0eu/",
      "text": "Have you only looked in the US?\nI'm in Europe where education is free many places. In some countries, phds are paid relatively well. I'm not sure what it's like with visas, but positions are posted on job boards, and if you find one that suits you, you could contact the international office at that particular university for advice. (Via email, unless otherwise stated - not social media.)",
      "author": "Naivemlyn",
      "created": 1638999562,
      "upvotes": 2,
      "replies": {
        "hntn6sh": {
          "link": "/r/GradSchool/comments/rbkryp/contacting_advisors/hntn6sh/",
          "text": "Thanks, you're right. Maybe first contacting an office for international students is a better idea than going directly for an advisor. Im pretty new to all of this. Education in other countries seems very different.",
          "author": "Duardo_e",
          "created": 1639031138,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}