{
  "sid": "r0astu",
  "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/",
  "title:": "I just had the most awful meeting. I'm probably going to get fired.",
  "text": "My Masters was excellent. I won an award for brilliance. But my PhD has been nothing short of one misfortune after another.\n\nIt got off to an alright start, but I never got on with my colleagues. They bullied me to the point I didn't even sit with them in the cafeteria anymore. That really just set the whole shitshow that has been my PhD in motion, really.\n\nI really didn't like the project I was assigned. It was very dull. But I got on with it. The theory was very interesting, but my day-to-day experiments were just such a slog. I came home every day miserable, but I got on with it anyway.\n\nThen came covid. \n\nMy lab shut down in March 2020, and it was shut for months and months, during which time I like many reverted to a teenager. No longer was I a lab rat, I was the house maid.\n\nThe lab re-opened in August, and I started to get back into it. \n\nJust two weeks after I got back into the lab, my father passed away very suddenly. I had to rush back and suspend my PhD for several months. For 7 months, I stayed at home completely isolated, once again the house maid. During this time, I developed severe mental health issues, including severe anxiety and depression from all the isolation.\n\nWhen I FINALLY came back to work in April, I was totally out of the rhythm of working, having panic attacks most days, and in the end I just couldn't show up to work anymore. But still I kept trying to muscle on.\n\nBut my mental health has just kept deteriorating, and I've been missing more and more days, sometimes not going in at all for an entire week.\n\nToday, my lack of progress really caught up with me. Hard.\n\nI had the most AWFUL meeting. All seven of them just looked at me with great contempt and disappointment. They outright stated they were really not happy with me. My performance was awful, and I had no report to present. This is what really pissed them off. They also got upset with me for not replying to certain emails.\n\nIt was absolutely awful. Every second of the meeting was awful. I could feel them staring into my soul. As the meeting finally came to a close, my boss was just shaking his head. They all looked gravely concerned.\n\nI'm going to get fired, I just know it. A few months ago I had another meeting that went almost as awful, and I tried to resign after receiving a very concerned email from them. But they convinced me to stay, so I didn't resign.\n\nBut now I'm going to get fired. I just know it. From how unbelievably awful awful AWFUL that meeting went. I mean he was literally shaking his head! How badly do you have to fuck up for that?!\n\nMy whole PhD journey has been shit from almost start to now. My mental health has rapidly deteriorated from all the SHIT I've been through in my personal life throughout, and now it's crunch time and I'm going to get fired. Fuck me man they should've just let me leave when I resigned. Now I'm going to get fired and have no reference and no fucking future. Who in my prestigious field is going to hire a guy that was literally fired from a PhD?!\n\nFuck. I feel today marks the end of my career and I had better find another purpose in life.",
  "author": "FeelThePower999",
  "created": 1637665225,
  "updated": 1639880846,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.79,
  "comments": {
    "hlrzhrj": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlrzhrj/",
      "text": "Take a deep breath.\n\nYou said you've had severe anxiety and the way you've written this reminds me of the circular thinking that I get into when I am having a panic attack. \n\nAs you said at the beginning of your post- the past two years have been A LOT. It sounds like your department knows this. Do they know how much you have been struggling? If you feel safe sharing that with them, now might be the time.\n\nAlso, see if your university has mental health resources. You need support right now and they will be able to at least get that support system started. \n\nYou had a bad meeting, it happens. You probably aren't going to be fired. It's going to be okay.",
      "author": "Umbramy",
      "created": 1637681381,
      "upvotes": 11,
      "replies": {
        "hltvuze": {
          "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hltvuze/",
          "text": "Came here to say this, some universities offer fantastic mental health services including free therapy. Particularly to students in crisis, which it seems very clear that you are. If you reach out to them be sure to mention the daily panic attacks and the death of your parent specifically. Both of those are giant red flags that should motivate them to help.",
          "author": "lacroixluva",
          "created": 1637708499,
          "upvotes": 13,
          "replies": {}
        },
        "hlu8efk": {
          "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlu8efk/",
          "text": "Yep, all of this!",
          "author": "coyotesandcrickets",
          "created": 1637714184,
          "upvotes": 4,
          "replies": {}
        },
        "hlv0da8": {
          "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlv0da8/",
          "text": "I also had this feeling while reading. I've also been in this spot before (granted, not with a PhD program, but still), and the best thing I did was COMMUNICATE. Tell your bosses, advisors, etc that you have literally been too depressed and anxious to do anything (on top of everything else going on). Tell them the truth. As hard as it can be, it at least gives them the chance to make a decision based on what actually is happening and not off of the assumption that you are a bad person, or are intellectually deficient, or aren't worth helping—because you're not.\n\nYou are a good person, a smart person, and deserve help and love and grace. And you have gone through *a lot*. You'll be okay, friend.",
          "author": "callednotqualified",
          "created": 1637727594,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlrzmtz": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlrzmtz/",
      "text": "Foremost, you’re not getting “fired” unless they tell you so. Even if they did, is that necessarily a bad thing? It sounds like this might not be the lab or the moment for you to finish your PhD - and that’s okay.",
      "author": "paintedtigerz",
      "created": 1637681440,
      "upvotes": 10,
      "replies": {
        "hlt60g3": {
          "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlt60g3/",
          "text": "This is such a nice and pleasant way of saying it rather than what I had in mind, which is somewhere along the lines of 'maybe some of that bullshit you smell is under your own shoe'.",
          "author": "gergasi",
          "created": 1637698083,
          "upvotes": -170,
          "replies": {
            "hltapww": {
              "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hltapww/",
              "text": "Do you really think this is worth saying? It is far from being kind and considerate.",
              "author": "TheBringerOfOldLight",
              "created": 1637699936,
              "upvotes": 88,
              "replies": {
                "hlthedf": {
                  "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlthedf/",
                  "text": "Not to mention this person seems keenly aware of their own work. It's not like they're saying everyone else in the program is terrible and doesn't contribute. They talk a lot about their own mental health and ability to do the work in this post, it's not one that calls for the \"look at yourself\" advice like that.",
                  "author": "notanothpsychstudent",
                  "created": 1637702550,
                  "upvotes": 64,
                  "replies": {}
                }
              }
            },
            "hluzreq": {
              "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hluzreq/",
              "text": "Fuck you.",
              "author": "callednotqualified",
              "created": 1637727277,
              "upvotes": 12,
              "replies": {}
            }
          }
        }
      }
    },
    "hls3iz0": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hls3iz0/",
      "text": "Sounds like you have shitty lab mates and a shitty professor. I agree it's unlikely that you'll get fired. They'd have to make everything official and then you more or less hold up the shit cards you've been dealt recently and no university with a functioning brain would let them fire you for fear of public backlash for treating you like shit. \n\n&#x200B;\n\nBesides absolute worst case scenario being fired is not such a big deal, you just phrase it a bit more eloquently on your resume. You say withdrew due to dispute. Being a PhD isn't a traditional job it's more than fair to not call it getting fired. Then you can tell your tail to any potential employer or another potential supervisor if you had to change things up and start under someone new. 98% of people are going to look at you more favorably than your former lab mates. Yeah you'd have to share a lot more personal details with a potential employer/ PI, and that may make you uncomfortable, but it's not the end of the world. \n\n&#x200B;\n\nAlso to help through commiseration/ advice for turning things around. I had a bad meeting with my supervisor last year, she was upset with how long things were taking (She had assigned me stuff outside my field and I was having to learn stuff completely unrelated to my studies). She sat me down on the floor with her dog and I could tell from her tone that she was trying to give a you're a good student, I'm not angry just disappointed speech. If you can manage it in those scenarios the best thing to do is to lean into it and HARD. Be like yeah I'm also super upset with how long these things are taking, I'm not happy with my progress, I've been dealing with X, Y, and Z, and things have been taking me WAY more time than I'd expect. Pulling this with my supervisor the talk actually turned into a bonus, don't expect that if you're not good at acting, but leaning in makes it REALLY hard for someone to cast blame cause it forces them to acknowledge their responsibilities to you. Your supervisor bringing that up in a group was horrifyingly inappropriate and not at all okay, even if you were in the wrong, which from your description you certainly aren't. Leaning in effectively defangs criticism cause it forces collaboration into the conversation and really makes it difficult to blame the person for the perceived short fall.  \n\n&#x200B;\n\nRegardless it will all be okay in the end, regardless of how it washes out.",
      "author": "dmatkin",
      "created": 1637683028,
      "upvotes": 3,
      "replies": {
        "hlsp445": {
          "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlsp445/",
          "text": "Devils advocate but it seems OP hasn’t really done any lab work for quite some time. I kinda get why his peers would be angry. I’ve worked on group projects and nothing pisses me off more than that one person who doesn’t do anything. OP had good reasons, though I think it would’ve worked for everyone if OP was dropped from the project long ago.",
          "author": null,
          "created": 1637691483,
          "upvotes": 21,
          "replies": {
            "hlynhqc": {
              "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlynhqc/",
              "text": "Yeah, I don't think they should have been dropped. But probably have taken more time after their fathers death. Their peers being frustrated is reasonable, but angry not so much, at least in my eyes. I'd hope that if someone in your group project had a parent die, them being essentially useless wouldn't be such a stick in the side.\n\nLike I understand the perspective and if they were refusing to communicate the issue, or lying about the teams responses (The team has tried to work with them but they've shut that down, the team tried to welcome them but they shut that down) then they're an asshole. But if they said their father died, and then the team didn't look at the lack of performance as primarily a mental health issue. Then I flat out don't like the team, they should be working with OP not against them to help them get back into their work.",
              "author": "dmatkin",
              "created": 1637794586,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hlt5z98": {
          "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlt5z98/",
          "text": "> Sounds like you have shitty lab mates and a shitty professor. \n\nI don't think you can put the blame on the lab mates and professor. Put yourself in their shoes. In my program, OP would have been gone long before now. Sounds like he basically disappeared for a year with little to no effort and then expected everyone to be OK with it. I mean, who shows up to a committee meeting without even some kind of presentation? Even an explanation of why nothing worked and an outline of the steps you'll take to fix it is better than nothing. \n\nI think OP dug his own grave here.",
          "author": "Virian",
          "created": 1637698071,
          "upvotes": 20,
          "replies": {
            "hlx472k": {
              "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlx472k/",
              "text": "Yeah... no. I vehemently disagree. If someone in your lab isn't pulling their weight, they're gonna get kicked out reasonable right. Hell NO,\n\nThat's what being a decent person is about, this isn't a grade school, you don't get pissy cause things aren't going your way. If someone isn't pulling their own weight you talk to them, figure out what's wrong. They got into the program same as their lab mates. If your team mate is going through an inordinate amount of family shit you give them a pass, you help them get back on track, you don't dismiss that as not your problem and say well you're clearly not doing your job. We're not school children, being a decent human being is about accommodating the horse shit life throws at people some times, cause we hope they'll accommodate us when the horse shit flies our direction. Even if they don't share unprompted, as soon as you notice something that concerns you, they should have asked OP about it \n\nYeah OP should have had a conversation with their supervisor well in advance of the meeting happening to try and get back on track, find a plan that worked, go talk to a therapist, they don't take no blame. But the duty ultimately falls on the supervisor to deal with situations like this in a prompt and professional manner. From my reading it wasn't a committee meeting, but instead a lab meeting (At least from my reading), so regardless of anything else, even if OP was fully to blame dealing with that as a group is not discipline, it's not feedback, that's fucking bullying to group up the rest of the lab against one individual. And if it was a committee meeting, a decent PI should be at least somewhat aware of what's going on and address this sort of issue LONG before the committee meeting, having a conversation in private to address the issue. \n\nYeah if there have been attempts to discuss this issue with OP that aren't listed here then I take back everything they're shit abusing reasonable understanding and trying to play the victim. But from the sounds of it, their lab mates never really wanted them around, made no attempts to integrate them into the team, then when they had deaths in the family ignored that fact, ignored signs that their team member was struggling with mental health issues, did nothing, then proceeded to gang up and berate them. This is at a minimum completely incompetent management of the lab, at worse malicious negligence against OP.",
              "author": "dmatkin",
              "created": 1637772689,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hlt7y3t": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlt7y3t/",
      "text": ">A few months ago I had another meeting that went almost as awful, and I tried to resign after receiving a very concerned email from them. But they convinced me to stay\n\nSo, you had a bad meeting before and thought they were going to fire you, and their response was \"no, don't quit.\" Maybe you're overreacting to these meetings.",
      "author": "notifyoulikefish",
      "created": 1637698849,
      "upvotes": 52,
      "replies": {
        "hlu74pp": {
          "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlu74pp/",
          "text": "Honestly, I'm guilty of this, too. I had a meeting with the chair of the graduate committee because I'd been struggling and hadn't shown any progress, and for a *week*, I was worried that he was going to tell me I was kicked out of the program. Anxiety is a b****. It's hard to remember that the committee is there to help you sometimes",
          "author": "inverts_nerd",
          "created": 1637713592,
          "upvotes": 9,
          "replies": {}
        },
        "hlwx1ff": {
          "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlwx1ff/",
          "text": "It was more a case of the first awful meeting and concerned email was the final straw for me, rather than me resigning because I was worried of being fired.",
          "author": "FeelThePower999",
          "created": 1637769843,
          "upvotes": 1,
          "replies": {
            "hlxc0q0": {
              "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlxc0q0/",
              "text": "Don't sweat it. If it's really a problem and you can address it, then address it and it's not a problem. If it's a problem that you can't do anything about, then it's out of your hands and not a problem. You're good.",
              "author": "notifyoulikefish",
              "created": 1637775737,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hltmvzw": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hltmvzw/",
      "text": "As someone who also lost a parent during grad school and also had to take a few months off because of it... You don't just, like, recover from that. It's not that simple. Let alone covid. Let alone mental health issues. I hope your advisor is understanding enough that you can tell him about some of these things and maybe take a break and then give it a go after a short leave of absence or something.\n\nIn addition... Get a therapist. It will help so much.",
      "author": "DishsoapOnASponge",
      "created": 1637704727,
      "upvotes": 34,
      "replies": {
        "hlu6cfp": {
          "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlu6cfp/",
          "text": ">Get a therapist. It will help so much.\n\nI second this! I'm still in the middle of a master's program, but I went through a really awful summer. I took a step back from research and got a therapist to focus on my mental health. The grad committee isn't super thrilled that I have no real progress, but I feel better equipped to handle research and my personal struggles. I hope you get the help you need. I would also recommend being as open as you feel comfortable with your advisor about what's going on in your life. They can't help you if they don't know why you're struggling.",
          "author": "inverts_nerd",
          "created": 1637713228,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "hlsww1e": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlsww1e/",
      "text": "My dude. They are concerned that you need help. Ask them for some. Explain the problem. Most if not all of them I am sure are mentally come at you from a positive place.\n\n You will be ok. \n\nJust speak honestly about your situation and make a concrete plan to do better with specific steps that you can do each day. You can do this kid. Just hang in there. Make a plan. Get buyin on the plan. Execute the plan. Write up the plan.",
      "author": "LegallyThrownFarAway",
      "created": 1637694491,
      "upvotes": 67,
      "replies": {}
    },
    "hlstb69": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlstb69/",
      "text": "[deleted]",
      "author": null,
      "created": 1637693102,
      "upvotes": 79,
      "replies": {
        "hlti6dw": {
          "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlti6dw/",
          "text": "Honestly, OP still has a masters degree. I think that’s pretty impressive and absolutely nothing to scoff at. Now might not be the best time in your life for you to get your PhD, maybe this lab isn’t the best place to do it. It’s *far* from the end of their career. It might feel like it’s the end of the world because it’s a low point right now, but in a few months or a year, things *will* be ok.",
          "author": "happytransformer",
          "created": 1637702862,
          "upvotes": 23,
          "replies": {}
        }
      }
    },
    "hlth6zr": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlth6zr/",
      "text": "Mental health is a very important part of your health, and right now you’re having health problems. Of course you’re not performing well! It’s like trying to run a marathon on a broken leg. You can’t do your best work, and you know that based on the difference between your master’s and your current work. \n\nYou need support for your mental health right now, and you need reasonable accommodations to keep moving forward in your work (assuming you’re in the US, I’m not familiar with how that works elsewhere). \n\nTreat this like the urgent health issue that it is. Please reach out to your doctor, university mental health resources, your therapist, whatever you need, and then please document this with your university’s disability office or equivalent. The accommodations you need to do your work are the same as someone wearing glasses in a classroom. They’re not a big deal, and you may need them to get your work back on track. \n\nIf you need help finding a therapist, I’m happy to offer advice. If you want someone on the phone with you while you call student mental health services, PM me. I’m very serious about that. The first steps to getting help can be hard. \n\nEven more than staying in this graduate program, you deserve to feel better. I know you love what you do and you’re dedicated to it, but always remember that *this is a job*. It’s not who you are, it doesn’t define your worth as a person. I mean, I leave these comments on threads not because I care about grad school, but because I want people to get help when they need it. \n\nIt’s also not a personal failing that you’re dealing with this. The last couple years have been tough generally, but you’ve really had a hard time. Of course you’re struggling, who wouldn’t be? I am so very sorry about your dad.  \n\nUltimately, maybe this lab isn’t the right fit for you, or maybe you need some time away to work on your health. If that happens, *that’s okay*. I think if you had a friend in your situation, you’d tell them that. You’d love them the same, support them, and wish them nothing but success. Remember to treat yourself with the same kindness.",
      "author": "StringOfLights",
      "created": 1637702469,
      "upvotes": 13,
      "replies": {}
    },
    "hltopy7": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hltopy7/",
      "text": "Sorry to hear. Remember that you are not your PhD, you are an individual person with unique needs. Sounds like maybe it would be healthy for you to step away from the lab at the current time. If you think you still want to continue the work in this lab, perhaps you can request a leave of absence due for mental health reasons? That could get you out in front of the firing you are worried about and give you a chance to get back to being productive once you are in a better place mentally. Today does not mark the end of your career, it is a bump in the road. And i doesn't sound like the group is very supportive of you, scolding you for lack of progress rather than asking you what's going on and how they can better support you. Please take care and best of luck.",
      "author": "jburkek",
      "created": 1637705468,
      "upvotes": 9,
      "replies": {}
    },
    "hltrzlv": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hltrzlv/",
      "text": "When I finished my undergrad I was pretty burned out from stress and overwork (probably not to the degree that you are at the moment) so I had no ambitions for graduate school at the time. Strangely enough, I found getting a normal 9-to-5 job  and just working 8 hours a day and going home to relax and sleep for a couple of years to be incredibly therapeutic. I think that after academic pressures, sometimes just being a working stiff can be great.\n\nIt sounds like you could use some time off from academia, but I very much recommend that you don't just stay at home to recuperate. Idleness and isolation can (as you've learned) be incredibly damaging. I'm no therapist, so forgive me for overreaching here, but it sounds like you could really benefit from a low pressure (but not \"no-pressure\") environment and a regular routine for a while.\n\nBy the way, after a couple of years of just working I gradually found my ambition getting rekindled. This took the form of starting to read nonfiction books and trying to expand my mind in my free time. Eventually after a total of 4 years off of school and with a good chunk of my student debt paid off and a decent savings account, I went back for my PhD (which I just finished a year ago).\n\nGood luck and hang in there!",
      "author": "zenmaster991",
      "created": 1637706841,
      "upvotes": 10,
      "replies": {}
    },
    "hlu9bmf": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlu9bmf/",
      "text": "I mean this in the gentlest way possible, but it sounds like you really need to focus on yourself right now. Dealing with a loss, what sounds like family trauma, and grad school related things seems like it has taken a toll on you mentally and your mental health is extremely important. Grad school isn't going to do you any good if your mental health is shit by the time you graduate. \n\nIf you do get removed from the PhD program, it doesn't mean you won't be able to find a job. Where you live would determine how much info can be revealed about that, but in the US it's not much else besides \"this person is/is not eligible for rehire\".\n\nAs others pointed out, the way you write this post seems like you struggle with anxiety. If so, I'd strongly encourage you to contact your student's mental health services. I struggle with anxiety too, and when everything is a catastrophe when you're in anxiety-mode, it is extremely hard to think straight.",
      "author": "False-Guess",
      "created": 1637714608,
      "upvotes": 11,
      "replies": {
        "hluazol": {
          "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hluazol/",
          "text": "Yes i agree. Anxiety is a common mental health issue in grad school. I have one. My therapist gave me some tools like journaling. Talking to your advisor and spelling out your problems might help too. I’d give counseling a try.",
          "author": "Cookeina_92",
          "created": 1637715396,
          "upvotes": 5,
          "replies": {}
        },
        "hlueumd": {
          "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlueumd/",
          "text": "This--I would strongly consider seeing a mental health care provider if you aren't seeing one already. Your mental health is just as important as your physical health and it sounds like you have been through a lot this past year. Take care of yourself, OP.",
          "author": "meezer_weasel",
          "created": 1637717213,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlti2hs": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlti2hs/",
      "text": "Perhaps the PhD is just not in the cards for you at the moment. You’ve been through a lot and a PhD, much less a masters degree like I’m doing, introduces a lot of stress and takes a lot out of you. \n\nBut these tough programs do require that people who are taking them have a relatively sound mind. I’ve found out the hard way that taking care of your deteriorating mental health is an absolute must and trying to do that and excel in your academics at the same time usually doesn’t go well.\n\nYou’ve likely accrued a good amount of skills during your time in the PhD program. It doesn’t like your career is over unless your field is super specific and has a very linear growth path",
      "author": "Dustin_Bromain",
      "created": 1637702819,
      "upvotes": 5,
      "replies": {}
    },
    "hltxxl5": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hltxxl5/",
      "text": "Everyone has ups and downs in life friend, but it’s a long road and sunnier days will come. Just think of what an awesome story it will make when you come out on top of life in the future! Keep doing your best, because it’s all you can do, and nobody can say you’re wrong for trying! Whatever else happens, happens.",
      "author": "koli12801",
      "created": 1637709402,
      "upvotes": 4,
      "replies": {}
    },
    "hluakx7": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hluakx7/",
      "text": "Go to counseling. Your school has it. Go. Go go go. Please? Please go and just share some piece of all this pain. Even if you think you're gonna get fired, go now while you still have access. \n\nTheres no reason not to. \n\nI went. My dads house burned down and we thought he was in it for some time and then he went missing. But like, why the fuck do we have to wait for shit like that to go? Why can't we just go?\n\nNobody has to know. Nobody knew I went unless I told them.",
      "author": "bitetheboxer",
      "created": 1637715203,
      "upvotes": 5,
      "replies": {}
    },
    "hlury7b": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlury7b/",
      "text": "I'm going to be honest with you. I was in your shoes with my MSW, I got into a bad car accident and my mental health was horrible. So horrible my sleep disorder started to emerge. I fell asleep on zoom, in a grief counseling support group session. I also experienced bullying from the other social workers, boundary testing, and racism. \n\nNot only are the expectations of higher education rediculous, but when you intern, work, and are juggling real life it's tough. You went through grief, bullying, a sudden change of life. It's okay, and you're human. I know that you probably will ruminate about it, frequently. Well, because that's what I did, I could not stop thinking about how mortified I was. I fell asleep on Zoom because I was burnt out and was experiencing hypersomnia. \n\nGettkng fired was also mortifying, but I was glad to be out of that place. I think the most important thing is having an open and honest conversation with your preceptor, to see what your next steps are. \n\nIs there a way to have a mediator present while you speak to your team? \n\nJust know you cant control what happened in the past, but you can learn from your behavior and correct it. You are not solely a PhD. You are a person, a human being. \n\nAnd as a therapist, who went through something similar. I genuinely urge you to take care of your mental health. I know ruminating and self doubt are a bitch, but you will eventually get through it. Be honest with yourself, and know when you may need to step away to take necessary self care.",
      "author": "atabey_",
      "created": 1637723390,
      "upvotes": 5,
      "replies": {}
    },
    "hm1n54q": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hm1n54q/",
      "text": "The lack of people telling you to quit this toxic workplace is concerning.",
      "author": "throwoheiusfnk",
      "created": 1637855650,
      "upvotes": 2,
      "replies": {}
    },
    "hlum8ig": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlum8ig/",
      "text": "I only read your title. I’m at a [4]. If you do get fired. It’s really going to suck but there will be life after this awful moment. This is an opportunity for something new and maybe it’s for the best.",
      "author": "GrapefruitSuit",
      "created": 1637720688,
      "upvotes": 1,
      "replies": {}
    },
    "hm8nuu1": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hm8nuu1/",
      "text": "Hey OP, how are you doing?",
      "author": "StringOfLights",
      "created": 1637989013,
      "upvotes": 1,
      "replies": {}
    },
    "hm8xztl": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hm8xztl/",
      "text": "How you doing bud?",
      "author": "LegallyThrownFarAway",
      "created": 1637995431,
      "upvotes": 1,
      "replies": {}
    },
    "hlupa7a": {
      "link": "/r/GradSchool/comments/r0astu/i_just_had_the_most_awful_meeting_im_probably/hlupa7a/",
      "text": "Contact your PI ASAP. Keep it simple, basically \"I know the meeting was a mess today, and I'm sorry. It's made me realize that I'm not OK. I need help. I'm going to contact [campus mental health service] and see what my options for support are\".\n\nThat's it. An update, no promises of timelines.\n\nYou are likely underestimating how supportive your colleagues are capable of being if they realize that you need their help.",
      "author": "SomePaddy",
      "created": 1637722134,
      "upvotes": -1,
      "replies": {}
    }
  }
}