{
  "sid": "fnl2ir",
  "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/",
  "title:": "Commencement canceled",
  "text": "I got the email this morning while I was in the middle of researching. I closed my laptop and climbed back into bed. I'm allowing myself to be sad, I need to be sad. My cap and gown are hanging up in the closet. I worked so hard it all feels like its falling apart. I havent heard from my committee in two weeks, I know they are so incredibly stressed themselves with a transition to online, but I feel like I'm in the dark with writing and research. I'm supposed to defend in May, that'll be over a Skype call.\n\nI'm so sad. And scared. It felt like my life was falling into place perfectly and then boom, life got completely flipped upside down over night. \n\nI know I'm not the only grad student going through this, I guess that makes me feel a little less alone. But that email cut so deep. \n\nTo others who may get the same email this week, we're going to be okay. We'll make it through this sucky time and it'll be ok.",
  "author": "bookish0378",
  "created": 1584974577,
  "over_18": false,
  "upvotes": 343,
  "upvote_ratio": 0.95,
  "comments": {
    "fld2ahu": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/fld2ahu/",
      "text": "I feel like commencement ceremonies should be deferred until August. Not completely canceled",
      "author": "isannelou",
      "created": 1585054640,
      "upvotes": 1,
      "replies": {}
    },
    "flc5cri": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flc5cri/",
      "text": "I feel so sad for you 😕 I understand we’re in a health crisis right now but that’s so unfair for you",
      "author": "strawberrytwizzler",
      "created": 1585020326,
      "upvotes": 1,
      "replies": {}
    },
    "flbzbye": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flbzbye/",
      "text": "This thing is eating all of our sacred cows, our hopes, dreams, and even our daily routines. I'm still dizzy from just how fast this thing has blown up.",
      "author": null,
      "created": 1585016138,
      "upvotes": 1,
      "replies": {}
    },
    "flbxiuv": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flbxiuv/",
      "text": "I hear you. Our commencement will likely be virtual. I'll be presenting virtually as well. The plus side is that I can virtually invite family from overseas.\n\nThings may still be falling into place. Sometimes they need to fall apart first and yes, it's okay to be sad.",
      "author": "InterStellarPnut",
      "created": 1585014919,
      "upvotes": 1,
      "replies": {}
    },
    "flbjjlv": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flbjjlv/",
      "text": "Got the postponement email today. They want to still have some sort of in person celebration, but honestly, my husband and I are moving in the fall (and I hopefully will have a full time position) so I don't even know if I'll be available. \n\nIt sucks. We're allowed to be sad. This year was going to be the year of milestones for me. Now I'm praying my wedding ceremony still happens (got legally married last year for the tax benefits, actual ceremony is July 18...hopefully). We're allowed to be sad. Just don't let it consume you <3",
      "author": "librarians_daughter",
      "created": 1585005947,
      "upvotes": 1,
      "replies": {}
    },
    "flbfb11": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flbfb11/",
      "text": "[removed]",
      "author": null,
      "created": 1585003453,
      "upvotes": -9,
      "replies": {
        "flbgb3w": {
          "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flbgb3w/",
          "text": "It’s not your place to determine how someone feels, this is a gross thing to say.",
          "author": "JediMasterVII",
          "created": 1585004039,
          "upvotes": 3,
          "replies": {
            "flbh4lc": {
              "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flbh4lc/",
              "text": "I feel they are being melodramatic, it's not your place to determine how I should feel.",
              "author": "drunken_doctor",
              "created": 1585004517,
              "upvotes": -9,
              "replies": {
                "flbh8v3": {
                  "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flbh8v3/",
                  "text": "Then keep it to yourself and don’t insult someone for being sad, because that makes you a dick.\n\nEdit: I was clearly commenting on your actions, and not your feelings. You’re being pedantic and also wrong.",
                  "author": "JediMasterVII",
                  "created": 1585004586,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "flb6i5h": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flb6i5h/",
      "text": "Same boat as well...it’s so disheartening after years of work, tears, and sacrifices. \n\nHell I might not even get my degree because my last clinical rotation was canceled, which in turn delays the start of my fellowship....\n\n2020 is just peachy guys!",
      "author": "Idela956",
      "created": 1584998378,
      "upvotes": 1,
      "replies": {}
    },
    "flb5blk": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flb5blk/",
      "text": "I feel you on this - 4 yrs of doctoral work and I can't defend publicly now (it'll be over a closed session video call). However, I'm thankful to be healthy and alive and to be part of a huge movement of human solidarity to protect those vulnerable in our society :) I think those of us who defend and finish our degrees during this period will be recognized for finishing our degrees during an unprecedented time in human history.",
      "author": "unmade",
      "created": 1584997692,
      "upvotes": 1,
      "replies": {}
    },
    "flb194d": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flb194d/",
      "text": "In solidarity, before all of this hit I didn’t even know if I was walking due to the tiny size of my program and none of my colleagues finishing their thesis on schedule expect for me (money was the only reason I finished on time, I’m no overachiever). \n\nNow I’m home 5500 miles away from school and my colleagues and I don’t know when I’ll be able to go back at all. I miss it every day and I’m so sad I probably won’t get to walk for this degree I worked so hard for, but life is chaos.",
      "author": "JediMasterVII",
      "created": 1584995299,
      "upvotes": 2,
      "replies": {}
    },
    "flaxa1h": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flaxa1h/",
      "text": "Take some bad ass pics in your cap and gown",
      "author": "firefowl",
      "created": 1584992991,
      "upvotes": 3,
      "replies": {}
    },
    "flawolc": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flawolc/",
      "text": "I feel your sadness and hope that you are still able to feel a sense of joy and accomplishment for all of the hard work - you did the thing!\n\nMy family has decided we are going to do our own \"ceremony\" in the yard (hopefully with some friends) and celebrate anyway. If that option is available to you, maybe it would be a good way to still recognize your accomplishments? I know it's not the same as being hooded and all that official stuff, but I'm expecting a special moment with the people I love and who have supported me.",
      "author": "scarlet-lily",
      "created": 1584992644,
      "upvotes": 1,
      "replies": {}
    },
    "flav905": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flav905/",
      "text": "I'm just waiting for the same email and dreading its appearance. I have a great working relationship with my committee members and was actually looking forward to my defense.  Defending remotely doesn't worry me, but it leaves a sour taste.   I skipped my master's, but it's gutting to think I won't be able to celebrate with friends and family for this.  I know in my head it pales in comparison to everything going on, and of course I'll be fine.  But I agree.  It's sad, and I have my fair share of anxiety about what will happen next.",
      "author": "dr_tee",
      "created": 1584991811,
      "upvotes": 1,
      "replies": {}
    },
    "flamkod": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flamkod/",
      "text": "This one is canceled. You can attend a future one. It sucks for sure, but it is not a missed opportunity, just a delayed one. Everything will be ok.",
      "author": "Lord_Blackthorn",
      "created": 1584986840,
      "upvotes": 3,
      "replies": {}
    },
    "flaj9ae": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flaj9ae/",
      "text": "My university is postponing commencement to sometime in the summer, so here’s to hoping yours is as well!",
      "author": "jakemadewell",
      "created": 1584984981,
      "upvotes": 1,
      "replies": {}
    },
    "flaher3": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flaher3/",
      "text": "We are allowed to walk next December but the university I am going to be an assistant professor at is an 18+ hour drive and a $500 flight...",
      "author": "Rigs515",
      "created": 1584983925,
      "upvotes": 3,
      "replies": {}
    },
    "flafpjd": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flafpjd/",
      "text": "Graduating also. Canceled!!!!",
      "author": "chochochocho12345",
      "created": 1584982953,
      "upvotes": 1,
      "replies": {}
    },
    "fladwhx": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/fladwhx/",
      "text": "I was scheduled to defend last Wednesday, which has been indefinitely postponed. I feel better about it now than I did last week. I will be defending via zoom. I wasn't too happy about it at first, but my advisor brought up a good point that it could be used as an opportunity to get creative and perhaps draw a bigger audience with a virtual environment. You could also record it, which is kind of neat. Best of luck.",
      "author": "BuckWildChuck",
      "created": 1584981937,
      "upvotes": 3,
      "replies": {
        "flco1dq": {
          "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flco1dq/",
          "text": "Zoom would be great for a defense. Skype not so much as it makes things a bit more difficult with sharing. I honestly hope the OP's committee switches to Zoom.",
          "author": "jaoshay",
          "created": 1585038901,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "flac0ac": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flac0ac/",
      "text": "Maybe you can still celebrate by getting graduation pictures done in your cap and gown? My husband is in the same boat, and that's what we've decided to do for him.",
      "author": "therealsteeleangel",
      "created": 1584980868,
      "upvotes": 5,
      "replies": {}
    },
    "flabiya": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flabiya/",
      "text": "Same here. I'm staying an extra month so I can walk, but now it's not happening and the borders are closed. I rushed through my thesis, scrapped out a part I wanted to expand on because I wanted to graduate by May and no there's no May graduation. I feel like an idiot.",
      "author": "BuildCodeCryRepeat",
      "created": 1584980593,
      "upvotes": 3,
      "replies": {}
    },
    "flabb3v": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flabb3v/",
      "text": "I'm in the same boat. I think it's important to remember that really all we're missing is a photo op while wearing an octagon hat and giant robes. I mean, damn did I want to wear it, but I can survive without the dorky pictures.\n\nThis too shall pass.",
      "author": "nalta",
      "created": 1584980472,
      "upvotes": 11,
      "replies": {}
    },
    "flab4on": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flab4on/",
      "text": "I feel this exactly. You're not alone. We got the email that our commencement is not happening either, and defenses will be online. Felt like I had the wind taken out of me, since the two motivating celebrations waiting for me after the finish line of my dissertation just evaporated. \n\nLike you said - we'll make it through this sucky time and it'll be ok. Sending virtual hugs :(",
      "author": "kintakara",
      "created": 1584980373,
      "upvotes": 3,
      "replies": {}
    },
    "flab0no": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flab0no/",
      "text": "Got it last week. Im right there with you. I wasn’t able to walk at my undergrad graduation. This was truly a once in a lifetime experience I can’t replace. I am beyond disappointed.",
      "author": "ladyshopsalot2626",
      "created": 1584980311,
      "upvotes": 7,
      "replies": {}
    },
    "flaarbd": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flaarbd/",
      "text": "Hey, I think your uni bungled the announcement because I'm certain it's just been postponed. Even if it takes a year, you're gonna walk.",
      "author": null,
      "created": 1584980161,
      "upvotes": 5,
      "replies": {}
    },
    "fla8se5": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/fla8se5/",
      "text": "I'm pretty sure mine is going to be canceled as well. I'm really sorry.",
      "author": "mormoerotic",
      "created": 1584979027,
      "upvotes": 4,
      "replies": {}
    },
    "fla71rr": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/fla71rr/",
      "text": "It will be okay. It's actually pretty normal for graduate students to walk in a different semester than that actually finish, so you'll be in good company on that front. I actually never did walk...\n\nit will be okay.",
      "author": "Average650",
      "created": 1584978000,
      "upvotes": 72,
      "replies": {
        "flank5a": {
          "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flank5a/",
          "text": "I graduated in fall, but my father couldn't make commencement so I was going to walk in spring. Well that plan is shot.",
          "author": "hdorsettcase",
          "created": 1584987404,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "fla6kys": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/fla6kys/",
      "text": "We got our news of cancelled commencement on Friday. It was delivered through a group Zoom call with our graduate school admin. What stung even more is that they didn't seem to care at all. I asked if instead of outright cancellation that a future date may be explored once everything calms down. Or if we could just walk during next year's ceremony. Crickets. They seemed more interested in organizing an online \"celebration\" for this years graduates and calling that sufficient. So cheap. \n\nI am a worrier and adept at thinking about worst case scenarios. I had never in my wildest dreams imagined that completion of my life's work would culminate this disappointingly.",
      "author": "echotrain",
      "created": 1584977728,
      "upvotes": 39,
      "replies": {
        "flbmpv9": {
          "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/flbmpv9/",
          "text": "I wonder if they just can't fathom the logistics of that and might reconsider if there is a student outcry. Absolutely there should be some recognition now, but don't deny your students who want the validation that comes with all the pomp and circumstance of a convocation/graduation ceremony...\n\nCongratulations on your hard work. I hope you have the opportunity to properly celebrate when this all is over...",
          "author": "designchaos",
          "created": 1585007887,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fla6kjq": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/fla6kjq/",
      "text": "Same boat. They have \"postponed\" our commencement as well (probably canceled). I was really looking forward to it actually as I have developed a great relationship with my advisor and I'll probably be one of his last graduate students (older and doesn't take on a ton of grad students). As much as we both were bitching about it, I know he and I are bummed it isn't going to happen since through our grumbling we both we're looking forward to it. Plus I want the damn cool hat (really the reason I've done this haha).",
      "author": "DocVafli",
      "created": 1584977721,
      "upvotes": 11,
      "replies": {}
    },
    "fla58d4": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/fla58d4/",
      "text": "I don’t think it will be forever cancelled—just postponed. I’m really sorry :(",
      "author": "Sigmund_Fraud97",
      "created": 1584976892,
      "upvotes": 110,
      "replies": {
        "fla8vuy": {
          "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/fla8vuy/",
          "text": "My alma mater just rescheduled the ceremony to December, so that it's at the same time as their normal winter ceremony. So hopefully a lot of universities start doing that.",
          "author": "Puggpu",
          "created": 1584979083,
          "upvotes": 57,
          "replies": {}
        }
      }
    },
    "fla49j6": {
      "link": "/r/GradSchool/comments/fnl2ir/commencement_canceled/fla49j6/",
      "text": "May is still a little while away. \n\nMaybe you can still get a room with 5 people together.",
      "author": "AlphaBetablue",
      "created": 1584976299,
      "upvotes": 56,
      "replies": {}
    }
  },
  "updated": 1634066982
}