{
  "sid": "rb8ehi",
  "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/",
  "title:": "Thinking about “mastering out” – any advice?",
  "text": "Long time lurker, first time caller. I’m currently a grad student in a research-based program (biochem) at a Canadian university. With most of the programs here, grad students enter at the Master’s level and decide if they want to transfer to a PhD program in their second year. I’m conflicted about the decision and was hoping to get some opinions from here. \n\nMy main motivation to succeed during undergrad was getting into grad school, doing a PhD, and becoming a rockstar professor, the whole nine yards. I had good experiences with a few undergrad research projects, enjoyed my coursework and figured I was on the right track. And right now, I’m working in a lab with a great supervisor, great team, great environment across the board. Unfortunately, most of my passion for science has kinda... evaporated. The inability to “unplug” from work coupled with the lack of any real financial stability and the general grind of running experiments has made me drastically reconsider a career in academia. I'm no longer sure that the benefits match the costs. \n \nI’ve spoken to my supervisor and colleagues about this and they think I’d be a good fit for a PhD. I know that the degree can be valuable on the job market outside academia, and I also know that a supportive lab environment isn’t an opportunity to be wasted or thrown away lightly. But it also seems to me that the folks who thrive in PhD programs are the ones who couldn’t imagine doing anything else… and that ain’t me anymore. \n\nTL;DR having a lot of second thoughts about transferring from a research-based MSc to a PhD. Has anyone here faced a similar dilemma during their academic career? Any words of wisdom or even tangentially-related experiences would be immensely appreciated. Thanks for reading this rant and hope everyone’s studies are going well.",
  "author": "mixo-phrygian",
  "created": 1638908209,
  "updated": 1639518589,
  "over_18": false,
  "upvotes": 29,
  "upvote_ratio": 0.97,
  "comments": {
    "hnmtrub": {
      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnmtrub/",
      "text": "I feel the same! I’m in a PhD position and work with child development research. I like aspects of academia- designing experiments and analyzing data. But man, I can’t stand the process of publishing. In academia, there is a lot of stress to be productive with grants and publications. It is extremely difficult to get a job and you work all the time. I want a family, I want a life outside of work. So I am right there with you. \n\nCurrently I think I may go the teaching route- I love teaching. The PhD is funded so I don’t have much of an incentive to leave the program… I’m just going to pass on the professorship lol \n\nIf you are feeling this way now it will only increase with time. Only crazy people like academia, no offense:) I guess I’m just not that crazy- kudos to people who can do it",
      "author": "aragorn_eragon",
      "created": 1638908533,
      "upvotes": 16,
      "replies": {
        "hnmw2qx": {
          "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnmw2qx/",
          "text": "Thanks for sharing - yeah, it definitely seems like you've gotta be wired in a certain way to really thrive in academia! I've done a bit of work tutoring and TAing and really enjoyed it, guess teaching might be something to look into as another option.",
          "author": "mixo-phrygian",
          "created": 1638909500,
          "upvotes": 4,
          "replies": {
            "hnnkzgd": {
              "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnnkzgd/",
              "text": "Fellow Canadian. I know during my PhD, my institute offered free courses you could take to improve your teaching abilities at the university/college level. Maybe you should see if your institute offers similar courses! I found the ones at mine to be amazing. The program even had an 'internship' type component that I ended up not doing but this might help you in the future :).",
              "author": "adnamanda",
              "created": 1638920320,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hnnkt6m": {
      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnnkt6m/",
      "text": "You're learning more about yourself and what is important to you in your work. Great! That's part of what school is about.\n\nI am just finishing up my PhD, and I wish I would have stopped at the Master's degree because I have been experiencing major burnout for the past 2 years. I'm also from an amazing research group, with a very supportive and helpful advisor, great community of grad students, etc. I learned that getting a PhD isn't about being the smartest person... it's more about being persistent and having that motivation to keep going and learning and experimenting. I lost my motivation about 2 years ago but wasn't in a good position to leave (on a funded project, only student in the lab with the skills to keep the project going, no support to leave from family) so I have been dragging myself along to the finish line. It's been tough. I also was considering teaching but it is so much work for not very good pay and is a high stress position, and one of the things I've learned in grad school is high stress positions are not good for me.\n\nMy advice would be to listen to yourself. Things aren't going to get easier in terms of work-life balance once you're in the PhD program. But there are benefits to getting a PhD. Do you have an idea of what you want to do once you graduate? Maybe do a little job hunting right now and see if the positions that interest you need a MSc or PhD.",
      "author": "c___Anemone",
      "created": 1638920239,
      "upvotes": 11,
      "replies": {
        "hno9ykz": {
          "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hno9ykz/",
          "text": "Thanks for the honest perspective, and good luck with getting to the finish line! I've been exploring a few post-grad options, many of which are actually pretty far afield from science altogether (let alone my specific field of study), but you're right on the money - need to get a clearer view of what I want to do with the degrees before I make any decisions either way.",
          "author": "mixo-phrygian",
          "created": 1638932628,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hno1chx": {
      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hno1chx/",
      "text": "I’m in the U.S, and got recruited as a PhD student with only a Bachelors (I worked for two years). I’ve only been in one semester, and I’ve realized two important things:\n1) There are several jobs I could work in with a Masters that I’d be more than happy with.\n2) My career interests are a lot more broad than my current research topic, and I’m worried that a PhD might “pidgeonhole” me into only having career options in the field that I’m currently in. \n\nIt might be helpful for you to start job searching now. Are there jobs requiring Masters that sound really cool to you? If so, might not be a bad idea to think Masters. Also, the qualities that would make you a good PhD student apply to anything you chose to do. I wouldn’t let compliments from my supervisor/colleagues influence my decision. Just because you have the ability to do a PhD, doesn’t mean you need to.",
      "author": "Psychological-Ear-32",
      "created": 1638928273,
      "upvotes": 8,
      "replies": {
        "hnob24x": {
          "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnob24x/",
          "text": "Sounds like we're in a pretty similar boat. Not sure I've really got the ambitions to become a biotech project manager or principal investigator anymore - seems like there's still room for Master's grads in industry, if not always at the upper echelons. And yeah... the \"can\" vs. \"should\" of doing a PhD is an important distinction, need to make sure I don't let my ego become a factor.",
          "author": "mixo-phrygian",
          "created": 1638933190,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hnnox7t": {
      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnnox7t/",
      "text": "I was in a similar situation. I definitely don't want to be a professor, I want to leave my work at work, but I truly enjoy the research. Since my program is funded and I love my lab I'm going to stick through the PhD, but what you do afterwards is totally up to you!",
      "author": "Kimanaio",
      "created": 1638922165,
      "upvotes": 3,
      "replies": {}
    },
    "hnnp9cd": {
      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnnp9cd/",
      "text": "I would go for a master's and then work for a while until making enough money and having time to decide if you want to do a PhD, and this time with more money at your disposal.",
      "author": "Complete_C7619",
      "created": 1638922326,
      "upvotes": 3,
      "replies": {}
    },
    "hnq6egg": {
      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnq6egg/",
      "text": "I think either path is fine. If you do pursue a PhD you can try developing methods to help separate life from work, even if it means a slightly longer time to completion. If you do master out you can try to search for jobs that still keep you connected to research and potentially go back (if it is possible).",
      "author": "local_man_says",
      "created": 1638977386,
      "upvotes": 3,
      "replies": {}
    },
    "hnuufsx": {
      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnuufsx/",
      "text": "I have realized the benefits definitely don't outweigh the costs for me and I wasn't even considering academia. I could make more money with a PhD, but I'm not convinced my mental health would be able to recover if I forced myself to keep going for 2-3 more years. I look around and see the level that my colleagues let their jobs control their lives and honestly it feels like I'm leaving a cult. It's like this constant \"I fucking hate my life but I'm a scientist/will get an advanced degree/work way more than others and that makes me worth something\" attitude that I just can't live by and that I don't think is very healthy. Like so many people talk about work life balance and then turn around and brag that they work 12 hour days and answer student emails even at 3 am and stuff like that. I honestly feel like a weirdo every time I tell people I'm not answering emails after 6 pm or similar things because of how people look at me. \n\nIt took me a while to finally admit I'm going to master out, but once I talked to my advisor and another professor on my committee, I realized how much better of a path taking a Master's degree would be for me and how many options I actually do have. I think a big thing holding me back was a fear of the unknown, like staying on the path of least resistance is always the easiest thing to do, even if there are better paths. \n\nEven if it turns out that you want to go back for a PhD, you can. Leaving with a Master's doesn't mean you're barred from grad school for the rest of your life!",
      "author": "KiwiTheKitty",
      "created": 1639061137,
      "upvotes": 3,
      "replies": {
        "hnwt7rk": {
          "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnwt7rk/",
          "text": "Totally feel where you're coming from re: the fear of the unknown. Both pursuing the PhD and walking away from it are definitely scary in their own way. Glad to hear you were able to make a decision you can be happy with.",
          "author": "mixo-phrygian",
          "created": 1639089510,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnnml8k": {
      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnnml8k/",
      "text": "Industry values the PhD with about 30% higher base pay for the same work. I stuck it out and am glad I did",
      "author": "greenmiker",
      "created": 1638921064,
      "upvotes": 6,
      "replies": {
        "hnnq194": {
          "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnnq194/",
          "text": "[deleted]",
          "author": null,
          "created": 1638922701,
          "upvotes": 5,
          "replies": {
            "hnp003f": {
              "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnp003f/",
              "text": "I don’t want to argue with you, but you are disillusioned if you think you will be getting 10% raises a year. In the tech sector the standard raise is 2%. I’m friends with many MS, they never catch up.",
              "author": "greenmiker",
              "created": 1638949523,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hnnle8o": {
      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnnle8o/",
      "text": ">The inability to “unplug” from work coupled with the lack of any real financial stability and the general grind of running experiments has made me drastically reconsider a career in academia.\n\nIf you could get a good job post PhD as a professor, certainly the financial stability would be better. But the rest of what you've observed could easily be the same unless you switched to a purely teaching institution.",
      "author": "raistlin65",
      "created": 1638920513,
      "upvotes": 2,
      "replies": {}
    },
    "hno1tel": {
      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hno1tel/",
      "text": "You could work for now and always come back to do a PhD later.",
      "author": "justananxioussoul",
      "created": 1638928506,
      "upvotes": 2,
      "replies": {}
    },
    "hnp6nvi": {
      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnp6nvi/",
      "text": "The PhD is powerful in the sense that it’s the peak terminal degree in the field. I generally encourage people to stick it out, even if they’re headed for jobs in consulting or industry because I’ve seen enough people need to go back to graduate school when they hit the ceiling in their out of academia job. Basically, the PhD is useful for more than just a job as a professor. \n\nIf you’re pleased with what your options are (with thoughts towards long term advancement—please consider this) with only a masters, and feel you’ll never regret skipping out on the doctorate, then you should leave. Otherwise, get that PhD and leave academia when you’re done.",
      "author": "Eab11",
      "created": 1638955356,
      "upvotes": 2,
      "replies": {
        "hnuuvf9": {
          "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnuuvf9/",
          "text": ">I’ve seen enough people need to go back to graduate school when they hit the ceiling in their out of academia job.\n\nI think this is true, but I also think it's true (depending on field) that finishing a PhD will limit your job options too. Like in biology, if you finish a PhD and decide you actually are ok with being a lab tech or are having trouble finding a PhD level job, you're probably SOL.",
          "author": "KiwiTheKitty",
          "created": 1639061329,
          "upvotes": 2,
          "replies": {
            "hnvcxzp": {
              "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnvcxzp/",
              "text": "Exactly. If you decide to leave (or finish) you need to be content with what your options are in the long run. OP needs to meditate and decide if they’re ok with the limitations imposed. It’s also worth noting that, in the US at least, the PhD includes a built in masters degree that is essentially awarded when quals are passed. Thus, if OP goes back after leaving this first program, they’ll be completing masters work all over again. Most biomed or bench science programs don’t give you a pass because you’ve had the coursework somewhere else.",
              "author": "Eab11",
              "created": 1639068659,
              "upvotes": 1,
              "replies": {
                "hnvfnn9": {
                  "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnvfnn9/",
                  "text": "Yeah, I think it depends on the person. Depending on the person and where they are in life, going back and doing the 4-6 years over again might be unacceptable, or it might be worth it if they're struggling mentally a lot or feel like they need to shift gears to a different subject. I realized that for me, the possibility of going back was fine because I'm not at the right place to survive grad school right now and that's why I'm leaving with my Master's. For someone else it may not be the right choice, but it's not really something one can make a blanket statement about.",
                  "author": "KiwiTheKitty",
                  "created": 1639069703,
                  "upvotes": 2,
                  "replies": {
                    "hoa7wwk": {
                      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hoa7wwk/",
                      "text": "I’m also leaving my PhD with a master’s, and I’m fine with the thought of starting all over again at a different school. I realized the subject of my PhD isn’t really for me anymore, which is why I’d rather leave with the MS, maybe work for a little, then apply to new programs. My mental health this past year and a half really was horrible, but changing to the MS was a huge relief",
                      "author": "juliamarcc",
                      "created": 1639337179,
                      "upvotes": 2,
                      "replies": {
                        "hoa8eie": {
                          "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hoa8eie/",
                          "text": "I know how you feel! I was really scared to switch and I haven't officially done so yet, but I'm pretty sure at this point it's the right decision for me. I really need to be paid a living wage for once in my life, for one thing.",
                          "author": "KiwiTheKitty",
                          "created": 1639337367,
                          "upvotes": 2,
                          "replies": {
                            "hoa8zpq": {
                              "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hoa8zpq/",
                              "text": "You can do it! I spoke with my advisor about it back in August and I was terrified, but he understood. Also a huge reason I’m leaving is bc of him (he has anger issues, history of yelling at students, inappropriate relationships…). I will say that after that meeting, I felt like a huge weight was lifted off my shoulders, I don’t regret it at all. I believe in you KiwiTheKitty!! \n\nIt’s disgusting how little we get paid as PhD students. That’s definitely a huge part of it too for me.",
                              "author": "juliamarcc",
                              "created": 1639337596,
                              "upvotes": 2,
                              "replies": {
                                "hoaa52b": {
                                  "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hoaa52b/",
                                  "text": "Wow that's fucked up about your advisor, but at least that talk went over well! My advisor is awesome and was totally supportive when I told him I was considering it, I've also talked to another professor on my committee about it and she was excited to connect me with a bunch of people she knows about potential jobs. I'm really thankful for them! Taking the next step of actually changing my program is scary though haha\n\nAnd yeah, outside of my department, it really feels like the university hates grad students. It's nothing but gaslighting from administration and I hate it. \n\nBest of luck with the rest of your master's!",
                                  "author": "KiwiTheKitty",
                                  "created": 1639338043,
                                  "upvotes": 2,
                                  "replies": {
                                    "hoaamdw": {
                                      "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hoaamdw/",
                                      "text": "That’s so awesome, I’m glad they are so supportive and you have great connections!! I’m trying to use those connections now before I enter the real world after the spring (scary lol). But I think we’re both making the right decision! When the paperwork was finalized for me, it was weird but also a relief! \n\nAnd yeah for real, academia is super toxic in many ways. I was also lucky my advisor had good funding for me.\n\nThank you, you too!! Good luck with the rest of your master’s :)",
                                      "author": "juliamarcc",
                                      "created": 1639338235,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hnq10bn": {
          "link": "/r/GradSchool/comments/rb8ehi/thinking_about_mastering_out_any_advice/hnq10bn/",
          "text": "This is basically what my supervisor has been telling me so I'll take your advice to heart, thanks for sharing.",
          "author": "mixo-phrygian",
          "created": 1638975068,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}