{
  "sid": "qsenqy",
  "link": "/r/GradSchool/comments/qsenqy/burned_out_but_need_to_finish_my_dissertation/",
  "title:": "Burned out but need to finish my dissertation remotely.. Any advice for ploughing through?",
  "text": "I tend to set myself up for failure by having high expectations for myself, to the point where I get overly anxious about doing things perfectly instead of just getting it done--which led me to take an extension on the dissertation. I finished the coursework component with A's on all assessments, but I've got the 15k dissertation left to do (UK MSc);  it's due in a few months (currently a doable timeline), but I've changed my research questions a half-dozen times due to difficulty with finding substantive secondary data--and that's where I've been stuck half-heartedly for a month. The more I try to work on it the more anxious I get; conversely, if I work on my p/t job there's tangible tasks/outputs so I feel accomplished after a day's work. I find myself doing other tasks instead just to feel some sort of accomplishment lol.\n\nI moved away from the uni during lockdown earlier this year, and I'm finding it EXTREMELY hard to motivate myself to finish being isolated from university life and working on it from home. I barely had contact with academic faculty during the term due to entirely online courses this year, and some key faculty have now left for greener pastures this term. I'm living with people who are working f/t, and it's hard for me to feel like a student again. All my friends who are still working on theirs seem to be in an even worse mental headspace, so they're not receptive to check-ins for accountability and all that.\n\nMy father actually struggled with the same problems, and ended up getting ABD on for his PhD programme (by then he had found a good job and just couldn't pull himself back into it). I'm paranoid about following in his footsteps and so is he. Has anyone been in this situation, or is now currently in it? How are you pulling through?\n\nWhile there are some decent study spaces around the city, I'm unable to utilise Sconul resources due to COVID-19, so I'm basically a nomad wandering around different cafes on days I feel like working outside the flat. I'm wondering if there's some sort of online fb group, a discord channel, etc etc where we could hold each other accountable?",
  "author": "Gr8panjandrum",
  "created": 1636733798,
  "updated": 1636745967,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}