{
  "sid": "r90nv7",
  "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/",
  "title:": "Don’t Know How Much Longer I Can Take This",
  "text": "Hello fellow grad students, thank you for clicking on my post. It really saddens me to say this: I don’t know how much longer I can take this.\n\nHere is some context: I am a first year ms student studying engineering, wrapping up my first semester. This semester has gone very well, albeit with some hiccups along the way. The workload was heavy but I managed it and am doing very well. The work here isn’t the problem.\n\nMy problem is, well, I am a gay man living in the deep south for graduate school. I am originally from NY, so I have been accustomed to very accepting community and the move to the south was a complete culture shock. I don’t care what your politics are and what not, there are some genuinely horrible people down here, and I unfortunately have had a couple of bad experiences that have made this experience so much worse. There is also 0 dating scene down here, and I feel like I am missing out on a fun youthful experience to go to grad school.\n\nHere is the thing: I am in a field I’ve always wanted to be in. Part of me is like “you only have a year and half left of school, just push through”, but the other part of me says “its nearly miserable every other day here”. Don’t get me wrong, my PI has been very accommodating in allowing me to visit NY a few times during the semester (especially since my work can be done remotely), and I also have a couple of very accepting friends here that really make a difference. But I am really lost on what to do.\n\nIf anyone is willing to offer advice or willing to help, that would be greatly appreciated. Thank you for reading my post!\n\nTLDR: Im a gay man living in the deep south going to grad school, and its very miserable some days, not sure how much longer I can take it.",
  "author": "asapgoose",
  "created": 1638656402,
  "updated": 1639518977,
  "over_18": false,
  "upvotes": 26,
  "upvote_ratio": 0.91,
  "comments": {
    "hnaawo7": {
      "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnaawo7/",
      "text": ">My problem is, well, I am a gay man living in the deep south for graduate school. I am originally from NY, so I have been accustomed to very accepting community and the move to the south was a complete culture shock. I don’t care what your politics are and what not, there are some genuinely horrible people down here, and I unfortunately have had a couple of bad experiences that have made this experience so much worse. There is also 0 dating scene down here, and I feel like I am missing out on a fun youthful experience to go to grad school.\n\nSo, I've spent my whole life as a gay man in the deep south. Not sure where you are specifically, but some places are better than others as far as that goes; dating has been kinda awful for me too, lotta fuck bois. You can DM me if you want to talk more about it. And yeah, you're not wrong about the horrible people part, but I assume those people exist everywhere.",
      "author": "ElectricalIons",
      "created": 1638678467,
      "upvotes": 18,
      "replies": {}
    },
    "hnalp4f": {
      "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnalp4f/",
      "text": "I don't blame you for not feeling like you can deal with this long-term, it sounds very stifling. Sorry you're going through this. Grad school is isolating enough and experiencing a living situation without social support makes it feel even more isolating. \n\nIt sounds like your dream project was weighed more heavily in your decision for grad school, and location was a lower priority. Priorities change over time, and that's okay/normal. If you do quit/transfer, say you've learned that you want to prioritize your living situation in the future. People usually understand. \n\nSome thoughts;\nTo stay - \n\n* do you have a support system at your location? If not, can you build/find a local support network? Would a virtual/zoom support network be sufficient?\n\n* You feel miserable after 1 semester, what happens if your project is extended by 1 semester (or 1 year)? Do master's students in your program ever have their projects extended?\n* Can you make a hybrid work schedule (to decrease the chance of encountering the homophobic culture/people)?\n* Do you have the option to work completely remote? \n\nI haven't remotely experienced the same thing as your experience but recently, my priorities changed, making grad school unbearable. I've spent ever single day of the last month figuring out how I can leave - it's exhausting to live with (and I've spiralled into depression + burn out). Like honestly, grad school is difficult enough without dealing with these additional considerations/hurdles.\n\nHopefully these questions help you decide!",
      "author": "campbell363",
      "created": 1638684489,
      "upvotes": 8,
      "replies": {
        "hnfe44g": {
          "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnfe44g/",
          "text": "Thank you so much for responding. I’d say its been very difficult to find LGBTQ+ affirming therapy/support groups where I am. A lot of the therapy like that that does exist here is unfortunately centered around biblical teaching, and that just really isn’t my cup of tea. We do have a pride center at the school but it isn’t funded very well and really leaves a lot to be desired.\n\nIn terms of my project, it’s going to end in august, but my professor already has a contract lined up for my 2nd year to have me fully funded again. So\nmoney won’t be an issue.\n\nThe hybrid work schedule is an great idea, and my cousin (who is also gay) has told me I should consider using instacart now more than ever to decrease the likelihood of anything like that (I unfortunately had a very homophobic encounter in a walmart recently, so shopping isn’t fun either lol).\n\nThe last point, I am actually meeting with my professor to see if he will let me finish my MS remotely next year. I think that’s the best idea thats been floated and gives me a lot of flexibility to go and live back in NY and/or a place that’s really accepting. He has been very understanding thus far, but I can see issues logistically with getting it done properly. Everything hinges on tomorrow’s meeting, so I will keep you posted! I really appreciate all the points you brought up, thanks for the help I sincerely appreciate it.",
          "author": "asapgoose",
          "created": 1638769528,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hn95e0l": {
      "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hn95e0l/",
      "text": "\n>I don’t care what your politics are and what not, there are some genuinely horrible people down here, and I unfortunately have had a couple of bad experiences that have made this experience so much worse.\n\nNot surprising. So-called southern hospitality is often only available to people who look, act, and pray like they do. Racism, bigotry, and xenophobia are very common.\n\n\n>There is also 0 dating scene down here, and I feel like I am missing out on a fun youthful experience to go to grad school.\n\nWell, there are a lot of people for whom that is not the grad school experience. \n\nPeople who go to grad school full time and work part time. People who go to grad school part-time and work full time. Others have kids and go to grad school full time. And then some people in grad school are immersed in their discipline for 70 to 80 hours a week.\n\nSo I know it might be hard, but if you want to stay in the program, maybe you could work hard during the semesters, and then take the summer off and go somewhere else?  \n\nMaybe join an international society in your field and become active in it?  Sometimes they have grad student groups.\n\nSee if maybe there's an opportunity to take on an additional research project that would let you learn more about the discipline and further build your CV/resume.",
      "author": "raistlin65",
      "created": 1638659597,
      "upvotes": 14,
      "replies": {
        "hnfep5b": {
          "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnfep5b/",
          "text": "Thank you so much for responding. That whole “southern hospitality” is unfortunately a sham. You don’t know how many time’s I’ve heard the words “bless your heart” (which in southern terms, is a big F.U.)\n\nI definitely understand what you mean about dating though. I just feel as though long term I would rather be in viable place to meet more like minded people. But you’re right, the dating thing doesn’t have to be a big deal. Just more the lack of acceptance is what kills me the most.\n\nI think the best of what you said is to work hard during the semester and take the summers of in NY. \n\nIn terms of clubs, I’ve looked into some societies and such, and some of them seem really interesting, but the vibe I got from going to a few meetings was that they were unfortunately really centered around undegraduates. I almost felt out of place being a graduate student. That’s at least what I gathered from the few I went to.",
          "author": "asapgoose",
          "created": 1638769887,
          "upvotes": 2,
          "replies": {
            "hnffxe6": {
              "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnffxe6/",
              "text": "I wasn't talk about clubs on campus. \n\nI'm talking about the professional and academic organizations for your discipline. National or international. Ask your professors.",
              "author": "raistlin65",
              "created": 1638770675,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hn968n1": {
      "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hn968n1/",
      "text": "Is there a possibility to complete the program “hybrid”-ly? I was in a PhD program in healthcare and one of our classmates had to juggle between family and her responsibilities running a free clinic down in South Ca (school was in norcal). She would come up several times a month but many times attended classes by Zoom (this was before Covid). It might be expensive to fly out and back NY-South but might be an option? Especially if the work can be done remotely, you might have to stick with the south time zone for “work hours”, and then come in person for an entire week maybe every 3 months or so. So you don’t have to rent a long term.",
      "author": "tzukaaaaa",
      "created": 1638659963,
      "upvotes": 2,
      "replies": {}
    },
    "hnc4dt1": {
      "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnc4dt1/",
      "text": "If every single day is miserable, then getting out ASAP sounds like a good idea. However, I have one bit of food for thought:\n\nYou're young, so this will probably not be the last time you are stuck in such an uncomfortable situation. If you can use this time to build some tools (or really, build a mindset) for surviving in these circumstances, you will be much better prepared to face the next tough situation. I say this as a gay+trans person who has had to move from a liberal area to the South and also didn't enjoy it. I notice in your post that your mindset is really negative right now (understandable!), but if you can tweak that to be a little more positive over time then your day-to-day life will be less miserable. Your mindset is the lens with which you view your daily life.\n\nBasically, in NY you have been living gay life in easy mode. Now in the South, you're in hard mode. It's legit to decide that you're not up for this challenge right now. But this is also a great opportunity to face this challenge in controlled circumstances. You've got a supervisor who'll let you take frequent trips to NY to recharge, you have a grad program you can focus on, and you're only there for 2 years total. One year from now, you'll be counting down your last 6 months!\n\nIf you decide to stick it out, my advice is: * build a community as best you can, like try out whatever gay-centric events you can find (I went to a few meant for undergrads and made a couple friends), become a regular at a local coffee shop, volunteer at the animal shelter sometimes, etc. * Schedule weekly zoom coffee dates with a friend or two from home. * Schedule visits home to NY so you can look forward to them, but try to find some moments of joy between those visits too. * Focus on your grad work and get pumped about making connections and applying for whatever comes next (PhD? new job?). * And finally, try to get a friendly therapist so you can vent about whatever every couple weeks or so.",
      "author": "pb-pretzels",
      "created": 1638720601,
      "upvotes": 2,
      "replies": {}
    },
    "hn91d1e": {
      "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hn91d1e/",
      "text": "Just want to give feedback since I read your post. It sounds brutal. Is there a way for you to transfer institutions? Could you move away when (if) you're supposed to write your thesis?\nI think the \"just go through with it\" approach onlyreally works when there's an actual rewardat the end. The \"break down in order to get stronger\" aporoach. But this is existential and I can't see how you one day will look back at it and think \"I'm glad I did that because ultimately it had a positive effect\"...\n\nWish I could offer more substantial advice.",
      "author": "Naivemlyn",
      "created": 1638657887,
      "upvotes": 2,
      "replies": {
        "hn931kh": {
          "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hn931kh/",
          "text": "I really appreciate your response. I’m not sure how the whole transfer thing would work. I feel like I could theoretically do it, but if I was to transfer I may have to just start all over again. Not the end of the world, but not ideal either.\n\nThe whole moving away thing during my thesis may be possible, but it would certainly be difficult. Thankfully my professor is very accommodating, so he may give me leniency there. He has allowed me to go back home a few times.\n\nSee, the thing with the “just stick through it” approach is that the award here is my MS. And also, my professor has some insane connections that can really help me. I ultimately want to do a PhD, and he has talked to me multiple times about helping me get into labs at other schools (more specifically, one at my DREAM program!) with much more ideal locations once I finish my MS. I feel like it’s a bridge I definitely don’t want to burn, especially since he has been so accommodating and helpful. I feel like in the end if I do end up somewhere that I love, I will be like “I’m glad I did that because it helped me get here”. But who knows, it really is just an insane situation, it definitely feels like there is no right answer here. This is what’s keeping me here so far.\n\nI feel like if I wasn’t with such a great professor who had some insane connections, I would already have my answer. But it’s like, is the suffering worth it to get to the place I want most?",
          "author": "asapgoose",
          "created": 1638658588,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hna0bdv": {
      "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hna0bdv/",
      "text": "[deleted]",
      "author": null,
      "created": 1638673355,
      "upvotes": -5,
      "replies": {
        "hna5cle": {
          "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hna5cle/",
          "text": "You not wanting to date liberal women is not comparable to people discriminating against him for being gay",
          "author": "ElectricBear45",
          "created": 1638675730,
          "upvotes": 11,
          "replies": {
            "hna5nte": {
              "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hna5nte/",
              "text": "Perhaps not. But it does certainly limit my options. And my cohorts respect for me would only be diminished if they found out how conservative I am.",
              "author": "MrUnknown1996",
              "created": 1638675878,
              "upvotes": 1,
              "replies": {
                "hnauob9": {
                  "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnauob9/",
                  "text": "With all due respect, this does NOT compare.\nHaving political preferences/differences is in a different galaxy than feeling hostility from society due to your sexuality.\nPolitics is a preference. Sexual orientation is fundamental and existential. \nI'm sure nobody would care if you expressed that you found a liberal woman attractive. You'd be allowed by those around you. \nThe big difference is that this is you actively excluding everybody else. OP is unwillingly being excluded against his will. \nBig difference.",
                  "author": "Naivemlyn",
                  "created": 1638690652,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "hnbiulr": {
          "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnbiulr/",
          "text": "Good, no clunge for bigots",
          "author": "SaltAccident5",
          "created": 1638709805,
          "upvotes": 1,
          "replies": {
            "hnbqqyg": {
              "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnbqqyg/",
              "text": "Don’t be a jerk.",
              "author": "MrUnknown1996",
              "created": 1638714342,
              "upvotes": 1,
              "replies": {
                "hnbtwby": {
                  "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnbtwby/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1638715922,
                  "upvotes": 2,
                  "replies": {
                    "hnbu1o3": {
                      "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnbu1o3/",
                      "text": "I didn’t say that. And that’s not really a fair accusation, because you don’t know me.",
                      "author": "MrUnknown1996",
                      "created": 1638715992,
                      "upvotes": 1,
                      "replies": {
                        "hnbz5br": {
                          "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnbz5br/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1638718390,
                          "upvotes": 2,
                          "replies": {
                            "hnbzdbp": {
                              "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnbzdbp/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1638718487,
                              "upvotes": 1,
                              "replies": {
                                "hnc0xga": {
                                  "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnc0xga/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1638719147,
                                  "upvotes": 1,
                                  "replies": {
                                    "hnc2njm": {
                                      "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnc2njm/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1638719881,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hnfd274": {
      "link": "/r/GradSchool/comments/r90nv7/dont_know_how_much_longer_i_can_take_this/hnfd274/",
      "text": "*A relevant comment in this thread was deleted. You can read it below.*\n\n----\n\nI'm a foreigner living in a highly conservative state in midwest for grad school. I do get a lot of passive aggression. Only hang out with other grad students (highly liberal ones, skip the rest), ignore the locals, work your ass off, and gfto once you're done. You'll be fine trust me. Once you leave, you'll have a lifetime material to talk shit about wherever you lived haha I try to find humor as much as possible. [[Continued...]](https://www.resavr.com/comment/don-t-how-much-17260383)\n\n----\n\n\n*^The ^username ^of ^the ^original ^author ^has ^been ^hidden ^for ^their ^own ^privacy. ^If ^you ^are ^the ^original ^author ^of ^this ^comment ^and ^want ^it ^removed, ^please [^[Send ^this ^PM]](http://np.reddit.com/message/compose?to=resavr_bot&subject=remove&message=17260383)*",
      "author": "resavr_bot",
      "created": 1638768887,
      "upvotes": 1,
      "replies": {}
    }
  }
}