{
  "sid": "quzil7",
  "link": "/r/GradSchool/comments/quzil7/defending_thurs/",
  "title:": "Defending Thurs!",
  "text": "I am defending my PhD dissertation on Thursday, and I’m a bit scared. I know they wouldn’t let me if they didn’t think I was going to pass, but still, I’m doing an interdisciplinary thesis and this department has never had one that’s interdisciplinary before, so I’m worried that they’ll categorically fail me because they’re not accepting of the validity of the other field. I’ve practiced my talk a few times on my own, once for friends, and tomorrow I do it again for my co-chairs. And I’ve already revised the entire dissertation organization once since officially submitting it since the committee members told my chair to tell me that they didn’t like that I wrote it too much like the other field and not enough like their field. 😱😰\n\nAnyone got encouraging words, or things you wished you knew beforehand? Advice from people doing interdisciplinary theses, or controversial topics, would be especially welcome.",
  "author": "AceyAceyAcey",
  "created": 1637037212,
  "updated": 1637415366,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.91,
  "comments": {
    "hku0wt2": {
      "link": "/r/GradSchool/comments/quzil7/defending_thurs/hku0wt2/",
      "text": "what're your disciplines?",
      "author": "HLA-AIRE-VIT1",
      "created": 1637053667,
      "upvotes": 4,
      "replies": {
        "hkukl8u": {
          "link": "/r/GradSchool/comments/quzil7/defending_thurs/hkukl8u/",
          "text": "My home department is a STEM field, and my dissertation is on STEM education. I have two co-chairs, one in each field.",
          "author": "AceyAceyAcey",
          "created": 1637068148,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkumpt1": {
      "link": "/r/GradSchool/comments/quzil7/defending_thurs/hkumpt1/",
      "text": "You will do fine....nerves. you took their advice and revised...you will do fine. Let us know.",
      "author": "rthomas10",
      "created": 1637069280,
      "upvotes": 3,
      "replies": {}
    },
    "hkv64k7": {
      "link": "/r/GradSchool/comments/quzil7/defending_thurs/hkv64k7/",
      "text": "You've got this! I believe in you!",
      "author": "GidgetRuns",
      "created": 1637078013,
      "upvotes": 2,
      "replies": {}
    },
    "hkzfu0c": {
      "link": "/r/GradSchool/comments/quzil7/defending_thurs/hkzfu0c/",
      "text": "Dude, I’m defending my PhD dissertation Thursday too! Good luck to you! Let’s get through this together! I’ve also been afraid of not passing, but am also soothing myself with the fact that, yes, they wouldn’t let us get to this point if it was so terrible.",
      "author": "_fanservicefriendly_",
      "created": 1637155128,
      "upvotes": 1,
      "replies": {
        "hl2u0w8": {
          "link": "/r/GradSchool/comments/quzil7/defending_thurs/hl2u0w8/",
          "text": "Yay, defense buddies! 🤜🤛 *fist bump* You’ve got this. The only real possibilities are pass in the clear, or pass with revisions, and either one is a pass. Kick butt tomorrow! You are the world expert in your topic, and I am in mine, now we’ve gotta show them!",
          "author": "AceyAceyAcey",
          "created": 1637207331,
          "upvotes": 2,
          "replies": {
            "hl2xpll": {
              "link": "/r/GradSchool/comments/quzil7/defending_thurs/hl2xpll/",
              "text": "DUDE! I was just getting ready to go to bed (final night before the defense wooooo), and I saw your comment and it made my night. Thank you, defense buddy! You’ve got this. And real talk, there’s no way somebody is going to know your topic the way you do. Let’s get this shit done. 🥂🍻<—- this will be us afterward, celebrating accomplishment!",
              "author": "_fanservicefriendly_",
              "created": 1637209202,
              "upvotes": 2,
              "replies": {}
            },
            "hl6dvqy": {
              "link": "/r/GradSchool/comments/quzil7/defending_thurs/hl6dvqy/",
              "text": "Defense buddy— I passed !!!! Bet you did, too. Congrats!!!!!!",
              "author": "_fanservicefriendly_",
              "created": 1637273420,
              "upvotes": 2,
              "replies": {
                "hl797vl": {
                  "link": "/r/GradSchool/comments/quzil7/defending_thurs/hl797vl/",
                  "text": "Congrats! I did! :-D",
                  "author": "AceyAceyAcey",
                  "created": 1637287426,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hl40ny3": {
      "link": "/r/GradSchool/comments/quzil7/defending_thurs/hl40ny3/",
      "text": "i’m sorry i’m just a high school graduate really interested in pursuing a phd in physics or maths (i haven’t chosen one yet), could you explain to why you’re defending your dissertation?",
      "author": "BigG26",
      "created": 1637237216,
      "upvotes": 1,
      "replies": {
        "hl46d3q": {
          "link": "/r/GradSchool/comments/quzil7/defending_thurs/hl46d3q/",
          "text": "A PhD requires original research, a dissertation paper (mine is 165 pages), and then a defense. The defense starts with a presentation (mine will be around 40-45 minutes), then audience Q&A for around 15-20 minutes, then the audience gets kicked out and my committee grills me for an hour or two, and then they decide if I pass (and get my PhD), pass with revisions (rewrite portions of the dissertation, and then I get my PhD), or fail.",
          "author": "AceyAceyAcey",
          "created": 1637240609,
          "upvotes": 1,
          "replies": {
            "hl49sfa": {
              "link": "/r/GradSchool/comments/quzil7/defending_thurs/hl49sfa/",
              "text": "that sounds very tense, i hope you pass good luck!! also is there any link to an online version of your dissertation or a pdf you don’t mind posting somewhere, i’d love to give it a read",
              "author": "BigG26",
              "created": 1637242419,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}