{
  "sid": "r3hi1d",
  "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/",
  "title:": "Have any of you ever gone into science-based graduate degree after coming out of a Bachelor of Arts?",
  "text": "Hey all! Hoping for maybe some perspective or advice from those who can relate- I graduated with a Bachelor of Arts in Political Science last December and I’ve been accepted for a Master of Science in the field of sustainability + environmental science that starts this January (non-thesis but with applied research projects throughout). \n\nThe Master’s program is pretty interdisciplinary (as is the nature of sustainability) so it will have some components of law/policy studies that I’m used to, but I guess I’m a little worried about my knowledge gap in sustainability/environmental studies side of things, and just transitioning to applied science-based research in general.",
  "author": "flamingos4sale",
  "created": 1638031908,
  "updated": 1638207970,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.94,
  "comments": {
    "hmalb9m": {
      "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmalb9m/",
      "text": "This isn’t exactly the same, but my BA was in ~Liberal Studies~ with a concentration in literature. Aka I dropped out of undergrad and went back a few years later and got the quickest degree I could. Anyway I’m in a clinical psych doctoral program now. I’m the only one with an unrelated undergrad, although I did have to go back and take some undergrad level classes to meet minimum application requirements. I’ve found that it wasn’t too hard to catch up. Most of where I’m lacking is in research related classes and work in the lab. My faculty mentor has been super helpful at getting me up to speed on everything, as have the more experienced folks in the lab. \n\nSo I wouldn’t worry about it too much! You’ll get the hang of the applied stuff once you dig into it. You wouldn’t have been admitted if they didn’t think you were equipped to do it! I would just encourage you to not be afraid to speak up if you’re completely lost. In my experience it’s been well received and I’ve gotten good advice.",
      "author": "hermit_the_fraud",
      "created": 1638033678,
      "upvotes": 7,
      "replies": {
        "hmb3pvw": {
          "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmb3pvw/",
          "text": "Thank you so much for sharing, your story made me feel a lot more at ease. \n\nI’ve definitely had hesitations in the past about speaking up when I’m lost/asking for help, but gonna try and take this as an opportunity to break that cycle and and not be so scared of failing. I appreciate you!",
          "author": "flamingos4sale",
          "created": 1638041390,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hmay2oa": {
      "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmay2oa/",
      "text": "I got my BA in political science and am finishing my MS in nutrition. I did have to take a bunch of science pre reqs before applying for the masters though. I find that my poli sci background gives me a really unique perspective in class discussions. You’ll be fine.",
      "author": "arl1286",
      "created": 1638039029,
      "upvotes": 5,
      "replies": {
        "hmb5kg0": {
          "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmb5kg0/",
          "text": "Honestly so nice to hear I’m not alone haha. Can I ask what made you want to transition from poli sci to nutrition? And did you find your profs/classmates were generally receptive and gracious in terms of helping you bridge the knowledge gap? \n\nI worry a lot about not having enough knowledge of the field yet to even know where to start to figure out where my research interests lie/what I’d like to focus on going forward.\nTruthfully I’ve always carried a bit of imposter syndrome around with me so I’m no stranger to the feeling, but it’s even tougher to navigate with all the unknowns.",
          "author": "flamingos4sale",
          "created": 1638042146,
          "upvotes": 1,
          "replies": {
            "hmbaksn": {
              "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmbaksn/",
              "text": "I worked for ~5 years before going back to school so I had plenty of time to soul search and figure out a) why I didn’t like what I was doing and b) what I would rather be doing. For me, I hated working a computer job and wanted something with more human interaction. I’d always been interested in nutrition on a personal level and used the process of elimination to figure out that I didn’t want to be a doctor, physical therapist, teacher, or other “hands-on” career.\n\nHonestly, everyone in my program came from a different background so I never felt like there really was a knowledge gap. It just made for much richer discussions when we could get perspective from people with backgrounds in nutrition, chemistry, marketing, policy, etc.\n\nI think imposter syndrome is natural and most people in grad school are probably also dealing with it. So you’re definitely not alone!",
              "author": "arl1286",
              "created": 1638044213,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmano1q": {
      "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmano1q/",
      "text": "BA in physics and math. MS in astronomy, MS in physics, and just successfully defended PhD in physics. I was a bit underprepared for the MS in astronomy (I was attempting to go for the PhD), but I also had motivation issues with my research.",
      "author": "AceyAceyAcey",
      "created": 1638034660,
      "upvotes": 3,
      "replies": {
        "hmb44vc": {
          "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmb44vc/",
          "text": "Wow, congrats on your successful defence! That’s incredible. I guess your undergrad was kind of related to your postgrad studies so maybe it wasn’t as tough of a transition, but did you find there was a significant learning curve between undergrad and grad school in general?",
          "author": "flamingos4sale",
          "created": 1638041558,
          "upvotes": 1,
          "replies": {
            "hmb5xu5": {
              "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmb5xu5/",
              "text": "Two main issues: (1) I was used to being the smartest student in the class in undergrad, and everything coming easily. Grad school wasn’t like that, so I had to learn the study skills I’d never bothered learning. (2) Research at the grad level is entirely different from anything I did as an undergrad — and I even did REU programs, but there they tell you what to do, and that’s not how grad research works.",
              "author": "AceyAceyAcey",
              "created": 1638042299,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hmakyx3": {
      "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmakyx3/",
      "text": "A BA isn’t exclusively a non-science degree. You can get a BA in any science field. I got a BA in Physics for example. Just because someone has a BS doesn’t mean they’re a scientist, it means they took more major classes. You’re probably better off than those with a BS because you took a more diverse course load and it seems your Masters will also be diverse.",
      "author": "Funkybeatzzz",
      "created": 1638033532,
      "upvotes": 6,
      "replies": {
        "hmb2usg": {
          "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmb2usg/",
          "text": "Oh totally! I probably should have worded my question more along the lines of if anyone has gone from humanities/social sciences in general to STEM. But I love the idea that the diverse range of courses I’ve been able to take might actually be an advantage, and as another commenter mentioned it will probably allow me to bring a unique perspective to class discussions. :) Thanks so much!",
          "author": "flamingos4sale",
          "created": 1638041043,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmcml4r": {
      "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmcml4r/",
      "text": "I got a BS in Architectural Design and am now doing intense, applied research as a masters student in engineering. You can learn basically anything if you’re willing to work really really hard. You can definitely do this, you’re probably just going to have to work harder than your peers. Good luck!",
      "author": "me_am_david",
      "created": 1638065784,
      "upvotes": 2,
      "replies": {}
    },
    "hmd447p": {
      "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmd447p/",
      "text": "I did! Did a bachelor's in studio art (traditional 2D media, drawing/painting/printmaking) then made the sharp turn to a doctorate in occupational therapy. Now after finishing that and enjoying research so much I am a PhD candidate in Health and Rehabilitation Sciences. I was never necessarily bad at science in high school, but I wouldn't call myself good at math or science courses. Since my BFA, I've had to take 3 separate anatomy&physiology courses (my figure drawing background actually helped a little for this), 3 statistics courses, neuro, several research methods courses, other clinical courses, bio, etc. \n\nAll that to say, that if I can go from a studio art degree to a PhD in a medical science field, you can do your transition too! I really enjoy interdisciplinary programs (like my PhD is now) because you can appreciate your (and others's) unique perspective and experiences. I felt like I was able to bring something different to the conversation and connect in a different way. Be proud of yourself and where you've come from, you and your journey make a difference!",
      "author": "seaside1508",
      "created": 1638074694,
      "upvotes": 2,
      "replies": {}
    },
    "hmahaix": {
      "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmahaix/",
      "text": "I was in a bachelor of science my first year before I switched out and I’ve taken a few environmental science/biology/etc classes since so I’m not *totally* in the dark, but I’m nervous about keeping up. Especially compared to my classmates who come from a myriad of backgrounds but most with a science degree or even better, direct experience working in the field.\n\nI’m also a first gen grad student, so I’m pretty much going in blind overall. That being said, anything you guys can share with me related to my situation above (or even just the grad school experience in general) would be super appreciated! :)",
      "author": "flamingos4sale",
      "created": 1638031942,
      "upvotes": 1,
      "replies": {
        "hmfat0l": {
          "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmfat0l/",
          "text": "One of my friends majored in anthropology & sociology in undergrad and got a MS in environmental sciences and is getting her PhD in envm sciences, focusing on sustainability all the way. Her research has been more social science but she's taken hard science/ag courses and been fine.\n\nI was in an interdisciplinary sustainable ag type MS and people with various backgrounds were plenty successful and made transitions to/from more social sciences to more natural and vice versa.\n\nYour policy knowledge and understanding will be a huge help to you - and your classmates! Some will know a lot more science content and can help you study and some will be desperate for help in policy analysis. You'll likely have someone(s) like me in your cohort who are interested in systems thinking and policy... But have no idea where to start in on actually analyzing or comparing any of it.\n\nYou may find that you have a couple of gaps but overall, you'll be fine. They wouldn't have accepted you if they thought you were missing a lot of knowledge. I would recommend asking someone in charge at the program if they have any preparatory reading recommendations, or if they can ask around and get some. I think that would set you up for success and also help assuage a lot of your fears.",
          "author": "Lucky-Reporter-6460",
          "created": 1638122079,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmbr23b": {
      "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmbr23b/",
      "text": "I have a BA in archaeology (technically anthropology) and am just finishing my thesis in paleoclimatology/oceanography. The degree may take a bit longer as it did for me because there's a much larger knowledge gap than those with relevant backgrounds, but I managed fine. Takes extra effort but it's valuable to have such a varied background.\n\nMy main advice is to track down all the review papers you can find - they are invaluable at providing the foundation for the relevant scientific literature.",
      "author": "getrichwatchingporn",
      "created": 1638051292,
      "upvotes": 1,
      "replies": {}
    },
    "hmcvl3b": {
      "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmcvl3b/",
      "text": "I got a BA in environmental policy and was accepted into a landscape architecture masters, which can be STEM-heavy if you go a technical/data-based route with it. I was also worried that my policy background would be useless, but it has actually been very useful in understanding the adoption process for sustainability initiatives, which helps guide the design of proposals for more likely implementation.",
      "author": "EtTuSouffle",
      "created": 1638070234,
      "upvotes": 1,
      "replies": {}
    },
    "hmd8k29": {
      "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmd8k29/",
      "text": "I technically have a BS but it's in arts management. I'm almost done with a MS in environmental science and I've been doing pretty well! I did take several years between degrees and took chemistry and biology classes one at a time to get caught up. You'll probably also need calculus if you don't already have it, though my school offers a math boot camp to those who don't have it. It's definitely doable 😊 It also sounds like you'll be doing something like what I'm doing! What school will you be going to??",
      "author": "signedizzlie",
      "created": 1638077221,
      "upvotes": 1,
      "replies": {}
    },
    "hmdgkii": {
      "link": "/r/GradSchool/comments/r3hi1d/have_any_of_you_ever_gone_into_sciencebased/hmdgkii/",
      "text": "I went from BA in psych to MSc in school psych - my thesis is heavily biology based and I regret not having a firmer bio background and am doing a lot of additional learning now though",
      "author": "CateFace",
      "created": 1638082348,
      "upvotes": 1,
      "replies": {}
    }
  }
}