{
  "sid": "ovuwvk",
  "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/",
  "title:": "Inundated by weddings and the financial strain they cause during grad school",
  "text": "Anyone else have a bunch of their friends weddings while you’re a student? Living off of loans on a strict budget, while all my friends are having weddings (I’m bridesmaid in 2 of them) and the amount of money I’m expected to invest in each wedding is probably about $500-$1000 each! \nHolt crap. I’m super excited and happy for my friends, but fighting feeling upset about how much I need to spend just to participate and be supportive. As a student, that amount of money is crucial for my living expenses. \n\nLooks like I can’t even attend my best friend since 4th grade’s bachelorette party because it’s $250 for BnB and takes place from Wed-Sat meaning I’d have to miss a clinical rotation and summer classes. \n\nAnyone else dealt with disappointing friends because you’re a student and can’t afford to attend or participate in friends weddings? \n\nAnyone had luck with getting time off from professors fo attend wedding events?",
  "author": "auracurious",
  "created": 1627834199,
  "over_18": false,
  "upvotes": 272,
  "upvote_ratio": 0.98,
  "comments": {
    "h7fijz6": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7fijz6/",
      "text": "I feel like these weekend are a once in a life’s time thing that we should make work if we can. Your best friends bachelorette is something that hopefully will never come around again and I think you’ll regret it if you don’t go.",
      "author": "Lyzzteria",
      "created": 1627913440,
      "upvotes": 2,
      "replies": {
        "h7fot15": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7fot15/",
          "text": "Yeah I agree :( but that’ll make me, like, not have food or rent lol",
          "author": "auracurious",
          "created": 1627916347,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7f5wdc": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7f5wdc/",
      "text": "I would have an honest conversation with those friends and let them know what's up. When I got married several of my friends were students or working very low paying jobs, so instead of asking them to cover their dresses or suits, I paid in part or in full for those who I knew it would be a financial burden. I had factored those purchases into my wedding budget to begin with because I  a grad student and I knew the financial stress it causes.",
      "author": "rubberduckie819",
      "created": 1627906513,
      "upvotes": 1,
      "replies": {}
    },
    "h7eg37s": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7eg37s/",
      "text": "What is it with people expecting others to spend money on THEIR celebration? That's crazy. I agree with other comments here - it's okay to send a nice note or just be straight up honest and explain that you can't afford this at the moment. Anyone who doesn't understand that doesn't deserve to be your friend.",
      "author": "Edhalare",
      "created": 1627884967,
      "upvotes": 1,
      "replies": {}
    },
    "h7e68ly": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7e68ly/",
      "text": "Yaaaassss I'm the maid of honor for my besties and she just clued me in that I need to be planning a batchlerett party. I was already stressed about the time commitment of the two day wedding itself.",
      "author": "sea_horse_mama",
      "created": 1627877897,
      "upvotes": 2,
      "replies": {}
    },
    "h7dgl9g": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7dgl9g/",
      "text": "True friends will be upset at first, but forgive you. Do what you believe is best to put ***YOU*** in the best situation. Let everything else fall where it must. You got this.",
      "author": "discount-doubledoink",
      "created": 1627863860,
      "upvotes": 1,
      "replies": {
        "h7dpjdf": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7dpjdf/",
          "text": "Thank you 🙏🏻 truly",
          "author": "auracurious",
          "created": 1627868620,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7ddwxf": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7ddwxf/",
      "text": "MD/PhD student - I’ll be honest, we don’t go. We have a small circle of friends whose weddings we will attend/be in if asked, but beyond that, we really can’t afford it, and we don’t have the vacation/capacity to travel. None of our friends who are getting married live in-state for us. \n\nI was in a childhood friend’s wedding during M1, and the cost would have been ridiculous if I had attended everything. They did a bachelorette weekend to Nashville, and then a second one in the North Ga mountains (I’m at school in New England.). I couldn’t make it financially or miss class/clinic, and I told them that. It pissed off the rest of the wedding party, but the bride had known I couldn’t make either of those things when she asked me to be in the wedding. I also stayed at my parents’, since she got married an hour from my parents’ house, so I could see my nephew, grandparents, etc the week of the wedding (but I still attended all of the wedding-related festivities!!) instead of spending to stay in the air bnb with the other bridesmaids. Bride was super understanding! Her friends, not so much. I was honestly so glad I didn’t stay in the air bnb because 2/3 of the other bridesmaids were rude and 1/3 was extremely unkind to me. The bride has sadly since fallen off the face of the planet to all of us because her husband keeps her pretty isolated.",
      "author": "tsb0673",
      "created": 1627862407,
      "upvotes": 3,
      "replies": {
        "h7dphlw": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7dphlw/",
          "text": "Oof, I’m sorry to hear about the bride and what turned out to be a dubious groom. That sucks. \n\nYeah, fuck those other bridesmaids lol. \n\nYep, I’ve finally started drawing lines and am no longer going to be staying overnight with the other bridesmaids in this wedding Aug 14. I just can’t afford it. Everyone else is getting hair and makeup done but I’m just going to do it myself and hope I don’t look shabby :/ I’ve probably spent about $800 on this wedding already. I’m over it.",
          "author": "auracurious",
          "created": 1627868594,
          "upvotes": 1,
          "replies": {
            "h7dw5vf": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7dw5vf/",
              "text": "It’s definitely sad, but I saw it coming for years. He’s always been controlling of her, sadly.\n\nHoly $&!?@$)!!!!! $800?! That’s crazy!!! I also did my own hair/makeup for the same wedding I mentioned, and I think it looked fine, to be perfectly honest. I’m sure yours will look great 😊 \n\nI offered the *option* to my bridesmaids that they could pay for hair/makeup if they *wanted* someone else to do it for them, and 2/3 did their own hair, and it looked phenomenal! They had such a blast styling each other too 😊 do what you need to do, and don’t feel guilty about it! Weddings have gotten super out-of-hand with what people expect and pay anymore. It’s mind-boggling to me!!",
              "author": "tsb0673",
              "created": 1627872126,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h7dcky7": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7dcky7/",
      "text": "I went to 3 or 4 weddings during grad school. All of which I couldn’t afford but did anyways. All of which attending stressed me out for months financially. I skipped 1 during Covid that 75% of people who attended, including the bride/groom, caught Covid from lol",
      "author": "NickDerpkins",
      "created": 1627861692,
      "upvotes": 1,
      "replies": {}
    },
    "h7d45ss": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7d45ss/",
      "text": "I took out a credit card and just started racking up debt with all the weddings I was in. I think I spent over $20k between all the weddings. I've been a bridesmaid over a dozen times now. And I tried to be as frugal as possible. I don't regret it, but it was painful paying it down.      \nI did get the time off though so that was nice.",
      "author": "likeateatrayinthesky",
      "created": 1627857326,
      "upvotes": 1,
      "replies": {}
    },
    "h7cz299": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cz299/",
      "text": "You could just say you cannot afford it. I had literally one friend (local from grad group) make mine, while all my wife's friends did. We did it in her hometown and the travel from my side was too much for most everyone (less than half of my extended family could even do it). I had zero negative feelings that they could not make it and completely understood.\n\n*This was in pre-COVID times too",
      "author": "HappyHrHero",
      "created": 1627854798,
      "upvotes": 1,
      "replies": {}
    },
    "h7cvcg1": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cvcg1/",
      "text": "I wasn’t able to make it to a bachelorette weekend of my friend I was a bridesmaid for. I felt so bad but I had a summer class start the same day it started. Seriously who has classes on weekends! Evidently grad students do. \n\nI also got out of paying for an expensive bridesmaids dress due to the pandemic though. It was so touch and go that she just said “wear whatever”, so I wore a dress I already owned. \n\nNow I am planning my own wedding and I am trying to keep it as cheap as possible for my friends just because of where I am at financially and how I don’t want them to feel obligated to spend a whole bunch of money on me, so I am going to have a simple hair and makeup look for my party and allow them to wear something in a broad colour scheme and style, so they can find something under $100 if they want to. I will ask them to try to plan something simple and cheap for the bachelorette, like maybe rent a cabin or something. \n\nHopefully there are ways you can still include yourself while making the couple aware of your situation. Discuss your budget with them and try to be up front about what events you can make it to and how much you are able to afford with stuff that comes up.",
      "author": "squidp",
      "created": 1627852961,
      "upvotes": 3,
      "replies": {}
    },
    "h7cuxoi": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cuxoi/",
      "text": "Yep this is totally happening to me. Being a bridesmaid is super expensive plus the cost of travel. Luckily for two of the weddings I flew home for this summer I was able to visit my parents and other friends so it felt more like an actual vacation and justified the cost of the plane ticket. But for a wedding alone, it’s crazy. This year I was in two weddings, one for my best friend and one for my sister, and I’m really hoping I don’t get asked to be in any more because damn it’s expensive.",
      "author": "calabunga_21",
      "created": 1627852763,
      "upvotes": 1,
      "replies": {}
    },
    "h7coc8x": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7coc8x/",
      "text": "If you can't make the bachelorette/wedding due to financial or other obligations, I would hope that your friends would be understanding. I suggest having a one on one girls night get together with the bride as a substitute bachelorette. You can do all the fun things without spending that much. It'll be way more memorable. Same thing with the wedding. Treat the couple to a dinner/activity and maybe get them a gift (the dinner/activity could also be the gift) and have good conversation. You can choose how much you want to be a part of the couples wedding celebration. You can also tailor your budget to suit your needs. You'll still be spending money but that way you can be in control how much you want to spend.",
      "author": "uoftisboring",
      "created": 1627849607,
      "upvotes": 3,
      "replies": {
        "h7cp9ba": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cp9ba/",
          "text": "Yeah :( unfortunately with them being out of state, it’s either go or don’t go, I don’t have the option to “cheaply” just have a nice night with the bride, because even just getting there would be expensive. But I guess, it WOULD be cheaper to just go there a different weekend, it’d still be hundreds of dollars and time out of my schedule, but at least cheaper :(",
          "author": "auracurious",
          "created": 1627850041,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7co8d9": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7co8d9/",
      "text": "Yep. Broke AF and had to buy dresses, baby gifts, shower gifts, etc.\nIt sucks. I'm tired. \nAnd the icing on the cake is, my bf, who I've been with for 2 years, suddenly out of nowhere breaks things off with me. A day after we get back from a vacation with his family, after I spent money on a dress for his sister's bridal shower (plus a gift) and a month before her wedding, which I had to get a separate dress for (and shoes). Ugh. I hate everything right now. \n\nWeddings are usually on weekends though so there's that. Most profs don't sweat leaving on a Friday if you're in a lab type situation and will often switch days if you have paid hours you need to make up somewhere. A lot of profs don't even come in on Fridays or do WFH (in my experience). Pre Covid, Fridays were usually for meetings but that's all on Zoom now.",
      "author": "FolkMetalWarrior",
      "created": 1627849557,
      "upvotes": 6,
      "replies": {
        "h7egbjh": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7egbjh/",
          "text": "Just wanna say I'm sorry that happened to you. Sending you good vibes to get over the breakup ☺️",
          "author": "Edhalare",
          "created": 1627885152,
          "upvotes": 2,
          "replies": {
            "h7eub3s": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7eub3s/",
              "text": "Thank you ❤",
              "author": "FolkMetalWarrior",
              "created": 1627897517,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h7clrnh": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7clrnh/",
      "text": "Dude same, I don’t mind if it’s in the area (like one of my labmates, I’ll gladly come and she doesn’t expect extravagant gifts or money because she herself is a grad student) but my friends from college that went right into industry or a great job are getting married out of state and it’s like I legit can’t go, I can’t afford to travel, then spend money for wedding gifts, hotel while I’m there, etc. so I use the excuse of Covid, it’s convenient ¯\\_(ツ)_/¯ I still send a gift but I can’t afford the extra stuff",
      "author": "THelperCell",
      "created": 1627848384,
      "upvotes": 2,
      "replies": {
        "h7cowkj": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cowkj/",
          "text": "Yeah totally. I feel comfortable just saying no to that stuff. \n\nBUT these are like 2/3 of the most important weddings I’ll ever go to. These are my ride or die best friends. I WANT to support them and show them as much love and support as possible, I just CANT do it financially. So upsetting and it makes me feel like a loser asshole",
          "author": "auracurious",
          "created": 1627849873,
          "upvotes": 3,
          "replies": {
            "h7d52qo": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7d52qo/",
              "text": "Ohhhhh  I understand now, ugh that truly sucks. You’re not a loser asshole at all, you legit can’t help it! Have you talked to them about it?",
              "author": "THelperCell",
              "created": 1627857792,
              "upvotes": 2,
              "replies": {
                "h7dp4ln": {
                  "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7dp4ln/",
                  "text": "No :( not yet. I’m letting myself emotionally cool down for a few days before I talk to the bride. She also is having money troubles as far as wedding planning goes (went over budget)… so either that’s going to make her extra understanding or extra unhappy with me (but I bet she’ll be very understanding, even if disappointed she’d still be kind). It just sucks cause I WANT to buy beautiful wonderful gifts etc to show her how much I love her but I just can’t afford it!",
                  "author": "auracurious",
                  "created": 1627868403,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h7drhxi": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7drhxi/",
              "text": "> These are my ride or die best friends.\n\nIt seems like you're choosing a third option",
              "author": "Dathadorne",
              "created": 1627869657,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h7cjbbm": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cjbbm/",
      "text": "We got married in grad school, but held our wedding closer to \"home\" where more family/friends still lived. Did it over winter break too, so people were free to travel. Still quite a few weren't able to afford the trip. No problem for us.\n\nI think I attended at least a dozen weddings during grad school myself. We just said \"Sorry, I can't afford to travel this summer\" or whatever when it was too $$$ for our budget (my partner was a grad student too). But almost all of our friends were *also* grad students so most of those weddings were done on the cheap and people tried to arrange for cheap lodging (camping, shared houses, etc.) knowing that many of us couldn't afford a $1000 bill. Lots of grad school weddings were held outdoors, or in the campus chapel, or some other less expensive venue. I'm a minister and have done weddings for grads and recent Ph.D.s, all of them in someone's backyard or a rented barn or whatever.\n\nFor those who didn't get it, we just didn't go.",
      "author": "SnowblindAlbino",
      "created": 1627847217,
      "upvotes": 8,
      "replies": {
        "h7copfs": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7copfs/",
          "text": "Yeah, this whole experience is making me think if I have a wedding I’ll literally set up a “help” fund or something and just be really gracious about telling people they don’t need to buy gifts if they can’t pull it off, and that I can help them pay if they’re in a tight spot. Paying for my damn wedding party’s expenses too. Now that I’m seeing other countries do that, it makes me pretty annoyed that it’s not that way here",
          "author": "auracurious",
          "created": 1627849779,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h7cis79": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cis79/",
      "text": "Be honest and realistic about your budget. It it’s not within your budget to be a bridesmaid, then you need to tell the bride! If she really wants you in her wedding, she’ll pay for the dress she is requiring you to wear.",
      "author": "sailor_em",
      "created": 1627846963,
      "upvotes": 17,
      "replies": {
        "h7coguo": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7coguo/",
          "text": "Yeah :( my absolute best friend of all time and I can’t manage going out of state and paying $$500 minimum (plane tix, lodging, gift, and the drinks and food well inevitably be required to buy while we’re there) JUST to attend her bachelorette party. I’ve probably just got to be upfront and say I’m so sorry girl but I can’t do it",
          "author": "auracurious",
          "created": 1627849665,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "h7cez95": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cez95/",
      "text": "[deleted]",
      "author": null,
      "created": 1627845137,
      "upvotes": 51,
      "replies": {
        "h7cnzho": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cnzho/",
          "text": "I’m so sorry that that happened :( that shit sucks. But yeah money does not automatically equal support!! For you $50 was a big gift, for that other person, $500 probably wasn’t even that important to them",
          "author": "auracurious",
          "created": 1627849440,
          "upvotes": 21,
          "replies": {}
        },
        "h7czzjf": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7czzjf/",
          "text": "We got 10-20$ gift cards and were very grateful. No reason to feel cheap! A gift is very generous.",
          "author": "HappyHrHero",
          "created": 1627855249,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "h7cdt84": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cdt84/",
      "text": "\"Congratulations, but my schedule won't let me be able to make it.\"\n\nDestination weddings where you're paying thousands for plane tickets and lodging are probably the most pretentious of affairs in my opinion.\n\n>Anyone else have a bunch of their friends weddings while you’re a student? Living off of loans on a strict budget, while all my friends are having weddings (I’m bridesmaid in 2 of them) and the amount of money I’m expected to invest in each wedding is probably about$500-$1000 each! Holt crap.\n\nThis isn't an \"investment.\" It is \"come subsidize my party\" money. I personally wouldn't waste my time. I had to do it once for a best friend, I found it a financial burden and I will probably never do it again. Luckily I'm past that age where most of my friends are already married.",
      "author": null,
      "created": 1627844579,
      "upvotes": 47,
      "replies": {
        "h7co6iv": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7co6iv/",
          "text": "Totally. I said no to ANOTHER wedding a friend invited me to because she’s from a really rich family and doesn’t see the problem of having $250/night hotel rooms and plane tickets that are $700+ just to get to the wedding. \n\nSorry girl, but that’s not happening.",
          "author": "auracurious",
          "created": 1627849532,
          "upvotes": 25,
          "replies": {
            "h7e1rns": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7e1rns/",
              "text": "Not while I was in grad school, but when I was younger my (rich doctor) cousin invited me and my mom to his wedding in the Caribbean and it would have costed 8,000$ for the 2 of us to go. Like what the actual f. Hope he had fun with only his doctor friends who could afford it.....",
              "author": "pyritepyrate",
              "created": 1627875244,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "h7djq55": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7djq55/",
          "text": "“Invest” is relative - I think at least some of the expenses the OP is referring to are things like airfare and lodging, not any $$$ that would be going into the bride and groom’s pocket. \n\nAt least in my friend group, that happens for a lot more than destination weddings - we are all so far apart now for work and everything, a person could have their wedding in the most reasonable place possible and some of us would still have to come a long way. \n\nThat said, that does not change the OP’s budget, and I think it is perfectly reasonable to either say it’s not doable or ask if the bride and groom can subsidize some of the expenses if it is really so important to them that the OP be there. I know I got married pretty young when we were all fairly poor and I set up a lot of options to help people keep costs to within what they could afford - arranged rides for people, offered them a place to stay with me, et cetera.",
          "author": "CoomassieBlue",
          "created": 1627865541,
          "upvotes": 8,
          "replies": {}
        },
        "h7cufk1": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cufk1/",
          "text": "This, but with a little more heart lol",
          "author": "max11559",
          "created": 1627852523,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7canr2": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7canr2/",
      "text": "I don't even understand how it's a thing that you are expected to pay to be in other people's weddings. If they want you there, they can pay for it. No one is making them have a big wedding. Such a weird custom to me!\n\nSomeone in my cohort was in three weddings our first semester. She wasn't out of town long for each one, but it wasn't a problem. In my experience people teaching grad students are much more understanding of other life events than seemed to be the case in undergrad.\n\nGood luck and I hope your friends reimburse you.",
      "author": "rebelipar",
      "created": 1627843071,
      "upvotes": 19,
      "replies": {
        "h7co8op": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7co8op/",
          "text": "Lol they won’t",
          "author": "auracurious",
          "created": 1627849561,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h7cann6": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cann6/",
      "text": "I think a real friend would value your presence over a financial contribution, or be understanding if the cost would place an undue financial burden on you. No reasonable person expects their friend to go into debt or potentially be short on rent for a wedding. It's an expense, not an investment. Investments have returns.\n\nA $1000 expense sounds like a lot for just a wedding. Maybe I just heard wrong, but it was always my impression that the wedding is supposed to be funded by the bride and groom's family, not the guests.",
      "author": "False-Guess",
      "created": 1627843069,
      "upvotes": 16,
      "replies": {
        "h7cjkwv": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cjkwv/",
          "text": ">Maybe I just heard wrong, but it was always my impression that the wedding is supposed to be funded by the bride and groom's family, not the guests.\n\nThat was a general belief in the US 25+ years ago and even then it wasn't really true for many couples. For some very traditional families and many wealthy ones the cost is still covered by parents. But it's certainly not the norm for people I know any longer.",
          "author": "SnowblindAlbino",
          "created": 1627847346,
          "upvotes": 10,
          "replies": {
            "h7gezw0": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7gezw0/",
              "text": "Well that probably explains it then because my parents are both older and from the rural South which was very traditional 25+ years ago when they got married lol.",
              "author": "False-Guess",
              "created": 1627927714,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h7cntd3": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cntd3/",
          "text": "Unfortunately that’s not the norm where I’m from (NY) and every wedding party I’ve ever known of has been responsible for paying for their own bridesmaid expenses unfortunately",
          "author": "auracurious",
          "created": 1627849361,
          "upvotes": 2,
          "replies": {
            "h7ekh9f": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7ekh9f/",
              "text": "I’m from NY, have been in several weddings, and let me tell you it is not the norm.",
              "author": "ooooq4",
              "created": 1627888647,
              "upvotes": 2,
              "replies": {
                "h7fok8l": {
                  "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7fok8l/",
                  "text": "Oof. Now I’m jealous lol",
                  "author": "auracurious",
                  "created": 1627916237,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h7ca07u": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7ca07u/",
      "text": "I've felt this big time. I go to school across the country so I have to fly to attend weddings back home. It costs me minimum $450 just to show up to the wedding. Let alone food, drinks etc. I've been a groomsman for all their weddings as well so that's another $150 for the suit rental. I've opted out of Bach parties, that's another similar expense. It's a huge pain, but my friends realize it's a sacrifice that they appreciate me doing. I know they'll reciprocate by the time it's my wedding.",
      "author": "ducks-on-the-wall",
      "created": 1627842765,
      "upvotes": 5,
      "replies": {}
    },
    "h7c9v9l": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7c9v9l/",
      "text": "I’m not in any weddings (thank goodness), but I have been spending a lot this summer on flights/hotels to attend my partners friends’ weddings. I barely even know the people who are getting married… While I’m happy for these people, it’s certainly difficult to find the time and money for it. Plus I can’t eat any of the free food (I have celiac), so spending my precious weekends at weddings with people I don’t know kind of sucks 😐",
      "author": "Jenna_bird",
      "created": 1627842697,
      "upvotes": 28,
      "replies": {}
    },
    "h7bw1q9": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7bw1q9/",
      "text": "I definitely disappointed a childhood friend because I didn’t attend her wedding. It was a 10 hour drive, 3 states away, in the summer of 2020 so during COVID. I didn’t feel comfortable staying in a hotel and traveling to different states. I also was struggling to afford the hotel. I also would have had to miss 2 weeks of clinic when I returned to check for COVID and I felt I couldn’t miss anymore clinic as I had already missed so much due to shut down. My friend was very upset I couldn’t go. She still invited me to her make-up bachelorette party, but I couldn’t really miss clinic and I couldn’t afford to travel. My friend and I barely talk now. It’s hard,  but I decided if not being able to attend a wedding or bachelorette party due to lack of finances, missing clinic/class, and lack of comfort due to the pandemic then maybe my friend wasn’t as good of a friend as I would have thought. A good friend would be disappointed (rightly so), but would still be your friend and understand/support you that you can’t attend.",
      "author": "chEARful8",
      "created": 1627836226,
      "upvotes": 183,
      "replies": {
        "h7ce92f": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7ce92f/",
          "text": "[deleted]",
          "author": null,
          "created": 1627844787,
          "upvotes": 59,
          "replies": {
            "h7cetr1": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cetr1/",
              "text": "Thanks for the offer. The friend lives in another state 12+ hours a day. Meeting has always been hard. I’ve accepted and come to terms with the situation. I don’t need someone in my life that reacts that way. We tried to talk one time a few months ago after I reached out to wish a happy birthday, it was short and never happened again.",
              "author": "chEARful8",
              "created": 1627845063,
              "upvotes": 15,
              "replies": {}
            },
            "h7cr1vm": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cr1vm/",
              "text": "How dare she be bitter over people not attending her Corona wedding",
              "author": "doornroosje",
              "created": 1627850892,
              "upvotes": 34,
              "replies": {
                "h7d29fp": {
                  "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7d29fp/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1627856371,
                  "upvotes": 4,
                  "replies": {
                    "h7ed9xv": {
                      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7ed9xv/",
                      "text": "Yeah we don't know, and I totally understand being sad and mad at the world. But she made a pretty irresponsible choice, and she can't be mad at the *people*. But rereading the comment OP didn't even mention she was actively mad, just that they didn't talk anymore, and Corona has been super weird for friendships.",
                      "author": "doornroosje",
                      "created": 1627882787,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "h7cx64m": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cx64m/",
          "text": "It sounds like you probably already know this, but anyone who expects people to travel multiple states away during a global pandemic to attend a wedding is a terminally selfish person in the first place, so you will be better off without that person in your life in the long run.",
          "author": "mfball",
          "created": 1627853865,
          "upvotes": 21,
          "replies": {}
        },
        "h7cnc2a": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cnc2a/",
          "text": "I agree, friends shouldn’t have to be “bought”",
          "author": "auracurious",
          "created": 1627849135,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "h7bsbyw": {
      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7bsbyw/",
      "text": "Omg all my friends know I’m a broke AF grad student. Do your friends not know how difficult the life of a grad student is? Also, I’ve attended friends weddings and never had to pay anything beyond $50 for their gift? I mean, is it a thing for people to expect others to gift certain value at their wedding? It may be a culture thing at your place… i’m not sure.\n\nI always show up to friends big events because I rarely have to shell out money for it. I get free food 😂✋🏻\n\nMaybe we’re cultures apart but wow $1000 is a lot",
      "author": "givemeyourdonut",
      "created": 1627834489,
      "upvotes": 88,
      "replies": {
        "h7btkx0": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7btkx0/",
          "text": "Travel and lodging are usually among the biggest expenses of attending a wedding out-of-town. If you're a grad student, it's not that unusual to have to travel to friends' and family weddings. Also, I think the specific expense figure was given for being a bridesmaid, which comes with an irritating price tag if the bride doesn't offer to cover it (which I believe ought to be the default, but very much isn't).",
          "author": "aggressive-teaspoon",
          "created": 1627835069,
          "upvotes": 62,
          "replies": {}
        },
        "h7cgwcb": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cgwcb/",
          "text": "[deleted]",
          "author": null,
          "created": 1627846054,
          "upvotes": 27,
          "replies": {
            "h7e8mjm": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7e8mjm/",
              "text": "I have never done out of state weddings. I commented completely forgetting about the out of state thing, it's just not possible for me. I only have done different cities. I carpooled & stayed at a friend's place too so it kept the expenses low. But for out of state weddings, I understand now that it costs a bomb especially with flight tickets + accomodation. It's like a vacation... yikes",
              "author": "givemeyourdonut",
              "created": 1627879465,
              "upvotes": 3,
              "replies": {}
            },
            "h7clwqb": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7clwqb/",
              "text": "not the OP, but   \n1. use a car (still have to pay for gas I guess)  \n2. stay at a friend's place that's close by (works better for small weddings, but it is covid season)",
              "author": "kazprog",
              "created": 1627848453,
              "upvotes": -4,
              "replies": {
                "h7cnv7c": {
                  "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cnv7c/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1627849385,
                  "upvotes": 29,
                  "replies": {
                    "h7cosp7": {
                      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cosp7/",
                      "text": "Absolutely yeah, I was just saying that it was possible in some specific situations.",
                      "author": "thekasrak",
                      "created": 1627849823,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "h7cn4gi": {
          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cn4gi/",
          "text": "The thing that makes it so damn expensive is that 2/3 of the weddings are out of state, one is my brother’s, and the other two I’m a bridesmaid in. As a bridesmaid, you have to buy the $100+ dress, get it tailored $80, the bachelorette gift $50-100, the wedding gift $50-100, hair for the wedding $60, and then if it’s overnight and out of state you’ve got $300 on plane tickets anx $100-200 on lodging\n\nShits whack",
          "author": "auracurious",
          "created": 1627849036,
          "upvotes": 29,
          "replies": {
            "h7cu3z5": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cu3z5/",
              "text": "As a bride I never asked my bridal party to pay for anything I specifically requested. So I paid for outfits, hair, hotel rooms, etc. and didn’t expect any gifts. In my opinion those whose weddings you attend should understand your situation and make accommodations.",
              "author": "mnc01",
              "created": 1627852363,
              "upvotes": 25,
              "replies": {
                "h7dxs20": {
                  "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7dxs20/",
                  "text": "^ This is the way. I was a bridesmaid for a friend who paid for hair, didn’t complain when I stayed at the cheapest motel on the other side of town instead of the fancier place where everyone else was, and coordinated with the three bridesmaids on “pick a dress that’s green and about knee length, if you’ve already got one great.” We ended different cuts and slightly different shades that fits everyone’s body type and skin tone best, pictures turned out fine, and exactly zero fucks were given about shoes beyond “idk you probably already have black shoes how about black.” Had a blast on a tiny budget.",
                  "author": "themathymaestro",
                  "created": 1627873019,
                  "upvotes": 9,
                  "replies": {}
                },
                "h7gk6wa": {
                  "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7gk6wa/",
                  "text": "100% agreed. I say this all the time (to myself and my boyfriend) when I'm expected to drop loads of money for a bachelorette party, wedding, or baby shower. I shouldn't have to break the bank trying to be a supportive friend, especially when I barely make enough money for myself. What's even worse is being guilted into attending an expensive life event celebration when you don't have money, kinda like I was for my friend's bachelorette party in Las Vegas. 🥲",
                  "author": "Apprehensive_Yam2606",
                  "created": 1627929974,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h7d33cr": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7d33cr/",
              "text": "I was very fortunate and grateful that my best childhood friends that were getting married (to each other) 1) paid for my bridesmaid dress 2) picked me up from a major city airport and drove me the rest of the way 3) provided all of my vehicle transportation in the city the wedding was in (I stayed at a relative's place for lodging). They also did not expect a gift, saying that having me in their wedding was the best gift I could give them.\n\nIDK maybe my friends are just incredibly generous, but shouldn't friends at least be understanding with their closest pals? Maybe we just have the culture in our little circle that the closest friends (essentially family) are in the wedding party and thus we're more likely to help each other in that way.\n\nIt's a tough situation and there are definitely other weddings that I have just not been able to go to because of grad school finances.",
              "author": "adrienne_cherie",
              "created": 1627856787,
              "upvotes": 16,
              "replies": {
                "h7dol6g": {
                  "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7dol6g/",
                  "text": "Yeah, I’m getting more and more upset about this. I’m fucking paying for EVERYTHING for the members of my bridal group. None of this shit will happen at my wedding. \n\nSide note: \nThere’s ANOTHER wedding happening this November and this friend of mine LITERALLY told me (when talking about a different guest who’d expressed money issues) “if you can’t afford to get a wedding gift, you shouldn’t come” \n\nI believed she was right at the time but my opinion has 100% changed. I’ll just be grateful that guests are showing up to support me and idgaf about gifts",
                  "author": "auracurious",
                  "created": 1627868120,
                  "upvotes": 8,
                  "replies": {
                    "h7gkgek": {
                      "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7gkgek/",
                      "text": "Why are you the one paying for everyone else in the bridal party?",
                      "author": "Apprehensive_Yam2606",
                      "created": 1627930087,
                      "upvotes": 1,
                      "replies": {
                        "h7h74wi": {
                          "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7h74wi/",
                          "text": "No, as a guest I am responsible to pay for myself and my costs to attend and participate in the wedding. \n\nI was saying in this comment that when I get married, I’ll pay for everything for my bridal group so that they don’t have to spend $500-$1000 just to support me (like I am be forced to do right now)",
                          "author": "auracurious",
                          "created": 1627940058,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "h7dwoef": {
                  "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7dwoef/",
                  "text": "THIS! We were out-of-state for literally everyone but one group of people, no matter where we got married. So my family helped us cover the cost of lodging, food, dresses, etc for our small wedding party. My husband and I also picked people up at the airport, and it was great! We just got bonus time with those folks, which was wonderful 😊 all of our friends are in the same boat as us, financially, and we didn’t want to create a hardship. We also did not expect gifts from anyone and were happy just to be surrounded by our closest friends and family!!",
                  "author": "tsb0673",
                  "created": 1627872413,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "h7cvf5o": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7cvf5o/",
              "text": "Can you talk to the bride/groom? Obviously weddings get really tense and people can have some pretty nuts expectations, but if these are people you're close enough to be a bridesmaid for, you can have a frank convo about what expenses you can afford and if that means that your presence might be the only gift or you can't be a bridesmaid or them covering your portion on airbnbs.",
              "author": "mediocre-spice",
              "created": 1627852997,
              "upvotes": 8,
              "replies": {}
            },
            "h7e8bfe": {
              "link": "/r/GradSchool/comments/ovuwvk/inundated_by_weddings_and_the_financial_strain/h7e8bfe/",
              "text": "OP, I completely forgot about the out of state thing. I have only went to weddings in nearby cities and even then, I carpooled with friends. We shared gas money and stayed in my friends house. I am guessing if I was invited to an out of state wedding, I would not go if my financial situation does not permit it. Best I would do is to send wedding gifts as a kind gesture.",
              "author": "givemeyourdonut",
              "created": 1627879255,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634067357
}