{
  "sid": "q9gfmq",
  "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/",
  "title:": "My PhD supervisor tried to force me to \"master out\" due to my progress. It turns out that the problem was simply too hard. Has this ever happened to you?",
  "text": "It still makes me laugh till this day when I think back early on during my master when my now PhD supervisor sat me down and told me I could still get a \"master of engineering\" (a weaker degree) as opposed to a \"master of applied science\" (a more rigorous degree). Admittedly , at that time I wasn't really productive.\n\nThen a breakthrough occurred.\n\nIt turns out, simply the problem was too hard and my supervisor underestimated the difficulty because it looked like another (simpler) problem.\n\nNo, my supervisor has never really...said anything about it afterwards.\n\nHas this happened to anyone else, where your supervisor underestimate the difficulty of the problem then sort of blames it on you?",
  "author": "alone_in_this_rhythm",
  "created": 1634405124,
  "updated": 1634604585,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.94,
  "comments": {
    "hgvx5q0": {
      "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgvx5q0/",
      "text": "When you are heading into unexplored territory, as one usually does in research, it is very difficult to know initially how hard a problem is. They all usually get harder as you get deeper into it.",
      "author": "IkeRoberts",
      "created": 1634407821,
      "upvotes": 10,
      "replies": {
        "hh0hd13": {
          "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hh0hd13/",
          "text": "I should elaborate that a critical piece of research training is learning how to make decisions as you get into the research. Figuring out which paths to follow, and choosing those with the best combination of importance and tractability is something that distinguishes good researchers. You have to learn that by doing, but it helps a lot to have good mentorship so you don't just flounder.",
          "author": "IkeRoberts",
          "created": 1634494991,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgvs5eq": {
      "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgvs5eq/",
      "text": "What was this breakthrough? You solved it?",
      "author": "makingbadlifechoices",
      "created": 1634405621,
      "upvotes": 4,
      "replies": {
        "hgvt8o4": {
          "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgvt8o4/",
          "text": "Yes. But it was sort of an unexpected discovery. And then my supervisor asked me to do a PhD with them...",
          "author": "alone_in_this_rhythm",
          "created": 1634406085,
          "upvotes": 6,
          "replies": {
            "hgwa6n1": {
              "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgwa6n1/",
              "text": "Please tell me you didn't.",
              "author": "eleveneels",
              "created": 1634413360,
              "upvotes": 6,
              "replies": {
                "hgxo99h": {
                  "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgxo99h/",
                  "text": "In the post OP says my now PhD supervisor\", so 🤷🏽‍♀️\n\nHopefully things are better now!",
                  "author": "Anti-Itch",
                  "created": 1634436393,
                  "upvotes": 10,
                  "replies": {}
                },
                "hgy4co7": {
                  "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgy4co7/",
                  "text": "Hey, I'm not a grad student and thus don't really understand student/supervisor dynamics, so just wondering - are you saying this because you think the supervisor is attempting to piggyback on the breakthrough?",
                  "author": "SiriusBlacksGodson",
                  "created": 1634444892,
                  "upvotes": 2,
                  "replies": {
                    "hgyfd0e": {
                      "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgyfd0e/",
                      "text": "No, because the supervisor underestimated the difficulty of the problem and then based on his faulty assumption tried to usher OP out of the program with a lesser degree.",
                      "author": "eleveneels",
                      "created": 1634452312,
                      "upvotes": 2,
                      "replies": {
                        "hgz4g0p": {
                          "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgz4g0p/",
                          "text": "Ah got it, thanks for clarifying",
                          "author": "SiriusBlacksGodson",
                          "created": 1634472133,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgw4lyv": {
      "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgw4lyv/",
      "text": "Sort of -- I realized a few years into my PhD that one of the sub-problems encountered in the course of my work has been broadly unsolved for several decades. There were a few (horribly inefficient for my purposes) approximate solutions, and I played around with a few more efficient approximations of my own design, while also showing that they perform quite poorly under rather general conditions. Did develop a few interesting tricks along the way though!",
      "author": "--MCMC--",
      "created": 1634410986,
      "upvotes": 4,
      "replies": {}
    },
    "hgwskc7": {
      "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgwskc7/",
      "text": "My advisor wanted to switch my project at the end of my fourth year because we were stuck trying to figure out something in applied numerical methods. It turned out a bunch of groups had given up on this problem (without discussing it). Instead I solved the problem with a pretty sweet approximation when he was traveling for the summer. He saw my presentation and solution in my livestreamed job interview/seminar and asked me afterwards if it really worked that well; it did. I published the method and some results, won some awards and placed well in a competition. He gave me even more free reign after that then he had beforehand, and I finished my PhD a year later.",
      "author": "IComeAnon19",
      "created": 1634421464,
      "upvotes": 1,
      "replies": {}
    },
    "hgwtt3d": {
      "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgwtt3d/",
      "text": "I almost mastered out last year this time because of something similar. My first project in a new group didn’t work, despite exploring a bunch of different paths, and after a year of constant failure I was done. Switched to a new project that was better planned out, and boom, had success. We’re gonna publish it soon.",
      "author": "DikkDowg",
      "created": 1634422026,
      "upvotes": 1,
      "replies": {}
    },
    "hgx0uz1": {
      "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgx0uz1/",
      "text": "I've seen tons of people forced out of labs either to change PIs or to master out due to similar problems. Sometimes PIs suck",
      "author": "Ru-tris-bpy",
      "created": 1634425259,
      "upvotes": 2,
      "replies": {}
    },
    "hgz56hr": {
      "link": "/r/GradSchool/comments/q9gfmq/my_phd_supervisor_tried_to_force_me_to_master_out/hgz56hr/",
      "text": "I'm curious about the dynamic. How much of it was your supervisor thinking you weren't good enough and how much was, like, \"You went for it but don't have anything to show after two years. You might be better mastering out because I don't see an obvious path from master's to Ph.D.\"?",
      "author": "dcgrey",
      "created": 1634472633,
      "upvotes": 1,
      "replies": {}
    }
  }
}