{
  "sid": "hrqie2",
  "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/",
  "title:": "Compensation is experience",
  "text": "I’m so sick of seeing such a wonderful opportunities all the time being like yeah this is a full-time position in one of the most expensive cities in the country oh and by the way you’re only compensation is networking opportunities and experience. \n\nWhy? It makes it so impossible for some people to be able to actually get that position. Idc that it’s only 3 months. I can’t live in NYC for 3 months with no money 🤷🏻‍♀️",
  "author": "Strawberrystarmiya",
  "created": 1594829729,
  "over_18": false,
  "upvotes": 344,
  "upvote_ratio": 0.98,
  "comments": {
    "fy7w592": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy7w592/",
      "text": "I’ve never actually heard of anyone taking an unpaid internship outside of undergrads doing stuff for free. Is this common?",
      "author": null,
      "created": 1594871377,
      "upvotes": 2,
      "replies": {
        "fy7zh7y": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy7zh7y/",
          "text": "It might depend on the field.  STEM internships are always paid (unless they're seriously scammy), but it sounds like other fields are different",
          "author": "Setonix_brachyurus",
          "created": 1594873633,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fy79xzs": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy79xzs/",
      "text": "When I did an internship (as a 4th year doctoral student, and this was 5 years ago) my intern salary was over $80k. It might depend a lot on what industry you're trying to go into, but assuming you're not some naive first year and you can get a real project done during an internship, anything less than substantial compensation is a waste of your time.",
      "author": "unrealmachine",
      "created": 1594858305,
      "upvotes": 2,
      "replies": {}
    },
    "fy77vq5": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy77vq5/",
      "text": "We'll pay you in exposure!",
      "author": "iammaxhailme",
      "created": 1594857147,
      "upvotes": 1,
      "replies": {}
    },
    "fy76ssd": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy76ssd/",
      "text": "It's the reverse influencer move",
      "author": "ConfusedCuddlefish",
      "created": 1594856540,
      "upvotes": 1,
      "replies": {}
    },
    "fy6i5ty": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy6i5ty/",
      "text": "I did a part time unpaid internship in NYC. I worked two other jobs to pay for it, and only could manage that because I lived with my dad in NJ. I was also part time at college. I pretty much had a nervous breakdown about four months in, but by then I'd finished my major project so I considered it a win. Despite the hardship, that internship opened a lot of doors for me, and I am still name dropping that I worked for them a decade later.",
      "author": "fleeingslowly",
      "created": 1594844027,
      "upvotes": 2,
      "replies": {}
    },
    "fy64huq": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy64huq/",
      "text": "Yeah, this is the sort of systemic bias that has the effect of excluding those who are of lower socioeconomic status and help to perpetuate the under-represented status of many groups from disadvantaged backgrounds.",
      "author": "SBR249",
      "created": 1594837583,
      "upvotes": 8,
      "replies": {}
    },
    "fy6473z": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy6473z/",
      "text": "Yep. Unpaid internship is not only illegal but reeks of privilege. Bitches like Gary vee constantly talks about oh work for the experience and you’ll take off one day like ?_?",
      "author": "a6245912",
      "created": 1594837443,
      "upvotes": 5,
      "replies": {}
    },
    "fy61h6f": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy61h6f/",
      "text": "These \"jobs\" are designed for the children of the upper class. It's all about gatekeeping upward mobility while maintaining the economic privilege of the upper class. Either you need to be willing to go hundreds of thousands of dollars + into debt in order to have a chance at a decent job with a living wage or else \"you don't want it badly enough.\" To them we are a mule and they're the rider dangling the carrot in front of our face.",
      "author": "squirrel8296",
      "created": 1594836174,
      "upvotes": 34,
      "replies": {
        "fy66s2h": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy66s2h/",
          "text": "Yes, exactly. Paul Tough's book \"The Years That Matter Most\" goes into this in a lot of detail, and all the ways that college and grad school and internships gatekeep mobility.\n\nThis is why it can be so damaging and depressing for students who've grown up hearing that \"you can do anything\" and to \"never give up on what you want.\" Then those same people are shocked when their kids beg them for money to live in New York for six months, or when they get angry emails from former students saying the system is so unfair.\n\nWe used to have interns (i.e. volunteers) at my former place of work. The point of the internship was to attract a more diverse group of people into our very white, middle class industry. But it turned out, the only people who could afford to work for us for free were...white middle class people.",
          "author": "doobeedoo3",
          "created": 1594838655,
          "upvotes": 14,
          "replies": {
            "fy6afwb": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy6afwb/",
              "text": "Literally, I just graduated and was never able to do an internship because on top of taking a full load of courses with significant time commitments, I also had to work for pay (I had an office job as an administrative assistant at my university) so my Monday through Friday was pretty booked up. Now I can't even get an interview for a professional job so I get to start a crappy mall retail position next week. That was the only place that would hire me after 4 months of looking. \n\nBut hey I guess doing everything else \"right\" doesn't actually matter if you come from a poor family. (I was a co-valedictorian in high school and one of the top students in the state and then in college I had multiple publications and conference presentations along with several financial awards including fellowships)",
              "author": "squirrel8296",
              "created": 1594840368,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "fy6yx9o": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy6yx9o/",
          "text": "I think there is a significant difference between these two ideas. One is that (1) companies create unpaid positions to save money and take advantage of competition in the applicant pool. The other is that (2) unpaid internships are expressly created to block upward mobility by non-wealthy folks. (1) can be true and have the effect of blocking mobility without supposing there are some malevolent actors designing career entry points to protect the wealth of all rich people. You may think I am arguing semantics, but it is really important for productive discussion to temper one’s cynicism and avoid relying on some hypothetical bogeyman",
          "author": "LetThereBeNick",
          "created": 1594852295,
          "upvotes": 4,
          "replies": {
            "fy70jql": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy70jql/",
              "text": "Except the wealthy in the United States have spent generations on exploiting and disenfranchising the working class (among other groups) and pitting working class people against each other. It is how they maintain power. I would argue that even if your reason 1 is the original reason, your reason 2 is a happy accident side effect that convinces them to continue to have these unpaid roles and even expand them.\n\nAnd yes, the wealthy in the US are bogeymen because you don't become wealthy by being a kind and generous person, you become wealthy by exploiting people and pocketing as much money as you can.",
              "author": "squirrel8296",
              "created": 1594853159,
              "upvotes": 4,
              "replies": {}
            },
            "fy88gib": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy88gib/",
              "text": "> (2) unpaid internships are expressly created to block upward mobility by non-wealthy folks.\n\nAre you denying the only way to secure one of these effectively is to have a second source of income?\n\nThe practical effect is to let rich young folks on daddy's and mommy's money secure connections for later jobs while forcing poorer people to have to kill themselves saving up $$$ or working a second off-shift job for money for daily living.\n\nIDK about you but working 16 hours a day for a job that only pays for 8 is not my idea of a 2 for 1 deal.",
              "author": "alvarkresh",
              "created": 1594880796,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fy5ybzu": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5ybzu/",
      "text": "I totally get where you’re coming from, and I hate it too. However, I’ve gotten some “jobs” that cover food and housing but don’t pay for anything other than that - and those are worth it to me....especially if it’s to live somewhere cool... I’ve so far lived for three months in Aspen, CO in Austin, TX and in Graz, Austria. I have the say, the experience of living in those cities, working hard with a talented group of people also working hard with me, and making new friends I’ve kept for years, is totally worth it for me.\n\nI save up all year for those opportunities because I have other bills and life things to pay for during the summer, and not having a real salary for three months is ROUGH. But there IS value in “experience” if you can manage to save up for it.\n\nAlthough, If they didn’t give me food and housing I wouldn’t go.",
      "author": "Astrnougat",
      "created": 1594834707,
      "upvotes": 12,
      "replies": {
        "fy68jyx": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy68jyx/",
          "text": "I totally agree with this. But this one specifically didn’t cover any expenses.",
          "author": "Strawberrystarmiya",
          "created": 1594839480,
          "upvotes": 3,
          "replies": {}
        },
        "fy69u07": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy69u07/",
          "text": "Do I sense a musician talking about Aspen and perhaps Round Top?  :)",
          "author": "ChetBakersDentures",
          "created": 1594840079,
          "upvotes": 2,
          "replies": {
            "fy6u1vf": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy6u1vf/",
              "text": "Shhh - our lives are a secret don’t share the goods",
              "author": "Astrnougat",
              "created": 1594849819,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fy5y1ch": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5y1ch/",
      "text": "Yeah, it sucks because it limits the opportunities of those that are not as economically privileged and do not have the means to live 3 months without being paid directly.",
      "author": "FewActinomycetaceae9",
      "created": 1594834569,
      "upvotes": 13,
      "replies": {}
    },
    "fy5uzjf": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5uzjf/",
      "text": "Are you allowed to get your own funding? Look into NSF and other grants for students, if you actually want to be at this place specifically. If you're just venting, disregard!",
      "author": "domesticokapis",
      "created": 1594833148,
      "upvotes": 2,
      "replies": {
        "fy5zkkr": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5zkkr/",
          "text": "I considered going this route but it's aimed at traditional students. They offer funding, which would cover rent/utilities/food at the new location but was not enough to cover my bills back home. Also, travel was never included for the programs I searched for.",
          "author": "campbell363",
          "created": 1594835281,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fy5ptpf": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5ptpf/",
      "text": "Most unpaid internships are illegal and you should report them. If you're doing work that an employee would do and/or the position doesn't provide \"significant educational benefit,\" they have to pay you. [https://www.dol.gov/agencies/whd/fact-sheets/71-flsa-internships](https://www.dol.gov/agencies/whd/fact-sheets/71-flsa-internships)",
      "author": null,
      "created": 1594830721,
      "upvotes": 62,
      "replies": {
        "fy5uoau": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5uoau/",
          "text": "To clarify, it's illegal if it's a 'for profit' company. Universities still take unpaid interns with the illusion that it's 'educational'.",
          "author": "campbell363",
          "created": 1594833002,
          "upvotes": 47,
          "replies": {
            "fy72hto": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy72hto/",
              "text": "yep, I got a summer research offer at CUNY that was unpaid but they were like “oh, you can get college credits! but you have to find a professor willing to mentor you for those hours, and see if your school will accept this as a credit at all”. obviously I had to pass on it lol, but it was so obvious that they didn’t care about helping interns who weren’t wealthy or within commuting distance",
              "author": "leahbee25",
              "created": 1594854207,
              "upvotes": 10,
              "replies": {
                "fy7cswb": {
                  "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy7cswb/",
                  "text": "Look into REUs and other structured programs. There are tons of paid research opportunities out there, but specific groups often don't have the funds to hire someone.",
                  "author": "mediocre-spice",
                  "created": 1594859944,
                  "upvotes": 3,
                  "replies": {
                    "fy7gyi9": {
                      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy7gyi9/",
                      "text": "yeah i’m in social sciences (linguistics) so research opportunities can be scarce. i’ll check it out, thanks!",
                      "author": "leahbee25",
                      "created": 1594862327,
                      "upvotes": 1,
                      "replies": {
                        "fy7ikxy": {
                          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy7ikxy/",
                          "text": "[Linguistlist.org](https://Linguistlist.org) might help!",
                          "author": "mediocre-spice",
                          "created": 1594863264,
                          "upvotes": 2,
                          "replies": {
                            "fy7kvpg": {
                              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy7kvpg/",
                              "text": "i love linguistlist! thank you for the rec",
                              "author": "leahbee25",
                              "created": 1594864577,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fy8vwn1": {
                  "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy8vwn1/",
                  "text": "That's bizarre. Usually you at least see some tuition remission with these gigs. I took one of those with my undergrad.",
                  "author": "ajd341",
                  "created": 1594902710,
                  "upvotes": 1,
                  "replies": {
                    "fy8wuvj": {
                      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy8wuvj/",
                      "text": "I mean I didn’t go to CUNY, I went to an undergrad in the south, and it wasn’t a research position not a class so there was no tuition. idk what would’ve happened if i took them up on the course credit offer, i didn’t get that far in the process. bizarre nonetheless",
                      "author": "leahbee25",
                      "created": 1594903368,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fy5ysj7": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5ysj7/",
          "text": "Just before COVID started I found out that my internship at the parks department (museum) was being logged as volunteer service despite being told I was an intern, doing intern duties, and even being referred to having an internship. Ends up that internships are supposed to be paid so in order to cut down on costs, I was input as a volunteer. At that point I was only going in twice a week because of school but for months I had been going daily from 8am to 4pm. When paid positions opened up, I wasn't even given the opportunity to apply and the jobs went to people less qualified than me.",
          "author": "coastalsagebrush",
          "created": 1594834918,
          "upvotes": 24,
          "replies": {
            "fy5z2ho": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5z2ho/",
              "text": "I originally got that internship in order to break into the parks department which is surprisingly competitive. I was there for 10 months and they hired 3 people during that time.",
              "author": "coastalsagebrush",
              "created": 1594835047,
              "upvotes": 11,
              "replies": {}
            },
            "fy5zk10": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5zk10/",
              "text": "That's ridiculous and if they told you prior to you starting work that you were paid, you should definitely contact Department of Labor, the state DOL, and on-campus legal resources if available to you.",
              "author": null,
              "created": 1594835274,
              "upvotes": 10,
              "replies": {
                "fy63ghn": {
                  "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy63ghn/",
                  "text": "This constantly happens to unpaid interns too, there needs to just be a blanket law passed that interns must be paid at least minimum wage. If a for-profit company needs volunteers because it can't afford to pay everyone then that company doesn't need to exist.",
                  "author": "squirrel8296",
                  "created": 1594837100,
                  "upvotes": 7,
                  "replies": {
                    "fy654ew": {
                      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy654ew/",
                      "text": "I mean we basically have that (for-profit companies have to pay people if they are doing work an employee would do), but it isn't enforced and too many people are afraid to report illegal internships.\n\nJohn Stewart did a great interview on how paying interns creates better companies/products: [https://www.youtube.com/watch?v=JVzZK2mLGi4](https://www.youtube.com/watch?v=JVzZK2mLGi4)",
                      "author": null,
                      "created": 1594837877,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                },
                "fy65qkh": {
                  "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy65qkh/",
                  "text": "They didn't tell me that before hand. I found out from another employee that all internships are supposed to be paid. I had gone in thinking it was supposed to be unpaid and that I would gain experience and network, which I didn't because I already had more museum experience than the employees so I ended up teaching them stuff and the museum director had this weird thing where he didn't like us interacting with other people ( us museum people weren't allowed to talk to the grounds maintenance people and we never did any collaboration with other parks in the district). I don't know if campus legal resources is something I could go to because it wasn't through the campus. \n\n\nEither way, Covid happened and I stopped going in (with an email to the director explaining that I do not feel comfortable coming in for the duration of the pandemic) and I'm probably not going back. Which is probably the best way to leave because last summer I had gotten another internship at a way better institution (thanks to my grad advisor) and had to cut one day out of my week to go there and he was extremely jealous and kind of mean because of it.",
                  "author": "coastalsagebrush",
                  "created": 1594838165,
                  "upvotes": 2,
                  "replies": {
                    "fy66yf4": {
                      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy66yf4/",
                      "text": "Sounds like a shitty situation all around. Quick note that may help you or others:\n\n>campus legal resources is something I could go to because it wasn't through the campus\n\nCampus legal resources generally don't exist to help you with on campus issues: they don't want to give a free lawyer to sue them with. They are generally there to help with issues you may face while in school like landlord conflicts, immigration, and employment/internships.\n\nThe stuff with your advisor seems toxic af and I hope you're able to find a healthier advisor.",
                      "author": null,
                      "created": 1594838739,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fy5uni5": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5uni5/",
          "text": "i appreciate the optimism, but every internship has \"significant educational benefit\" when you cant afford a lawyer",
          "author": "murdermeformysins",
          "created": 1594832992,
          "upvotes": 17,
          "replies": {
            "fy5utr7": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5utr7/",
              "text": "You dont need a lawyer, you just report them to the Department of Labor. You arent suing anyone, youre reporting a crime.",
              "author": null,
              "created": 1594833073,
              "upvotes": 10,
              "replies": {
                "fy5yue0": {
                  "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5yue0/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1594834942,
                  "upvotes": -6,
                  "replies": {
                    "fy5zbby": {
                      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5zbby/",
                      "text": "Idk why you're asking me these questions when Google exists, but yes the processing is confidential and it's extremely illegal for a company to retaliate or discriminate against you for filing a DOL complaint: [https://www.dol.gov/agencies/whd/contact/complaints/information](https://www.dol.gov/agencies/whd/contact/complaints/information)",
                      "author": null,
                      "created": 1594835161,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fy5p3zp": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5p3zp/",
      "text": "Im sure they do that to save money, but that leads to attracting wealthy applicants who don't need the money. Its disgusting and perpetuates poverty.",
      "author": "WesternBruv",
      "created": 1594830383,
      "upvotes": 336,
      "replies": {
        "fy63p86": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy63p86/",
          "text": "Very true. Jon Stewart (of the Daily Show) had an interview where he mentioned how paying the summer interns was pivotal to increasing diversity at the Daily Show. If you don't pay interns, you only attract candidates from wealthy families who can afford to work without being paid, just as you said. And summer interns eventually become full-time employees, and the cycle continues.",
          "author": "photo-smart",
          "created": 1594837212,
          "upvotes": 214,
          "replies": {
            "fy68gg8": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy68gg8/",
              "text": "Well put",
              "author": "WesternBruv",
              "created": 1594839435,
              "upvotes": 15,
              "replies": {}
            }
          }
        },
        "fy7073g": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy7073g/",
          "text": "I've even seen pay-to-internship programs.  I'm not falling for that shit.",
          "author": "battle-obsessed",
          "created": 1594852971,
          "upvotes": 32,
          "replies": {
            "fy7w5dw": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy7w5dw/",
              "text": "One of the biggest issues in the field of dietetics. It’s the only health profession that requires a unpaid 8 month internship (and in 2024, a Masters) to qualify candidates to sit for the licensing exam to become a registered dietitian. \nThe field is full of wealthy white women.",
              "author": "radhobo",
              "created": 1594871379,
              "upvotes": 22,
              "replies": {
                "fy8s6r9": {
                  "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy8s6r9/",
                  "text": "Oh my god, that actually explains so much.",
                  "author": "sailawayorion",
                  "created": 1594899889,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "fy7rvpg": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy7rvpg/",
              "text": "Wow that's a new one.",
              "author": "TheJCBand",
              "created": 1594868703,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "fy5y7z4": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5y7z4/",
          "text": "Came here to say the same thing. These opportunities exist for people who don't need money because their family will support them.",
          "author": "boxdkittens",
          "created": 1594834654,
          "upvotes": 58,
          "replies": {}
        },
        "fy5r1bf": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5r1bf/",
          "text": "Or it attracts locals. NYC isn't just billionaires and celebrities.",
          "author": null,
          "created": 1594831286,
          "upvotes": -82,
          "replies": {
            "fy5r9f9": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5r9f9/",
              "text": "But if it's a full time position and you're local, okay you don't have to move but how are you going to pay your rent and for food and other living needs without pay? Are they expected to take on part time jobs on top of this \"experience\"?",
              "author": "merows",
              "created": 1594831391,
              "upvotes": 72,
              "replies": {
                "fy5trqi": {
                  "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5trqi/",
                  "text": "Some grad students have year round funding, so you're still paid even while doing an internship. Especially in summer, it's more about getting X amount of work done between May and August and it's not uncommon for people to do internships, unrelated projects, trainings, vacations.",
                  "author": "mediocre-spice",
                  "created": 1594832577,
                  "upvotes": -2,
                  "replies": {
                    "fy7b3xz": {
                      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy7b3xz/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1594858967,
                      "upvotes": 12,
                      "replies": {
                        "fy7cbni": {
                          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy7cbni/",
                          "text": "> \"Some\"",
                          "author": "mediocre-spice",
                          "created": 1594859668,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fy5ry75": {
                  "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5ry75/",
                  "text": "Well, if I was a full-time student in NYC I would probably be surviving on student loans and a summer load which is considered \"full time.\" I did that in NYC for almost four summers, so yes, it's possible.\n\nAre unpaid internships exploitative? Maybe, it depends. But they most certainly do not lead to \"only\" attracting wealthy applicants. If you have the kind of money that you can pick up, move to NYC and get an apartment for three months, then I''d think unpaid internships are probably not atop your list of summer opportunities.",
                  "author": null,
                  "created": 1594831716,
                  "upvotes": -63,
                  "replies": {
                    "fy5sxfm": {
                      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5sxfm/",
                      "text": "I would argue having to take loans out in order to complete a summer internship would not be an acceptable option for most. Especially in the context that this is the Grad School sub, the interns have degrees already and likely have quite a bit more responsibility than undergrad interns, both in the position and in their own lives. I know I can't take an unpaid internship as a 4th year PhD student and leave my partner in a lurch on rent, even if I stayed in my current location.",
                      "author": "merows",
                      "created": 1594832178,
                      "upvotes": 44,
                      "replies": {
                        "fy5uak3": {
                          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5uak3/",
                          "text": "If you are already living in the geographical area where the internship is then you presumably have some sort of plan for how you plan on surviving while living there. Saying an internship is \"exploitative\" simply because it doesn't pay money to cover living expenses is a bit much. There may very well be a perfectly reasonable rationale behind it (again, like I suggested, trying to pull from the local area).\n\nAbsolutely, some employers abuse free interns. Those cases of abuse don't make all unpaid internships exploitative.\n\nSome in my field have to *pay* for their internships because they are generated for credit. You might argue that's exploitative, but interns in my field are not a \"set it and forget it\" type of arrangement.",
                          "author": null,
                          "created": 1594832824,
                          "upvotes": -57,
                          "replies": {
                            "fy5zrzy": {
                              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5zrzy/",
                              "text": "Yeah no that’s literally what exploitation is. The only rational reason for it from an employer’s perspective is to get free labor. That’s it.",
                              "author": "maltymawma",
                              "created": 1594835378,
                              "upvotes": 28,
                              "replies": {}
                            },
                            "fy67mc7": {
                              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy67mc7/",
                              "text": "So close to r/selfawarewolves material",
                              "author": null,
                              "created": 1594839049,
                              "upvotes": 13,
                              "replies": {}
                            },
                            "fy5vmb0": {
                              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5vmb0/",
                              "text": "In my case, I’m getting a stipend from my PhD research assistance ship. If I stop working in the lab to take an internship, I am no longing being paid by the lab. This is the case for many many PhD students.",
                              "author": "merows",
                              "created": 1594833450,
                              "upvotes": 20,
                              "replies": {}
                            },
                            "fy60oiz": {
                              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy60oiz/",
                              "text": "Right, right, got it. So free labor ≠ exploitative, good point!",
                              "author": "ZachTheYek",
                              "created": 1594835802,
                              "upvotes": 19,
                              "replies": {}
                            },
                            "fy621cr": {
                              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy621cr/",
                              "text": "You literally just described the situation as exploitation while trying to say that it isn't exploitation.",
                              "author": "squirrel8296",
                              "created": 1594836435,
                              "upvotes": 11,
                              "replies": {}
                            },
                            "fy7fz9c": {
                              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy7fz9c/",
                              "text": "Wow, this has completely blown up. Maybe a clarification.\n\nIn my field interns come in at the level of unexperienced technicians. They can probably follow a decision tree and do basic tasks, but that's about it. So their \"work\" actually is generally not at a professional level -- and in a health care field, that's actually a liability. So intern \"work\" requires constant supervision, correction, monitoring. Which costs FTEs and employee productivity. In turn, the internships are accredited, so that also costs money. Someone has to ensure quality control and make sure that the pedagogical requirements are met for the internship, so again -- money, FTEs. So depending on the field, no, this \"free labor\" isn't exactly free for the employer, either. That's why the internships have a price tag.\n\nEmployers using interns to do scut work that anybody with a pulse can do? Yeah, absolutely. That's exploitative. But bringing somebody into a business or work environment on a temporary basis, basically showing them the ropes and investing time (and by extension money) into them without necessarily seeing the payoff of getting them as an employee, as a resource for advancing the mission of whatever organization you're in? It seems a bit entitled at the very least to moan and complain because someone isn't being paid enough to live in NYC on an interim basis to basically learn skills at someone else's expense. Particularly if that involves one of the most expensive places to live in the country. But maybe in this sub \"unpaid internships are exploitative\" is a tautology.",
                              "author": null,
                              "created": 1594861764,
                              "upvotes": 2,
                              "replies": {
                                "fyh6uqz": {
                                  "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fyh6uqz/",
                                  "text": "If companies want well trained employees, then they should pay them for their training. It used to be pretty standard practice until labor laws in this country got gutted. Plenty of companies will still pay people to get MBAs.",
                                  "author": "RepoRogue",
                                  "created": 1595091859,
                                  "upvotes": 0,
                                  "replies": {
                                    "fyhh2pa": {
                                      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fyhh2pa/",
                                      "text": "What on earth are you talking about? Most companies do train their employees. What else do you call a probationary period? Everybody with an ounce of real-world experience knows that the skills you acquire in school are molded by the workplace. A lot of forward-thinking community colleges have teamed up with local employers to create school-to-job pipelines. Fact is, secondary education in much of this country is a joke and many employers struggle to find people with the skills they need.\n\nThose were also very different times you are thinking about where there was far less job mobility and it was common to stick to one employer for a few decades at least. Much less likely to happen these days. Whether that's good or bad overall I don't know, it certainly rewards those with skills. It has more to do than just \"gutting\" labor laws. There are also macroeconomic changes, automation, and others.\n\nThose situations are all different than a 3-month temporary summer appointment or whatever the OP is wailing about where there doesn't really seem to be an expectation of continued employment after. Yeah, it'd be nice if they paid free rent, relocation, and a living stipend but that seems ridiculous to me, personally. There are only a handful of industries that do that (law, tech). If you're already based in NYC it might be a good deal in whatever field they're working in.",
                                      "author": null,
                                      "created": 1595097420,
                                      "upvotes": 0,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fy5ou3z": {
      "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy5ou3z/",
      "text": "No shit. 10/10 agree. Unpaid jobs should be illegal. Matter of fact, underpaid jobs should be too. Living wage or bust.",
      "author": "r_307",
      "created": 1594830254,
      "upvotes": 170,
      "replies": {
        "fy62w64": {
          "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy62w64/",
          "text": "Technically according to a former USA labor secretary (I think it was Robert Reich), unpaid jobs are illegal (I will update if I find the exact quote), it is just never enforced since the person isn't actually an employee. Plus under the numerous studies students who do unpaid internships have a significantly lower chance of it getting them a job (even with a different employer) than students who did a paid internship ([https://www.facebook.com/RBReich/photos/a.404595876219681/1254887131190547/](https://www.facebook.com/RBReich/photos/a.404595876219681/1254887131190547/)). Another study I remember put them on par with students who did no internship at all.",
          "author": "squirrel8296",
          "created": 1594836838,
          "upvotes": 38,
          "replies": {
            "fy69knx": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy69knx/",
              "text": ">Plus under the numerous studies students who do unpaid internships have a significantly lower chance of it getting them a job (even with a different employer) than students who did a paid internship (https://www.facebook.com/RBReich/photos/a.404595876219681/1254887131190547/).\n\nI mean, it makes sense when you consider that the company has such little respect for their interns that they won't even pay them.",
              "author": "oscarwhiskeyoscar",
              "created": 1594839957,
              "upvotes": 16,
              "replies": {}
            },
            "fy65hk7": {
              "link": "/r/GradSchool/comments/hrqie2/compensation_is_experience/fy65hk7/",
              "text": "Prof Reich has always been a solid dude.",
              "author": "jinnyjinster",
              "created": 1594838047,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634066903
}