{
  "sid": "rb1ssg",
  "link": "/r/GradSchool/comments/rb1ssg/i_am_admitting_to_myself_that_i_am_burnt_out_what/",
  "title:": "I am admitting to myself that I am burnt out... what are some reasonable next steps and how can I use the holidays to my advantage?",
  "text": "I think this term I got smacked with difficult courses I wasn't expecting to be that difficult. Earlier this year, I got through my comprehensive exams (which I only found out I was doing maybe 4 months prior to doing them), and went on a month long intensive workshop over the summer. I felt like I barely had a break and stupidly continued to have research meetings over the one week \"holiday\" I took to visit my family after 2 years of not seeing them due to COVID. \n\nThe term is nearing the end and I am reflecting back on how much I actually just hung on by a few threads. My exams are this week and i have no motivation to get through them. I'm so tired and I don't know what to do. I think I finally realized that this whole term I've probably been extremely burnt out which is why I can't focus or comprehend my coursework as well as I used to and why my research has been slow moving. \n\nI want to take at least a week off foe Christmas and try to recharge but at this point I don't know if that's possible. I feel like I always have something in the back of my mind and I'm unable to fully disconnect from the academic stressors in my life and constant worry of my low pay, academic performance, and future prospects. I also feel pressured because my advisors are paying me and I will have a performance review sometime next June and I am scared to hear their feedback (even though I have plenty of time to work my way back up). I feel pressured by myself mostly and I don't think I know how to cut myself some slack. I feel mentally exhausted and I am starting to slowly check out and be more apathetic. I think if I had to work anymore I will have a mental breakdown and it will set me back even more. \n\nAny resources or advice would be useful. Thanks in advance.",
  "author": "Anti-Itch",
  "created": 1638891305,
  "updated": 1639518895,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hnltp6m": {
      "link": "/r/GradSchool/comments/rb1ssg/i_am_admitting_to_myself_that_i_am_burnt_out_what/hnltp6m/",
      "text": "Here's what I would tell you. Burnout creeps up over time, by your choices. Take 2 weeks. The research isn't going to move forward with you in burn out, and you'll waste an opportunity to truly take care of yourself.\n\nIf you live in another city than where your family is that you are visiting, leave anything you would need for research at home and don't you dare try to get around this with others computers.\n\nI do my absolute best to encourage my advisors that, I will be in full shutdown for 2 weeks, and even encourage them to do the same, as if we don't take a little rest, we'll wittle ourselves down to nothing.\n\nFinally, it's okay to feel a bit of panic when you get away from everything, you're in a state of stress constantly, your body will trick you into feeling it regardless of whether you are doing something or not.\n\nWhatever you do, just rest, mentally and/or physically. Do things that you know you enjoy, connect with people who are outside this study. Best of luck 😄",
      "author": "Big_Faithlessness625",
      "created": 1638892780,
      "upvotes": 2,
      "replies": {}
    },
    "hnrxzsf": {
      "link": "/r/GradSchool/comments/rb1ssg/i_am_admitting_to_myself_that_i_am_burnt_out_what/hnrxzsf/",
      "text": "You should take it seriously. Really bad burnout can last for a very, very long time.\nI crashed and burned once during an incredibly stressful time when I was young(er) and stupid and didn't know my limits. I just kept going and going until one day I literally couldn't get out of bed. \n\nIt took me 2 months before I managed to return to work.\n1 month where all I managed was drop my kids off to childcare, cry, sleep on the couch, pick up the kids. All my energy was spent on them, I had nothing else to give to anybody or anything.\nThen 1 month of more normality, but I was still put on sick leave by my GP. \n\n(Then I got pregnant again and have been exhausted ever since lol. Over a decade ago! But I've never crossed the line again. I know the signs now.) \n\nIt was a really valuable experience that taught me the hard way that even us \"I can do it all\" types have our limitations.\n\n I've later told that story in job interviews, successfully. There is a maturity in knowing that you have to draw the line somewhere and not think that you are some kind of superperson.\n\nSo look after yourself. The world can wait.",
      "author": "Naivemlyn",
      "created": 1639001918,
      "upvotes": 1,
      "replies": {}
    }
  }
}