{
  "sid": "q4dvb9",
  "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/",
  "title:": "Anyone else just cry? Like multiple times per week?",
  "text": "I think I’ve cried at least 3x a week in the last month. This is not enjoyable and I feel like a failure. I’m getting my masters of social work and online school on top of the mandatory unpaid internship, plus working part time in healthcare is KILLING me. I want so desperately to do social work as a profession, but grad school is just not doing it for me.",
  "author": "help_my_headaches",
  "created": 1633752552,
  "updated": 1634603395,
  "over_18": false,
  "upvotes": 277,
  "upvote_ratio": 0.95,
  "comments": {
    "hfyeuog": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfyeuog/",
      "text": "This is me too. I’m drowning and I feel like nobody really understands how hard this is.",
      "author": "soytitties",
      "created": 1633763718,
      "upvotes": 69,
      "replies": {
        "hfzgpqw": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzgpqw/",
          "text": "Hope it gets better for you :/ it seems like the reason it’s so hard to get anyone to understand is because everyone’s situation is so unique. No one grad experience is like the next. The pandemic I think just made everything that much worse, or more apparent, and it’s not going to go away instantly either.\n\nThe best we can do is take it day by day and find little joys whenever you can :) I don’t have it figured out, it honestly feels like it’s only getting worse, but I try to find something to smile or laugh about and it does make it a bit easier.\n\nAlso, food. Delicious, non-junk food (and sometimes junk!) does make it better too 😋",
          "author": "NattyKhala",
          "created": 1633789626,
          "upvotes": 18,
          "replies": {}
        },
        "hg00o1v": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg00o1v/",
          "text": "Same. I understand how hard it is for you, and I'm proud of you for trudging through all the bullshit :)",
          "author": "noface_18",
          "created": 1633798773,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hfz7k6z": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfz7k6z/",
      "text": "This is common in grad school, but not “normal” in the sense that it is not healthy and you should not ignore it. \n\nIf you have time, talk to a counselor. If you absolutely can’t do that, at minimum take time for yourself and take care of yourself. Grad school is NOT forever. You can make it through, you can take LOA, you can drop out and reapply later. There are options. You’re not stuck and this period will pass.",
      "author": "botheorange",
      "created": 1633784823,
      "upvotes": 49,
      "replies": {
        "hfzuyu7": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzuyu7/",
          "text": "Total agree. Grad school is all sorts of things that will make you want catharsis, but if it gets to the point of regular crying, that is your body and mind telling you that change is needed. You can change yourself and/or you can change your surroundings. Either way, if someone close to me told me this, I'd help them find counseling or a new job or something. \n\nI hope you find yourself in a better position soon, /u/help_my_headaches",
          "author": "nightstreetlamppharm",
          "created": 1633796248,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "hfymi5c": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfymi5c/",
      "text": "Yes, I've had periods of this during grad school.\n\nIt was the time I started seeking professional mental health help, because although I did see myself fit into grad schools, it also brought me a lot of stress, partly brought by previous unresolved past experiences and lots of anxiety, perfectionism, depression, self esteem and self doubt (it turns out that is a personality disorder).\n\nPlease take these signs seriously. Depression is also a part of burn-out and it's not worth it to hold a high standard forever. I don't want to say you should drop any of your tasks, but perhaps look if it's possible (also financially) to lower the pace. I'm now in my PhD and enjoying my work thoroughly, but I'm also taking sick leave to work on my mental health right now.",
      "author": "nlhans",
      "created": 1633769624,
      "upvotes": 28,
      "replies": {}
    },
    "hfy09lu": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfy09lu/",
      "text": "I told my partner this week that I have never cried this much or this often before (I'm 1.5 months in to my program). She just turned around and gave me the saddest look I've ever seen.",
      "author": "ohdangherewego",
      "created": 1633753815,
      "upvotes": 65,
      "replies": {
        "hfy0kaq": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfy0kaq/",
          "text": "I’m glad you’ve got support. I get a “buck up kiddo” type of response from everyone in my life. I’ll be okay, eventually. I just need to wallow for a little bit. I’ve always loved school, but I do not love this. Which is what’s throwing me for a loop.",
          "author": "help_my_headaches",
          "created": 1633753983,
          "upvotes": 44,
          "replies": {
            "hfy3jb5": {
              "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfy3jb5/",
              "text": "Right there with ya! It's def not all support over here. It took me saying that to actually get a response like that. Before, she was just talking about how she got through grad school on her own, so she shouldn't have to support me. Still got some kinks to work out, as you can see.\n\nWe can do this!!!",
              "author": "ohdangherewego",
              "created": 1633755813,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "hfy6dsu": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfy6dsu/",
      "text": "100%. I'm 6 years deep into a PhD and I will never admit how often I  shed tears. Stress tears, sad tears, angry tears, the whole buffet. You sound like you have a lot on your plate, but no one here knows how much is too much. Only you.",
      "author": "DishsoapOnASponge",
      "created": 1633757709,
      "upvotes": 50,
      "replies": {
        "hfzboo9": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzboo9/",
          "text": "I don’t cry often, but boy do I want to regularly from grad school. The only reason that I don’t is it’s physically hard for my eyes to start tearing up, for whatever reason.",
          "author": "Milch_und_Paprika",
          "created": 1633787081,
          "upvotes": 8,
          "replies": {
            "hfzgual": {
              "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzgual/",
              "text": "The years of repression",
              "author": "rediculousradishes",
              "created": 1633789688,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hg0lirc": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0lirc/",
          "text": "Don't forget the glad tears. I've cried because something was over. Working part time and it's like DEC 10th. I finished a huge part of my project 2 hours before I head off to work. I had literal tears of joy until I got to work and cleaned myself up. Another time was writing my thesis and found a paper that went over the wrong ways to do something and I just straight up compared it to my methods and nothing was wrong. Cried all day because the dread in my head that I did something wrong.",
          "author": "suckuma",
          "created": 1633808001,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfy45ji": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfy45ji/",
      "text": "Wallow buddy! I’ve broken this week especially bc admin stuff/a medium dumb milestone exam (in principle write a proposal is a good educational thing for grad students to do but the execution and completely inconsistent unreliable and in many cases completely absent faculty engagement with the process combined with an admin person who clearly I hurt somehow) is getting in the way of me preparing for a conference and trying to actually write the paper and get it submitted somewhere so it’s actually safe to talk about this paper’s data at said conference.",
      "author": "SeizureHamster",
      "created": 1633756214,
      "upvotes": 8,
      "replies": {
        "hg11dvq": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg11dvq/",
          "text": "Best of luck to you with everything you got going on ❤️ hang in there, you’ll see the fruits of your labor soon enough!",
          "author": "NattyKhala",
          "created": 1633814967,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hg06as3": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg06as3/",
      "text": "This was me in grad school too! \n\nSomething that helped was a friend one day randomly showing me a graph on her phone. The graph was titled \"Reasons Why I'm Crying\". Apparently she had been collecting data for weeks and had it sorted into severity levels, antecedent categories, and coping mechanism deployed. It made me realize that grad school kind of sucks for most people and it's ok to cry several times per week.",
      "author": "robotscantrecaptcha",
      "created": 1633801234,
      "upvotes": 8,
      "replies": {
        "hg2qtob": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg2qtob/",
          "text": "[deleted]",
          "author": null,
          "created": 1633847870,
          "upvotes": 1,
          "replies": {
            "hg4a8e8": {
              "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg4a8e8/",
              "text": "I can't speak for everyone's experiences obviously but I think it often has to do with two main factors. First, graduate school programs by unintentional design lack positive feedback. Students are often working on long term research projects where the it takes years to be published. Essentially, the rewards are not very immediate and the ratio of positive feedback to negative corrective feedback is quite skewed. Second, unlike when working for corporations, grad students are very much stuck in their programs without the ability to leave. If you dislike your job, you can always start looking for a job at another corporation. In graduate school, there are very few options to switch advisors or programs without significant setbacks which leads to a feeling of helplessness. That's all compounded by long hours, low pay, and the fact that most folks move for their programs (removing you from your support network).",
              "author": "robotscantrecaptcha",
              "created": 1633883051,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hfyde19": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfyde19/",
      "text": "Life is shitty sometimes. I can understand you. It's easy for others to say things will be alright and be strong. Only you will know your difficulties. It's not easy for everyone to stay under control everytime. And it's perfectly alright to cry and let out your emotions. But if it's persistent I would suggest you to seek professional help. If it's difficult to reach out to therapist due to many reasons, contact your student support groups/ college counselor. \n\nTake care of your physical and mental health. I hope things get better for you soon. 🫂",
      "author": "HurlyBurlyHuman",
      "created": 1633762608,
      "upvotes": 6,
      "replies": {}
    },
    "hg0fmhx": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0fmhx/",
      "text": "I can't beleive what I just read. I am also doing my masters and working an unpaid internship 80% plus my paid job in healthcare 50% and working on my thesis, plus 4 kids and 2 dogs ect. It is killing me! I had suicidal thoughts and even looked up what would be the best way to go(very unlike me, and don't worry, I won't do it). I don't really cry but this has been the most challenging part of my life. I got mad at my bf for calling me a machine, even though he meant it in a good way. I feel so depressed and exhausted. The worst is when I don't have a day off for 3 weeks. Not sure I can help you but atleast we are not alone. My only advice would be to immidietly cut out anything non important. Let your family members help with kids or pets, have people bring you dinner and pay them back another time, ask for help and get some qaulity alone time! Good luck❤",
      "author": "1girlonreddit",
      "created": 1633805373,
      "upvotes": 4,
      "replies": {}
    },
    "hfzhngu": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzhngu/",
      "text": "I dont have advice. I am just here for solidarity. I am in my first semester of my MSW program and I have cried at least 3x a week since we started in August. It is a lot and I am feeling burnout and I just wish I could hit pause and sleep for two weeks.",
      "author": "hyggepuppiescoffee",
      "created": 1633790075,
      "upvotes": 7,
      "replies": {}
    },
    "hfy61an": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfy61an/",
      "text": "Do you have to work part time too? That sounds like too much",
      "author": "doyouevenIift",
      "created": 1633757470,
      "upvotes": 3,
      "replies": {
        "hfy6tqo": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfy6tqo/",
          "text": "For the program I don’t. However, to be able to intern where I am, I do. It’s the only way I can have access to the systems I need.",
          "author": "help_my_headaches",
          "created": 1633758014,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg08fcs": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg08fcs/",
      "text": "yes. Cried at work on Thursday. On top of depression…HARD.",
      "author": "TrafficNatural7476",
      "created": 1633802160,
      "upvotes": 3,
      "replies": {}
    },
    "hfy5bo7": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfy5bo7/",
      "text": "No.",
      "author": "ostrogotha",
      "created": 1633756988,
      "upvotes": 11,
      "replies": {
        "hg0ark4": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0ark4/",
          "text": "Good to see this, I was starting to think I’m the weird one for *not* crying lol.",
          "author": "You_Stole_My_Hot_Dog",
          "created": 1633803193,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfyex25": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfyex25/",
      "text": "Yea....that was me for a few years. My situation was a little different...not exactly sure what your field is like, but I got a PhD in genetics, and I would say the toughest issue in school was just \"getting through\" it when so much of my experiments (it's normal for this to happen to others in labs) would 'fail' or yield results that were \"uninteresting\" and therefore in the broken science publishing unpublishable. Soooo I'm assuming there are just aspects in your field that although different, it just feels like you're constantly beating your head against a brick wall and then nothing happens. Sometimes you chip away at it, but it's so few and far between, and then right after you're just back to the same ol' same ol'. Depression, imposter syndrome, all real and all so common....sorry.\n\nIf your experience is like most others', and forgive me because I have to make an assumption, most likely your brain is lying to you in some way or another. If I were in your shoes, I would immediately, if you can:\n\n1. Take advantage of your school's mental health resources. If they are limited (mine only allowed twenty visits in my 6 years....) or just not there, seek outside professional help.\n2. If you get diagnosed for anything, get it on record with your school, whatever that may entail.\n3. If you aren't, get more connected with others in your program and plan to do some things outside of school.\n4. Be kind to your body and mind.\n\nFeel free to reach out for other strategies. It's easy to see all the bullshit I went through, all the stupid mistakes (such as coping with alcohol), all the fake things the Imposter was telling me then --- but only now in HINDSIGHT. For example, at what sounds like your stage I started contemplating opening a nubian goat creamery, somehow get paid to pick up litter, or maybe open up a hotdog stand.....all really cool things, but not related to genetics. Yea.....shit got weird.",
      "author": "ozzalot",
      "created": 1633763769,
      "upvotes": 4,
      "replies": {}
    },
    "hfz76dp": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfz76dp/",
      "text": "Yes, that was me ~3 months ago. \n\nMost schools offer free counselling. I would highly recommend seeing someone to talk about this if you can. I think online therapy is also a good option if it’s not available for free at your school. \n\nThis was extremely helpful for me. I was able to talk about my frustrations/ problems to a neutral party. They really just listened and validated that my emotions were okay. Then they recommended me to a support group that I attend occasionally. I feel a lot better now.",
      "author": "chemdisco",
      "created": 1633784611,
      "upvotes": 4,
      "replies": {
        "hg12225": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg12225/",
          "text": "Isn’t it crazy though that someone would need counseling to get through grad school? Like, the fact that majority of people are pushed beyond their own limits that they need professional help to get through it?\n\nIt only makes me wonder what all this stress is doing to our bodies in the long run. Majority aren’t eating well enough or exercising enough to stay healthy, let alone get quality sleep etc. and that’s over a course of many years.\n\nWe’re all in it for a better future but damn, what is this system doing to us 😬",
          "author": "NattyKhala",
          "created": 1633815267,
          "upvotes": 3,
          "replies": {
            "hg19bxf": {
              "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg19bxf/",
              "text": "Yea, I totally agree. I ended up switching to a masters because I felt like my mental/physical health would not be able to endure an extra 2-3 years 😬 \n\nGrad school pushes a lot of people to burn out. It tends to be isolating and there is a lot of pressure to get results (even though some of it really is just pure luck).  I think a lot of it is dependent one what kind of supervisor/cohort you end up with.  Some are more supportive of having a work/life balance than others.. It can turn toxic very quickly.",
              "author": "chemdisco",
              "created": 1633818659,
              "upvotes": 2,
              "replies": {
                "hg1hxms": {
                  "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg1hxms/",
                  "text": "Good for you! You looked out for yourself and I’m assuming your life got better? At least in terms of mental/physical health. If you don’t mind sharing, have your future career plans changed when you switched to a masters? Or how was that process for you?\n\nI rarely come across people who master out, my program/school is very much against it so I have not heard much about situations like that.",
                  "author": "NattyKhala",
                  "created": 1633822816,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hfy27l1": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfy27l1/",
      "text": "I express sympathy for you because I went through the same path you are currently in, albeit that I was looking for employment until the pandemic threw us a significant detour last year. With that said, I would suggest reaching out to your support system for guidance and perspective; which I mean those who strongly support you no matter what. Most often, it may feel more nuanced because you felt all the more burnt out emotionally before. In fact, it's the worst feeling in the world when you are mostly ignored by others, especially when it comes to what you are going through. But it's worth knowing you are not the first one who dealt with adversity given these abnormal times, nor that you are the last.",
      "author": "gabe89san",
      "created": 1633754958,
      "upvotes": 2,
      "replies": {}
    },
    "hg07f7t": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg07f7t/",
      "text": "I do guys. I was also wondering if it is normal.",
      "author": "OutrageousAdvance544",
      "created": 1633801724,
      "upvotes": 2,
      "replies": {}
    },
    "hg18hi7": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg18hi7/",
      "text": "this happened to me on my second year of PhD. I used to cry in the university bathrooms all the time. Then I started taking antidepressants. And within 2 months I was so much better. My supervisor asked me how I was so productive and I told him: \"I was depressed but now I'm taking medication\". He was really nice about it. And the rest of my PhD got way smoother. I stopped taking them a couple of months before my VIVA.",
      "author": "Populus_alba",
      "created": 1633818254,
      "upvotes": 2,
      "replies": {}
    },
    "hfzhd15": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzhd15/",
      "text": "I am with you. I am doing a master's degree in South Korea and the entire experience has been a nightmare. We started in March 2020 and the entire degree I moved to this country for has been over Zoom. Four semesters in, I still have no friends in my program and I hate every single one of my classes. I get zero joy or satisfaction from school and am counting the days until I graduate and can start working for a job I was recently hired for, which has nothing to do with my degree. I would have dropped out earlier, but I would not be able to stay in the country if I did because I am on a student visa.",
      "author": "sem263",
      "created": 1633789937,
      "upvotes": 2,
      "replies": {}
    },
    "hfzelmw": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzelmw/",
      "text": "I cried almost everyday in my masters. I don’t think it was normal and I think that I probably should’ve dropped out and found a program that was more manageable for me. I’m doing a PhD right now and haven’t cried once over grad school stuff. This feels a lot more normal. If you’re crying everyday, something needs to change. I wish I hadn’t just “stuck it out” when I was absolutely miserable during my masters",
      "author": "jae3013",
      "created": 1633788574,
      "upvotes": 1,
      "replies": {
        "hg465ku": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg465ku/",
          "text": "Do you mind talking a bit more about your experience? I'm doing a masters in math right now, feeling miserable, and thinking about dropping out. I guess weighing the pros and cons for me is hard, because it's hard to pin down specific things that I don't like.",
          "author": "paulandjulio",
          "created": 1633881251,
          "upvotes": 1,
          "replies": {
            "hg6vg36": {
              "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg6vg36/",
              "text": "Sure, happy to talk about it more. Message me",
              "author": "jae3013",
              "created": 1633925165,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfzryoy": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzryoy/",
      "text": "why is the intership have to be unpaid? If you already work in health care cant you ask the university to use that as your internship experience because that is what I did. I was working a psychiatric center (psych major) and with the help of my advisor got internship credit for it.",
      "author": "theethiopianqueen",
      "created": 1633794898,
      "upvotes": 1,
      "replies": {
        "hg0g4bl": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0g4bl/",
          "text": "Trust me, I tried. My job wouldn’t let me, well HR wouldn’t let me. So I work 1 job PRN. And the internship is basically unpaid training for the job I really want when I graduate. We fought with HR for 8 months and still were told no.",
          "author": "help_my_headaches",
          "created": 1633805593,
          "upvotes": 1,
          "replies": {
            "hg0l1ge": {
              "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0l1ge/",
              "text": "Why are they making you go through your job? Why cant the school just give you the credit? I didnt go through my job, I just filled out a form through the school and had to write an easy explaining how my job helped me apply what I learned in my courses. I understand every school is different but thats ridiculous that they are making you go through your job especially since your job is being like that!",
              "author": "theethiopianqueen",
              "created": 1633807794,
              "upvotes": 1,
              "replies": {
                "hg0la13": {
                  "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0la13/",
                  "text": "The CSWE accrediting board requires social work students do a 600 hour unpaid internship as a service to the profession.",
                  "author": "help_my_headaches",
                  "created": 1633807896,
                  "upvotes": 1,
                  "replies": {
                    "hg0ljk2": {
                      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0ljk2/",
                      "text": "Thats crazy! Im sorry that they require that!",
                      "author": "theethiopianqueen",
                      "created": 1633808011,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfy6l34": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfy6l34/",
      "text": "If grad school is causing you to cry, drop out and get your shit together.",
      "author": "ostrogotha",
      "created": 1633757846,
      "upvotes": -17,
      "replies": {
        "hfy8u2o": {
          "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfy8u2o/",
          "text": "10/10 amazing problem solving skills. \n\nPlease work on world hunger next. We need your talents.",
          "author": "depressed_panda0191",
          "created": 1633759435,
          "upvotes": 19,
          "replies": {
            "hfzeyis": {
              "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzeyis/",
              "text": "What else would you advise? Why would you continue to do something you hate? That’s not doing life correctly.",
              "author": "ostrogotha",
              "created": 1633788749,
              "upvotes": 4,
              "replies": {
                "hg0qi0i": {
                  "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0qi0i/",
                  "text": "Man I wish I lived the kind of life you clearly live. To just be able to say so easily \"if this makes you cry just stop doing it and do something else.\" \n\nDamn fam like. In all seriousness good for you that the life you lead has let you develop this viewpoint. I don't wanna wish that you had a harder life but... Just not all of us are that lucky okay. And in this case I'm not talking just about OP but also my own life experiences.\n\nSometimes a post like this just needs some empathy man. Even if you don't get where they're coming from can you just accept that they're going through a really tough time right now? Imo OP just needs to have people tell them that they're not alone right now. They DONT need you telling them \"just quit and do something else i d I o t\"",
                  "author": "depressed_panda0191",
                  "created": 1633810233,
                  "upvotes": 0,
                  "replies": {
                    "hg13mr1": {
                      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg13mr1/",
                      "text": "Who said I had an easy life? Did you stop and think my advice may be from experience? Also, eat my whole ass fuck knob.",
                      "author": "ostrogotha",
                      "created": 1633815981,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfzd6zn": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzd6zn/",
      "text": "Hey there it really sounds like your health is in danger, I strongly suggest you reach out to a therapist (often free at your school) and physician to see if maybe some medication could help stabilize you. School or work is NEVER supposed to make you miserable even if many do experience this in grad school, it's not healthy. Try to talk to a counseller at school if you can take a lower work charge or maybe some time off. I know it SEEMS imposible for you right now, but they know that life happens and there are ways to take into consideration health issues. Take care",
      "author": "579red",
      "created": 1633787868,
      "upvotes": 0,
      "replies": {}
    },
    "hfzfmdp": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzfmdp/",
      "text": "Yea crying has become my new norm too. But I try to discard that self-doubt everytime it comes to mind. Learning how to say no is important as well.",
      "author": "seiouhon",
      "created": 1633789081,
      "upvotes": 0,
      "replies": {}
    },
    "hfzn5bs": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzn5bs/",
      "text": "I've been writing my thesis for a few months now. I've cried every day the whole time.",
      "author": "suckuma",
      "created": 1633792678,
      "upvotes": 0,
      "replies": {}
    },
    "hfznpcu": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfznpcu/",
      "text": "Man I just laid down on my bedroom floor yesterday and cried no lie lmaoo. I’m not doing MSW but I’m doing MSCS. Grad school is tough. Work is tough. It monopolizes all of my time just to stay afloat and not fall too far behind but I already see my grades slipping more and more. \n\nEveryday I fight for my life just to remain somewhat competent. Between this and getting tutored it’s ridiculous.",
      "author": "thee_facts",
      "created": 1633792936,
      "upvotes": 0,
      "replies": {}
    },
    "hfy21mn": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfy21mn/",
      "text": "I wish!",
      "author": "misanthpope",
      "created": 1633754857,
      "upvotes": -1,
      "replies": {}
    },
    "hfxymgx": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfxymgx/",
      "text": "[removed]",
      "author": null,
      "created": 1633752905,
      "upvotes": 1,
      "replies": {}
    },
    "hfz2k7n": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfz2k7n/",
      "text": "So sorry that you're going through this. I'm going through something similar actually as I'm doing full time grad school and two part time jobs. I also get low pay for these jobs... but I need them for my resume. One thing that helps me is to just take time out of my schedule even for just an hour a day. I go out and have a cup of coffee. Or even watch a movie. \n\nIt can get overwhelming. All that we do and sometimes people do not understand.",
      "author": "givemeyourdonut",
      "created": 1633781863,
      "upvotes": 1,
      "replies": {}
    },
    "hfzb9k1": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzb9k1/",
      "text": "I did early on but not so much after. But I'm a stress crier so it wasn't really a big issue for me.",
      "author": "queennbee",
      "created": 1633786864,
      "upvotes": 1,
      "replies": {}
    },
    "hg0hvi2": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0hvi2/",
      "text": "https://www.youtube.com/watch?v=x2KklA5JYJs&ab\\_channel=Useless",
      "author": "Nathanyang29",
      "created": 1633806378,
      "upvotes": 1,
      "replies": {}
    },
    "hg1kxcg": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg1kxcg/",
      "text": "I'm just depressed. In my writing stage and feeling ignored by supervisors. It's taking do much longer than expected. I'm so tired. \n\nI just don't think people who aren't doing a PhD understand the mental toll it takes on you.",
      "author": "DoodleCard",
      "created": 1633824293,
      "upvotes": 1,
      "replies": {}
    },
    "hg1wdg2": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg1wdg2/",
      "text": "I’m also in an MSW program and it’s wrecking me. I am not in an internship yet but I work part time and have a chronic illness.. it’s been so, so hard. I commented before that I really have been crying sometimes twice a day. My program involves a lot of self reflection and self disclosure too which has been challenging, especially without any kind of structured support. So much love to you, sending you a big hug.",
      "author": "blushbrushbunny",
      "created": 1633829999,
      "upvotes": 1,
      "replies": {}
    },
    "hg1yzcn": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg1yzcn/",
      "text": "I did until I dropped out of my grad program. 2 years later, I enrolled in a grad program for a field I cared much more about. I cry way less.",
      "author": "Mash_Ketchum",
      "created": 1633831307,
      "upvotes": 1,
      "replies": {}
    },
    "hfzvvj4": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hfzvvj4/",
      "text": "Honestly same, I just started a PhD and I think I just wanna collapse and cry because I have massive shoes to fill 😢 idk if I even fit into the school I attend rn, like I feel I belong but the bar I need to clear is so high… idk if I can do it LMAO HAHAH",
      "author": "nietzschesoptimism",
      "created": 1633796652,
      "upvotes": 0,
      "replies": {}
    },
    "hg01bp6": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg01bp6/",
      "text": "I totally get this. I am in my very first semester of grad school which is a big change, but I also work full time. It's an online program so it should be \"easy\", but it's not. It's really hard keeping up with all of the demands of my job and of my program. I'm going for my MSW. If anyone has any advice in this field, please reply, this shit is hard af.",
      "author": "ranchshots",
      "created": 1633799062,
      "upvotes": 0,
      "replies": {}
    },
    "hg0eexj": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0eexj/",
      "text": "Yes.. for me it’s multiple times a day sometimes.. so hard",
      "author": "blushbrushbunny",
      "created": 1633804823,
      "upvotes": 0,
      "replies": {}
    },
    "hg0kt1v": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0kt1v/",
      "text": "Yes. Yesterday's crying was because not only did I not have enough energy to study, I no longer had enough energy to *be a person*.",
      "author": "terrafreaky",
      "created": 1633807695,
      "upvotes": 0,
      "replies": {}
    },
    "hg0pyi3": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0pyi3/",
      "text": "I'm in my final semester with two months left to go, this is my hardest semester so far from a mental health standpoint.  I am over it and just want grad school behind me.  \nFor me it feels like my creativity has just dropped and I'm on adrenaline fueled autopilot.  These next two months cannot come fast enough.",
      "author": "ozzykp06",
      "created": 1633809995,
      "upvotes": 0,
      "replies": {}
    },
    "hg0qzql": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg0qzql/",
      "text": "Yup.",
      "author": "Pepper_ch",
      "created": 1633810450,
      "upvotes": 0,
      "replies": {}
    },
    "hg121yf": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg121yf/",
      "text": "working full time and going to school part time rn (both art history related)- i haven’t had a day without hours of reading since i started. i only see my boyfriend once a week and i read while he’s around. haven’t seen my family in a month. i cried for the first time last night about being this overwhelmed and holding off that long felt like a victory. i feel so pathetic",
      "author": "tryingveryhard_",
      "created": 1633815266,
      "upvotes": 0,
      "replies": {}
    },
    "hg169bt": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg169bt/",
      "text": "Crying has been my way of reaching a state of catharsis and has allowed me to truly let go of my troubles, at least for the moment. The trick for me was to not experience any shame in crying, and acknowledge that I feel immensely better afterwards.",
      "author": "theif519",
      "created": 1633817182,
      "upvotes": 0,
      "replies": {}
    },
    "hg16wja": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hg16wja/",
      "text": "I hear u, I really do. The other day I started crying after having a rollercoaster of emotions relating to my ability to do well in grad school, be good enough compared to my classmates, not feel like a total failure for taking more time than others, etc. Crying is important and helps us release this stress, but at the same time, it's draining and it sucks. And it's hard as hell to go through this process, but you definitely are not alone. The attempt to keep a professional appearance (i think) keeps people from talking about this more often, which is BS because I know my classmates feel this way too.",
      "author": "UnknownArtichoke",
      "created": 1633817497,
      "upvotes": 0,
      "replies": {}
    },
    "hgjeepx": {
      "link": "/r/GradSchool/comments/q4dvb9/anyone_else_just_cry_like_multiple_times_per_week/hgjeepx/",
      "text": "Omg are you me?? I’m also in a social work program and I’m in my first year and hating it. I cry like everyday dude lol. The internship is rough. Absolutely nothing from this program is bringing me joy and it saddens me, being in this program has been my long term goal for years now. Feel free to PM me, I can resonate with a lot of what you’ve said!",
      "author": "beartuna",
      "created": 1634162687,
      "upvotes": 2,
      "replies": {}
    }
  }
}