{
  "sid": "rap80m",
  "link": "/r/GradSchool/comments/rap80m/is_it_normal_to_feel_like_a_failure/",
  "title:": "Is it normal to feel like a failure?",
  "text": "Doing M.Arch with undergrad degree not in architecture. The experience has been nothing but torture.\n\nMy mental health has deteriorated due to the courseload as well as externalities in my personal and working life. Im also working while in school.\n\nIts gotten to the point where I have regular panic attacks, shortness of breath, and a sense of terror everytime I try to buckle down and produce work. It's like I can't get anything to work, to flow, and my brain punishes me by thinking about it constantly. I feel like I've let everyone in my family, especially my fiance, down. \n\nI've put a lot on the line for this goddammned degree. I left a good full-time job, I've postponed my marriage until graduation (though that's looking unlikely at this point), and I've just generally done nothing but school and work for the past 4 years. I feel like an automaton, but a broken one. \n\nWhy is graduate education like this? Why does no one care? Professors don't care, they just tell me to quit my job and focus. How would I survive? How can anyone truly think this way? When will something be done to acknowledge that graduate students are still people?",
  "author": "mc082413",
  "created": 1638846701,
  "updated": 1639518834,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.89,
  "comments": {
    "hnjrhiy": {
      "link": "/r/GradSchool/comments/rap80m/is_it_normal_to_feel_like_a_failure/hnjrhiy/",
      "text": "I'm working full time and taking 1-2 classes a semester. (Already got my BA though). I've chosen not to take more than I can handle, but even then I still struggle with school demands. Social life has taken to the back burner and my husband does most all of the cooking and more than half the chores. I still would not quit my job for it though. Important thing that I have to remind myself is that it doesn't really matter if I graduate on their track. If I'm not able to learn the material and keep my health, the degree is nearly worthless. \n\nMy suggestion might be to take a lighter load next semester, your family should understand.",
      "author": "Global-Upstairs98",
      "created": 1638847398,
      "upvotes": 3,
      "replies": {}
    }
  }
}