{
  "sid": "qpmlo8",
  "link": "/r/GradSchool/comments/qpmlo8/phd_admissions_timelines/",
  "title:": "PhD admissions timelines?",
  "text": "I just sent out all my Stats PhD applications, and I'm anxious/excited about hearing back. According to gradcafe, most of these programs get back to students around mid February.\n\nHowever, I have a friend going to law school who already got several admit offers, way ahead of the usual timeline. Do PhD programs sometimes perform these early reach outs too? Or should I not expect to hear anything until the regular decision date? \n\nFor reference I am 2.5 years out of school with experience in applied stat in a niche field that I want to innovate in, and for that I need better stats training and an academic position so I think I have a good statement of purpose. I have 3 solid letters of rec from high ranked profs, but not in stats. I had a 3.98 GPA in undergrad and 166V/169Q GRE so from what I can tell I am a good applicant but not stellar since I had no prior research experience.",
  "author": "Silent_Mike",
  "created": 1636403873,
  "updated": 1636656574,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjukmz2": {
      "link": "/r/GradSchool/comments/qpmlo8/phd_admissions_timelines/hjukmz2/",
      "text": "Applications were due in December for me last year and I found out in January sometime (right before the faculty had their round table meeting vouching for certain applicants), and got an official letter in maybe February. But I was one of the first who heard back. So I think when you hear back just depends on institutional timelines and application deadlines honestly\n\nEdit to add: rejection letters went out after I got my acceptance letter, so my friend head about his rejection from the same program I got admitted to like a month after me",
      "author": "meowitsgabi",
      "created": 1636404144,
      "upvotes": 3,
      "replies": {}
    },
    "hjv66e5": {
      "link": "/r/GradSchool/comments/qpmlo8/phd_admissions_timelines/hjv66e5/",
      "text": ">Do PhD programs sometimes perform these early reach outs too?\n\nIt can vary from program to program, even within a university.\n\nSo you might hear earlier. Or you might not.",
      "author": "raistlin65",
      "created": 1636412914,
      "upvotes": 1,
      "replies": {}
    }
  }
}