{
  "sid": "rbv5sy",
  "link": "/r/GradSchool/comments/rbv5sy/dont_underestimate_the_value_of_your_undergrad/",
  "title:": "Don't underestimate the value of your undergrad mentors. Also don't limit your networking scope to only tenured-track profs.",
  "text": "Woke to an email that cheered me up a little bit. I asked my long-term (non-tenure track) mentor and friend from undergrad for a LOR. His response \"I am always happy to provide a recommendation letter for you. Send me your updated information and let me know the deadline. I will take care of it for you.\" I've been entirely stressed with thesis analysis and fellowship apps, having this support from someone who wants me to succeed means a lot. Especially when I had issues last year with a tenured mentor of mine submitting their LOR past deadline (it worked out, but 🤯🤯🤯). \n\nReminder that your letter writers should want to pull for you. They should be people that know you well. As said in title, don't underestimate your undergrad mentors and don't be hesistant to ask someone just because they aren't tenure-track. This may be dependent on the type of program you are applying to, but often profs have professional experiences outside of academia that they can touch upon. Additionally, non-tenure profs may have more time to complete a thorough letter.  Networking with both types of profs is beneficial and recommended. But, worth noting, my first paid gig in academia came from my non-tenured mentor.",
  "author": "marisolm9",
  "created": 1638981294,
  "updated": 1639518556,
  "over_18": false,
  "upvotes": 151,
  "upvote_ratio": 0.98,
  "comments": {
    "hnr5en8": {
      "link": "/r/GradSchool/comments/rbv5sy/dont_underestimate_the_value_of_your_undergrad/hnr5en8/",
      "text": "How about those of you who are shy, need to work on talking with your TA's, instructors, and professors... drop by office hours, chat after or before class... yeah, you'll need to step out of your comfort zone...\n\nOne way that might help is if you are with a more talkative friend, use the buddy system and maybe that breaks ice?\n\nGood advice!",
      "author": "mrg9605",
      "created": 1638990967,
      "upvotes": 25,
      "replies": {
        "hnrjkxt": {
          "link": "/r/GradSchool/comments/rbv5sy/dont_underestimate_the_value_of_your_undergrad/hnrjkxt/",
          "text": "I'm shy and these are very good tips, especially the buddy system thing! Once you have a rapour, it's important to keep in contact as well",
          "author": "marisolm9",
          "created": 1638996347,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hnrds6m": {
      "link": "/r/GradSchool/comments/rbv5sy/dont_underestimate_the_value_of_your_undergrad/hnrds6m/",
      "text": "This is true. I have two professors from undergrad whom I am very good friends with and talk to regularly, despite that I am in grad school.\n\nI'm applying for grad school again, and they were so excited when I reached out asking for advice, and enthusiastically offered recommendations. \n\nI am very fortunate to have met such wonderful people and talented researchers - but even sparing my good fortune, it is something I would recommend to everyone",
      "author": "al_the_time",
      "created": 1638994153,
      "upvotes": 6,
      "replies": {
        "hnrk3m4": {
          "link": "/r/GradSchool/comments/rbv5sy/dont_underestimate_the_value_of_your_undergrad/hnrk3m4/",
          "text": "We are fortunate indeed to find great undergrad mentors to influence our early careers. Aside from my PI, I am not as lucky to find such new mentors in grad school. Granted, COVID has made it more difficult to meet new people. It's about luck and putting yourself out there!",
          "author": "marisolm9",
          "created": 1638996536,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnt565p": {
      "link": "/r/GradSchool/comments/rbv5sy/dont_underestimate_the_value_of_your_undergrad/hnt565p/",
      "text": "I’m supposed to be applying for fellowships?",
      "author": "Greenface1998",
      "created": 1639021007,
      "upvotes": 2,
      "replies": {
        "hnubvvi": {
          "link": "/r/GradSchool/comments/rbv5sy/dont_underestimate_the_value_of_your_undergrad/hnubvvi/",
          "text": "Depends on your field, but might be recommended. For me it is hopefully a transition to a job",
          "author": "marisolm9",
          "created": 1639051011,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}