{
  "sid": "pfzhj7",
  "link": "/r/GradSchool/comments/pfzhj7/ive_become_an_anxious_and_a_judgmentfearing/",
  "title:": "I've become an anxious and a judgment-fearing person in Grad School, and it's not making me look good",
  "text": "When I was an undergrad, I used to say what's on my mind and not fear judgment. If the professor asked a question I'd be the first to answer to the best of my knowledge, and it used to never cross my mind that my answers are \"stupid\" or \"inadequate\" or fear that I'd get the answer wrong, because I was there to learn. I used to present in front of others easily and I used to always volunteer to go first.\nNow, I'm always scared of saying something wrong or stupid that would make my professors/mentors think low of me. Because of that I started stuttering in my presentations, dreading every meeting, and holding my answers back because \"what if I get it wrong?\" \nRecently I even started to blank out, when I'm put on the spot, on answers that I otherwise know. And all of that is actually putting me in trouble.\nI've been trying to regain my \"I'm here to learn, so what if I make mistakes\" attitude that I used to have, but it's so hard. I'm constantly scared of getting kicked out or doing something stupid or not having enough knowledge about topics, but that fear is actually putting me in the spot that I'm trying to avoid.\n\nHow do you guys deal with that?",
  "author": "ItsYaCarboiii",
  "created": 1630519627,
  "over_18": false,
  "upvotes": 24,
  "upvote_ratio": 0.94,
  "comments": {
    "hbbeqeh": {
      "link": "/r/GradSchool/comments/pfzhj7/ive_become_an_anxious_and_a_judgmentfearing/hbbeqeh/",
      "text": "Remember that your fear and anxiety is a sign that you are probably not a narcissist. It means you're a human. That is a good thing to value. Love your anxiety because it means you're normal. Very much unlike the lizard people who populate academia at the top.",
      "author": null,
      "created": 1630591098,
      "upvotes": 3,
      "replies": {
        "hbc7ge2": {
          "link": "/r/GradSchool/comments/pfzhj7/ive_become_an_anxious_and_a_judgmentfearing/hbc7ge2/",
          "text": "That's an interesting way to look at it. I like this analogy now",
          "author": "ItsYaCarboiii",
          "created": 1630602853,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hb9dtez": {
      "link": "/r/GradSchool/comments/pfzhj7/ive_become_an_anxious_and_a_judgmentfearing/hb9dtez/",
      "text": "So basically you've developed some anxiety, it sounds like. If you can identify why, it might help you figure out what to do about it. Did something particular happen, like a professor chastise you publicly? Does this program have a more competitive atmosphere? Are you putting pressure on yourself because of how you perceive grad school? Is it something in your personal life?\n\nIf nothing else, does your school have a counseling center? It's worth a free visit.",
      "author": "eleveneels",
      "created": 1630545371,
      "upvotes": 7,
      "replies": {}
    }
  },
  "updated": 1634066872
}