{
  "sid": "r9m6xu",
  "link": "/r/GradSchool/comments/r9m6xu/will_c_grade_in_1st_semester_of_grad_school_looks/",
  "title:": "Will C- grade in 1st semester of grad school looks bad?",
  "text": "I took three classes (major is CS), and dropped 1 class since I thought I cannot handle this. Actually, I wanted to drop two classes, but the department did not allow this except for medical reasons. I have to handle two classes right now, and this is still hard for me because my major was not CS, so I did not have a lot of experience with coding a lot. I can follow one class, but another class is difficult for me and takes tons of time to understand. \n\nI can drop with W if I submit the petition (this can be accepted or rejected), but if this is not allowed even though I have a mental issue right now, the best way can be to retake the course. Now I already have one W and probably one C- grade in my first-semester transcript. \n\nI can explain my situation when I apply for a job or internship, but will it looks bad?",
  "author": "jpark528",
  "created": 1638729709,
  "updated": 1639518970,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hnd6iue": {
      "link": "/r/GradSchool/comments/r9m6xu/will_c_grade_in_1st_semester_of_grad_school_looks/hnd6iue/",
      "text": "A C- in grad school is like equivalent to an F in undergrad so yeah it looks bad. Check your handbook but typically anything lower than a B- is a failing grade.",
      "author": "Stereoisomer",
      "created": 1638735059,
      "upvotes": 13,
      "replies": {
        "hndchpg": {
          "link": "/r/GradSchool/comments/r9m6xu/will_c_grade_in_1st_semester_of_grad_school_looks/hndchpg/",
          "text": "In my school, a lower than B is a failing grade. \n\nProbably request a lower than B so I can retake this class...",
          "author": "jpark528",
          "created": 1638737223,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hnebnth": {
      "link": "/r/GradSchool/comments/r9m6xu/will_c_grade_in_1st_semester_of_grad_school_looks/hnebnth/",
      "text": "In the grad programs I know about, you need to maintain a B- (2.8 GPA) to stay in good standing. So yeah, it looks bad and also depending on your other classes / previous semesters, you're in danger of not graduating and/or being dropped from your program. Check your student handbook.",
      "author": "boilerlashes",
      "created": 1638751141,
      "upvotes": 2,
      "replies": {
        "hnedwgo": {
          "link": "/r/GradSchool/comments/r9m6xu/will_c_grade_in_1st_semester_of_grad_school_looks/hnedwgo/",
          "text": "My school requires me to maintain B (3.00). And the school advisor said that one bad semester (below 3.0) will not result dropped program, so I think to get below B grade and retake can be the best option. Better take just two classes next semester to prevent this situation since three is really hard.",
          "author": "jpark528",
          "created": 1638752108,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnlcwru": {
      "link": "/r/GradSchool/comments/r9m6xu/will_c_grade_in_1st_semester_of_grad_school_looks/hnlcwru/",
      "text": "I'm surprised all you got here was 2 people saying \"yeah it looks bad\".\n\nYour question was about jobs, right? So to answer whether employers care about your grades, take it from me, a 37 year old who has worked at a LOT of places with my undergrad degree: no. You don't even need to put your GPA on your resume, and most won't ask about it.\n\nIf you need a 3.0 anyway then nobody in the working world will care.",
      "author": "malachai926",
      "created": 1638885206,
      "upvotes": 2,
      "replies": {
        "hnmkk64": {
          "link": "/r/GradSchool/comments/r9m6xu/will_c_grade_in_1st_semester_of_grad_school_looks/hnmkk64/",
          "text": "Did not know this info, and thank you for it!\n\nI will drop this class with a W grade with a medical petition since I have a mental issue, and I hope it works.",
          "author": "jpark528",
          "created": 1638904498,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}