{
  "sid": "qk1e4o",
  "link": "/r/GradSchool/comments/qk1e4o/ms_in_cybersecurity/",
  "title:": "Ms in cybersecurity",
  "text": "Hey folks.I want to apply to MS in cybersecurity. I am having 2.5 years of work experience as a SOC analyst ( in field if cybersecurity)\n\nBut I flunked one year in my graduation. I had taken this electronics and telecommunication in my bachelors.I somehow completed it. I was interested in Cybersecurity. As I was passionate in cybersecurity did some certifications like (CEH, N+, CCNA) and on basis of that I got the job.\n\nI want to apply to UMD College park for masters. They have this tagline saying. \" GRE score is not required but If you have it will be considered\"\n\nI am bit Scared if I applied without GRE , my profile might get discarded due to the fact that I have low scores.\n\nI am confused should I give GRE or not?",
  "author": "Somechords77",
  "created": 1635722940,
  "updated": 1635780432,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hiuk2ko": {
      "link": "/r/GradSchool/comments/qk1e4o/ms_in_cybersecurity/hiuk2ko/",
      "text": "I got in to one of the University of MD related schools without a GRE. I got my masters of cybersecurity in 2017. It didn't seem to have an impact on getting in.\n\nI think your work experience is a plus. If you are worried that your bachelor's won't align enough with the MS then the GRE might help in your favor (if you scored well). \n\nIt's more that they want to make sure you will be successful in the graduate program than anything. So a MS close to your BS area or solid GRE scores (demonstration of academic potential) are mostly what they are looking for imo.\n\nGood luck and welcome to the club.",
      "author": "johonnamarie",
      "created": 1635739801,
      "upvotes": 1,
      "replies": {
        "hiv326f": {
          "link": "/r/GradSchool/comments/qk1e4o/ms_in_cybersecurity/hiv326f/",
          "text": "Thanks a ton. Much appreciated. GRE it is.",
          "author": "Somechords77",
          "created": 1635755576,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}