{
  "sid": "q9zbgi",
  "link": "/r/GradSchool/comments/q9zbgi/what_happens_if_you_collaborate_on_a_project_but/",
  "title:": "What happens if you collaborate on a project but they never end up publishing it?",
  "text": "Hasn’t happened to me, but I’m wondering what happens. I’ve been getting quite proficient in bioinformatics, so my advisor has been setting me up with several different collaborators to do data analysis for them. They need someone to analyze their data, I like getting publications :)  \n\nSo what happens if I do a bunch of work for them but they don’t end up publishing? Is it just “oh well, that was a waste of time”?",
  "author": "You_Stole_My_Hot_Dog",
  "created": 1634479365,
  "updated": 1634655439,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.9,
  "comments": {
    "hgzq01s": {
      "link": "/r/GradSchool/comments/q9zbgi/what_happens_if_you_collaborate_on_a_project_but/hgzq01s/",
      "text": "You should have this conversation with your co-authors before you analyze their data. Always have authorship conversations as early as possible- it saves so much pain later in the process. \n\nYou can ask them if you can go ahead and publish it if it falls too low in their priority list— Ask if you can take the first author role, and lead the paper. \n\nI’ve taken previous students’ work that they abandoned and turned it into papers. They became 2nd or 3rd author, and I was bumped to first, and made it my own before sending it out.",
      "author": "show_me_your_graphs",
      "created": 1634483424,
      "upvotes": 12,
      "replies": {}
    },
    "hh00r83": {
      "link": "/r/GradSchool/comments/q9zbgi/what_happens_if_you_collaborate_on_a_project_but/hh00r83/",
      "text": ">So what happens if I do a bunch of work for them but they don’t end up publishing? Is it just “oh well, that was a waste of time”?\n\nWell, IME, basically yes. But you may also make a useful connection and have someone to collab on something that WILL get published. But of course, that runs the same risk.",
      "author": "iammaxhailme",
      "created": 1634488089,
      "upvotes": 5,
      "replies": {}
    },
    "hh0zb9h": {
      "link": "/r/GradSchool/comments/q9zbgi/what_happens_if_you_collaborate_on_a_project_but/hh0zb9h/",
      "text": ">Is it just “oh well, that was a waste of time”?\n\nProbably. I'm in that boat where our collaborator got our analysis a year ago. My bet's on that they didn't like it so they chucked it and decided not to go with it. My PI however...hopes for the best.\n\nIt can be disappointing, but sooner or later I hear collaborations fall apart for one reason or another.\n\n0 / 2 publications from collaborations worked on. One more and maybe it's me not them haha",
      "author": "burntoutgradstudent",
      "created": 1634502448,
      "upvotes": 3,
      "replies": {}
    }
  }
}