{
  "sid": "ri6lgp",
  "link": "/r/GradSchool/comments/ri6lgp/help_figuring_out_a_capstone_topic/",
  "title:": "Help Figuring Out a Capstone Topic",
  "text": "I feel like I have no idea how to actually come up with a capstone topic that I can work with and talk with a faculty member without coming up short. The only class I had some interests in were my web development and cloud engineering courses. I have no job experience so I can't just rely on professional stuff. I initially wanted to do some stuff regarding UI and accessibility from a software engineering (my major) perspective, but had a hard time going with an idea because I was worried I wouldn't be able to handle it.\n\nI only have like a month before deciding on a capstone project, otherwise I might as well consider delaying my graduation by another semester even though that will piss off my parents who are paying for my education.\n\nYes I am aware that there is a class most people take in figuring out what they want out of a capstone, but I kinda forgot the whole thing.\n\nSo how do I come up with a proposal?",
  "author": "mmkthecoolest",
  "created": 1639707599,
  "updated": 1639788501,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hove6wd": {
      "link": "/r/GradSchool/comments/ri6lgp/help_figuring_out_a_capstone_topic/hove6wd/",
      "text": "What is your degree in and what things separate from that degree are you interested in? What do you want to be doing professionally? Is there any way you can find where all those things meet? If you can stop thinking about it so much as a requirement and think of it as a way to hit the ground running on an area you are interested in working in you will gain way more out of it. I am in Masters of Environmental Management program but I am also interested in social media and data manipulation, so my capstone is going to be environmental stakeholder engagement through the use of social media. It took some work to convince people of the utility but so far things are looking good at it being my project. Good luck.",
      "author": "Diver808",
      "created": 1639712315,
      "upvotes": 1,
      "replies": {
        "hovspg4": {
          "link": "/r/GradSchool/comments/ri6lgp/help_figuring_out_a_capstone_topic/hovspg4/",
          "text": "I am currently pursuing an MS in Software Engineering. I don't know what I want to do professionally apart from working on development. I took a beginner class in web development and enjoyed that and got a little interested with my cloud engineering class.\n\nRight now I'd prolly want to go further with web development, but I haven't really had a consistent interest over the years.",
          "author": "mmkthecoolest",
          "created": 1639719615,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hox5bx5": {
      "link": "/r/GradSchool/comments/ri6lgp/help_figuring_out_a_capstone_topic/hox5bx5/",
      "text": ">The only class I had some interests in were my web development and cloud engineering courses.\n\nSo make appointments to talk to the professors of those courses. See if they can steer you towards a capstone topic.",
      "author": "raistlin65",
      "created": 1639750918,
      "upvotes": 1,
      "replies": {}
    }
  }
}