{
  "sid": "b1xfli",
  "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/",
  "title:": "Finally quitting my PhD",
  "text": "It's all finally come to an end. Just got out of the ER where I spent the night after the cops showed up at my lab and took me away because someone told them I was crying in the lab and when they showed up they determined I wanted to kill myself. I've begged my university for mental health care for the last six years and been turned down because I have \"pre-existing depression and anxiety\" and the counselors refuse to see me. I've tried for six years to get off-campus help (I wonder how many hundreds of therapists I've called by now) and only just found a therapist four weeks ago, who I can't see anymore because I'll lose my health insurance when I leave grad school. My \"mental health care\" until this point has been a combination of involuntary and voluntary visits to the ER when I get to the point where I feel the only other option is killing myself. \n\n&#x200B;\n\nI used to have promise and potential. Somehow I managed to get into a top PhD program in STEM and work for one of the most well-regarded researchers in my field, even though everyone always told me I was too dumb, that I only got in because I check \"diversity\" boxes, that I don't deserve to be where I am. I am so excited by my research and it is the only thing that has been keeping me going, and now it has been taken away. If I had gotten help one of the hundreds of times I asked, begged, pleaded--perhaps I would have a chance to be successful. Now I'll never know what my life could have been like. \n\n&#x200B;\n\nDear universities: when you offer counseling services you have an obligation to help all students. You have an obligation to make sure students get the care they need when they ask for help, not cast them out into the cold when they are at their most vulnerable. You all have blood on your hands.",
  "author": null,
  "created": 1552770913,
  "over_18": false,
  "upvotes": 432,
  "upvote_ratio": 0.94,
  "comments": {
    "ejfn56w": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/ejfn56w/",
      "text": "I honest to god cried my eyes out while reading this.\nIt’s not fair. When we beg and plead for help, we get nothing. ",
      "author": "SoftPeachberry",
      "created": 1553623482,
      "upvotes": 1,
      "replies": {}
    },
    "eiqxxfv": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiqxxfv/",
      "text": "[I was also wrongly reported for being suicidal](https://www.reddit.com/r/PhD/comments/ak4oyi/my_phd_advisor_reported_me_for_being_suicidal_but/) about a month ago. In a different part of the world, but with probably even less access to usable mental health help. And I am still in my PhD, and no-one seems interested in kicking me out for that.\n\nSo... who told you that you have to quit? Did you actually officially get fired / terminated / expelled / lost funding? Otherwise I don't understand why you feel that you have to either quit or kill yourself. From what you wrote it seems you have livable funding and are interested in (even excited by!) your research - which are probably the two most important things for completing a PhD (I think the third is having an advisor and/or a postdoc, a staff scientist or a more advanced student able and willing to sufficiently mentor you in research... but that may not necessarily even be in your current research group - from what I understood from people who did their PhD in the US, isn't too uncommon to switch groups, add a co-advisor, rely more on a committee member, or closely collaborate outside the group).",
      "author": "AstraGlacialia",
      "created": 1552848138,
      "upvotes": 1,
      "replies": {}
    },
    "eiqw9th": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiqw9th/",
      "text": "I'm really sorry you couldn't get any help when you asked for it.  This is unacceptable at a University, but it is unfortunately a reflection of mental health care in the U.S.  I genuinely hope you can find peace and the help you need now.  ",
      "author": "ukjenn231",
      "created": 1552846957,
      "upvotes": 1,
      "replies": {}
    },
    "eiq894m": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiq894m/",
      "text": "Talk to your therapist about your situation with losing your insurance. Do not just ghost on them. I'm sorry you've had such a hard time.",
      "author": "eavc",
      "created": 1552828380,
      "upvotes": 1,
      "replies": {}
    },
    "eiq6byf": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiq6byf/",
      "text": "Don't think getting a PhD is the only avenue to success.  You'll still find it, but maybe not how you thought.  \n\nI was a truck driver 5 years ago.  I went back to school for my undergrad at 28 and I'm working on my PhD currently.  \n\nI'm not suggesting that truck driving as a viable option, but just that there are opportunities in the world.  It's not over just because the school admin were a bag of dicks.  If you face the change head on with the confidence that got you into grad school to begin with, you'll find success regardless of where.  ",
      "author": "ScaleneWangPole",
      "created": 1552826330,
      "upvotes": 2,
      "replies": {}
    },
    "eiq67eo": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiq67eo/",
      "text": "I'm truly sorry you've been feeling so down. I hope you find something that motivates and excites you the way your research did. I know it feels like you're walking through a dark neverending tunnel every day but I promise there is a light at the end. ",
      "author": "princessjakki",
      "created": 1552826181,
      "upvotes": 1,
      "replies": {}
    },
    "eiq45hn": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiq45hn/",
      "text": "Wow this sounds like me. I'm a third year and my institution provides nothing for us, my adviser only cares because it impacts their publication rate, and since I'm a psych student we're not allowed to use the campus mental services bc our peers are the providers.\n\nWe don't have health insurance at all, are paid like shit, and the school only cares about profit.\n\nAcademia is a fucking scam and im starting to hate myself because im so complicit.\n\nI hope my comment at least gives you some comfort that you're not alone. I hope you find what you need. If you ever need someone to talk to feel free to DM.",
      "author": null,
      "created": 1552823558,
      "upvotes": 3,
      "replies": {}
    },
    "eipvtpz": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipvtpz/",
      "text": "I go to the same school as OP. I’ve been taken to the ER by the cops and everything. The mental health here absolutely fucking sucks. You aren’t alone, OP! Hang in there :( ",
      "author": "OK_BOY_BYE",
      "created": 1552809643,
      "upvotes": 2,
      "replies": {}
    },
    "eipthcu": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipthcu/",
      "text": "Fuck UCSD.",
      "author": "knienze93",
      "created": 1552805968,
      "upvotes": 8,
      "replies": {}
    },
    "eipp4wa": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipp4wa/",
      "text": "UCSD. What's with the fear of mentioning institutions? ",
      "author": "resorcinarene",
      "created": 1552800328,
      "upvotes": 13,
      "replies": {}
    },
    "eipkiwv": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipkiwv/",
      "text": "You are not a failure for leaving academia. Academia is a weird cult and I promise you will find more peace and happiness on the other side. ",
      "author": "diskprept",
      "created": 1552795323,
      "upvotes": 2,
      "replies": {}
    },
    "eipfvwm": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipfvwm/",
      "text": "I am surprised that both your university and the state university does not have psychological service clinics run by psychology departments rather than CAPS. They rarely take insurance bit often charge sliding scale fees. I worked at one that saw students for 5-10 a session. Again, not affiliated with the university but run out of the psych departments. ",
      "author": "DickDraper",
      "created": 1552790821,
      "upvotes": 1,
      "replies": {
        "eipw2py": {
          "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipw2py/",
          "text": "I’m attending this university, so I can give insight. Our university pretty much serves the entire city for mental health related stuff. Most qualified people in the medicine/psychology programs are working at the school’s healthcare system hospitals scattered around the county, not at the campus itself. :(",
          "author": "OK_BOY_BYE",
          "created": 1552810078,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eipectq": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipectq/",
      "text": "Everyone has bumps in the road. You’ll get through this once you get the appropriate care. Don’t give up on finding it; quality mental health services aren’t the easiest things to obtain, but you will. \n\nThe most important priority is your health: mental and physical. \n\nGood luck!",
      "author": null,
      "created": 1552789433,
      "upvotes": 2,
      "replies": {}
    },
    "eipbmcg": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipbmcg/",
      "text": "This is one of the most disappointing stories of a college failing a student I have read.  \n\nI really urge you to go to the media with it.  Get in touch with your local TV news station and talk to them about what is up.  Others really need to know what you went through.  I nearly went to this school and I am not sure if they pulled this on me I would have survived it.",
      "author": "engelthefallen",
      "created": 1552787017,
      "upvotes": 3,
      "replies": {}
    },
    "eip8mf8": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip8mf8/",
      "text": "Been in the same place at the same school (when I was an undergrad). You aren't alone. I'm sorry you are going through this and I hope when you are out of there, things get better ",
      "author": "lizawithaz6",
      "created": 1552784506,
      "upvotes": 2,
      "replies": {}
    },
    "eip7msx": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip7msx/",
      "text": ">I used to have promise and potential.\n\nYou still DO have promise and potential. Making it 6 years is not easy, take credit in that. You've made it incredibly far in an incredibly difficult level of education. Grad school has a really funny way of making people feel worthless, but from what I've heard, you are an incredibly talented and dedicated researcher. Maybe now just isn't the best time for you to continue your work/education. Maybe you need some time to reorient and recollect on the sidelines, there isn't anything wrong with that! I'm so sorry to hear that that happened to you, and I know there's nothing I can really say to make it better, but just know that I, some fellow grad school student but stranger on the internet, believes in you. ",
      "author": "WhoseRiverIsItAnyway",
      "created": 1552783724,
      "upvotes": 25,
      "replies": {}
    },
    "eip55ui": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip55ui/",
      "text": "If you are in Columbus I will do as much as possible to help You. ",
      "author": "t_ghosh",
      "created": 1552781730,
      "upvotes": 6,
      "replies": {}
    },
    "eip3ri9": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip3ri9/",
      "text": "We support you here. Good for you for continuing to fight for the help you need. I am currently pursuing my Masters in Counseling- you can reach out to counseling schools for extremely affordable counseling services. Best of luck to you, friend. ",
      "author": "KindlyConversation",
      "created": 1552780658,
      "upvotes": 2,
      "replies": {}
    },
    "eip32vs": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip32vs/",
      "text": "I'm sorry hear this. I hope you can get the help you need and go on to do something you love. Don't believe this is a reflection of you, this is a reflection of a system that failed you. ",
      "author": null,
      "created": 1552780141,
      "upvotes": 2,
      "replies": {}
    },
    "eip23g9": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip23g9/",
      "text": "I’m so sorry this happened.  I’m not in grad school, but right now I think it’s really important that you focus on your mental health.  I have bipolar and anxiety disorders, and that getting out of control affects everything.  I think right now the most important thing for you is to find a good psychiatrist who can evaluate you.  (Unless you have already been diagnosed - in that case I would definitely find a permanent one who can prescribe/adjust/monitor your meds right now.). It’s not good to wait until a crisis to see a doctor.  It’s possible you need to take meds to get better.  I don’t think trips to the ER are going to help figure that out.  I have a therapist, but she is an additional help for my mental illness, not the solution.  \n\nI’m sure grad school is very stressful but especially if you have an untreated mental illness.  If possible, I would take a medical leave until this gets figured out and wait to make any decisions regarding quitting all together until your mental health has been addressed and stabilized.  Right now you may not be in the best state of mind to make that kind of decision.\n\nI don’t have insurance at the moment and pay out of pocket for my medications, but they’re really not very expensive.  (I think the most expensive is $14.). Also you might want to see if you can find a counseling center with a sliding scale.  I also found out Obamacare has subsidies for low income so I could have been getting insurance for like $30/mo. last year.  Also I find it odd about the pre-existing conditions.  That was eliminated under Obamacare.  I would look into that.  Your biggest expense will probably be the psychiatrist.\n\nI really hope things turn out for you.  That’s tough.",
      "author": "ENFPGirl1985",
      "created": 1552779402,
      "upvotes": 6,
      "replies": {}
    },
    "eip18kr": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip18kr/",
      "text": "Good god.... If you happen to be in St. Louis, can I give you a hug?",
      "author": "mmaireenehc",
      "created": 1552778759,
      "upvotes": 1,
      "replies": {}
    },
    "eip15fo": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip15fo/",
      "text": "As with everyone else I am so sorry that you've had to go through all of this and you haven't had the support you needed and deserved. Part of me wants to tell you to sue the university for breach of duty of care for not providing mental health services *because* you had mental health problems, but first and foremost I just hope that you take the time you need to take care of yourself.\n\nI also agree with u/Cindifrid that it may be worth you enquiring (once you feel ready) whether it will be possible for you to take a break and then come back to your research if you want to one day. And even if that isn't possible, please know that this doesn't necessarily have to be the end of your research career, just a break in it. Should you choose to you may very well find a way back to it when you are in a better and more stable place.\n\nIn the meantime I would suggest (but I am an internet stranger not a licensed therapist who knows you well, so take with a big ass pinch of salt) taking this opportunity to find things outside of your research that you enjoy and can focus on. Relying on one thing to keep you going comes with the risk of that thing going away (as is unfortunately happening now, although hopefully it is not gone forever) and so broadening your horizons seems, to me at least, a healthier approach.\n\nAgain, I hope you take the time and find the support (formal, friendly, familial, or whatever form it might take) to take care of yourself. Wishing you the best.",
      "author": "foibleShmoible",
      "created": 1552778693,
      "upvotes": 12,
      "replies": {}
    },
    "eip14mq": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip14mq/",
      "text": "I’m so sorry you went through this. I’m so glad you’re choosing your mental health and advocating for yourself. \n\nAnd FUCK on campus counseling. They refused to see me because I have a past history of eating disorders and only gave me referrals to places that were not covered by university insurance and cost $130+ per visit out of pocket. \n\nI can’t understand why everyone acknowledges that grad students are fucked in terms of mental health, but the universities don’t do shit to help that. ",
      "author": "heebersbajeebers",
      "created": 1552778677,
      "upvotes": 29,
      "replies": {}
    },
    "eip0owo": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip0owo/",
      "text": "Honestly, I think you should name and shame this institution. It's recruitment season and we owe it to those who would follow after us to be honest, whether that's honesty about a particular professor being a batshit misogynist or an institution driving its own students to the brink. I'm so, so tired of seeing new students come in and everyone try to dance around the multitude of missing stairs",
      "author": "Defenestratio",
      "created": 1552778336,
      "upvotes": 140,
      "replies": {
        "eip4dyo": {
          "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip4dyo/",
          "text": "Don’t want to name OP’s university (maybe she’s not comfortable doing so) but look her up and you’ll see what university she’s at, if anyone’s interested.",
          "author": "Pickle1996",
          "created": 1552781133,
          "upvotes": 42,
          "replies": {
            "eip7idq": {
              "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip7idq/",
              "text": "I am at a different institution in the same system and it’s just as fucked up. Criminally negligent levels of mental health care for undergrads and grads alike. ",
              "author": "ohsideSHOWbob",
              "created": 1552783628,
              "upvotes": 23,
              "replies": {
                "eipap57": {
                  "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipap57/",
                  "text": "We only got therapists at my satellite campus after one student had an extreme mental breakdown over a weekend and the rest of us formed an association and basically went and screamed at every high-level official about how unacceptable it was. We still don't have a prescribing psych, which is still completely unacceptable mental healthcare imo. \n\nThis shouldn't be our job, we're already working ridiculous hours in lab. But if we don't speak up, loudly and frequently, nothing happens.",
                  "author": "Defenestratio",
                  "created": 1552786228,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "eipc7mi": {
              "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipc7mi/",
              "text": "Yep. That makes sense now. I went there as an undergrad and I know the mental healthcare situation was horrible ",
              "author": null,
              "created": 1552787526,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "eip41mp": {
          "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eip41mp/",
          "text": "I second this. If all of this is true, which i believe you that it is, then this university should be held accountable for this treatment and should feel the negative results it should breed. ",
          "author": "fashionthriller",
          "created": 1552780871,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "eiozv6v": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiozv6v/",
      "text": "I am so sorry you went through this. Sounds like healthcare at that campus and region is fucked up. Think of it this way: you’re alive, and you are so lucky to be LEAVING a situation that is that toxic that it is damaging your will to live. Take care of yourself and reassess if you want to go back to school at another time, but for now prioritize yourself. Do you have a local community wellness clinic that offers any reduced rate counseling? Do you have friends or family that can listen to you? Consider taking days off to just self-care, visit nature, or do your favorite things (as long as you feel like you can be safe). Be proud of yourself for being courageous enough to keep going.",
      "author": "grajmiss",
      "created": 1552777686,
      "upvotes": 1,
      "replies": {}
    },
    "eiouoee": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiouoee/",
      "text": "It is absolutely appalling this happened to you. How much does your adviser know about what's going down? Is there any way to take a leave of absence to prioritize mental health and come back to your PhD when you're ready?   \n\n\nThank you for sharing with us, and keep sharing with us on Reddit (along with anyone else with whom you feel comfortable sharing.) Hang in there, OP.  ",
      "author": "Cindifrid",
      "created": 1552773392,
      "upvotes": 57,
      "replies": {
        "eirj155": {
          "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eirj155/",
          "text": "I haven't told my adviser the whole story because I am already afraid of looking weak and I don't want to burden him with excess bullshit because I'm not sure if he'll care. A lot of people take the view that if you can't work within the system, it's on you, instead of recognizing how the system has failed. He already accepted my withdrawal so it's a moot point now anyway. ",
          "author": null,
          "created": 1552863478,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eiot7yg": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiot7yg/",
      "text": "Holy shit how does a university turn down mental health care for \"pre-existing depression and anxiety\"? That's the biggest reason FOR having mental health care in the first place! That's like turning down health care for insulin because of \"pre-existing diabetes\". Fuck those guys.",
      "author": "StarmanTheta",
      "created": 1552772267,
      "upvotes": 348,
      "replies": {
        "eipcq9k": {
          "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipcq9k/",
          "text": "Universities that care that much about liability are rough to work with.\n\n",
          "author": "DataScienceUTA",
          "created": 1552787969,
          "upvotes": 36,
          "replies": {}
        },
        "eiqgrja": {
          "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiqgrja/",
          "text": "[deleted]",
          "author": null,
          "created": 1552835718,
          "upvotes": 4,
          "replies": {
            "eiqnujh": {
              "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiqnujh/",
              "text": "I guess that makes sorta kinda sense. I stopped mentioning suicidal ideation to my own counselling services due to a bad experience, but I don't know. Outside psychiatric help is not cheap, though, even if your health insurance covers it, and sometimes you just get fucked. I went months without meds simply because I couldn't afford the co-pay to get my prescriptions refilled...or buy the prescriptions.",
              "author": "StarmanTheta",
              "created": 1552840852,
              "upvotes": 3,
              "replies": {}
            },
            "eirjot1": {
              "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eirjot1/",
              "text": "Ironically, when I first approached them six years ago I was struggling a lot but not yet in critical condition. Fast forward to the present, after six years of working myself to the bone in extremely stressful conditions and my functioning has deteriorated to where I am suicidal, self-harming, and calling the crisis line every other night wanting to end it all. All the counseling office can say is \"I'm sure it's very frustrating that you can't find off-campus help\" and then sends me the same list of phone numbers that I've been calling for the last six years. Finding a therapist who's not grossly incompetent four weeks ago was too little and far too late. ",
              "author": null,
              "created": 1552863989,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "eiqb03i": {
          "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiqb03i/",
          "text": "Our mental health office was a joke at Manchester. They were only equipped to deal with 'academic issues' and were basically useless and told me to stop focussing so much on my 'other problems', and that if I needed help I'd have to look for it elsewhere essentially. I felt shocked, sitting there in that counselors office. That day really went far towards me deciding not to continue on to do my PhD there, that and the shitty way they treated international students like cashgrabs and nothing more.\n\nHang in there, OP. Life does get better after academia. You will definitely miss it but it's NOT the most important thing in the world. You are way more important and you need to focus on yourself.",
          "author": "CravingSunshine",
          "created": 1552830877,
          "upvotes": 3,
          "replies": {}
        },
        "eiq6kl9": {
          "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiq6kl9/",
          "text": "With all due respect, we only know OPs version and I doubt it's objective.",
          "author": "Eldsjal",
          "created": 1552826614,
          "upvotes": 5,
          "replies": {}
        },
        "eipnj0l": {
          "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipnj0l/",
          "text": "op could also be over dramatic in their report to us.  three sides of every story ",
          "author": "Furthur",
          "created": 1552798509,
          "upvotes": -14,
          "replies": {
            "eipomju": {
              "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipomju/",
              "text": "ehhh usually they don’t just bring people to the ER for no reason.\n\nIn many other cases on this subreddit, I would agree. This seems legit though. I wish him/her luck.",
              "author": null,
              "created": 1552799737,
              "upvotes": 22,
              "replies": {}
            },
            "eipsdn3": {
              "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eipsdn3/",
              "text": "Universities razor:\n\nIf it sounds shitty: a university did it.",
              "author": "DataScienceUTA",
              "created": 1552804425,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "eiosalb": {
      "link": "/r/GradSchool/comments/b1xfli/finally_quitting_my_phd/eiosalb/",
      "text": "I’m so sorry this happened to you. Academia is fucked up on so many levels, and what happened to you is especially fucked up. If a career as an academic is what you want, I hope you find the strength to stay and raise hell about their complete lack of support, but if you feel it’s better to cut your losses then also know that it is an entirely valid choice to leave a toxic environment. It does not mean you failed, and it doesn’t take away your brilliance. ",
      "author": "melian517",
      "created": 1552771569,
      "upvotes": 92,
      "replies": {}
    }
  },
  "updated": 1634064958
}