{
  "sid": "qw1rer",
  "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/",
  "title:": "Is the commute worth it?",
  "text": "Hi guys! I’m currently a Masters student living in NY but my school is in CT. The commute is about 1.5-2 hours. I’d only be going two days a week. This commute would only be for the Spring semester as I plan on making the move to CT for the fall so it would only be for four months that I’d make the commute. Would it be too much or should I just push through this one semester until I am able to make the move?",
  "author": "violetvixxen_",
  "created": 1637163025,
  "updated": 1637415343,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hkzzthh": {
      "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hkzzthh/",
      "text": "This mostly comes down to your personal feelings about the commute. Plenty of people have a commute like that everyday (I'm thinking of places like NY, LA, SF, etc.). I think doing this commute 2 a week for a semester is totally doable, but it sort depends on what else you have going on in your life.",
      "author": "rox_et_al",
      "created": 1637164229,
      "upvotes": 9,
      "replies": {}
    },
    "hl0bs9l": {
      "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hl0bs9l/",
      "text": "Two further considerations: \n\n1. Is this on mass transit or are you driving? This makes a big difference in your ability to do work.\n2. Is the 2 days a week thing absolutely certain? Are you losing out on important opportunities if you stick to it?",
      "author": "aggressive-teaspoon",
      "created": 1637168968,
      "upvotes": 8,
      "replies": {
        "hl0dvkt": {
          "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hl0dvkt/",
          "text": "Very much this.\n\nA class mate of mine lives on the far other end of the city from our university. It takes 1-2 hours to drive to school for them. They’re a good student and seem like they’re getting along just fine, but they miss out on events and impromptu study sessions a lot. They’ll learn a lot still I’m sure, but a lot of the value of graduate school seems to come from the network of people you create.",
          "author": "ThrowawayHistory20",
          "created": 1637169787,
          "upvotes": 3,
          "replies": {}
        },
        "hl0ivcx": {
          "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hl0ivcx/",
          "text": "Luckily I am a ferry ride away from my school. It would a mix of both driving and taking the ferry as the ferry doesn’t run as late at my classes end. I am trying to aim for one day a week but it is not working out in my favor. I would not be missing out on any other opportunities despite my travels",
          "author": "violetvixxen_",
          "created": 1637171715,
          "upvotes": 1,
          "replies": {
            "hl0vahe": {
              "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hl0vahe/",
              "text": ">I would not be missing out on any other opportunities despite my travels\n\nI find this concerning. The hope is that you decide the trade-offs are worth it, but a *lot* of opportunities come up through informal discussions that you will be less available for.",
              "author": "aggressive-teaspoon",
              "created": 1637176582,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hl04x3d": {
      "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hl04x3d/",
      "text": "It's doable. I did 1.5 each way 5 days a week for a year and it was fine. Just takes a little more planning and meal prepping. Actually helped me significantly with not doing any more work once I got home too",
      "author": "Unlikely-Name-4555",
      "created": 1637166272,
      "upvotes": 4,
      "replies": {
        "hl0ieh3": {
          "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hl0ieh3/",
          "text": "Wow 5 days? That takes a lot of dedication",
          "author": "violetvixxen_",
          "created": 1637171533,
          "upvotes": 1,
          "replies": {
            "hl0ns7d": {
              "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hl0ns7d/",
              "text": "Yeah some days it was annoying but it was worth it to be able to live with my boyfriend full time. Made a world of difference and was more than enough to motivate me to commute all week. Also actually enjoyed a lot of the driving and I could organize my day in my head on the way to work and relax with music after work",
              "author": "Unlikely-Name-4555",
              "created": 1637173630,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hl0mrwp": {
      "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hl0mrwp/",
      "text": "It should be fine. That works out to 6-8 hrs total commute per week, which is not unreasonable at all. The main problem would be lack of resources, less flexibility for in person meetings and such, but that may not be an issue for you.",
      "author": "almondbutter4",
      "created": 1637173234,
      "upvotes": 1,
      "replies": {}
    },
    "hl0o0s6": {
      "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hl0o0s6/",
      "text": "I did a 3 hour commute 2-3 days a week in UG for an internship, and after a while you don’t notice and it becomes just part of a routine. \n\nMy advice for commuting: pack snacks/caffeine so you don’t end up wasting money on fast food/ gas stations and for your health, always include a buffer time in your travel for road clot and traffic, download music/podcasts/audio books to keep yourself awake and entertained, fill your gas tank when you arrive at your destination so you aren’t scrambling when you leave",
      "author": "kerrydashann",
      "created": 1637173722,
      "upvotes": 1,
      "replies": {}
    },
    "hl11gvu": {
      "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hl11gvu/",
      "text": "Hi OP— my program is the only one in my state (MT) and is only two days a week for this exact reason— We have multiple folks in my cohort who make the commute from all over the state, with most of them staying here in town for the one evening between class days— sometimes with their cohort peers/other friends/some professors,\nsome camp, some rent motels or just kip in their cars and hit the school gym early mornings.  Most of them are fine with it because it’s only 2x a week, and our program is much more lenient with remote work. Most of my peers who commute have no plans to move, and my program is 2 years.",
      "author": "Femmeforever",
      "created": 1637179033,
      "upvotes": 1,
      "replies": {}
    },
    "hl1mt9k": {
      "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hl1mt9k/",
      "text": "Are the two days back to back so that you could stay over one night a week and only have to travel there/back once? I have to say I find a four hour round trip very tiring in a day. I thought it would be a good opportunity to get some work done but I always found I was too tired on the trip back. Are the two days compulsory? Would there be any leniency for online attendance given covid?",
      "author": "fjkfjldsls",
      "created": 1637187748,
      "upvotes": 2,
      "replies": {}
    },
    "hl3wswv": {
      "link": "/r/GradSchool/comments/qw1rer/is_the_commute_worth_it/hl3wswv/",
      "text": "Funnily enough, I live in NYC and commute to my grad program in CT 3 times a week, its a 90 minute drive! Its not fun but not awful either. I recommend stopping halfway through, grabbing a coffee or snack, and taking a seven minute walk.",
      "author": "photographruiner",
      "created": 1637234490,
      "upvotes": 1,
      "replies": {}
    }
  }
}