{
  "sid": "qwcehk",
  "link": "/r/GradSchool/comments/qwcehk/how_to_even_find_a_job/",
  "title:": "How to even find a job??",
  "text": "I've posted here a few times in the past, but I feel like nothing ever really happened and I can't do anything to change it\n\nI'm trying to find a job so I can actually quit my PhD. program, but that's proving problematic. Has anyone left grad school fairly late in the game (halfway through 5th year) and found a decent job? I keep getting ghosted by recruiters/hiring managers and I have no idea why. How do I make them notice or even care?\n\nSorry if I'm rambling, my life is sort of in free fall right now and I think grad school is a major factor in that. I just want to leave.\n\nEdit: I'm looking for an engineering/data science job. My PhD. Program is in the hard sciences. I have a masters in the same subject along with undergraduate degrees in physics and engineering. I don't want to get too specific just in case anyone I know is on this sub.",
  "author": "AlternativeNeat124",
  "created": 1637193199,
  "updated": 1637354746,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hl23mzc": {
      "link": "/r/GradSchool/comments/qwcehk/how_to_even_find_a_job/hl23mzc/",
      "text": "Given how different the job market can be between disciplines, I think you need to edit your post and say what specific discipline you're looking for a job in.",
      "author": "raistlin65",
      "created": 1637195184,
      "upvotes": 4,
      "replies": {
        "hl2409v": {
          "link": "/r/GradSchool/comments/qwcehk/how_to_even_find_a_job/hl2409v/",
          "text": "My bad, edited",
          "author": "AlternativeNeat124",
          "created": 1637195354,
          "upvotes": 1,
          "replies": {
            "hl244m7": {
              "link": "/r/GradSchool/comments/qwcehk/how_to_even_find_a_job/hl244m7/",
              "text": "Still not specific enough. I would specify your exact area of study.",
              "author": "raistlin65",
              "created": 1637195409,
              "upvotes": 2,
              "replies": {
                "hl24yvj": {
                  "link": "/r/GradSchool/comments/qwcehk/how_to_even_find_a_job/hl24yvj/",
                  "text": "Are hiring practices really that different between engineering fields? \n\nIdeally it would be in an electrical engineering/hardware engineering type position. My masters is in physics. A lot of my background is in electronics and building analytical equipment. I'd rather not be incredibly specific for privacy reasons.",
                  "author": "AlternativeNeat124",
                  "created": 1637195797,
                  "upvotes": 1,
                  "replies": {
                    "hl26eav": {
                      "link": "/r/GradSchool/comments/qwcehk/how_to_even_find_a_job/hl26eav/",
                      "text": ">Are hiring practices really that different between engineering fields? \n\n\nDidn't say your PhD was an engineering. You just said it was in the hard sciences.\n\nThat being said, yes. Job opportunities are different across engineering disciplines.\n\nBesides, if you provide specific information, then someone with more specific knowledge can help you better.\n\nBut if you just want general answers, then stick to providing general information.",
                      "author": "raistlin65",
                      "created": 1637196461,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hl36abo": {
      "link": "/r/GradSchool/comments/qwcehk/how_to_even_find_a_job/hl36abo/",
      "text": "My only advice is to mine your network hard. Use professors, old internships, friends of friends, people you haven't talked to in years, anybody that could be helpful. Don't feel weird about it, just take the awkward plunge and ask them for help. Worst they can do is say no. I realize that's super hard as a grad student since your network is fledgling, but that's why you have to really dig deep into your contacts. As much as I dislike the LinkedIn ethos, it can actually be useful for organizing who you know and who they know. Basically got my job through my network. I am in my 5th year and they have been happy to let me finish my PhD (on my own time lol....). Obviously applying cold to jobs can work as well, but if you have an in or a mutual acquaintance, it can be the extra bump you need to stand out. Good luck!",
      "author": "AMostAverageMan",
      "created": 1637214003,
      "upvotes": 2,
      "replies": {}
    },
    "hl3bnll": {
      "link": "/r/GradSchool/comments/qwcehk/how_to_even_find_a_job/hl3bnll/",
      "text": "Are you listing your Ph.D. on your resume? That could be deterring people if they think you’re committed and asking you to hold a job until you graduate. I’ve also heard that the job market is just really hard right now. One of my friends has been looking for 6+ months after his MS and has had no luck despite being totally open to relocating or really any job he can get. Not sure what’s going on in the hiring world right now.",
      "author": "TheColt45",
      "created": 1637217555,
      "upvotes": 2,
      "replies": {
        "hl3bwv5": {
          "link": "/r/GradSchool/comments/qwcehk/how_to_even_find_a_job/hl3bwv5/",
          "text": "I didn't even think of that. It's listed as graduate research, but I believe I mentioned I was in a PhD. program.",
          "author": "AlternativeNeat124",
          "created": 1637217733,
          "upvotes": 1,
          "replies": {
            "hl3c5rt": {
              "link": "/r/GradSchool/comments/qwcehk/how_to_even_find_a_job/hl3c5rt/",
              "text": "Yeah, unless your graduation date was listed as fairly soon they may have just written you off since they need someone now vs. later. At the end of the day there’s no communication besides automated emails 90% of the time so it’s hard to tell what was missing in your application, but that’s just one guess of mine.",
              "author": "TheColt45",
              "created": 1637217911,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}