{
  "sid": "qnu9v7",
  "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/",
  "title:": "Has anybody here quit academia and grad school to pursue a drastically different life? Do you regret the decision?",
  "text": "Hi. I'm in my final semester for my master's and am planning on applying for a PhD. I'm studying CS.\n\nI've always wanted to cook and work in a kitchen. I'm 29 now and am wondering whether this whole academia thing was because of external pressures like my parents or friends.\n\nHas anybody here ever made such a drastic career change? Do you regret it?",
  "author": "Seankala",
  "created": 1636179196,
  "updated": 1636656723,
  "over_18": false,
  "upvotes": 164,
  "upvote_ratio": 0.99,
  "comments": {
    "hjiuk0i": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjiuk0i/",
      "text": "I love to cook, and love even more to eat, so I've definitely entertained a passing thought about a hypothetical alternate life around food.\n\nBut then I remember that being a chef is one of the absolute worst jobs. Low pay, long, unpredictable hours, lots of night/overnights, high stress, being a sweaty stinky mess, having to work with people of ill repute, difficult path for career advancement...\n\nIf you like cooking and like food, you can definitely do that kind of thing without it being your career. I experiment in the kitchen all the time, and read cookbooks like normal people read novels. I may even sign up for a cooking class at my local community college if my schedule will allow it. If you decide graduate school is not for you, that's fine, but I would strongly suggest thinking about an alternate career that provides you the ratio of stability, income, and work-life balance you value.",
      "author": "False-Guess",
      "created": 1636182797,
      "upvotes": 160,
      "replies": {
        "hjji021": {
          "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjji021/",
          "text": "You know, I think this way too, I love cooking, but the idea of selling what I do makes me feel anxious, and why ruin a thing that I do for fun/enjoyment? ...but I just got into a master (after not doing anything related to my field for 4 years) which I like, but I fear that I made a mistake sometimes. Its been 2 months of classes and I wouldn't be suprised if I fail every class (math master after a 4 year gap after my physics bachelor is *hard*). Maybe my gap was too big for for me to go into it as I did, and I can't help but wonder.",
          "author": "bananaperson127",
          "created": 1636200571,
          "upvotes": 27,
          "replies": {
            "hjjumtu": {
              "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjjumtu/",
              "text": "Trust me you'll make it through. I got through my math masters class after a two year gap. You should be fine.",
              "author": "suckuma",
              "created": 1636207172,
              "upvotes": 7,
              "replies": {
                "hjkj78a": {
                  "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjkj78a/",
                  "text": "differential geometry will be the death of me. thanks. It helps to know it's been done. 👍",
                  "author": "bananaperson127",
                  "created": 1636217871,
                  "upvotes": 3,
                  "replies": {
                    "hjl3gmx": {
                      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjl3gmx/",
                      "text": "I'm a chemical engineering masters student. Have you done things like greens functions. Those things were brutal to calculate. We had to derive one for a transport problem and it's like 28 pages of math.",
                      "author": "suckuma",
                      "created": 1636226588,
                      "upvotes": 2,
                      "replies": {
                        "hjwubm9": {
                          "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjwubm9/",
                          "text": "haven't though about a green function in more than 5 years actually. I'm not looking forward to that.",
                          "author": "bananaperson127",
                          "created": 1636443869,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hjl4u4r": {
              "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjl4u4r/",
              "text": "I'm the same way lol I love to cook, but the idea of other people eating my food makes me anxious because what if they don't like it?\n\nI think it's normal to feel rusty when you've been out of the field for awhile. Before I started my PhD program, I worked in retail and in local government collecting taxes. To say I was rusty was an understatement lol You may have some extra catching up to do, but if you were totally unqualified and had no potential to succeed, you would not have been admitted. The admissions committee obviously saw something special, so if you haven't already, maybe try reaching out to your adviser to see what resources may be available to you.",
              "author": "False-Guess",
              "created": 1636227191,
              "upvotes": 3,
              "replies": {
                "hjwu99b": {
                  "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjwu99b/",
                  "text": "My last job was at a bakery, it was tiresome and nice, didn't felt like an idiot. Although I don't have a problem with people trying what I make, it stings a bit when they don't. The problem is with selling it. what if i didn't made a quality product?\nalso, that's kinda why I decided to come (well that and my fear of not being accepted at any program, I was seriously not expecting to get admitted). Maybe my motives letter was good? I don't know. Anyway, gotta get to it.",
                  "author": "bananaperson127",
                  "created": 1636443816,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hjjyfxo": {
          "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjjyfxo/",
          "text": "Don’t forget always working on holidays and weekends. I’ve never been a chef, but I was a server/bartender for 10 years. I think I spent one Christmas with my family that whole time. I guess it depends on the restaurant, but at most and resorts where you actually get paid worth a shit, you don’t have holidays with anyone but the staff.",
          "author": "sponge-worthy91",
          "created": 1636208893,
          "upvotes": 11,
          "replies": {
            "hjl48gk": {
              "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjl48gk/",
              "text": "Oh yeah, i forgot about that. Deciding which holidays with your family you have to miss sucks. Where I worked, you had to work Thanksgiving, Christmas, or New Years. Nobody could have all 3 off, and most people did not get 2 off. If you didn't volunteer, the managers would schedule you, often out of spite. \n\nAt the time it wasn't a big deal for me since I have some family in law enforcement so we didn't celebrate Thanksgiving and Christmas on the actual day, but many of my coworkers had kids so that really sucked.",
              "author": "False-Guess",
              "created": 1636226926,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hjiy9g5": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjiy9g5/",
      "text": "I did.  I quit a successful poker playing career to pursue a 'real job'.  I went on to earn two masters degrees before beginning my PhD.  I got into an amazing program, with great people.  My advisor was absolutely amazing.  I was offered a generous aid package.  \n\nI knew almost immediately that I wasn't happy anymore.  I quit after the first semester of my PhD, and it was one of the hardest decisions of my life.  How do you quit when you worked so hard to get exactly what you thought you wanted?\n\nBut honestly: it was one of the best decisions I've ever made, and I'm the happiest I've been in years.  I'm back to playing poker full time, and even though i now have a much more uncertain work environment (i.e.  a job where I can actually *lose* money), you couldn't pay me enough to ever go back.  \n\nTl:dr, hardest decision I ever made, but the happiest I've ever been.",
      "author": "BaiserMort",
      "created": 1636185772,
      "upvotes": 97,
      "replies": {
        "hjk56n4": {
          "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjk56n4/",
          "text": ">How do you quit when you worked so hard to get exactly what you thought you wanted?\n\nThis is my exact feeling right now and for the past half year! I wanted to go to Grad School right after undergrad, but I had to wait four years because... life! Then, I finally get into a reputable program in a university with many resources, but during the worst possible time (pandemic restrictions, divorce, illness, plus everything that comes with a first year of grad school in a new place). I'm in my second year (and last), and I'm just going with the flow right now. The only thing I enjoy is TAing (despite having an absolute micromanaging maniac as my boss). I love my students, and I love teaching, so I know at least I need a Masters even for other jobs that I see myself doing. However, every class I take seems absolutely pointless, I will never use anything I'm studying at the moment, and working on any research feels like torture. I keep telling myself to just finish it, but just thinking about having a whole thesis due next April causes my brain to shut down. I'm at a crossroads.",
          "author": "lebohardwitztyle",
          "created": 1636211874,
          "upvotes": 8,
          "replies": {}
        },
        "hjizpw6": {
          "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjizpw6/",
          "text": "If your work puts food on the table, it is a real work. Professional poker player is a job and should be respected as such. Be proud of your career choice.",
          "author": "Wise-Replacement7286",
          "created": 1636186968,
          "upvotes": 36,
          "replies": {
            "hjj46qh": {
              "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjj46qh/",
              "text": "And a difficult one at that!",
              "author": "touched-by-eris",
              "created": 1636190633,
              "upvotes": 17,
              "replies": {}
            },
            "hjl8kjc": {
              "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjl8kjc/",
              "text": "It's a nice sentiment, but profit shouldn't be the yard sick we use to measure if a job is respectable.",
              "author": "misanthpope",
              "created": 1636228828,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hjj7fc4": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjj7fc4/",
      "text": "Hey, I worked as a cook for 10 years while I went through undergrad and post grad, and I can assure you loving to cook isn't enough. Live life the way you want but be careful about romanticizing a job/profession because it's different than the path you're on. Best of luck friend",
      "author": "Conhbd",
      "created": 1636193195,
      "upvotes": 49,
      "replies": {
        "hjkcxgy": {
          "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjkcxgy/",
          "text": "Retweet. I have been a hibachi chef most of my undergraduate career. Suffice to say, it is grueling work and romanticizing a chef job is a perilous pitfall. I’m ready to get out of there!!",
          "author": "Resident_Tonight_916",
          "created": 1636215191,
          "upvotes": 5,
          "replies": {}
        },
        "hjlikut": {
          "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjlikut/",
          "text": "It’s always greener on the other side :)",
          "author": "Mycrawft",
          "created": 1636233277,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjiv4n4": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjiv4n4/",
      "text": "Haven't been in this situation, but i'll offer some advice:\n\n\nYou only have one life, so live it in a way that makes you happy. \n\nExplore any/all life iterations that interest you while you can. \n\nYou just spent a good amount of time on (soon to be) getting a masters in CS. Do something with it. This does not mean CS has to take the majority of your free time. You can do freelance work/work part time. If you don't have software engineer experience, it's best you get some before you venture out of the field, since you are still in gradschool, look for a summer internship. 3 month commitment but it adds something to your CS work history. \n\n\n\nIdea: COVID has been hard on the restaurant industry amd there are probably some mom&pop restaurants that haven't linked there restaurant to a modern-full-stack website. Offer to create a website for pay, or in exchange for some cooking lessons/time in the kitchen to see what working in a kitchen would be like. \n\n\nYou can also get a part-time kitchen job for funsies. Once you gain a better understanding into what you want to pursue you can decide what you do full time and what you do part time. \n\n\nDo not live your life to meet the expectations of someone else. Do what fulfills you.",
      "author": "Pos1tivity",
      "created": 1636183254,
      "upvotes": 31,
      "replies": {}
    },
    "hjjnelo": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjjnelo/",
      "text": "I think about this all the time. How much I want to drop everything and play out my dream of living in Europe and working enough to pay bills, save a little, and live an overall simple and peaceful life. Which I’ve found, thus far, to be a little more difficult in the U.S. Of course, I’ve never lived in Europe, but I was born in Italy and whenever my mom talks about it you can see how much happier she was there. Anyway, I totally get where you’re coming from. Ultimately, you’re the only one who can make this decision. Write down what you want your life to be like 10 years from now, then figure out if your current life is aligning with those goals.",
      "author": "salamandersway",
      "created": 1636203674,
      "upvotes": 16,
      "replies": {
        "hjk5n0z": {
          "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjk5n0z/",
          "text": "I hate to say this, but are you me? \n\n>How much I want to drop everything and play out my dream of living in Europe and working enough to pay bills, save a little, and live an overall simple and peaceful life.\n\nI want this so bad! I wish it was just as easy as moving there and start living that life.",
          "author": "lebohardwitztyle",
          "created": 1636212068,
          "upvotes": 3,
          "replies": {
            "hjkopki": {
              "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjkopki/",
              "text": "I do live in Europe, doing my phd, earning enough to pay the bills, but if I ever want to own a house, the money'll have to come out of an industry job. Yes, we are usually paid to write a phd, but job security is not good (funding is tied to projects, which come, or not, and often you need to secure those projects yourself), and the supervisor-student dynamic can be just as fraught as elsewhere.\n\nThat being said, the weather and the food in Italy -are- amazing. If you can work remotely or for a foreign company, it would be a wonderful situation.",
              "author": "opheliazzz",
              "created": 1636220158,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hjj1o55": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjj1o55/",
      "text": "I guess it isn't really THAT different but I quit computational chemistry in academia to do data science outside of academia. It's slightly less interesting, but only slightly. And everything else is way better.",
      "author": "iammaxhailme",
      "created": 1636188563,
      "upvotes": 15,
      "replies": {}
    },
    "hjjnj9r": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjjnj9r/",
      "text": "Left the last semester of my MA in History with a 3.9 GPA to take a Natural Resources job.  \n  \nDid that for 4 years. Burned out. Now I work in healthcare contracting and couldn't be happier. And will break 6 digit income by 2025.  \n  \nHad I stayed for my PhD like I planned, I'd still be in school right now. Instead I'm a year from being debt free, have time for my kids, and time for me. My only regret is not finishing my last semester just to check the box - but oh well.",
      "author": "Dire88",
      "created": 1636203742,
      "upvotes": 14,
      "replies": {}
    },
    "hjk0zau": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjk0zau/",
      "text": ">I've always wanted to cook and work in a kitchen.\n\nSeriously back breaking and thankless work. I suggest you give it a try to recalibrate your mind.",
      "author": "Mug_of_coffee",
      "created": 1636210014,
      "upvotes": 14,
      "replies": {}
    },
    "hjjuhk9": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjjuhk9/",
      "text": "I am still a post-doc. But I don't plan on pursuing a career in science.\n\nInstead, I have started my new business my monetizing on of my hobbies.  I already make more there than as a post doc.  And I like it alot.",
      "author": "Midnight2012",
      "created": 1636207105,
      "upvotes": 11,
      "replies": {}
    },
    "hjjsvmb": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjjsvmb/",
      "text": "There are literal academic papers about why one shouldn’t work in a kitchen, I beseech you, don’t do it. Source: I was a professional chef and am now in a PhD program. \n\nThat being said, there are several ways you can apply your CS degree to the restaurant industry if that’s where you want to be. It’s a slow industry to adapt to technology but now with Covid and a staff shortage it’s being forced to. There is no shame at all in working in the industry between your masters and your PhD. It may not be the norm in your field but people who come in to a PhD program having worked after their masters have more of a sense of why they’re there.",
      "author": "squeezicks",
      "created": 1636206339,
      "upvotes": 11,
      "replies": {}
    },
    "hjjq37w": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjjq37w/",
      "text": "I finished my MA in 2017 and spent a few years adjuncting before I figured I wanted out of academia. The pandemic and burnout were the final straws that put me over the edge. I decided to take some time off and live off UI/savings, and now that I'm trying to get back into the workforce the job outlook is bleak for me. I do regret leaving, as I would have probably gotten a full time position teaching by now, but maybe not. \n\nI wish I could say I learned some valuable lessons in all this, but I can not.",
      "author": "Mongopwn",
      "created": 1636204996,
      "upvotes": 6,
      "replies": {}
    },
    "hjk5ar5": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjk5ar5/",
      "text": "I made the jump from research Earth scientist to sailor. 100% worth it. Sailing is a skill that heavily involves problem solving, risk management, and a host of other skillsets that I enjoy. I get to work with my hands and engage with people, or just be off on my own. Part of being an intelligent creature is being able to step out of your box. If grad school's got you boxed up, I would entertain a change.\n\n&#x200B;\n\nP.S. One of those skills is also cooking which I enjoy doing a lot, whether it's for charter guests or myself. I should also mention that I have no idea what I'm doing with my life and that's okay. I've learned to live comfortably with uncertainty.",
      "author": "daphnephoria",
      "created": 1636211922,
      "upvotes": 8,
      "replies": {}
    },
    "hjjw5sq": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjjw5sq/",
      "text": ">I've always wanted to cook and work in a kitchen.\n\nJust know that if you want to be a chef, you'll likely make less money and work even more hours than someone with a PhD, whether a PhD in academia or outside of it.\n\nYou might want to research that career path more. It's not one to choose just because you \"want\" it. You better love it and be consumed by it. \n\nYou'll need to go to culinary school. And then you'll need to train for several years by working underneath accomplished chefs. Where the hours can be worse than being a graduate research assistant. \n\nAnd then good chefs who run their own kitchens often work 70 to 80 hours a week or more throughout their career.\n\nAt least I'm assuming you don't mean just being a line cook in a restaurant making a few dollars more than minimum wage. If that's what you want to do, just take a year off after the Masters and try it.",
      "author": "raistlin65",
      "created": 1636207872,
      "upvotes": 3,
      "replies": {}
    },
    "hjlqa7n": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjlqa7n/",
      "text": "... I just quit to be a stay at home parent. First month involved some nerves and grief and that's all good now. Don't  regret it and I don't think I will. \n\nWith my salary expectations after finishing, I would basically just be earning just enough to pay someone to take care of my kids for me. Glad I put an end to that nonsense early.\n\nI think the only job harder than this is grad school, so I'm actually finding it pretty good so far.",
      "author": "kitten_twinkletoes",
      "created": 1636236731,
      "upvotes": 3,
      "replies": {}
    },
    "hjiu7j5": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjiu7j5/",
      "text": "I think about taking up beekeeping, factory work, interior design, book selling etc etc. \n\nI’m sick of academia but I also don’t want to grow up 🤷🏻‍♀️",
      "author": "Ok_Organization5596",
      "created": 1636182524,
      "upvotes": 10,
      "replies": {
        "hjjmdpd": {
          "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjjmdpd/",
          "text": "I think there a large percentage of grad students are there becauae they \"dont want to grow up\" and the baggage that mentality brings is an annoyance on those in grad school who are there to excel and actually add to science. Not all people should be grad students imo, many low achievers flock to it and treat it as if it an extension of high school.",
          "author": "murfmurf123",
          "created": 1636203130,
          "upvotes": -18,
          "replies": {
            "hjjn3u3": {
              "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjjn3u3/",
              "text": "How would you even know how other students are performing? And why would that annoy you, or be any of your business?\n\nGrad school by it's very nature does not recruit 'low achievers' the entry requirements are too stringent. \n\nYou need to pull your head out of your ass and get some humility.",
              "author": "Ok_Organization5596",
              "created": 1636203520,
              "upvotes": 19,
              "replies": {}
            },
            "hjjq6gu": {
              "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjjq6gu/",
              "text": "Lol imagine being this full of yourself that you think someone who got into grad school is a low achiever, and also that it’s any of their business why people chose it. \n\nAlso btw, grad schools aren’t just STEM programs.",
              "author": "throwmedownthequarry",
              "created": 1636205038,
              "upvotes": 16,
              "replies": {
                "hjk6gkq": {
                  "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjk6gkq/",
                  "text": "Imagine being so clueless that you think the bar to get into many grad programs is high. (It's not)",
                  "author": "murfmurf123",
                  "created": 1636212419,
                  "upvotes": -7,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjk8u73": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjk8u73/",
      "text": "Didn’t quit grad school, but I did leave academia. Haven’t regretted for a second. I only wish my field was even further away from what I studied.",
      "author": "CindyV92",
      "created": 1636213420,
      "upvotes": 2,
      "replies": {}
    },
    "hjk98v7": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjk98v7/",
      "text": " Omg holy shit do not do that. Your earning power will be quartered and you will literally work 12 hours a day, 7 days a week. I say that as a person that loves and has respect for the industry. \nJust make a sandwich, man, you’re on a good path!",
      "author": "calidownunder",
      "created": 1636213593,
      "upvotes": 2,
      "replies": {}
    },
    "hjkxgwd": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjkxgwd/",
      "text": "Please don’t say that you are going to quit your masters while you’re in your last semester",
      "author": "TheEvilGhost",
      "created": 1636223953,
      "upvotes": 2,
      "replies": {}
    },
    "hjl4gg7": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjl4gg7/",
      "text": "To quit or not to quit?\n\nThe answer can only be from yourself.\n\nwhy quit?\n\n- not aligned with your principle of life\n\n- not enough resources (time, energy, intelligence)\n\n- not matter to anyone\n\nwhy not quit?\n\n- it is too important for someone to do this, and you are the right person to do this\n\n- it is a miestone goal to your long term goal\n\n- it brings happiness\n\n- it can be linked to a higher purpose",
      "author": "born-to-code",
      "created": 1636227023,
      "upvotes": 2,
      "replies": {}
    },
    "hjlgnp1": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjlgnp1/",
      "text": "I'm going to tell you right now, being a cook, and being a chef are vastly different.\n\nA line cook job is dogshit, pay is dogshit, hours are dogshit, environment is dogshit.\n\nChef's have more flexibility in pay, but work longer hours, often do more in a kitchen than a line cook, and still get the added physical pain bonus from hell.\n\nI'd definitely get a part time job as a cook before you go balls deep. Make sure you like it first. You may love everything about it, but I'd definitely try it.",
      "author": "Emperor-Valtorei",
      "created": 1636232408,
      "upvotes": 2,
      "replies": {}
    },
    "hjljqgc": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjljqgc/",
      "text": "Would cooking as a hobby fill that desire for you? You try new things to make for yourself, your family, and your friend to scratch that itch!",
      "author": "Speerjagerin",
      "created": 1636233807,
      "upvotes": 2,
      "replies": {}
    },
    "hjkj66e": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjkj66e/",
      "text": "I took a lot of time off between undergrad and starting my PhD, and for a lot of that time I had jobs that were completely unrelated to academics. Then after a few years I applied to grad school, got in, and I'm here now. It certainly brought some challenges, but I'm grateful for the time I spent outside of academia, and I entered my PhD being absolutely sure that this is what I want to do (which is extremely important imo)\n\nI don't see any reason why you couldn't do something similar. Yeah, I agree that working in kitchens sucks, but it's not like you're trapped if you decide to try it. Why not take a year off before applying to your PhD and go see what it's like? Just make sure to keep in touch with the professors you might want rec letters from, and don't burn any bridges. Good luck!",
      "author": "applesauceconspiracy",
      "created": 1636217858,
      "upvotes": 1,
      "replies": {}
    },
    "hjkktig": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjkktig/",
      "text": "went back to bartending.  easy choice for me!",
      "author": "Furthur",
      "created": 1636218543,
      "upvotes": 1,
      "replies": {}
    },
    "hjkqet7": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjkqet7/",
      "text": "I left my my masters program last year. For most of my undergrad I was encouraged by a few profs to pursue the program at the uni I was attending. Eventually I figured it was the right move, and was getting very, very excited by it. I got accepted the year I applied and even won scholarships to cover most of my tuition. I thought I hit the jackpot. My first day, I knew it wasn't actually for me. But I held out because I was told I'd be a great fit and it would be go far with it, but I was absolutely miserable, trying to convince myself it was right.\n\nThing is, I hate being isolated, don't like the politics, disinterested in the content and the career options seemed abundant, but was just not where I wanted to be. After my 1st semester, I dropped half my course load, and after my first year, I dropped out completely.\n\nI landed a job related to my program/undergrad ( ironic and lucky, I know) and took it to see if I'd feel right in this career path and thought it'd help me understand if I made the right decision to leave. Well, it did.\n\nI don't fit well into the work culture, I still don't like being isolated all day and I can't work from a desk, not moving around and interacting. I finish my contract next month and have began transitioning to a totally new field that I'm actually excited for and has me working in a way I am good at working. So for me, leaving my masters saved my mental health, my bank account, my well being, and honestly, with everything else going on, my life. It can feel like a waste of time, quitting before you're done, but if you know it's not for you, then there's nothing you can do but move on. Life's too short to stay in misery and not explore your options.\n\nFor reference I'm 27 and was scared shitless thinking I'd never land another job, too late to switch careers, etc. But the funny thing is, with a little time and a little effort, it all changes.\n\nI hope this sheds a little light. If I had to make the choice again, I'd choose the same thing.",
      "author": "factdaddy411",
      "created": 1636220886,
      "upvotes": 1,
      "replies": {}
    },
    "hjm2bah": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjm2bah/",
      "text": "Maybe you could find a way to use your existing skill set to work in the food industry somehow...that's what I did when I realized I didn't want to get a chemistry PhD. Ended up in food science.",
      "author": "MsAggieCoffee",
      "created": 1636242224,
      "upvotes": 1,
      "replies": {}
    },
    "hjmo8we": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjmo8we/",
      "text": "Many people want to give up on something because they feel burned out. They also wonder if they made the right decision.  I understand. I have felt burned out as well.  I know it is also common for people to wonder if everything is from external pressure. I know that our family and friends tell us to do something.  They may or may not be right.  Yet, we can second-guess everything.",
      "author": "KookyEstablishment80",
      "created": 1636252731,
      "upvotes": 1,
      "replies": {}
    },
    "hjmw3e0": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjmw3e0/",
      "text": "I was in a PhD program, left with a master's. Now I'm in a think tank associated with a university, it still sucks since it's very much like academia culturally and I'm expected to publish as much as I can, but no hard quotas. I'm personally wanting to enter tech again. I interned as a researcher for a gaming studio and that was awesome.",
      "author": "Weird_Surname",
      "created": 1636256917,
      "upvotes": 1,
      "replies": {}
    },
    "hjoomb6": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjoomb6/",
      "text": "Cooking professionally is a highly romanticized job but often ends up being a life of low wages, chain smoking, and railing stimulants to work double shifts - try taking the summer before your PhD to work and see if it’s a lifestyle you actually would want to drop out for",
      "author": "FormerlyKnownIntent",
      "created": 1636300155,
      "upvotes": 1,
      "replies": {}
    },
    "hjtg8n3": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjtg8n3/",
      "text": "I dropped out of my PhD to do programming instead. \nBest choice I ever made. \nAcademia was just not what I hoped it would be. Pretty disappointed.",
      "author": "scanguy25",
      "created": 1636387940,
      "upvotes": 1,
      "replies": {}
    },
    "hjmnwv7": {
      "link": "/r/GradSchool/comments/qnu9v7/has_anybody_here_quit_academia_and_grad_school_to/hjmnwv7/",
      "text": "I think you should stick with graduate school and academia.  The only chefs that make good money are those celebrity chefs and those that own top restaurants.  The rest of chefs make less pay and work long hours, make mostly the same meals over and over and they are mostly just back in the kitchen, cooking away.",
      "author": "KookyEstablishment80",
      "created": 1636252558,
      "upvotes": 0,
      "replies": {}
    }
  }
}