{
  "sid": "qosxnr",
  "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/",
  "title:": "How do you gain confidence to talk with and present to people?",
  "text": "I have pretty bad social anxiety and I'm always marvelled at how socially fluid people like my supervisor are at talking to people and sharing ideas with them.\n\nHow can I build confidence to talk to other academics/PhD students and start sharing ideas with them? I have dreadful social anxiety which keeps making me question every move and feel inadequate :(",
  "author": "Nuclear_Fermion",
  "created": 1636305117,
  "updated": 1636656579,
  "over_18": false,
  "upvotes": 23,
  "upvote_ratio": 0.93,
  "comments": {
    "hjp6mhp": {
      "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjp6mhp/",
      "text": "I think social anxiety is a really important issue in the academia world. I used to have social anxiety and wouldn't be able to go out at all or I'll be shivering. I realized that it's a long process to gain confidence. Start by talking to more friends, one by one. Don't rush yourself.",
      "author": "AtomBus887",
      "created": 1636307304,
      "upvotes": 13,
      "replies": {
        "hjpre1m": {
          "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjpre1m/",
          "text": "Has your social anxiety gone away then?",
          "author": "xenondeadtime",
          "created": 1636315385,
          "upvotes": 1,
          "replies": {
            "hjprphb": {
              "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjprphb/",
              "text": "Yes",
              "author": "AtomBus887",
              "created": 1636315507,
              "upvotes": 5,
              "replies": {
                "hjqigdf": {
                  "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjqigdf/",
                  "text": "About how long did it take?",
                  "author": "xenondeadtime",
                  "created": 1636326430,
                  "upvotes": 2,
                  "replies": {
                    "hjs2hpz": {
                      "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjs2hpz/",
                      "text": "It definitely took me like 3 years to be confident. Sometimes my anxiety come and go and people can tell, but I'm at a much better place",
                      "author": "AtomBus887",
                      "created": 1636356505,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjp24vz": {
      "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjp24vz/",
      "text": "I took a presentation course at my university and it was quite helpful. There was a small group of people and a nice teacher and I gave a lot of presentations and got feedback on what I could improve. The more you present, the easier it gets.\n\nIf your social anxiety is too much, maybe you could consider counseling? My uni also offered that free of charge to students.",
      "author": "NoNopeMelon",
      "created": 1636305514,
      "upvotes": 8,
      "replies": {}
    },
    "hjq2fh3": {
      "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjq2fh3/",
      "text": "Realize that many other academics, even famous senior people, are socially awkward and shy. You can be the good guy who starts the conversation and makes them comfortable. You introduce them to some other awkward people. All of a sudden, you're the life of the party.",
      "author": "fwafwa",
      "created": 1636319707,
      "upvotes": 6,
      "replies": {}
    },
    "hjpwplf": {
      "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjpwplf/",
      "text": "Do it a bunch. Finds drugs that help. Get a therapist",
      "author": "Trakeen",
      "created": 1636317466,
      "upvotes": 4,
      "replies": {
        "hjpz2lz": {
          "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjpz2lz/",
          "text": "yeah get fucked up on coke it really helps",
          "author": "HLA-AIRE-VIT1",
          "created": 1636318375,
          "upvotes": 1,
          "replies": {
            "hjqiwk8": {
              "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjqiwk8/",
              "text": "I mean you’re not wrong",
              "author": "totodile241",
              "created": 1636326633,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hjrfclp": {
      "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjrfclp/",
      "text": "It was a slow grind for me, like 10 years slow. What helped the most was accepting the feeling as a rush more than straight anxiety. Might not work for you, but changing that in my case let me be more excited about it than scared. Also the practice makes perfect thing is real in this case, you will stumble all the time, just move past it and learn from the mistake if possible. If you need boot camp mode for this, I recommend starting a YouTube channel of anything you are interested in and talking about it. It will get you use to speaking knowing people might be listening but without any real repercussions of a stumble. Don't treat the channel as something you want success from necessarily, treat it as a tool for practice at speaking.",
      "author": "Diver808",
      "created": 1636341718,
      "upvotes": 3,
      "replies": {}
    },
    "hjqnh8x": {
      "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjqnh8x/",
      "text": "Having the confidence that I know what I am talking about. Comes with time and practice.",
      "author": "backinanhour",
      "created": 1636328620,
      "upvotes": 2,
      "replies": {}
    },
    "hjqsjbe": {
      "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjqsjbe/",
      "text": "Start small and build. It takes active effort but over time like any skill you build with experience you get to the point that newcomers think it's effortless.\n\nSo pitch ideas to labmates. Throw in something during lab meeting to spark discussion. Volunteer to present at journal clubs. Attend social events in your program. You don't have to do anything but be there at first. Build on little things. Small goals.",
      "author": "wondert",
      "created": 1636330869,
      "upvotes": 2,
      "replies": {}
    },
    "hjs8eus": {
      "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjs8eus/",
      "text": "Many of us are also socially anxious. You may first start small and then graduate to talking more. For example, simply talk to yourself first. Imagine some situations and give your views, then take imaginary turns to respond. Speaking in front of a mirror is also helpful.",
      "author": "Kingarvan",
      "created": 1636361680,
      "upvotes": 2,
      "replies": {}
    },
    "hju1kha": {
      "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hju1kha/",
      "text": "If you have the opportunity, I highly recommend teaching or at least guest-lecturing in a topic you feel confident in. I teach an intro survey course and it has helped my fear of public speaking tremendously. There are moments that I don't know the exact answer to a question a student has, but they are very receptive to a response of \"I'm not sure, ill check and get back to you\". In my experience students prioritize their grades so I've never been asked an esoteric question that an academic may ask.\n\nAlso, PhD students are in the same position as you, so judging you is probably the last thing they are doing!",
      "author": "hellokoalaa",
      "created": 1636396478,
      "upvotes": 1,
      "replies": {}
    },
    "hjuo92m": {
      "link": "/r/GradSchool/comments/qosxnr/how_do_you_gain_confidence_to_talk_with_and/hjuo92m/",
      "text": "This is going to sound crazy, but think about this approach:  \n\n\nEnroll in, or join an Improv Class/Club on campus. I GUARANTEE you will either \n\n1. abandon your lack of confidence\n\n2. get far more comfortable with that lack of confidence and simply do it regardless of that feeling",
      "author": "BayAreaTechRecruiter",
      "created": 1636405580,
      "upvotes": 1,
      "replies": {}
    }
  }
}