{
  "sid": "q95j5e",
  "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/",
  "title:": "Group Work Horror Stories! 🎃",
  "text": "Share your group project nightmares! \nHow did you deal with shitty group members who would not pull their weight? \nEither they do the bare minimum just to get that passing grade or what they do contribute is literally unusable. \nAny advice? Tips? \nI’m currently just putting names on my shit list titled: “Get the fuck away from me” :D",
  "author": "spacegypsea",
  "created": 1634361388,
  "updated": 1634603177,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hgtwmao": {
      "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgtwmao/",
      "text": "But most group projects, I wind up doing everything. Either because everyone else is a flake or because it's not being done to the quality that I prefer.",
      "author": "Ophelia550",
      "created": 1634363023,
      "upvotes": 10,
      "replies": {
        "hgtyhxy": {
          "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgtyhxy/",
          "text": "that’s my situation right now. It is so frustrating. The instructor has us do evaluations at the end and I’m not even sure how I’ll do that 😂",
          "author": "spacegypsea",
          "created": 1634364444,
          "upvotes": 5,
          "replies": {
            "hgtz7ok": {
              "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgtz7ok/",
              "text": "I honestly feel like by grad school, you've outgrown group projects. Group projects, IMO, are for beginning learners who need to learn how to work together. I really resented having to work on group projects as an assignment in grad school.\n\nI especially resented having to write papers together (obviously as an assignment, not research) as a grad student. This was clearly just the instructor's end run around having to grade as many papers. There was no benefit to us at all. If it's not research, how does one write a paper together, anyway?",
              "author": "Ophelia550",
              "created": 1634365007,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "hgvqrsv": {
      "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgvqrsv/",
      "text": "My problem is that I’m constantly grouped up with people who want to dominate the entire project and order everyone else around. They don’t understand that group work is for the group and everyone has to negotiate and work together to make everyone go smoothly.",
      "author": "Dustin_Bromain",
      "created": 1634405050,
      "upvotes": 3,
      "replies": {
        "hgy65w0": {
          "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy65w0/",
          "text": "I had that issue last quarter where this guy took it upon himself to be project manager bc he has all this unrelated “work experience”. Dude micromanaged to no end and almost wanted to submit a document that contained two duplicate presentation slides. If you have the audacity to be breathing down people’s necks, you should be faultless yourself.",
          "author": "spacegypsea",
          "created": 1634445976,
          "upvotes": 1,
          "replies": {
            "hgy72tc": {
              "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy72tc/",
              "text": "Yep. It’s frustrating because they’re always super type A and I’m very type B which of course they like me the least of the group and they find excuses to chew me out for nothing. Really aggravating",
              "author": "Dustin_Bromain",
              "created": 1634446547,
              "upvotes": 2,
              "replies": {
                "hgy7pqq": {
                  "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy7pqq/",
                  "text": "Based on what I’ve dealt with, I feel like it’s more that they wanna be seen as type A’s when they’re human like the rest of us. I’ve had some folks show up acting like the boss when they couldn’t pull in any weight. I like solo projects so much better….",
                  "author": "spacegypsea",
                  "created": 1634446949,
                  "upvotes": 1,
                  "replies": {
                    "hgy9s95": {
                      "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy9s95/",
                      "text": "Well it all comes out the same in my experience. The bossiness, the need to know what everyone else is doing 1000% of the time. The absurd group message texts at like 8am a week before anything is even due. Good grief. \n\nWhen you have a decent or a good group things works out but damn if there’s even one person like that things can get unfortunate.",
                      "author": "Dustin_Bromain",
                      "created": 1634448302,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgtwj96": {
      "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgtwj96/",
      "text": "Not really a horror story, but I had to write a paper about a book with a partner. Which is weird enough as it was - do I write a paragraph and then you write a paragraph - how does this work? But he was sitting Shiva almost the entire time.",
      "author": "Ophelia550",
      "created": 1634362959,
      "upvotes": 3,
      "replies": {}
    },
    "hgumvno": {
      "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgumvno/",
      "text": "Horror story from my undergraduate days: I was in an elective module in my first year that any undergraduate, regardless of degree subject, could take. The lecturer set a group presentation and invited people to form groups. Sadly I was off ill so wasn’t there to be claimed by friends (who, incidentally, thought I’d left the course). Cue me being assigned to someone on a different degree course with no idea who she was.\n\nTried multiple times to get in contact with her, met with no reply, so I got on with the presentation myself. Sent another frantic e-mail to her the day of the presentation, beseeching her to at least meet me in the library so we could run through the slides. She rocks up 15 minutes before the presentation to merge slides, no hint of remorse. I’d gone for standard slides, black text with white background. She’d gone for a pink and black patterned background and WordArt. I was speechless but left it as was so at least the lecturer could see that I didn’t have anything to do with it. In the end, we got a decent grade, but good grief, what an experience. \n\nGroup work: don’t do it, kids.",
      "author": "singinhallelujahtoem",
      "created": 1634384998,
      "upvotes": 1,
      "replies": {
        "hgy5cu4": {
          "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy5cu4/",
          "text": "wowwww… lol, wonder what became of her 😂",
          "author": "spacegypsea",
          "created": 1634445486,
          "upvotes": 2,
          "replies": {
            "hgzhmij": {
              "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgzhmij/",
              "text": "To be honest, this is the first time I’ve remembered her in about 10 years 😂 I hope she’s doing well but isn’t involved in group tasks in any way, shape, or form!",
              "author": "singinhallelujahtoem",
              "created": 1634479571,
              "upvotes": 2,
              "replies": {
                "hh00m4k": {
                  "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hh00m4k/",
                  "text": "😂 hope she’s working in a lab alone somewhere",
                  "author": "spacegypsea",
                  "created": 1634488029,
                  "upvotes": 2,
                  "replies": {
                    "hh01yih": {
                      "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hh01yih/",
                      "text": "😂😂",
                      "author": "singinhallelujahtoem",
                      "created": 1634488616,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgup75p": {
      "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgup75p/",
      "text": "Obligatory didnt happen in grad school, but I had a project in my undergraduate career that required us to create a scale, measuring a concept (I think ours was intelligence? I don't remember), and 3/4 of us was great. We communicated well, produced high quality work, etc etc. That one other person though.... did not communicate to any of us (we tried email, text, calling, everything), completed things half-assed the day before the deadlines, just all around a rough time. 🙃",
      "author": "killakidz7",
      "created": 1634386609,
      "upvotes": 1,
      "replies": {
        "hgy5iji": {
          "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy5iji/",
          "text": "One of my group members is MIA currently. I’m gonna be avoiding these people in upcoming quarters like no tomorrow.",
          "author": "spacegypsea",
          "created": 1634445583,
          "upvotes": 1,
          "replies": {
            "hgy5sej": {
              "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy5sej/",
              "text": "You're in grad school & their MIA? That's rough... I haven't had any group work yet, but my cohort is very small (competitive program) and we all get along well. Thankfully :)",
              "author": "killakidz7",
              "created": 1634445748,
              "upvotes": 1,
              "replies": {
                "hgy6nha": {
                  "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy6nha/",
                  "text": "Yup 😂Guess who will be ranting while they fill out their group evaluation cards? Moi!",
                  "author": "spacegypsea",
                  "created": 1634446278,
                  "upvotes": 2,
                  "replies": {
                    "hgy6s7e": {
                      "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy6s7e/",
                      "text": "Drag them. I did that to my group member. They were mad but I told em \"You literally ignored all of us, actions have consequences\"\nWas it petty af? Yes. Yes it was. Did they deserve it? Also yes",
                      "author": "killakidz7",
                      "created": 1634446362,
                      "upvotes": 2,
                      "replies": {
                        "hgy7hst": {
                          "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy7hst/",
                          "text": "I don’t see how it’s petty when they did nothing to deserve the credit for the work YOU did. This one lady in my group LITERALLY copied and pasted my work and switched the wording around. Are you fuckin’ kidding me, bitch? 😂I’d be understanding if it’s bc they don’t get the assignment. I’d be more than happy to help. But being lazy about it really irks me bc of how seriously I want to do well with my studies.",
                          "author": "spacegypsea",
                          "created": 1634446810,
                          "upvotes": 1,
                          "replies": {
                            "hgy7p0s": {
                              "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy7p0s/",
                              "text": "Oooooo man. Plagiarizing your work? That's fucked. Yeah, definitely drag em. Do not hold back. You've documented all of this, I assume?",
                              "author": "killakidz7",
                              "created": 1634446937,
                              "upvotes": 2,
                              "replies": {
                                "hgy7tun": {
                                  "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy7tun/",
                                  "text": "Yup, lol. I honestly just wanna say my piece and at least vent to my instructor with the evaluation cards. And then never have to work with them ever again.",
                                  "author": "spacegypsea",
                                  "created": 1634447021,
                                  "upvotes": 1,
                                  "replies": {
                                    "hgy8es6": {
                                      "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy8es6/",
                                      "text": "Sounds like a good plan. I vent to my PI, but him & I have been working together for years now. He's honestly amazing.",
                                      "author": "killakidz7",
                                      "created": 1634447393,
                                      "upvotes": 1,
                                      "replies": {
                                        "hgy8lzw": {
                                          "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy8lzw/",
                                          "text": "good on ya! everyone needs a support system :)",
                                          "author": "spacegypsea",
                                          "created": 1634447525,
                                          "upvotes": 2,
                                          "replies": {
                                            "hgy8n3q": {
                                              "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy8n3q/",
                                              "text": "110%",
                                              "author": "killakidz7",
                                              "created": 1634447545,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgv5a57": {
      "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgv5a57/",
      "text": "Last semester I had a guy not respond to any messages for two full weeks and then text us one hour before the deadline that his code wasn’t working and he couldn’t figure it out.",
      "author": "ikilluwitastick",
      "created": 1634395441,
      "upvotes": 1,
      "replies": {
        "hgy5ne5": {
          "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy5ne5/",
          "text": "so many excuses, so many lies. I had this one lady say she was sick from the vaccine the first time, food poisoned the second, then lastly her power went out 😂",
          "author": "spacegypsea",
          "created": 1634445663,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgvvoom": {
      "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgvvoom/",
      "text": "I worked with a Consortium for my first graduate publication. The logistics were hard because some professors couldn't use Google docs (not kidding, they didn't know HOW TO USE GOOGLE DOCS) so we had to email around copies of MS word documents and make edits using these copies passed around but that's not the best part. It was like a group of 40 professors across Universities and I kid you not I have met high school students smarter than some of the professors in the group.\n\nThe paper was published and is generating a lot citations but that was a holistic learning experience regarding academia.",
      "author": "Tangent_runner",
      "created": 1634407169,
      "upvotes": 1,
      "replies": {}
    },
    "hgwkvtd": {
      "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgwkvtd/",
      "text": "I had a group project where I was assigned to the group, we agree on a meeting location/time and I show up a few minutes early to the location to discuss our work.\n\nI don't see anyone else in my group.\n\nI wait a few minutes after the agreed meeting time and text/email the others to check in where they are. Half an hour after our agreed meeting time and me asking \"I don't see you guys, where are you\" I get no responses.\n\nLater that evening, I get an email from the professor that I'm not doing any of the work and the professor gives me a long, condescending rant about how I don't care about the coursework, how I need to take this seriously if I value my grade (I was doing fine in the class?) and forces me to set up a meeting to discuss my performance. My group members apparently reported me and had the nerve to show up to this meeting and say  \"he's not doing any of the work and I'm frustrated by it.\"\n\nImmediately they say this, I show them evidence showing that I prepared research for the group project and that I contacted them all via text and their email the moment I didn't see them and didn't get any response and they still tried to suggest I could have faked them. Sucks that that course was a waste of time anyway, but was required for my program.\n\nI can't tell you how many times I've had professors, administrators, or coworkers say some of the most condescending, shitty things during my time in academia and the thinly veiled racism you deal with so often makes it exhausting.",
      "author": "BSWolf777",
      "created": 1634418012,
      "upvotes": 1,
      "replies": {
        "hgy6hv4": {
          "link": "/r/GradSchool/comments/q95j5e/group_work_horror_stories/hgy6hv4/",
          "text": "Jesus-fucking Christ, man. I’m sorry you went through that. Not only did you deal with conniving classmates but racist micro aggressions. My condolences.",
          "author": "spacegypsea",
          "created": 1634446183,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}