{
  "sid": "qrl2u3",
  "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/",
  "title:": "How to study when you were a gifted child ?",
  "text": "Hello, I’m what we call a « former gifted child ». During all middle and high school, I never really worked and graduated with honors. But during college, I realized that I didn’t know how to study, and now I barely get my years.\nI somehow managed to get my law degree (thanks to Covid !), and I’m now in master. (Still in law)\n\nThe thing is, I feel like I’m gonna give up, I have no idea of how to study, I can barely focus, and I had my first grade which is really bad, 8/20..\nI can’t also learn things (each courses have like around 100 pages to learn so imagine..) because every time I’m in front of my lessons, it doesn’t seem logical to me, or I end up thinking about 4738271629 things because my brain is constantly overthinking everything (for instance while trying to work for an exam I can think about why there’s no McDonald’s on the side of highways…)\n\nHow can I learn how to study, when I’ve never did it in my entire life ?\n\nThanks you :)",
  "author": "iguessimacting",
  "created": 1636636549,
  "updated": 1637415134,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.59,
  "comments": {
    "hk7ah72": {
      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7ah72/",
      "text": "You can set small goals. I have adhd and that helps me a lot. Sometimes I can’t focus on anything and sometimes I get hyper focused. So I try respecting myself and setting realistic goals and sometimes rewarding myself with small things so I can relax. \n\nYou might be still a very intelligent person experiencing burnout. So self care is always important. Setting a healthy schedule and exercising helps with focusing a lot. \n\nBut that’s my main advice: realistic goals. We often want to do way more and when we fail the disappointment with ourselves makes everything worse.\n\nBut remember that discipline is something difficult (at least for me) to develop and keep. So it won’t happen over night. It’s a work in progress forever and needs patience. And keep in mind that every progress is a progress still.",
      "author": "PersonalityUnusual28",
      "created": 1636638936,
      "upvotes": 12,
      "replies": {
        "hk8udxq": {
          "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk8udxq/",
          "text": "Thanks you ! I feel that I lack of discipline, so those are great tips. Will do !!",
          "author": "iguessimacting",
          "created": 1636662178,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk7c51x": {
      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7c51x/",
      "text": "I had to sit down and make a plan on what to study when. With start and end times for each subject for each single day, lunch breaks, what practice tasks to do, what pages to read etc. \n\nThat's no small task btw, working out the schedule for one month alone took me about a full day by itself, since you have to got though the material and make sensible estimations for what takes how much time",
      "author": "Single_Blueberry",
      "created": 1636639737,
      "upvotes": 5,
      "replies": {}
    },
    "hk7faba": {
      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7faba/",
      "text": "I am in a similar former gifted child boat and am in my second semester of grad school. I recommend that during/after a lecture/module, brainstorm some questions that you think might be on the exam based on that material. Keep a list with the answers hidden (flashcards, toggle lists on Notion, etc.) and review them often. For example, I review the previous questions before starting/attending the next chapter/lecture. I learned this from a classmate and it's helped me a lot.",
      "author": "shivurs",
      "created": 1636641216,
      "upvotes": 4,
      "replies": {
        "hk7hlpr": {
          "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7hlpr/",
          "text": "It’s a bit hard to do in law school, except for big judgements :/ But I can do that for the titles of my lesson ! Thanks for the tip :)",
          "author": "iguessimacting",
          "created": 1636642259,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk7h66f": {
      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7h66f/",
      "text": "Start each semester by writing down your deadlines/exam dates on a giant planner. From there, work out how your progress needs to take place, eg by week 5 you need 5 chapters down. So you need to get through a chapter a week? \nCan you speed read? Learn to identify the key points in a paragraph, and mentally test your comprehension at the end of a page by summarising it to yourself.",
      "author": "Boopsboops42",
      "created": 1636642067,
      "upvotes": 2,
      "replies": {
        "hk7hqrs": {
          "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7hqrs/",
          "text": "Yes that’s a bit the issue for me, I speed read so much that I can’t actually remember what I just read, so I have to read the same page 2/3 times :( But I see your point here, I’m going to try it thanks !",
          "author": "iguessimacting",
          "created": 1636642321,
          "upvotes": 1,
          "replies": {
            "hk7hzk7": {
              "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7hzk7/",
              "text": "At the end of a chapter, put together a small summary of what you learned, use colours, draw, whatever it takes to get it to stick in your head. Colour code everything. Mind maps. Whatever works.",
              "author": "Boopsboops42",
              "created": 1636642430,
              "upvotes": 2,
              "replies": {
                "hk7iave": {
                  "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7iave/",
                  "text": "Thanks for the help !",
                  "author": "iguessimacting",
                  "created": 1636642569,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk7gdab": {
      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7gdab/",
      "text": "https://www.google.com.sg/amp/s/www.themuse.com/amp/advice/take-it-from-someone-who-hates-productivity-hacksthe-pomodoro-technique-actually-works",
      "author": "Boopsboops42",
      "created": 1636641706,
      "upvotes": 1,
      "replies": {
        "hk7hf01": {
          "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7hf01/",
          "text": "The thing with the pomodoro technique is that it’s asking a lot of focus for me, because the two first sessions go pretty well, then I’m taking the 5’ break and it turns in a 1h break !!",
          "author": "iguessimacting",
          "created": 1636642175,
          "upvotes": 1,
          "replies": {
            "hk7ho74": {
              "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7ho74/",
              "text": "I actually do 15min myself, drink some water, small break, 15 min, etc. Wash your face, get some mints, go back. Be flexible. But also if you are having such trouble, maybe try seeing if you actually have ADHD?",
              "author": "Boopsboops42",
              "created": 1636642288,
              "upvotes": 2,
              "replies": {
                "hkhqf6j": {
                  "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hkhqf6j/",
                  "text": "Took an appointment with a psychiatrist just to be sure, would be a relief actually !",
                  "author": "iguessimacting",
                  "created": 1636832489,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk7keqo": {
      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7keqo/",
      "text": "I get flash cards from quizlet and download a few I need to study. I like it because you can have 5-10 minutes study sessions anywhere. A good study tip is to see the material more often, across multiple days. It helps your learn the material better, instead of one long study session. I do this when I need to study. Learn how to learn, and work with your brain. I also was someone who rarely needed to work- even until graduating with my BA. Now I'm in a masters + 30 program and I had to learn how to study hahaha.",
      "author": "ForecastForFourCats",
      "created": 1636643511,
      "upvotes": 1,
      "replies": {}
    },
    "hk7prds": {
      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7prds/",
      "text": "Check out these books:\n\nLearning how to learn by Barbara Oakley  and Mindset by Carol dweck.\n\nI promise you won't regret.\n\nThose books litteraly change my life in some ways. \n\nYou can find the pdf versions on the internet.",
      "author": "Dismal_Instance_7106",
      "created": 1636645837,
      "upvotes": 1,
      "replies": {}
    },
    "hk7z788": {
      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk7z788/",
      "text": "Hi! ADHD and severe Learning disabilities here. Sounds like you just need to hack you brain a little on what works best for you. I can relate to this as I recently just had to figure out how to properly study and what everyone was giving me advice on did not work. This may not work for you since everyone is different but you could try! \n\n1. If you’re a visual person- white boards/notes on iPads are super helpful. I’ve literally created my entire room into pretty much a giant whiteboard with the wall adhesive they have on Amazon.\n\n2. Buy a figiter. Sounds stupid but if your brain needs something to focus on since it’s used to working in four different directions. keep it busy! \n\n3. Background music. Trying different focus music but turning it almost the entire way down where you can’t hear it also helps with your brain trying to figure out what to focus on. I thought this was weird but my therapist has a background in music therapy and it works! There are songs that have been processed in 8d and 16d, that some say help those either with ADHD or need support with focus.  You can go to youtube and put 8d or 16d in the search engine. \n\n4. Check out aliabdaal on YouTube- great study methods explained. \n\n5. Where you study will make a huge difference. Try studying in different places throughout the week! \n\n6. Turn that phone on silent or get a application blocking app! I also through mine in a different room. \n\n7. Also if you’re a procrastinator- that’s okay just utilize those times of hyper focus efficiently and manage your time. Break down your large tasks into small sections and start with the hardest one first. \n\nI hope this helps! If you have any questions feel free to message me. (:",
      "author": "Granny-dubs",
      "created": 1636649671,
      "upvotes": 1,
      "replies": {
        "hkhqttk": {
          "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hkhqttk/",
          "text": "Thank you so much ! But what’s a figiter ?\nConcerning the tips you said, I’m gonna try apply them but the thing is that at the beginning I’m full of good intentions, and I quickly fall in chaos, being distracted by my own brain !",
          "author": "iguessimacting",
          "created": 1636832666,
          "upvotes": 1,
          "replies": {
            "hkhs2bf": {
              "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hkhs2bf/",
              "text": "Figet tools! My brain works so if I physically have something to distract it, that chaos will focus on that while I can focus on reading. For example my figet tool is like a ring I wear with some beads that slide. Also standing up and working or like moving while working and reading may help. Just whatever your body is feeling allow that. And when you have thoughts that pop into your brain, keep a pen and paper next to you. Brain dump them on a list, get them out for later so you're not storing that in your head. We can only remember so much, so a bunch of busy thoughts can make it difficult to remember things. We literally need to get them out of our head. \n\nLastly, my friend does this that helps him. He said he will fill up a big glass of water and he has to read all of his work.until be finishes that drink. Then he can take a break, refill it and goes back to work. Essentially just techniques to quiet things down. \n\nThis is through my own personal experience so it may not work for everyone but I hope this can be somewhat helpful!! 🥰",
              "author": "Granny-dubs",
              "created": 1636833180,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk84e8b": {
      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk84e8b/",
      "text": "I'll just hit you with this, tall to your doctor. I had the exact same thing and 3 months ago I got diagnosed with ADHD. Doesn't mean you have ADHD but if you do medication will change your life, and your grades.\nr/adhd is good for reference",
      "author": "origional_esseven",
      "created": 1636651735,
      "upvotes": 1,
      "replies": {
        "hkhq8wd": {
          "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hkhq8wd/",
          "text": "Took an appointment to check it ! Honestly it would be a relief, but if I’m not i think it’s going to be harder for me :/",
          "author": "iguessimacting",
          "created": 1636832415,
          "upvotes": 1,
          "replies": {
            "hkhqk5x": {
              "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hkhqk5x/",
              "text": "Hopefully you get something. Also, sometimes doctors are weird about diagnosing adults so get a second opinion or see a psychiatrist specifically. If they're also certain it isn't then it probably isn't. But seriously, I had these same issues and now I meds I can just do school work and research for hours.",
              "author": "origional_esseven",
              "created": 1636832549,
              "upvotes": 2,
              "replies": {
                "hkhr3pj": {
                  "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hkhr3pj/",
                  "text": "I’m going to see a psychiatrist ! In France, there are considered as doctors so are the only ones who can give prescription. I’ll let you know, even if the appointment is in December unfortunately :/",
                  "author": "iguessimacting",
                  "created": 1636832782,
                  "upvotes": 1,
                  "replies": {
                    "hkhv7hr": {
                      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hkhv7hr/",
                      "text": "Yeah same in the US, psychiatrists give prescriptions. Primary care can also diagnose ADHD here though so that's where I was confused. Good luck with your appointment!",
                      "author": "origional_esseven",
                      "created": 1636834500,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hk8cuek": {
      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk8cuek/",
      "text": "this is how i discovered i have adhd! \n\ni never needed to study before college, then when i got to college i was also working full time so the chaos and full schedule kept me in a tight routine. first year of grad school and not working rn and boy is it hard. i considered dropping because i didn't sleep for 4 days. \n\nanyways, now im seeing a psychiatrist and counselor for everything and it's helped. you should talk to someone about your concentration issues, even if it's not adhd there are ways to help. \n\none thing that helped me is to just DO all the things my brain and body are telling me to do instead of work then after my house is sparkling clean, i've read 3 wikipedia articles, searched for flights to warsaw, and i've organized my socks or whatever i have nothing else to distract me and usually start working. i keep a planner and multiple to do lists bc crossing things off is satisfying to me. always keep notes while you read, either physically or split screen on your computer. always take notes, DO NOT copy paste. \n\ntake regular breaks, go on a walk to get coffee or read for fun, make sure to eat. dedicate time every day just to studying, literally put it in your calendar. \n\nif your phone is an issue i get it. i delete all my \"fun\" apps and it rarely works bc i'll just find something else distracting (and actually that's how i got addicted to reddit 🙄), but just having the phone away from your desk or study space is helpful.",
      "author": "ZackandCody420",
      "created": 1636655045,
      "upvotes": 1,
      "replies": {
        "hk8zud6": {
          "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk8zud6/",
          "text": "That last paragraph lol same with me. I get distracted with anything and then hyper focus on something totally random. And then I feel guilty for not focusing in what I should.",
          "author": "PersonalityUnusual28",
          "created": 1636664428,
          "upvotes": 2,
          "replies": {
            "hk90dfh": {
              "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hk90dfh/",
              "text": "ughhhh the guilt!! it makes me feel so bad sometimes, like a moral failing. i'll waste hours on something that was supposed to be a 5 minute break, realize how much time has passed, and then get so anxious/guilty.... which makes me STILL not do what i'm supposed to be doing lol it's a rough cycle.",
              "author": "ZackandCody420",
              "created": 1636664647,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkag8cf": {
      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hkag8cf/",
      "text": "Also chiming in to say that college is when I discovered I had ADD. In high school and even the beginning of undergrad, I never had any issues and studied very little but still got top grades.\n\nI would recommend seeing someone about it since you are having trouble focusing and from your description, it sounds like you have a lot of the symptoms of ADD. Sometimes when people are \"smart\" as kids, they fall through the cracks and don't realize they have a problem until they experience more challenging coursework.\n\nOtherwise: always have a plan. \"From x to y time I am going to study for this class. I will start by reviewing my notes and textbook and then doing these practice problems in the text book. Then I will check the answer key and analyze what I did right or wrong. I will also write down questions to ask my professor if I am not understanding a specific problem or concept.\"\n\nAlso, anki. Download anki and make flashcards. Anki changed my life. Anki is customizable and 1000X better than quizlet or any other flashcard app. It's also free.\n\nAnother note: eliminate distractions. Put your phone on silent, turn off the tv, block off reddit. My husband has the tv on 24/7 so I invested in some ear plugs to block out noise. With my ADD, any aberrant sounds immediately take me out of study mode. Like I can't even listen to music when I study because it will distract me. Ear plugs were a HUGE help.\n\nHaving a set plan makes a world of difference, but make sure your health is in order first and foremost.",
      "author": "BellaMentalNecrotica",
      "created": 1636688365,
      "upvotes": 2,
      "replies": {}
    },
    "hkb0wtg": {
      "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hkb0wtg/",
      "text": ">I can’t also learn things (each courses have like around 100 pages to learn so imagine..) because every time I’m in front of my lessons, it doesn’t seem logical to me\n\nOthers have commented on the jumpy brain part of things but this sentence reminded me of myself when I transitioned from high-school to university (and ended up dropping out on my first try).\n\nLooking back, I was way too focused on my (limited) notion of understanding and felt like I simply couldn't do exercises if I didn't already have an intuitive grasp of the subject. At least in mathematics, this approach turned out to be completely unfeasible beyond the first year or so - and by the time we got to measure theory and differential geometry I just gave up. Rather than training my brain to work with manifolds (by doing lots and lots of practice questions), I'd sit there whining about not \"understanding\" them.\n\nIn contrast, the students  who focused on replicating the steps shown in the lecture in their weekly assignments without overthinking it (and who accepted that there is no point in getting hung up on that one question on the exam that is designed to restrict straight As to the absolute top of the class), they survived and, in time, developed a mathematical intuition.\n\nMy academic advisor didn't comprehend why I'd drop out because, objectively, my grades weren't awful yet. But I had sabotaged myself with this \"It has to seem logical to me before I can do anything else with it\" mindset to a point where no salvaging seemed possible. Don't be me.",
      "author": "No-Heart-1454",
      "created": 1636700297,
      "upvotes": 2,
      "replies": {
        "hkb59r4": {
          "link": "/r/GradSchool/comments/qrl2u3/how_to_study_when_you_were_a_gifted_child/hkb59r4/",
          "text": "That’s exactly how I am too ! I feel like I have to automatically understand the lesson, and if I don’t on the first try, it’s over. \nBut I read all the advices I was given, and I think some may help !",
          "author": "iguessimacting",
          "created": 1636703686,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}