{
  "sid": "qhu3ak",
  "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/",
  "title:": "My department is expecting too much coursework.",
  "text": "The PhD program is less than 10 years old so I will chalk up to just general inexperience. And this is just a rant as I do plan on taking fewer courses in the future.\n\nBut the full time status of a grad school in my state and country is 9 hours. The department really pushes that students take 12 hours of course work instead. This is on top of teaching 2 courses or being an assistant for the equivalent amount of hours.\n\nWork itself isn’t the issue. It’s just that coursework itself if fairly small in the grand scheme of things but take up so much time that it’s impossible to plan around it. Meanwhile, the courses themselves suffer b/c of overcrowding. \n\n\nThe sheer number of classes needed to be taken is fairly high but the amount of courses are limited.  (This is young program) So classes are incredibly full while more than half the students are uninterested\nin the particular subject or faculty. Meanwhile, things like conferencing and publishing are much harder. I can’t even attend conferences because I have class five days a week and I can’t afford to miss more than 2 days in a row. \n\nThe very fact that I have to prioritize the mere butt-in-seat attendance over conferencing is insane. And all because there’s not a single free weekday.\n\nMeanwhile, there’s entirely too much work, even on the grad level. 12 hour courses + 15 hour work demands that usually exceed that anyway is ridiculous. Increased coursework just fell more like a sabotage than a benefit.",
  "author": "MinervaMinkMink",
  "created": 1635447878,
  "updated": 1636201047,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hif2wtu": {
      "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hif2wtu/",
      "text": "Coursework is often heavy at the beginning of PhD programs, depending on the field. In my experience, the first year is heavy coursework with on-boarding into research projects/rotations, the second year is more coursework but a bit lighter, then years 3+ are no coursework and 100% research (in addition to teaching/other funding obligations).\n\nGoing to conferences and such is more common after the coursework is done because it's at that time that a PhD student/candidate is actually integrated into the research enough for attending conferences to be productive. Going to conferences as a first year, although not that rare, is uncommon in my experience unless you have shown some incredible research potential or progress.",
      "author": "bayouboat",
      "created": 1635448727,
      "upvotes": 2,
      "replies": {
        "hifzdf4": {
          "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hifzdf4/",
          "text": "Thanks, that’s a good point.\n\nI have been conferencing for years. And though I’m a first year, I’m also a transfer. I was in a PhD program for two years where I conferenced once a semester and in summers (2-3 times a year). Then I took leave, bounced around as an adjunct, published a small amount when funded,  and only conferenced when invited. Then I officially left my university with a masters to join *this* PhD program. So maybe I’m not used to doing entry level things like this anymore. \n\nBut yea, you have a point. I could just wait it out. It does get better.",
          "author": "MinervaMinkMink",
          "created": 1635462390,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hifqtaw": {
      "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hifqtaw/",
      "text": ">The department really pushes that students take 12 hours of course work instead. This is on top of teaching 2 courses or being an assistant for the equivalent amount of hours.\n\nPer semester? Or per year? You weren't clear about that.\n\n12 hours + 2 TA courses per semester does seem excessive. If a public institution, could be they are pushing for the heavy coursework because state funding is tied to coursework hours.\n\n>The PhD program is less than 10 years old so I will chalk up to just general inexperience.\n\nOne of the important things to learn early in grad school is to *know what you don't know.*",
      "author": "raistlin65",
      "created": 1635458481,
      "upvotes": 5,
      "replies": {
        "hifswt7": {
          "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hifswt7/",
          "text": "Per semester. And yes, I knew that the program was young before coming. I’m not sure why you’d think I didn’t.\n\nAnd yes I knew that the full time load was 9 hours and that they would ask for 12 hours. But how many students would go against that mandate when the department pushes them to it? \n\nIt’s also a private university.\n\nIf it matters, the funding for the program is very good and is in a location that allows me to continue getting medical treatment with my regular doctors. Otherwise, I would have had to pause grad school. That combined with the faculty & it was a petty good deal. But yea, not many people go to grad school on a whim or by sheer luck. It takes some pretty intentional effort to apply, let alone to attend. So not entirely sure why you think I didn’t research before coming.",
          "author": "MinervaMinkMink",
          "created": 1635459441,
          "upvotes": 2,
          "replies": {
            "hiftnvg": {
              "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hiftnvg/",
              "text": ">And yes, I knew that the program was young before coming. I’m not sure why you’d think I wouldn’t.\n\nThat wasn't the point. \n\nOne of the things you'll (hopefully) learn as a PhD is not to rush to judgment on things you lack information about. It's a characteristic of good critical thinking.",
              "author": "raistlin65",
              "created": 1635459785,
              "upvotes": -1,
              "replies": {
                "hifw6hi": {
                  "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hifw6hi/",
                  "text": "I didn’t rush to judgement? Like you currently are. Nor did I ever say that I didn’t know *why* they were pushing coursework. They have their reasons, I just said that the ends do not justify the means. You also assume that I’m new to academia in general & I’m not.\n\nThey aren’t malicious in their push for 12 courses. If anything, it’s indicative of excitement and a desire to keep everyone close knit. The program itself isn’t very used to seeing their graduate students make independent contributions. So to prioritize course work over that independent thinking is fairly short sighted in a publish or perish profession. But in all honesty, I consider this ability to contrast their academic expectations with my own expectations, desires, and limitations as way more indicative of critical thinking skills than not. Better than just thinking “wow, better have no opinion or thought about the things that impede rather than benefit.”",
                  "author": "MinervaMinkMink",
                  "created": 1635460929,
                  "upvotes": 1,
                  "replies": {
                    "hifwlgs": {
                      "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hifwlgs/",
                      "text": ">I didn’t rush to judgement?\n\nDo I have to quote it again?\n\n\n\n\n\n>The PhD program is less than 10 years old so I will chalk up to just general inexperience.",
                      "author": "raistlin65",
                      "created": 1635461119,
                      "upvotes": -4,
                      "replies": {
                        "hify1h4": {
                          "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hify1h4/",
                          "text": "That wasn’t judgement?! That was an observation based on my own informed knowledge. I wasn’t guessing or judging at all here…it’s an explanation. Not exact or perfect, but certainly not a statement rooted in judgement or lack of information.\n\nLike when someone has trouble public speaking, I can chalk it up to nerves so as to explain, not to criticize.",
                          "author": "MinervaMinkMink",
                          "created": 1635461779,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hig29z3": {
      "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hig29z3/",
      "text": "I struggle with 9 and RA. It's brutal especially since I'm only doing 9 hours to qualify for the RA. I don't need more classes.",
      "author": "Antikythera22",
      "created": 1635463739,
      "upvotes": 3,
      "replies": {}
    },
    "hifvcrr": {
      "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hifvcrr/",
      "text": "How many courses in total seems to be the important question, not how many in a given semester. 4 courses / 12 credits is on the high end of normal, in my experience, but still within the normal distribution.",
      "author": "Eigengrad",
      "created": 1635460554,
      "upvotes": 3,
      "replies": {
        "hifwpnu": {
          "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hifwpnu/",
          "text": "Technically it’s 4 courses and the teaching seminar, which isn’t the actual class you teach. So in reality it’s more like 5 classes. 4 on discipline, one on pedagogy",
          "author": "MinervaMinkMink",
          "created": 1635461171,
          "upvotes": 1,
          "replies": {
            "hig2w9j": {
              "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hig2w9j/",
              "text": "That still seems pretty well within the normal distribution. \n\nThat said, you still didn't answer the question about how many total courses you have to take in the program.",
              "author": "Eigengrad",
              "created": 1635464027,
              "upvotes": 4,
              "replies": {
                "hj73rr6": {
                  "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hj73rr6/",
                  "text": "It’s not actually normal, I have 5 courses and usually it’s three. But maybe that just the humanities. Then again, it’s be different if the amount didn’t sabotage the actual experience of the course. It’s rare to have 15+ students in a grad course and yet all of them are like that here.",
                  "author": "MinervaMinkMink",
                  "created": 1635972132,
                  "upvotes": 1,
                  "replies": {
                    "hj748yv": {
                      "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hj748yv/",
                      "text": "That class size also seems within the normal distribution. \n\nNormal is a range: I said 4 classes is at the high end of the normal distribution. \n\nYou still haven’t answered how many total courses you need to take.",
                      "author": "Eigengrad",
                      "created": 1635972313,
                      "upvotes": 1,
                      "replies": {
                        "hj76hv6": {
                          "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hj76hv6/",
                          "text": "?! 15 is not normal. Especially for a private university. Usually it’s no more than 10. Again, this is the humanities and there’s reasoning behind that. You’re probably right about the course work but the number of students is definitely pretty high.",
                          "author": "MinervaMinkMink",
                          "created": 1635973176,
                          "upvotes": 1,
                          "replies": {
                            "hj7oz8m": {
                              "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/hj7oz8m/",
                              "text": "I don’t know why you post asking if things are normal to just disagree with anyone who has different experiences.",
                              "author": "Eigengrad",
                              "created": 1635980746,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "higrd69": {
              "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/higrd69/",
              "text": "Agree with others—that’s pretty on track with the expectations for the first few years of my program, too.",
              "author": "thatpearlgirl",
              "created": 1635475346,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "higwv3d": {
      "link": "/r/GradSchool/comments/qhu3ak/my_department_is_expecting_too_much_coursework/higwv3d/",
      "text": "I’m taking 12 course credits as well in my first year, along with TAing. Not required to take 12 but it’s how it worked out. It’s a fucking grind, for sure. Worst part for me is trying to fit in course assignments/grading/research into one hour chunks during the day.\n\nIdk about your program, but hammering course this first semester is setting me up to be done with classes come end on next fall if I take 9 credits next spring and fall semesters. It sucks right now but Ik it’ll be worth being done with classes in a year and a half",
      "author": "Psychological-Ear-32",
      "created": 1635478034,
      "upvotes": 2,
      "replies": {}
    }
  }
}