{
  "sid": "qd1hke",
  "link": "/r/GradSchool/comments/qd1hke/gap_year_before_grad_school/",
  "title:": "Gap year before grad school?",
  "text": "I'm thinking about a few options to take a gap year or two before grad school:\n\n\\- Apply for PhD program in my senior year -> take a gap doing SWE job -> grad school\n\nI'm thinking about this because I want to take a gap between academics and actually work for a bit, but do ppl going to grad school usually do that, since SWE is not really related to research?\n\n\\- Graduate -> do research for a year -> apply to grad school\n\nI'm thinking about this because that gives me more research experience before applying, although I kinda want to get done with the application process sooner during undergrad lol.\n\n&#x200B;\n\nAny other options for a gap year before grad school?",
  "author": "guckmalmensch",
  "created": 1634850513,
  "updated": 1635185472,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hhjiisy": {
      "link": "/r/GradSchool/comments/qd1hke/gap_year_before_grad_school/hhjiisy/",
      "text": "I went straight from undergraduate to graduate school, and one thing I noticed among my peers was that those who took gap years were better equipped to cope with the stressors and rigor of grad school. I didn't have much time to consolidate all that I had learned in college, and also lacked experience with the professional environment that graduate school entails. Furthermore, I felt the lack of a break from the hardcore academic mindset made me more prone to burnout - I often feel like I've been going for a decade straight with few breaks.\n\nThat break also provides perspective - you can take your head out of the racetrack and take time to examine what it is you want, from a degree and for your life. The luxury of time to reflect on these things goes a long way in grad school, where you often have to advocate for your own needs and professional development. I found it very difficult to let go of the perspective of \"I'm a student\", which made me more vulnerable to power dynamics and less likely to establish firm boundaries around my time and energy.",
      "author": "Qunfang",
      "created": 1634851537,
      "upvotes": 21,
      "replies": {
        "hhjudr8": {
          "link": "/r/GradSchool/comments/qd1hke/gap_year_before_grad_school/hhjudr8/",
          "text": "I took a gap year and what you said is 100% true.",
          "author": "okwhatsgoingon11",
          "created": 1634856852,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "hhjvcap": {
      "link": "/r/GradSchool/comments/qd1hke/gap_year_before_grad_school/hhjvcap/",
      "text": "I took a 4 year gap between undergrad and grad school to do full time research in a lab. I highly recommend it as I am much much better prepared to not only do the work on grad school, but to know what I want to focus on.\n\n\nGood luck!",
      "author": "Blaidd-XIII",
      "created": 1634857306,
      "upvotes": 5,
      "replies": {}
    },
    "hhkfh1n": {
      "link": "/r/GradSchool/comments/qd1hke/gap_year_before_grad_school/hhkfh1n/",
      "text": "I took 5 years off working because I wasn’t certain about what program I wanted to do. I’m now in a professional masters and it was 100% the right choice. It can help solidify what you want out of school and it gave me more confidence in my own intelligence. I don’t struggle with imposter syndrome nearly as much as in my undergrad. It also taught me a lot of interpersonal work skills and people management that helped after school as well, so even if you don’t work in research there’s still a lot you can learn. I would recommend if you’re on the fence, it can also help you get a start on loans/saving up.",
      "author": "ThatVexingOwl",
      "created": 1634866771,
      "upvotes": 2,
      "replies": {}
    },
    "hhligos": {
      "link": "/r/GradSchool/comments/qd1hke/gap_year_before_grad_school/hhligos/",
      "text": "I took a gap year doing something unrelated to research. I’m very happy I did. Keep in mind that if you want it to be only 1 year, you’ll probably be applying before you’ve had much employment/research experience. And you can’t assume a program will allow you to apply during senior year and defer for a year. Not all schools have funding structures that support that.",
      "author": "passerem",
      "created": 1634891823,
      "upvotes": 1,
      "replies": {
        "hhm1bhv": {
          "link": "/r/GradSchool/comments/qd1hke/gap_year_before_grad_school/hhm1bhv/",
          "text": "Did u apply before or after the gap year? I just feel like if i apply later, it would be much harder to get rec letters since im not in school anymore",
          "author": "guckmalmensch",
          "created": 1634905758,
          "upvotes": 1,
          "replies": {
            "hhn0b2d": {
              "link": "/r/GradSchool/comments/qd1hke/gap_year_before_grad_school/hhn0b2d/",
              "text": "I applied in fall of my gap year, so it wasn’t like I’d been out of school long. My professors still remembered me well. Something that some people do is ask for future letters before leaving undergrad. \n\nMy program doesn’t offer deferrals, so I would’ve had to reapply if I didn’t go right away.",
              "author": "passerem",
              "created": 1634920654,
              "upvotes": 1,
              "replies": {
                "hhna80k": {
                  "link": "/r/GradSchool/comments/qd1hke/gap_year_before_grad_school/hhna80k/",
                  "text": "I see. Thanks for the info:)",
                  "author": "guckmalmensch",
                  "created": 1634924693,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhnsrkz": {
      "link": "/r/GradSchool/comments/qd1hke/gap_year_before_grad_school/hhnsrkz/",
      "text": "I recommend that you apply to PhD programs during your gap year or after working for a year. Being in the workforce may shift your perspective and desires in the longterm, leading to a reconsideration of what you ultimately want to do.",
      "author": "jtg_95",
      "created": 1634932258,
      "upvotes": 1,
      "replies": {}
    }
  }
}