{
  "sid": "c1kgwv",
  "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/",
  "title:": "Someone just published the answer to a problem I was working on for my thesis",
  "text": "I am at a complete loss for words. I work in mathematics and have been working on a particular problem for almost a year. I was not expecting much in terms of competition given how specific and relatively inactive my field is (the line of research I am working in really has papers typically with \\~5 citations per year). Moreover, there is much breadth in terms of the types of problems people work on in this field. Now, lo and behold, not only is a paper published this month on the exact problem I am trying to solve, but they do it more or less THE SAME WAY I WAS DOING IT (i.e., I can't publish an \"alternative proof\" type paper or anything). I am picking up the pieces and looking towards finding another problem in this area which maybe I can apply my work to... but FUCK.\n\n&#x200B;\n\nJust needed to vent.",
  "author": "BayesOrBust",
  "created": 1560754878,
  "over_18": false,
  "upvotes": 389,
  "upvote_ratio": 0.99,
  "comments": {
    "ergb7pw": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ergb7pw/",
      "text": "Um your advisor didn’t realize there are a lot of ppl working on this particular problem?",
      "author": "Hankune",
      "created": 1560832366,
      "upvotes": 0,
      "replies": {
        "ergewlb": {
          "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ergewlb/",
          "text": "There wasn’t a lot of people, only three others at a university overseas",
          "author": "BayesOrBust",
          "created": 1560836406,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "erfqlgc": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erfqlgc/",
      "text": "Sorry about this.  I too am in Mathematics and this post just made me do a quick Google search to see if there are any recent papers solving my problem.  Good luck on altering your thesis work.",
      "author": null,
      "created": 1560815254,
      "upvotes": 2,
      "replies": {}
    },
    "erff2ua": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erff2ua/",
      "text": "Hey, if it can happen to Leibnitz and Newton, it can happen to anybody.  \n\nNot to make light of your situation, but you will always have a story of how you applied your work to another problem and rocked your doctorate after this setback.",
      "author": "TheGreatRao",
      "created": 1560806848,
      "upvotes": 7,
      "replies": {}
    },
    "ereyoa5": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ereyoa5/",
      "text": "Stinks, OP.  Sorry to hear that - I know from experience that it can be a gut punch when one learns of a scoop.  Dust off, refocus and keep grinding.  Also do try to document your work as best as you can, and let your adviser know what happened so they can recognize that you, too, had original contributions on this but were beat to publishing.",
      "author": null,
      "created": 1560795925,
      "upvotes": 1,
      "replies": {}
    },
    "erew719": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erew719/",
      "text": "I'm starting my PhD in math this fall and I now have a new fear going into it. That sounds super rough. What was your field? Your username gives me some clue but I'm curious.",
      "author": "twoface117",
      "created": 1560794276,
      "upvotes": 6,
      "replies": {
        "erf6fpu": {
          "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erf6fpu/",
          "text": "Stochastic processes and control theory",
          "author": "BayesOrBust",
          "created": 1560801110,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ereub0m": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ereub0m/",
      "text": "Something like this happened to a grad student friend of mine. He had everything set experiments, excellent results, replications; his advisor was very impressed with it. Then Hurricane Maria hit and we were out of the lab for a month and without power for a few more. This result in a significant delay in his project. Just when he was in the middle of writing his dissertation, he received a newsletter from a journal with a paper recomendation. This paper was almost exactly like his project. After a few weeks of crying and been angry he decided to pivot to something similar and even was able to use some of his old results. \n\nI know this can be heartbreaking, at least you know you can make quality research. Hope you find something new and exciting to work on. Best of luck!",
      "author": "boriwave101",
      "created": 1560793030,
      "upvotes": 6,
      "replies": {}
    },
    "eret1gf": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/eret1gf/",
      "text": "This sucks, especially in your field! I just finished my PhD in a social science and found out that someone I met at a conference a couple of years back had scooped my best finding. It had had only emerged right before I submitted and I had to rush to put the chapter together. We didn't realise we were working on the same thing but there were a *few* differences in the approach and I had an angle she hadn't thought of. We've agreed to coauthor the follow-up to her paper, assuming it gets published soon, so it might be worth reaching out! My situation doesn't isn't nearly as bad as yours but it happens a lot and people understand. And, on the bright side, you're clearly doing something right if an idea you were working on and its solution got published. Hope it works out for you :)",
      "author": "Yung_Don",
      "created": 1560792183,
      "upvotes": 3,
      "replies": {}
    },
    "eren088": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/eren088/",
      "text": "I would suggest focusing on a similar topic rather than trying to find a completely different problem.",
      "author": "King_Freedom",
      "created": 1560788126,
      "upvotes": 4,
      "replies": {
        "erepl3s": {
          "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erepl3s/",
          "text": "That’s the plan, hopefully I can find an interesting generalization.",
          "author": "BayesOrBust",
          "created": 1560789885,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ere5uvw": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ere5uvw/",
      "text": "I don't know your university's stance on this, but can you collaborate with this person for follow-up papers? At worst so that the same thing doesn't happen again (you work on two separate things), at best so that you can unite your efforts to put out twice as many papers.",
      "author": "needlzor",
      "created": 1560774642,
      "upvotes": 8,
      "replies": {}
    },
    "ere5j6s": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ere5j6s/",
      "text": "First, I'm so sorry this happened to you. \nI don't know what you're doing but.. Could you approach it in a way based on real world applications and/or find some limitations through simulation? Also since they published, do they mention in their discussion further advances, next steps etc...?",
      "author": "reddit_AP2018",
      "created": 1560774312,
      "upvotes": 2,
      "replies": {}
    },
    "ere3c6q": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ere3c6q/",
      "text": "This is my worst nightmare. I'm sorry to hear.",
      "author": "krypton_1te",
      "created": 1560771900,
      "upvotes": 7,
      "replies": {}
    },
    "erdyn6w": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erdyn6w/",
      "text": "When someone publishes your work before you is like hitting on someone only to find they're already in a relationship. You didn't get what you wanted, but you have some small satisfaction that your standards are high enough that you're aiming for things that have actual demand.",
      "author": "ashdnazg",
      "created": 1560765278,
      "upvotes": -8,
      "replies": {
        "eremoz4": {
          "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/eremoz4/",
          "text": "To be honest, I am a bit happy to see the idea was popular. I got pretty far as a singular masters student against three hardened professors who might have also had a leg up on me in terms of when they started.",
          "author": "BayesOrBust",
          "created": 1560787912,
          "upvotes": 10,
          "replies": {
            "erf0xzn": {
              "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erf0xzn/",
              "text": "Exactly! Keep up the good work and you'll get far :)",
              "author": "ashdnazg",
              "created": 1560797436,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ere5sbg": {
          "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ere5sbg/",
          "text": "While your analogy is a bit strange you are spot on. You know you have a finger on the pulse of your field when your ideas get published a few months before you manage to get them out. In OP's case, he had already done the work which means that he was so in tune with the zeitgeist of his field that they were probably working in parallel on the same thing.",
          "author": "needlzor",
          "created": 1560774568,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "erdv5dl": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erdv5dl/",
      "text": "Ok, this may not be the worst thing.  You know this topic in and out odds are.  Read that paper carefully and examine what is reported.  Did he leave out any assumptions?  Did he leave on any special cases where it fails?  If he did then there is your thesis.  Look for cases where it fails and use your thesis to highlight them.  \n\nNot an expert on various areas of math but let's say you developed a new way of predictive modeling and a paper showing how the modeling method worked was published while I was research it.  The next step here I would do is to torture that damn method to find it's weakness.  Does it work with sparse datasets?  Does it work with data with a great deal of heteroskedasticity.   Does it work with near zero variance data?  Does it work with high multicollinearity?   See where it fails, demonstrate why it fails and you have a new thesis that still uses most of your work.",
      "author": "engelthefallen",
      "created": 1560759290,
      "upvotes": 147,
      "replies": {
        "ere0veb": {
          "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ere0veb/",
          "text": "It being mathematics he is pretty much screwed especially if the paper solved it the same way sadly :/.\nIf he had a different method of proof that could have be salvagable. \nBut the same theorem and proof. That just sucks.\n\nEdit: OP you can seek to perhaps generalise what you've done. A similar approach could help you work the general case.",
          "author": null,
          "created": 1560768718,
          "upvotes": 78,
          "replies": {
            "eremgv4": {
              "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/eremgv4/",
              "text": "Yeah, generalizing it in some way is what I am currently looking towards",
              "author": "BayesOrBust",
              "created": 1560787754,
              "upvotes": 15,
              "replies": {}
            },
            "ere49jt": {
              "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ere49jt/",
              "text": "I'm not sure I agree. Often after a discussion with peers and scribbling on the whiteboard/notepad/etc. we will go away and write a bit. Then when we come back we find we have subtly different definitions or thought of special cases that the other didn't. So in some cases a \"proof\" may have counter-examples the author didn't think about and reviewers/community members didn't notice.",
              "author": "tfburns",
              "created": 1560772955,
              "upvotes": 14,
              "replies": {
                "ere4dsa": {
                  "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ere4dsa/",
                  "text": "Yeah but OP said someone proved the same theorem and used the same method of proof. \nSo unless the paper is wrong. I don't know OP can do.",
                  "author": null,
                  "created": 1560773085,
                  "upvotes": 19,
                  "replies": {
                    "ere5wnc": {
                      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ere5wnc/",
                      "text": "True, and what I'm saying is that it could be. Probably it isn't, but it's possible that they missed a special case OP has been thinking about. Alternatively, OP might have ideas/work which could extend/build-off the recently-published paper.",
                      "author": "tfburns",
                      "created": 1560774692,
                      "upvotes": 7,
                      "replies": {
                        "ere6102": {
                          "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ere6102/",
                          "text": "Yeah. I mean  I dont think all is lost for OP. When in doubt, generalise and categorify xD.",
                          "author": null,
                          "created": 1560774812,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "erduym5": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erduym5/",
      "text": "It doesn't diminish the work you did.  You still learned a lot and produced something, that by itself is good for *you*.  Maybe a year from now you'll think of a good follow-up idea on that research, and since you're well-acquainted with it you can work on it.  You may even have found a collaborator.",
      "author": "TakeOffYourMask",
      "created": 1560758980,
      "upvotes": 30,
      "replies": {}
    },
    "erdulya": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erdulya/",
      "text": "Ack! This is my biggest fear. Sorry it happened to you",
      "author": "LadyLagomorph",
      "created": 1560758394,
      "upvotes": 29,
      "replies": {}
    },
    "erdsmi4": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erdsmi4/",
      "text": "I am so, so sorry. That is... well, you’re a mathematician, you’d know the odds! I’m sorry, that sucks so much.",
      "author": "artieshaw",
      "created": 1560755312,
      "upvotes": 34,
      "replies": {}
    },
    "erdsh6j": {
      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erdsh6j/",
      "text": "That happened to my adviser the week before he was going to publish. It totally messed up his phd track.",
      "author": "ElectricalIons",
      "created": 1560755095,
      "upvotes": 175,
      "replies": {
        "ere734n": {
          "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ere734n/",
          "text": "But on the bright side it sounds like he did graduate and get a professorship somewhere, so not all is lost",
          "author": "BandGeek1223",
          "created": 1560775851,
          "upvotes": 83,
          "replies": {
            "ereenzk": {
              "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ereenzk/",
              "text": "No, he didn't get his phd. He did get a teaching job at a university, though with a master's.",
              "author": "ElectricalIons",
              "created": 1560782163,
              "upvotes": 77,
              "replies": {
                "erfnarb": {
                  "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erfnarb/",
                  "text": "Poor guy. That's still good he landed on his feet though.",
                  "author": "PeachyKeenest",
                  "created": 1560812724,
                  "upvotes": 11,
                  "replies": {}
                },
                "ergax8s": {
                  "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ergax8s/",
                  "text": "That sounds really weird. Why not get a PhD if you are one week behind? Your advisor discovered results independently of the other researcher(s)- that is still often of value.",
                  "author": "inventor1489",
                  "created": 1560832069,
                  "upvotes": 2,
                  "replies": {
                    "ergcgux": {
                      "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ergcgux/",
                      "text": "I don't know the full story, I just know he would have had to stay for a long time to get the degree at that point.",
                      "author": "ElectricalIons",
                      "created": 1560833685,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "erebija": {
              "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/erebija/",
              "text": "He probably didn’t do it in this job market though, unless he’s a pretty new prof.",
              "author": "eukomos",
              "created": 1560779712,
              "upvotes": 19,
              "replies": {
                "ereep56": {
                  "link": "/r/GradSchool/comments/c1kgwv/someone_just_published_the_answer_to_a_problem_i/ereep56/",
                  "text": "It was a long time ago, correct.",
                  "author": "ElectricalIons",
                  "created": 1560782187,
                  "upvotes": 14,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634066757
}